{
    "rating": 8.2,
    "release_date": "1978-12-22",
    "num_reviews": 190,
    "genres": [
        "Sci-fi"
    ],
    "summary": "This remake of the classic horror film is set in San Francisco. Matthew Bennell (Donald Sutherland) assumes that when a friend (Brooke Adams) complains of her husband's strange mood, it's a marital issue. However, he begins to worry as more people report similar observations. His concern is confirmed when writer Jack Bellicec (Jeff Goldblum) and his wife (Veronica Cartwright) discover a mutated corpse. Besieged by an invisible enemy, Bennell must work quickly before the city is consumed.",
    "reviews": [
        {
            "content": "I saw this after seeing Edgar Wright recommend this over the original. In my opinion the original is better. The original is a lot tighter and the pacing is better. I'd consider the original a near masterpiece. This starts out great and original as far as remakes go but then becomes a re-hash by the numbers but with worse pacing. Though I do love the cinematography and the colors. That part is stronger in the remake. If you choose one film, go with the original.",
            "review_date": "2023-02-08",
            "source": "rt"
        },
        {
            "content": "A brilliant, ambitious, arthouse movie type remake of the pulpy potboiler by Don Seigel; about alien imposters taking over the planet.  Following the huge success of Star Wars and Close Encounters in 77 this was part of the push in the late 70s to escalate sci-fi to serious, A-List Oscar fare.  Phillip Kauffman the director escalates Invasion of the Body Snatchers from a comic book type story to a dark, terrifying, Kafkaesque allegory/nightmare about the terrors of urban life; with all it's soul-crushing isolation and predation.  The first Invasion was about suburban conformity, the second one is about urban anomie, much in the same vein as Rosemary's Baby or Escape From New York.  Kauffman uses shadowy cinematography and trick Hitchcockian camera angles to create a shadow world of the aliens, like an evil anti-matter world in reflection to ours.  The cast is a who's who of sci-fi icons, Veronica Cartwright (Invasion, Witches of Eastwick, Alien), Jeff Goldblum (Threshold, Jurassic Park, Earthgirls Are Easy and The Fly) and Donald Sutherland (Threshold, The Hunger Games franchise, PuppetMasters).  Iconic scenes abound in this movie; including the horrifying greenhouse scene where the wailing, embryonic pod people start to rise up and morph into their human prey; the banshee-scream of the aliens, including the horrific scene at the ending when Sutherland screams at Cartwright, and the gutwrenching abomination of the street musician being blended with his dog; and becoming a dog-man freak.  In a stunt casting master stroke Kauffman casts Leonard Nimoy as the leader of the pod people.  (Because why wouldn't stoic Spock be the king of the heartless alien imposters?). The ending by the way was improvised.  According to a recent interview with Veronica Cartwright Kauffman and company handn't planned a formal ending; so on a whim he told Cartwright to walk up to Sutherland and just engage in a mutual congratulations type conversation.  Cartwright thought that's all that would happen; she had no idea Sutherland would suddenly erupt into a wailing alien scream!  So her reaction in that scene is spontaneous!  (Ridley Scott also punked her in the same way in Alien, a year later; during the chestburster scene. While Cartwright was aware that an alien would shoot out of John Hurt's chest, she had no idea there was a tube pointed right at her face which would shoot out a  huge jetstream of blood right at her head!  Her screams in that scene, and then her flipping back in her chair and falling on the ground, were completely spontaneous and genuine!  It seems Nervous Nelly Veronica Cartwright was the target of a few mischievous directors back then!) This movie is a giant in the sci-fi cannon.  Famed critic Pauline Kael even said \"this just may be the best movie of its kind ever made!\". High praise indeed!  And highly recommend!",
            "review_date": "2023-01-18",
            "source": "rt"
        },
        {
            "content": "One of the best remakes ever!  Where the original imposter takeover movie was about social conformity in the suburbs; this one's about anomie and alienation in the big cities; and it's just as pungent and poignant as ever; and much more terrifying.  Kauffman creates a few iconic horror movie moments of his own with this movie; from the nuclear scream of the pod people; to the dog-man hybrid; to the wonderful scene when protagonist Matthew Bennell sees a horde of pod people rising up from the greenhouse floor; writhing and wailing like embryonic ducklings emerging from their eggs.  Many terrifying moments; and Kauffman does a brilliant Hitchcockesque job of using each shot to create dread.  Highly recommended.",
            "review_date": "2022-12-05",
            "source": "rt"
        },
        {
            "content": "\"| Ratings Categories |\n{Characters (9/10) ; Cinematography (8.5/10) ; Plot (9/10) ; Acting (9/10) ; Pacing (8.5/10) = 88%}\"",
            "review_date": "2022-10-10",
            "source": "rt"
        },
        {
            "content": "Philip Kaufman nails the ability to make his audience understand and feel paranoia. If I wasn't already aware of this film's cultural impact and went into this film blind, I would have been like the characters and wondered if this was all in their head, or a real threat, which isn't made obvious until the second half of the film. Not surprised to see that the 70's yet again produced a work of horror art instead of a cheap scare.",
            "review_date": "2022-10-04",
            "source": "rt"
        },
        {
            "content": "The original wasn't perfect but this one goes in the wrong direction right away.  The seeds floating like ragweed makes no sense, inside small asteroids would explain how they survived the heat of entry into the atmosphere.  The science part of science fiction.  The original was slow paced but it also was a brisk 80 minute runtime you didn't really feel the drag much.  But this lags on for TWO HOURS! SPOILER ALERT! THE OTHER SHOE ENDING: IF YOU DON'T WANT TO KNOW THE ENDING THEN STOP READING:   The last two survivors destroy a seedpod center and meet up hours later. But nope he was replaced by a Body Snatcher in the short time they were apart?  Why because I believe most media in the 1970s was trying to destroy hope and joy.  I never read the damn book, maybe the aliens win in the end but that just makes the book bad.  Considering it was an allegory for panic of Russian Communism, which means if that's how it ends that we are doomed to lose the cold war.  But I doubt the book ends that way, it's that the 1970s hates happy ending.",
            "review_date": "2022-09-16",
            "source": "rt"
        },
        {
            "content": "This is a true classic of the sci-fi horror genre, a film about an alien invasion that's more insidious and methodical than loud and violent. For our protagonists the story unfolds like a waking nightmare as more and more people become apparent imposters, resembling real people, including people our protagonists knew, but behaving in a way that's... off... uncanny. That the imposters are following a unified agenda also becomes increasingly apparent. The acting, practical effects, distinctive sound effects, and a unique soundtrack all help to sell the horror scenes. This film also has one of the most chilling and memorable endings I've seen. All in all, it's highly recommended.",
            "review_date": "2022-09-10",
            "source": "rt"
        },
        {
            "content": "There is nothing fancy going on in this movie, not a crazy and flashy alien invasion like modern viewers might expect, but a silent and sneaky one.\n\nI have truly enjoyed the outstanding direction, interesting shots contribute to an eerie mood as the action is set. The actors are all legendary, and their convincing performance contributes to a great deal of tension ramping up.\n\nUnfortunately the last act of the movie is quite weak. It is a bit too slow, resulting in a sort of slump, which leaves time to notice some poorly thought sequences and precarious narrative devices.\n\nA very solid entry in the sci-fi genre nonetheless, and quite a fitting critique to our society.",
            "review_date": "2022-09-06",
            "source": "rt"
        },
        {
            "content": "5th Favorite Movie!  Loved the ending:)",
            "review_date": "2022-09-05",
            "source": "rt"
        },
        {
            "content": "The slow pace and the twist in the finale were quite of a bummer but 'Invasion of the Body Snatchers' packs good perfomances by it's talented cast, as well as enough suspense and noir horror. (7/10)",
            "review_date": "2022-07-27",
            "source": "rt"
        },
        {
            "content": "Great '70's Horror Flix!!",
            "review_date": "2022-07-23",
            "source": "rt"
        },
        {
            "content": "Holds up well after all these years. Still super creepy.",
            "review_date": "2022-07-07",
            "source": "rt"
        },
        {
            "content": "This film is a true classic that any motion picture lover should experience, and maybe even every american? I have now seen this movie twice. The first time I enjoyed the horror of the film and the story being told. On second viewing I enjoyed it for a different reason. I no longer felt the scare or horror but yet the story was still compelling and I started to think more deeply about what was happening in the film. Questioning and looking at things I had never thought about before. Pushing me to ask questions and think more deeply about the film and its implications. One example being American society and mental health/emotion within it. A true master piece that delivers on every sense of what it means to be art.",
            "review_date": "2022-07-04",
            "source": "rt"
        },
        {
            "content": "I first saw this when I was 12 and thought that dog was cool, and the screams were crazy. It's 2022 and this movie was even better!!! Mr. Spock as a zombie?!!!",
            "review_date": "2022-07-02",
            "source": "rt"
        },
        {
            "content": "Incredibly strange, scary, & engrossing",
            "review_date": "2022-06-26",
            "source": "rt"
        },
        {
            "content": "I haven't seen the original, but it must be a strong piece of work to match this. Kaufman pulls out all the stops to throw us into a maelstrom of paranoia and powerlessness. A distinctly American horror show with vivid performances.",
            "review_date": "2022-05-24",
            "source": "rt"
        },
        {
            "content": "I say this as a big fan of the 1956 film. I have nothing against remakes, some are great, some are good, some are bad, some are downright awful. Fortunately Invasion of the Body Snatchers(1978) is one of the truly great ones, one of those rarities that not just lives up to the original film but almost beats it.\n\nThe only reason why it doesn't quite is because the 1956 film does more with the change of the townsfolk. That said, it is a very well made film, with the special effects enhancing the mood rather than distracting from it and the scenery and cinematography striking. The make up is also outstanding.\n\nInvasion of the Body Snatchers also has a strong score that just adds to the tension and suspense, a compelling story especially the ending, in fact for me I marginally preferred the ending here, the dialogue is intelligent and well-delivered and the direction is very fine.\n\nThere is some great acting too. Donald Sutherland and Brooke Adams are strong leads, while Jeff Goldblum steals the scenes he appears in. Overall, a great film and worthy remake. Anybody who has not seen the Invasion with Craig and Kidman, it may be a good idea to keep it that way. 9/10 Bethany Cox",
            "review_date": "2022-03-27",
            "source": "rt"
        },
        {
            "content": "Every generation gets the Invasion of the Body Snatchers they deserve.\n\nThe fifties got the McCarthy referencing pod people. \n\nThe nineties got alienation and a bleak final scene.\n\nAnd I guess the 2000s got The Invasion.\n\nBut the seventies?\n\nThe pre-millennial tension and end of the world coming soon seventies got director Phillip Kaufman's blast of pure dread, working with talents like cinematographer Michael Chapman (who ran the camera on The Godfather and Jaws before creating the look of movies like Raging Bull, The Fugitive and directing All the Right Moves and The Clan of the Cave Bear) and sound designer Ben Burtt, the man who gave Star Wars all its well-remembered noises. As for the effects, as many of them as possible were done in camera.\n\nA species has made its way to Earth and one of the first people to notice is Elizabeth Driscoll (Brooke Adams), who wakes to find her husband Dr. Geoffrey Howell (Art Hindle) is no longer the man that she's spent so many days and nights with. The species -- do I have to spoil it for you -- takes over humans and assimilates them.\n\nA co-worker, Matthew Bennell (Donald Sutherland) wants to introduce Elizabeth to self-help author Dr. David Kibner (Leonard Nimoy) as a way of helping her handle this strange situation, but on the way, a man runs through the street screaming, \"They're coming! You'll be next!\" before being chased by a crowd and killed by a car.\n\nThat mystery man is Kevin McCarthy, the star of the original film, who one supposes has been running through America since the end of the last film. Even before the movie was finished, McCarthy told Kaufman that this movie was better than the one he was in. You can also see original director Don Siegel as a taxi driver later in the film.\n\nThe seventies were the me decade. So David believes that people behaving so different is their response to stress while Elizabeth just thinks this is how she's being told her relationship is over. The truth is so much weirder as people begin to find partially formed doppelgangers of themselves and their friends.\n\nBy the end of the film, children are being taken for duplication, strange priests (Robert Duvall) swing as the world ends, dogs appear with human heads, women disintegrate in their lovers' arms -- the film takes the basic ideas of the original and makes them as horrifyingly real and unreal as they can be at the very same time.\n\nPlus, there's Jeff Goldblum and Veronica Cartwright, who between this and Alien really was on the forefront of late 20th century science fiction movies.\n\nWhile Pauline Kael said that this \"may be the best film of its kind ever made\" and Variety wrote that it \"validates the entire concept of remake,\" Roger Ebert derided Kael's love for the remake. But over time, this has become the example of a sequel that's beyond the original in so many ways.\n\nThe true terror of this movie is the ending, which upset me utterly as a child. I'd never seen a movie end this way. Only Kaufman, writer W.D. Richter and Donald Sutherland knew how the film was going to end, so when Sutherland screams at Veronica Cartwright, her reaction is genuine. The hopeful ending that was scripted was never shot, because Kaufman knew that if the studio had the option, they'd pick that, just like they did with the first version of this story.\n\nI'm so excited to have Invasion of the Body Snatchers in my library. It's a movie that transcends era and genre and one I recommend that you view now if you haven't and even if you have.",
            "review_date": "2022-02-11",
            "source": "rt"
        },
        {
            "content": "Philip Kaufman's Invasion of the Body Snatchers, based on the Jack Finney novel, is as creepy a science fiction film as one could imagine.  Simply explained, aliens escaping their own uninhabitable planet begin to replicate human beings with the intent of repopulating Earth with their own species.  Using oddly angled shots, strange POVs, an effective score and some equally effective special effects and sound editing, there is a pervasive sense of dread established that begins with the opening scene and maintains its intensity until the final haunting shot.  If you can ignore the stilted acting from much of the supporting cast, Invasion of the Body Snatchers will be a rewarding and memorable viewing experience.",
            "review_date": "2021-11-11",
            "source": "rt"
        },
        {
            "content": "Terrifying and visually striking. Slightly campy in some areas but overall, a very well-made horror film.",
            "review_date": "2021-11-01",
            "source": "rt"
        },
        {
            "content": "This movie holds up well. One of the few alien invasion flicks not reliant on special effects. Its all about the tone and it does a wonderful job crafting a believable world.",
            "review_date": "2021-09-28",
            "source": "rt"
        },
        {
            "content": "This was interesting for a once over.  For its day and age, there were some original movie treatments, style choices and special effect techniques that probably caught the attention of many viewers.  I liked the casting.  Notwithstanding some gaping plot holes, the concept was unique, and so was some of the camera work.  It created some decent tension in certain parts. I enjoyed seeing a young Jeff Goldblum in it.  However, as a whole, this version of Invasion of the Body Snatchers is not quite a masterpiece, but I'm glad I watched it.",
            "review_date": "2021-09-21",
            "source": "rt"
        },
        {
            "content": "A remake of the cult classic from the 1950s and also the second of four interpretations. I find this one to be the superior of all four and one of the most suspenseful films ever made.",
            "review_date": "2021-09-16",
            "source": "rt"
        },
        {
            "content": "A fine film, but I've always felt it lacked something in its presentation.",
            "review_date": "2021-06-15",
            "source": "rt"
        },
        {
            "content": "Essential post-Covid viewing. The 1978 remake is the best version of the film even surpassing the 1956 original. It eventually finds its groove, uses the score very sparsely and just relies on minimal low-budget effects, yet still manages to pull off all the pending doom. And what else can be said about that final scene that hasn't been said before? Even today, it is still haunting and still quite effective.",
            "review_date": "2021-06-07",
            "source": "rt"
        },
        {
            "content": "The dread it builds up throughout the whole movie is frankly, terrifying.",
            "review_date": "2021-02-05",
            "source": "rt"
        },
        {
            "content": "Invasion of the Body Snatchers nearly perfectly achieves what it set out to do--creep out the audience while exploring the theme of ideological possession. It is very well crafted and one hardly notices the subtle tricks the filmmakers use to keep the audience on edge, unless they are paying close attention.",
            "review_date": "2020-11-23",
            "source": "rt"
        },
        {
            "content": "This new remake sci-fi horror it's really unbelievable perfect and it's really scary horror film.",
            "review_date": "2020-11-14",
            "source": "rt"
        },
        {
            "content": "Manages to effectively mine the eerie and disturbing depths of the premise without falling into camp, which could easily have happened. The final moments will never not be horrific.",
            "review_date": "2020-10-31",
            "source": "rt"
        },
        {
            "content": "I've always liked this movie, but I was never gaga over it, like most people. But after this viewing it finally clicked for me. It's brilliant filmmaking all around. Its realism and nihilistic tone just sing to me. And man, what a cast! I also love the little flourish of adding a little cameo that kind of ties this remake to the original.",
            "review_date": "2020-09-09",
            "source": "rt"
        },
        {
            "content": "I don’t feel I need to talk about Invasion of the Body Snatchers all that much because I covered my thoughts on this story in my review of the 1956 version of the film. The two movies are extremely similar, and I was a bit surprised how much of the same ground they cover. This version was just as effective at creating that tone of fear and paranoia, and by the end, a sense of utter desperation and hopelessness. I think the cast does a good job of reacting to all the horror, and also showing the difference between ordinary people and the emotionless pod people. My big issue with this movie is that I felt like I had seen it all before. The original covered all the same ground and managed it in a much more efficient 80 minutes. The only thing this movie added to the conversation was gross-out effects, which I certainly didn’t need. I was also a bit annoyed with the clueless behavior of Donald Sutherland as he is constantly trusting Leonard Nimoy for no good reason, and ignoring the fact that he acts totally suspect the entire time. I can certainly see how some people might prefer this version of the story, but the ‘56 version was more my style of sci-fi horror, and even that one wasn’t exactly my cup of tea.",
            "review_date": "2020-08-10",
            "source": "rt"
        },
        {
            "content": "Absolutely brilliant. First watched this at the age of ten and thought it was scary back then. On rewatch this film has carved out a whole new place in my heart.\n\n‘Invasion Of The Body Snatchers' feels like a film that was made for introverts by introverts. Each conversation is so REAL. I truly felt as if everything was taking place in front of me. The way each actor/actress manages to sell such realistic banter is so enjoyable to immerse myself in.\n\nThe charisma of this film is outstanding.",
            "review_date": "2020-07-27",
            "source": "rt"
        },
        {
            "content": "Invasion of the Body Snatchers still holds up today thanks to a great cast and simple effects.",
            "review_date": "2020-06-06",
            "source": "rt"
        },
        {
            "content": "A rare occurrence where the remake outdoes the original.",
            "review_date": "2020-06-05",
            "source": "rt"
        },
        {
            "content": "Creepy premise that is used well for many unsettling, scary moments. The ending leaves a strong impression",
            "review_date": "2020-06-03",
            "source": "rt"
        },
        {
            "content": "Watching almost two hours of bad actors trying to fake surprise and fear out of a predictable and non-scary film is - at best - hilarious.",
            "review_date": "2020-04-22",
            "source": "rt"
        },
        {
            "content": "The best rendition of the film . The last scene still plays around in my head\nDonald was wonderful",
            "review_date": "2020-03-29",
            "source": "rt"
        },
        {
            "content": "Overall, this film is loaded with many cinematic moments which are unforgettable once you watch it. If you've never seen this film, it belongs on your watch-list today. Surprisingly enough, this film holds up quite nicely and the film's suspense is still strong, not to mention the surprising twist ending. Performances, particularly from the lead actor Donald Sutherland, are also impressive and delightful.  8.5/10 - Walkden Entertainment",
            "review_date": "2020-03-23",
            "source": "rt"
        },
        {
            "content": "After some impressive spore-like alien FX, the remainder of the opening is a little janky, a little tonally inconsistent and (although it may be thematic) a little loud and messy.\nBut pretty soon after that the film settles in to a moody, creepy and watchable groove. The slow turn of the apocalypse is fun to watch as it unfolds.\nIt's surprisingly brisk film for the most part, and the leads are charismatic and accomplished. There's a strange sort of unspoken chemistry between leads that I enjoyed and the supporting cast may have in many ways set the trend of horror film casting with a wide-eyed, already slightly odd-looking cast that are all brilliant in this sort of horror film. I enjoyed seeing Brooke Adams from Badlands playing the right levels of intelligence and squeamishness as befits a sci-fi horror chase film.\nThe title of the film gives basically everything away, which I find interesting as it frees the film up to give you a focussed, personal experience amidst these events instead of something more global, a little like the World War Z movie could use the lexicon of zombies and global politics to create a singular intimate story (for better or worse). With this revealing title, Body Snatchers  has the luxury of neither explaining or examining too deeply or too sparsely. And when conversations about the science begin, it seems more believable than even some of its contemporaries, even if the actual science doesn't bear thinking about. To say nothing of the dog with a human face, a moment so surprising and left field that I completely believe it within the context of the film that it could lead to them breaking character, it's so fucking weird and ugly.\nThe film is genuinely creepy and bleak. The three pod people growing while they all sleep is gruesome and the lack of clear answers on the alien methodology sort of enhances the otherworldliness.\nIt's a little protracted towards the last half but still has a dynamite ending. I'm sure these days they'd try and cram in a happy ending, see: I Am Legend, but they felt like they didn't deserve it in the late 70's and I'm not sure we deserve one now.",
            "review_date": "2020-02-17",
            "source": "rt"
        },
        {
            "content": "The shock value was probably far superior back in the day than it is now. Body Snatchers has its moments, but never levels up to the horror greats for me",
            "review_date": "2019-12-03",
            "source": "rt"
        },
        {
            "content": "I  like this move .because it gives to the audience maximum horror experience.",
            "review_date": "2019-12-01",
            "source": "rt"
        },
        {
            "content": "The 1978 Cult Classic \"Invasion of the Body Snatchers,\" is a certifiable drug trip. The score, while non-diegetic, seems to set the perfect tone of unease the characters are facing\nThe practical effects, while still portraying the level of camp often found in late 70s early 80s science fiction films, are still disturbing enough to disgust the viewer. The use of dolly shots and static shots in duality help put the audience into the shoes of each characters. \nDonald Sutherland's Matthew Bennell provides us with a stoic yet likeable main protagonist with Brooke Adams' Elizabeth Driscoll fits the \"Horror Movie Girl\" protagonist perfectly. Jeff Goldblum as Jack Bellicec is hilarious as the non-believing pre-Jurrasic Park Jeff Goldblum, and Veronica Cartwright as Nancy Bellicec delivers a well done, if not too memorable, performance. And it's always nice to see Leonard Nimoy in anything Sci-Fi related, and he did not disappoint in this film. 6/10, would not recommend if you are looking for a truly quality film but if you're looking for a campy 70s horror film then you should definitely check this one out.",
            "review_date": "2019-11-22",
            "source": "rt"
        },
        {
            "content": "Strangely, I keep reading that this quite efficient horror thriller is a remake of the old classic, but it actually is a straight continuation which even includes the ending of that movie re-staged with the same actor.",
            "review_date": "2019-11-07",
            "source": "rt"
        },
        {
            "content": "An unnerving paranoia thriller with aliens!\n\nPhilip Kaufman's science-fiction horror thriller Invasion of the Body Snatchers (1978) is a remake for the modern audience. The alien practical effects are realistic and grotesque, the horror builds with the paranoia, and the tension and pacing are faster than the original. Kaufman takes Jack Finney's novel The Body Snatchers and finds a contemporary feel for his adaptation. The characters speak with a knowledge of psychological phenomena and rationalize everything they are seeing until they can no longer ignore the truth before them. It's a neat science-fiction tale about alien invaders creating replicas of people one by one.\n\nKaufman's direction also transforms this sci-fi story into a paranoia thriller that were so popular in the 1970's like 3 Days of the Condor or All the President's Men, for example. The slow build-up to the shocking finale is really gripping. Kaufman uses odd Dutch angles, slow and fast tracking shots, hyper cuts, moody lighting, and fast zooms to create an eerie atmosphere. You feel like the characters are always being watched by those that have changed. \n\nEven Denny Zeitlin's score starts out as throbbing noises and blaring honks, then shifts into haunting melodies and strange rhythms to disorient you. Zeitlin fuses thundering classical with Chicago style jazz for a haunting fusion score. Kaufman is particularly good at shooting shadows, silhouettes, and angles to keep the audience on their toes. The sound design keeps Invasion of the Body Snatchers mostly quiet or silent so that all the sounds echo and reverberate deeply. You hear every gross gurgle, human scream, and alien shriek in the movie loudly.\n\nDonald Sutherland is riveting as the lead. His health code inspector is full of morals and decency. He portrays his character as kindly, so you empathize with Sutherland immediately. He plays Invasion of the Body Snatchers calm, which allows him to be cool throughout.\n\nBrooke Adams is adorable as the love interest and the heroine of the story. She has great chemistry with Sutherland. I like her charm and panic alike. Veronica Cartwright is astounding in how gripping her hysteria gets. She is perhaps the most paranoid and sympathetic character by the end.\n\nJeff Goldblum is his usual quirky self, but much younger. He's fascinating as this neurotic author with a paranoid and sensitive disposition. Leonard Nimoy, on the other hand, is stoic and intense. He gives a great performance as the foil to Sutherland and Goldblum. His ideas bounce around in your head as the perfect distraction from the terrors surrounding the characters.\n\nRobert Duvall even has a cameo as a priest on a swing in the opening scene! Can you believe director Philip Kaufman got the director of the original film to play the taxi driver during the driving to the airport chase sequence?!\n\nIn all, Invasion of the Body Snatchers is a fantastically shot film that will entertain you with spectral alien disturbances and compelling human drama alike! Philip Kaufman should be proud of directing such an iconic, influential, and cool sci-fi thriller. It's as stylish and enthralling as any neo-noir film.",
            "review_date": "2019-10-15",
            "source": "rt"
        },
        {
            "content": "Original, terrifying, and memorable; \"Invasion of the Body Snatchers\" (1978) is a must see science-fiction film that makes us fear our own society as well as a possible impending doom of an alien invasion. A slow-burner, but an worthwhile experience.",
            "review_date": "2019-06-20",
            "source": "rt"
        },
        {
            "content": "A great sci-fi remake with a perfect ending. Really holds up over 40 years later. ",
            "review_date": "2019-06-18",
            "source": "rt"
        },
        {
            "content": "Filled with paranoia. Some beautiful shots and great use of sound effects and music. Eerie film. Set in the middle of a busy city but creates a completely isolated and lonely feeling in the viewer. Must watch. ",
            "review_date": "2019-06-05",
            "source": "rt"
        },
        {
            "content": "A good remake, but overlong and meanders too much. However, the ending - the very ending, shocked and scared the hell out of me!",
            "review_date": "2019-03-01",
            "source": "rt"
        },
        {
            "content": "It is very rare for a remake to hit the mark (or even surpass) the original. However, this version does exactly that. The metaphor for human conformity and great acting, makes this a near perfect movie. Get ready for one of the most chilling finales ever put to film. The screeching of the Body Snatchers are sure to keep you up at night.",
            "review_date": "2019-01-29",
            "source": "rt"
        },
        {
            "content": "Great acting and building of suspense. Plays on a truly terrifying concept about the loss of identity with an invading alien force.",
            "review_date": "2019-01-16",
            "source": "rt"
        },
        {
            "content": "Scary in the most mysterious way",
            "review_date": "2018-12-13",
            "source": "rt"
        },
        {
            "content": "Ah, here we are, at the end of another October horror fest.  We certainly started off on an incredibly high note with Hereditary and, while we're not quite there with this movie, we certainly also close it off on a high note as well, particularly with how bad Prom Night actually was.  And, of course, some of you might say that this really shouldn't fit within the month, given that it's more a paranoid conspiracy sci-fi thriller as opposed to full-on horror.  But, once again, if I can make the case for Monster Family being a part of the horror fest then, surely, I can make a more legitimate case for this movie.  In many ways, this reminds me of The Thing (which is one of my favorite horror movies of all time) in that it focuses on a similar approach to its...villains in that whatever it is that's going on, it takes the form of other humans, with the only perceptible change being the fact that, in this movie, they are emotionless substitutes.  In The Thing, the changes are imperceptible, with the creature being able to fully assimilate the person's personality.  In this case, however, this being substitutes them and the personality changes are noticeable, the physical remains exactly the same.  The thing, pardon the pun, that works to me about this is that it plays with the concept of trust and, in a world like this, you really cannot trust anybody.  The original Invasion played with this concept excellently, as it was an obvious political allegory to the McCarthy days, where people were so paranoid that their neighbors might be communist spies that accusations were thrown around with no real reasoning or evidence.  This movie, however, doesn't have that element given that it is 1978 and, thankfully, the McCarthy era has been long gone by this point.  The point I'm trying to make is that I love concepts like this, where you cannot trust anybody, even someone you may have known for decades, because they could have been substituted by one of these pod people.  I do think, however, that the movie lays this on too thick at first.  Elizabeth is in a relationship with this man and, of course, this man is taken over by the pod people.  Elizabeth, to me, makes such a big deal about this without any real evidence to suggest that there's some sort of conspiracy.  I mean, of course, there is some sort of 'conspiracy' going on, if you can call it that, but for Elizabeth to start blathering about it so, relatively, early on in the movie feels like a bit too much when she, literally, doesn't know anything about what's happening.  Or, at least she's supposed to not be able to know what's happening, it's just that her guesses are so on the point that I found that, honestly, to be a case of too much, too soon.  Elizabeth says that it's not Geoffrey, it's everyone that she sees has the same expressionless faces.  Her boyfriend, Geoffrey, has been meeting with strange people that Elizabeth does not know.  So, naturally, there has to be some sort of conspiracy going on here where people have been changed, right?  Like I said, Elizabeth is obviously right in the long run, but I feel that it's too much for her to know, too early.  I would have liked there to have been a little more guesswork involved as opposed to, almost immediately, hitting on what it is that's going on, despite no one believing her.  I feel like this is something that, a lot of people, might feel is minor, and I'm not saying that it completely destroys the movie, but it does detract from it a bit.  I suppose that's neither here nor there, I guess, given that I still very much enjoyed this movie.  Later on, of course, Elizabeth's colleague, friend and love interest believes her once he sees Jack's second body being...grown at his Jack's wife's bathhouse.  And, of course, Matthew finds Elizabeth's duplicate body being grown at her boyfriend's apartment as well.  It's kind of difficult to argue against that kind of evidence, I think.  Eventually, after this, it becomes the group's attempts to keep away from these pod people, who shriek loudly whenever they're in the presence of someone who's human.  I think that part of what I liked about this movie is the fact that there's a certain inevitability of it all.  There is no avoiding the fact that, sooner or later, you will become a pod person.  Avoiding them by pretending to be emotionless is very doable, but not sleeping is gonna be impossible.  Eventually the body is gonna shut down.  The pod people fully take over when their 'host' has been sleeping for quite some time.  Elizabeth, Jack, Nancy and Matthew are all fighting against this and, you know that, despite how hard they may try, they're not gonna avoid this.  It's only a matter of time.  For some reason, though, I like that.  The futility of it all.  With that said, this movie is exactly perfect.  And, realistically speaking, no film ever is.  I just think that the pacing off the movie is a little bit inconsistent.  It feels like it goes on longer than it probably should and there's some self-indulgences that probably could have been cut out in order to make the film feel a little less cluttered.  The script doesn't always do a great job at making things clear to you.  Not that they have to explain everything, that's not my point, but sometimes you're not exactly sure how certain things happened and the scripting doesn't do an amazing job at, at least, giving you enough pieces for you to piece together.  These are, really, minor complaints, as I still thought this was a damn good movie.  The lead cast is tremendous.  Donald Sutherland, Brooke Adams, Leonard Nimoy, Jeff Goldblum and Veronica Cartwright all deliver the goods.  It also helps that their characters are really well-written.  The film also has a great ending.  Perhaps it's not shocking, given that THAT scene has become a meme, but it's still a great ending nonetheless and, once again, it plays into the futility of it all.  And the only human character that is left standing will, inevitably, fall victim to the pod people and they will, seemingly, take over the U.S.  I don't know what else to say, it's not a perfect movie by any means, but this is still a damn good remake that, in spite of its flaws, still holds up quite well all things considered.  This is obviously not gonna be for everybody, but I would still give this an easy recommendation.  At least we ended the horror fest on a, relatively, high note.  Not as high as how we started it, but still a high note nonetheless.",
            "review_date": "2018-11-02",
            "source": "rt"
        },
        {
            "content": "The remake not only refreshes the story, it had given it a timely modern update to the frightening chills for meeting expectations while adding clearer twists and expanded thematic approach in the retained sharpness, therefore a standardized example of how remakes can be truly effective in an actual functioning matter. (B+)\n\n(Full review TBD)",
            "review_date": "2018-10-27",
            "source": "rt"
        },
        {
            "content": "Employing gritty camerawork and evocative sound effects, Invasion of the Body Snatchers is a powerful remake that expands upon themes and ideas only lightly explored in the original.",
            "review_date": "2018-10-13",
            "source": "rt"
        },
        {
            "content": "I really expected this to be a dated cheesy movie I'd get a kick out of making fun of but now find it impossible not to watch every time I come across it on TV. It draws you in as the creepiness develops and you follow the characters along as they realize the inevitability of their demise as they do their best to fight to survive to the last. Young Veronica Cartwright and Jeff Goldbloom are lovely to see and the leads, Donald Sutherland and Brooke Adams are compelling and charismatic.",
            "review_date": "2018-09-01",
            "source": "rt"
        },
        {
            "content": "Invasion of the Body Snatchers works well, constantly twisting and turning, more unpredictable than you probably predicted it would be. It's got some nice central performances, especially by Sutherland, who makes the movie vastly more interesting, and even though it is a little slow and doesn't have much action at all in the first half, it does lead up to an intense finale and a creepy last scene. It's a mystery that deserves to be seen by sci-fi and horror fans, even though it isn't actually as scary as it think it is. But it works well with its budget and actors, and Amazing Grace on the bagpipes is one of the best things to ever hear. Like, ever.",
            "review_date": "2018-07-15",
            "source": "rt"
        },
        {
            "content": "A health inspector tells her boss about her husband's sudden change of behavior and his strange doings. The boss notices several other oddities over the course of his days as he passes through the city. Upon further investigation he notices the similarly affected gathering and exchanging items. A chilling, paranoia-inducing film which could be used as an allegory for political movements. A solid cast including, Donald Sutherland, Jeff Goldblum, and Leonard Nimoy, with cameos by Kevin Mccarthy and Robert Duvall along with Michael Chapman, cinematographer on Taxi Driver, Raging Bull, The Fugitive, and Primal Fear, ensures this Philip Kaufman-directed horror is presented effectively. The version I have posses terrible audio-quality which affects the enjoyment of the movie; part of the chilling eeriness is supposed to be derived from the sound. For example, the decrease in natural sounds, such as dogs barking or birds chirping, as the film progresses or the famous horrifying pod-scream. A timeless psychological-horror which 1970's gritty film style only adds to its impact.",
            "review_date": "2018-05-13",
            "source": "rt"
        },
        {
            "content": "An extremely rare case of a remake that is almost better than the original, Invasion of the Body Snatchers proves how a 70's movie can be relevant and scary even nowadays, passing the test of time thanks to brilliant photography, cinematography, acting, writing, production and concept.",
            "review_date": "2018-04-15",
            "source": "rt"
        },
        {
            "content": "How Alien snatches bodies",
            "review_date": "2018-04-01",
            "source": "rt"
        },
        {
            "content": "Remake done 22 years after the original with the same name. Some plants are making weird stuff happen. When you sleep, you are transformed into some clone of yourself while your original \"you\" dies. The clone is cold and expressionless.\n\nWhen our gang, with Donald Sutherland and Brooke Adams in front is fighting this evil, most likely from space. They got a young Jeff Goldblum and a not so old Leonard Nimoy on their team, but who are friends and who are foes?\n\nPretty creepy but I find it hard to buy the story. Some weird turns and it's like a slow hunt with some shockers here and there. Some gore and brutality wrapped up in some very creepy sound effects. The effects are generally fine but I never felt this film.\n\nThe original is probably better, but I've hear that this one is pretty close to it while the two newer remakes seem pretty bad.\n\n5 out of 10 pods.",
            "review_date": "2018-03-15",
            "source": "rt"
        },
        {
            "content": "The scares (namely the jump scares) no longer work on current audiences.  But still, there's a nice story and a great ending to look forward to in Invasion of the Body Snatchers.  The sound effects and visual effects are advanced for their time and really help establish the suspense.  The acting is great led by Donald Sutherland.",
            "review_date": "2018-02-18",
            "source": "rt"
        },
        {
            "content": "3.4/5\n\nThere were moments were I couldnt help but think of John Carpenters The Thing, mainly because the grotesque effects have a similar aesthetic, but also because I missed the tension and the horror that that film provided, all because the characters and situations in Invasion of the Body Snatchers arent nearly as interesting or emotional as the obvious paranoia subtext believes them to be.",
            "review_date": "2018-01-08",
            "source": "rt"
        },
        {
            "content": "The sound work is great and most the cinematography is good, but the predictable story is has done been to death and the characters are nothing special especially today. The movie was great for it's time, but it hasn't aged well at all.",
            "review_date": "2017-09-08",
            "source": "rt"
        },
        {
            "content": "Even though it relies on a gripping feel of intense paranoia, this is an overlong sci-fi/horror movie that suffers from certain problems in logic and kills its tension with long passages that make the pacing irregular, not even being smart enough as an allegory like the original film.",
            "review_date": "2017-09-03",
            "source": "rt"
        },
        {
            "content": "Much better than the original which I hate, this movie really provides good suspense and drama. Never was a fan of Donald Sutherlands, but he's okay in this movie. The rest of the cast does a good job too. Its rather slow by today's standards though. But I enjoyed it.",
            "review_date": "2017-07-11",
            "source": "rt"
        },
        {
            "content": "\"Invasion Of The Body Snatchers\" overcome its otherwise slow pace by being mysterious all the way through...it is creepy at points but nothing really more than that.",
            "review_date": "2017-07-10",
            "source": "rt"
        },
        {
            "content": "\"Just because you're paranoid doesn't mean they aren't out to get you,\" goes the famous insight, and there's that part of this work that is unnerving to say the least. The other part, no less significant, is how no one will believe you, adding frustration to the pungent mix. It's done elegantly here, everyone taking their time, letting the tension build. One of the greats.",
            "review_date": "2017-06-20",
            "source": "rt"
        },
        {
            "content": "Weird! not as good as i thought it would be but not bad either. Not enough jeff goldblum",
            "review_date": "2017-06-16",
            "source": "rt"
        },
        {
            "content": "Quite liked this one",
            "review_date": "2017-04-30",
            "source": "rt"
        },
        {
            "content": "Excellent film that makes you wish there were more genre film remakes of its caliber.",
            "review_date": "2017-04-11",
            "source": "rt"
        },
        {
            "content": "One of the most beautiful, eerie, disorienting, and ethereal openings ever in a movie. I still don't know what the hell was being filmed. It looks like bacteria or some fungus you would see crawling through a microscope.\n\nWhat an amazing soundtrack. The use of strings contrasted with eerie and ominous synth sounds, makes for a very interesting collage of sounds. That one pulsating sound is one of the most unnerving and uneasy sounds I've heard come from a synth.\n\nRight from the get go, I knew this was going to be one creepy movie. The scene with the priest swinging on a swing set was already something that made me question everything that was about to unfold in the movie. The San Francisco setting makes it lovely to watch. I wish to one day, visit this amazing city. \n\nDonald Sutherland is always fun to watch. He has this very nonchalant and cool way of doing things while acting that makes for a very interesting and entertaining watch. His charm is also very contagious. Brooke Adams is so cute and lovely. Seeing a lightning quick cameo of Martin Scorsese was awesome. Could barely make out who it was but with a beard like that, impossible to not recognize. I think there was even a 2001: Space Odyssey reference when Sutherland's character says, \"David, your killing me\".\n\nWhat a terrifying feeling it must be to be to know that people are changing and their not their usual selves. I think it's pretty clever how the garbage men are the ones who take away the bodies. The pod scene in the backyard was one of the most terrifying, uneasy, and uncomfortable scenes to watch. Who knew birth could be so fucking twisted. The part with the dog that has the face of a man, pretty fucked up stuff. Left me scarred. \n\nThe camera work and cinematography is wonderful. It compliments what is being shown and makes a scene or shot that much more interesting to watch. The use of lighting is brilliant in this movie. Reminds me a lot of The Exorcist. The special effects were great.\n\nWhat a great twist at the end. While your watching it, you're not really sure of the situation but when you hear the shriek at the end, everything comes to a terrifyingly twisty conclusion.\n\nOverall, brilliant film. Wonderfully written and acted with a terrifying story that reminds us that what makes us human, are our emotions and our care ad love for one another. Once that is gone, we're pretty much alien to this world.",
            "review_date": "2017-03-24",
            "source": "rt"
        },
        {
            "content": "Love the gripping story and the eerie atmosphere. Donald Sutherland's screech at the end of the movie still echoes in my mind.lol",
            "review_date": "2017-03-20",
            "source": "rt"
        },
        {
            "content": "haha i can see this being a hit in 1978; it's not bad at all. but i did giggle at a few parts for it's ridiculousness, haha.",
            "review_date": "2017-02-25",
            "source": "rt"
        },
        {
            "content": "This is a really solid remake that though it's almost 40years old now, still holds-up really well.  The cast is solid, led by Donald Sutherland and with support from Maud Adams, Jeff Goldblum and Leonard Nimoy.  There's a palpable sense of paranoia throughout and it is just a really good sci-fi/horror film.  Seek it out.",
            "review_date": "2016-11-18",
            "source": "rt"
        },
        {
            "content": "One of the best alien invasion movies ever made. It builds so effectively towards one of the most iconic moments in 70s horror cinema.",
            "review_date": "2016-11-06",
            "source": "rt"
        },
        {
            "content": "A good film, a very good film that I call Invasion of the booby snatchers. I saw it in a second run theater on Granville Street in Vancouver in 1979. It's the scream, deal and pointing the finger that's really scary. The invasion is total crap. Don't waste your time or money.",
            "review_date": "2016-11-02",
            "source": "rt"
        },
        {
            "content": "Grim and frightening remake of the 50's classic movie which I still consider scarier. The big plus of this remake is that it doesn't have a crowd-pleasing ending of \"everything will be alright eventually\".",
            "review_date": "2016-11-01",
            "source": "rt"
        },
        {
            "content": "My favorite version of this particular film.",
            "review_date": "2016-10-31",
            "source": "rt"
        },
        {
            "content": "Eerie, a bit disturbing at times, and more in detail than the first. One of the best horror/sci-fi movie remakes of all-time that is nearly better than the original.",
            "review_date": "2016-10-23",
            "source": "rt"
        },
        {
            "content": "Eerie, a bit disturbing at times, and more in detail than the first. One of the best horror/sci-fi movie remakes of all-time that is nearly better than the original.",
            "review_date": "2016-10-23",
            "source": "rt"
        },
        {
            "content": "A great update of the original - freaks me out as a kid watching the tv version.\nAnd that ending..\nThe dog with the face, a bonus..\n\n5 out of 5 backyard pods",
            "review_date": "2016-10-22",
            "source": "rt"
        },
        {
            "content": "Fantastic remake.  I love the way Kaufman kind of plays with a cameo to suggest that this could take place right after the original.",
            "review_date": "2016-10-17",
            "source": "rt"
        },
        {
            "content": "If you love horror this is a classic for good reason. You won't regret watching this one.",
            "review_date": "2016-10-02",
            "source": "rt"
        },
        {
            "content": "Not quite as frightening as I once thought, but the dog scene still chills and the ending is as horrifying and haunting as ever.",
            "review_date": "2016-07-29",
            "source": "rt"
        },
        {
            "content": "It's been quite a while since I saw this film and I'd forgotten how eerie and creepy is was. Arguably a superior remake of the original Don Siegel directed original, this one relocates the story of pod people replacing humans to 1970s San Francisco. Donald Sutherland plays a health inspector who slowly becomes aware people are being replaced by exact clones who are really pod people from outer space. It's a goofy concept, but director Philip Kaufman gets the tone just right, delivering a film that's viscerally thrilling and scary, and at the same time is also an intelligent film that tackles themes around conformity. The remake features a strong cast beside Sutherland, which includes Brooke Adams, Veronica Cartwright, Jeff Goldblum and Leonard Nimoy, along with some fun cameos by the star of the original film, Kevin McCarthy, who early in the film is running through the street shouting \"They're coming! They're coming!\" and also the original film's director, Don Siegel, appears as a taxi driver. This film was written by W. D. Richter, who wrote a number of memorable films including \"Big Trouble in Little China,\" \"Nickelodeon,\" \"Brubaker,\" and who also directed one of my all-time favorite movies, \"The Adventures of Buckaroo Banzai Across the 8th Dimension.\" This film is a must see for fans of sci-fi and is one that's has enough of a crossover appeal for general audiences. And although I knew what was coming at the end of the film, it is still just chilling and gave me shivers. And one more thing, oh man, that dog near the end of the movie!",
            "review_date": "2016-06-25",
            "source": "rt"
        },
        {
            "content": "Invasion of the Body Snatchers is an intelligent and witty sci-fi film that is not only completely terrifying, but also a well-crafted satire. Employing gritty camerawork and evocative sound effects, Invasion of the Body Snatchers is a powerful remake that expands upon themes and ideas only lightly explored in the original. Fine performances by Sutherland and Adams anchor the film, lending the outlandish story a surprising sense of realism and gravitas. The plot wouldn't be nearly as terrifying if the actors weren't so successful at delivering honest emotional performances that produce a visceral, vicarious experience for the audience. The screenplay by W.D. Richter builds at a deliberate pace, and within the first half hour we're already disturbed by the almost imperceptible behavior of those who have been snatched. Invasion of the Body Snatchers was shot by cinematographer Michael Chapman (Raging Bull) with a rugged, realistic beauty in keeping with the movie's favoring of drama over dazzling visual effects. Invasion of the Body Snatchers is the stuff of multiple nightmares-and that's not even taking into account the scene with the dog that has a man's face. On top of being an engrossing conspiracy thriller in step with the gritty urban tales of the time, the Invasion of the Body Snatchers is also a genuinely creepy film which slyly suggests there is something sinister beneath the surface.\n\nVERDICT: \"High-Quality Stuff\" - [Positive Reaction] This is a rating to a movie I view as very entertaining and well made, and definitely worth paying the full price at a theatre to see or own on DVD. It is not perfect, but it is definitely excellent. (Films that are rated 3.5 or 4 stars)",
            "review_date": "2016-06-18",
            "source": "rt"
        },
        {
            "content": "Sure had a snippet of an idea but just didn't know what to do with it. The science fiction aspect felt dumb, cinematography was too dying to please and the direction is confused whether to make a meaningful drama or a mindless thriller. At the end it did not please me on any department. People getting cloned from a biological pod down to their hairstyle, aliens has the technology to travel from planet to planet but could not make it from point A to B to catch a few fugitives. Overall, it was not well thought out and even badly executed. \n\nMatthew Bennell (Donald Sutherland) is an officer from the public health department who is friends in a one-sided love with married Elizabeth (Brooke Adams). One day she announces that her husband is not the same person anymore after she brings in a strange flower she finds on the street. With a few more incidents on similar lines, Matthew takes it a bit more seriously and finds out the human beings are being replaced by Alien clones and the entire government and public services are already replaced. With him, Elizabeth, Jack (Jeff Goldblum) and his wife being considered fugitives, they become desperate to find a way out. \n\nOne of the poorly executed science fiction movies of the time. It neither worked as sci-fi drama nor a thriller with a good central idea but a very dumb way of implementing it. The unnecessary gimmicks in photography, very loud background score, an irritating nerd of a Jeff Goldblum, poor pacing - everything about it felt wrong. Brooke Adams is very inconsistent with masterful dialogue diction at times and unnecessary screaming and whining otherwise. Donald Sutherland just looked uninterested with the whole mess happening around him. Since the script was originally written in the 50s, I don't think this version didn't seem to upgraded itself (cannot confirm since I have not seen the original) as the technology looked outdated even for its time to be a science fiction. \n\nClumsy, outdated, overrated, slow and dumb.",
            "review_date": "2016-04-22",
            "source": "rt"
        },
        {
            "content": "A bone chilling and very disturbing but great remake of the 1956 classic. There are some great performances by Donald Sutherland, Veronica Catwright and Jeff Goldblum, along with others. Unlike the original actually, there's a little more gore and special effects and the creepy camera work and weird alien sound effects are just amazing. This flick really does expose more ideas than the original and  will make you think about the society we live in. Anyways recommended !!",
            "review_date": "2016-03-28",
            "source": "rt"
        },
        {
            "content": "Prophetic movie that foretold the coming of the SJWs.",
            "review_date": "2016-01-30",
            "source": "rt"
        },
        {
            "content": "Slight let down, but good old horror-thriller.",
            "review_date": "2016-01-03",
            "source": "rt"
        },
        {
            "content": "A terrifying film that redefined the alien invasion genre with its creepy soud effects and shocking realism. Invasion of the Body Snatchers works perfectly as a standalone or sequel to the previous film.",
            "review_date": "2015-12-19",
            "source": "rt"
        },
        {
            "content": "First remake of the 1956 film, some new elements exploring others issues from the original story.",
            "review_date": "2015-10-31",
            "source": "rt"
        },
        {
            "content": "Very interesting and creepy.  Must-see film.",
            "review_date": "2015-10-26",
            "source": "rt"
        },
        {
            "content": "#3 countdown to 2000 ratings",
            "review_date": "2015-10-22",
            "source": "rt"
        },
        {
            "content": "It has just the right pacing, just the right kind of memorable characters, and the right execution of a interesting story. The twists are good, the suspense works, and the effects are fine enough. It has an lasting effect along with some wonderful cast members, and eye-catching cinematography.",
            "review_date": "2015-10-15",
            "source": "rt"
        },
        {
            "content": "Just re-watched this excellent 1978 remake of the 1956 classic sci-fi film which has become somewhat iconic in its own right. The acting is fantastic and the direction is bang on and should not be confused with the terrible 2007 \"The Invasion\" (starring Nicole Kidman and Daniel Craig) or 1997's \"Body Snatchers\", which is just okay. It hard to believe that it's now over 35 years old, but it's just as scary as it ever was. It could probably be used in film school to teach students on how to do a really great remake.",
            "review_date": "2015-10-02",
            "source": "rt"
        },
        {
            "content": "Probably better than the first",
            "review_date": "2015-10-02",
            "source": "rt"
        },
        {
            "content": "To put it simply, Invasion of the Body Snatchers is a great sci-fi movie. From the classic-yet-modern score, an excellent premise (that utilizes those classic science fiction tropes involving evil coming from within ourselves, the idea of humans losing what makes them human, the thought of something horrible happening to you when you're asleep, alien invasion, etc.), right down to the presence of sci-fi greats Jeff Goldblum and Leonard Nimoy, it exemplifies everything the genre aspires to.\n\nImproving on the limited scope of the original, Kaufman generates a sense of paranoia by focusing on the little things that people do throughout the day without thinking that could infect us with an unknown organism (bumping into people, answering phones, preparing food) and by frequently acknowledging the presence of nature, be it in a bowl of fruit, flowers, or any other form of natural life that is almost constantly onscreen. Everything takes a backseat to his direction, his camera peaking around corners, zooming up to shadowy figures, moving in on mirrors projecting distorted versions of characters, and he intelligently plays with the audience's expectations by setting up narrative punch-lines through repeated cuts that manifest in subversive, unexpected ways. It's an elevated take on a classic that rarely missteps, features a relatively iconic ending that earns its reputation in spades and subsequently manages to secure a place among the best of its genre.",
            "review_date": "2015-09-21",
            "source": "rt"
        },
        {
            "content": "Invasion Of The Body Snatchers is one of those rare beasts from the 70's that not only unsettled audiences, with its scarily resonate content, but also its utterly terrifying and voyeuristic style of imagery. While Alien really got underneath everyone's skin, literally, with a violent depiction of Alien beings, Invasion takes a more subtle route, one that builds to boiling point and doesnt cool down, even if it has the occasional dated moment to make you giggle. Invasion follows the story of a strange alien parasite that falls to earth via vapor. Slowly it begins to infect the population, but instead of turning them into eyesore creatures, this parasite creates and army of human slaves, all hell bent on spreading as far as possible. Although Invasion is dated, the lead cast themselves are extremely strong, Sutherland, Adams, Nimoy, Goldblum and Cartwright are all brilliant and add a real sense of character to the ensemble. Its hilariously evident when these actors are placed against minor characters, who just dont cut the mustard, but considering the alien nature of most other characters, their performances are forgivable. The real show stealing character is the cinematography however, merging typical but mesmerizing shots, with obscure and uneasy dynamic shots, that give the audience a sense of dread or that someone is always watching them. It's slow and brooding but never drags, the edit weaves tonnes of exposition together in a seem less fashion, adding even more weight to the unease. Invasion is a marvel to watch and an absolute must for science fiction fans. Its not all fun and games though, for all its praise, Invasion has dated quite a bit, and there are a number of jarring moments that feel limp and void of character. The smaller characters cant act worth a dam and some of the script contains lines that really could have been cut and their premise shown through visuals. The middle section also falters from a lot of the same content, it becomes increasingly similar near the end and at points as a viewer, you can find yourself drifting away. However Invasion grabs you by its final act, with an extremely memorable and diverse finale. Although during the time Cronenberg was churning out much more effective alienating pieces of art, Kaufman fires out a defining and terrifying piece of art. A must see for science fiction, horror fans.",
            "review_date": "2015-09-03",
            "source": "rt"
        },
        {
            "content": "\"Well why not a space flower? Why do we always expect metal ships?\"\n\nSince its publication in 1955, Jack Finney's Sci-Fi novel has been adapted many times for the big screen. The first adaptation was directed an year later by Don Siegel starring Kevin McCarthy and Dana Wynter. The story took place entirely in a small Alabama town where some of the locals began mysteriously behaving in strange and detached manners, but more than twenty years later Philip Kaufman decided to remake this film and relocate the story in the populated city of San Francisco instead. The circumstances were different and the underlying political themes weren't necessary so this film focused entirely on the growing sense of paranoia behind the invasion. The mystery element is gone here, because from the very first scene we witness how this strange organic life form, similar to gel spores, begins drifting from a far away planet through space until it reaches our atmosphere and is washed down by rain in San Francisco. Here the spores develop into plants with pink flowers and the people who come into contact with them begin behaving in strange ways, which is of course a result of this life form taking over the bodies. The first to notice the change is Elizabeth Driscoll (Brooke Adams) who shares her concern with co-worker, Matthew Bennell (Donald Sutherland), a public health inspector. She tells him that her husband has begun to act in a very mysterious manner and that he seems detached from any emotion. Matthew recommends she talk with his friend, David Kibner (Leonard Nimoy), a renown psychiatrist. When Elizabeth goes to speak with him, David mentions that other people have come up to him with similar concerns. Their fears are confirmed when Matthew's friends, Jack (Jeff Goldblum) and Nancy (Veronica Cartwright) discover a strange corpse that is being formed by the plant to duplicate one of them. By this time the invasion is in full force in the city and they must find a way to escape before it's too late. \n\nThe original film was already considered to be quite good, but this remake is probably the most referred to when mentioning Finney's novel. All the other adaptations after this one haven't met the same reception. The way in which cinematographer, Michael Chapman, shot the film gave it a much more disturbing atmosphere with the skewed angles, deep compositions, and dark shadows which only adds to the bizarre qualities of the film. It is an eerie sci-fi movie with some memorable sequences (who can forget the moment that mutant dog with a human face suddenly shows up on screen?) and you never know what direction the story is going to go. Unfortunately the film is a bit outdated and the effects don't look as great. The performances are solid, but sometimes they were over sold. Invasion of the Body Snatchers wasn't as fun as I had anticipated it to be, and the pacing began to drag at times. I probably would've enjoyed this film more if I had seen it several years ago, but by now the plot is overly familiar so the suspense and the scares don't work as well.   \n\nDonald Sutherland and Brooke Adams play the two lead characters and they manage to engage the audience and allow us to sympathize with their cause. Adams is especially cute here and she can move her eyes like no one else. Nimoy gets a very conventional role and his character doesn't do much for the film. We've seen Goldblum play very similar roles as well and he did manage to get on my nerves during some of his freak out scenes. The cast delivers, but they were all far from being memorable. I can imagine the story freaked audiences out during the 70's and 80's, but for today's standards it isn't as effective.    \n\nhttp://estebueno10.blogspot.com/",
            "review_date": "2015-08-30",
            "source": "rt"
        },
        {
            "content": "Not quite as good as the original, but a very well done remake in its own right. What I really liked, was that this was not a scene for scene remake. There was a lot of new or added content. The roles of the characters were changed. The personalities were tweaked, but still shared the same commonalities as the original actors in the first film. I couldn't ask for more in a remake. \n\nWhere the problem comes in, is the dragging on factor. The beginning was very boring and slow, so the pacing was kind of poor and dragged down the film for at least the first of the 4 half hours. Overall, aside from that, I would have ended up preferring this film over the original, just solely based off of the explanation of events in the plot was done much better and everything was much more straight forward and clear cut.",
            "review_date": "2015-08-18",
            "source": "rt"
        },
        {
            "content": "Very Strong Cast, Goldbloom Plays The Excitable But Rational Science Guy On The Side, Which He Always Does So Well. Some Unexpected Full-Blown Nudity By The Female Lead Gave It Some Surprises. The Early 303-Synth Soundtrack Gave It A 80s Period-Piece Edge, But It Was Slow In Parts, So Definitely Needed The (Aforementioned) Extra Bits To Keep You Awake.",
            "review_date": "2015-08-15",
            "source": "rt"
        },
        {
            "content": "tense, horrifying, electric. One of the greatest remakes.",
            "review_date": "2015-08-08",
            "source": "rt"
        },
        {
            "content": "Striking visuals and sound design lend themselves to haunting atmosphere and a palpable sense of dread.",
            "review_date": "2015-06-29",
            "source": "rt"
        },
        {
            "content": "Invasion of the Body Snatchers is a remake of a 1950s black and white sci-fi horror film of the same name. It is considered one of the greatest remakes of all time, as well as one of the rare remakes that are considered as good as the original.\n\nIt stars Donald Sutherland as a San Francisco health inspector who begins to notice the people acting differently. He and a group of other people then out alien pods has landed on Earth, and is replacing the humanity with emotionless creatures with the same appearance. Soon, they are fighting for their lives after the entire city is taken over.\n\nThis movie had a very creepy atmosphere throughout, and some pretty effective scares. Once the heroes completely find out about the body snatchers, there is a feeling of dread for these characters. There are some practical effects, and they look pretty good for the most part. The acting is also pretty good for a horror movie, with a cast including Donald Sutherland and Leonard Nimoy.\n\nI could see why it would be considered as good as the original. It maintains that movie's feel, and creates some good scares. I would recommend this movie if you are a fan of science fiction or horror.",
            "review_date": "2015-06-03",
            "source": "rt"
        },
        {
            "content": "I went into this film with such high hopes.  Myself being a big Sutherland fan and loving the Body Snatcher arc, combined with the RT score I figured I'd find myself at the minimum highly entertained for a couple hours.  I was wrong.\n\nThe plot is something everyone is familiar with at this point and I would dare to say that if you actually are not familiar with the story, then maybe you will find more enjoyment out of this film than if you are.  Perhaps it was my own expectations that lead to my being underwhelmed, however I struggled to find anything all that redeeming about this film.  The actor portrayals are ok, and again, the story is what it is.  Yet not once is the viewer able to get emotionally attached to any one particular character.  The only above average marks I will give this film is for its ahead-of-its-time special effects and props/makeup.  Visually these things come off as beautifully done pieces that all serve a purpose and move the story along.  overall though, a disappointment for me.",
            "review_date": "2015-05-30",
            "source": "rt"
        },
        {
            "content": "This movie was very disturbing. Not in a bad way, but a way that unsettles you. It had a very dark tone, and a very interesting concept. The movie did get a little boring at times, but it eventually made up for it. I thought it was a very good movie with an amazing concept. Definitely for anyone who wants a nice sci-fi horror movie.",
            "review_date": "2015-05-28",
            "source": "rt"
        },
        {
            "content": "Insufferably boring at times, but a moderately impressive remake of  the 1950's classic.",
            "review_date": "2015-05-26",
            "source": "rt"
        },
        {
            "content": "Great suspenseful flick.   This mocie can be considered cheap by today's standards,  and yet it is a  seriously spooky movie about not being in control of what happens.",
            "review_date": "2015-05-26",
            "source": "rt"
        },
        {
            "content": "With terrific make-up and practical effects, wonderful imagery and menacing atmosphere that is created mostly thanks to absolutely fantastic sound effects, Invasion of the Body Snatchers has bland characters and the acting is very problematic and at times quite bad, but it is a remake that does everything a remake should do - it has the same plot but is never repetitive because it changes many things while staying true to the original and in the process incorporating more themes and updating the effects and creating a better atmosphere thus managing to be better than the original and inarguably to be one of the finest remakes of all time.",
            "review_date": "2015-05-19",
            "source": "rt"
        },
        {
            "content": "How in the hell has it taken me so long to see this movie? It's like the best thing ever!",
            "review_date": "2015-04-27",
            "source": "rt"
        },
        {
            "content": "The rare remake that is at least as good as the original. What I especially like about this version of a story that needs to be retold every decade is how it captures the late 1970s and the rise of celebrity psychologists and self help experts. Leonard Nimoy as Dr. David Kibner seems emotive as a pod person, but it is all words with no emotion, just a bunch of useless nonsense about psychology. I love how it is suggested that pop psychology is just conformity, forcing people to medicate, sleep, and wake up a pod person.\n\nThe other thing I love about this version is the use of sound. Conversations often take place behind barriers, suggesting the growing distance between people. The everyday mundane world of San Francisco is always around with police sirens and garbage trucks compacting garbage (and remains.) Then, of course, there is the horrible sound the pod people make when they spot a human in their midst. The movie is so grounded by sound that the more fantastic elements are all the more horrifying.\n\nIt goes without saying that the movie is scary and tense. Even in the beginning, when no one knows what is going on, and everything looks the same as it did the day before, there is something slightly off. People running in the background, people staring, people looking at each other without a word. It is all very creepy and keeps building as the invasion continues, leading to even more horrifying moments late in the movie.\n\nLike the original movie from 1956 and \"Body Snatchers\" in 1993, the 1978 version successfully captured the troubling issues of its time. With three successful movie versions based on Jack Finney's original science fiction novel, it seems like every decade should have its own version. Isn't it about time for another one? I haven't seen the 4th movie version, \"The Invasion\" from 2007, but I didn't hear very good things about it.",
            "review_date": "2015-03-19",
            "source": "rt"
        },
        {
            "content": "Sutherland, Goldblum and Spock himself (Nimoy), I have to say it should have been a lot better then it was. But with that off my chest this film is still excellent or at least better then the original. I's a nice title for a film to have as \"one of the best remakes\". Hollywood should use this as a guideline with the all the remakes they are pumping out every year. Best part is when the actor from the original makes a cameo, just genius. Following the 50's original with little difference here and there but after a while you find the characters in the same situations, if the ending wasn't different from the original this film would have almost no cult following. It is just not my type of film, if you liked the original you'll dig this, if you hated the original and your hoping this is different which is, then prepare to a watch the same film, with a lot more money and better a execution.",
            "review_date": "2015-02-25",
            "source": "rt"
        },
        {
            "content": "A remake that works......goes further than the original with answers to boot.",
            "review_date": "2015-02-25",
            "source": "rt"
        },
        {
            "content": "Great flick. Love the use of shadows and lighting in this one.",
            "review_date": "2015-02-17",
            "source": "rt"
        },
        {
            "content": "In classic horror film fashion, before it was a convention, everybody thinks the protagonist is crazy; surrounding characters do not understand or believe Matthew Bennell (Donald Sutherland). There's this thing that we know from the onset of the movie that nobody else understands.  It's like the crazy kids who declare Freddy Krueger is alive in their dreams.  Leonard Nimoy is the best catalyst for this because if anybody should understand the bazaar and unnatural it is Spock.  Jeff Goldblum seems to be playing a character that will be mirrored 15 years later in Jurassic Park, believing in the insanity, that something is wrong.  Everyone from Sutherland to Nimoy is close to understanding what's going on, but they are just missing the mark.  By not having Nimoy on our side, the audience is bound to feel unsafe, a terrific exercise in terror, suspending any sense of security the audience would have.  Being made to look crazy is the scariest feeling that I can possibly imagine.  I appreciate the relation of maddened husbands to infectious disease, or alien hypnotism.  \n\nI see an allegory to the feeling imperialism creates - nationalism, ethnic cleansing -- you slowly become the silent minority.  We get a sense of how it feels to be on the run, society's target; a Holocaust Jew.  To be paralyzed by society's stronghold this way.  Like the Borg, all that's left is to assimilate.\n\nWhat better plot device than a food inspector as the hero in a story about combating invading microbes?!  He goes from pulling rat shit out of a French kitchen soup to swinging off rafters, tearing down a warehouse, playing undercover alien, etc.  That's a protagonist!\n\nThe one hour mark of any movie is a particularly special point, whether it's the shark appearing in Jaws, Silva's reveal in Skyfall... In this film it's gathering acceptance from Leonard Nimoy, which instantly turns on us as we realize he is with the other possessed males.  Is he an alien?  Has he never not been Mirror Universe Spock all along?  We learn this as he walks out of building 227, which is Sutherland's home.\n\nThere's such an air of mystery here, the flowers, their purpose, everything involved with this alien invasion.  How is it happening, and why?  Why is it happening this way and what are the men's role?  There's a terrific level of conspiratorial guessing, it's exciting.  The birth of Body Snatcher's must've inspired Peter Jackson's Uruk Hai growing from tree roots in Lord of the Rings, like butterflies emerging from cocoons - are their screeches used as sound bites for Black Riders?\n\nInsanity conquers the Earth, and a helpless female is all that hopelessly remains.  Not even our hero can survive.  We know she'll be the only sane person left in a world gone mad.  This film raises questions of infections, particularly the psychological, in which the values of one culture are diminished in favor of its opposite, and how it trickles down and invades the individual.",
            "review_date": "2015-02-09",
            "source": "rt"
        },
        {
            "content": "Sci fi and paranoid conspiracy thriller mixed to great effect in a brilliant update of the B movie classic featuring impressive effects and dark humour",
            "review_date": "2015-02-08",
            "source": "rt"
        },
        {
            "content": "Haunting,paranoid remake of 50s sci-fi classic;be careful of your neighbor or the bus driver.Star Trek fanboys:look for appearence of Leonard Nimoy",
            "review_date": "2015-01-25",
            "source": "rt"
        },
        {
            "content": "Phenomenal science fiction classic!!! John Carpenter's: The Thing is still my favorite remake of all time, but this is definitely in second place!",
            "review_date": "2015-01-24",
            "source": "rt"
        },
        {
            "content": "The Invasion of the Body Snatchers is a Sci-fi Horror with the paranoia and terrifying special effects of the Thing, the fear of sleeping of Nightmare on Elm Street, and the overall tense atmosphere of truly great thrillers largely due to the eerie score, direction, and cinematography.\n\nThe performances are excellent as well, avoiding many horror cliches but the film still remains fairly predictable. Political and social commentary is very apparent throughout the film (even if not intended).\n\nThe unforgettable ending leaves a sense of hopelessness but also a warning to avoid and escape from the influence and deception of the world (or in this case, out of this world) that takes away your identity as an image bearer of Christ.",
            "review_date": "2015-01-24",
            "source": "rt"
        },
        {
            "content": "Segundo remake de un clÃ sico de los 50's uno de mis favoritos de todos los tiempos, esta vez las segundas partes son buenas, a su estilo Philip Kaufman dirige esta historia de los usurpadores de cuerpos tal vez su mejor film.",
            "review_date": "2015-01-20",
            "source": "rt"
        },
        {
            "content": "One of the best remakes of all-time (trailing The Thing and Scarface for me).  Creepy, but exciting premise that is paced well with a lot happening for a movie of this type.  Donald Sutherland is the perfect fit for his role, and he is very believable in a movie that could teeter on the absurd if not so well done.  The original is also very good, but this one is much better.\n\nGrade = 8.5/10",
            "review_date": "2015-01-06",
            "source": "rt"
        },
        {
            "content": "A bit conflicted, in all honesty. There was an awkward disconnect in portions of the plot that made the story seem rushed and a bit off, but with such bold camera work and strong use of sound, i'm not really sure where i stand. It was good, of course, but choppy in a way i don't believe was intended, which certainly detracted from the two-hour voyage",
            "review_date": "2015-01-05",
            "source": "rt"
        },
        {
            "content": "Liked it even though it's a bit dated for my taste.",
            "review_date": "2015-01-02",
            "source": "rt"
        },
        {
            "content": "A thrilling double-bill of this classic tall-tale of alien bodysnatchers, based on Jack Finney's novel, for latter-day audience, perhaps we can still recall the latest remake THE INVASION (2007, 5/10), as a star vehicle for Nicole Kidman and Daniel Craig, which was dead on arrival as a major flop and presages their next colossal box-office fiasco THE GOLDEN COMPASS (2007, 4/10). \n\nFortunately these two earlier versions are considerably better than the ill-fated mega-star paycheque product, the original 1954 film is directed by Don Siegel (DIRTY HARRY 1971, 7/10), within a condensed 80 minutes, it delineates the absurd story with a gripping pace and impressive monochromatic cinematography. \n\ncontinue reading my review on my blog: http://wp.me/p1eXom-1LD",
            "review_date": "2014-12-30",
            "source": "rt"
        },
        {
            "content": "Pretty good given its so old of a movie.",
            "review_date": "2014-12-07",
            "source": "rt"
        },
        {
            "content": "This movie holds up so well. I had never seen it before, but I was intrigued the whole time. Even though I knew most of the ending of this film, I still enjoyed the journey. Some of the camera work in this film is so exciting and still is impressive by today's standards. And director Philip Kaufman establishes the tone of this film so well, it feels like it really set the standard for many other movies of the early 80s. All the performers are great, and I was really drawn into what was going on through their performances.",
            "review_date": "2014-12-01",
            "source": "rt"
        },
        {
            "content": "a scary thrilling movie.  a really good remake maybe one of the best",
            "review_date": "2014-11-17",
            "source": "rt"
        },
        {
            "content": "An exercise in skin-crawling paranoia and one of the bleaker alien invasion movies out there.",
            "review_date": "2014-11-05",
            "source": "rt"
        },
        {
            "content": "A good story that holds up pretty well. It's no wonder there are so many versions. My girls liked this a bit, and were freaked out too.",
            "review_date": "2014-11-03",
            "source": "rt"
        },
        {
            "content": "The ending is too famous for me not to have known, but overall the film was a good reminder not to trust plants",
            "review_date": "2014-10-28",
            "source": "rt"
        },
        {
            "content": "A remake that actually is a fresh take on the original. The film is decent with some creative camera work and great special effects.",
            "review_date": "2014-10-26",
            "source": "rt"
        },
        {
            "content": "A film now filled with recognizable actors & actresses such as Lenard Nimoy who played Spock in Star Trek, \nDonald Sutherland Who played Odd Ball in Kelly's Heroes, Karen Allen Who played Marion RavenWood in Raiders of the Lost Ark, Jeff Goldblum who played in Jurassic Park\n\nThe movie is filled with a lot of odd camera angels. The sound effects and music tend to be louder than the vocals. Therefore I felt like falling asleep due to having a difficult time listening to the dialog.  \n\nThe movie is too long and there is not enough action. \n\nDuring the movie I kept thinking; Let the movie end. It's boring. I felt like wanting to go to sleep. \n\nThis film was horrible as it was more gross, disgusting, and disturbing rather than a horror film.\n\nThe film also has nudity towards the end of the film so beware when watching the film if that is a concern of yours.",
            "review_date": "2014-10-24",
            "source": "rt"
        },
        {
            "content": "One of the few horror film remakes that proves that you can do an already classic film justice if you handle the material well.",
            "review_date": "2014-10-19",
            "source": "rt"
        },
        {
            "content": "One of the better remakes, its very glad idea that has been often imitated. Overall I gotta say if you are a fan of old horror movies that this is a must see, but if you want the more face paced films of today, this might not be your cup of tea.",
            "review_date": "2014-10-17",
            "source": "rt"
        },
        {
            "content": "The directing is phenomenal, and the special effects are even more so. Unfortunately, it suffers from bad acting, a mismanaged and poorly planned script, terrible dialogue, and poor set design. Anybody who thinks this is better than the 50s version...whatever man. Just keep that shit out of my house.",
            "review_date": "2014-10-03",
            "source": "rt"
        },
        {
            "content": "89%\nAn atmospheric buildup and shining performances help make Invasion of the Body Snatchers a truly terrifying classic.",
            "review_date": "2014-10-02",
            "source": "rt"
        },
        {
            "content": "A fantastic film with an ending that will stay with you.",
            "review_date": "2014-09-29",
            "source": "rt"
        },
        {
            "content": "The film is very simple to enjoy. There are no major plot twists that can over complicate some stories. This film stays true to its origins. However in the 1956 film the invasion began in a small town and in this film it moves to the big city of San Francisco. This film also plays on the psychology craze that seemed to sweep the nation between the mid 60's and early 80's. Apparently for a while shrinks were the in crowd. I try dealing with them but they just keep wanting to lock me up. It is a conspiracy. Anyway this film is easy to watch and good if your wanting just a hint of horror and mostly looking to feed on nostalgia. \n\nThe action was pretty weak and the sci-fi was almost non existent at times. The few times that special effects did play out full on in this film was worth it. The scene of the pods giving birth to the doubles is both organic and entertaining. Mostly this picture relies on the cast to act out with emotion and later without emotion to convey the thrills across to the audience. I don't think that it came off quite how the director intended. At times Donald Sutherland looks more like a psycho perv than an emotionally concerned citizen. He definitely didn't know the term \"personal space\" because he all but crotch rocks Brook Adams in almost every scene they share. Which is a lot because hey!- I noticed!.\n\nLeonard Nemoy's character is spot on as a psychiatrist and Jeff Goldblum is almost watchable. This version is almost like watching the more recent adaptation with Nicole Kidman except you don't have to endure Nicole. She ruined \"Invasion\" for me! One of my favorite stories of all time. All in all this film is watchable and I enjoyed it for what it was- cheeky fun and nostalgic nuance. However the best Body Snatcher movie for me is 1993 version on the military base with Gabrielle Anwar.",
            "review_date": "2014-08-22",
            "source": "rt"
        },
        {
            "content": "Gave this sci-fi classic a spin in advance of listening to The Projection Booth Podcast review it and the various versions from over the years, and I have to say that I thoroughly enjoyed it. It's filled with a nice amount of dread and paranoia, which builds to the iconic ending that I was unfortunately already familiar with, but that's how things work nowadays when something has penetrated pop culture so completely.\n\nRecommended.",
            "review_date": "2014-08-15",
            "source": "rt"
        },
        {
            "content": "One of those rare remakes that surpasses the original in many ways.  Don't get me wrong I like the original; but this one is creepier, has a better cast, better special effects (I love practical effects!), better music, and just works so well.  This one, despite it's very seventies look, actually holds up better than the original. Sutherland is great, as is Nimoy and Goldblum...and I also loved the nod to the original with Kevin McCarthy screaming that \"they are already here!\" much like his role in the end of the original film.  This film was creepy with great effects, and I really enjoyed it a lot.",
            "review_date": "2014-07-25",
            "source": "rt"
        },
        {
            "content": "This is one of those remakes that truly makes you think about whether you liked this version or the original so much better. There have never been remakes out there like what Philip Kaufman is giving us here.",
            "review_date": "2014-07-10",
            "source": "rt"
        },
        {
            "content": "Invasion of the Body Snatchers succeed in the contemporary game of horror alien movies and exceed expectations as a remake.",
            "review_date": "2014-07-05",
            "source": "rt"
        },
        {
            "content": "They get you when you sleep. Philip Kaufman's excellent remake of Don Seigel's 1956 horror classic featuring a great cast, eerie sound design, stunning special effects and an unforgettable ending. The directorial techniques and camera work employed by Kaufman and DP Michael Chapman generate great suspense. Invasion of the Body Snatchers is a perfectly executed sci-fi horror but it's first and foremost a great paranoid thriller.",
            "review_date": "2014-07-03",
            "source": "rt"
        },
        {
            "content": "Among the confusion, uneven acting, lengthy first half, and unsatisfactory resolution, you can squeeze some genuine fun found perhaps in the perverse means of the alien pods. Not really a 'must-see', but a film that is inoffensive to sit through and watch.",
            "review_date": "2014-07-01",
            "source": "rt"
        },
        {
            "content": "While the original Invasion of the Body Snatchers from 1956 was a B movie classic, the remake by the great Philip Kaufman nearly eclipses its predecessor, a rarity among rarities. Horror fans usually bring it up when talking about remakes, as well as John Carpenter's remake of The Thing and David Cronenberg's remake of The Fly. It takes the basic plot elements of the original film and mixes them up, as well as doing some original stuff with the material. There's even a cameo by Kevin McCarthy, who starred in the original film. The stellar cast includes Donald Sutherland, Leonard Nimoy, Jeff Goldblum, Veronica Cartwright, and Brooke Adams. The effects are fantastic (and hold up) and the idea gets under your skin. A classic film.",
            "review_date": "2014-06-08",
            "source": "rt"
        },
        {
            "content": "One of the best Sci-Fi thrillers ive ever seen",
            "review_date": "2014-05-18",
            "source": "rt"
        },
        {
            "content": "Top 10 Sci~Fi Movie of All Time!",
            "review_date": "2014-05-07",
            "source": "rt"
        },
        {
            "content": "Directed by Philip Kaufman (The Right Stuff (1983), The Unbearable Lightness of Being (1988) and Henry & June (1990)), and adapted from Jack Finney's 1954 book The Body Snatchers, which became Don Siegal's 1956 Invasion of the Body Snatchers. This version is darker and has more body horror and blood on display, and it makes for very creepy and unsettling viewing, but it's bloody brilliant. In San Francisco, health inspector Matthre Bennell (Donald Sutherland) and his assistant Elizabeth Driscoll (Brooke Adams) notice people close to them appear to be distant and soulless. It began when Elizabeth brought some pink flowers home, and she notices the changes in her boyfriend Geoffrey Howell (Art Hindle), Matthew suggests she see's his friend Dr. David Kibner (Leonard Nimoy) about it. Dr. Kibner claims that Geoffrey wants out of the relationship. Then things take a sinister turn when Matthew's other friend and aspiring writer Jack Bellicec (Jeff Goldblum) and his wife Nancy (Veronica Cartwright) discover a deformed body in the mud baths they own... It's a rare instance of a horror remake working better than the original, the imposing skyscrapers of San Francisco add to the eeriness of the imposing and upcoming danger coming soon. It has some good horror make-up for it's day, and it's still effective now and a dark parable on 1970's America.",
            "review_date": "2014-04-29",
            "source": "rt"
        },
        {
            "content": "Brilliant and appealing with well edited sound effects and a gritty feel, Invasion of the Body Snatchers is an example of a well done remake!",
            "review_date": "2014-03-29",
            "source": "rt"
        },
        {
            "content": "The themes this movie tackles are very 70's as compared to the 50's version. Where as the 1956 version was, to put it simply, communism, this version is more about the lack of human interconnectivity. It was interesting even if a little dated and preachy.  Lenorady Nimoy doing a solid job in a rare non spock role, his face has so much character is so hard to look at him as anything else. This movie does a solid job of keeping you guessing and being a little scary (the old reliable \"dont fall asleep\" premise). Also no music during the closing credits = bad ass move.",
            "review_date": "2014-03-22",
            "source": "rt"
        },
        {
            "content": "SUMMARY: A health inspector gets numerous complaints from a co-worker and friend that her husband is acting really weird. Soon them and a bunch of others realize the whole city is acting weird and they discover pods and that your body is being replaced with ones that have no emotion. REVIEW: I am at a lost for words on how good this movie is. Also for it being a remake too. It's a good example that you don't need cheap scares and gore galore to have a creepy and genuinely scary movie. The acting was done perfectly. It was acted out with total excellence. Of course tons of great talent was the cause of the that. It has been a long time since a movie has creeped me out this much and so this movie is a great horror film. Everything from the creepy music and creepy body morphing right to the very scary and chilling ending. Even no music at the ending credits so that you can still be in shock at the ending makes it creepy too. It makes you feel like there's no way out and that just scares the hell out of you. This is a great horror movie that was done with excellence. I heard the director Phillip Kauffman has a good resume and with movies like this I can see why. Good job to him and the whole cast and crew for what should be one of the greatest horror movie's of all time.",
            "review_date": "2014-03-17",
            "source": "rt"
        },
        {
            "content": "While I don't find it as entertaining or as socially important as the original it is still a well made and stylish sci-fi/horror film that is a must watch.",
            "review_date": "2013-12-27",
            "source": "rt"
        },
        {
            "content": "Invasion of the Body Snatchers was said to be a good film and a good remake. Though I have not seen the original, I was set up to be pleased with this piece. That didn't happen though.\n\nInvasion of the Body Snatchers began as an interesting science fiction thriller, but it quickly dissolved due to its excessive talking in the story. It opens with much promise and it uses strong visual effects to show how the gelatinous creatures from another planet came to earth to develop on plants, and instantly its fascinating. And the world becomes a complex place soon because the people within it are wondering why the world feels different. As it slowly unravels what is happening, hints of interest are dropped. Eventually though it takes too long to unravel it all. \nI mean, essentially all that happens is an excess of talking that goes on. Characters voice their fears and anxieties about the world and try to figure out what's going on, but it takes too long for things to move. Invasion of the Body Snatchers has a pace which doesn't develop at an entertaining rate. It gives time for the humanity to set in and for viewers to understand the actual thrill of being on a planet full of mysterious creatures bent on being the dominant species, but it doesn't explore the science fiction elements that much at all. \nThe thrills in the story decrease fast after they begin because they show promise before the slow pacing sets in, and after that there just really isn't all that much movement. I didn't feel anymore thrills, I just felt like I was waiting around for something to happen but nothing much ever really did. Invasion of the Body Snatchers no longer felt like an invasion, it felt like a delay for something big to happen. Since the impact of the story had been weakened I no longer really cared for any of the characters and so when they changed and such I never really felt anything. This ended up weakening director Phillip Kaufman's atmosphere and the power of the theme facing a planet of people which is gradually overrun with doppelganger creatures which keep going until they reach the last man alive, and so what could have been a film with similar intense science fiction ideals to the earlier Charlton Heston film The Omega Man was instead juts a basic drama which made it easy to forget about the complex thrills of the science fiction universe surrounding the characters. At times, Invasion of the Body Snatches is gritty and the cinematography is consistently strong, but I found myself disappointed to find that it took its high concept plot but dissolved into being a dull and generic thriller, even if it does have good visuals and great sound effects.\nBut it was well acted. Although I couldn't see fit to connecting to the characters, Donald Sutherland made a strongly charismatic dramatic lead, capturing the essence of his character and dealing with the complex drama of being the human to discover extraterrestrial life within the fabric of his own society and then watch it collapse all around. Donald Sutherland reminds us what makes him a great actor, and he proves to be a powerful lead.\nBrooke Adams was also a strong and attractive lead, and she shared an amiable chemistry with Donald Sutherland which established a real sense of care going on between them.\nLeonard Nimoy was also good, even though he was working with a complex and strange character. Jeff Goldblum was decent too.\n\nBut still, Invasion of the Body Snatchers loses its edge about halfway through and no longer becomes memorable for much more than the talents of its strong cast.",
            "review_date": "2013-12-16",
            "source": "rt"
        },
        {
            "content": "Not bad. I can see how it would have been cool in 1978, but it really doesn't hold up that well.",
            "review_date": "2013-12-14",
            "source": "rt"
        },
        {
            "content": "[img]http://images.rottentomatoes.com/images/user/icons/icon14.gif[/img]",
            "review_date": "2013-12-09",
            "source": "rt"
        },
        {
            "content": "A stylish, well made remake.",
            "review_date": "2013-11-27",
            "source": "rt"
        },
        {
            "content": "Now when I heard their was a remake to one of my favorite sci fi films of all time the 1956 Invasion of the Body Snatchers and that it had received huge praise as being on of the best remakes ever to come out of Hollywood I got hyped. However, as I watch it I noticed something horribly wrong. The story and narrative seemed to be all over the place. The movie couldn't decide who would take us on this story also they wasted Leonard Nimoy and didn't give him anything to do in this film (how is that possible)! To sum up it is a let down and doesn't have that desperate and chilling feeling the original gave me and the shrieking sound that the snatchers use isn't scary it's just over the top goofy. Also, if they were trying to make this film to give the female character a better and bigger role they sure \"accomplished\" that this female main character gets to walk around naked. Glad to see we're moving forward; not really.",
            "review_date": "2013-11-22",
            "source": "rt"
        },
        {
            "content": "Far less of a success than the prior version which had truly unsettling moments and characters I honestly cared about. I was bored for the first hour or so and while the latter half was better-paced, I've seen all the beats before. Some of the imagery is rather unforgettable (like the man-dog) and the piercing shrieks the villains make are effective, but I never found myself on the edge of my seat. The ending is probably the biggest surprise...but I've seen it countless times in other forms of media.",
            "review_date": "2013-11-20",
            "source": "rt"
        },
        {
            "content": "http://filmreviewsnsuch.blogspot.com/2013/10/invasion-of-body-snatchers-1956-and-1978.html",
            "review_date": "2013-10-28",
            "source": "rt"
        },
        {
            "content": "Excellent for a remake...still very intense and scary after so many years...great acting by all the cast...one of Donald Sutherland's best roles...it is a classic..",
            "review_date": "2013-10-25",
            "source": "rt"
        },
        {
            "content": "After over 30 years, this movie holds up really well. It's very creepy. Don't let the PG rating fool you - it's not a movie for kids. It's one of those movies that was rated back when the system was more lenient (for example, Jaws is also a PG film). If it were rated now, I think it would get a PG-13 rating because of the brief nudity and some violence. It's worth a watch.",
            "review_date": "2013-10-25",
            "source": "rt"
        },
        {
            "content": "Interesting enough, and not another lame remake, but the acting and dialogue in the first half were disappointing. But then again, this was made in the seventies. Although the details are better explained here, it can't be compared to the horror of the original.",
            "review_date": "2013-10-09",
            "source": "rt"
        },
        {
            "content": "I still think this movie is absolutely terrifying.",
            "review_date": "2013-09-23",
            "source": "rt"
        },
        {
            "content": "It doesn't matter how old or simple or cheezy this movie or its special effects seem, it was genuinely creepy, brilliantly done. It's use of audio was well done and it didn't spoon-feed the audience. An excellent film; an excellent remake.",
            "review_date": "2013-09-14",
            "source": "rt"
        },
        {
            "content": "Um remake excelente, com um trabalho poderoso de Phillip Kaufman, criando um clima perfeito de conspiração.",
            "review_date": "2013-09-10",
            "source": "rt"
        },
        {
            "content": "A camp classic, albeit a minor work in most respects save an excellent concept.",
            "review_date": "2013-09-01",
            "source": "rt"
        },
        {
            "content": "Superbly acted and effectively haunting. It has aged very well and the ending still gives me the chills to this day. One of my favorite science fiction films of all time.",
            "review_date": "2013-08-29",
            "source": "rt"
        },
        {
            "content": "Whenever Amazing Grace plays, I think of this chilling film for just a moment.",
            "review_date": "2013-08-10",
            "source": "rt"
        },
        {
            "content": "A great movie. Very creepy, very atmospheric, great use of color, great camerawork (the handheld could be a bit distracting at times) and a great cast (with the possible exception of Veronica Cartwright). It's not even worth comparing it to the original, because it works on a very different way. I want to single out Jeff Goldblum because he's very fun to watch. My only slight regret is I think we could've waited longer to find out about Leonard Nimoy (I'm not going to spoil it). Overall, a great science fiction mystery thriller that is always off putting in the best way possible and without a doubt one of the best remakes ever.",
            "review_date": "2013-08-07",
            "source": "rt"
        },
        {
            "content": "A relatively tense but dull first half is more than made up for with an exciting and scary second half.",
            "review_date": "2013-07-17",
            "source": "rt"
        },
        {
            "content": "I found the original quite boring and this isn't much better. It's marginally better due to some decent effects but ulitimately it is one of the most over-rated horror films ever made.",
            "review_date": "2013-07-10",
            "source": "rt"
        },
        {
            "content": "Even better than the original. This version is more violent and detailed and all the better for it. It also packs a powerful ending.",
            "review_date": "2013-06-24",
            "source": "rt"
        },
        {
            "content": "A little overrated.  A few good moments, but not the classic it's often named.",
            "review_date": "2013-04-28",
            "source": "rt"
        },
        {
            "content": "A vey good remake of the 1950's version.",
            "review_date": "2013-04-24",
            "source": "rt"
        },
        {
            "content": "PLOT\r\nSome cauliflowers from outer space develop clones of humans, in order to replace them, while Donald Sutherland tries to frame up a local restaurant claiming that a caper is really a rat turd.\r\n\r\nThe invasion spreads very quickly. Leonard Nimoy, a.k.a. Dr Spock, tries to contain it with marriage counselling sessions. \r\nJeff Goldblum and his wife through mud bathings.\r\nAnd Brooke Adams by worrying very much and moving her pupils unsettlingly.\r\n\r\nWill our handful of heroes be able to defeat the aliens?\r\n\r\nMEANING\r\nHuman relationships have become so alienated that we have mutually become aliens to each other. This concept is represented literally: humans are substituted for aliens.\r\nThese aliens are cold and indifferent. They are the sci fi objectification of the sociological concepts expressed by Dr Spock (\"we get in and out of relationships as if they meant nothing\"). To the invasion of alien detachment is juxtaposed  and opposed the human warmth of the leading couple, formed by Sutherland/Adams, which toward the end, particularly, declare with effusion and warmth their sentimental inclinations. \r\nBut the alien coldheartedness looms over them.",
            "review_date": "2013-04-22",
            "source": "rt"
        },
        {
            "content": "Nearly as good as the original - and that's saying something.",
            "review_date": "2013-04-03",
            "source": "rt"
        },
        {
            "content": "One of the most thrilling movies I've ever seen. The acting is impeccable, and the story is timeless. You won't find a sci-fi movie much better than this!",
            "review_date": "2013-04-03",
            "source": "rt"
        },
        {
            "content": "Defining the slow burn genre, Invasion of the Body Snatchers is seems very real.",
            "review_date": "2013-04-02",
            "source": "rt"
        },
        {
            "content": "Oh, I don't know...didn't really do it for me- I actually preferred \"Invasion\" with Nicole Kidman.",
            "review_date": "2013-03-07",
            "source": "rt"
        },
        {
            "content": "Love this it's better than the newer remake",
            "review_date": "2013-03-02",
            "source": "rt"
        },
        {
            "content": "The remake of Invasion blows away the original in creepiness and believability. It feels more human which makes the loss of humanity all the more poignant. It also likely has one of the best conclusions in sci-fi history.",
            "review_date": "2013-02-19",
            "source": "rt"
        },
        {
            "content": "An exceptional remake &  one of the better films of the 70's. Sci-fi & horror are blended seamlessly in this beautifully constructed tale. It's a very entertaining & suspenseful horror film with a classic to draw from. Definitely a must see.",
            "review_date": "2013-02-12",
            "source": "rt"
        },
        {
            "content": "Creepy.  Very good cast.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "Word of mouth was right, this is a remake better than the original. While the original couldn't be too dark, this was made in the cynical 70s where bleakness ruled. Fantastic special effects and cinematography. 70s horror films knew how to be suspenseful and personal. I dare say this is as close to the best telling of the story we'll ever get.\n\nBefore seeing: I hear AMAZING things about this film.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "An updated remake of the 1956 sci-fi thriller which does not disappoint. Tense, intelligently made and acted, with some disturbing moments. Never let's up. Great cast in good form.",
            "review_date": "2013-01-12",
            "source": "rt"
        },
        {
            "content": "Description: ''Space-originating plants are changing people into duplicates with their pods.''\n\nIt's not as bad as it sounds! On the contrary, it's pretty darn good. I haven't seen the original 1956 version as yet (I understand it's considered as one of the best classic sci-fi films), but this 1978 update (which is considered as one of the best remakes ever) is meticulously crafted by director Philip Kaufman. His realism style of directing is very effective, creating a suspenseful and sometimes scary atmosphere. The performances are all fine, with leading man Donald Sutherland being the best. The story... though entertaining, seemed somewhat pointless (though I suspect there were underlying themes), and it does have its flaws. I might have to revisit this one, preferably to draw comparisons with the original, but for now I recommend it for viewing.",
            "review_date": "2013-01-10",
            "source": "rt"
        },
        {
            "content": "Dear TV Guide, you suck",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "Mediocre and lacking in suspense. Got better near the end.",
            "review_date": "2012-12-31",
            "source": "rt"
        },
        {
            "content": "This was better than I remembered. I have seen this twice before on tv and it is a well made film with great acting and solid story which proceeds in an interesting manner without letting the viewer down. I think the strenght of this movie is its capable cast, who make sure that what the film possibly lacks in depth and complexity of story it wins in interesting, believable characters. The ending is quite memorable.  The idea is not in special effects, but in what is going on. Everything is centered on people. Its just a well made scifi classic, and worth watching at least once, that pretty much says it. The only thing it lacks is humor. I was also left wanting something more complex in the way of the story. But it also lacks violence and manages to be interesting. Who knows, maybe there are alien spores out there somewhere, ready to float to the earth on solar winds take over the world as know it.",
            "review_date": "2012-12-30",
            "source": "rt"
        }
    ]
}