{
    "title": "A Bronx Tale",
    "rating": 8.6,
    "release_date": "1993-09-23",
    "genre": [
        "Drama",
        "Crime"
    ],
    "summary": "A young man grows up with his loyalties torn between his father and the mob boss who runs the streets.",
    "critic_reviews": [
        "A Bronx Tale is a very funny movie sometimes, and very touching at other times. It is filled with life and colorful characters and great lines of dialogue, and De Niro, in his debut as a director, finds the right notes as he moves from laughter to anger to tears. What's important about the film is that it's about values.",
        "A \"GoodFellas\" with heart, A Bronx Tale represents a wonderfully vivid snapshot of a colorful place and time, as well as a very satisfying directorial debut by Robert De Niro. Overflowing with behavioral riches and the flavor of a deep-dyed New York Italian neighborhood, the film also trades intelligently in pertinent moral and social issues that raise it above the level of nostalgia or the mere memoir.",
        "De Niro successfully varies the tone, keeping it light and playful at times, dark and somber at others. A Bronx Tale is his triumph, and a testimony that all those years of watching the best in the business have borne fruit. If what is yet to come has any of the promise shown by this debut, we may be witnessing the birth of yet another directing talent.",
        "He lacks Scorsese's raw inventiveness, but there's no denying De Niro's skill in keeping this pungent street epic brimming over with action and laughs without sacrificing intimacy. He is a supreme director of actors.",
        "Surprisingly sentimental by turns, this emerges not as just another gangster initiation movie, but as a story of father and son love with enough guts to hold those anticipating the former, while also touching the heart.",
        "The central conflict, the struggle for Calogero's soul, is stated with a fable's starkness. But the tone of the film is musing, reflective, gently insinuating.",
        "On the whole, A Bronx Tale is an impressive work and it's easy to see why De Niro connected with Palminteri's story.",
        "A Bronx Tale tries to cover too much ground; racial conflict, family drama, first love, the lure of the gangster life, and the joys and tribulation of coming of age in a kinder, gentler New York are all crammed into the slight story. It all feels too familiar to sustain the viewer's interest, but Palminteri's and De Niro's equally compelling performances help give it life.",
        "A Bronx Tale offers a warm, vibrant and sometimes troubling portrait of the community it describes. Almost everyone within that community sounds a little bit like Robert De Niro except Mr. De Niro himself.",
        "The story is riddled with absurd coincidences and improbabilities. It doesn't have an original bone in its body. And no one's going to leave this film thinking De Niro should stay behind the camera. But none of these problems stops the movie from being enjoyable. If Bronx Tale feels too familiar, it's at least the familiarity of good Italian movies.",
        "Despite some sentimentality and occasional directorial missteps, this is a respectable piece of work--evocative, very funny in spots, and obviously keenly felt. With Francis Capra, Taral Hicks, and Katherine Narducci."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "You can clearly see that De Niro as a director took some ideas from Scorsese's movies, like for example a main character narrating the movie in first person.\r De Niro's and Palminteri's acting was very good. Lillo Brancato did great, butYou can clearly see that De Niro as a director took some ideas from Scorsese's movies, like for example a main character narrating the movie in first person.\r De Niro's and Palminteri's acting was very good. Lillo Brancato did great, but not perfect.\r Overall it's a great movie that has some very clever lines and moral things to say.",
            "review_date": "2014-04-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If you are Italian, you must see this movie. Our culture is well documented in this movie as well as the tensions we have with other racial groups. At least the way it was in the 1960s. This movie just tells a great story. http://www.fromthisseat.com",
            "review_date": "2011-12-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "For a long time, A Bronx Tale had distribution problems, was out of print, and was widely unavailable. For those reasons, I hadn't seen it since I was a kid. Watching it again years later, not only did I realize just how good a movie it is,For a long time, A Bronx Tale had distribution problems, was out of print, and was widely unavailable. For those reasons, I hadn't seen it since I was a kid. Watching it again years later, not only did I realize just how good a movie it is, but I also found that I took a lot more out of it. While being widely considered as one of the best mafia movies of all time, A Bronx Tale actually has a deeper meaning, which is not to waste the talent you have in the time you are given. I was also surprised to learn that this story is in fact the true story of Chazz Palminteri's childhood, with Chazz being a nickname for Calogero. For those of you who don't know the story, it's about the son of a bus driver, who grows up in the Bronx, right down the block from a mafia hangout. While this boy learns different things from his real family and his mafia family, who are always at odds, they actually both want the same things for this kid. A Bronx Tale isn't just another gangster movie, there is some of that, but it's really an inspirational coming of age tale that I found to be very eye opening. The cast is of course fantastic, featuring Robert De Niro, who directs and stars in the film, along with Palminteri, who wrote the film. The true irony of A Bronx Tale is surrounded by the true story of Lillo Brancato, the boy who plays Calogero. As I said the story is about discovering right from wrong and not wasting your talent, something Brancato did when he was convicted of an armed robbery, which led to the death of an off-duty police officer. There are many sides to that, but I felt it necessary to mention how ironic it is that the message of the film is actually lost on one it's stars. In closing, A Bronx Tale really is a lost gem, that lives up to all the hype, and I hope that now that's streaming on Netflix, a whole new generation will be exposed to the message it puts out there for them to hear.",
            "review_date": "2013-02-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A Bronx Tale successfully brings out every emotion your system can handle. From anger, to joy, to laughter, to happiness, to sympathy, to empathy, to tears, and to, finally, satisfaction as the final scene fades into credits. This is DeA Bronx Tale successfully brings out every emotion your system can handle. From anger, to joy, to laughter, to happiness, to sympathy, to empathy, to tears, and to, finally, satisfaction as the final scene fades into credits. This is De Niro's directorial debut and he handles the challenge exquisitely. Complimented by Chazz Palminteri's slick and fearless writing that documents the struggles, the gangs, and the racism of the Bronx streets with no sugarcoating and no easy ways out.\r Adapted from its stage play counterpart, A Bronx Tale focuses on the famous area in New York where little nine year old Calogero (played by Francis Capra during his tender years) is growing up on the unapologetic streets with his bus driver father Lorenzo (De Niro) and his nervous mother. Lorenzo frequently warns Calogero that \"the saddest thing in life is a wasted talent,\" hoping that his son will take the path of untold success later in life.\r One day, while sitting idly on his stoop with his buddies, Calogero witnesses a murder. The murder was made by the area mafia boss Sonny (Palminteri). Him and his crew are respected, at the same time feared for their unpredictable actions and their checkered history. When called back to the scene by detectives looking for the murderer, young Calogero lies and refuses to confess. His father is subtly proud, but warns his son that he has just done a good thing for a bad person. The good news is their family won't be on the hit list. The bad news is their family is now on the suspicious list.\r Eight years later, Calogero, now played by Lillo Brancato Jr., is nicknamed \"C\" by Sonny and has become his main-man. His second son as well as his partner in crime. His father is somewhat oblivious to what his son has been up to recently, but he believes he can take care of himself, while still nudging him in the right direction.\r Sonny's philosophy is greatly different from Lorenzo's. It's \"nobody really cares.\" When the chips are down, who's there to care? Nobody. You're a worthless human. The brutally honest, shameless half of the glass. Sonny's philosophy sticks with Calogero, but he also keeps his father's in mind. Do the two connect? Maybe in some ambiguous, unorthodox way, but it just seems they are two contradicting ways of life. Here's a film that also shows us that if we're lucky, we get two different outlooks on life from two very different people. A man who works in a town and a man who owns it.\r De Niro was in a very rough position when it came time to grab a hold of the camera for this film. He could either take the easy way out and make a Goodfellas-style mobster flick or mimic his stellar character's lifestyle in Raging Bull. But he doesn't. He most likely was the go-to guy for help with the script and offered Palminteri advice, but in no way is this another mafia film. It's a unique kind of mafia film. It shows the long-lasting and life changing effects it has on a youth growing up on the wrong side of the streets.\r This greatly reminds me of a phenomenal film from the eighties that tackles the same sort of subject. The film was John Singleton's Boyz N The Hood, setting its sights on three troubled youths growing up in the hood and getting caught in the mix of crime, drugs, and racism. The film was Singleton's directorial debut as well, featured stellar performances from every actor in it, a genius script, and some fantastic honesty about the life of the hood. A Bronx Tale does the same, but centers its story around the mafia. Not glorifying the violence, not acting pretentious over other classics of the same genre, but taking a cliche and turning it into a gritty reality.\r What is important to learn from A Bronx Tale is that it's a movie with values. It believes that beliefs and values should be the first thing someone should consider when in a serious situation. Sometimes we don't think about the consequences and dive right into what we think will satisfy ourselves and turn out the way we want in no time. It too forms the question; is it better to be universally loved or feared? I'd rather be a little bit of both with a strong blend of respect.\r Starring: Lillo Brancato, Jr., Chazz Palminteri, Robert De Niro, Taral Hicks, Francis Capra, Kathrine Narducci, Clem Caserta, and Joe Pesci. Directed by: Robert De Niro.",
            "review_date": "2013-01-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A great film based on the true story of one of Chazz P. It started out as a one man play, then DeNiro saw it and optioned it and got it made. A wonderful story on a boy and his Bronx neighborhood and all the colorful characters , both goodA great film based on the true story of one of Chazz P. It started out as a one man play, then DeNiro saw it and optioned it and got it made. A wonderful story on a boy and his Bronx neighborhood and all the colorful characters , both good and bad. This kid is eye view of the criminals and the lure of easy money and power is alluring and seductive. The cast is wonderful and colorful, ala Godfather, shot beautifully and with humor and a peek into innocence and a world of reality of a neighborhoods dirty secret. A must see!!!",
            "review_date": "2010-10-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "the best movie ive ever seen u should go rent it or do something to get this movie because it was just absolutely amazing and ij ust baught this on dvd and i have not seen a better movie than this in my opionion",
            "review_date": "2010-11-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If you`re looking for the typical Mob movie this isn`t what you`re looking for.A Bronx Tale has mob activities, but it`s much more than that. I`t teaches you how it was to live as an Italian in the 60`s.The decisions you have to make whetherIf you`re looking for the typical Mob movie this isn`t what you`re looking for.A Bronx Tale has mob activities, but it`s much more than that. I`t teaches you how it was to live as an Italian in the 60`s.The decisions you have to make whether good or bad.",
            "review_date": "2013-10-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Unbelievable, one of the best movies I have ever seen.",
            "review_date": "2009-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A Superb movie that I think everyone should see.  It's a good coming of age story set against the mob and racial tension.",
            "review_date": "2018-10-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's always great to see these actors in action, the story is the same you see in most Italian-American movies, how a good boy/man gets involved with the mob. Nothing fresh, there are no spectacular performances here. But it's a good weekendIt's always great to see these actors in action, the story is the same you see in most Italian-American movies, how a good boy/man gets involved with the mob. Nothing fresh, there are no spectacular performances here. But it's a good weekend movie. Average",
            "review_date": "2012-12-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Thumbs up . GreatThumbs up . Great movie.999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999",
            "review_date": "2017-11-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This film depicts the life of Calogero ('C') and his relationship between gangster boss Sonny and his father as he grows up and becomes a man. The message this story presents is too do what makes you happy and to not waste your life andThis film depicts the life of Calogero ('C') and his relationship between gangster boss Sonny and his father as he grows up and becomes a man. The message this story presents is too do what makes you happy and to not waste your life and through away your talents. Definitely worth a watch.",
            "review_date": "2018-06-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Although it is a gangster movie there are not many action scenes, because the conflict is about the education of a young boy. So this movie is more psychological. Robert de Niro and Chazz Palminteri were great. Also the soundtrack is top.",
            "review_date": "2021-01-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Amazing mafia film, it's the first film directed by De Niro and he did a great job, the film written by Palminteri based on his childhood life, which make the film more realistic.If you like mafia movies, you have to watch this, but beAmazing mafia film, it's the first film directed by De Niro and he did a great job, the film written by Palminteri based on his childhood life, which make the film more realistic.If you like mafia movies, you have to watch this, but be informed that the film has more drama than action.",
            "review_date": "2020-05-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Robert De Niro, in his directorial debut also co-stars in this coming of age drama set (as the title suggests) in the Bronx, initially offering an extended frontispiece in 1960 before moving forward to 1968.Chazz Palminteri stars, and theRobert De Niro, in his directorial debut also co-stars in this coming of age drama set (as the title suggests) in the Bronx, initially offering an extended frontispiece in 1960 before moving forward to 1968.Chazz Palminteri stars, and the film is based on his original story and is filmed from a screenplay he and De Niro worked on together.The story revolves around Calogero aka \"C\", the son of De Niro's bus driving father Lorenzo. C's apartment is just a couple of doors down from the bar where Mafia 'boss' Sonny (Palmintero) runs all of his illicit dealings in the neighbourhood.Young C is drawn into the lifestyle, against Lorenzo's wishes, and has to balance his personal life and his desire to become what both his father and Sonny want him to be.It's a by the numbers story, but it plays out incredibly well. All the actors know where their boundaries are, but go to town within them.Add in a fantastic contemporary soundtrack and well thought out cinematography and the illusion of the late 60s is put up well on screen.The film is let down though by a lot of heavy-handed moralising. It does feel out of place having both of the male adults in C's life spending so much time spelling out the ideals he should be living by.Overall, it's a great film, but falls short of both perfection and brilliance!",
            "review_date": "2021-01-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I really enjoyed the relationship and the so called life lesson's that this movie gave.The relationship between the different racial groups was also good and the actors played their role flawlessly. The romance part for me was kind ofI really enjoyed the relationship and the so called life lesson's that this movie gave.The relationship between the different racial groups was also good and the actors played their role flawlessly. The romance part for me was kind of unneeded and was played not really that good.Overall pretty good time to eat some spaggeti",
            "review_date": "2020-05-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"A Bronx Tale\" is a labour of love that is guided by De Niro's excellent direction debut. De Niro wisely stays away from the main acting spotlight and lets the other actors, such as Chazz Palminteri and Lillo Brancato Jr./Francis Capra, shine\"A Bronx Tale\" is a labour of love that is guided by De Niro's excellent direction debut. De Niro wisely stays away from the main acting spotlight and lets the other actors, such as Chazz Palminteri and Lillo Brancato Jr./Francis Capra, shine bright as their colourful and likeable characters. In fact, the whole film is populated by colourful characters who have memorable things to say. They all live in a well-established depiction of The Bronx that is complete with a well-executed soundtrack. Lastly, they all play a part in telling a story that proudly walks the fine line between Comedy and Drama. Before seeing this picture, I was afraid that it was going to be De Niro taking a stab at being a poor man's Martin Scorsese, but instead he has created a film that stands on its own two feet because it is marked by a unique identity that makes it stand out from countless other films that involve gangs/mafias.",
            "review_date": "2021-08-21",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 30
}