{
  "title": "Naked",
  "rating": 8.3,
  "release_date": "1993-12-15",
  "summary": "Johnny (David Thewlis) flees Manchester for London.  There he finds an old girlfriend, and spends some time homeless, ranting at strangers, and meeting characters in plights very much like his own.",
  "critic_reviews": [
    "This is a movie of virtuoso nihilism and scorn.",
    "This is a painful movie to watch. But it is also exhilarating, as all good movies are, because we are watching the director and actors venturing beyond any conventional idea of what a modern movie can be about. Here there is no plot, no characters to identify with, no hope.",
    "Mike Leigh's stunning, corrosive Naked is one of the best movies of the year, and one of the toughest... Its manic mix of tenderness and degradation, hilarity and scariness, keeps you dangerously off balance.",
    "even in the notable ranks of Leigh's movie, TV and theater work-an oeuvre embracing high comedy, biting comment and shivering pathos-Naked is extraordinary. In the hands of Leigh and his magnificently gifted, gutsy cast, these days and nights on London's streets burn themselves on our minds.",
    "By the end of the film, there's even something vaguely inspirational about our antihero's painful journey through the bowels of his self-created hell.",
    "Naked is a mesmerizing character study, an attempt to stretch the emotional boundaries of truth on film as far as they will go. For once we think we've seen as much of Johnny as we can take, like an etching by Escher we start to see something else, a glimpse of another person easily missed.",
    "Those in search of escapism should not look to this motion picture, but anyone willing to assume the risk of facing the ugliness of Johnny's world will find a startling, gut-wrenching, eye-opening experience.",
    "Leigh’s gallery of haves and have-nots, of emotional anorexics and exploited deadbeats, carries a strong political charge that’s there for the taking. But the pic also plays simply as a black, offbeat comedy with a romantic undertow.",
    "Naked is as corrosive and sometimes as funny as anything Mr. Leigh has done to date. It's loaded with wild flights of absurd rhetoric and encounters with characters so eccentric that they seem to have come directly from life. Nobody would dare imagine them.",
    "Mike Leigh sees a Britain everybody knows exists but would rather not think about, and this is a nightmare journey, at once horrific and funny, through a twilight London of the excluded and the rejected.",
    "This is 90-proof, single-malt stuff. You sip it neat and you don't handle heavy machinery afterward. This movie will stay with you long after you've seen it, thanks to Thewlis's performance, Leigh's direction, Andrew Dickson's haunting bass-and-harp soundtrack, cinematographer Dick Pope's indelible images -- and the unalloyed, naked conviction of it all.",
    "Like Johnny's rants, Naked is a revelation, a parable of spiritual homelessness and the terror it engenders.",
    "You may feel like you need a drink and a shower when you come out of \"Naked,\" but at least you'll know you've been somewhere new.",
    "The astounding performance of David Thewlis as Johnny is in no small measure responsible for the success of Naked. Talking his way through every scene, his portrait of this drifter is mesmerizingly appealing, hateful, humorous, self-destructive, honest and compelling. Still, I am unable to separate my loathing for this character from my feelings about the formal achievements of this movie. The effect may be one of naked observation but the view is ugly and corrosive."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "No matter how much work you put into it, Thewlis has a magnetic personality, you'll be drawn unwillingly.Naked\n\nLeigh is challenging himself. Starting the film with such a heinous act, he is primarily challenging himself rather than settingNo matter how much work you put into it, Thewlis has a magnetic personality, you'll be drawn unwillingly.NakedLeigh is challenging himself. Starting the film with such a heinous act, he is primarily challenging himself rather than setting the tone of what you should prepare yourself of. The writer-director, Mike Leigh has a daunting task then, to keep us engaged and involved in characters that doesn't particularly speak with the common audience. There is very little space for him to wander here and there. The reasoning or justification might come off as a pretentious act. But Leigh is a clever chap. His film isn't obsessed with convincing you to follow or root for, in fact, any of the characters. He just wants you to observe them from a distance. And maybe, that is why at their most vulnerable state only, he decides to show us a close up.While the rest of the time along with distance, the surrounding or environment too is mapped for us to not fall into them. The film actually deals with plenty of themes, considering the fact that David Thewlis literally goes door to door, knocking some philosophical debates into others. But the endorsement strategy states it to stage the primary physical theme up front. And even though for the most part of the time the conversations are debates, as mentioned, they are often a part of distraction. Look, how there is background score while Thewlis spews his views and how unfinished most of the sentences are.The real target lies in the physical sequences. The way he walks, behaves, switches back and forth, reserves, embraces and in the end, even releases his emotional issues in an almost panic attack. The writing and execution is, of course, sharp and mature, but it is the performance, the conviction in them, that puts it all over the top and still balanced. Naked has the natural state of the least \"normal\" routine you could think of, and yet they are humans.",
      "review_date": "2019-06-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"I used to be a werewolf, but I'm all right ****Imagine 'A Clockwork Orange', but if Mike Leigh directed it.\n\nDavid Thewlis performance as Johnny is absolutely mind blowing and pure genius. One of the all time best. A despicable, yet\"I used to be a werewolf, but I'm all right ****Imagine 'A Clockwork Orange', but if Mike Leigh directed it.David Thewlis performance as Johnny is absolutely mind blowing and pure genius. One of the all time best. A despicable, yet care-free man that uses his intelligence to distracts you from how rotten he truly is.'Naked' doesn't shy away from presenting it's razor-sharp commentary on assault and rape, but will be hard for some to stomach. The script is fantastic with two stellar performances from Lesley Sharp and Katrin Cartlidge, and Leigh finest work.",
      "review_date": "2019-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Although it doesn't look like it, Naked is a chaotic film. Chaotic not in the sense of disorder, but in the sense of anxiety and suffocation.David Thewlis is nothing short of spectacular. All the praise for this performance of his is finallyAlthough it doesn't look like it, Naked is a chaotic film. Chaotic not in the sense of disorder, but in the sense of anxiety and suffocation.David Thewlis is nothing short of spectacular. All the praise for this performance of his is finally understood, while Mike Leigh's direction is so sharp it cuts deep.Most impressive of all is that it's not about caring or empathizing with the characters. It's just a recreation of a reality, of a time and a place. And even though it was made almost 3 decades ago, the moral rot that it exposes would apply perfectly in any place and in any current era.What an impressive film.",
      "review_date": "2022-10-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A movie that feels like the end of the hourglass is here and night will never end.",
      "review_date": "2018-11-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A Delightful Philosophic Medley.\"Do you think that the amoeba ever dreamed that It would evolve into the frog? Of course it didn’t. And when that first frog shimmied out of the water and employed its vocal cords in order to attract a mateA Delightful Philosophic Medley.\"Do you think that the amoeba ever dreamed that It would evolve into the frog? Of course it didn’t. And when that first frog shimmied out of the water and employed its vocal cords in order to attract a mate or to retard a predator; do you think that that frog ever imagined that that incipient croak would evolve into all the languages of the world, into all the literature of the world? Of course it **** didn’t. And just as that froggy could never possibly have conceived of Shakespeare so we can never possibly imagine our destiny\".",
      "review_date": "2019-07-28",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 20,
  "genres": [
    "Drama"
  ]
}