{
    "title": "RoboCop 3",
    "rating": 5.5,
    "release_date": "1993-11-05",
    "genre": [
        "Action",
        "Sci-Fi",
        "Thriller",
        "Crime"
    ],
    "summary": "Robocop saves the day once more. This time the half man/half robot takes on ruthless developers who want to evict some people on \"their\" land.",
    "critic_reviews": [
        "The familiarity of the high-armour shoot-outs and sfx-assisted set-pieces make most of this sequel feel surprisingly low-tech. Not bad entertainment, though.",
        "There's probably sufficient energy and violence in RoboCop 3 to satisfy undemanding action fans, but it's as mechanical as its cyborg hero.",
        "Though the story is tired, most of ROBOCOP 3's action sequences and special effects are imaginative and effective, and the gruesomeness of the first two films has been toned down in a commercially wise attempt to make it more accessible to the younger audiences who love Robocop.",
        "Unsurprisingly this is the worst in the RoboCop trilogy, with the plot proving ridiculous, excelling itself particularly in the climax. For what was a promising debut, it's reputation was quickly tarnished with the drivvel such as this that followed.",
        "This latest widget off the RoboCop assembly line is a bit better than the first sequel, which amounts to damnation with faint praise. Limiting the gore, but not the carnage, in pursuit of a PG-13 rating and more youngsters, pic remains a cluttered, nasty exercise that seems principally intent on selling action figures.",
        "Why do they persist in making these retreads? Because RoboCop is a brand name, I guess, and this is this year's new model. It's an old tradition in Detroit to take an old design and slap on some fresh chrome.",
        "The movie, which is deadly slow and full of Japanese-bashing, is also an undisguised merchandising promo.",
        "As for the conflict, it's hardly riveting and often it's downright silly. The sets and effects betray their downsized budget. And the Japanese bashing is less artful than in Rising Sun, though just as obnoxious.",
        "About as two-dimensional as a comic book, RoboCop 3 should be regarded as the last strike-out."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "There's a reason this film killed the franchise. The violence and action are replaced with cheesy comedy that is more cringe-worthy than actually funny. Everything is dumbed down, From the terrible plot to the terrible acting, It's just awful.",
            "review_date": "2018-10-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nI honestly like the overall atmosphere of these first 'Robocop' movies. The beginning of this third opus is simply amazing with these caricatures of the TV news.The story is kind of weird, some parts more than others. Like the little overpowered girl joining the resistance so fast and being involved in huge gunfights. In the end iy is just all about a classic resistance versus oppressor story but with so much around it. There definitely are some powerful symbols here and there. The protagonists are just over-stereotyped (like the punks) and american-ized (like characters' visions of armed justice and self-defense). Obviously they had to add an autodestruction system on the last opponent. How original and unpredictable.Before you realize and accept the fact that the commander leads his own troops in close combat and on the front lines, you also notice that several women play an important role and are strong. Amazing in a 1993 movie. The overall music is great even if sound effects could have been much better from time to time. There are as many effective jokes as there are boring and ridiculous ones. In some scenes you can really see an Iron Man lookalike. The end battles between Robocop and Chinese clones are really disappointing, almost laughable.In conclusion, this sequel sees the characters become more superficial than ever, but I found that the film still managed to bring an interesting depth to the whole.",
            "review_date": "2021-05-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "There's a reason this film killed the franchise. The violence and action are replaced with cheesy comedy that is more cringe-worthy than actually funny. Everything is dumbed down, From the terrible plot to the terrible acting, It's just awful.",
            "review_date": "2022-11-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "not even close to living up to its hype. Yes, it's a tiny bit better than the original, but it's still far superior to the second movie, which I always thought was incredibly cruel. This film feels more similar to Verhoven's original than thenot even close to living up to its hype. Yes, it's a tiny bit better than the original, but it's still far superior to the second movie, which I always thought was incredibly cruel. This film feels more similar to Verhoven's original than the second one and has an unexpectedly large amount of heart. Not too seriously, please.",
            "review_date": "2023-02-14",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 14
}