{
  "title": "Schindler's List",
  "rating": 8.8,
  "release_date": "1993-12-15",
  "summary": "Steven Spielberg's epic drama tells the compelling true story of German businessman Oskar Schindler (Neeson) who comes to Nazi-occupied Poland looking for economic prosperity and leaves as a savior. (History in Film)",
  "critic_reviews": [
    "Director Steven Spielberg has achieved something close to the impossible--a morally serious, aesthetically stunning historical epic that is nonetheless readily accessible to a mass audience.",
    "What is most amazing about this film is how completely Spielberg serves his story. The movie is brilliantly acted, written, directed and seen. Individual scenes are masterpieces of art direction, cinematography, special effects, crowd control.",
    "Spielberg restages the Holocaust with an existential vividness unprecedented in any nondocumentary film: He makes us feel as if we're living right inside the 20th century's darkest-and most defining-episode.",
    "Evinces an artistic rigor and unsentimental intelligence unlike anything the world's most successful filmmaker has demonstrated before.",
    "Because this film touches us so deeply, the catharsis has a power that few -- if any -- other moments in film history can match. And that's what establishes this as a transcendent motion picture experience.",
    "Overall this film is truly a triumph, its greatness being revealed in its tiny moments - the close-up of a swastika badge that introduces Neeson or the bungled defiance of Fiennes at his hanging.",
    "The movie is a triumph on almost every level-of artistry, technique, humanity, entertainment and spirit.",
    "If Spielberg’s account of the Holocaust is not his greatest movie, it is still the defining moment of his career, the point where his yearning to be taken seriously (The Color Purple, Empire of the Sun) finally fully merged with his filmmaking talents.",
    "In a severe, uncompromising manner that none of his previous films has approached, Spielberg has captured the terror of the Nazi reign as well as the determination and resourcefulness of those who resisted. He has created one of the most shocking movies yet made about the Holocaust (there were several walkouts at the screening I attended) and one of the most inspiring.",
    "The documentary style allows Spielberg to deliver his message without preaching. The clever use of light and shade also makes it visually stunning.",
    "Necessary holocaust movie made for a Western audience. At times over sentimental when the subject matter hardly needs any dressing up, this is a beautifully crafted, hopeful movie.",
    "Quietly devastating.",
    "The movie's ending at the train station and the modern-day epilogue feel protracted and indulgent...Apart from the ending though, this is Spielberg's most articulate movie ever.",
    "A powerful and affecting piece of work.",
    "Spielberg does an uncommonly good job both of holding our interest over 185 minutes and of showing more of the nuts and bolts of the Holocaust than we usually get from fiction films. Despite some characteristic simplifications, he's generally scrupulous about both his source and the historical record.",
    "Schindler's List, despite blatant compromises, is a rending historical document. But the film's near-certain victory is based less on merit than on the marketing of its ambitious intentions. The academy doesn't judge movies, it weighs them by subject matter. On that basis, Spielberg's epic tips the scales.",
    "This heavy-hitting fist lands with calculated deliberation. Despite Spielberg's obviously genuine commitment, \"Schindler's List\" feels strangely controlled -- more than impassioned. It's officially artistic, an engineered project of pride, Little Stevie's growing-up project, rather than an organically brilliant masterpiece.",
    "A ruthlessly unsentimental portrait of a German war profiteer's epiphany that inspires neither sorrow nor pity, but a kind of emotional numbness."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Steven Spielberg's greatest film. Powerful, emotional, thought provoking and a perfect film all around. Liam Neeson's acting is one of the best I've seen around and its directorial work is masterful. Essential.",
      "review_date": "2011-03-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It isn't a easy work making a worthwhile three-hour movie. Spielberg not only makes this as also drives an incredibly emotional, tense and powerful plot during this time.",
      "review_date": "2018-09-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The P.H. Metric 91/100Directing:  9/10\nA masterclass in direction. Spielberg’s connection to the source material pushed him to make something that defies any sort of dilettante criticisms. Every decision from the black and white to theThe P.H. Metric 91/100Directing:  9/10A masterclass in direction. Spielberg’s connection to the source material pushed him to make something that defies any sort of dilettante criticisms. Every decision from the black and white to the stones hits hard and hits well. Leaving the viewer with a piece that is entertaining, yet horrifically beautiful as well as being the sort of thing any student of cinema should be studying.Acting: 9/10Liam Neeson’s best role, before he revealed to the world that method acting is not something he subscribes to, which in turn means Liam Neeson plays Liam Neeson every time. The rest of the cast offers more nuanced performances that really provide the viewer with a subdued approach to such horrors, allowing the audience to feel disconnected from the tragedy, yet thrust into its dark world.Cinematography: 10/10Red, red, red. Visually perfect.Editing 10/10Editing makes a film, it cannot be said enough. Actors and the like get the credit, but editors along with the writers and directors are the heart, spine and brain of a film and this film only furthers to reinforce the fact that actors are far from needed to meld a film into something sublime.Score: 10/10Williams provides another stellar score, which raises the question would Spielberg’s films be as successful with out them? That said, Williams builds tension that spills morosely over tragedy and celebratory fatigue.Visual Effects: 8/10The shower scene aside, the visual effects are done well and kept in the century they are meant to be in and keeps the viewer planted firmly in the time period.Writing: 8/10The writing is superb, however it does have one to many touches of the Hollywood penmanship to it, which does cause the film to drift into a territory that feels a little unnatural for the artistic intentions of the piece.Production Design 9/10Superb production design, save for a few touches in the concentration camps.Costume Design 9/10Authentic and eye catching, though does fall victim to the standard nerd mistakes.Make-up/Hairstyle 9/10Several hairstyles feel off for the period and the make-up department does benefit greatly from the black and white.",
      "review_date": "2017-10-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis is one of those movies that I just have to give a 10. The actors, the visuals, everything is on point.Liam Neeson plays a fantastic Schindler, delivering a sense of power and superiority in  a situation where those two things are almost impossible to attain against the ruthless dictatorship. For me, this is his best role to date and it will likely remain at the top spot.Ben Kingsley fits perfectly into the role of Schindler's partner who just so happens to be jewish. Throughout their cooperation, he always remains faithful, having to rely on Schindler's good reputation several times, mostly in order to escape cold-blooded death.My favourite role in the Film is Amon Göth, played by Ralph Fiennes. He is the one who controlls the Concentration Camp. He is the one standing on a hill with his sniper rifle in the morning, shooting people's head off for fun. He lives an excentric lifestyle and even falls in love with a jewish girl. This type of affection makes even clearer one of the main messages of the film: The pure nonsense of the Holocaust. And the fact that even when a Nazi fell in love with a victim, it didn't make him or her question anything.Not only the actors are great though. Also the look of the film. In 1993, during the rise of digital filmmaking and exciting visual effects, to make a film black-and-white, is very daring. And boy does it pay off. I couldn't imagine this movie in colour. It wouldn't be as authentic. Furthermore, the use of black-and-white enables Steven Spielberg do something very clever, which is to incorporate color as a sparsely used stylistic device. The girl in the red coat is literally the only stain of colour in the movie, but what it does is very powerful. Amongst the thousands of anonymous victims shown, the girl in the red coat creates personality where there should be none. It illustrates the development and change of views of Schindler in a subtle, yet drastic way.Through these little things, the movie creates a very depressing, yet fascinating mood. There are moments where you see the people crammed together in the camp, being full of hope, convincing themselves that the worst days are over and from now on it will only get better. The viewer knows that there will be no improvement (further stressed through the massive running time of 3 hours and 15 minutes) and thats what makes it so depressing.All in all, there's nothing I would change about this movie. Everything was put together just right to create a cinematic, thought-provoking masterpiece that can only be made once.",
      "review_date": "2018-01-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Two weeks beforehand I had watched the Pianist. The Pianist was spectacular and well acted and I thought there was no way any Holocaust movie could top it. I was wrong. Schindler's List was moving, graphic, and fantastic. I'm pretty solid andTwo weeks beforehand I had watched the Pianist. The Pianist was spectacular and well acted and I thought there was no way any Holocaust movie could top it. I was wrong. Schindler's List was moving, graphic, and fantastic. I'm pretty solid and I never cry after movies. After Schindler's rant at the end, I honestly cried. Doing it in black and white was an interesting choice but the right choice. This was right around the time CGI was starting to become popular and it would have ruined the movie. The whole purpose of having it black and white was for two scenes in the movie. Amon Goeth was trul evil and a testament to how horrible the Nazis were. The soundtrack gives me chills every time I watch it. Schindler's List is my second favorite movie, it's only senior being the Shawshank Redemption. I recommend this movie to anyone.",
      "review_date": "2016-12-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Schindler's List is just as timeless and gut wrenching today in 2017 as it was when it was released in 1993. Steven Spielberg has created a masterpiece of cinema. Every directorial choice is so poignant and purposeful, and creates a story ofSchindler's List is just as timeless and gut wrenching today in 2017 as it was when it was released in 1993. Steven Spielberg has created a masterpiece of cinema. Every directorial choice is so poignant and purposeful, and creates a story of redemption in one of the darkest periods in human history. The entire cast gives outstanding performances, with Liam Neeson and Ralph Fiennes giving career defining ones. Schindler's List is essential viewing for history buffs, film buffs, and people who are looking for hope in the dark.",
      "review_date": "2017-11-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Shindler's List is a dark and emotional film taking place during WW2 and the rise of the Nazis. It tells the story of Oskar Schindler, a business man who sees the affects the Nazis have on the Jews and wants to do something about it. TheShindler's List is a dark and emotional film taking place during WW2 and the rise of the Nazis. It tells the story of Oskar Schindler, a business man who sees the affects the Nazis have on the Jews and wants to do something about it. The movie is masterfully directed and acted, showing people's emotion and the violence of the times in high levels of detail. It is a must watch.",
      "review_date": "2017-01-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Halfway through the movie, I already knew it was going to be my favorite movie; and five years later, it still is. Steven Spielberg did truly pay off in this movie winning a large variety of oscar wins and nomanations, including the academyHalfway through the movie, I already knew it was going to be my favorite movie; and five years later, it still is. Steven Spielberg did truly pay off in this movie winning a large variety of oscar wins and nomanations, including the academy award for best picture in the 1993 ceremony. Furthermore, the soundtrack (by John Williams) is outstandin as it totally fits with the actual content of the film. Finally, the acting by indivuduals such as Liam Neeson and Ben Kingsley is also great and should have gotten more nominations as a whole.",
      "review_date": "2017-03-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "in the period of II. World War. A jewish man..great man.This is the one of the best movies about II. World War. Liam Neeson is really good at this movie. Wonderfull scenes. wonderfull colors. and of course Steven Spielberg.. i can notin the period of II. World War. A jewish man..great man.This is the one of the best movies about II. World War. Liam Neeson is really good at this movie. Wonderfull scenes. wonderfull colors. and of course Steven Spielberg.. i can not understand how this guy is so succesful? how so talented? :D never mind.. just watch.. and if you thinking different about II. World War, this movie can change your mind.. have emotional and have fun !",
      "review_date": "2017-05-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the greatest masterpiece in history of cinematography. Movie full of grief, sadness, love, desperation, hope and passion that can't leave you untouched.",
      "review_date": "2018-02-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A lesson of humanity.This film tells the story of Oskar Schindler (Liam Neeson), a Polish industrialist who collaborated with the German war effort, after the invasion of his country, by keeping working in his plant many Jewish prisoners.A lesson of humanity.This film tells the story of Oskar Schindler (Liam Neeson), a Polish industrialist who collaborated with the German war effort, after the invasion of his country, by keeping working in his plant many Jewish prisoners. Aware that keep them working was to save their lives, Schindler hires as much as he can, going against his own interests and even raising suspicions among the Nazis. Directed by Steven Spielberg, this film also has the participation of Ben Kingsley and Ralph Fiennes. Based on a true story, the film screenplay is from Steven Zaillian.There are some movies that are so good and symbolic that ultimately overcome the art of cinema itself and become part of the heritage and memory of Humanity. This is one of those movies. There isn't any negative note to do: the cast exceeded expectations, the script is excellent, the costumes and scenarios are historically accurate. The cinematography deserves special positive note, with interesting camera angles and a very clever use of black and white. In recognition of this merit, the film won seven Oscars (best film, best director, best adapted screenplay, best cinematography, best art direction, best editing and best original soundtrack) and was nominated for another five statuettes (Best Actor, Best supporting actor, best costume, best sound and best characterization).The story told in this film is the living testimony of a sad page in world history, but that doesn't end in the past. The Holocaust ended decades ago but there's still genocide and ethnic cleansing in other parts of the World. If this film brings a message of compassion and humanity, this isn't only for some people, but transcends the issue of Jews or Germans to reach all those in this World are persecuted for their faith, ethnic or other perverse motivations.",
      "review_date": "2018-02-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "(99/100)Such an excellent movie, there are no words to describe the emotions displayed in this film. The best movie on the holocaust by far.",
      "review_date": "2018-02-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Schindler's List is Steven Spielberg's masterpiece. He directs Oskar Schindler's story of redemption with pure artistry, never sanitizing any of the brutal aspects of the Holocaust. This movie is not for the faint of heart, but if it can beSchindler's List is Steven Spielberg's masterpiece. He directs Oskar Schindler's story of redemption with pure artistry, never sanitizing any of the brutal aspects of the Holocaust. This movie is not for the faint of heart, but if it can be stomached it provides hope that goodness can be found in any circumstance.At over three hours, the entirety of this film cannot be condensed into one review, but let it be known that the story is told brilliantly through its technical mastery. Spielberg's use of color and the lack thereof set a proper tone and provide thought-provoking symbolism throughout. The editing of sound and the transitions from scene to scene are near-perfect, always serving the purpose of setting a sharp contrast between event and mood, so as to induce more thinking from the audience.The character of Oskar Schindler is treated in such a way that he is relatable and simply human, which further bolsters the purpose of the movie. The writers did not shy away from showing in great detail his moral flaws and other character imperfections. None of us are perfect, even the greatest heroes among us, and Schindler truly was one of those heroes, despite his flaws. Neeson does a fantastic job at playing two roles in the film: the pre-redemption and post-redemption Schindler. Ralph Fiennes also brilliantly portrays his character, depicting the truth that evil is often caused in men because they are broken. He is just as conflicted as anyone else would be, and it eats away at him, worsening his moral nature even further. Really, what Schindler's list really does wonderfully is its presentation of its themes. With its technical work, realistic acting, and well-crafted script, it leaves nothing unclear and sends powerful messages that are well worth pondering. The only area that is fails is pacing. It's not nearly as dry as one would think it would be with a 195-minute runtime, but there are moments where it feels like the exact same thing is happening more than once, and the second and third acts thus feel like a bit of a drag at several points. But despite this, Schindler's List is a well-layered, strikingly well-organized account of a true story that packs an emotional punch that teaches a great deal of good about the persistence of human virtue.Story: 9.5Acting: 10Script: 10Visuals/Sound: 10Entertainment Value: 9.5OVERALL SCORE: 9.8/10",
      "review_date": "2018-05-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's a masterpiece, in general, an accurate and amazingly written screenplay about a man who realized that these suffering people were no different than him and his party. Liam Neeson's acting is superb, but Ralph Fiennes is something else,It's a masterpiece, in general, an accurate and amazingly written screenplay about a man who realized that these suffering people were no different than him and his party. Liam Neeson's acting is superb, but Ralph Fiennes is something else, something that is complicated, sadistic, and overall, pure evil. My ancestors perished in a concentration camp. This story gives the Jews what they deserved; some sympathy. It's realistic and compassionate and one of the greatest films ever made. Spielberg will go down in history one of the top film directors (right below Stanley Kubrick).",
      "review_date": "2013-10-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "unless you are a skin head , nazi , or a racist you can not hate this film . this is some of the best film making ever to be done . this is easily spielburgs best film . we all learn in school about what happend to the jews in WWII and mostunless you are a skin head , nazi , or a racist you can not hate this film . this is some of the best film making ever to be done . this is easily spielburgs best film . we all learn in school about what happend to the jews in WWII and most of us just think that sucked and dont think about it much more . well this movie gives a visual view and performances that really make you think about it alot more . it shows the monsters of humanity in there most vicous form and makes you think . which is very rare in film making . the acting in this film is some of the best ive ever seen raph fines who does amon goth the head of the jewish camp does him so well he comes off more scary then any hollywood monster ive seen . liam neison gives a outstanding perfromance as well as oscar shcindler as we wach a man start off only caring about the jews to make money off of start to see he's working for monsters and has to do something to help. the black and white look was a great idea for this film . it almost makes you feel you are waching a WWII documentory and theese events are really happening . even when you relise you are waching a hollywood film still doesnt change that this is based on actaul events . its a film every one should see atleast once . it is bloody and gory and extremely violent but to do it less then it was woulda been a shame to water down the horrors that happend back then and not tell the story of what the jews really went through in that peroid of time. it is some thing every one should know about so they truely under stand why the nazie's where the scum of the earth.",
      "review_date": "2010-08-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Outstanding! Great performances, insightful, powerful, and touching argument; yet not overly emotional. Beautiful phography, and it is mostly historically accurate- I guess some changes were made- and well, the movies is much, much more! IfOutstanding! Great performances, insightful, powerful, and touching argument; yet not overly emotional. Beautiful phography, and it is mostly historically accurate- I guess some changes were made- and well, the movies is much, much more! If you haven't seen it, just go and do it...no comments here will be good enough. So  experience it yourself for watching this movie, independently of how you feel when you finish doing it, is 'A MUST' for all those who, as myself, love the performing arts.",
      "review_date": "2012-01-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Honestly one of the greatest motion pictures of all time. Steven Spielberg really out did himself here with this film. It is sheer genius and a perfect picture. He couldn't have painted a better picture.",
      "review_date": "2012-11-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Just an all around Amazing movie. I highly recommend it. This movie just was sooo emotionally satisfying. I can't recommend it enough. It had great acting,directing,cinematography, and everything. It is a bit long though but it's definatelyJust an all around Amazing movie. I highly recommend it. This movie just was sooo emotionally satisfying. I can't recommend it enough. It had great acting,directing,cinematography, and everything. It is a bit long though but it's definately worth it if you pay attention to the movie.",
      "review_date": "2010-08-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Certainly one of the best movies I've ever seen. It is heavy and disturbing while describing the Holocaust, but also very detailed and realistic when describing personalities like Amon Goeth's and Oskar Schindler's. I was surprised when ICertainly one of the best movies I've ever seen. It is heavy and disturbing while describing the Holocaust, but also very detailed and realistic when describing personalities like Amon Goeth's and Oskar Schindler's. I was surprised when I found out, at the end of the movie, that Spielberg was the director, since this is not the type of movie he usually makes. My respect for him improved because of this movie. Some scenes are simply masterpieces, like those in which you can see some colors. Soundtrack is also great, making it an even more touching movie.",
      "review_date": "2011-09-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A very beautiful, epic and dark story about courage and the desire of living, a masterpiece made by Steven Spielberg this is one of those films which if you didn't like it, you have got no heart.",
      "review_date": "2011-10-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A gut wrenchingly beautiful masterpiece about the horrors of the holocaust, Schindler's List is Steven Spielberg at his finest and most emotional (rightfully so).",
      "review_date": "2014-01-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie is brilliant, but a bit tricky. You can't watch it with the mind of today. You have to literally send your mind back into 1930's, but you can't stop there. Now you have to become German and try to see it from a German's view. ThisThe movie is brilliant, but a bit tricky. You can't watch it with the mind of today. You have to literally send your mind back into 1930's, but you can't stop there. Now you have to become German and try to see it from a German's view. This movie is for someone who is INTELLECTUAL and can pick up on the hidden meanings. It's not meant to be viewed by someone who doesn't have the mental capacity to see PAST the movie and into the meaning.",
      "review_date": "2012-12-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Schindler's List is an epic masterpiece that reaches down into the soul of human nature and plays with the strings of our hearts and minds by sending us to one of the worst places imaginable.  This film is not only one of cinema's greatestSchindler's List is an epic masterpiece that reaches down into the soul of human nature and plays with the strings of our hearts and minds by sending us to one of the worst places imaginable.  This film is not only one of cinema's greatest treasures, it is also my favorite film ever made.  This work of art takes us into Steven Spielberg's vision of the Holocaust, and serves us a deep and thrilling story about a hero who saved hundreds of people due to his bravery and courageousness.  Steven Spielberg is a true genius; in his career he has created classics such as Raiders of the Lost Ark or E.T. The Extra-Terrestrial, but no film he has ever crafted will ever live up to this one epic masterpiece of a film that changed the world of cinema forever as we know it.  When this film released in 1993, Steven Spielberg proved that he was not just a great filmmaker, he was an artist.  He gives the film so much power and depth to the characters and story, and no drama film will ever be able to touch the soul as this film did for me.  A masterpiece like this is hardly ever released, and it's not only about the Holocaust itself, it's also about a hero and how he stood up to the walls that surrounded him.  Oskar Schindler is one of the greatest heroes the world has ever known in my opinion, a member of the Nazi party who saw the corruption of what was going in this terrible time and did all that he could to save as many Jews as possible.  In the film he witnesses a girl in a red dress walking through the streets of Poland as Nazi's are grabbing Jews, and later he sees the girl in that same dress dead along with the other Jews about to be burned.  This revelation changes Schindler from a businessman into a man who sees the true evil of The Holocaust.  Oskar really is a flawed man as well, he has his problems like any normal human but his intentions still make me see him as a great man.  Liam Neeson's performance in this film is almost too good to be true, and he deserved an Academy Award.  This is acting at its absolute best and his final scene where he cries over the fact that he could've saved more people always brings me to tears.  Ralph Fiennes plays a truly sinister man as Amon Goeth, one of the worst men I have ever witnessed in a film.  He is ruthless and insane, but we see in some scenes that he is in love with a Jewish woman named Helen.  This is a very important part of his character, as it shows he has humanity inside him and that proves that he truly is a horrible man if he can feel love and compassion and still be that ruthless.  Fiennes plays this role brilliantly, and his darkness and depth he gives the character amazes me to this day.  Ben Kingsley plays Itzhak Stern who is Schindler's accountant and business partner during the events of the film, and he really is a symbol of Schindler's bravery.  He has a Jewish man working for him and they soon become very close, and that proves that Schindler truly grows a love for the Jewish people that begin working for him.  Ben Kinglsey is flawless as always and was truly the only man who could've pulled off the character with such passion and sympathy.  Steven Spielberg has always taken us into films where we wish we could've joined the adventure, but this was his first movie where I wanted nothing to do where he had taken us.  While other Holocaust masterpieces like The Pianist or Life is Beautiful are incredible for showing the survival of the Hlocaust, this one is a masterpiece for showing the brutality of it.  This was like nothing he had done before, and I am overwhelmed with happiness that other people love this film as much as I do.  This flawless masterpiece has been criticized by many ignorant people that have different issues with the film, and I think that' they have issues with the fact they couldn't think of a better film themselves.  Spielberg is truly, in my opinion, the greatest director of all time, mainly because he has been able to bring us both dramatic masterpieces like this and entertaining masterpieces like Indiana Jones or Jaws.  Schindler's List is my all-time favorite film, and for me, no other drama will ever be able to live up to the visionary genius that Spielberg has given us, and no other film will ever effect me like this movie has done.",
      "review_date": "2013-01-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Honestly, this movie touched my heart so much. It was as if I could feel the sufferings at that time. Truly this is a masterpiece that should be remembered for coming ages.",
      "review_date": "2014-02-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The black and white was used to eliminate any trace of glamour that critics could potentially accuse Spielberg of showing in his '93 masterpiece. Something as awful as the Jewish Holocaust doesn't need glamour; nay, it needs not to haveThe black and white was used to eliminate any trace of glamour that critics could potentially accuse Spielberg of showing in his '93 masterpiece. Something as awful as the Jewish Holocaust doesn't need glamour; nay, it needs not to have glamour. The film shows a unique telling of one of the darkest chapters in human history; from the enemy's point of view: in that, it shows that everyone has a limit, including Nazi Profiteer Oskar Schindler. The only color in the film is the red coat that the protagonist sees for only two brief moments in the film, and so appropriate was the one color choice to be blood red; a coat on an innocent girl, whom everyone is ignoring, just like a blood stain ignored (or insufficiently acknowledged) on human history. Brilliant work overall, and one of my favorite pieces of art.",
      "review_date": "2012-03-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Perhaps the most powerful movie I have ever seen. Every person on the planet should watch this movie at least once in their life. A Masterpiece that I will never forget.",
      "review_date": "2012-02-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best films ever made.......................................................................................................................",
      "review_date": "2011-09-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Although the story's a little biased towards the Jews, The sad, realistic WW2 masterpiece \"Schindler's list\" succeeds seducing the audience with sensational performances from Liam Neeson and Ralph Fiennes and marvelous directing from StevenAlthough the story's a little biased towards the Jews, The sad, realistic WW2 masterpiece \"Schindler's list\" succeeds seducing the audience with sensational performances from Liam Neeson and Ralph Fiennes and marvelous directing from Steven Spielberg.",
      "review_date": "2011-09-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I will say this. Schindler's List is one of the most haunting war movies that I've ever seen. So hurtful. So disturbing. It is kind of disturbing that you will probably not going to see it again. Because it is so good. Schindler's List is aI will say this. Schindler's List is one of the most haunting war movies that I've ever seen. So hurtful. So disturbing. It is kind of disturbing that you will probably not going to see it again. Because it is so good. Schindler's List is a masterpiece. Overall, it is one of the best war movies in cinema history so far.",
      "review_date": "2015-05-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A perfect 10 for this disturbing, touching and vital piece of film. evryone must watch this movie!",
      "review_date": "2006-06-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Probably one of the most emotionally engaging films ever made. The direction of the action and the performances all ehance what is a deeply moving film. The film content is one of both horror and compassion of the war time scenes that youProbably one of the most emotionally engaging films ever made. The direction of the action and the performances all ehance what is a deeply moving film. The film content is one of both horror and compassion of the war time scenes that you know really happened. It is difficult to explain the WOW factor of the film without explaining scenes but even then seeing is better than a thousand words. I got to the end of the film with a tear in my eye and actually had to say wow over what a terrific display had brought over me. Liam 'I can never remove my accent completely' Neeson was superb and even thought in most films I get annoyed hearing Liam rather than the accent of the character he is meant to be on screen, I could look past the Scottish German accent he was putting on the screen.\rThe Black and White of the film is the perfect choice as it sets the right tone and also ages the film to feel more like recording of the actual events than a film adaptation. It is a film I would watch again and again and it would still take my breathe away.",
      "review_date": "2013-04-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A historical drama detailing the life of Oskar Schindler, who used his money to save over a thousand Jews during the Second World War. Seen as a sort of companion piece to Spielberg's other war epic Saving Private Ryan (1998) , this film isA historical drama detailing the life of Oskar Schindler, who used his money to save over a thousand Jews during the Second World War. Seen as a sort of companion piece to Spielberg's other war epic Saving Private Ryan (1998) , this film is more factual and contains less action so that when you do see it, it is all the more horrifying. I was blown away by Liam Neeson's performance and I now consider it his best role, next only to Michael Collins. Another notable performance is Ralph Fiennes as the evil, cold blooded and militant psycho Amon Goeth, who was hung after Germany surrended for crimes against humanity. My only complaints would be that the accents are sometimes difficult to make out and that it is heavily depressing.",
      "review_date": "2011-09-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "• Based on a true story Schindler’s List tells the story of Oskar Schindler, a German businessman who saved more than a thousand (mostly Polish-Jewish) refugees from the Holocaust by employing them in his factories during World War II. The• Based on a true story Schindler’s List tells the story of Oskar Schindler, a German businessman who saved more than a thousand (mostly Polish-Jewish) refugees from the Holocaust by employing them in his factories during World War II. The movie has been criticised in some quarters both for making Schindler a more noble character than he perhaps was in real life, and for leaving out many of the worst atrocities of the period. As Spielberg himself has argued however these were both necessary changes in a movie intended for mainstream cinematic release, and this remains an important and incredibly effective piece of cinema on one of the toughest subjects any director can attempt to cover.",
      "review_date": "2019-11-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Considered to be one of the most powerful films since the beginning of film. Steven Spielberg's devastating look at the Holocaust is both personal and sorrowful. Spielberg's decision to film in black-and-white creates a vivid nightmare.",
      "review_date": "2014-09-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A near perfect movie. Although sometimes a bit slow, Schindler's List a thoughtful and brutal portrait of the tragedy that was the Holocaust. Spielberg's directing is wonderful, but what really makes the movie are the performances from LiamA near perfect movie. Although sometimes a bit slow, Schindler's List a thoughtful and brutal portrait of the tragedy that was the Holocaust. Spielberg's directing is wonderful, but what really makes the movie are the performances from Liam Neeson and Ralph Fiennes, which are perfect in every way.",
      "review_date": "2013-01-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I have watched this so many times I don't even remember. Has to be one of my top five favourite movies of all time. There are no words for it. Every scene rips through your soul and makes you shudder, but not in a sappy kind of way. But inI have watched this so many times I don't even remember. Has to be one of my top five favourite movies of all time. There are no words for it. Every scene rips through your soul and makes you shudder, but not in a sappy kind of way. But in the sense that you wonder if mankind is even capable of such barbarity. There is no effort to make you cry and feel sorry for the devastation of living breathing human beings, but on the contrary, the narration is objective and kind of lists the series of events without pretence. That's why it is so raw, and you draw your own meanings from it. Whole scenes pass without any background music to tell you how you should feel about it. Makes you experience war in a disturbingly intimate manner, like you are a spectator, watching silently as murder is committed before your very eyes, and you don't have the spine to make it stop. It is only later, when it's all done, and it's time for reflection, that the score sets in. And I couldn't find it in me to resist the tears. The scenes about the little girl in the red coat were especially unbearable. The score is so haunting and chilling that it picks you up and sets you in a whole different environment. The running time runs extremely fast. I'm aware that some of us may not have the level of concentration to sit through a three hour epic, but whoever prides himself in being able to appreciate art will have no problems.",
      "review_date": "2013-10-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "this movie is a gem  there is a good movie and there is a great movie and there is a gem which is something you get to see few times in a life time  Steven Spielberg is a spectacular director with this amazing ideas and amazing talent and youthis movie is a gem  there is a good movie and there is a great movie and there is a gem which is something you get to see few times in a life time  Steven Spielberg is a spectacular director with this amazing ideas and amazing talent and you get to see all that in this movie from start to finish  i can't really think of anything negative about this one  this movie simply change your views about humanity  waw.",
      "review_date": "2013-04-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Simply beautiful, sad, and a masterpiece.   Definitely one of Steven Spielberg's best along with E.T., Raiders, Jaws, and Saving Private Ryan.  One of the most realistic movies ever made.",
      "review_date": "2013-06-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "'Schindler's List' is a true story that deserves to be seen by everyone -- no matter what. It's a humane, powerful and emotionally heartbreaking story of a man going against his own beliefs and doing what, in the simplest terms, is the right'Schindler's List' is a true story that deserves to be seen by everyone -- no matter what. It's a humane, powerful and emotionally heartbreaking story of a man going against his own beliefs and doing what, in the simplest terms, is the right thing to do. Sure it might be too slow and lengthy for some people, but it's one movie of its kind with a story that got more to tell than any other blockbuster.Personal rating: 80/100Critical rating: 88/100",
      "review_date": "2017-08-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is an extremely harrowing and toutching film. Well written, beuatifully directed and supebly acted. The cinematography is materful, never seen anything else like it. Liam Neeson and ralph finnes act so natrually together, and theirThis is an extremely harrowing and toutching film. Well written, beuatifully directed and supebly acted. The cinematography is materful, never seen anything else like it. Liam Neeson and ralph finnes act so natrually together, and their performances are believable and moving. Though provoking and highly recomended film.",
      "review_date": "2014-03-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Epic historical dramas don't get much better than this. Probably the most visceral recount of the Holocaust ever brought to cinema; the sporadic violence is brutal yet purposeful, shocking without feeling exploitive. The cast is allEpic historical dramas don't get much better than this. Probably the most visceral recount of the Holocaust ever brought to cinema; the sporadic violence is brutal yet purposeful, shocking without feeling exploitive. The cast is all excellent. It's three hours long, yet you hardly feel the length. Like Lord of the Rings, it's so massive and engrossing that time stops mattering.\rWhat really makes this movie special, though, is its treatment of Schindler himself. The character isn't a particularly nice man. He's adulterous. He's erratic. He loses his temper. He's also kind of a pedophile, at least in one scene. Most \"great man\" epics would try to gloss over these imperfections and have him redeem himself in the end through his valiant actions. But Spielberg's too smart for that. He doesn't try to scrub Schindler clean of his sins. He presents the Nazi renegade warts and all, and as a result, Schindler feels achingly real (and Liam Neeson's outstanding performance certainly helps). You want to see him succeed, to overcome his personal demons for the greater good, and every little moment of light in his darkness feels profound. In the end, though, his triumph isn't particularly heroic. I won't spoil how it ends, in case you haven't seen the movie, but there's a scene near the end where Schindler tries to come to terms with the massive good he's done and what it means for him. It's heartbreaking, and one of the best-earned crying scenes in movie history.\rSeriously, see this movie. It's epic, unflinching, riveting, and utterly beautiful.",
      "review_date": "2015-09-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Spielberg and Williams at the top of their game; dedicated to the millions who lost their lives during World War II it is a testament to how such a horrific subject matter can be made to appear hopeful in the end. A must see film for anyoneSpielberg and Williams at the top of their game; dedicated to the millions who lost their lives during World War II it is a testament to how such a horrific subject matter can be made to appear hopeful in the end. A must see film for anyone who considers themselves a cinephile.",
      "review_date": "2018-04-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Some of Schindler's List is very disturbing indeed, with very graphic images on the screen. I thought this film is outstanding. True, it is very long, but the Holocaust was a very long and epic event, and the movie needed a long length toSome of Schindler's List is very disturbing indeed, with very graphic images on the screen. I thought this film is outstanding. True, it is very long, but the Holocaust was a very long and epic event, and the movie needed a long length to convey the harsh realities of the Nazi's treatment of the Jews. The cinematography was truly excellent, and some of the close ups of people being tortured or dying was enough to make you look away. The direction was taut and focused, most Spielburg's movies are good, but don't quite always have an impact on the whole audience. Schindler's List is visually disturbing and incredibly moving, and because of this, this is definitely Spielburg's best. The acting was phenomenal. Both Liam Neeson and Ben Kingsley give superb performances, and Ralph Fiennes is also very chilling in his role. The music by John Williams is not only haunting, but also unbearably sad, believe me I was in tears for a lot of this movie. All in all, a truly moving film, that deserves a 10/10. Bethany Cox.",
      "review_date": "2022-04-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's more than a film. It's an unforgettable, stylistic experience. The film is 3 hours long and you have to take in superb acting, imagery and storytelling, capturing the emotional and realism of the Holocaust. I realized I had watched aIt's more than a film. It's an unforgettable, stylistic experience. The film is 3 hours long and you have to take in superb acting, imagery and storytelling, capturing the emotional and realism of the Holocaust. I realized I had watched a masterpiece once it had finished.",
      "review_date": "2013-07-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My girlfriend and I were watching this together, she dozed off, I switched channels to watch a football match. One of the most boring movies ever made. Totally lifeless. The black and white doesn't help, and neither does the cinematography.My girlfriend and I were watching this together, she dozed off, I switched channels to watch a football match. One of the most boring movies ever made. Totally lifeless. The black and white doesn't help, and neither does the cinematography. The character were so totally flat, please, who would really care if they live or die ? Just goes to show you that even big names like Spielberg can throw interceptions...",
      "review_date": "2011-05-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe big hoax that keeps on giving. There were no gas chambers. The lizard people have been lying to you. Wake up. Communist lizards are enslaving us the world over. Hollywood is their nest and movies are how they spread their lies.",
      "review_date": "2020-09-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Sappy, manipulative and a ridiculously oversimplified version of the Holocaust.\rSpielberg has made a name for himself in the film industry by reducing serious subjects to the lowest denominator until it's no more than any mawkish familySappy, manipulative and a ridiculously oversimplified version of the Holocaust.\rSpielberg has made a name for himself in the film industry by reducing serious subjects to the lowest denominator until it's no more than any mawkish family melodrama. Why should a movie about the Holocaust be any different? Schindler's List is an aesthetic mess and exemplifies everything that's wrong about Hollywood.\rFirst off, the movie's primary focus is to show us how Oscar Schindler, a slave owner aiming to run his factories through jew labour for monetary profit, turns into a defender of jews' rights and the protector of their lives. But the problem is Schindler's transformation is portrayed in an extremely poor way. In fact, there is no transformation. Midpoint in the film, the Schindler persona has disappeared, and we have a new character clothed in the same flesh -- a self-sacrificing philanthropist who spends his entire amassed fortune to save the Jew workers. How did we get from one to the other?\rAnd then we have Amon Goeth. He's an evil, sadistic, Jew-hating Nazi - but do we get to know why he wakes up every morning, takes a swig of booze and snipes Jew prisoners for fun? No. Spielberg thinks the answer is obvious -- he's a Nazi, and Nazis don't have reasons for the things they do. The attempt to add depth to Göeth's character by dwelling on his twisted love affair with a Jewish girl is easily seen for what it is -- a cheap exposure of Nazi hypocrisy. The true intrigue, the true horror of the Holocaust does not lie in brutality alone, but rather in Hannah Arendt's \"banality of evil\". How can a man (or millions of men) arbitrarily narrow the moral sphere to exclude people seemingly no different from neighbours, friends and family?\rAnother problem is the accent. There are English-speaking films and then there are German-speaking films. Schindler's List, on the other hand, does not belong to either of these categories. One of the truly unforgivable aspects of the film is the ending. When Schindler took off his gold ring and blubbered \"I could have saved one more\", I experienced a feeling of mild revulsion. Spielberg's invariable resort to sentimentality is quintessentially Hollywood, quintessentially cheesy and quintessentially inappropriate for the subject matter of the film. Schindler's List is technically brilliant but Spielberg is a director of extremely limited vision. His moral and intellectual depth is that of a child (and the funny part is Schindler's List may be the most mature movie Spielberg has made till now).",
      "review_date": "2015-01-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There were definitely some profound glimpses of cinematic power in this beloved classic. But it bored the f**k out of me.",
      "review_date": "2012-11-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I would have to give this film a 5. It is a spectacular movie but it only shows one side of the situation. Ther for i can only rate it half because it only shows half. I do believe that is how some of it went but germans went as heartless as I would have to give this film a 5. It is a spectacular movie but it only shows one side of the situation. Ther for i can only rate it half because it only shows half. I do believe that is how some of it went but germans went as heartless as this movie shows. As they say there is always two sides to the story; And you may never know exactly which one is true.",
      "review_date": "2006-05-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It was such a banal film, I think Spielberg rather wanted the audiences to symphathize with the Jews in the Holocaust rather than let the audience enjoy a good story.",
      "review_date": "2008-08-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is contrastable to certain brutality epics that challenge the viewer with pain and death, and greusome bloodshed that the eye can't remain toward the screen until it is finished. This, though, is a film that demands the eye This film is contrastable to certain brutality epics that challenge the viewer with pain and death, and greusome bloodshed that the eye can't remain toward the screen until it is finished. This, though, is a film that demands the eye remain magnetized to the screen, because truth can be that way; honest, emotional truth. To address the commenter who claimed this was a propaganda film to boast about the Jewish faith, it seems more an objective account of something that happened, more or less, to a group of people bearing the brunt of a clashing of virtues. They received the blunt end of the stick, and the director himself captured with lyrical symbology the essence of those events. People will have their opinions, but I hold that it is one of the greatest films ever made.",
      "review_date": "2006-02-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Propaganda movie. So static characteristics of jews is so unrealistic. Spielberg thinks he, and his religion has no bad people, and no flaws. This is so one sided movie that it reminds me a few spots about police how they work hard, and they Propaganda movie. So static characteristics of jews is so unrealistic. Spielberg thinks he, and his religion has no bad people, and no flaws. This is so one sided movie that it reminds me a few spots about police how they work hard, and they are such a nice guys, but everyone hates them. And this was the main point in the movie: Jews are great with no negative trait, but everyone hates them and wants to get rid of them.",
      "review_date": "2006-01-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie \"Schindler's List\" was based on the novel written by Thomas Keneally called \"Schindler's Ark/Schindler's List\". This novel won the best prize for fiction (Booker McConnell Prize) decades ago. This movie was likely portrayed byThe movie \"Schindler's List\" was based on the novel written by Thomas Keneally called \"Schindler's Ark/Schindler's List\". This novel won the best prize for fiction (Booker McConnell Prize) decades ago. This movie was likely portrayed by history teachers as historically accurate, so it was jarring to learn of its origin. Of all the things that happened in WW2, there is no need to fictionalize things, especially just to sensationalize it to sell more movie tickets/DVDs.The movie itself portrayed things in a needlessly sexualized manner, and was over-dramatic as a whole. For example, did the woman who woke up from sleeping with the German soldier have to be topless? Isn't that sexist objectification of women? Doesn't belong in this genre. Pervs may like this, but if a movie is going to portray a grim topic it shouldn't do so in a dishonorable way like that.Another thing is that it stereotypes all Germans as psychopathic, sadistic murderers who take every waking moment to victimize innocent Jews. It dehumanizes the German people with this stereotype, and could be used to justify any abuses against them. The movie doesn't take into account historical facts that would balance this obvious false bias, such as the fact that Jews declared war on Germany (Daily Express on 24 March, 1934) which led to the Jewish boycott of German goods. Nor does it mention that there were Jewish supremacist groups like Nakam (Abba Kovner) that attempted to poison the water supply of German civilian cities after the war was over, or how they coated arsenic onto the bread inside the camp where the German POWs were being held (because apparently some thought that not enough Europeans died in WW2). What about the Soviet genocidal brutality that went on in the gulags? This of course was not mentioned.Also, there is nothing really different about this movie, from all the other movies about this topic. Using emotional scenes to tug at heartstrings shouldn't ever be considered as a replacement for historical facts.The truth fears no investigation.",
      "review_date": "2017-10-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie is not that bad but it's far from Spielberg's best works. Ralph Fiennes here is great but this film really exaggerates things a lot. One of the negative notes is also that this film, which is supposed to tell the story of OskarThe movie is not that bad but it's far from Spielberg's best works. Ralph Fiennes here is great but this film really exaggerates things a lot. One of the negative notes is also that this film, which is supposed to tell the story of Oskar Schindler, sees its most interesting scenes just when Schindler is not involved. Slightly flawed script.",
      "review_date": "2022-04-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A stunning film with great use of film techniques. This shocked me and showed me a part of the holocaust from the eyes of both the jews and the upper-class germans. People who think that the film is boring obviously do not have any sense of A stunning film with great use of film techniques. This shocked me and showed me a part of the holocaust from the eyes of both the jews and the upper-class germans. People who think that the film is boring obviously do not have any sense of humanity and perhaps have been brainwashed by the current modern action films, where the only lift is seeing people killing others in different ways. Fantastic film Steven!",
      "review_date": "2008-03-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Schindler's List is a masterpiece of filmaking that modern cinema has not and will not ever see again. Plain and simple, this movie touches us in a place that a super-hero flick just cannot. Spielberg shows us just how low and just how Schindler's List is a masterpiece of filmaking that modern cinema has not and will not ever see again. Plain and simple, this movie touches us in a place that a super-hero flick just cannot. Spielberg shows us just how low and just how high the human spirit can go, all while showing the world his magnificent brilliance and mastery of filmmaking.",
      "review_date": "2008-05-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "First off I would like to say that this is an excellent movie and it portrays the brutality of the Nazis treatment of Jewish prisoners. Second, to people who say this \"doesnt tell the full story\". That statement is absolutley moronic. Yes First off I would like to say that this is an excellent movie and it portrays the brutality of the Nazis treatment of Jewish prisoners. Second, to people who say this \"doesnt tell the full story\". That statement is absolutley moronic. Yes there are two sides to this story. The jews who were murdered, and the Nazis who murdered them. Thats the story. Did all of the germans who were Nazi soldiers want to be? No some of them were forced to do what they did. But to somehow place the Germans in a position that what they did was a good thing is insane. The Nazis murdered those people. End of story.",
      "review_date": "2007-01-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Exceptional!! Schindler's list is perhaps the best and most heartbreaking depiction of the Holocaust ever, It's a dark and heart breaking tale of one man's journey to become a hero to the Jew's of today, Liam Neeson plays Exceptional!! Schindler's list is perhaps the best and most heartbreaking depiction of the Holocaust ever, It's a dark and heart breaking tale of one man's journey to become a hero to the Jew's of today, Liam Neeson plays Oskar Schindler a greedy factory owner who hires Jew's to minimum wage work for him. Soon enough he has all the money in the world and is happy as can be. Or so it appears, as the film progress you see the demeanor and attitude of Schindler change dramatically when he watches the Jewish people get slaughtered like animals by the Nazi's, after that he sets his heart on the sole task if getting them out of the camps and into his country. Schindler's List is the proven example of human kindness and compassion, It's a movie that will make your heart break and make the spirit soar at his heroic feet. Schindler's List is one of the greatest films ever made and will continue to shock and amaze people for all time. I very highly recommend this movie!",
      "review_date": "2009-01-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A real masterpiece, best movie ever made. A person who doesn't like it, is a monstrous entity with neither a heart nor a soul, period.",
      "review_date": "2005-09-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Honestly, I think this is Steven Spielberg's masterwork. Not claiming or wanting to delve into lengthy sequences of death and violence at Auschwitz or somewhere similar, it instead captures the violence in the ghettos, in work camps, Honestly, I think this is Steven Spielberg's masterwork. Not claiming or wanting to delve into lengthy sequences of death and violence at Auschwitz or somewhere similar, it instead captures the violence in the ghettos, in work camps, and through the actions of Amon Goeth, who is played brilliantly by Ralph Fiennes. It is ultimately the story of Oskar Schindler, a man who worked within the Nazi party system to save over one thousand Jewish individuals from almost certain death. It doesn't portray him as a god as he clearly had faults, but it shows that hope is possible and that people can work together to save others. But it is still very clearly about the violence of the Holocaust, almost in a numbing emotional sense. The cinematography is absolutely gorgeous in this film. Black and white was the way to go. In some senses, I think it helps to keep the picture from overwhelming us and as authenticity of some newsreel from the time. The touch at the end in \"present\" day of the survivors and their families coming to Schindler's grave is at once touching and haunting without necessarily spelling it out for us. Haunting and moving, it is one of the most weighty and ponderous films but it never harkens from its intensity even being more than three hours. Bravo!",
      "review_date": "2007-03-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was a fantastically directed. Steven Spielberg knows how to convey any message beautifully through film. It is sad to see how brutally the Nazis treated Jews and their utter disrespect for human life. Bring some Kleenex with you when This was a fantastically directed. Steven Spielberg knows how to convey any message beautifully through film. It is sad to see how brutally the Nazis treated Jews and their utter disrespect for human life. Bring some Kleenex with you when watching this film.",
      "review_date": "2007-05-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "You have got to be kidding me...Return of the King and an animated feature get higher scores than Schindler's List?",
      "review_date": "2007-06-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the truly greatest films of all time. It is unforgettable and haunting. Steven Spielberg's expert direction, the tremendous acting and outstanding writing make it a brilliant film in all respects.",
      "review_date": "2008-03-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is the most beutiful film that I've ever senn!",
      "review_date": "2008-04-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A flawless masterpiece...",
      "review_date": "2009-02-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Such a clever film, I noticed the use of the well known sad song gloomy Sunday - immediately showing the depression and suffering of the Jews that this film perfectly portrays. Amazingly directed scenes that show the sheer horror and leave Such a clever film, I noticed the use of the well known sad song gloomy Sunday - immediately showing the depression and suffering of the Jews that this film perfectly portrays. Amazingly directed scenes that show the sheer horror and leave you gasping afterwards. Casted with perfection, every actor convincing you with their realistic portrayals of heroes/victims/villains of this awful time. I was left devastated, just as the makers intended their audience to feel. Loved how the realism was actually THERE at the end. This film really chilled my bones, made me think like an adult for once about the serious history people have experienced. Excellence!",
      "review_date": "2009-07-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Forget Brando as Vito Corleone or Anthony Hopkins as Hannibal Lecter, Ralph Fiennes delivers THE greatest performance as Amon Goth in this film. Incredibly complex, chilling but somehow addictive. Spielberg's directing is sensational Forget Brando as Vito Corleone or Anthony Hopkins as Hannibal Lecter, Ralph Fiennes delivers THE greatest performance as Amon Goth in this film. Incredibly complex, chilling but somehow addictive. Spielberg's directing is sensational and although I didn't care that much for Liam Neeson as Schindler, this film still certainly deserves a 10.",
      "review_date": "2009-08-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great piece of film making, and a great man. For Gary l. to give it a 0 is actually rather frightening.",
      "review_date": "2009-08-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Words cannot describe this movie. It simply touches the soul.",
      "review_date": "2003-04-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This video opened my eyes to see that people can be good. You dont have to give your life for others, but saving one person is changing your life. They can have children, and those children will be there because of you. This is a wonderful This video opened my eyes to see that people can be good. You dont have to give your life for others, but saving one person is changing your life. They can have children, and those children will be there because of you. This is a wonderful movie and I recommend it to anyone willing to watch!",
      "review_date": "2006-01-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I really think that this was a really good movie because of all the details and how they put it all together it was a true work of art.",
      "review_date": "2006-01-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Simply thriling and heart capturing! a motionless epic to be applauded!",
      "review_date": "2006-02-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There are no words that can even begin to tell how incredible this movie is. It is perfect, it is just so horrible that it is a true story. A perfect 10.",
      "review_date": "2006-05-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Extremely entertaining. Heartbreaking to say the least. The 3 hours literally fly by.",
      "review_date": "2006-06-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is fair to all sides, and it portrays history accurately enough for teachers to show it in their classes. I feel as though this movie captures the essence of what makes a movie great. Criticism of this movie highlights the This movie is fair to all sides, and it portrays history accurately enough for teachers to show it in their classes. I feel as though this movie captures the essence of what makes a movie great. Criticism of this movie highlights the person's ignorance.",
      "review_date": "2006-06-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ralph Fiennes is what makes this movie, pure and simple.",
      "review_date": "2006-07-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I think this is Steven Spielberg's masterwork. Not claiming or wanting to delve into lengthy sequences of death and violence at Auschwitz or somewhere similar, it instead captures the violence in the ghettos, in work camps, and through I think this is Steven Spielberg's masterwork. Not claiming or wanting to delve into lengthy sequences of death and violence at Auschwitz or somewhere similar, it instead captures the violence in the ghettos, in work camps, and through the actions of Amon Goeth, who is played brilliantly by Ralph Fiennes. It is ultimately the story of Oskar Schindler, a man who worked within the Nazi party system to save over one thousand Jewish individuals from almost certain death. It doesn't portray him as a god as he clearly had faults, but it shows that hope is possible and that people can work together to save others. But it is still very clearly about the violence of the Holocaust, almost in a numbing emotional sense. The cinematography is absolutely gorgeous in this film. Black and white was the way to go. In some senses, I think it helps to keep the picture from overwhelming us and as authenticity of some newsreel from the time. The touch at the end in \"present\" day of the survivors and their families coming to Schindler's grave is at once touching and haunting without necessarily spelling it out for us. Haunting and moving, it is one of the most weighty and ponderous films but it never harkens from its intensity even being more than three hours. Bravo!",
      "review_date": "2007-01-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Definitely a great film but severely flawed by the overacting at the end as Schindler dramatically proclaims, while holding up a ring, (apparently enough to save another from his list) \"I could have saved one more Jew! Just one more oversell Definitely a great film but severely flawed by the overacting at the end as Schindler dramatically proclaims, while holding up a ring, (apparently enough to save another from his list) \"I could have saved one more Jew! Just one more oversell from Spielberg that keeps him off the best director list. He has skill, but \"beat me over the head\" is not poingant.",
      "review_date": "2007-02-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Honestly, I'm glad someone out there made time to make a movie like this, and Im glad it was Spielberg (because he's a great director). The actors were pretty good, great cinematography,match cuts, and I love how he added the Honestly, I'm glad someone out there made time to make a movie like this, and Im glad it was Spielberg (because he's a great director). The actors were pretty good, great cinematography,match cuts, and I love how he added the little girl in the red dress. Although, I honestly feel that it wasn't as touching and meaninful as I thought it would have been. It didn't 'touch our hearts' and make us cry. I think it would have been an amazing movie if it would have been a movie with 3 points of views. That way, we would understand how people felt when they lost their parent, brothers, and sisters. Or when they would watch them get beat. Schindler didn't go through any of that, therefore, we still don't know what a Jew went through.",
      "review_date": "2007-03-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "SL was an absolutely amazing & touching movie, it went for a bit too long. I can't concentrate for that amount of time. & secondly, I felt it was a bit too confronting. In some scenes it made me feel somewhat uncomfortable, such as the SL was an absolutely amazing & touching movie, it went for a bit too long. I can't concentrate for that amount of time. & secondly, I felt it was a bit too confronting. In some scenes it made me feel somewhat uncomfortable, such as the nudie scenes. Yet, overall, it was very well made. Well done Speilberg!",
      "review_date": "2007-08-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I love the cinematography- the sharp lighting hues, the layers and shadows- but the girl in red doesn't do it for me. she seems too forced and at odds with the surprisingly constrained hand of Speilberg's direction. i went to a I love the cinematography- the sharp lighting hues, the layers and shadows- but the girl in red doesn't do it for me. she seems too forced and at odds with the surprisingly constrained hand of Speilberg's direction. i went to a museum for the holocaust and a speaker there had lived under the real forced labor camp commandant Goeth. after listening to the horribly real version of events, i can only praise Fiennes' acting in the role of Goeth. Spielberg really could have shown more restraint in the ending, where Schindler breaks down. such a sudden jump out of character feels unconvincing, but thankfully, the epilogue, in its understated bittersweet joy, redeems its showiness. all in all a good satisfying skillfully constructed film. the three hours are worth it.",
      "review_date": "2007-09-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It is my favorite film!! I like the story, the music, and the moving performance. Excellent!",
      "review_date": "2008-04-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very well done,one of the best ever.",
      "review_date": "2005-10-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A fine movie that expresses the horror of what happened between 1940 and 1950. This movie made me cry for what happened to these people and that's why I give this movie a high rating of 9.",
      "review_date": "2006-03-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Why is this film so great to me? The incredible, indelible speeches: \"today is history\", \"is this the face of a rat?\", \"nice things cost money\", \"the war brings out the bad, never the good\", \"now that's power\", \". . .you know the Why is this film so great to me? The incredible, indelible speeches: \"today is history\", \"is this the face of a rat?\", \"nice things cost money\", \"the war brings out the bad, never the good\", \"now that's power\", \". . .you know the meaning of the word gratitude\", \"don't forget who you work for\", \"the list is an absolute good\"",
      "review_date": "2006-03-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "breathtaking. i think people who gave it a low score or called it boring, they obviously weren't watching the same movie as me. It was indeed a story that was meant to be told. bravo steven, bravo.",
      "review_date": "2006-07-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An amazing film, fantastic story line - it's gripping. A must see! It is acturate to historical documents and just superb! I am not giving this film a 10, simply because it upset me and I sometimes found it difficult to understand what An amazing film, fantastic story line - it's gripping. A must see! It is acturate to historical documents and just superb! I am not giving this film a 10, simply because it upset me and I sometimes found it difficult to understand what was going on.",
      "review_date": "2006-09-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is the only movie I have ever given a perfect ten. Schindler's List is, to put it simply, the best, most well-done, overal greateset movie of our time. It's acting, editing, and directing are done to perfection. Spielsber has This is the only movie I have ever given a perfect ten. Schindler's List is, to put it simply, the best, most well-done, overal greateset movie of our time. It's acting, editing, and directing are done to perfection. Spielsber has proven himself to be a master when it comes to films just by this movie alone. The character of Oskar Schindler could not have been played better, and as the movie progresses you begin to love him as not only just another actor in just another movie, but also as a person. Schindler is a real-life hero, and this movie does his life justice. Your emotions will be tied into this film, and you will never forget it. Excellent, excellent movie. Thank-you. Please watch, no matter who you are.",
      "review_date": "2007-05-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ive seen this movie 10 times and would watch it another 10 times. Amazing portrayal of the holocaust",
      "review_date": "2007-08-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Without a doubt, one of the most profound movies I've ever seen. Probably Spielberg's best work. The movie itself is brilliant, but I especially love the end, when they show the real individuals behind the film who were saved by Without a doubt, one of the most profound movies I've ever seen. Probably Spielberg's best work. The movie itself is brilliant, but I especially love the end, when they show the real individuals behind the film who were saved by Schindler. That part really got to me.",
      "review_date": "2008-04-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I honestly think anyone who gave this movie below an eight probably has the IQ of a retarted sloth. This movie will grip your soul and take it to new highs and lows. I have never cried watching a movie before(real manly type, yah know) but I I honestly think anyone who gave this movie below an eight probably has the IQ of a retarted sloth. This movie will grip your soul and take it to new highs and lows. I have never cried watching a movie before(real manly type, yah know) but I am not ashamed to admit to it at this one. WATCH THIS MOVIE.",
      "review_date": "2009-01-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was a deep, emotional, and horrifying movie. It made you realize what the days of WW2 Germany were like, and the tragedies and disasters the Jews had to deal with. The acting was phenomenal and seeing Schindler try and save the JewsThis was a deep, emotional, and horrifying movie. It made you realize what the days of WW2 Germany were like, and the tragedies and disasters the Jews had to deal with. The acting was phenomenal and seeing Schindler try and save the Jews after realizing the things his own country had did to them were comforting and expressible. This was a great film, and as such, deserves to be seen as so, to Schindler's List, may it keep on doing great and keep eye's open to a period in time that needs to be remembered as something to never happen again.",
      "review_date": "2010-11-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Excellent film !!!!!!! Such an incredibly hard subject to begin to tackle in a film and do justice to. I think it's very close and done as well as anything we have seen yet. Kudos to all the actors and especially Ralph F.... awesome job.",
      "review_date": "2010-12-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A very moving film with great performances and music, Spielberg delivers another classic.",
      "review_date": "2019-04-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the scariest movies I have ever seen. But also one of the best and most important. Ralph Fiennes is outstanding as the sadistic nazi officer and Liam Neeson is a great Schindler. A must see.",
      "review_date": "2015-01-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is a heartbreaking masterpiece. Directed by Steven Spielberg, \"Schindler's List\" is a powerful, superbly acted, fantastic example of what a movie should be like. The cast is brilliant with Liam Neeson playing Oskar Schindler, BenThis movie is a heartbreaking masterpiece. Directed by Steven Spielberg, \"Schindler's List\" is a powerful, superbly acted, fantastic example of what a movie should be like. The cast is brilliant with Liam Neeson playing Oskar Schindler, Ben Kingsley playing Ihtzak Stern and Ralph Fiennes playing Amon Goeth.",
      "review_date": "2013-11-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The most personal movie of Stephen Spielberg. Rumor has it that the atmosphere in the set was grim and tense and after I watched it, I can pretty much tell that the rumor is justified.\r There won't be any comments from me about SchindlerThe most personal movie of Stephen Spielberg. Rumor has it that the atmosphere in the set was grim and tense and after I watched it, I can pretty much tell that the rumor is justified.\r There won't be any comments from me about Schindler List apart from I have always considered this movie as one of the best movies ever. The duration is superbly long but when I watched it I hardly felt any boredom coming. The movie is shown in black-and-white without any color EXCEPT for one person-if you have watched it, you'll know what I mean-and one watery-eyes moment in the end. That being said,   you don't need to mind the colors too much as the plot will surely give you a hook.\r This movie isn't for everybody and the tone is dark, I won't recommend Schindler's List if what you mostly watch are just romance and drama movies.\r PS: Ralph Fiennes is fantastic in this movie. You can always feel how evil he is whenever he is on the screen.",
      "review_date": "2013-11-06",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 118,
  "genres": [
    "Biography",
    "Drama",
    "History",
    "War"
  ]
}