{
  "title": "Tombstone",
  "rating": 7.1,
  "release_date": "1993-12-25",
  "genre": [
    "Action",
    "Biography",
    "Drama",
    "History",
    "Romance",
    "Western"
  ],
  "summary": "A successful lawman's plans to retire anonymously in Tombstone, Arizona, are disrupted by the kind of outlaws he was famous for eliminating.",
  "critic_reviews": [
    "Tombstone is incredibly entertaining. While not entirely original and not always well executed, it manages to keep your attention for the entire 130-minute duration. And let's face it, Val Kilmer as Doc Holliday is what really sets it apart.",
    "Tombstone remains a shamelessly entertaining movie, filled with lively turns from virtually every appropriate actor not working on the Costner version.",
    "Tombstone is a tough-talking but soft-hearted tale that is entertaining in a sprawling, old-fashioned manner.",
    "A few stirring shoot-'em-ups help relieve the logjam of cliches. Director George P. (Rambo) Cosmatos does an OK job at the O.K. Corral. But even the good stuff goes on for too long.",
    "Kilmer makes a surprisingly effective and effete Holliday, but Russell lacks the stature for Earp - Sam Elliott as his older brother Virgil suggests a better movie. There's a misguided romantic subplot and the ending rather sprawls, but mostly this is rootin', tootin' entertainment with lots of authentic facial hair.",
    "Highly stylized fashion-wise but awkwardly unfocused in its plotlines, it aims for the western iconography of Sam Peckinpah and Sergio Leone but never gets past its own directorial hurdles.",
    "Tombstone is a movie that wants to have it both ways. It wants to be at once traditional and morally ambiguous. The two visions don't quite harmonize.",
    "Though apparently conceived as a revisionist Western, Tombstone falls prey to the cliches of the genre, and its last third is a muddle.",
    "This has plenty of designer gore to go with its periodic spurts of bloodletting, and a lot of care and attention were obviously devoted to selecting locations, designing sets, and grooming handlebar mustaches. Much less attention went to making one believe that any of the events took place circa 1879, but at least the bursts of action keep coming, and most survive Cosmatos's addiction to smoldering close-ups.",
    "If only director George P. Cosmatos (Rambo) knew how to do something with cliches other than throw them into the pot and stir. A preposterously inflated 135 minutes long, Tombstone plays like a three-hour rough cut that’s been trimmed down to a slightly shorter rough cut.",
    "Doesn't really cut it in the Western genre.",
    "As much as these actors heroically struggle to focus the film, the director more successfully hacks it apart. But if you really love Westerns, despite its faults, it's got to be recommended for Kilmer's performance alone."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "This movie is vastly underrated. Kilmer's performance as Doc Holliday is arguably the greatest interpretation of a real western character in the the history of western filmmaking. It's not to be missed. If you haven't seen the movie, watchThis movie is vastly underrated. Kilmer's performance as Doc Holliday is arguably the greatest interpretation of a real western character in the the history of western filmmaking. It's not to be missed. If you haven't seen the movie, watch it! Even if you're not a fan of the genre, this is as entertaining as a movie can be. It doesn't matter if this is not an accurate account of these real men and women. Just enjoy the ride.With an all star cast that delivers, this movie turned many folks who never liked westerns into fans of the genre when it was released.The greatest weakness of the movie is also its greatest strength; Kilmer's Holliday (and Bein's Johnny Ringo to an extent) steal the show from  Russel's Wyatt Earp who is the main protagonist of the film. Powers Booth and a familiar cast of actors take on the roles of the no good \"cowboys\". Sam Elliot, Bill Paxton and the rest of the cast deliver.A fantastic interpretation of the famous Gunfight at the O.K. Corral and all the events that lead up to the fight and what may have transpired after. I can't for the life of me figure out how the critic score for this is a 50?",
      "review_date": "2019-08-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Stays mostly true to the original story, amazing acting (except for the river scene), and has more than a few hilarious moments. I enjoyed it thoroughly, very good movie.",
      "review_date": "2019-12-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Worst movie in the history of movies.  The movie about singing vegetables was better than Tombstone.",
      "review_date": "2021-06-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a masterpiece, and the story behind the making of the film is also fascinating.Val Kilmer steals the show, and it's on purpose. Still, he put a lot of effort, and made Doc Holliday fascinating to watch.Highly recommended, even ifThis is a masterpiece, and the story behind the making of the film is also fascinating.Val Kilmer steals the show, and it's on purpose. Still, he put a lot of effort, and made Doc Holliday fascinating to watch.Highly recommended, even if you're not into westerns.",
      "review_date": "2020-11-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This along with Unforgiven are the two modern westerns that both reach outstanding heights. Kurt Russell deserves to be recognized for this work along with so many others",
      "review_date": "2020-11-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a very good character driven western film. It features a good cast, lots of tense moments, good camerawork/cinematography and decent visual effects. There are plenty of action based scenes - fights/shootouts and the like but there areThis is a very good character driven western film. It features a good cast, lots of tense moments, good camerawork/cinematography and decent visual effects. There are plenty of action based scenes - fights/shootouts and the like but there are also scenes inbetween that help show the quieter side to different characters nature.It's a little cheesy but its certainly worth seeing, if your a fan of biopics/character driven westerns, so yes I'd recommend it.",
      "review_date": "2022-05-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Masterpiece. Val Kilmer’s performance is amazing. Every actor is great. Even Charlton Heston makes an appearance.",
      "review_date": "2020-08-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is one of my favorite movies of all time! It has a great story and characters you can understand and enjoy. The acting is amazing and the movie has so many great quotes and scenes. Tombstone is a true masterpiece.",
      "review_date": "2021-07-04",
      "source": "metacritic"
    }
  ],
  "num_reviews": 20
}