{
  "title": "True Romance",
  "rating": 8.4,
  "release_date": "1993-09-10",
  "genre": [
    "Thriller",
    "Romance",
    "Crime"
  ],
  "summary": "This rock'n'roll adventure story tells of two unlikely lovers who accidentally double-cross the Detroit mob by stealing valuable contraband. Christian Slater and Patricia Arquette flee to Los Angeles where they are sought by both gangsters and cops. (Warner Bros.)",
  "critic_reviews": [
    "One of the best mainstream action-thrillers [in] a decade.",
    "True Romance is for the most part a delightful relic of its era.",
    "You never forget you're watching a derivative, machine-tooled entertainment; the fun is in how the machine keeps spinning off course.",
    "Tony Scott steers the movie like a rocket and it never slows down.",
    "The blistering confrontation scene between Hopper and Walken -- both in peak form -- will be talked about for years. It's pure Tarantino: a full-throttle blast of bloody action and verbal fireworks.",
    "True Romance, which feels at times like a fire sale down at the cliche factory, is made with such energy, such high spirits, such an enchanting goofiness, that it's impossible to resist. Check your brains at the door.",
    "Blends and recycles elements of scores of crime and road movies, from \"Bonnie and Clyde\" to \"Badlands\" but it does so with enough energy and verve to create something entirely fresh and infectiously entertaining.",
    "Consistently entertaining.",
    "Despite Tony Scott's occasional blundering, True Romance is still a visceral roller coaster.",
    "As usual, Tarantino's sense of fun is infectious but fairly heartless.",
    "It doesn't add up to enough, as preposterous plotting and graphic violence ultimately prove an audience turnoff.",
    "The Tony Scott version of Tarantino comes out vulgar; the graphic violence and profanity-laced posturing represent everything that the wannabes soon used to exhaust audiences. Nevertheless, True Romance contains so many unforgettable moments.",
    "Amid the violence, the one-liners ring out. Nobody speaks for real. It's as if they all know they're in a movie.",
    "Despite its noir references and evocations, this slick film, directed by Tony Scott from Quentin Tarantino's script, is a preposterously bloody mess, as is the plot."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "A titanically indulgent mess. Tarantino, normally a writing genius, unloads his every juvenile fantasy, his every cheap cinematic crush, onto 'True Romance'. Apart from one excellent (though disconnected) scene between Walken and Hopper, theA titanically indulgent mess. Tarantino, normally a writing genius, unloads his every juvenile fantasy, his every cheap cinematic crush, onto 'True Romance'. Apart from one excellent (though disconnected) scene between Walken and Hopper, the writing itself is laughable and defies the brilliance of its author at every turn. Clueless cinematography, a horrific sound-track, hacky acting and unceasingly preposterous story logic do not improve the situation.  Not one redeeming feature or endearing scene. This film is like watching Tarantino at confession.",
      "review_date": "2014-06-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The most romantic movie I've ever seen. The movie has an edgy fast paced script/story, made even more brilliant by the actors and director. There is a raw quality to the movie, which all Tarantino's movies have (Although he only wrote this,The most romantic movie I've ever seen. The movie has an edgy fast paced script/story, made even more brilliant by the actors and director. There is a raw quality to the movie, which all Tarantino's movies have (Although he only wrote this, not direct). In a nutshell this movie is a gem amongst masterpieces (it's piers).\r(The 2 Disc Special Edition, Director's Cut was worth every penny and the wait. Tarantino's commentary is probably the best I've ever heard.)",
      "review_date": "2012-01-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "True Romance is an unforgettable classic. There are so many scenes that stick with you forever; a psychotic wannabe rasta Gary Oldman, the scintillating exchange between Walken and Hopper, a condescension-disliking Brad Pitt, the mother ofTrue Romance is an unforgettable classic. There are so many scenes that stick with you forever; a psychotic wannabe rasta Gary Oldman, the scintillating exchange between Walken and Hopper, a condescension-disliking Brad Pitt, the mother of all hotel room gun fights... The list could go on. Excellently scripted by Quentin Tarentino and efficiently directed by Tony Scott, True Romance is a movie not to be missed.",
      "review_date": "2012-06-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is one of the worst movies I have ever had the misfortune of seeing. I am shocked and appalled at the other, mostly positive user reviews. The writing is horrendous and totally laughable. Only teenagers or idiotic buffoons could enjoyThis is one of the worst movies I have ever had the misfortune of seeing. I am shocked and appalled at the other, mostly positive user reviews. The writing is horrendous and totally laughable. Only teenagers or idiotic buffoons could enjoy this. It is just plain bad - no ifs, ands, or buts about it.",
      "review_date": "2019-02-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "True Romance may well be Tony Scott's finest film, and this is largely due to a strong helping hand from Quentin Tarantino. Not that Scott is an incompetent director when working on his own, but it is Tarantino's razor-sharp script thatTrue Romance may well be Tony Scott's finest film, and this is largely due to a strong helping hand from Quentin Tarantino. Not that Scott is an incompetent director when working on his own, but it is Tarantino's razor-sharp script that really shines. The ensemble cast is exceptional - Christian Slater and Patricia Arquette as Clarence and Alabama have great on-screen chemistry, and other notable highlights include James Gandolfini's imposing, sadomasochistic mafia henchman Virgil, Gary Oldman's pimp character Drexl, Val Kilmer's \"Kingly\" manifestation of Clarence's conscience, and Brad Pitt also has fun playing a stoner. For the most part, the film's plot keeps you entertained, (and Hans Zimmer's cracking score does keep things moving along nicely) though the overplayed finale disappoints slightly (strangely beautiful ballet of violence though it is). I'm not quite sure what the message behind the film is (if there really is one) - you have to kill a few people, smuggle drugs and escape to Mexico to truly love someone, perhaps? Tarantino had directed the film as he originally intended to do the end result would have been a little more consistent, but even as it is, the film is still a strangely fulfilling romp.",
      "review_date": "2011-10-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "True Romance is the first movie of this caliber I've seen where everything seemed to go right in the end for our two protagonists. Yes, they were shot, bloodied, beat up, and then some, but they did what they set out to do: sell a boatload ofTrue Romance is the first movie of this caliber I've seen where everything seemed to go right in the end for our two protagonists. Yes, they were shot, bloodied, beat up, and then some, but they did what they set out to do: sell a boatload of cocaine for $200,000 and go to Mexico. I respect filmmakers like Tarantino and Scott that make a movie like that; a film where there's no conditions or sacrifices the characters have to ultimately make, one where we're happy because they're happy. Once Alabama and Clarence were married, they didn't fight once. Not once. That's the kind of marriage I think we all want to have!",
      "review_date": "2014-01-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Love it. A very good romance Crime drama movie. I love the romance scene in this movie. Very Romantic and Bloody movie. A fine written movie. This movie has good acting , directing , and well written.",
      "review_date": "2011-03-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie was amazing, i watch it at least three times year. Great soundtrack, great cast : â",
      "review_date": "2011-01-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Tony Scott directs this Quentin Tarantino penned flick that's straight out of left field. It has cult classic written all over it.",
      "review_date": "2012-01-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The film was written by Quentin Tarantino, and it really shows with the sharp dialogue and crazy plot. The film centres around Clarence (Christian Slater) who meets and marries Alabama (Patricia Arquette). After Clarence goes to get Alabamaâ",
      "review_date": "2012-01-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is one of my all time great films, great background music and super Tarrantino dialogue. Strong story line and gripping throughout. The ending is unpredictable and superb.\r Brad Pitt, Christian Slater Gary Oldman and the other manyThis is one of my all time great films, great background music and super Tarrantino dialogue. Strong story line and gripping throughout. The ending is unpredictable and superb.\r Brad Pitt, Christian Slater Gary Oldman and the other many stars give a great believable presence. A must see film for gangster film lovers.",
      "review_date": "2012-01-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "True Romance is a film that plays around and switches it's genre around at so many points, it mixes between dark drama, thriller and comedy. It twists around so much that you end up feeling lost on how you're supposed to take it. This is notTrue Romance is a film that plays around and switches it's genre around at so many points, it mixes between dark drama, thriller and comedy. It twists around so much that you end up feeling lost on how you're supposed to take it. This is not a bad thing, the film's jerkiness mixes with your emotions you don't know what to expect, it also throws out some shocking death scenes you don't see coming with some great actors popping up and disappearing throughout. Gary Oldman is terrific as the pimp Drexel. Christopher Walken pops up in the most memorable and greatest scenes of the movie. It's a dynamic film with a great surprising cast of characters and actors...keep an eye out for Samuel L. Jackson in a brief appearance.",
      "review_date": "2012-02-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "No excuses for having never seen this film until now! Released all the way back in 1993 with a Quentin Tarantino script, True Romance is an energetic, fast-paced, road movie starring Christian Slater and Patricia Arquette as Tarantino'sNo excuses for having never seen this film until now! Released all the way back in 1993 with a Quentin Tarantino script, True Romance is an energetic, fast-paced, road movie starring Christian Slater and Patricia Arquette as Tarantino's Bonnie and Clyde on the run from the mob.The film bears all the hallmarks of Tarantino films of this era, it oozes his trademark combination of glamourous violence and cool characters and in many aspects is the trial run for Pulp Fiction and Natural Born Killers. While this may not have been the case back in 1993, looking back the film features an ensemble cast of supporting actors including Gary Oldman, Dennis Hopper, Samuel L Jackson, James Gandolfini and Christopher Walken, each of which Tarantino gives an interesting character with at least one scene to stand-out and make their own. Of particular mention is the famous 'Sicilian' scene between Walken and Hopper.A must see film for any Tarantino fan.",
      "review_date": "2012-04-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Though it isn't his best work, True Romance still has that vibrant Tarantino energy that keeps our eyes pervasively glued to the screen. The scene between Walken and Hopper is genius, and the film is worth-watching just because of it.",
      "review_date": "2012-11-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Otra vez lo hizo. Aunque la película no es de las nuevas, ni de las mejores, nuevamente Tarantino me soprendió con su película. Bien dirigida por Tony Scott y impresionante historia por Tarantino, la película esta bien actuada, con unaOtra vez lo hizo. Aunque la película no es de las nuevas, ni de las mejores, nuevamente Tarantino me soprendió con su película. Bien dirigida por Tony Scott y impresionante historia por Tarantino, la película esta bien actuada, con una grotesca acción que la hace mas que buena.",
      "review_date": "2013-08-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great movie! Just another example of Tarantinos fantastic writing ability. Not to say thats the only great thing, the acting from every actor in it is very good and Tony Scott does a great job. Definetly a must see film, especially if you'reGreat movie! Just another example of Tarantinos fantastic writing ability. Not to say thats the only great thing, the acting from every actor in it is very good and Tony Scott does a great job. Definetly a must see film, especially if you're a fan of Tarantino.",
      "review_date": "2014-02-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The truth about True Romance is very simple. On the outside: a lot of violence and sexual content. Take a deeper look, and you find a well-written love story.",
      "review_date": "2014-05-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Quentin Tarantino’s True Romance script is an elaborate, extended fantasy that sees a geeky shop assistant transformed into a great lover, a vengeful vigilante and, ultimately, a smooth criminal. Meanwhile, the story lacks any kind ofQuentin Tarantino’s True Romance script is an elaborate, extended fantasy that sees a geeky shop assistant transformed into a great lover, a vengeful vigilante and, ultimately, a smooth criminal. Meanwhile, the story lacks any kind of emotional or moral consequence: the hero gets his father killed, the heroine guns down a cop during a drug deal gone sour, but they both drive off happily into the sunset, untainted by the mayhem they have left in their wake.\r Are we expected to buy into this bloody fairytale? Are we supposed to like these self-obsessed, homicidal maniacs? The answer to both these questions is a resounding yes, because the wishes being fulfilled here belong to former geeky shop assistant Quentin Tarantino, and he had the talent to flesh out his fantasy with vividly-drawn characters spouting instantly classic dialogue during jaw-dropping set-pieces.\r The I’d **** Elvis speech that introduces comic book clerk Clarence, the rooftop confession and declaration of love by Alabama, the showdown with Drexl, Virgil at the motel and, of course, the Sicilian scene are all hugely appealing to any budding hopeful. What Tarantino couldnt have known when he was scribbling away behind the counter at Video Archives, however, is that they would be equally attractive to established and, in some cases, legendary stars.\r Despite his earlier reservations, Pitt signed on to play a bone idle stoner flatmate; the notoriously picky Gary Oldman sank his post-Dracula teeth into the role of a racially-confused pimp; and Chris Penn, Tom Sizemore and Samuel L. Jackson happily played virtual bit parts. Add never-to-be-bettered work from Christian Slater and Patricia Arquette to the mix, and you already have something special. But the genuinely great moments in True Romance belong to James Gandolfini, Dennis Hopper and Christopher Walken.\r Even with an excellent screenplay and a rogues gallery of protagonists waiting to be brought to life, any film needs the right director, and True Romance boasts an ideal helmer in the unlikely shape of Tony Scott. Who better than the director of Top Gun to bring an arrested adolescents fantasy to life? Scott verges on self-parody in terms of the gloss and pace he brings to proceedings, giving the movie a relentless energy that never allows the audience to stop and consider the absurdity of it all.\r Alabamas execution of Virgil, complete with feral scream and lovingly photographed, blood-soaked breasts, earned the film notoriety and a run-in with the censors, although Scotts approach to the material is best summed up by another, less controversial creative decision. The script has Clarences initial drug-hawking meeting with Elliot take place, unremarkably enough, in a zoo, but the director wanted something with a little more pizzazz, so he set the sequence on a rollercoaster. Tarantino is overstating the case when he compares Scott to undervalued auteurs of the past (Douglas Sirk he aint), but theres no doubt he was perfect to orchestrate this wild ride.\r This is not only an immensely entertaining violent action but genuinely romantic at times. Tarantino's dialogue is as sparkling as ever!",
      "review_date": "2016-04-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best Movie Eva!!! And Alabama is the cutest character I've ever seen LOL! Patricia Arquette is so gorgeous! I just love the whole storyline and how much Clarence and Alabama love each other, from the moment they meet!",
      "review_date": "2006-03-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is one of the all-time greats although it does seem like it is just a combination of some of the best scenes and not one cohesive story.   It would've been cool to see Tarantino direct it as well. BUT - each scene is more memorable This is one of the all-time greats although it does seem like it is just a combination of some of the best scenes and not one cohesive story.   It would've been cool to see Tarantino direct it as well. BUT - each scene is more memorable than the next - just a great f'in movie.",
      "review_date": "2006-11-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Don't read other people's comments. The only way to find out what a real film fun should look like is to see the film. If you wanna seduce your friend, take him/her with you!",
      "review_date": "2006-03-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "All style, no substance. If you can handle the violence, it's pretty good fun with a great climactic ending.",
      "review_date": "2021-04-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An absolutely wild film directed by Tony Scott and written by Quentin Tarantino, True Romance is a real guy's movie to watch on Valentine's Day or the day before, as it was in my case. Starring an ensemble cast with a tremendous cast ofAn absolutely wild film directed by Tony Scott and written by Quentin Tarantino, True Romance is a real guy's movie to watch on Valentine's Day or the day before, as it was in my case. Starring an ensemble cast with a tremendous cast of characters in small cameo-esque roles throughout that really add thunder to this film. Over-the-top, stupid, and thoroughly Tarantino, True Romance is an odd little love story with an affinity for guns, unexpected drug dealing, and a whole cast of gangsters, cops, and movie producers, all vying for the coke from an unexpected source. With great acting and writing, the film may be a bit predictable and is thoroughly cliched, but is remains terrific entertainment throughout its runtime.The best scene in the film is the infamous \"Sicilian scene\" with Christopher Walken and Dennis Hopper. It is all we see of Walken's mysterious Don Vincenzo, the consigliere for infamous gangster Blue Lou Boyle, who had his coke accidentally stolen by stupid Clarence (Christian Slater). With the coke worth than $500,000, it should be clear that he is unhappy. Going to Clarence's father Clifford (Hopper), Don Vincenzo gives the man a chance to talk. A raw, tough-nosed conversation, it is a brilliantly eloquent, concise, and written sequence by Tarantino. Naturally, Walken nails the role and is a real highlight of the film as a whole. The nervous energy given off by Hopper, but his solid defiance to this brutally violent man before him is equally terrific. This is a scene that gives Tarantino to spin this crime yarn into something of higher literary significance and he does it, with a gorgeously penned scene. Walken and Hopper do the writing justice, plus some.In a typically chameleon-like performance, Gary Oldman also steals the show as pimp Drexl Spivey. Confronted by Clarence to free Alabama (Patricia Arquette) from his grasp and also the man with the coke from Blue Lou Boyle, Oldman's Drexl is a black man wannabe with a scarred face, one eye, and long brown dreadlocks. This man really is a chameleon. Psychotic, unhinged, and an undeniably wild pimp, Oldman's character may be my favorite from the film, even though Walken's terrific Sicilian gangster gets the best scene in the entire film.Naturally, James Gandolfini is also tremendous in this film as Don Vincenzo's trigger man Virgil. Roughing up Alabama to find out where the coke is, Virgil takes a liking to her and let's her take one shot before he finishes her off. Menacing, tough, and yet warm and oddly approachable like only an oddly good guy Gandolfini can be, the film finds yet another great scene with Galdolfini's moment in the spotlight.The film also finds a great source of energy from Brad Pitt's Floyd. He never really gets a scene to himself, rather he is always a supporting character. That said, he is hysterical as a druggy who is always high. Letting the gangsters know Clarence's every move while offering them drugs the whole time, Floyd is a real gem of a character. No surprise he inspired Pineapple Express given how well he would fit in that film. The best moment with Floyd comes as a gangster pulls a gun causing a delayed, high reaction from Pitt as he mutters, \"Woah.\"Yet, the stars here are Christian Slater and Patricia Arquette. Less compelling than the rest of the supporting cast, their twisted love story is one only Tarantino could concoct. In essence, it is a dry run for Natural Born Killers without the constantly bloodshed and via the direction of Tony Scott. Thus, it is less coked up and more restrained than Oliver Stone's film. Though less interesting than the other characters, their Bonnie & Clyde-esque matchup of a hooker with a heart of gold and a lonely man with limited romantic experience is somehow charming and sweat. True Romance is a film that violently argues that, to love somebody, you must kill for them. Clarence and Alabama pull the trigger for one another, in the most romantic acts ever and in an attempt to be Elvis (Val Kilmer) cool.Kinetic, insane, and thoroughly Tarantino, the film is not really a Tony Scott film. Yet, his assured hand does help keep it a bit more restrained without descending into complete parody. With a tremendous cast that all nail their roles, True Romance is a very good film that is simply fun and somehow romantic.",
      "review_date": "2017-02-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "As far as Tony Scott films go -- or even Quentin Tarantino films for that matter -- \"True Romance\" may not necessarily be my favorite, but there is definitely a lot to savor here. As always, Tarantino's screenplay is rife with fun, wittyAs far as Tony Scott films go -- or even Quentin Tarantino films for that matter -- \"True Romance\" may not necessarily be my favorite, but there is definitely a lot to savor here. As always, Tarantino's screenplay is rife with fun, witty passages of dialogue, some killer action set pieces, and a gallery of vibrant, brilliantly realized characters. Tony Scott's direction is as magnetic, stylish, and as colorful as can be. And the performances -- be it from the main, supporting, or even bit cast members -- bring the laughs in fairly healthy bunches. It's a fun movie, but again, as far as Tony Scott and Quentin Tarantino movies are concerned, I've seen brighter things.",
      "review_date": "2018-04-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The thing that really makes “True Romance” is Tarantino's script.  Tony Scott does an admirable job, but the plot and the dialogue and just so many memorable scenes make it fun to revisit over and over.  Amazing performances by everyone.  IThe thing that really makes “True Romance” is Tarantino's script.  Tony Scott does an admirable job, but the plot and the dialogue and just so many memorable scenes make it fun to revisit over and over.  Amazing performances by everyone.  I don't even recognize Gary Oldman, and it isn't the heavy makeup, it is the way he embodies that character that I have never seen him do anywhere else.  I give it an A, make a point to go see this movie.",
      "review_date": "2021-05-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The beginning is horrible: why should I watch a beta guy doing big mistakes? Oh sure, I will kill another man for being a pimp, of course I will do everything for a whore and even marry her xD. After that the movie is much better, but stillThe beginning is horrible: why should I watch a beta guy doing big mistakes? Oh sure, I will kill another man for being a pimp, of course I will do everything for a whore and even marry her xD. After that the movie is much better, but still not quite realistic",
      "review_date": "2019-11-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "+Looks great in 4k hdr+Excellent ensemble cast+Great screenplay-Filled to the brim with clichésEnjoyable marriage of tarantino script and tony Scott's direction, this crime thriller is an intriguing and watchable movie.",
      "review_date": "2021-08-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "True Romance is a classic. With great acting performances, visually impressive action sequences, amazing soundtrack and one of the best ending standoffs I've seen, it deserves it's title of a classic 90's flick. It's not only one of the bestTrue Romance is a classic. With great acting performances, visually impressive action sequences, amazing soundtrack and one of the best ending standoffs I've seen, it deserves it's title of a classic 90's flick. It's not only one of the best action flick of the 90's, it's one of the best action movie of all time.",
      "review_date": "2018-04-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This might've been a pretty good action flick.  It starts off like a goofy rom-com and goes on to present us with insane bouts of violence.  But then, in the middle of a scene of absolute madness, someone picks up a gun and murders a cop.This might've been a pretty good action flick.  It starts off like a goofy rom-com and goes on to present us with insane bouts of violence.  But then, in the middle of a scene of absolute madness, someone picks up a gun and murders a cop.Now you could argue that the cop just executed a guy, so he's a bad guy too, but it's not an argument I'm going to hear.  Any character that murders a cop is stepping out over the line and there's no turning back and when the character is one of the leads you're done.  I'm out.  This is why I watched a couple episodes of NYPD Blue and never went back.  It's why I watched a couple eps of The Shield and never turned it on again.  It's non-negotiable.  It's a deal-breaker.  In my book, \"True Romance\" is **** and that's the beginning and The End for all time.",
      "review_date": "2019-08-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nQuentin Tarantino’s True Romance script is an elaborate, extended fantasy that sees a geeky shop assistant transformed into a great lover, a vengeful vigilante and, ultimately, a smooth criminal. Meanwhile, the story lacks any kind of emotional or moral consequence: the hero gets his father killed, the heroine guns down a cop during a drug deal gone sour, but they both drive off happily into the sunset, untainted by the mayhem they have left in their wake.\r Are we expected to buy into this bloody fairytale? Are we supposed to like these self-obsessed, homicidal maniacs? The answer to both these questions is a resounding yes, because the wishes being fulfilled here belong to former geeky shop assistant Quentin Tarantino, and he had the talent to flesh out his fantasy with vividly-drawn characters spouting instantly classic dialogue during jaw-dropping set-pieces.\r The I’d **** Elvis speech that introduces comic book clerk Clarence, the rooftop confession and declaration of love by Alabama, the showdown with Drexl, Virgil at the motel and, of course, the Sicilian scene are all hugely appealing to any budding hopeful. What Tarantino couldnt have known when he was scribbling away behind the counter at Video Archives, however, is that they would be equally attractive to established and, in some cases, legendary stars.\r Despite his earlier reservations, Pitt signed on to play a bone idle stoner flatmate; the notoriously picky Gary Oldman sank his post-Dracula teeth into the role of a racially-confused pimp; and Chris Penn, Tom Sizemore and Samuel L. Jackson happily played virtual bit parts. Add never-to-be-bettered work from Christian Slater and Patricia Arquette to the mix, and you already have something special. But the genuinely great moments in True Romance belong to James Gandolfini, Dennis Hopper and Christopher Walken.\r Even with an excellent screenplay and a rogues gallery of protagonists waiting to be brought to life, any film needs the right director, and True Romance boasts an ideal helmer in the unlikely shape of Tony Scott. Who better than the director of Top Gun to bring an arrested adolescents fantasy to life? Scott verges on self-parody in terms of the gloss and pace he brings to proceedings, giving the movie a relentless energy that never allows the audience to stop and consider the absurdity of it all.\r Alabamas execution of Virgil, complete with feral scream and lovingly photographed, blood-soaked breasts, earned the film notoriety and a run-in with the censors, although Scotts approach to the material is best summed up by another, less controversial creative decision. The script has Clarences initial drug-hawking meeting with Elliot take place, unremarkably enough, in a zoo, but the director wanted something with a little more pizzazz, so he set the sequence on a rollercoaster. Tarantino is overstating the case when he compares Scott to undervalued auteurs of the past (Douglas Sirk he aint), but theres no doubt he was perfect to orchestrate this wild ride.\r This is not only an immensely entertaining violent action but genuinely romantic at times. Tarantino's dialogue is as sparkling as ever!",
      "review_date": "2015-04-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Shy under-achiever falls in love with the hooker who was his birthday present and they get married but the whirlwind romance is heading for some complications... like hitmen and psycho drug dealers.\r Quentin Tarantino’s True Romance scriptShy under-achiever falls in love with the hooker who was his birthday present and they get married but the whirlwind romance is heading for some complications... like hitmen and psycho drug dealers.\r Quentin Tarantino’s True Romance script is an elaborate, extended fantasy that sees a geeky shop assistant transformed into a great lover, a vengeful vigilante and, ultimately, a smooth criminal. Meanwhile, the story lacks any kind of emotional or moral consequence: the hero gets his father killed, the heroine guns down a cop during a drug deal gone sour, but they both drive off happily into the sunset, untainted by the mayhem they have left in their wake.\r Are we expected to buy into this bloody fairytale? Are we supposed to like these self-obsessed, homicidal maniacs? The answer to both these questions is a resounding yes, because the wishes being fulfilled here belong to former geeky shop assistant Quentin Tarantino, and he had the talent to flesh out his fantasy with vividly-drawn characters spouting instantly classic dialogue during jaw-dropping set-pieces.\r This is not only an immensely entertaining violent action but genuinely romantic at times. Tarantino's dialogue is as sparkling as ever!\r One of my Favorites! :D",
      "review_date": "2015-04-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A shy under-achiever falls in love with the hooker who was his birthday present and they get married but the whirlwind romance is heading for some complications... like hitmen and psycho drug dealers.\r Quentin Tarantino’s True RomanceA shy under-achiever falls in love with the hooker who was his birthday present and they get married but the whirlwind romance is heading for some complications... like hitmen and psycho drug dealers.\r Quentin Tarantino’s True Romance script is an elaborate, extended fantasy that sees a geeky shop assistant transformed into a great lover, a vengeful vigilante and, ultimately, a smooth criminal.\r Even with an excellent screenplay and a rogues gallery of protagonists waiting to be brought to life, any film needs the right director, and True Romance boasts an ideal helmer in the unlikely shape of Tony Scott. Who better than the director of Top Gun to bring an arrested adolescents fantasy to life? Scott verges on self-parody in terms of the gloss and pace he brings to proceedings, giving the movie a relentless energy that never allows the audience to stop and consider the absurdity of it all.\r Alabamas execution of Virgil, complete with feral scream and lovingly photographed, blood-soaked breasts, earned the film notoriety and a run-in with the censors, although Scotts approach to the material is best summed up by another, less controversial creative decision. The script has Clarences initial drug-hawking meeting with Elliot take place, unremarkably enough, in a zoo, but the director wanted something with a little more pizzazz, so he set the sequence on a rollercoaster. Tarantino is overstating the case when he compares Scott to undervalued auteurs of the past (Douglas Sirk he aint), but theres no doubt he was perfect to orchestrate this wild ride.\r This is not only an immensely entertaining violent action but genuinely romantic at times. Tarantino's dialogue is as sparkling as ever.\r A True Masterpiece.",
      "review_date": "2015-04-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Quentin Tarantino’s True Romance script is an elaborate, extended fantasy that sees a geeky shop assistant transformed into a great lover, a vengeful vigilante and, ultimately, a smooth criminal. Meanwhile, the story lacks any kind ofQuentin Tarantino’s True Romance script is an elaborate, extended fantasy that sees a geeky shop assistant transformed into a great lover, a vengeful vigilante and, ultimately, a smooth criminal. Meanwhile, the story lacks any kind of emotional or moral consequence: the hero gets his father killed, the heroine guns down a cop during a drug deal gone sour, but they both drive off happily into the sunset, untainted by the mayhem they have left in their wake.\r Are we expected to buy into this bloody fairytale? Are we supposed to like these self-obsessed, homicidal maniacs? The answer to both these questions is a resounding yes, because the wishes being fulfilled here belong to former geeky shop assistant Quentin Tarantino, and he had the talent to flesh out his fantasy with vividly-drawn characters spouting instantly classic dialogue during jaw-dropping set-pieces.\r Despite his earlier reservations, Pitt signed on to play a bone idle stoner flatmate; the notoriously picky Gary Oldman sank his post-Dracula teeth into the role of a racially-confused pimp; and Chris Penn, Tom Sizemore and Samuel L. Jackson happily played virtual bit parts. Add never-to-be-bettered work from Christian Slater and Patricia Arquette to the mix, and you already have something special. But the genuinely great moments in True Romance belong to James Gandolfini, Dennis Hopper and Christopher Walken.\r Even with an excellent screenplay and a rogues gallery of protagonists waiting to be brought to life, any film needs the right director, and True Romance boasts an ideal helmer in the unlikely shape of Tony Scott. Who better than the director of Top Gun to bring an arrested adolescents fantasy to life? Scott verges on self-parody in terms of the gloss and pace he brings to proceedings, giving the movie a relentless energy that never allows the audience to stop and consider the absurdity of it all.\r Alabamas execution of Virgil, complete with feral scream and lovingly photographed, blood-soaked breasts, earned the film notoriety and a run-in with the censors, although Scotts approach to the material is best summed up by another, less controversial creative decision. The script has Clarences initial drug-hawking meeting with Elliot take place, unremarkably enough, in a zoo, but the director wanted something with a little more pizzazz, so he set the sequence on a rollercoaster. Tarantino is overstating the case when he compares Scott to undervalued auteurs of the past (Douglas Sirk he aint), but theres no doubt he was perfect to orchestrate this wild ride.\r This is not only an immensely entertaining violent action but genuinely romantic at times. Tarantino's dialogue is as sparkling as ever.",
      "review_date": "2015-04-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Quentin Tarantino’s True Romance script is an elaborate, extended fantasy that sees a geeky shop assistant transformed into a great lover, a vengeful vigilante and, ultimately, a smooth criminal. Meanwhile, the story lacks any kind ofQuentin Tarantino’s True Romance script is an elaborate, extended fantasy that sees a geeky shop assistant transformed into a great lover, a vengeful vigilante and, ultimately, a smooth criminal. Meanwhile, the story lacks any kind of emotional or moral consequence: the hero gets his father killed, the heroine guns down a cop during a drug deal gone sour, but they both drive off happily into the sunset, untainted by the mayhem they have left in their wake.\r Are we expected to buy into this bloody fairytale? Are we supposed to like these self-obsessed, homicidal maniacs? The answer to both these questions is a resounding yes, because the wishes being fulfilled here belong to former geeky shop assistant Quentin Tarantino, and he had the talent to flesh out his fantasy with vividly-drawn characters spouting instantly classic dialogue during jaw-dropping set-pieces.\r The I’d **** Elvis speech that introduces comic book clerk Clarence, the rooftop confession and declaration of love by Alabama, the showdown with Drexl, Virgil at the motel and, of course, the Sicilian scene are all hugely appealing to any budding hopeful. What Tarantino couldnt have known when he was scribbling away behind the counter at Video Archives, however, is that they would be equally attractive to established and, in some cases, legendary stars.\r Despite his earlier reservations, Pitt signed on to play a bone idle stoner flatmate; the notoriously picky Gary Oldman sank his post-Dracula teeth into the role of a racially-confused pimp; and Chris Penn, Tom Sizemore and Samuel L. Jackson happily played virtual bit parts. Add never-to-be-bettered work from Christian Slater and Patricia Arquette to the mix, and you already have something special. But the genuinely great moments in True Romance belong to James Gandolfini, Dennis Hopper and Christopher Walken.\r Even with an excellent screenplay and a rogues gallery of protagonists waiting to be brought to life, any film needs the right director, and True Romance boasts an ideal helmer in the unlikely shape of Tony Scott. Who better than the director of Top Gun to bring an arrested adolescents fantasy to life? Scott verges on self-parody in terms of the gloss and pace he brings to proceedings, giving the movie a relentless energy that never allows the audience to stop and consider the absurdity of it all.\r Alabamas execution of Virgil, complete with feral scream and lovingly photographed, blood-soaked breasts, earned the film notoriety and a run-in with the censors, although Scotts approach to the material is best summed up by another, less controversial creative decision. The script has Clarences initial drug-hawking meeting with Elliot take place, unremarkably enough, in a zoo, but the director wanted something with a little more pizzazz, so he set the sequence on a rollercoaster. Tarantino is overstating the case when he compares Scott to undervalued auteurs of the past (Douglas Sirk he aint), but theres no doubt he was perfect to orchestrate this wild ride.\r This is not only an immensely entertaining violent action but genuinely romantic at times. Tarantino's dialogue is as sparkling as ever.",
      "review_date": "2015-12-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Although there is entertainment value here, the film's intentions soon become clear. This is a mean spirited, stupid film that comes off as little more than low, cynical attempt at street credibility. It wants to be the next Reservoir DogsAlthough there is entertainment value here, the film's intentions soon become clear. This is a mean spirited, stupid film that comes off as little more than low, cynical attempt at street credibility. It wants to be the next Reservoir Dogs forgetting the fact that that film was a black comedy that mocked violence. This on the other hand condones it. Add in a couple of horrid, destable protagonists with a little bit of casual homophobia here and there and you have a film that in spite of the fact that is was allegedly penned by Quentin Tarantino prior to the production of Pulp Fiction, feels like a cheap, dumb, contrived rip off of that film. Indeed this film is closer to the Kevin Costner turkey 3000 Miles To Graceland than Pulp Fiction.",
      "review_date": "2016-04-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Well, since I'm a huge fan of old fashion flicks like in the 80's and the early 90's and in the old centuries, it is my duty to review this Tony Scott's crime thrilling classic, True Romance. Yes, people are huge fans of this and consider itWell, since I'm a huge fan of old fashion flicks like in the 80's and the early 90's and in the old centuries, it is my duty to review this Tony Scott's crime thrilling classic, True Romance. Yes, people are huge fans of this and consider it a cult classic and the script is written by Quentin Tarantino since he did his directing debut on Reservoir Dogs and he also write the script for it. True Romance has it's Quentin Tarantino style to the story and the directing style is by Tony Scott even it had some violence that are intense are really enjoyable. It had a huge cast in this. Christian Slater and Patricia Arquette are Clarence Worley and Alabama Whitman, the two couple who are married after going to the movies to watch a kung fu film. Dennis Hopper plays Clarence's father. Val Kilmer plays an Elvis Presley apparition who is a conscience to Clarence like he is on his mind because Clarence an Elvis Presley fanatic. And then we have Gary Oldman as the pimp, Drexl, who Alabama used to work with. Even if I've heard of this movie cause' I'm a fan of old stuff, the realistic violence is got to be the highlight of the film. I just love s**t like that. As it is, the film is a cult favourite for the people and it kind of reminds them of the film made by Quentin Tarantino because of the stylish look of violence. What more can I say? It's Quentin Tarantino's script. I love True Romance, it's tremendous.",
      "review_date": "2019-04-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A shy under-achiever falls in love with the hooker who was his birthday present and they get married but the whirlwind romance is heading for some complications... like hitmen and psycho drug dealers.\r Quentin Tarantino’s True RomanceA shy under-achiever falls in love with the hooker who was his birthday present and they get married but the whirlwind romance is heading for some complications... like hitmen and psycho drug dealers.\r Quentin Tarantino’s True Romance script is an elaborate, extended fantasy that sees a geeky shop assistant transformed into a great lover, a vengeful vigilante and, ultimately, a smooth criminal.\r Even with an excellent screenplay and a rogues gallery of protagonists waiting to be brought to life, any film needs the right director, and True Romance boasts an ideal helmer in the unlikely shape of Tony Scott. Who better than the director of Top Gun to bring an arrested adolescents fantasy to life? Scott verges on self-parody in terms of the gloss and pace he brings to proceedings, giving the movie a relentless energy that never allows the audience to stop and consider the absurdity of it all.\r Alabamas execution of Virgil, complete with feral scream and lovingly photographed, blood-soaked breasts, earned the film notoriety and a run-in with the censors, although Scotts approach to the material is best summed up by another, less controversial creative decision. The script has Clarences initial drug-hawking meeting with Elliot take place, unremarkably enough, in a zoo, but the director wanted something with a little more pizzazz, so he set the sequence on a rollercoaster. Tarantino is overstating the case when he compares Scott to undervalued auteurs of the past (Douglas Sirk he aint), but theres no doubt he was perfect to orchestrate this wild ride.\r This is not only an immensely entertaining violent action but genuinely romantic at times. Tarantino's dialogue is as sparkling as ever.\r A True Masterpiece.",
      "review_date": "2016-03-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A special-needs version of Wild at Heart (1990). True Romance is a perfect example of how you can't make a good film out of a bad script. Tarantino's degeneracy oozes through the dialogue and obcene violence. His racism and misogenyA special-needs version of Wild at Heart (1990). True Romance is a perfect example of how you can't make a good film out of a bad script. Tarantino's degeneracy oozes through the dialogue and obcene violence. His racism and misogeny particularly apparent in this stinker. It's well directed by the late Tony Scott, but a lot of this is undone by the poor editing. There is a strong scene between Walken and Hopper, but the use of the n-word leaves a bad taste, particularly when this was an annecdote Tarantino used to tell at parties.",
      "review_date": "2021-03-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of Tarantino's best scripts with a dynamic cast and one of the best scenes in any movie ever featuring Walken and Hopper. Filled with sharp dialogue and great performances. A must see.",
      "review_date": "2017-04-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is criminally underseen. It's one of the flicks Tarantino has ever written and Tony Scott has ever filmed. Filled with romance, inspired characters, solid charasmatic performances and ultra violence this is without a doubt one ofThis movie is criminally underseen. It's one of the flicks Tarantino has ever written and Tony Scott has ever filmed. Filled with romance, inspired characters, solid charasmatic performances and ultra violence this is without a doubt one of my favorite films. The film tells the tale of Alabama played by an amazing Patricia Arquette and Clarence a \"so cool\" Christian Slater in possibly his best performance. Shes a call girl his friends hire for him. They immediately fall in love and he tries to free her from her violent pimp played by a surprising Gary Oldman. It of course goes wrong and he ends up grabbing the wrong suitcase, one filled with cocaine. They of course go on down to Hollywood to try and sell it and before they know it they have the cops, the mafia and a bunch of criminals after them. The movie is well written the screenplay is smart and overly romantic with some great comedy and action. And it's all just so well executed by Tony Scott. It's really one of the best films ever. Although it floundered at the box office it has since found a most deserved cult following. Dennis Hopper, Christopher Walken, Brad Pitt, James Gandolfini, Michael Rappaport, Chris Penn, Val Kilmer, Samuel L. Jackson, Saul Rubinek, Conchata Ferrell and Tom Sizemore also star.Budget: $12.5MBox Office: $12.3M9/10",
      "review_date": "2020-07-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "All the romance and very little truth, Slater and Arquette sparks up the dim fire every time.True Romance\n\nScott's love track is a big sloppy kiss from 70s music video. The director Tony Scott fails to comprehend Tarantino's script and as aAll the romance and very little truth, Slater and Arquette sparks up the dim fire every time.True RomanceScott's love track is a big sloppy kiss from 70s music video. The director Tony Scott fails to comprehend Tarantino's script and as a result this love bash feels effortful and messy. But I wouldn't just blame Scott to make sense in a film so teenage-ish as such. Not that we haven't had good films in such genre, it's just that the goofiness isn't motivated as those films do and are. And Tarantino is to be put on trial too. Maybe, if he was there, in the director's seat, he might have carved it out in one rhythmic beat. Even though the script and the characters journey might constraint it. The best thing film does is not feeling obligated to explain the falling in love aspect of these characters.It is instant. Either it happens or not and when it does, that is it. There's no clause, no explanation and no boundary. Now, in a film that is basically a chase scene, it is extremely bold and outrageous for Scott to expect us to have a conversation. That liberty comes only when the rush is dragged and not pushed by the film. To a script that zooms its way out, Scott had to focus not only on the stops, the stillness of the storyline but also on the emergencies.On performance objective, the cast is a topsy-turvy dream. Samuel L. Jackson, Gary Oldman, James Gandolfini, Brad Pitt and Christopher Walken are supporting the lead in the form of guest appearances. But what still works, is those same little delights of chocolates that we receive periodically in the film fooling us in believing that it is in safe hands. True Romance is another product that came out from Tarantino's press that communicates with young couple with a robust argument and his signature ruffian violence.",
      "review_date": "2019-07-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An entertaining, fast paced, action/crime movie that probably would of been better if it's writer (Tarantino) had actually directed.",
      "review_date": "2021-01-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Everybody was great in the film except two of the main character, Slater and Arquette was good at theirself but not as a couple, i didn't engaged with their relationship, i didn't feel their relationship, and i didn't care about theirEverybody was great in the film except two of the main character, Slater and Arquette was good at theirself but not as a couple, i didn't engaged with their relationship, i didn't feel their relationship, and i didn't care about their relationship, everything is going too fast for them, i just not feeling it, it's a great action packed, it's an interesting crime story, but not a True Romance.",
      "review_date": "2021-08-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fuelled by Tarantino's magnificent script and great performances across the board. It's an edgy, super violent, funny weird mish mash of genres that is so memorable and introduced the world to the mind of Tarantino.",
      "review_date": "2021-07-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Excellent movie, a true Quentin Tarantino film at heart. Not his best screenplay but definitely one of the best.",
      "review_date": "2022-02-02",
      "source": "metacritic"
    }
  ],
  "num_reviews": 59
}