{
    "rating": 8.9,
    "release_date": "1979-12-19",
    "num_reviews": 230,
    "genres": [
        "Drama"
    ],
    "summary": "On the same day Manhattan advertising executive Ted Kramer (Dustin Hoffman) lands the biggest account of his career, he learns that his wife, Joanna (Meryl Streep), is leaving him and their young son, Billy (Justin Henry). Forced to raise his son alone, Ted loses his job but gains a stronger relationship with the child with the help of another single parent, Margaret (Jane Alexander). When Joanna returns to claim custody of Billy, the ensuing court battle takes a toll on everyone concerned.",
    "reviews": [
        {
            "content": "This is one of the only memories I remembered from my film class. That must mean I liked this movie!",
            "review_date": "2023-02-16",
            "source": "rt"
        },
        {
            "content": "The best film about father's rights ever made.\n\nDirector Robert Benton's legal drama Kramer vs. Kramer (1979) is a phenomenal piece of art. Benton's direction is fascinating as he keeps you right alongside every moment with Dustin Hoffman. The way cinematographer Néstor Almendros moves the camera back and forth within a room so smoothly is magnificent. His panning shots are gripping like Benton's careful direction that provides a fair balance between parents to show their perspective.\n\nYou definitely side with Hoffman's nurturing father because he changes from an inconsiderate, sexist workaholic to a good father, but Benton makes sure you understand how suffocated and ignored Meryl Streep's Joanna felt before deciding to leave. Editor Gerald B. Greenberg's slick cuts keep the pace moving very fast and hold your attention with the tense scenes. I like how the first quarter is very sad, then it's quite funny, then the entire custody trial is devastating. It's a very mature and thoughtful film that will make you laugh and cry alike. Seeing a child cry over his mother leaving him and his father getting only visitation is tragic. Kramer vs. Kramer is a fantastic film.\n\nWriter Robert Benton adapts Avery Corman's novel about a couple's bitter divorce and custody battle over their emotionally hurting son. I love that Benton wants to just show you as a director and writer what the parents are like and let you decide, rather than emotionally manipulate the audience into only seeing one side of the arguments. Benton's jokes are funny, his insights into divorce and parents are smart, and his emotional realism is touching. It's quite interesting how \n\nAvery's story is as much about how the divorce affects their son as much as the parents. You get a selfish man learning to step up and be a real father and a mother figuring out what she values in life. It's got psychological drama, family drama, and a surprising amount of humor to Benton's empathetic writing. Kramer vs. Kramer deals with marriage, parenting, divorce, gender roles of fathers versus mothers, feminism for women's freedom, father's rights to parent and custody, healthy work-life balance, and single parents struggling to get by in life.\n\nDustin Hoffman is incredible as single father Ted Kramer. He starts off unlikable as a workaholic creep, then softens into a nurturing dad to his little boy after his wife leaves him abruptly. Hoffman shows off how his insincere man, who could not see the brewing problems arising in his marriage, could genuinely change into a caring person and terrific working single father who deserves custody of his child. Meryl Streep is gorgeous and gripping whenever she appears as Joanna Kramer. I was stunned by her heartbreaking leaving sequence and you feel her frustrations, embarrassments, and insecurities with each little moment of her nuanced performance. Streep changes dramatic acting here into something truly realistic and heartfelt. Meryl Streep is even better in Kramer vs. Kramer than she was in Sophie's Choice, honestly.\n\nJustin Henry is outstanding as Hoffman's kid Billy Kramer. His tearful desolation, frustrated whining, and uncertain fear all feels authentic. Justin Henry gives one of the most realistic and earnest performances of any child actor in cinema history. Jane Alexander is very kind and honest as newly single mother Margaret Phelps. Howard Duff's tough divorce lawyer John Shaunessy is fabulous and relentless. George Coe is such a jerk as Hoffman's horrible boss Jim O'Connor. JoBeth Williams is enchanting as the quite pretty lady friend of Hoffman's Ted named Phyllis Bernard. Howland Chamberlain is fun as the disinterested and stern divorce Judge Atkins.\n\nProduction designer Paul Sylbert's garbage apartment sets are realistic and a fun awful environment for them to be cooped up in throughout Kramer vs. Kramer. Alan Hicks' set decoration puts basic furniture and family props all over like a child really lives there. Sound designers Sanford Rackow, James Perdue, and Stan Bochner keep the entire film especially quiet to resonate more emotionally when Dustin Hoffman whispers to his child.\n\nClassical composer Antonio Vivaldi's \"Mandolin Concerto in C Major\" is used as Kramer vs. Kramer's main theme. It's playful and light to keep the tone lighthearted compared to the film's depressing drama. Ruth Morley's costumes are all sorts of cute and fashionable sweaters and suits for both Meryl Streep and Dustin Hoffman. I love the light make-up of Allen Weisinger for Meryl.\n\nIn all, Kramer vs. Kramer is a moving and intelligent film of the highest dramatic caliber. I was entranced for 105 minutes.",
            "review_date": "2023-01-02",
            "source": "rt"
        },
        {
            "content": "It has a great performance from Dustin Hoffman as the father. And the film's main reason why it works is the relationship between the father and the son. They would butt heads but they still love each other like any normal father and son would. The mother is a bit too unlikable but it's still a decent film to check out. But I'm gonna warn you that the first half is a father-son relationship and the second half is a courtroom drama. And the film has a satisfying ending to it.",
            "review_date": "2022-08-31",
            "source": "rt"
        },
        {
            "content": "[11/17/20]: This is by far the biggest consensus in favor of a film in my whole workshop. Masterful use of french toast as a story device to showcase change in a character. Wildly good acting from everyone involved, unsurpringsly.",
            "review_date": "2022-07-03",
            "source": "rt"
        },
        {
            "content": "Thankfully the violence, sexism, and misogyny in so much of 70’s American cinema ended with this beautiful, human, and tender film. Incredible performances. A great cep on the decade of movies, and pointing towards the good things to come.",
            "review_date": "2022-05-22",
            "source": "rt"
        },
        {
            "content": "Authentic, exciting film with two masterful interpretations.",
            "review_date": "2022-02-15",
            "source": "rt"
        },
        {
            "content": "\"Sleep tight.\"\nIt deserves well its Oscars! Here we are in a society in which the husband works and the wife cooks, cleans and raise the child. Now the model has split, the woman takes a break, what will happen to the child? It's a very touching movie with brilliant performances and there's no need of big fights. The couple still love each other and their child but they can't live like that anymore. What's beautiful it's how the father decides to do anything to keep taking care of his son. And at the end, no one really wins",
            "review_date": "2022-01-26",
            "source": "rt"
        },
        {
            "content": "A true Classic! Great introduction to the Great Meryl Streep- her part in the Movie was few and far between. but when she came on the screen she knocked it out of the Park. which shows why this was an Oscar win for her. unique story. well acted.",
            "review_date": "2021-12-14",
            "source": "rt"
        },
        {
            "content": "It was a pioneer of its time that doesn't end well for the characters but sheds light on important issues we make note of today.",
            "review_date": "2021-11-24",
            "source": "rt"
        },
        {
            "content": "Should have been longer. I appreciate it's different view of divorce and not going for the cliche, bad man route.",
            "review_date": "2021-09-13",
            "source": "rt"
        },
        {
            "content": "Maybe 40 years ago this was considered good but now? No. I don't think there are a lot of movies who talk about the this important subject matter. But whatever else there is (that's from this century) has to be better, it just has to. I mean the way the father and the son are portrayed looks very realistic to how it would actually be like. but that's about all the good I could say about this movie.",
            "review_date": "2021-08-27",
            "source": "rt"
        },
        {
            "content": "A mature and sensitive drama that was quite nuanced for its time.",
            "review_date": "2021-07-19",
            "source": "rt"
        },
        {
            "content": "Un meraviglioso affresco su un matrimonio finito male e sulla lotta per aggiudicarsi il mantenimento dell'unico figlio.\nHoffmann e Streep incollano allo schermo con due grandissime performance, frutto anche di una meravigliosa attenzione nei dialoghi e nei gesti della quotidianità.\nIl tema affrontato è spinoso, specialmente in anni in cui ancora il divorzio non era all'ordine del giorno, e la scelta di affrontarlo con l'abbandono della madre è ancora più innovativa e rischiosa.\nUn dramma familiare vero, che funziona in ogni suo aspetto.",
            "review_date": "2021-07-10",
            "source": "rt"
        },
        {
            "content": "This classic was the most realistic portrayal of how gender roles changed during that era.  It was touchingly acted by all involved.",
            "review_date": "2021-05-27",
            "source": "rt"
        },
        {
            "content": "A very well-acted and compassionate family drama that has thoughtful themes on marriages and parenthood and tugs at the heartstrings without being forceful.",
            "review_date": "2021-05-05",
            "source": "rt"
        },
        {
            "content": "On a surface level, there's not much to complain about. Dustin Hoffman in top form, a great child actor, plenty of believable parent-child moments. But for all the hype, I was expecting more. It's all just a bit melodramatic and maudlin. It doesn't go that extra mile in terms of escalating the drama, mainly because the first half of the movie is spent setting up the relationship between Kramer and his son, and we don't get to the meat of the story—his wife suing for custody—until halfway through. As a result, we get a very rushed second and third act. All this to say: it's good, but best picture? Really?",
            "review_date": "2021-03-17",
            "source": "rt"
        },
        {
            "content": "Ted Kramer is a New York advertising salesman who is on fire for his job and has just received a lucrative promotion. He rushes home to celebrate the good news with his wife Joanna. However, he is caught cold by her when she announces that she is leaving him and does not show up for months. Ted eventually has to learn to make his five-year-old son Billy the priority in his life, which has a negative effect on his professional ambitions. When Joanna suddenly returns and sues for custody of their son, the former couple end up in a bitter court battle.\n\nDustin Hoffman had already underpinned his status as a high-profile method actor well before Kramer vs. Kramer. The Graduate, Midnight Cowboy or Lenny are just a handful of examples of his high-profile roles to date. With Ted Kramer, Hoffman plays a much more grounded character who, as a workaholic, even recalls the cliché of the male image of the time. As soon as he realises that he and his son are on their own, he takes us on a sympathetic character study in which he becomes more empathetic and understanding towards Billy from scene to scene. His few scenes with his ex-wife Joanna, played by a superb Meryl Streep, are marked by mutual respect and fears of loss regarding their son. Streep plays the vulnerable and insecure Joanna with a great deal of emotion and the necessary depth to make her character endearing despite the abrupt abandonment of Billy. She manages to steer viewers to her side even though Hoffman is the real protagonist of the film. Justin Henry gives a highly mature performance for his age in the role of Billy. The back and forth between his parents varies almost by the minute, but without becoming exhausting. Also worthy of mention is Jane Alexander as Margaret, who grows closer to Ted after Joana's departure, whereupon the two form an unexpectedly close and authentic friendship.\n\nDirector Robert Benton has succeeded above all in taking a neutral and unbiased stance towards the two parties in Kramer vs. Kramer. This is particularly evident in the courtroom scenes in the third act. The big exposures are absent, there is similar fairness from both the male and female perspectives. This may sound as if Benton does not dare to go below the surface, but exactly the opposite is the case. Through the simple structure, he makes reference to the then emerging discussions about gender roles, the status of men and women and many other social phenomena such as work-life balance or custody. Divorce and power struggles over children can be messy, it even is here to some extent, but overall Kramer vs. Kramer feels very real and is not uncomfortable at any point. The ending may be a bit convoluted and doesn't seem compellingly logical, but that doesn't change the fact that Kramer vs. Kramer is a simple, rock-solid film that you take to your heart with all its transparency and closeness.",
            "review_date": "2021-03-14",
            "source": "rt"
        },
        {
            "content": "Amazing movie that perfectly exemplifies the trend of a once loving relationship turning sour, hurting everything in its path. However, the movie takes a deeper look at the relationship between father and son, breaking stereotypes that may still have been in place when the movie was released. Ted Kramer(Hoffman) develops so much as a person as he explores a realm of himself he didn't know he had as the film progresses. I highly recommend watching this movie.",
            "review_date": "2021-02-03",
            "source": "rt"
        },
        {
            "content": "A must see classic.  Tremendous depth of feeling.",
            "review_date": "2021-01-14",
            "source": "rt"
        },
        {
            "content": "A good movie with a solid script and really good performances. The main problem is that it only focuses on one point of view (Ted's), so we can not totally understand why some things happen, and how right or wrong a character is.",
            "review_date": "2020-12-21",
            "source": "rt"
        },
        {
            "content": "It's a solid film and Streep is brilliant as always. Simple plot and fairly big standard family drama with some slightly exaggerated acting from Hoffman but he didn't have much to work with the script and he was lively enough to keep the film going. Looking at it with 2020 goggles on, the most eye opening scene is when he accosts a stranger at an Xmas party, plants a kiss on her lips and walks off with a happy swagger. Pretty telling of the time and what was marginally acceptable in office politics.",
            "review_date": "2020-12-19",
            "source": "rt"
        },
        {
            "content": "Maybe you have to be a parent to appreciate it. It just didn't pull me in.",
            "review_date": "2020-12-07",
            "source": "rt"
        },
        {
            "content": "Una película hecha con mucho corazón, dolorosa y enamoradora, con una maravillosa actuación de Dustin Hoffman y en general es una muy buena película, aunque personalmente el personaje de Meryl Streep es apático y poco querible aunque si bien actuado",
            "review_date": "2020-11-28",
            "source": "rt"
        },
        {
            "content": "Robert Benton did a terrific job keeping the leading actors as the have an amazing connection, also the screenplay is heartbreaking",
            "review_date": "2020-10-24",
            "source": "rt"
        },
        {
            "content": "A complex movie about a self-absorbed main breadwinner and his underwhelmed wife as they try to figure out their changing roles in society.  Best scene: Ted interviews for a job at another firm's Christmas party.",
            "review_date": "2020-10-14",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies of all time. It's a tear-jerker. Some of the best acting I've seen - from Dustin Hoffman and Meryl Streep, but that's a given, right? Amazing script and just a perfect movie.",
            "review_date": "2020-09-23",
            "source": "rt"
        },
        {
            "content": "When I told a friend last year about how much I loved the Netflix film, \"Marriage Story,\" they told me to check out \"Kramer vs. Kramer.\" I think this movie also does a competent job telling a realistic story of divorce that is boosted by very real and impactful performances from Dustin Hoffman and Meryl Streep. Personally, I felt this movie made me clearly empathize with one character a lot more than the other, even though a case can be made that taking sides is difficult. I think because of how much I felt for one of the characters made the ending of the movie hit pretty hard for me. Overall, this is a solid drama movie that never becomes too melodramatic because of the fully realized performances from its two leads.",
            "review_date": "2020-09-10",
            "source": "rt"
        },
        {
            "content": "A good film, is one of those in which the performance is perfect, deserved the awards it received.\n\nThe film tells the story of a couple who separate and fight over custody of their son; the father who dedicated himself to work lost his wife for this, but he does everything to win and stay with his son; a great example of a father and a mandatory film for those who want to be moved, cry and evolve as a human being\n\nUnfortunately those who do not live this adult phase of life, like most kids, will hate this movie, but for all those who want to learn what is really important in this life (true love), they will fall in love just as I fell in love with characters and the beautiful story",
            "review_date": "2020-08-23",
            "source": "rt"
        },
        {
            "content": "Ted Kramer (Dustin Hoffman) is a workaholic ad executive whose ex-wife Joanna (Meryl Streep) has him take care of their son Billy (Justin Henry) on his own while she files for divorce and fights for custody. I have to admit, Kramer vs Kramer was the one best picture winner in the 70's I was looking forward to seeing the least, particularly because of the tired premise. But, I finally watched the movie and my expectations betrayed me once again.  Part of why I really like this movie is mostly Hoffman's pitch perfect balance between strong and strict to kind and loving. I especially love the stakes involving him working his parenting skills around his job and finding a job in one day before the trial. Also, Kramer vs. Kramer is one of the only movies in which the workaholic dad trope works. In most movies, such as The Santa Clause, Ghost Dad, and Liar Liar, some magical or supernatural nonsense helps rekindle the family. Here, the trope, the divorce plot, the legal drama, and the message of spending time with children are taken with so much gravitas and utter seriousness. Even though the outcome is predictable, the rest of the movie is still an incredibly solid family drama with such great performances. Also, yes, for the record, even Meryl Streep is surprisingly tolerable here. \n\n(4 Chocolate Chip Ice Cream Cartons out of 5)",
            "review_date": "2020-07-23",
            "source": "rt"
        },
        {
            "content": "The story is powerful and the acting is fantastic.",
            "review_date": "2020-07-15",
            "source": "rt"
        },
        {
            "content": "A touching drama with a good performance by Hoffman, but lacks sub-plot to be worthy of runtime.",
            "review_date": "2020-07-08",
            "source": "rt"
        },
        {
            "content": "I'm not joking every time I've seen this movie which is about three times I've cried and that's saying something\nMy grade: A",
            "review_date": "2020-06-06",
            "source": "rt"
        },
        {
            "content": "Radical in its time for its depiction of a less mother-focused dynamic in raising children, Kramer vs Kramer may tread over familiar ground at points but ties the entire narrative together with a compelling, emotional script (in which both parents have very tangible flaws) and a host of strong performances from the main cast. (4.5/5)",
            "review_date": "2020-05-27",
            "source": "rt"
        },
        {
            "content": "A very well acted film. Dustin Hoffman as Ted is very impressive as his life changes and becoming a single parent. The way he has to navigate work life and parent life has its ups and downs. Hoffman is funny at times, very emotional and has the facial expressions and mannerisms to make me care. Ted is angry at his wife for leaving and is angry for anything his son does wrong, he does not know his son and learns to get to know him more. His relationship with Billy played by Justin Henry is very sweet and very real. We see from the initial struggle to make french toast and that their are loads of things he has missed out on as he tried to make more success at work. Its touching as Ted and Billy make french toast again for the last time that they are now are perfect. Justin Henry has the right tone of being emotional but also just being a kid and ultimately feeling somethings wrong. From the many occasions as he looks in his parents bedroom wanting to see both his mum and dad. The court case is what we expect both fighting for custody, both their lawyers unpicking every little thing, as we see both very emotional and very open. Its devastating to look back at every little detail. Meryl Streep as Joanna has no got the biggest role but hers is crucial. The many scenes as she is emotional is very natural, we feel for her even if we were not happy she left like she did. The moment Ted tells Joanna she still looks terrific even with her tears rolling down her cheek shows that there still might be hope for them. She sees the changes in Ted and the changes in her son. Its a touching movie and an intelligent movie. Looking at why the mother will generally get custody. Many things did get me upset, including Billy wanting his mother and Ted throwing the wine glass against the wall.  A powerful script with excellent direction including a deserving best actor Oscar win for Hoffman.",
            "review_date": "2020-05-24",
            "source": "rt"
        },
        {
            "content": "It's a flaw film, that still have unanswered questions, but it's all overcome by the emotion the movie has built. The movie profoundly usage of the word\" terrific\" as not only positive but also as\" horrible\" is so deep in meaning.",
            "review_date": "2020-05-20",
            "source": "rt"
        },
        {
            "content": "\"Kramer vs. Kramer\" blends brilliant character building and incredible acting across the board, including one of the best child performances to date, and builds a strong plot from that basis.",
            "review_date": "2020-05-13",
            "source": "rt"
        },
        {
            "content": "A: 3/5\nE: 4.5/5\nR: 8.5/10",
            "review_date": "2020-03-12",
            "source": "rt"
        },
        {
            "content": "I've never seen a Robert Benton film but now I'm hooked and not often does a film pop and resonate so much that I want to envelop myself in an entire filmography of its creators.\n\nAdditionally, I expected this film (one I have never seen) to be a comedy, the poster and the title made me look forward to a zany, light-hearted, early-80's family picture with some sentiment and darker sprinkles towards the end. Boy was I wrong. Yes, the film develops its sense of humour, beautifully I might add, but it's first and foremost a serious drama about evolving gender roles, mental health, love, jobs and parenthood.\n\nThe Vivaldi music is perfectly placed and utilised, the film encompasses so many little character quirks and small moments without being unfilmic. It manages to have an intimate male/female relationship without it ever looking like it will blossom in to cliche romantic love and there's no question that Streep and Hoffman won't get back together which focus the movie. Despite the film's theatricality and ancientnesss, it's still a relevant film today I feel in many ways. Today it would be made to show a more female POV (and perhaps it should) but at the time I think it very much set out to show other Men that Men could have the same hearts.",
            "review_date": "2020-02-17",
            "source": "rt"
        },
        {
            "content": "I've heard of this movie my whole life but didn't know anything about it, other than it's about a couple going through divorce. My wife and I sat down to watch it this week and both cried. So heartbreaking. Every aspect of the film was well done. It made me thankful for the marriage and children than I have. It made me want to work hard to keep what I have and to press into the Lord's kingdom that I might have his blessings upon our family. May God's love surround those who go through what the Kramers went through.",
            "review_date": "2020-01-28",
            "source": "rt"
        },
        {
            "content": "An affable and sometimes dated art film about divorce starring dustin hoffman and meryl streep. it’s fabulous to see these stars in their young prime. the film takes a unique approach to divorce. this movie came out the year in was born, so i don’t know how cutting edge it was at the time, but imagine it was innovative for its day. even now, movies like marriage story probably gain inspiration from kramer vs kramer. this movie moves at a brisk pace thanks to energetic performances and some snappy editing. hoffman is particularly good as a young dad trying to hold the family together in a flawed way. some of the cultural norms of the 70s shine through regarding gender roles . dustin hoffman plays mr kramer, and meryl is mrs kramer. it’s worth a watch if you’ve never seen it. ",
            "review_date": "2020-01-23",
            "source": "rt"
        },
        {
            "content": "It drags...altought there are great performances there.",
            "review_date": "2020-01-23",
            "source": "rt"
        },
        {
            "content": "Wonderfully honest with exceptional acting by the entire cast.",
            "review_date": "2019-12-27",
            "source": "rt"
        },
        {
            "content": "The boss is unrealistically unsympathetic about Ted's situation — and becomes downright evil later. 52 mins in and still don't understand what he actually does. Not the legal drama I expected. Barely over half-way through and just mentioning anything legal. Loved his job hustle and the simultaneous Christmas party going on. One of the more ridiculous cross-examinations I've seen in film→ no objection for not allowing the witness to finish a single sentence? (Sorry, my lawyer is showing.) After not working for years, she suddenly makes more than he does? Friendship between Ted and Margaret is the best part of movie. That ending? THAT ending? Fuck that ending. This movie sneaks into the recommends because the acting is great.",
            "review_date": "2019-12-26",
            "source": "rt"
        },
        {
            "content": "Unbiased heartfelt story with great, personable acting",
            "review_date": "2019-10-19",
            "source": "rt"
        },
        {
            "content": "Heart-wrenching without the actors ever going over the top.",
            "review_date": "2019-07-07",
            "source": "rt"
        },
        {
            "content": "Top-notch courtroom melodrama, excellently directed and extraordinary performances by both leads leaves a bitter aftertaste concerning its dubious message concerning gender roles.",
            "review_date": "2019-07-05",
            "source": "rt"
        },
        {
            "content": "I watched this movie today in 2019 and I believe it is just amazing. still enjoyable till today.",
            "review_date": "2019-05-28",
            "source": "rt"
        },
        {
            "content": "The reputation that this film has earned in the 40 years since it was released is that is was decent but hardly deserving of the Best Picture award when up against Apocalypse Now (1979) and Breaking Away (1979). I would tend to agree with that assessment because while I was emotionally moved by parts of this film and dazzled by the performances it was not the raw, visceral experience that the film it was competing against was. This is the second Meryl Streep Best Picture winner I've seen and the second Dustin Hoffman, they would both win their first Academy awards for their roles in this film and they were completely deserving. I am glad that this film exists and I wish more films like it were being made today in an age where ï¿ 1/2~prestige' means shoving as many hot topic issues as you can into one film and not properly exploring any of them.\n\nJoanna Kramer, Meryl Streep, makes the decision to leave her advertising executive husband Ted, Dustin Hoffman, and five year old son Billy, Justin Henry, because she needs to \"find herself.\" Ted is left in the lurch as he initially assumes that Joanna will soon return to him and everything will go back to the way it was, when she doesn't he struggles to raise his child as it takes a toll on his work life and sexual relationships. He bonds with Joanna's friend Margaret, Jane Alexander, who is divorced from her husband, and over time he and Billy come to have a healthy, supportive relationship. When Joanna returns nearly a year and a half later, asking for custody of Billy, Ted's life is sent into a tailspin.\n\nThe \"social issue\" that the film deals with isn't as relevant today as it was 40 years ago as in 1979 divorce was still relatively rare and the concept of a mother leaving her family instead of a father was almost unthinkable. The film works as an accurate documentation of how people felt about the issue during this time period as we hear \"Women's lib\" get referenced and understand that the cultural shift from women acting like the housewives of the 1950s to being working mothers was difficult. The understanding that it was the man's job to be a breadwinner and the woman's job to cook, clean and raise children was becoming less popular and Joanna's fear of not knowing who she is outside of her relationships with men still relates to women today. The assumption that the mother is better suited to being a single parent is also challenged but it never feels as though the film is blaming Joanna for trying to find herself as we know that their relationship wasn't perfect, this was a surprisingly progressive touch that allowed me to appreciate the film.\n\nThe scenes of bonding between the two single parents, Ted and Margaret, also have a naturalism and a sweetness to them that resonates today. We see Margaret initially as the divorced woman who pushed Joanna to leave Ted and who doesn't believe he is a fit father or husband. They begin to talk however as they watch over their children and come to understand that they face many of the same issues and questions. This is why it's so heartbreaking to see her forced to admit that she did support Joanna in leaving Ted during the court case surrounding their custody battle. Watching an adult male and female have a mature, caring relationship with no romantic implications is difficult to find in films, see Friends with Kids (2011), but this film and the dream acting team of Alexander and Hoffman manage to do the impossible.\n\nThe natural brilliance of Streep is on full display in this movie as she shows the abilities that would allow her to become one of the great actresses of the 20th  century. She makes Joanna a sympathetic character even as she makes questionable decisions and her obvious pain during the court case scenes made me tear up just a little. She is matched by Hoffman who gives a fabulous performance as a man who comes to put his child above his job and understand why his relationship with his wife needed to change. Their incredible performances lift the film above being your average social issues drama and they were deserving of the praise they earned for their work.\n\nIt's quite obvious that Apocalypse Now is better and more influential than this film and director Robert Benton's win for Best Director is laughable but this is still a better film than most Best Picture winners. This is a nuanced, fascinating look at divorce in the late 1970s and it's genuinely emotionally moving towards the end.",
            "review_date": "2019-05-20",
            "source": "rt"
        },
        {
            "content": "it was heartwarming, breathtaking and beautiful... qualities i try to avoid in movies!",
            "review_date": "2019-03-28",
            "source": "rt"
        },
        {
            "content": "Its impact might be blunted by the countless other films dealing with marital discord which have been made since, but Kramer vs. Kramer is still rife with fraught emotion and sensitive storytelling. Dustin Hoffman goes full method but not full crazy, depicting a man whose rage is just below the surface, and you can always see it in his eyes, especially when he tries to keep his cool for his son's sake. The kid in the movie starts off pretty annoying, being spoiled, loud and completely uncooperative. What bother me so much is that large stretches of time pass by unannounced, and the child talks as if he doesn't know any more about the situation. It would have been more effective if we could see his father telling him at least some of what was going on, instead he never seems to know anything, and acts like a whiney brat the whole time as a result. But later on, he does become more likeable. Meryl Streep, who was apparently winning Oscars for best supporting performances despite barely any screen time before it was cool, spends almost all of her time crying, so its easy to see why she won the award. Her performance is painfully raw, and while she doesn't get a lot of time on screen, she nevertheless makes the most of it, pushing back against Hoffman and amping up both performers intensity. Given the tone and subject matter, its not a film you could watch several times, but for a single watch, it's as challenging as it is rewarding.",
            "review_date": "2019-02-27",
            "source": "rt"
        },
        {
            "content": "Joanna Kramer (Meryl Streep) walks out on her advertising-art-director husband Michael (Dustin Hoffman). Though he is obviously insensitive to everyone's feelings but his own, Michael has not lost his wife because of this; she simply wants to go out and \"find herself\". Also left behind is the Kramers' 6-year-old son Billy (Justin Henry), whom Michael barely knows. At first, both father and son resent each other's company, but before long they have formed a strong bond of love and mutual respect. So devoted a father does Michael become that he begins neglecting his work and loses his job. Suddenly, Joanna reenters his life, announcing that she now has a well-paying job herself, and wants full custody of Billy. \n\nThe divorce subject isn't as shocking, but the film is still a thoughtful, well-acted drama that resists the urge to take sides or give easy answers. \n\n An incredible moneymaker, Kramer vs. Kramer also did well for itself at Oscar time, winning awards for Best Picture, Best Actor (Hoffman), Best Supporting Actress (Streep), Best Screenplay and Best Director. \n\nKramer vs. Kramer is greatly enriched by its exceptional cast. Great film.",
            "review_date": "2019-02-15",
            "source": "rt"
        },
        {
            "content": "The best, GREATEST courtroom movie ever made!",
            "review_date": "2019-02-01",
            "source": "rt"
        },
        {
            "content": "I think both of the portrayed parents of the film were very selfish in regards to the needs of their son at different points in his life; the father during his early years, and the mother when she left. There is a glaring lack of communication between the two characters, and instead of trying to work things out, they both contributed to and were okay with stamping an approval of failure on their relationship. People are not perfect and they don't always look out for the needs of others above their own, and married couples are no different in regards to each other, but it is important for them to make changes to become more selfless over time. If there is no spousal abuse, infidelity, or neglect, then there really is never a grounds for divorce other than pettiness. I liked the part of this film where the father questions the mother's right laws that are unjust in our court systems, because this issue is still relevant 40 years later. I didn't see why Streep earned an Oscar for her performance, as she was barely in the film, and I'm not sure how Hoffman's compared to others in the year, but overall it was an interesting and thought-provoking movie.",
            "review_date": "2019-01-21",
            "source": "rt"
        },
        {
            "content": "A very big, late 70's film and one of the biggest Oscar winners ever, I guess.\nTed's wife is leaving him. Now, all he got is his very stressful job - and his kid, Billy. He loves his kid and does everything for him. They are quite a team and it's hard not to get impressed by they're relationship. Ted loses his job since he is standing too much up for his kid, but he get's back up on the horse, since he is caring so much for his kid.\n\nI gotta say that there are some amazing performances here. Justin Henry as \"Billy\" is the youngest Oscar winner ever, and both Streep and Hoffman won a statue each. It may not be the best film that year, but it sure is a very good divorce movie - Woody Allan should be impressed.\n\nThe story is OK, the presentation is good, but the pace and development us amazing togheter with the actors. It's also very warm and touching. It may be typical, but it works like a charm. I recently saw Dustin Hoffman in \"Straight Time\", a much more overseen film than this one. He is truly one amazing actor you can count on.\n\n8 out of 10 French toasts.",
            "review_date": "2018-12-29",
            "source": "rt"
        },
        {
            "content": "I can't believe how many times I snapped my opinion! That's for the most part because the movie refused to take sides, but in a very remarkable way. Simply, the movie seems as if it had shied away from interfering with the Kramers' divorce subject, and therefore let its characters to compete with each other on making viewer biased towards him/her. And that's exactly what made the main characters flesh out, of course besides the fact that they are played by Dustin Hoffman and Meryl Streep.\n\nBoth Dustin Hoffman (one of my favorite actors of all-time), and Meryl Streep (one of, if not the best actress of all-time) gave unbelievably authentic performances that could be the best performances of their respected careers. They definitely deserved their Oscars!\n\nThe only issue I have with Robert Benton's masterpiece that I could have easily ignored is that I found the interrogation part of the courtroom scene was a bit tad monotonous only because I became totally torn between both Ted and Joanna because the baffling honesty of their justifications. I know that sounds more like a good thing, but I got tired at the end of the sequence of the constant rejections of the defense lawyers. So maybe the sequence could have been a bit shorter as we became aware how it would end.\n\nKramer vs. Kramer is easily the most sensitive, absorbing, and heartbreaking movie I've seen of its kind. In part because the exceptional cast, but largely because Robert Benton's significant adapted screenplay that is as simple as it's profound, and indisputably because of his tangible and nuanced direction.\n\n(9.5/10)",
            "review_date": "2018-11-16",
            "source": "rt"
        },
        {
            "content": "I thought this was all a bit predictable and on the nose. Man loses wife and forgets how to get egg on toast. A couple of nice moments though.",
            "review_date": "2018-11-06",
            "source": "rt"
        },
        {
            "content": "one of the movies that won an oscar gold for best picture that features the simple context of a broken marriage.  the crown, in my opinion, may have been given to coppola's apocalypse now, but this sure is a great flick.",
            "review_date": "2018-03-13",
            "source": "rt"
        },
        {
            "content": "Fantastic movie! Great movie about parenthood dynamics. Great acting all around! Kept my attention the whole way through! ",
            "review_date": "2018-01-22",
            "source": "rt"
        },
        {
            "content": "see you in the morning light..\n\nKramer VS. Kramer\n\nHow often do you watch a movie and fall into its world from the first frame till the end credits? Kramer VS. Kramer is one of those rare masterpiece that is innocent even though it raises some delicate questions about society. Dustin Hofmann holds our little finger and walks us through the movie all on his own to the other side of the road where Meryl Streep is waiting for us to mesmerize us. Kramer VS. Kramer is a fine example of the art that cinema is with its unpredictable and surprisingly beautiful script.",
            "review_date": "2018-01-13",
            "source": "rt"
        },
        {
            "content": "Great fantastic movie starring Dustin Hoffman and a very young Meryl Streep. I think that Meryl Streep gave her best performance of a lifetime and Dustin Hoffman is exceptional in this film and I forgot to mention, the kid, he was great also.",
            "review_date": "2017-12-29",
            "source": "rt"
        },
        {
            "content": "Puntaje original: 7.5\n\nUn clásico cargado de emociones y profundas reflexiones socio-familiares, acompañada de unas majestuosas actuaciones de Dustin Hoffman y Meryl Streep. Una película que vale la pena ver en familia en cualquier época del año.",
            "review_date": "2017-12-19",
            "source": "rt"
        },
        {
            "content": "With spectacular performances by Meryl Streep and Dustin Hoffman, Kramer vs Kramer depicts the theme of divorce, parenthood and motherhood with simplicity and passion whilst remaining unbiased towards the characters  providing a thoughtful experience.",
            "review_date": "2017-10-19",
            "source": "rt"
        },
        {
            "content": "This groundbreaking family based divorce & eventual courtroom drama works because of it's how realistic it feels. Dustin Hoffman, Justin Henry, and of course Meryl Streep are just outstanding in every scene they are in, and they bring even more depth to their characters, Get the tissues, there's about 3-4 scenes that are very poignant & lovely.",
            "review_date": "2017-10-04",
            "source": "rt"
        },
        {
            "content": "What a great movie with fantastic acting from everyone even from the child actor. Definitely a relatable movie to me and I think most people. \n\nI was worried about how the movie was going to end, but it didn't disappoint at all. This is how you end a movie. You think it's all done and happy ending but the outcome of the story is still left to the imagination, it can still change.\n\nOverall, wonderful movie!",
            "review_date": "2017-09-22",
            "source": "rt"
        },
        {
            "content": "Director Robert Benton took a very ordinary storyline and turned it into an extraordinary film. There were several transitional shots that really grabbed my attention, such as the reaction on Margaret's face when Ted asks her how much courage it takes for a mother to \"walk out on her child,\" Joanna watching Ted from inside the coffee shop, and Margaret weeping outside Ted's apartment when she finds out that he lost the custody battle. I was also drawn into the two courtroom scenes; the cross-examinations of Ted, Joanna, and Margaret were intense! Dustin Hoffman, Meryl Streep, and Jane Alexander all had strong performances. This was certainly deserving of its Best Picture win.",
            "review_date": "2017-08-25",
            "source": "rt"
        },
        {
            "content": "Kramer vs. Kramer is a fantastic family drama. Dustin Hoffman steals the show in my opinion. Meryl Streep and Justin Henry are great as well. This film has so much too offer. It is extremely entertaining with a great court room drama. This is a movie the whole family will enjoy.",
            "review_date": "2017-08-01",
            "source": "rt"
        },
        {
            "content": "great movie with great performances from all three lead actors with one of the best child performances ever on film and a great story which everyone should at least watch once in their life but one really small negative thing about this movie is that it might fee; be a bit dated with certain things for some people but i think that the rest is so good that you won't even mind it watching this movie",
            "review_date": "2017-06-17",
            "source": "rt"
        },
        {
            "content": "A Best Picture Academy Award winner after its 1979 release this film depicts the tense emitions of marriage seperation an ensuing custody battle in the courts for the young son.\nA workaholic Ted Kramer (Dustin Hoffman) alienates himself from his wife of eight years Joanna Kramer (Meryl Streep).\nJoanna eventually snaps and leaves the unhappy marriage and home leaving Ted to look after young son Billy.\nLooking after Billy as a single parent puts pressure on Ted's work life and he is eventually dismissed from his job as an advertising agency executive.\nTed develops an ever closer bond with Billy as he develops his parenting skills.\nThe second half of the film sees the return of Joanna who demands custody and goes to court to win it.\nThe courtroom scenes are electifying and throughout Hoffman and Streep give good performances.\nThe locations are grimy 1970s New York that evidently ages the film markedly.\nPrior to the courtroom battle Ted's lawyer devises a pros and cons list that can be useful in the ensuing battle.\nIt made me think about the pros and cons of this film.\nThe pros:\n1) Excellent performances by the lead actors and Justin Henry as the child Billy.\n2) Tense courtroom scenes.\nThe cons:\n1) The film seems to have overly aged beyond its near 40 years! Perhaps the fashions and the bleak cinematography of New York don't help in that respect.\n2) Divorce, seperation and custody battles are perhaps unfortunately more prevalent nowadays so the story has lost some of its 'shock value'.\n\nThe film isn't overly long at just over 100 minutes.",
            "review_date": "2017-05-22",
            "source": "rt"
        },
        {
            "content": "By no means is this the first or only film to talk about divorce and the effect it has on a family and children outside of just the adult's relationships. However, this one feels much more grounded than most others. Most make the actual divorce a huge deal with a specific event or sudden plot point, but this movie shows a sobering fact about most of these type of situations, sometimes relationships just end. They fall apart for the most mundane reasons and we as humans must go on living afterwards.",
            "review_date": "2017-04-16",
            "source": "rt"
        },
        {
            "content": "Amazing performances by Hoffman and Streep in this award-winning film",
            "review_date": "2017-03-23",
            "source": "rt"
        },
        {
            "content": "Such a beautiful movie where it's literally love vs. love. The Father is really admirable and I could learn so much from him on how he handles himself in desperate times.",
            "review_date": "2016-11-16",
            "source": "rt"
        },
        {
            "content": "Normally I can defend best picture winners, but honestly... I can't defend this from All That Jazz or Apocalypse Now. While it's no Out of Africa or The Greatest Show on Earth, the visuals are nothing compared to the latter two. The acting and story is good but nothing unique, how the father lost makes no sense, there were no memorable moments or lines and the ending of the mother giving the son back was too obvious. \n\nThis is a movie I'm gonna have to side with haters and not the academy on.",
            "review_date": "2016-10-15",
            "source": "rt"
        },
        {
            "content": "Good Movie for its time. A movie about custody of a child. Which many people can relate too. Either threw the child's eyes or the parents. Acting was spot-on. Very Believable.",
            "review_date": "2016-09-12",
            "source": "rt"
        },
        {
            "content": "I find it amusing that ALL of the negative reviews by critics were by men. Most of whom claim this movie is misogynistic. It is amazing to me that these snobs will understand the meaning of so many films, yet be clueless about this one.\n\nIf you watch the making of featurette, the director explains the reason for Meryl Streep's character leaving. She had to leave because she felt mentally unstable due to how Hoffman's character had treated her. In leaving, she showed the ultimate love toward her son. Which is worse:  An unstable mother staying around, or leaving and getting her life together? If you look at a case such as Andrea Yates, the answer is clear.",
            "review_date": "2016-09-06",
            "source": "rt"
        },
        {
            "content": "As painful and sad the movie is, Kramer vs Kramer has well-made performances and story telling so incredible it lightens my heart",
            "review_date": "2016-08-31",
            "source": "rt"
        },
        {
            "content": "Incredibly touching movie. The plot is very dense, the development of the story makes is more interesting and the actos are superb. It´s a kind of alert to nowadays couples that think marriage is something to play with and forget the children´s interests and feelings. I strongly recommend.",
            "review_date": "2016-07-30",
            "source": "rt"
        },
        {
            "content": "One of the few movies that makes me so incredibly angry I can't sleep lol. Excellent film.",
            "review_date": "2016-07-07",
            "source": "rt"
        },
        {
            "content": "This movie of course continues the fallacious assumption that a seven year old is too young to be in on their own custody arrangements let alone be the ultimate arbitruer thereof.",
            "review_date": "2016-07-07",
            "source": "rt"
        },
        {
            "content": "Quando vi este filme há uns 15 anos ele logicamente não comunicou comigo como o faz hoje. Achava absurdo que tivesse levado o Oscar sobre Apocalypse Now. Agora, acredito que foi merecido, é um filme mais importante e mais sensível. Somente a direção poderia ter ido para Coppola, Benton é muito melhor roteirista que diretor. Hoffman mostra por que é meu ator favorito e Streep mostra por que é esta lenda. Kramer vs. Kramer décadas depois segue atual e relevante.",
            "review_date": "2016-06-27",
            "source": "rt"
        },
        {
            "content": "7.8/10\n\n~April 2, 2016~",
            "review_date": "2016-04-02",
            "source": "rt"
        },
        {
            "content": "Kramer vs. Kramer is a decent film. It is about Joanna Kramer walks out on her advertising-art-director husband Michael. Meryl Streep and Dustin Hoffman give good performances. The screenplay is a little slow in places. Robert Benton did an alright job directing this movie. I liked this motion picture because of the drama.",
            "review_date": "2016-03-16",
            "source": "rt"
        },
        {
            "content": "A typical divorce story, maybe even more civil than some.",
            "review_date": "2016-03-03",
            "source": "rt"
        },
        {
            "content": "85%\nSaw this on 23/2/16\nDustin Hoffman gives his career best performance and although in a small role, Meryl Streep also manages to make her mark, not to mention the performance of child actor Justin Henry. It doesn't take sides and its effective as a father-son relationship drama which also doesn't use melodrama to establish its themes. However, in the end, the film just doesn't seem to be that satisfying, with a predictable ending, mostly because no ending can properly justify the premise.",
            "review_date": "2016-02-23",
            "source": "rt"
        },
        {
            "content": "It was a great movie for the late 70s.",
            "review_date": "2016-02-14",
            "source": "rt"
        },
        {
            "content": "A hard drama that poses a valid question, specilay for divorced couples, whta does it mean to be a good parent?",
            "review_date": "2015-12-23",
            "source": "rt"
        },
        {
            "content": "A profoundly affecting family drama in which everything conspires for something so perfect that you must be dead if you are not moved, and it relies on a beautiful script that refuses to take sides and on exceptional performances by Dustin Hoffman, Meryl Streep and Justin Henry.",
            "review_date": "2015-12-19",
            "source": "rt"
        },
        {
            "content": "Two different heartbeats on the same heartbreak. A human take on a sudden divorce. Hoffman's acting is great.",
            "review_date": "2015-11-02",
            "source": "rt"
        },
        {
            "content": "A story acted out brilliantly by two amazing actors, shedding light about one of the modern, first-world struggles.",
            "review_date": "2015-10-19",
            "source": "rt"
        },
        {
            "content": "A range-of-all-emotion masterpiece.",
            "review_date": "2015-10-16",
            "source": "rt"
        },
        {
            "content": "I was a bit surprised by Kramer vs. Kramer, because the setup at the beginning seemed be implying that Dustin Hoffman was going to be the slacker Dad and we would be sympathizing with Meryl Streep throughout. Instead it was basically a love story between a father and his son. I loved the emotional connection they show between them and how it slowly develops over the length of the film. The characters and the situation feels very real, so I can't complain at all about the performance of the actors or the construction of the script. However, I found little enjoyment out of the story. It's a depressing look at how our court systems can be flawed, and how broken marriages can become loaded with animosity. It's one of those strange films that I can see as well-made, but simultaneously find utterly unwatchable. It is very slow-moving, and I get no pleasure from the subject matter. I never want to see Kramer vs. Kramer again, but I would say that people who like dramas might enjoy it, and parents will probably get more from it than childless people like me.",
            "review_date": "2015-09-18",
            "source": "rt"
        },
        {
            "content": "Kramer vs. Kramer is a beautiful father & son bonding film rather than a courtroom drama with jaw dropping work from Dustin Hoffman and Justin Henry who bring tears to the eye as their characters struggle to grow.",
            "review_date": "2015-09-16",
            "source": "rt"
        },
        {
            "content": "\"Mommy stayed here longer than she wanted because she loves you so much. And the reason why Mommy couldn't stay anymore... was because she couldn't stand me. She didn't leave because of you. She left because of me.\"\n\nRobert Benton's third feature film, Kramer vs. Kramer, still stands out as his best. This 1979 family drama which explores interpersonal relationships and the effect divorce has on the family, remains very relevant in today's society. It is one of those rare classics that has managed to age very well due to its universal theme. In order for an authentic drama like this to work you need a strong script and believable actors. Kramer vs. Kramer has both, Robert Benson did an amazing job with the screenplay adaptation of Avery Corman's novel and the dialogue in the film feels authentic while avoiding any false notes. And of course you couldn't have had anyone better than Dustin Hoffman and Meryl Streep to play the divorced couple. Hoffman was already at the height of his career, while Streep was just getting started proving she's always been an out of this world actress. Both actors won their first Academy Awards for this film, and it wouldn't be their last. But in a film like this no matter how good the adult characters are, you need to have a child who can win over the sympathy of the audience and engage them emotionally. Benton made a huge gamble when he hired inexperienced Justin Henry for the role, but it payed off marvelously. At only 8 years old Henry was nominated for his supporting role. The scenes he shares with Hoffman are endearing and the relationship between the two is the center of the film. It was the subtle moments that the two shared together that stuck with me the most, like the scene where the kid challenges his father's authority by eating the ice cream. These were improvised scenes, but they added to the authenticity of the film. That relationship between both of them is key, as we witness the transition and evolution of Hoffman's character.\n\nThe film opens with a shot of Joanna Kramer (Meryl Streep) packing her clothes in a suitcase while she waits for her husband, Ted (Dustin Hoffman) to return home from work so that she can break the news to him that she is leaving him. Apparently she has been unhappy for quite some time now and she wants to discover who she is. Despite being heartbroken about having to abandon her young son, Billy (Justin Henry), she is convinced she has to go. Ted, who hasn't the slightest clue about housekeeping, must now learn to manage his work while taking care of his son. During the early scenes we see what an inexperienced father he is, he can't prepare breakfast for Billy without burning everything. But as the movie progresses we begin to see the transformation that Ted goes through and what a caring father he becomes. His career does begin to suffer and he begins struggling to keep his job, but he has learned to put his son's life before his own. With the help of his friendly neighbor, Margaret (Jane Alexander), he becomes an expert at parenting, but that is around the time that Joanna returns back to the city and tells Ted she wants to take her son with him. A court battle for their son's custody ensues as neither parent refuses to live without their son. \n\nThe film builds a great father and son dynamic during most of its runtime and that is what makes the courtroom drama so compelling near the end because the stakes have been settled. I don't think this film would've won the Oscar for Best Picture if it weren't for those intense scenes during the trial. The testimony each parent gives is compelling and the performances in those scenes were superb, but I actually enjoyed the quieter and more subtle moments in this film. The scenes were Hoffman is sharing some time at the park with his son or simply reading a story to him. Those were the moments that made this film ring true and authentic. I think that the film could've ended on a stronger note if it decided to have ended some five minutes before it actually did because it ties things up too neatly at the end. The final kitchen scene would've been the perfect moment to end it, but I won't complain too much because the film is compelling and the performances had me engaged from the very opening scene. Kramer vs. Kramer still resonates with audiences today and it is a great example of how to make a compelling family drama about the effect that divorce has on the family. I enjoyed every minute of it. \n \nhttp://estebueno10.blogspot.com/",
            "review_date": "2015-09-04",
            "source": "rt"
        },
        {
            "content": "Being a kid of divorce, I cannot explain how hard his hits. What a beautiful performance from Dustin Hoffman. He gave this performance his everything and it was such an amazing experience to watch him. The film was flawlessly composed and I loved every second",
            "review_date": "2015-08-22",
            "source": "rt"
        },
        {
            "content": "Touching drama of a broken family.Absorbing young Hoffman as a workaholic who has to take on double role of father/mother.Shall to see before you die",
            "review_date": "2015-08-21",
            "source": "rt"
        },
        {
            "content": "A complex exploration of divorce. Hoffman opposite Streep is a powerful duo.",
            "review_date": "2015-07-21",
            "source": "rt"
        },
        {
            "content": "Puntaje original: 7.5\n\nUn clásico cargado de emociones y profundas reflexiones socio-familiares, acompañada de unas majestuosas actuaciones de Dustin Hoffman y Meryl Streep. Una película que vale la pena ver en familia en cualquier época del año.",
            "review_date": "2015-06-22",
            "source": "rt"
        },
        {
            "content": "\"Kramer vs. Kramer\" was audacious for its time, but better films about divorce have since come along.",
            "review_date": "2015-05-15",
            "source": "rt"
        },
        {
            "content": "83% on my Tomatometer.",
            "review_date": "2015-05-13",
            "source": "rt"
        },
        {
            "content": "A young son is caught in the middle when his mother leaves, and his parents get divorced. Heartbreaking and real, this film is note on perfect in capturing the raw emotion an cost involved when families break apart due to  divorce. A Classic with outstanding writing, direction, and performances all around.",
            "review_date": "2015-04-17",
            "source": "rt"
        },
        {
            "content": "Despite its subject losing its sting over the years, Kramer vs. Kramer is still a realistic depiction of family, greatly performed, and smartly written.",
            "review_date": "2015-04-14",
            "source": "rt"
        },
        {
            "content": "For a film that managed to win Best Picture over 'Apocalypse Now', it's great to see how excellent this film truly is, and I'm pretty sure Hoffman's outstanding speech will quell any anger by a choice The Academy makes. 'Kramer vs. Kramer' is an excellently crafted drama with excellent performances across the board. I love how this film was made, it screams classic filmmaking, we know the entire setup for the plot in the first five minutes and it already has us hooked. Dustin Hoffman steals the show as the struggling father just trying to make everything work and I'm glad we see how he deals with everything, as this film tackles themes and stereotypes that still haven't been broken, even till this day. His look reminds me of Al Pacino from 'Dog Day Afternoon' here and it makes sense because they were both considered for that role because of how much they looked alike and looked like the real person. Meryl Streep was odd, it makes sense now why she won 'Supporting Actress', even though I just expected her to be in it more given the title and she does a reliably good job as well. I did find it a bit odd to just see her staring out the window from the café, though, and honestly, while it brings up stereotypes with her as well, namely, just because she's a female doesn't mean she's a better parent, I really didn't like her character nearly as much as Dustin Hoffman's. I don't doubt that it happens because this world is huge, but no parent that I have ever met, that actually loves their child, would ever just leave their child for their own sake. Sure, she had to get out of a situation that made her unhappy, I get that, but she wrote to her son that, 'she's still a mommy but has other things to do?' Who writes that? Especially to their own child? You can still leave a bad situation and still attempt to see your own child, it's ridiculous. Justin Henry was great, it made me laugh that his name was Billy but seeing the effects that the split has on him is hard to watch and I'm also surprised he didn't wake up when the parents were arguing at the start. His relationship with his dad felt real, I was surprised when he said 'crap' but considering what his dad says later, it makes sense. All the other actors, especially the lawyers, no matter how big or small of a role, were excellent. \n\nThe film is brought to life by an outstanding screenplay; I loved it so much, it was so real and filled with excellent dialogue that had your undivided attention. The way one of the early scenes end with the line, 'How much courage does it take to walk out on your kid?' just had me in awe of how powerful that line was, coupled with the excellent editing this film has as well. The film also had a pretty lively soundtrack that reminded me of a Wes Anderson film at points. It made me laugh that Hoffman's character talked about when someone says sorry, you should accept their apology because earlier on in the film there was a scene where the son kept saying sorry and he was still annoyed, but it made sense. There's also quite a lot of humour in this film as well, some of it was strange, when he is at an interview and he opens to door to a party on the other side, that just seemed crazy; and he should have said he wanted the job because he still wanted to work in that field! But there was a story being told at the start of the film that I still want to know how it ended! The build up to the eventual court case is brilliant, we see father and son finally making French Toast successfully and it made me smile. The scene where they all meet again in the park was nice for the son, I thought it'd have that moment where Hoffman would say, 'hey Billy look who it is', but that wouldn't really have fit and it was handled great. The court case showcases another example of fantastic dialogue and it's great to watch, even though it still bugs me that people blame, usually fathers, in films for being away all the time because they're working, it's not like he was being a deadbeat and he should have said he was let go from his job because of his son. It's really unfair how all that plays out, but then it leads up to a very smart and different ending. We can all relate to this film in some way as it hits home for pretty much every one of us, it's hard to watch at some points just because of how much Ted is struggling but still prioritises being a good father, and one scene where he has to run to the hospital was outstanding. While Coppola's work for 'Apocalypse Now' is some of the greatest filmmaking of all time, I guess they decided that a film about a family is more relatable as well as the fact that 'The Deer Hunter' did in fact win the year before, even though I don't agree with how The Academy chooses how what film wins. And regardless of all that, it is an overall excellently made film.",
            "review_date": "2015-04-12",
            "source": "rt"
        },
        {
            "content": "Amazing movie with an outstanding cast lead by Dustin Hoffman and the Legend that is Meryl Streep.",
            "review_date": "2015-04-03",
            "source": "rt"
        },
        {
            "content": "Though the plot just goes through the motions, Kramer vs. Kramer rises on the strength of its talented cast and Benton's sympathetic sense of direction.",
            "review_date": "2015-03-09",
            "source": "rt"
        },
        {
            "content": "Though the plot just goes through the motions, Kramer vs. Kramer rises on the strengths of its talented cast and sympathetic sense of direction.",
            "review_date": "2015-03-09",
            "source": "rt"
        },
        {
            "content": "A Touching And Emotionally Deft Family Drama!",
            "review_date": "2015-03-03",
            "source": "rt"
        },
        {
            "content": "Well acted, but on recent viewing, it's obvious to be way overrated. The story and drama isn't really shocking anymore, but what's worse is that the film plays out like misogynistic melodrama.",
            "review_date": "2015-02-26",
            "source": "rt"
        },
        {
            "content": "Acting is amazing...",
            "review_date": "2015-02-16",
            "source": "rt"
        },
        {
            "content": "The subject isn't as taboo nowadays, but you get some great, powerful performances from Hoffman and Streep.",
            "review_date": "2015-02-10",
            "source": "rt"
        },
        {
            "content": "One of the great classics of the 1970s.",
            "review_date": "2015-01-22",
            "source": "rt"
        },
        {
            "content": "A nice and well-made film about family problems but I will never forgive that the Academy prefered this over Apocalypse Now.",
            "review_date": "2015-01-17",
            "source": "rt"
        },
        {
            "content": "\"Who's gonna read me my bedtime stories?\"\n\nThe 1970's has always been a decade of film that I've never withheld my appreciation for. I'd go as far to say that's it's been the best in terms of American cinema. It was the decade where we were introduced to some of the finest screen actors in DeNiro, Nicholson & Pacino. We had films of such high calibre as The Godfather's, One Flew Over The Cuckoo's Nest, Taxi Driver, Mean Streets, The Deer Hunter, Dog Day Afternoon. I could go on and on here but I mention this because Dustin Hoffman and Meryl Streep where another two of these marvellous performers and Kramer vs Kramer one of the films that's so often forgotten about.\n\nCareer man Ted Kramer (Dustin Hoffman) is so caught up with work that his wife Joanna (Meryl Streep) feels exhausted and unappreciated. She makes the decision to leave him but also decided to leave him with their six-year old son Billy (Justin Henry). Ted has to learn quickly how to be a hands-on father and by the time he gets used to it Joanna reappears claiming custody of Billy.\n\nAs well as the 70's being a strong decade, much admiration has also went to films in terms of Oscar sweeps. Only three films in the history of the Academy Awards have won all top five awards (Best Picture, Director, Actor, Actress & Screenplay). If you consider Kramer Vs Kramer for a moment, most wouldn't normally think that this film came close to that achievement. But it did. The only award that it didn't win was Best Actress but had Meryl Streep been considered in the  leading actress category it might well have done. She won Best Supporting Actress instead which makes this film very close to achieving the full sweep. \n\nResisting the temptation to be melodramatic, it's a fairly straightforward family drama. Films of these types tend to fall into courtroom drama's (of which this touches upon) but never falls prey to that sub-genre. The beauty in Kramer vs Kramer is not to rely on high tension or confrontation but on the human aspect of relationships and family life. It emotionally resonates by showing us the everyday; heated discussions, playtimes, bedtime stories and frustrating meal times. It might not sound like much but there's a real heartfelt authenticity in capturing these moments. Director Robert Benton, wisely, knows when to focus on his actors and has a marvellous ability to capture realism. As a result, he's aided with some stunningly delivered performances; both Hoffman and Streep are at the very top of their game and young Justin Henry is no less their equal as their young afflicted son caught in the middle.\n\nA beautifully realised dramatic piece that benefits from the whole cast and crew delivering honest work. It fully manages to capture and depict both the beauty and the difficulty of parenting and with a thoughtful intelligence, portrays the motivations and decisions from it's characters without ever passing judgment. Another one of the decade's true highlights.\n\nMark Walker",
            "review_date": "2015-01-16",
            "source": "rt"
        },
        {
            "content": "Very powerful and convincing performance from Dustin Hoffman.",
            "review_date": "2015-01-05",
            "source": "rt"
        },
        {
            "content": "Kramer vs. Kramer is a very realistic portrayal of divorce and child custody. My parents are going through full child custody, so seeing this movie really felt uncanny to me which can be hard to sit through at times, which is a good thing because that's how realistic it is. Dustin Hoffman and Meryl Streep are fantastic and they act like real-life parents. The characters are interesting enough for me to either care or hate about them in a good way. Justin Henry is actually really great, it's very interesting to see where it's going, and it's unpredictable. The movie is well-directed, well-written, and it's one of those movies that I can relate to because of what my sister and I are going through. It can be funny and cute at times, but when it goes to the drama, it's really effective.",
            "review_date": "2014-12-25",
            "source": "rt"
        },
        {
            "content": "Historically turns divorce settlements on their heads. It's a really good movie. Even given the subject matter, It walks a fine line between genres and never really reaches it's potential of becoming a patronizing tear-jerker, which is a GREAT thing. Hoffman and Streep are at their best here. I really liked the father and son scenes. It goes a little downhill once we get into the courtroom scenes... they are a little predictable.",
            "review_date": "2014-12-22",
            "source": "rt"
        },
        {
            "content": "Honest and uniquely satisfying.",
            "review_date": "2014-12-07",
            "source": "rt"
        },
        {
            "content": "What a great movie all around... It made me cry many times.",
            "review_date": "2014-11-23",
            "source": "rt"
        },
        {
            "content": "Touching and sad movie. Not quite as relevant today as it was at the time. As far as women expected to stay at home (nowadays both parents have to work usually to afford the bills). Also, I would think nowadays you would just go through mediation vs. court most of the time and split custody 50/50. However, I know it's not always that simple and that's what this movie shows. Loved watching the relationship blossom btw the father and son. It's unfortunate that it only did after what happened though. Personally, I feel like the mom went about the divorce all wrong but she did the best she could at the time with what she knew (that she needed to leave to find herself). Acting was stellar esp that lil kid and I found the plot mostly believable. I didn't find this movie to be the best courthouse drama even though others suggest it is. The court drama actually didn't take up much of the screen time unlike The Accused or The Verdict, but film was still good for other reasons.",
            "review_date": "2014-11-20",
            "source": "rt"
        },
        {
            "content": "***Due to the recent RT changes that have basically ruined my past reviews, I am mostly only giving a rating rather than a full review.***",
            "review_date": "2014-11-14",
            "source": "rt"
        },
        {
            "content": "Every scene made brilliant by perfect writing, moving performances, and fantastically subtle direction, Kramer vs. Kramer is one of the best family dramas I've ever seen.",
            "review_date": "2014-11-12",
            "source": "rt"
        },
        {
            "content": "I'll attribute the vast amounts of over-praise Kramer vs Kramer has received in the past to the wonderful interactions between its two leads, Dustin Hoffman and Justin Henry. But for a movie covering such ugly, divisive, and brutal subject matter as divorce, this film contains absolutely no shock value, no truly haunting family drama, and not much worth remarking once the credits have rolled. It's all too pleasant and instantly forgettable.",
            "review_date": "2014-11-09",
            "source": "rt"
        },
        {
            "content": "Kramer vs. Kramer endures because the characters and their relationships are so well explored and its secondary themes of family pliability and work-life balance overshadow its out-of-date central idea.",
            "review_date": "2014-11-05",
            "source": "rt"
        },
        {
            "content": "Kramer vs. Kramer Is A Excellent Movie.This Is Dustin Hoffman's Best.The Movie Was Funny And Touching.But I Expected More From Meryl Streep.Kramer vs. Kramer Is A Groundbreaking Classic.A",
            "review_date": "2014-11-02",
            "source": "rt"
        },
        {
            "content": "87% Deserved Best Picture",
            "review_date": "2014-10-12",
            "source": "rt"
        },
        {
            "content": "Packed with powerful performances, Kramer vs Kramer is an emotional story that touches your heart and brings tears in your eyes.",
            "review_date": "2014-10-10",
            "source": "rt"
        },
        {
            "content": "Hadn't watched this in a while, seeing ti again, it really feels dated.  The work by Hoffman and Streep is compelling and makes it worthwhile though.  I do find it very tough to accept that it won Oscars for Best Picture over \"Apocalypse Now\" and Coppola as director.  Give it a watch.",
            "review_date": "2014-09-27",
            "source": "rt"
        },
        {
            "content": "You best believe that this is a case of Kramer vs. Kramer, because I kind of blame Michael Richards for that \"totally racially fair\" situation in which he faced the destruction of his career for being a white man who said a slur in a joke, as he had to have known that he was already on the blacks' bad side for being involved in a show whose theme riff featured slap bass produced on a keyboard. Speaking of awkward jokes, you better believe that this film isn't about that Kramer, because this film predates, not simply that incident, but \"Seinfeld\" itself, by almost ten years, if you can believe it. That was the long way to tell you that this film is a little old, when really, all I had to do was say that this film stars Dustin Hoffman, because if you had a drama in the '70s, then Hoffman had to be somewhere in there, especially if it was some kind of edgy drama. I can still hear the echoes of the screams of religious groups and parents from way back in 1969, because they knew that when they gave Best Picture to \"Midnight Cowboy\", an X-rated film about a gay male prostitute, it was the end of musicals and innocence in cinema, and sure enough, this film about divorce and the deconstruction of the family unit capped off a decade in which the Oscars decorated films about war, cops chasing junkies, bank robbers, gangsters, people in a mental institution, violent sports, and even sex and drugs in a Woody Allen film. Jeez, it sounds like the '70s was my kind of era, because I much prefer brutal realism over colorful musicals and what have you, although those three-hour-long fluff pieces were a little more lively than a three-hour-long, slow-burn drama about people playing Russian roulette and dealing with 'Nam. No, I still like \"The Deer Hunter\" better than something like \"My Fair Lady\", but, as surely as the guys in \"The Deer Hunter\" had war flashbacks, seeing Meryl Streep in this film had to have brought up memories of the previous year's Best Picture winner and left a couple people to dose off, although, in all fairness, when this film came out, there were plenty of people still watching \"The Deer Hunter\". Speaking of taking the long route to a film, with Hoffman and Streep, you know that this film was good, and sure enough, it is, although, as my tap dancing around talking about it might tell you, intrigue is a little limited, with entertainment value.\r\n\r\nThe score is often, well, oddly enough, rather perky when it is, in fact played with, and when it's not, it's tender enough to use resonance to make up for liveliness, but this is a mostly subdued and naturalist affair, with plenty of dialogue and other stuff going on to keep entertainment value adequate, but still leaving plenty of room for bland, almost dull dry spells in direction, as one can imagine, considering the fat around the edges of the storytelling. Running just a little bit over 100 minutes, this film isn't too long, in general, that is, but by its own right, it's a little too long, with pseudo-filler that drags the film along pretty repetitiously, often aimlessly, to where storytelling finds itself sticking with each individual segment for way too blasted long. Naturally, that means that when the focus of the narrative finally shifts, it sort of jars, whether it be focusing on a father and his son bonding when they find themselves stuck together, or focusing on a man and his wife fighting over that child, and as surely as this film's conflicts require two culprits, this almost episodic focal unevenness derives from a combination of all of the dragging, and, as irony would have it, underdevelopment. The expository shortcomings peak with the lacking immediate development segment, as a big issue during the body of the film, as I said, is overdevelopment, but when exposition lapses, this generally very humanized drama loses some sense of motivation, and that gives you an opportunity to see the limitations of this story's depths. Well, I don't suppose this story concept is lacking in depth, because it's a very thematically weighty drama, it's just that the story is so minimalist, and the longer it takes to unravel, and the less time it dedicates to really fleshing itself out, the natural shortcomings are brought further and further to light, challenging one's investment. Reward value is ultimately firmly secured, and it's not like the film loses momentum as it goes along, for engagement value thickens with the plot as it progresses, and yet, cold spells make more glaring the dragging, and expository shortcomings make worse the unevenness of this layered drama. The final product feels held back, but it's still very rewarding, and that's because for every natural shortcoming which is emphasized by missteps, there is a conceptual value which is emphasized by strengths.\r\n\r\nOf course, there's no disregarding the importance of this film's subject matter as an audaciously refreshing and realistic portrait on family dysfunction so considerable that it leads to separation, which then leaves loved ones to face anything from finding a new life to facing off against each other to secure the assets of the old life, and although such a story concept isn't especially sizable in scale, its dramatic potential runs deep. Robert Benton knows this, even as screenwriter, hitting some expository shortcomings and plenty of excess, - the combination of which begets focal unevenness - but meeting it all with some solid dialogue and memorable set pieces, whose consistency helps keep momentum up, until broken by nuances and fearless dramatics which really do justice to this drama. This film doesn't exactly sugarcoat its subject matter, and it's still had to face themes like this to this day, long into the movement to portray the deconstruction of the family unit that this film helped in kicking off, but one has to respect the bravery and depth of Benton's portrayal, both as an often very well-balanced screenwriter, and as a pretty strong director. Benton's subdued directorial storytelling all but dulls things down a bit when his script loses material, but when it's effective, it's pretty intelligent, with plays on score work that, whether they be colorful to contrast the bleakness, or fittingly somber, compliment a tone that mostly thrives on quiet intensity which is rarely too cold, and often near-piercing. There isn't much dynamicity to the dramatic tone of this film, thus, the conceptual heights in the dramatics aren't too penetrating, but Benton's directorial resonance follows the thickening of the plot, augmenting momentum that could have easily fallen as things steadily progressed, and doing so with a great deal of help from the onscreen talents who are tightly focused upon in this character drama. Following two main segments, - the first focusing on a single father bonding with his child, and the second focusing on a custody battle over said child - this film alternates between two secondary leads, both of whom are worthy, with the very young Justin Henry being surprisingly effective in his layered portrayal of an innocent child struggling with the loss of one parent, the embracing of the other, and standing at the center of the two's conflicts, while Meryl Streep proves to be devastating in her portrayal of an estranged mother struggling to find herself as an individual and as a mother, although this drama largely rides on the back of Dustin Hoffman, who carries the final product as much as anyone, with a tremendous deal of nuance which sells the transformation of a man into a better father, who will do what it takes to give his child what he can, even if that means facing off against the child's mother. The performances are mostly subtle, but they are powerful, and so important in this intimate film, defining, or rather, securing the definition of this fearless, well-drawn drama whose depth transcends both natural and consequential shortcomings, and makes for a very compelling final product.\r\n\r\nWhen the case is closed, cold spells in direction dulls things down, while a combination of aimless dragging and a degree of underdevelopment emphasize what natural shortcomings there are to this minimalist, but conceptually worthy story, which is carried enough by generally well-nuanced writing, resonant direction, and powerful performances by Justin Henry, Meryl Streep and Dustin Hoffman to carry \"Kramer vs. Kramer\" as a rewardingly realized study on the struggles of parents who largely struggle over their child.\r\n\r\n3/5 - Good",
            "review_date": "2014-08-25",
            "source": "rt"
        },
        {
            "content": "It's never easy to watch a drama on divorce. But this one is so emotional.",
            "review_date": "2014-08-12",
            "source": "rt"
        },
        {
            "content": "What a great movie.  Wonderful performances.   Hoffman and Henry are wonderful together.  Timeless.",
            "review_date": "2014-08-04",
            "source": "rt"
        },
        {
            "content": "An emotional drama that features the best of oscar winning Hoffman and Streep",
            "review_date": "2014-07-11",
            "source": "rt"
        },
        {
            "content": "There are very few movies I would call perfect, but this is one of them. Thankfully it came out during that brief period of time in the late 70's/early 80's when small movies with rich characters actually won Oscars. It deserved all 5 it received, and then some.",
            "review_date": "2014-06-30",
            "source": "rt"
        },
        {
            "content": "The right Kramer won. Yes! Ps very NY",
            "review_date": "2014-06-26",
            "source": "rt"
        },
        {
            "content": "An engaging character study, \"Kramer vs. Kramer\" tells the story of a seperated couple fighting for custody rights of their young son - a scenario that is far less uncommon than it was when this film was made, but not any less poignant or worth telling.\n\nBut what makes this film so engrossing is it's acting performances from its lead stars. Dustin Hoffman puts in one of his greatest performances (and he's had many), while the film made a star of a young Meryl Streep, and both stars deservedly took home a statuette at the next Oscars.\n\nOne of the best bits of this film centers on the journey we take with Hoffman's character - we see the child as he sees him, first as a nuisance, an annoying brat who was spoiled rotten by his mother, into a kid capable of stealing our hearts. Full credit must go to the director and young child actor Justin Henry for pulling that off.\n\nThe film gives complicated answers to complicated questions, but it's definitely a classic piece of filmmaking.",
            "review_date": "2014-06-22",
            "source": "rt"
        },
        {
            "content": "Kramer vs. Kramer is a 1979 American family courtroom drama film directed and written by Robert Benton. \nOne of the first films dealing with issues surrounding a mother leaving her husband and child, and then wanting custody. Great acting from the two leads. Considered to be one of the greatest courtroom drama films of all time. \nAAW GGWD 1001",
            "review_date": "2014-06-20",
            "source": "rt"
        },
        {
            "content": "Wow.... This sentimental shit beat Apocalypse fucking Now.",
            "review_date": "2014-06-17",
            "source": "rt"
        },
        {
            "content": "Dustin Hoffman and Meryl Streep both give magnificent perofrmances",
            "review_date": "2014-06-16",
            "source": "rt"
        },
        {
            "content": "An engaging and brilliantly acted movie! Superb writing and pace are just some of the things that make this movie a classic. It deserves all the praise it gets.",
            "review_date": "2014-06-14",
            "source": "rt"
        },
        {
            "content": "Amazing performances. This really was the golden age of the studios, when instead of trying to make cash they made films.",
            "review_date": "2014-06-02",
            "source": "rt"
        },
        {
            "content": "An oldie but a goodie!  Top notch acting from Streep and Hoffman...as per usual.",
            "review_date": "2014-05-20",
            "source": "rt"
        },
        {
            "content": "90% :D 19/05/2014 #439",
            "review_date": "2014-05-19",
            "source": "rt"
        },
        {
            "content": "Compared to one of Dustin Hoffman's earlier films The Graduate, Kramer Vs Kramer proves to be an improvement.\nOkay, Dustin Hoffman wasn't bad as Benjamin in the Graduate, but he plays the role of a workaholic and not-so bright father in Kramer Vs Kramer more effectively. We can easily identify with both parents and their son and the effect the divorce has on them. Because work had gotten in his way, Ted (that's Dustin's character) begins to devote himself, which is emotional and very likable and yet identifiable. Especially the scene where Billy injures himself, is yet an effective plot point to the story.\nI think I said enough for now. Eat ya heart out Ken Loach!",
            "review_date": "2014-05-04",
            "source": "rt"
        },
        {
            "content": "Hoffman burns the silver screen with his wit and playful portrayal of a single parent. Streep chips in well with her charm and brief emotional appearance.",
            "review_date": "2014-04-08",
            "source": "rt"
        },
        {
            "content": "BS Premium Cinema, 2013/3/4",
            "review_date": "2014-03-03",
            "source": "rt"
        },
        {
            "content": "i believe in the rights of the father. not just the mother. there are too many guys who don't take care of their kids. as a result, the mother is seemed as some sort of saint when she's the farthest from.",
            "review_date": "2014-02-22",
            "source": "rt"
        },
        {
            "content": "The Notebook for dads.",
            "review_date": "2014-02-11",
            "source": "rt"
        },
        {
            "content": "An emotional rollercoaster of a film.",
            "review_date": "2014-02-03",
            "source": "rt"
        },
        {
            "content": "Robert Benton, a man from Texas whose previous screen writing credits include \"Bonnie and Clyde\" (1967) and \"Superman\" (1978), had a very different and difficult task to achieve when he adapted the screenplay for \"Kramer vs. Kramer.\" This is a story that, to tell correctly, demands perfect balance. The movie can lean to one Kramer's perspective, alternately Hoffman's character or Streep's, but it can never consign the other to a mere antagonist role: each has to be completely sympathetic and redeemable even when they are at their lowest or potentially in the wrong. The equation becomes more complicated when role-reversal is involved. If Hoffman's Kramer is any more or less capable a caregiver to their 7 year-old than Streep's Kramer, or if hers is any more or less driven to succeed in business than his, the balance and the film's message of equality become compromised. At the same time, if they are too perfectly malleable as characters they cease to be true-to-life and therefore lose their relevance as tools of social commentary; their clearly-delineated roles-a dissatisfied wife and a career-driven husband-are what determine the kinds of challenges each face, and their respective arcs remain linked to these initial identities even as they subvert their usual meanings and transcend their presumed limitations. Toward the end, Benton indulges in some overwrought courtroom theatrics (\"OBJECTION!\" \"Overruled!\"), and the resolution of the story is ultimately a bit of a cop-out, but it can be argued that these decisions also point to his wisdom as a screenwriter inasmuch as the film's message had already been conveyed and all that was left was to leave the audience as happy and entertained as they were (hopefully) enlightened. Aspiring screenwriters may find much to admire and emulate in Benton's delicate, unflinching, yet broadly accessible achievement.",
            "review_date": "2014-01-23",
            "source": "rt"
        },
        {
            "content": "It started out as being a puzzle with pieces scattered and wondering where they are, until they're put together at the same time that you don't want to pick sides. There should've been a better outcome that would be satisfying for everyone, but this well-performed, sad drama captured the emotions of the situation. (B+)\n\n(Full review coming soon)",
            "review_date": "2014-01-19",
            "source": "rt"
        },
        {
            "content": "Incredibly acted by all in the film, Hoffman was superb as well as Streep but the most impressive performance comes from Justin Henry. The youngest person ever to be nominated for an Academy Award, for this performance, Henry was amazing and a role that could have been borderline cute was acted with unreal maturity and accuracy. The dialogue is also captivating particularly in the gripping court room scenes. Going back to the acting though, this film is a must see for its performances and is quite possibly one of the best acted films I have ever seen.",
            "review_date": "2014-01-19",
            "source": "rt"
        },
        {
            "content": "Wonderful film that still tugs on the heartstrings after all these years. Great performances from all three Kramers and probably my favourite Meryl Streep role. Nowadays it has an added nostalgia/retro appeal too.",
            "review_date": "2014-01-14",
            "source": "rt"
        },
        {
            "content": "Phenomenal performances!",
            "review_date": "2014-01-06",
            "source": "rt"
        },
        {
            "content": "Watchable but not very memorable. Dustin Hoffman plays it well but it blows my mind that he beat out Peter Sellers (Being There) for the Best Actor Oscar, not to mention that this movie won Best Picture over Apocalypse Now. I also question how Meryl Streep got nominated for Best Actress - not saying she didn't do a good job but she was barely even in the movie.",
            "review_date": "2014-01-03",
            "source": "rt"
        },
        {
            "content": "Amazing acting, directing, and writing.   Have not seen movie in long time.   Forgot how good it is.",
            "review_date": "2014-01-03",
            "source": "rt"
        },
        {
            "content": "Solid performances all around. The story is slow in parts, but pulls the heart strings. Dustin Hoffman in particular pulls the movie together. Still applies to today's standards and that's why it's considered a classic",
            "review_date": "2014-01-02",
            "source": "rt"
        },
        {
            "content": "Classic! Great acting by some of Hollywood's all time greats.",
            "review_date": "2013-12-20",
            "source": "rt"
        },
        {
            "content": "Marriage is certainly an important societal institution, but it doesn't work out for everyone. KRAMER VS. KRAMER is a heartfelt film that explores the effect that divorce has on those involved, and the difficult choices that come along with it. The film starts off by introducing all of the principal characters. The mother, Joanna (Meryl Streep) is putting her child (Justin Henry) to bed, and Ted (Dustin Hoffman) is having a late-night talk with a co-worker. By the time he gets home, Joanna says she's leaving him and the plot is set up. What follows is a long series of scenes which show how Ted has to adjust to being a single parent, and culminates in a courtroom battle as Joanna, after a long period, fights for custody of her son. What I feel like the film does well is not paint everything as black or white. Ted isn't portrayed as a wholly perfect father, yet Joanna isn't portrayed as a villain. I will say, however, that not as much screen time is allotted to Meryl Streep so that her character's motivations come off as a bit selfish at first. Still, the meat of the story is in how her decision to leave affects her husband and child, and there was certainly a lot to process. There were plenty of ups and downs and the film is able to effectively show how the father's relationship with his son matures and develops over time. The performances were also top-notch, even from the child actor portraying the son. This is a very emotional film at times, and every such moment felt real and believable. You actually care what happens to these people. Overall, while certain surface aspects date this film a little bit, the emotional core is very strong and the performances only make things that much better.",
            "review_date": "2013-12-15",
            "source": "rt"
        },
        {
            "content": "Amazing. The subject and the writing are ahead of its time. The movie holds up really well.",
            "review_date": "2013-12-09",
            "source": "rt"
        },
        {
            "content": "Perhaps this a bit dated but the idea of divorces and parental rights was still a relatively unexplored area at the time that Kramer vs. Kramer was created. An interesting choice to demonize the mother but it adds to the intrigue and Hoffman and Streep are more than up for this challenge.",
            "review_date": "2013-11-15",
            "source": "rt"
        },
        {
            "content": "It shows us the struggles a parent can go through during a marriage separation and the lengths to be in the child's life.",
            "review_date": "2013-11-15",
            "source": "rt"
        },
        {
            "content": "it talked much about family, marriage life, and responsibility. and the acting skill of the three leading roles is just amazing :')",
            "review_date": "2013-10-11",
            "source": "rt"
        },
        {
            "content": "Absolutely beautiful",
            "review_date": "2013-10-01",
            "source": "rt"
        },
        {
            "content": "The best divorce drama ever made.",
            "review_date": "2013-09-15",
            "source": "rt"
        },
        {
            "content": "I never had to divorce, but in my opinion this film portraits what a divorce is. Great movie!",
            "review_date": "2013-09-12",
            "source": "rt"
        },
        {
            "content": "Kramer vs. Kramer (1979) ????\nSmashing drama about wife who walks out on husband and leaves him to take care of their young son. Not a false note in characterization, the two lead performances rate--and receive--unforgettable performances. Oscars for Picture, Actor, Actress, Direction, Original Screenplay. Evocative and moving; a truly wonderful film.",
            "review_date": "2013-08-31",
            "source": "rt"
        },
        {
            "content": "Certified tearjerker. This film would be very different if Dustin Hoffman and Meryl Streep did not take the main roles. Hoffman's approach to every role he plays is intelligent, always confident, delivering ecstatic performance with natural low-keyed voice. Streep is a natural beauty, both physically and precociously. The child actor, Justin Henry reminds me of Nino Muhlach in Lino Brocka's 1978 movie \"Ang Tatay Kong Nanay\". Might I say the whole \"Kramer\" reminds me of \"Ang Tatay\". Children have separation anxiety. It is very evident in both films. There is nothing more heartbreaking in films than seeing children getting depressed (or dogs dying).",
            "review_date": "2013-08-20",
            "source": "rt"
        },
        {
            "content": "a perfectly-acted and emotional drama of divorce in the 70's\nthe movie broke new ground by addressing the fathers' rights in divorce cases for the first time and established the father-side of things \nit really is the bond between father and son that makes the film soar, it gets pretty emotional in spots and I found myself wiping my eyes a few times\nnext to Dustin Hoffman and Meryl Streep it's the little boy that acts very mature for his age and he's dealing with a lot having his mother leave and only having his father\nand you don't really have to be on anyone's side in the case of the custody battle, each one has their turn having a say in the matter\ndivorce is never an easy subject to discuss but this father is willing to do whatever it takes to be in his child's life \na movie to be praised for it's brave opening up of a family breaking apart",
            "review_date": "2013-08-14",
            "source": "rt"
        },
        {
            "content": "Outstanding family drama",
            "review_date": "2013-08-14",
            "source": "rt"
        },
        {
            "content": "http://filmreviewsnsuch.blogspot.com/2013/08/kramer-vs-kramer.html",
            "review_date": "2013-08-11",
            "source": "rt"
        },
        {
            "content": "Great acting from Hoffmann, emotionally upsetting from the start, progresses to be even more touching and engaging.",
            "review_date": "2013-07-31",
            "source": "rt"
        },
        {
            "content": "Dustin is just fantastic!",
            "review_date": "2013-07-30",
            "source": "rt"
        },
        {
            "content": "It was on TV, and I decided to watch it just because I saw  Meryl Streep's name in the opening credits. Now, guess what? This's one of the few times that I've wanted to reach into the screen and slap a Meryl Streep character, but I wouldn't bring myself to do it because she's just so great even when she's so messed up.",
            "review_date": "2013-07-17",
            "source": "rt"
        },
        {
            "content": "They don't make movies like this anymore",
            "review_date": "2013-06-28",
            "source": "rt"
        },
        {
            "content": "Look, first things first, this movie has like the stupidest name ever. The title is just so dumb it sound like a five year old animated sci-fi movie when I hear this name. But thankfully, it is not a five year old animated sci-fi movie. It's freaking amazing. I have to tell you that this movie is great! It won for Beat Picture at the 1980 Academy Awards along with Best Actor, Supporting Actress, Director, and Writing. Even though the title is like the most retarded title I've ever heard in my life, the movie itself is outstanding and it jut hit me in the heart. But seriously, it's like the filmmakers made the entire film and had it ready for release, but they didn't have a title, so they came up with the stupidity: Kramer vs. Kramer! But, anyway, without further ado here is my review for (swallow painfully) Kramer vs. Kramer. \r\n\r\n  The plot for Kramer vs Kramer is sort of cliche. It's a story about a troubled father whose wife has left him and he has to take care of his son and he basically doesn't know how to do that. It's been done many times before and we've seen it hundreds of times. But, its very different in comparison to the other films like this. The mother plays a big role in the film and once she comes back into play it becomes a whole different story.  So, is it another sad sap father/son story or is it more than that? \r\n\r\n   Kramer vs Kramer brings in a punch of emotion from the actors. From the very first scene with Meryl Streep's intuitive and heartbreaking crying, to 8-year old Justin Henry's angry confrontation with his father, the acting in this film never stops being, well, great. Dustin Hoffman is very convincing as a lost and troubled man trying to ind his way, yet he keeps a charm that's always with him throughout. He also has a weakness that's showing through his posture and his voice that really shows that he can't control things, at home or at the office. Meryl Streep was amazing (not really a surprise). I always say that most supporting actors don't deserve their Oscar wins either because they didn't have enough screen time to impress me or they weren't even that great. But in this, Meryl's Streep had enough power and screen time to convince me that she was a lead actress and she could've won. The great thing about her character and her acting is that the film tears you between whether you think that she's a piece of crap or she just really lost her way when she left her son. You really want to hate her but you don't. This is all thanks to the script and Streep's mesmerizing performance.  But the one actor that stole the whole show was Mr. Justin Henry himself. This bit was like 7 when he portrayed the role as Billy and he rocked! He was so mature and he definitely knew what he was doing when he acted in this movie. The anger and emotion that this boy could let out at such a young age is astounding! Plus he is the youngest kid to be nominated for anything ever at the Academy Awards. The movie's acting  is the best part about the film and its some of the beats I've seen ever in film. \r\n\r\n    The direction is very subtle in Kramer. Robert Benton keeps the focus on the actors and nothing  else. It's almost done like a play, something I love to see when directors do that.  There is no crazy style or cool cinematography. The camera is only on the actors and we are allowed to soak in the moment from the very first second. The writing is a bit predictable though. You can literally tell what the next character is going to say in a scene and you can tell how the scene will turn out about five minutes into it. But there are some twists and turns in the movie which were pleasantly surprising and I thank the script for that.  \r\n\r\n   The best part about Kramer Vs Kramer is the fact that you don't take sides in the film with the characters. Although you are with Ted Kramer for most of the movie, and you're supposed to literally hate the wife, once the court scenes come in the movie, you really actually care for the wife and understand why she should have the child also. Although I still thought she was a total b*tch. This film lets you enter these characters lives and you feel and care for them in ways that film has never shown me. Kramer vs Kramer is a beautiful, heart wrenching and immersive film that messes with your emotions and helps you understand the importance of family. \r\n\r\nRecommendation: Everyone should definitely see this no matter who you are, you'll love this movie and understand that family is the important thing in the world, so don't let that break.",
            "review_date": "2013-06-19",
            "source": "rt"
        },
        {
            "content": "That is one of the most deceitful posters I have ever seen. The Rotten Tomatoes poster for Kramer vs. Kramer in no way shows the relationship of the three Kramers. Kramer vs. Kramer, from the plot synopsis, seems to be about a simple custody battle between mother and father. It is so much more, or so much less, than that. The reason I say this is because Kramer vs. Kramer is indeed very true to the reality of divorce nowadays, but it is more realistic and portrayed much more darkly and consequential than it is portrayed in most other films. Kramer vs. Kramer is honestly the most true film about family divorce, but at the same time it shows some  radicals you don't see every day. And, I have to say, Kramer vs. Kramer is also a very misleading title. The custody battle doesn't begin until the last third of the film, and it's more of a story about Dustin Hoffman and his efforts to take care of his son just as his son's mother did, and how he copes with his life as well as his kid. Hoffman's character is very devoted to his job, and that's the reason his wife left him because she felt his job came before her. And with the mother gone, Hoffman's character learns his family and son is more important to him than anything else, even his own career he's spent years on. Some could say it's a coming-of-age of film, Hoffman's character realizing that his family means more to him than his job, and how he must show his family he cares. While the title is misleading, the messages this film gives is not.\r\n\r\n   Kramer vs. Kramer is a 1979 film written and directed by Robert Benton. It's about Ted Kramer (Dustin Hoffman), and how his wife, Johanna Kramer (Meryl Streep) leaves him and abandons her son. Ted Kramer must now take care of his son as well as keep his job and career rolling, but all doesn't turn out as expected. Johanna comes back, and wants more than a simple apology. She wants her son back. A custody battle ensues, and complications carry on. This is a wonderful story, excellently written in my opinion. With some predictable elements, though, Benton writes an original film with an everyday plot. This film is not just based on a book, but on everyday lives. It was not until 1979 when a film had delved into divorce and its outcomes as deep and as realistically as this one. While the plot is predictable at times (my brother and I were guessing what was going to happen next as the film went on, and most of the time we were correct), it still seems fresh and well done. The plot is compelling, especially when the custody battle ensues. The characters stop at no cost to do what they must to get their kid back, and it's easy in my opinion to choose which side you are on: Ted Kramer's. You've been along the ride the whole way with him, and feel his emotions, and feel his anger as Johanna asks for her son back and fights for him, and you feel his sadness when he realizes he might lose his son. It's a divorce story, a story about a man and a wife, told from the father's point of view, a point of view in which you feel sympathy and root for him. During the course of the film you always want him to win, and feel a pain and sadness he feels, and you hope he gets the kid. And while the twist in the end is generic and predictable, it's suiting and satisfying, even though the ending is a bit to abrupt. Great characters, nice dialogue, and an excellent, but predictable screenplay, Kramer vs. Kramer's plot doesn't seem like gold on paper, but it turns out to be more than that on screen.\r\n\r\n   Dustin Hoffman gives one of his best performances I have ever seen him in. He gives the audience his sense of struggle and loss throughout the movie, and you feel compelled to root for him the entire length. Meryl Streep also gives an excellent performance as Johanna Kramer, the only performance that has made me hate an insecure wife, a hurting wife so much. As Hoffman and Streep battle it out, Hoffman does wild things he must to keep his son, and so does Streep. A clear protagonist and antagonist are shown in this film, even if the genders re reversed. Although they are reversed, it feels nothing like it, as Hoffman feels like the correct protagonist and Streep feels like the villain. Excellent performances by them both, with Hoffman deserving his Oscar, showing all the layers his characters has, such as charm, anger, and workmanship, all entirely encompassed in Ted Kramer's being. Justin Henry, the boy who play's the Kramer's son, though, is also amazing. His performances is very layered, especially for an eight year old. He's very convincing and proves to be excellent in his performance, and is very believable throughout the film. When a child gives an amazing performance, I always feel compelled to mention it, and this one deserves a lot of recognition. \r\n\r\n   Benton's direction within this film is also well-done. I feel some of the symbolism, though, is forced upon you, and while you do understand it, I felt it should've been a bit more subtle. He portrays the entire film with a darker tone than what most people would've portrayed it, with most of the shots being done in the cold winter with no sun. This film, in total, is a purely well-done one. An excellent, realistic movie, holding all it's characters up, with a clear protagonist and antagonist, and a satisfying, great cast, Kramer vs. Kramer is one of the most compelling films of every day life. Divorce and child custody happens everyday, but this film shows it's true light, and how one person will most likely have to take care of the kid, even though it's the wrong person. A engrossing screenplay, although predictable, and a good ending, although abrupt and quick, the plot is one to remember and learn from. An excellent, great film about father-son relationships, husband-wife conflicts, and a man's ability to put his family above other things, including his career, is a real film to watch, and one I will always recommend to many people. 9/10",
            "review_date": "2013-06-16",
            "source": "rt"
        },
        {
            "content": "Never taking sides, Robert Benton's Kramer vs. Kramer is an engrossing, touching experience, with a compelling script and fantastic performances from its flawless cast.",
            "review_date": "2013-05-15",
            "source": "rt"
        },
        {
            "content": "An advertising executive is left with the responsibility of caring for his son Billy alone after his wife suddenly leaves him. This touching, sweet and sometimes tear jerking father son film, and also everyone's favourite divorce flick, set a tone for similar family dramas that would come out during the following decade. Great performance by Dustin Hoffmann as the father who slowly discovers the joys of being a parent, and Meryl Streep as the wife.",
            "review_date": "2013-05-11",
            "source": "rt"
        },
        {
            "content": "I watched two weeks ago and I still haven't reviewed it. Maybe because I had nothing to tell. It's a well made movie, with two great actors, that acts perfectly. And of course it's a tricky question the one treated in the movie. But, although I did get involved in it, it's not the kind of movie I will remember for the rest of my life. I'm strict maybe, but 3 stars and a Half.",
            "review_date": "2013-05-05",
            "source": "rt"
        },
        {
            "content": "Non mi ha preso moltissimo ma non posso certo dire che sia un film mal fatto. Fortunatamente non cade mai nel banale o nei sentimenti troppo strappalacrime.",
            "review_date": "2013-04-27",
            "source": "rt"
        },
        {
            "content": "Overall, pretty good but the ending seemed to fizzle out.",
            "review_date": "2013-04-26",
            "source": "rt"
        },
        {
            "content": "In 1979, America was just beginning to see the effects of the women's movement on the american family.  There was a great amount of role reversal in the home, and the divorce rates had begun to skyrocket.  In \"Kramer vs. Kramer\", we witness the collapse of a marriage that before, in a more typical movie, would see the man walking out on the woman, leaving her to support and raise their child alone, but now sees the woman leaving, as she feels unfulfilled in life and wants something better (there aren't necessarily any villains in this movie, only victims).  Ted Kramer (Dustin Hoffman) is the husband, climbing his way up the corporate ladder, making great business contacts while his family contacts languish.  Joanna Kramer (Meryl Streep) is the wife, and the only reason she's stayed with him so long is her love for little Billy, their son.  As the film opens, it's come to the point where her desperation and unhappiness have surpassed even the love for her son, and she's packing to leave.  Ted arrives home, high on the news he may be made a V.P. at work, completely unaware of his wife's condition or their situation.  \"She's ruined one of the five best days of my life\" he complains, after she's walked out on him (notice the emphasis is all on him).  In the midst of all this selfishness, no one seems to notice that Billy has been virtually abandoned by both parents.  No, he's no Oliver Twist: he has a home, he has food and clothing, and he wants for nothing, but the adults in his life, the people who are supposed to be foundation of his very person, are letting him down in a most cruel way.  Being forced together, Ted and Billy must interact without the motherly intermediary present, and it's a learning experience for both father and son.  Ted goes from ignoring his son and being largely dismissive to realizing just how valuable that child is to his existence, and how much that child depends on him for literally everything.  It's only after the immensity of this \"parenthood thing\" dawns on Ted that Joanna comes back into the picture, and after a 18-month absence, sues Ted for custody of their son.\n\nPerhaps it takes becoming a parent to truly realize the stakes of a movie like Kramer vs. Kramer.  There are few things more powerful than the love a parent has for their child (I know I would without hesitation give my life for my daughter, and even a thought of some harm be-fouling her can put literal, physical tears in my eyes almost in an instant), and yet as parents, we are capable of so much destruction in these little lives.  The extent to which we can emotionally cripple our own offspring is both shocking and horrifying.  They're little people, very small physically, and sometimes it's easier to ignore them while focusing on our own needs, and not even realize what it is that we're doing until it's too late.  Even though I've never gone through a divorce, I can empathize with the emotions this movie projects.  Parenthood is perhaps the less glamourous of the 'big emotions' that make for movie material (Death and Romantic Love usually get all the glory), but parenthood is just as powerful, just as devastating as any other great mystery of life.",
            "review_date": "2013-04-24",
            "source": "rt"
        },
        {
            "content": "such a perfect performance from Dustin Hoffman great film loved it .. one of my new favorites.  great picture! !!!",
            "review_date": "2013-04-12",
            "source": "rt"
        },
        {
            "content": "Parhaimpia draamaelokuvia ja viela Hoffman mukana! Ai etta.",
            "review_date": "2013-04-09",
            "source": "rt"
        },
        {
            "content": "Even with a predictable storyline, Kramer vs. Kramer hits all of the emotional notes thanks to (not shockingly) bravado performances from Hoffman and Streep.",
            "review_date": "2013-04-07",
            "source": "rt"
        },
        {
            "content": "one of hoffman's best!",
            "review_date": "2013-04-05",
            "source": "rt"
        },
        {
            "content": "Great, emotional movie.  A powerful exploration of the causes and effects of divorce, and the controversial subject of child custody.  Maybe not entirely balanced in its examination - very little is seen of Mrs Kramer (Meryl Streep) - and the ending is a bit trite and Hollywoodish.  \n\nSuperb performances.  Dustin Hoffman and Meryl Streep deserved their Oscars.  Good support from Jane Alexander and Justin Henry (who, at 8 years old, became the youngest ever Oscar nominee).\n\nHowever, didn't deserve the 1980 Best Picture or Best Director.  Those should have gone to Apocalypse Now and Francis Ford Coppola, respectively.",
            "review_date": "2013-03-30",
            "source": "rt"
        },
        {
            "content": "crymore Vs crymore...",
            "review_date": "2013-03-23",
            "source": "rt"
        },
        {
            "content": "Touching portrait of father and son",
            "review_date": "2013-03-03",
            "source": "rt"
        },
        {
            "content": "Heart-breaking story that Dustin Hoffman totally nailed",
            "review_date": "2013-02-27",
            "source": "rt"
        },
        {
            "content": "This was a great film even though the kid got a little annoying",
            "review_date": "2013-02-26",
            "source": "rt"
        },
        {
            "content": "Charming and well acted, Kramer vs. Kramer is calm and poignant film.",
            "review_date": "2013-02-26",
            "source": "rt"
        },
        {
            "content": "wow. this movie has tintin in it.",
            "review_date": "2013-02-20",
            "source": "rt"
        },
        {
            "content": "Nice little soapy family drama, Kramer vs Kramer has typically good performances from Streep and Hoffman, and the kid too.",
            "review_date": "2013-02-19",
            "source": "rt"
        },
        {
            "content": "I'd like to warn my readers that if they are going to see the 1979 Oscar-winning drama Kramer vs. Kramer for the sole purpose of seeing Meryl Streep, then they should be prepared to be disappointed since she's not in the movie a whole lot like the posters are claiming. Even though she has claimed one of the two top billings for this movie, she's only in it for about half the length of the film at most. I know such a comment is a little unusual to make, but I think it's important that I mention it now before my readers read the rest of this review. With that said, let's continue to talk about Kramer vs. Kramer. \n\nAs far as all of the Best Picture Oscar winning films go, Kramer vs. Kramer is one of the films that I'd only consider okay at best. While it is undeniably well acted and the story is pretty well told, there are still some personal pet peeves that I had with the film. We'll dive into my pros and cons later, let's talk about the film's story first. \n\nDustin Hoffman plays a very busy advertising executive who has just landed an important assignment that will lead to a big payday. When he gets home late and tries to tell his wife (Meryl Streep) the good news, she tells him that she wants a divorce and leaves him. Whatever reasons why their relationship had deteriorated and whether or not he had been working overtime for the past few years aren't really analyzed or explained that well. There's a scene with the couple in a coffee shop where they act like a happy couple for the first couple seconds, but then they abruptly and forcefully act hostile towards each other that proves that weakness. Anyways, let's keep going. \n\nThis divorce becomes a serious issue for him in that he has to take care of their child (Justin Henry) all by himself and the fact that he has too busy a work schedule to take care of him. When they become forced to spend quality time together, they don't care much for each other at first. But to the surprise of very few people in the audience including myself, they start to warm up more to each other. So when the time comes in which the parents have to battle for custody of the child, the child is left with an unbearable situation to undergo. \n\nSo what is it about Kramer vs. Kramer that doesn't work that well? Well, as I stated in the introduction, Meryl Streep really isn't given much screen time especially given the fact that her character put this story into motion in the first place. Considering that she started the plot's conflict, she should have been given more focus and depth than what she actually got. Noting that the film lasts more than an hour and a half, I honestly think that she was only in the movie for about half an hour which is very weird. While the writers do handle Hoffman's story fairly well, they could have done much more with Streep's. \n\nBut that isn't the only significant problem that I have with this flick. I realize the comment I'm about to make might sound unfair, but as long as reviews such as this are meant to express one's feelings, I feel that it's best to simply say it. I didn't like the kid that the parents were battling over since he came off as sort of an unlikable brat. He's too whiny and fueled with negativity, he causes a lot of trouble, and when he gets himself hurt, I felt no sympathy for him since he sort of had it coming due to the arrogant, careless behavior he commits. While you could argue that he's going through a terrible situation for a child, I could also counter argue that he could have been less obnoxious. \n\nSo that's enough complaining about the film's weaknesses, what do I like about this film that makes it worth looking at altogether? As I stated earlier, the film has some very good performances behind it. Dustin Hoffman is believable as the busy father who tries to reconnect with his son in the midst of this unfortunate separation. Jane Alexander is very warm and likable as his neighbor who also has to take care of a child on her own and tries to support him when he most needs it. Although Streep's character isn't really that well thought out, she does the best she can with her performance and it shows. \n\nDespite the fact that there are some plot points that weren't clarified, the storytelling is still efficient and straight to the point as good storytelling should be. I wouldn't say that this is the most original idea for a movie, but it does satisfy 1 1/2 to 2 hours of my time well enough. I think if the kid were less whiny, if the wife was more developed and had more screen time, and if we understood why the relationship went downhill in the first place, Kramer vs. Kramer would have been even better. As it is though, it's decent if far from great.",
            "review_date": "2013-02-16",
            "source": "rt"
        },
        {
            "content": "As as atuações perfeitas do trio de protagonistas, e o inteligente roteiro que foge dos clichês, faz com que Kramer vs. Kramer torne-se um filme atual - mesmo que seu tema, o divorcio, tenha se tornado tão banal.",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "Billy is the antagonist. Remember that.",
            "review_date": "2013-02-08",
            "source": "rt"
        },
        {
            "content": "Wow, wow, wow. What a moving film. From the first scene, I could just tell that the directing and writing would be spot on. The way that the characters are developed in this film seems so real and emotional, and it makes you feel like you're a part of the story. Very, very good drama that portrays hope and building relationships even in the toughest of circumstances.",
            "review_date": "2013-02-02",
            "source": "rt"
        },
        {
            "content": "Loved this movie! Dustin Hoffman is great as always and I thought the movie's subject (divorce) was well handled (not too melodramatic). Good acting, great direction, and this movie really made me feel the emotions it was trying to convey throughout the movie. I liked how this movie felt very real and believable. Highly recommended.",
            "review_date": "2013-01-29",
            "source": "rt"
        },
        {
            "content": "Fantastic Acting, Fantastic Story..",
            "review_date": "2013-01-28",
            "source": "rt"
        },
        {
            "content": "Kramer vs. Kramer is just fantastic, it's a terrific movie, it's also one of my favorite movies and one of my favorite classics, I just totally loved it, the acting is superb, all the main actors of this won an Oscar or were nominated for it, the plot is genius and the movie itself is outstanding, you have no idea how good it is and you have no idea how much I like it. Kramer vs. Kramer won 5 deserved Oscars, I just loved it, this movie is a masterpiece and it's just touching and engaging, I can't think of anyone who doesn't like it, this movie's 7.7 on IMDb might be a bit low for this movie, just to let you know how really good it is. Sow, Kramer vs. Kramer is a movie that I can recommend to everybody, if you ever want to pick a classic to watch, Kramer vs. Kramer would be one of the best possible choises, cause this movie is worth watching and I think everybody who loves films should, cause this is a masterpiece, it has a masterpiece acting, a masterpiece script, a masterpiece directing and I think it's one of the best movies ever made in the history of films. Terrific movie.\n\nRobert Benton directs this movie and he did a terrific job, he defenitely deserved his Oscar, he just did a terrific job and he provided you an unforgettable masterpiece. Dustin Hoffman takes the lead role and this was probably the highlight of his career, at least for me, from all the movies I've seen where Dustin takes a role in it, this was defenetely his best perfomance, he just defenitely deserved his oscar and I loved his perfomance and the character he played, Dustin was just amazing, Dustin is known from my ninth favorite movie, wich is Meet the Parents, he is also known from my tenth favorite movie, wich is Little Fockers, he is also known from Rain Man, The Graduate, Tootsie, Kung Fu Panda, Kung Fu Panda 2 and some other movies. Meryl Streep, oh, what can I say, I genuanlly think that she's possibly my favorite actress, I mean, she was already nominated for 17 Oscars, she's won 3 of them, including her role in this movie, wich was 100% deserved, Meryl is a legend and she's easily my favorite actress, in this movie, she had a terrific perfomance, I just loved her here, she's really amazing, Meyl is known from, The Iron Lady, Doubt, Sophie's Choice, Out of Africa, Julie & Julia and some other movies. Jane Alexander was amazing here and she also deserved her Oscar nomination, Jane is known from The Ring, The Cider House Rules and some other movies. Justin Henry was the little kid that got in this movie with no acting experience... overall, he was one of the youngest actors ever nominated for Oscar and I think he defenitely deserved his nomination, for a kid of age 7 at that time, he was amazing, Justin is known from Tiger Town, Sixteen Candles, Finding Home and some other movies. Sow, as you can see, this movie has extraordinary actors in it and extraordinary perfomances by the excellent actors, this is one of the only movies that I've watched where all the main actors got an Oscar or were nominated for it. Excellent perfomances. Excellent cast.\n\nTed Kramer (Dustin Hoffman) is a man that just got divorced by Joanna Kramer (Meryl Streep) who coulnd't take him anymore. Ted Kramer is now alone with his son Billy Kramer (Justin Henry), who was very attached to his mother. After almost 18 months, Joanna comes back in order of getting Billy back. Ted doesn't accept that so Ted and Joanna go to court seing who's getting the child's custody.(What I thought about the plot) I loved this movie's script, it was worth an Oscar obviously. The script was amazingly written, it really defines the lives of people who get divorced, I loved the script, it moved me, it had an excellent development and I think it was one of the best written plots ever, besides, it worked really well in the movie, it's very touching but everything gets back in pieces (Attention: This was no spoiler). Sow, for you to watch the movie, you just have to know that the plot is excellent, really outstanding and that it won an Oscar, that's all. Excellent plot.\n\nSoundtrack, well, I only remember to hear one theme I guess, just for a few seconds, but that's alright, this movie didn't need a good soundtrack, there was just a few minute theme, that's all.\n\nBesides all that, I am now going to tell you what I really thought about this movie. First of all, I defenitely think you should watch Kramer vs. Kramer if you haven't, I mean, it's one of the most well done movies in history, it's just amazing, it's never boring, I can assure you that, the production was amazing, everything was amazing, what leaves me secure saying that this is a perfect movie, not near perfect or anything lke that, it's really, a perfect movie. Sow, Kramer vs. Kramer is moving, entertaining, it has terrific acting and an amazingly well written plot, what more can you get from a classic, this is one of my favorite dramas and I'm sure no one would ever even think of giving it an average rating, this is really those kinds of movies that everybody love and I'm one of those peole, it was amazingly well done and it stands as the highlight of a few actors' careers, trust me. Overall, Kramer vs. Kramer is terrific from the beginning to the end, it has an excellent cast, an excellent plot and it's a very entertaining movie. I highly recommend it, it's really worth watching it. Kramer vs. Kramer: 10/10. Masterpiece.\n\nMasterpiece movie. Extremely recommended movie, 100% recommended movie. Grade: A+.",
            "review_date": "2013-01-20",
            "source": "rt"
        },
        {
            "content": "As someone who has seen this film at least 3 times as well as read the script, I may not be the most impartial viewer. This film has great characters, dialogue and the acting! Maybe my only complaint is that Streep's role was not very developed but that might be understandable, because it is really not her film.",
            "review_date": "2013-01-13",
            "source": "rt"
        },
        {
            "content": "If I ever wind up divorced and taking care of an only child I hope I am just like Dustin Hoffman in this.",
            "review_date": "2013-01-09",
            "source": "rt"
        },
        {
            "content": "Kramer vs. Kramer was a very enjoyable film with a strong storyline and two all-star actors. Dustin Hoffman is a favorite of mine and was just as amazing as always. You can never differ Hoffman from his character. He is a completely different person in every movie he plays.",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "Finally got a chance to see see the movie I was named after! I thought it was a great film, and actually brought issues that relate to me to the forefront. As always, Meryl Streep was great, but Dustin Hoffman stole the show on this one. A must watch in my book.",
            "review_date": "2013-01-05",
            "source": "rt"
        },
        {
            "content": "Although the court case and the divorce tension isn't as thrilling, Kramer vs. Kramer is greatly-plotted family drama with talented performances by Meryl Streep and Dustin Hoffman who carry the film's story line to the very end and the plot tells the hard-decision making of parents and children through a terrible divorce.",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "Although slightly dragged, Kramer vs. Kramer features equally great performances from Hoffman and Henry and makes great use of a well-written screenplay (particularly during the climactic courtroom scene). 8/10.",
            "review_date": "2012-12-26",
            "source": "rt"
        },
        {
            "content": "http://vits-ingthemovies.blogspot.com/2013/11/kramer-vs-kramer.html",
            "review_date": "2012-12-26",
            "source": "rt"
        },
        {
            "content": "Only three more review to go and I'll reach 400. So how about I talk about a much more deep and serious best picture winner like Kramer Vs. Kramer?\r\n\r\nPlot: Ted Kramer is a workaholic who is working on a big deal at his job when his wife Joanna decided to leave him along with their son Billy. So Ted has to take care of Billy while trying to do his job. Eventually, this leads them to become closer together, but then Joanna comes back a while later deciding to want to take custody of Billy.\r\n\r\nI wasn't exactly kidding when I said this film was deep. I mean the whole concept of having to raise a child on your own after your spouse leaves you out of the blue is obviously a really big deal. But how they do it in this film is pretty powerful. The relationship between Ted and Billy went off great. It was very believable and both actors did spectacular jobs in their roles. Meryl Streep did a good job too...but I didn't feel too convinced that she deserved to win best supporting actress. I mean she had some really good moments, but...I don't know, I didn't feel like it was enough to win per say. But that's just my highly biased opinion about that. And in any case, it's still dramatic, sad, happy at some points, and really deep and powerful all around. What else is there to say, except that Kramer Vs. Kramer is a really good film to enjoy, little to no doubt about it.",
            "review_date": "2012-12-22",
            "source": "rt"
        },
        {
            "content": "Great film but it is all about adult topics so is not a film that will appeal to a young audience. This is one of those films that was talked about for years but I never got to watch it until now. The acting is excellent and you can get a real life feel about how a split in a marriage affects everyo...read morene in the family. Dustin Hoffman,Robert Benton and Meryl Steep really made this film a winner.",
            "review_date": "2012-12-19",
            "source": "rt"
        },
        {
            "content": "Kramer vs. Kramer is a sensitive, flawlessly acted film that repels the temptation to be biased or provide simple solutions.",
            "review_date": "2012-12-16",
            "source": "rt"
        },
        {
            "content": "Characters. Characters are essential for a movie like this to work. Without a strong story, this film would not have been able to operate. Thanks to the delicate approach by Robert Benton both on paper and behind the camera, \"Kramer vs Kramer\" works. This is also thanks to the powerhouse acting by Dustin Hoffman and Meryl Streep, who display some of the best of their abilities in this movie. \n\nWhen Joanna Kramer decides that she doesn't want to be with Ted anymore, she leaves town and Ted is forced to take care of their son by himself. Over the course of their time together, Ted learns how to be a father and to truly care about the one he loves so much. They eventually grow a strong bond together. When Joanna comes back into the picture she decides that she wants full custody of the child. Ted has to prove how much he loves his son, and that he can be a truly caring individual. Robert Benton's screenplay is great; simple as that. Its real, its close to the heart, and its great. \n\nAs I said earlier, the acting is absolutely astounding. Dustin Hoffman and Meryl Streep display the near-peak of their abilities in this film alone. Its really no surprise that both of them won oscars for their performances in this movie. All of the Hollywood cliches go right out the window and what the audience is left with is purely human emotion, characterized flawlessly by two true professionals. Great stuff. \n\nOn a side note, its kind of annoying that I had to retype this whole review because it got deleted for some reason. That's why this review is kind of poor, also because I'm a little fatigued. But I will say with confidence that \"Kramer vs Kramer\" demands to be seen. Its well written story excels the wonderful performances into greatness. Dustin Hoffman and Meryl Streep display amazing chemistry, and both show why they are so amazing. This review might not be the best it can be, but let me just say this. \"Kramer vs Kramer\" is a wonderful film. Its acting at its finest. Check it out.",
            "review_date": "2012-12-10",
            "source": "rt"
        },
        {
            "content": "would have given this six stars",
            "review_date": "2012-12-08",
            "source": "rt"
        },
        {
            "content": "Dustin Hoffman is definitely one of the best actors ever ! he's really one in a million !",
            "review_date": "2012-12-05",
            "source": "rt"
        },
        {
            "content": "With deservedly award-winning performaces from Dustin Hoffman and Meryl Streep as well as heart-wrenching and relevant story, Kramer vs. Kramer explores its divorce subject matter appropriately from every side and regard and although the direction is not particularly sophisticated, the film does succeed, it is a thoughtful, compelling, realistic, thought-provoking and heartbreaking drama that is one of the best and most underrated of the decade.",
            "review_date": "2012-12-04",
            "source": "rt"
        },
        {
            "content": "It's essentially a mediocre soap carried out by terrific performers.",
            "review_date": "2012-11-29",
            "source": "rt"
        },
        {
            "content": "You'll grin big enough to catch the tears.",
            "review_date": "2012-11-29",
            "source": "rt"
        },
        {
            "content": "A just-divorced man must learn to care for his son on his own, and then must fight in court to keep custody of him.",
            "review_date": "2012-11-25",
            "source": "rt"
        },
        {
            "content": "A fine moving, and witty story. Dustin Hoffman and Meryl Streep at their best !",
            "review_date": "2012-11-19",
            "source": "rt"
        },
        {
            "content": "Dustin Hoffman delivering some tense script and screenplay while putting the audience in his character's shoes.",
            "review_date": "2012-10-29",
            "source": "rt"
        },
        {
            "content": "Really sad, and oddly nonjudgemental to all the characters involved. This makes for an unsatisfied but reflective feeling in your gut by the time the credits are rolling.",
            "review_date": "2012-10-28",
            "source": "rt"
        },
        {
            "content": "KvK is not as amazing as it's pedigree might make it seem. With Meryl Streep and Dustin Hoffman starring in this Oscar winning film, it might seem to be all that, with an ending that will make you cry. Nope. It is a good film with a lot to celebrate about it, but it's not as amazing at it may once have been. The film struggles in a few spots, particularly the court room scene and the beginning just seems a little uneven, but the film will try to charm you and it ultimately does. It is, though, an overrated Best Picture winner with some scene, the fight between dad and Billy, that will make you cringe. It tries at times, but it just can get a foothold on the huge expectations that it once held. Watch it if you're interested in the type of thing, but if your not, be wary; it's not as great as it once seemed. 3.65/5",
            "review_date": "2012-10-27",
            "source": "rt"
        },
        {
            "content": "A simple enough story line, which addresses issues very relevant for\ntoday's times. It's essentially a family drama with a plot revolving\naround work-life balance, career/family decisions, unhappy marriage,\ndivorce, kids in broken homes, and raising children as a single parent. \n\nWhat is amazing in this movie is that it does not take sides. The\ncharacters in this movie are realistic and believable, and have flaws\nas well as good qualities just like normal people. The director has\ndone an amazing job in presenting a balanced view of such a touchy,\nsensitive topic.\n\nTed Cramer (Dustin Hoffman) is a workaholic with a lot on his plate. He\nis married to Joanna (Meryl Streep), and they have a seven year old son.\nAlthough the family looks perfect and happy, there are fissures. Ted\nalways chooses work before family life, and does not give enough time\nto his wife or listens to what she says. Things start becoming\nunbearable for Joanna, and she leaves. Ted, recently promoted at work,\nis now faced with twin challenges of bringing up his son on his own,\nand handling the demands of the workplace, and he really struggles at\nthis for sometime. After about a year and a half, when he is somewhat\nused to this routine, Joanna comes back into his life, and demands\ncustody of their son. Ted is not ready to give in, and the couple end\nup in court. What happens next? Please watch the movie to find out.\n\nThis movie underlines the importance of work-life balance, and of small\nactions/ gestures like listening, showing your affection, bringing home\nteeny-tiny gifts, saying \"I love you\", etc which really matter a lot\nwhen it comes to relationships.",
            "review_date": "2012-10-21",
            "source": "rt"
        },
        {
            "content": "An emotionally powerful snapshot of divorce with career-orientated Ted Kramer (Dustin Hoffman) thrown into single parenthood when his mentally unstable wife Joanna (Meryl Steep) suddenly leaves to rediscover herself and, in turn, forces her husband to be the father to their son Billy (Justin Henry) that he's neglected to be. \n\nThe premise allows for a series of juicy scenes, most of which contain improvisation; every sequence book-ended by a fade to/from black is a moment of time over the course of an eighteen-month period. Sympathetic performances from Hoffman and Streep give this tale much depth, with Henry displaying the finest debut by a child since Tatum O'Neal in 'Paper Moon' (1973). \n\n'Kramer vs. Kramer' is a must-see.",
            "review_date": "2012-10-14",
            "source": "rt"
        },
        {
            "content": "Great old movie that still is pertinent today.",
            "review_date": "2012-10-14",
            "source": "rt"
        },
        {
            "content": "My Favorite Film Is 1941's Citizen Kane.",
            "review_date": "2012-10-05",
            "source": "rt"
        },
        {
            "content": "initially i watched it to see meryl streep but oh fuck....dustin hoffman and the kid ...bloody marvelous....... the movies adapts the most normal instances in life and creates it into somethin much much more amazing by still keeping that realistic factor all throughout the movie!!",
            "review_date": "2012-09-30",
            "source": "rt"
        },
        {
            "content": "There's never a dull moment in 'Kramer vs. Kramer,' which succeeds because it never picks sides or feels overly sentimental.",
            "review_date": "2012-09-29",
            "source": "rt"
        },
        {
            "content": "Absolutely  loved this movie. Great . Dustin Hoffman gives an incredible performance. Wow.",
            "review_date": "2012-09-27",
            "source": "rt"
        },
        {
            "content": "An important portrait of how divorce can turn everyone's life around... for better and worse.  Hoffman's performance as a career man learning to be a daddy is genuine and compassionate.",
            "review_date": "2012-09-23",
            "source": "rt"
        },
        {
            "content": "Very good. Dramatic movie that has its ups and downs on life itself.",
            "review_date": "2012-09-19",
            "source": "rt"
        },
        {
            "content": "Dustin Hoffman and Meryl Streep are on top form as two parents going through a divorce, and their battle for custody of their child. Both Heart breaking and heart warming in equal measure, this is a thoughtful and intelligent melodrama.",
            "review_date": "2012-09-17",
            "source": "rt"
        },
        {
            "content": "Great performance of Dustin Hoffman",
            "review_date": "2012-09-15",
            "source": "rt"
        }
    ]
}