{
    "rating": 9.3,
    "release_date": "1979-08-17",
    "num_reviews": 450,
    "genres": [
        "Comedy"
    ],
    "summary": "Brian Cohen (Graham Chapman) is an average young Jewish man, but through a series of ridiculous events, he gains a reputation as the Messiah. When he's not dodging his followers or being scolded by his shrill mother (Terry Jones), the hapless Brian has to contend with the pompous Pontius Pilate (Michael Palin) and acronym-obsessed members of a separatist movement. Rife with Monty Python's signature absurdity, the tale finds Brian's life paralleling Biblical lore, albeit with many more laughs.",
    "reviews": [
        {
            "content": "always look on the bright side of life",
            "review_date": "2023-02-26",
            "source": "rt"
        },
        {
            "content": "The funniest movie I've ever seen. It is funnier than some of the comedy that we currently watch. He's not the Masiah, he's a really wicked lad, was one of the lines that had me laugh the most throughout the entire movie. Each of the characters is humorous in their own unique manner. This is by far the best Python, surpassing the holy grail, as I stated in the title, and that also had me in fits of laughter. The finest part of the scene is when Brian looks out his window and notices a large gathering waiting for him because they believe he is the Masiah despite his repeated denials.",
            "review_date": "2023-02-16",
            "source": "rt"
        },
        {
            "content": "For me its the greatest comedy film of all time. Infinitely requotable and utterly hilarious. As close to genius as has ever been committed to film and most probably ever will be given that you really couldn't make this today (not that given its lengthy ban in many countries you could even back then either). I adore this film. My life literally wouldn't have been the same without it.",
            "review_date": "2023-01-13",
            "source": "rt"
        },
        {
            "content": "Probably one of the best movies of all time its super funny, and honestly I cant say anything negative about it.",
            "review_date": "2022-12-27",
            "source": "rt"
        },
        {
            "content": "Insufferable piece of cinema with two chuckles or three.",
            "review_date": "2022-12-12",
            "source": "rt"
        },
        {
            "content": "It has its own brand of humor, that while absurd is still funny, and honestly even refreshing to return to. They get a lot of milage out of the setting, and they use it to come up with some rather creative running gags. It's a good laugh, go watch it.",
            "review_date": "2022-12-11",
            "source": "rt"
        },
        {
            "content": "It is pretty standard Monty Python stuff.  It is a bit dated stylistically, but the material is TOTALLY on point even today (I am a woman and I want to have a baby, etc).  The writing is indeed quite brilliant, although a lot of the humor is lost in the falsetto and thick English brogue.",
            "review_date": "2022-12-02",
            "source": "rt"
        },
        {
            "content": "A magnificent comedy with incredible production design. The decision to film it in Monastir, Tunisia is also perfect. Full of great characters and a timeless theme song, this is definitely one of our best comedy films!",
            "review_date": "2022-11-21",
            "source": "rt"
        },
        {
            "content": "It's brilliant!  I watched the 4 part critique made against it on YouTube (from about 1979) and those offended were clearly closed minded!  As you watch the film, it is clear that insult to Jesus is neither real or implied!  Rather, the mockery is of those who don't quite hear or absorb Jesus' message quite correctly.  The message of the movie is one all Christians should attend to today…be critical in what you believe.  Have faith, but let reason guide you as well.  In the end, just always look on the bright side of life!!",
            "review_date": "2022-10-19",
            "source": "rt"
        },
        {
            "content": "A little disappointing, some good laughs mixed in, but well below Holy Grail levels.",
            "review_date": "2022-09-15",
            "source": "rt"
        },
        {
            "content": "A very silly, eccentric/surreal type comedy watch from the Monty Python team, this is well worth a watch. Some scenes, I felt, worked better than others but there were enough funny moments to keep me entertained regardless. I particularly enjoyed the stoning scene and ones where John Cleese's character gets very wound up! (no change there then referencing Fawlty Towers et al). I also liked the over the top/shrill tone of voice used for some characters. Its silly and entertaining, with the usual Monty Python opening titles, with words in lumps of stone falling around and things. I'd recommend this film.",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "The Funniest film ever made.",
            "review_date": "2022-08-20",
            "source": "rt"
        },
        {
            "content": "Arguably Monty Python's best offering, Life of Brian is an often-hilarious satire that skewers religion and, more specifically, those who blindly fall for doctrines and dogma in order to give their life meaning.  While some of the humor misses the mark (the alien abduction seems pointless), there are a ton of laughs to be found as Brian (Graham Chapman) is anointed the Messiah and does what he can to avoid the inevitable crucifixion. Hi-lights include Pontius Pilate's (Michael Palin) awkward speech impediment and the rousing closing number ‘Always Look on the Bright Side of Life', sung by a toe-tapping choir nailed to crosses.  It'll certainly offend some, but that's a small price to pay for what remains a comedy classic.",
            "review_date": "2022-04-10",
            "source": "rt"
        },
        {
            "content": "There was a lot to like about \"Life of Brian\", but ultimately, it just didn't click with me.  I chuckled at a few jokes, and I really was impressed by the quality of the production, but I would never want to watch it again.  I give it a D, just don't bother.",
            "review_date": "2022-03-05",
            "source": "rt"
        },
        {
            "content": "Life of Brian is a great reminder that we always need to find ways to laugh at ourselves. From beginning to end this movie delivers plenty of laughs and enjoyment for anyone who is willing to take a step back and find the humor found within ourselves. Does this movie care about offending you? Of course not! That's why even today it's more important than ever to really appreciate the message that this film conveys, look on the bright side and have a laugh! Put some time aside and watch this classic you won't be able to stop smiling from beginning to end! I give Life of Brian a 10/10.",
            "review_date": "2022-02-19",
            "source": "rt"
        },
        {
            "content": "This is pure magic. And this is great humor. Monty Python really is real, real humor.",
            "review_date": "2022-02-08",
            "source": "rt"
        },
        {
            "content": "I definitely prefer this to Holy Grail, possibly because the jokes just land better and are less known and quoted.  Idunno, it's 40+ years old, who's to say why I like it more.  One thing I like about this is that is shows you don't have to be so serious making films that jab the establishment.  Also, I definitely think people familiar with the Holy Bible will definitely ‘get it' more than people with no real knowledge of the Holy Bible and it's contents.",
            "review_date": "2022-01-23",
            "source": "rt"
        },
        {
            "content": "\"Some things in life are bad\nThey can really make you mad\nOther things just make you swear and curse\nWhen you're chewing on life's gristle\nDon't grumble, give a whistle\nAnd this'll help things turn out for the best\nAnd\nAlways look on the bright side of life\nAlways look on the light side of life\"\n-\nMonty Python and The Holy Grail was a blast to watch in all its low-budget absurd hilarity and I was in the mood for something similar so I decided to give their subsequent outing a shot and it turned out to be another hysterical watch of Biblical proportions. \n-\nMonty Python's Life of Brian is about, well, the life of Brian. A fella born around the same night as Jesus where The Three Wise Men mistakenly enter his abode and thus start a whole series of events that will eventually make Brian the Messiah, much to his dismay. \n-\nSet in Jerusalem under Roman rule, the movie pokes fun at whatever it can find in that setting in the usual Monty Python fashion and Religion is at the centre of it. Whether it's religious fanatics, mob mentality, self-proclaimed prophets, living under foreign rule, rebellious groups, politics, etc it's all thrown into a pot with a layer of cleverness, a dab of absurdness, and a thick dose of exaggerated comedic chops, resulting in a non-stop hilarious romp that will have you in stitches. \n-\nOne of my favourite scenes was the entire Biggus Dickus bit. You just turn into one of the soldiers who just can't hold it in. And of course, the wonderful closing of the film via the song \"Always look on the bright side of life\" being sung by the Crucifixion party... how can one not love it. Wonderful performances by the entire cast. \n-\nIf you can have an open mind and are not someone who gets easily offended, especially if you're the religious type, and have not watched this movie yet, I'd highly recommend it. It will certainly lighten up your day/night and your life a tad bit henceforth. Hard for me to say whether I enjoy this one more or The Holy Grail without having rewatched either of them so for now, they are equal in my eyes. And if I were to rate it, I'd give it a solid 8/10.",
            "review_date": "2021-11-08",
            "source": "rt"
        },
        {
            "content": "Just as uproariously funny as Holy Grail, if not funnier, Life of Brian offers an equal helping of memorable skits, immensely quotable dialogue, great comedic timing from everybody involved and even a catchy little ending musical number, helping to further cement Monty Python as bringing out the best, when it comes to British humour. Yes indeed, this religious comedy is very much NOT overrated. REJOICE!",
            "review_date": "2021-10-01",
            "source": "rt"
        },
        {
            "content": "funniest movie i have ever seen",
            "review_date": "2021-09-20",
            "source": "rt"
        },
        {
            "content": "hahahahahahahahahahahahahahaha marvellous",
            "review_date": "2021-09-17",
            "source": "rt"
        },
        {
            "content": "Monty Python's Life of Brian is irreverently funny. This film dances awfully close to the border of blasphemy, yet it never quite crosses that line. Some of the jokes go on a little too long, and some of the humor is in bad taste, but I laughed more than I thought I would. Even though Monty Python and the Holy Grail is still my favorite, I was pleasantly surprised by Life of Brian.",
            "review_date": "2021-09-01",
            "source": "rt"
        },
        {
            "content": "Except for the funny stoning scene toward the beginning, and the song at the end, everything else in the movie misfires. Yes, the idea is that another man (Brian) is mistaken for the Messiah-but the story's big flaw is that the real Messiah is already present, briefly shown giving a sermon to a crowd. On top of that, there is nothing about Brian that would convince anyone he was the Messiah; he doesn't even pretend to be one. This gives the whole movie a contrived atmosphere.\n\nThe other scenes are hardly funny either. The Jews who plot against the Romans ask what the Roman occupiers have done for them, and as the scene goes on, the speaker amasses a list of benefits brought by the Romans. In a way, this glorifies colonialism and fails to explain why natives invariably come to despise their occupiers. There were plenty of reasons for the Jews to hate the Romans, but that is hardly brought up. Also, other jokes such as \"Biggus Dickus\" and Pontius Pilate not being able to say the letter \"R\" are juvenile without being funny.\n\n\"Monty Python and the Holy Grail\" was much better because it was clever; this movie perhaps tried to be meaningful and simply blew it.",
            "review_date": "2021-08-25",
            "source": "rt"
        },
        {
            "content": "A huge disappointment. The concept seemed ripe for irreverent and witty commentary on religion, but instead we get tired jokes about speech impediments.",
            "review_date": "2021-08-14",
            "source": "rt"
        },
        {
            "content": "I'd always get irritated watching Python with Dad growing up because there are a lot of Biblical references I didn't get because he gave up on being a Christian when they found the drunk priest dead in the snow at his Catholic College. He went from Spiritual major to Physics, which is great, but it doesn't train your daughter to get religious jokes, nor do well in her lit classes, because every other stoner around her is like (points at book) \"This is SOOOO Jesus...\" and she only know what some clowns did to Jesus, so it doesn't click with her like that.\n\nThis one is important because you can contextualize it now in a time where John Cleese has been on social media and is practicing both getting pummeled by stones and throwing them while being in a glass house. In the scene \"Stoned to Death\" where an old man is held for saying Jehovah, it might as well be Cleese on social media speaking to the old man of himself in time, berating the hostage, berating the audience, and eventually taking a good beating himself. It's a great Meme for everyone to frolic in, as it holds up as not only an accurate metaphor of these spiritual times, but of the actor who played in their creation.\n\nAs with any Monty Python, I'm sure we have some brownface in this one, so if you are opposed to all that, don't watch. To bring in other spiritual myths to this Messianic comedy, there is a story about Krishna (the black God) complaining his consort Radha* is too light skinned, so he playfully paints her skin black. There are lots of bad spiritual myths we can give weight to in any literary form, but, I feel like that's a pretty great story to keep the play of theatre alive without celebrating racist constructs. Hindu myths are wonderful for freeing many restrictive notions, and if you ever want an excuse for your behavior, there's a million myths breaking that psychology down for you with avatars of deity. \n\n*RADA, Royal Academy of Dramatic Art, London",
            "review_date": "2021-06-15",
            "source": "rt"
        },
        {
            "content": "Weirdly wonderful; better than its predecessor too.",
            "review_date": "2021-05-03",
            "source": "rt"
        },
        {
            "content": "Minus one star for the transphobia (thanks, John Cleese).  Other than that, pretty damn brilliant.",
            "review_date": "2021-04-24",
            "source": "rt"
        },
        {
            "content": "The funniest movie, and most potent satire, ever made!",
            "review_date": "2021-04-12",
            "source": "rt"
        },
        {
            "content": "I can't think of a more brilliantly written, executed and insightful comedy. It is a MUST SEE.",
            "review_date": "2021-04-05",
            "source": "rt"
        },
        {
            "content": "The best Thing of Monty Python ever.",
            "review_date": "2021-03-23",
            "source": "rt"
        },
        {
            "content": "This is what people Monty Python's crowning achievement? I don't think so! The idea of a parody of the life of Jesus is brilliant, but very risky. And while I can't say that this movie is offensive to religion, it's certainly not a fun experience nonetheless. Where do I even begin with this? How many jokes do you remember from Holy Grail in contrast to Life of Brian? Most of the jokes in this movie drag on for minutes at a time, only to build up to an anticlimactic or nonsensical punchline that you'll forget about in a week. Things like the stoning and wall writing scene work because they have tons of jokes working together into one, those are ones that I genuinely love and recognize. \"So this movie has bad jokes. Ok, what about the story?\" What story? Nothing about this movie is cohesive, it tells the simple story of Brian and his rebelious resistance to the Romans, but even that is sort of pushed on the side so that he can have sex with his girlfriend and then be crossed later on. The rest of the film is a bunch of side characters doing random stuff that doesn't matter to the plot. Speaking of which, what am I supposed to feel for these characters? Brian is innocent enough to be likable and Pontius Pilate and the guardians are fun, but Brian's girlfriend, his mother, the prison workers, what do any of these characters serve other than being devices to stop the plot? Even the set design looks wrong. I mean, it looks amazing and realistic, but does that work to the film's advantage? What gives Holy Grail that silly feeling is its low budget and rediculous effects, just by looking at frames of that film, you could tell it's not supposed to be taken seriously. But you know what? I could forgive this movie for *trying* to be funny, or at the very least being any good, that is until it suddenly decides to get ronchy and literally shove naked dicks in my face. Wow, that is a nice way of showing respect to Graham Chapman(!) What am I supposed to think of this? There is so much nudity, gross out, and these pointless and uncomfortable transgender innuendos. There is a difference between giving your movie and R-rating because it fits the tone and making your audience feel sick to their stomach because you think it's funny, which it isn't. \n\nI wanted to say that I don't hate this movie, but the more that I think about it, the more I realise that I actually do. That is a statement one would only expect from non-fans of Monty Python, but that is not what I am, I love these guys and their films are easily the best thing they've done. But Life of Brian is the only one that I would genuinely thumb down hard",
            "review_date": "2021-03-18",
            "source": "rt"
        },
        {
            "content": "Greatest comedy film of all time and I'm one who's not keen on Monty Pythons Flying Circus.\nEven with its absurdity It's far more believable than the story that it spoofs.",
            "review_date": "2021-03-13",
            "source": "rt"
        },
        {
            "content": "Amazing Monty Python movie on Netflix. At least it had a proper ending! ",
            "review_date": "2021-02-05",
            "source": "rt"
        },
        {
            "content": "Ground breaking satire, highly innovative and funny for its time.",
            "review_date": "2021-01-31",
            "source": "rt"
        },
        {
            "content": "One of the greatest and most important films of all time. The one that EMI Films rejected just days before production start in fear of offending christianity, but was saved and funded by George Harrison, who mortgaged his house to do so. We are forever greatful, George! A grand but perhaps unexpected contribution to the promotion of the film was the ridiculous and then ongoing blasphemy accusations and following debate. Ireland banned it for eight years, and in Sweden they used the marketing slogan 'So funny it's banned in Norway'. Monthy Python and all fans should be thankful to so many.\nThis cinematic stroke of genius can and should be seen again and again, as it only gets better, and grows on you to absorb all the hilarious scenes and religious philosophical and political facest. It's hard to think of any other film providing so much to general philosophy in such a funny manner. The song 'Always Look On The Bright Side Of Life', has become one of the most recognized, and is said to be the most frequent at British funerals. To describe Monty Python's Life Of Brian, timeless and unique are just two of many compliments required.",
            "review_date": "2021-01-23",
            "source": "rt"
        },
        {
            "content": "Life of Brian is a masterfully classical work of satire, ringing a resounding truth across the grainy-resoluted landscape, and all those that set eyes upon it. It is a non-stop laughing affair that isn't afraid to reflect the utter silliness that is present at the centre of some of society's most treasured schools of thought. They really are masters of their craft ---- and superior to the greater majority of cinema's most biting satirists and social commentators.\nIroh's grade: A-",
            "review_date": "2021-01-01",
            "source": "rt"
        },
        {
            "content": "Humor wears off during the middle and afterwards looks forced with a desire to quickly end the film.",
            "review_date": "2020-12-18",
            "source": "rt"
        },
        {
            "content": "It's good, but it's so overrated it makes me hate it.",
            "review_date": "2020-11-26",
            "source": "rt"
        },
        {
            "content": "The life of Brian is an amazing movie, all be it with some crude humour thrown in, here and there. The ending was also, what I believe to be somewhat unorthodox when compared to others, as the protagonist supposedly dies at the end, along with a spectacular music number. Truly, this movie has aged like a fine wine, and I'd recommend others watch it too.",
            "review_date": "2020-11-13",
            "source": "rt"
        },
        {
            "content": "Life Of Brian is proof that not every satire is automatically good. It's a very good satire, but it's flaw is the story. It's jokes are super long (which also sometimes ruins the joke) and it runs out of time for tell you what is happening, what makes everything has to be solved very quickly, for example (spoiler), the relationship between Brian and Judith happens out of nowhere. And the ending hasn't got any sense, the message of that music hasn't got anything to do with the movie! Life Of Brian can make you laugh, but it can also confuse you and make you ask WTF is happening. (Sorry if I wrote something wrong, I'm Argentinian).",
            "review_date": "2020-10-25",
            "source": "rt"
        },
        {
            "content": "I know so many people who came for the satiric take on religion but stayed for the satiric take on radical left politics. Still holds up!",
            "review_date": "2020-08-28",
            "source": "rt"
        },
        {
            "content": "This film simply does not get old. Every time you watch it there is something new to make you laugh. Possibly the funniest film ever made.",
            "review_date": "2020-08-28",
            "source": "rt"
        },
        {
            "content": "Brian 10:5 Alright, I am the Messiah, now fuck off",
            "review_date": "2020-08-23",
            "source": "rt"
        },
        {
            "content": "This is one of the greatest films ever made. \n\nThe comedy is perfect. The absurdity, the black comedy, the skits, the camerawork, the acting of everyone in it, everything. If you don't laugh at some point while watching it you're basically dead inside. Its score on RT shows just how many people respect it.",
            "review_date": "2020-08-18",
            "source": "rt"
        },
        {
            "content": "Another of Monty Python's excellent comedy movies, in this one a young man, Brian, is born on the same day and in the stable next door to Jesus Christ, who spends his life being mistaken for a messiah and having several misadventures while trying to get rid of his followers. Every scene is as comical as it can get and it really is laughter-inducing with all its irreverence and absurdity. It is a must-see and I am sorry it led to controversial blasphemy accusations in the past. Some people do not know how to react to this kind of humor. This is a British masterpiece and a really memorable adventure.",
            "review_date": "2020-08-17",
            "source": "rt"
        },
        {
            "content": "The Monty python troupe may have little filmography, but they really pack everything they got into a film that's tolerable for audiences of any faith yet takes chances with its self aware humor.",
            "review_date": "2020-08-11",
            "source": "rt"
        },
        {
            "content": "Despite not being as quotable as \"Monty Python and the Holy Grail\", \"Life of Brian\" is as fresh and hilarious as a satire can get, with powerful mockery that is still relevant to this day, while keeping the irrelevant and random humour that has alway characterized the Monty Pythons",
            "review_date": "2020-07-10",
            "source": "rt"
        },
        {
            "content": "\"Romans they go the house?\"",
            "review_date": "2020-07-10",
            "source": "rt"
        },
        {
            "content": "Its themes and subject matter are still very controversial, but it's actually a clever satire and commentary on religion and both the historic drama and comedy genres. Its hilarious performances and clever jokes make it an undeniable comedy cult classic, that might not be for everyone's taste, but it's very intelligent in its satire and comedy.",
            "review_date": "2020-07-10",
            "source": "rt"
        },
        {
            "content": "Ousado e inteligente\nA vida de Brian é uma comédia bem escrita e que zomba e satiriza dogmas religiosos\nSe tornando um dos meus filmes de comédias favoritos",
            "review_date": "2020-07-07",
            "source": "rt"
        },
        {
            "content": "Life of Brian somewhat lacked the surreality of the previous Monty Python installments, rendering it less funny than its counterparts.",
            "review_date": "2020-06-23",
            "source": "rt"
        },
        {
            "content": "Absolutely one of the greatest comedy movies of all time. Though thoroughly irreverent it clearly means no harm and is simply great fun.",
            "review_date": "2020-06-18",
            "source": "rt"
        },
        {
            "content": "Hit and miss comedy, but the hits are BIG hits!  This movie contains some of the funniest scenes ever put to film.  I will never forget the first time I watched the \"Biggus Dickus\" scene--I was with my Dad and my brothers, and we all laughed so hard we thought we were gonna pass out.  The opening scene with the three wise men also had us all on the floor,  as did the stoning scene.  (\"Jehovah, Jehovah, Jehovah!!!\")  Almost every scene is at least mildly amusing, and the only one that truly falls flat is the spaceship gag.  But \"Life of Brian\" is certainly not for everyone--I'm sure there are plenty of uptight Christian types out there who were highly offended by some of the content!!!",
            "review_date": "2020-06-16",
            "source": "rt"
        },
        {
            "content": "Very good Monty Python film. Comedy at its finest.",
            "review_date": "2020-06-13",
            "source": "rt"
        },
        {
            "content": "Classic! \n\nThe humor doesn't age too well, but as long as you make sure you watch it before 1995 you should be safe!",
            "review_date": "2020-06-12",
            "source": "rt"
        },
        {
            "content": "Favourite film.\nHilarious. I watch it every year the morning after Nittel Nacht when there's nothing open and the media is jammed packed of xmas.",
            "review_date": "2020-06-11",
            "source": "rt"
        },
        {
            "content": "Only the Monty Python gang could come up with the idea of replacing Jesus with some dude named Brian and make it work. Filled with shots at religious dogma, this film satires the most sacred beliefs and does it wonderfully.",
            "review_date": "2020-06-03",
            "source": "rt"
        },
        {
            "content": "A classic movie that has some really good laughs. I couldn't get into it like most.",
            "review_date": "2020-05-17",
            "source": "rt"
        },
        {
            "content": "This is a hilarious retelling and satire of the story of Jesus. Although not as funny as The Holy Grial, it got many laughs out of me.",
            "review_date": "2020-05-11",
            "source": "rt"
        },
        {
            "content": "If this doesn't make you laugh at least once then you are inhuman",
            "review_date": "2020-05-06",
            "source": "rt"
        },
        {
            "content": "Not the best of the Python films, but a silver entry among the gold.",
            "review_date": "2020-05-01",
            "source": "rt"
        },
        {
            "content": "Life of Brian is another overrated Monty Python movie. Some scenes are undeniably funny and memorable, but most of the movie brushed aside its important themes in favor of crude, childish word puns and curses that never appealed to me personally. The movie is undeniably original, but only sporadically did I find it truly good and funny. Most of it felt forced, annoying and overly exaggerated.",
            "review_date": "2020-04-30",
            "source": "rt"
        },
        {
            "content": "I may be religious, but it's perfectly fine to joke about religion as long as it's all in good fun, as it is here. There isn't any hateful prejudices here against people who are religious, and it doesn't say that it's right and you're wrong, it's just a silly comedy with some potentially offensive material. (I mean, it doesn't take itself that seriously. And it definitely isn't aiming for historical accuracy.) Just chill.",
            "review_date": "2020-04-21",
            "source": "rt"
        },
        {
            "content": "The Life of Brian is simply genius.",
            "review_date": "2020-04-18",
            "source": "rt"
        },
        {
            "content": "This British comedy classic was pretty funny. Graham Chapman, John Cleese, Eric Idle, Terry Gilliam, Michael Palin, and the rest of the cast did a great job in this movie. The plot to the movie was pretty funny, but not as funny as Holy Grail. There were some moments in the movie where the humor was pretty dull, but overall it was a funny movie. I would recommend this movie to anyone. You probably would enjoy it.",
            "review_date": "2020-04-14",
            "source": "rt"
        },
        {
            "content": "Top three comedies of all time, and one of the other two is Holy Grail. Scene after gut-busting scene of over the top, punishing satire aimed at the silliness of religious and also just plain absurd human behavior. It's scathing but somehow nice as well. Typical good-humored yet subversive Python fare, The Beatles of comedy. Through the whole film, Brian is a good guy. Graham Chapman plays the lead role so honestly, I'm surprised he wasn't nominated for all kinds of awards. He's flat out brilliant, best straight man ever (tell the other Pythons that and see what they say). It's a mad romp, as one would expect of anything Python, but it has real heart. My two favorite comedy scenes of all time are Biggus Dickus and Palin's mad preacher scene. I have to watch them both at least once a month to get my fix. I beseeched my father to go see it, and he came back saying it was the funniest thing he'd ever seen. Started quoting it. We all know how that goes.",
            "review_date": "2020-03-28",
            "source": "rt"
        },
        {
            "content": "Best and most influential movie ever made!!! FULL STOP.\n\nIf you don't stop to question your belief in anything whatsoever, then..... probably no words could ever possibly assist you to navigate through this thing called life.",
            "review_date": "2020-03-18",
            "source": "rt"
        },
        {
            "content": "\"This calls for immediate discussion!\" Picking a favorite between this & Holy Grail is a fool's game. I SLIGHTLY prefer Grail, though I don't feel great about it. The main difference between the 2 is that while Grail is an impeccable collection of medieval comedy sketches, Brian is an actual movie. While admirable, that plotting is what provides the few issues (editing, pacing). Still, it's insanely funny; \"always look on the bright side\" ending is one of the greatest pieces of filmed comedy ever.",
            "review_date": "2020-03-06",
            "source": "rt"
        },
        {
            "content": "For a lot of the movie it's really not even a send up of religion, more a perfect send up of British culture, from everything to school teachers, to market sellers, to political parties, to crowds listening to a speech from the back. It's so perfectly naturally British sounding, the observational comedy masked in satire is absolutely the best there is; influential and timeless, the core actors are still, without question, some of the best performers Britain has ever had. It's got a terrible sound mix and it's very shouty but it manages to make what is essentially silliness and several clever sketch ideas into an actual cohesive structure and narrative. It's a blueprint and still a perfect example of what British comedy satire can do.",
            "review_date": "2020-02-14",
            "source": "rt"
        },
        {
            "content": "Nearly as profound as it is utterly profane, and just a tad more silly than it is acerbically satirical, Python's parody of the paschal mystery ridicules not so much religion itself but organized religiosity, revealing fundamentalist zealots of all stripes—Roman, revolutionary, righteous—to be just as zany and unzenlike as any of the group's other subjects.\n\nRIP Terry Jones",
            "review_date": "2020-01-26",
            "source": "rt"
        },
        {
            "content": "I now declare myself a Brianite.  Blessed are the cheesemakers.",
            "review_date": "2019-12-23",
            "source": "rt"
        },
        {
            "content": "Because it so loudly cuts against the trappings of today's \"cancel culture,\" 1979's \"Monty Python's Life of Brian\" arguably now stands as the comedy troupe's most distinguished masterpiece. Filmed in Tunisia while repurposing sets from \"Jesus of Nazareth,\" this film is perched among the top branches of our very greatest satires. There's no doubt its brilliant fingerprints are all over more modern day parodies and spoofs, from the culturally eviscerating \"South Park: Bigger, Longer, and Uncut,\" to fellow religious farce \"Sausage Party,\" to recent and raunchy music industry satire \"Stadium Anthems.\"\n\nAnd the film almost didn't happen. Beatle George Harrison had to dole out millions to save it after the studio pulled out over fears of backlash. Good on you, George, because what resulted is nothing short of a landmark achievement in comedy. While \"Life of Brian\" has all the elite DNA of typical Python, it elevates with an ending for the ages, as the crucifixion itself is repurposed as musical comedy of gleefully poor taste. A choir of convicts nailed into wooden slabs breaks out in song with \"Always Look On The Bright Side of Life,\" cementing the scene as a culturally understood reference point throughout Britain, and in much the same way that \"this goes to eleven\" from \"[link=tt0088258]\" is established nomenclature in the States.\n\nSadly, this movie couldn't be made today, as the use of superficially insensitive comedic material to lambaste ignorance has somehow become verboten. What a shame, that. Fortunately, \"Monty Python's Life of Brian\" wasn't a stage production, and instead remains immortalized on film for the weathering of all shifts in the cultural winds.\n-\nWATCHED IT? THEN WATCHLIST:\n\"Sausage Party,\" \"Stadium Anthems,\" \"South Park: Bigger, Longer, and Uncut\"",
            "review_date": "2019-12-11",
            "source": "rt"
        },
        {
            "content": "This movie is very funny, but the film is clever with its ideas even beyond comedy and that's what I adore about it.",
            "review_date": "2019-10-24",
            "source": "rt"
        },
        {
            "content": "\"Life of Brian\" is a consistently funny and very satirical classic comedy that holds up pretty well. I found myself smiling throughout this movie and even laughing out loud quite often. The movie is a reminder that parody movies truly used to be great at one point. Some of the jokes didn't hit as hard as others, but the movie knows its goofy and is a lot of fun. I think if you're a fan of this brand of silly yet also very entertaining humor, you definitely have to check this movie out. It's one of the better older comedies that I have seen so far.",
            "review_date": "2019-10-18",
            "source": "rt"
        },
        {
            "content": "Monty Python always has sat writing in everything. The lines are delivered well and are funny. This satire works for what it was trying to accomplish. ",
            "review_date": "2019-09-26",
            "source": "rt"
        },
        {
            "content": "Critics argue its the greatest comedy of all time. I watched it and thought it was so funny from beginning to end. \nIt's actually one of the more successful parodies of the 1970s with its brand of religious comedy.\nWe are all familiar with Jesus of Nazareth and the 3 Wise Men. But this movie has a twist of its own.\nWhat if a non Jesus character didn't want to be the messiah? This Brian individual wants to be a part of the movement against the Romans yet he gets more than he bargained for. \nHis mother doesn't want him to be anything else or to think about mingling with the opposite gender.\nMonty Python has a knack for comedy as well as casting British talents like Eric Idle and John Cleese. Everyone in 33 AD talks funny, has amusing mannerisms, and different approaches when it comes to believing in the divine. If there's another movie lampooning religious fanaticism by making you laugh I doubt you can find one better than this.\nEven we have to laugh at our own beliefs on occasion from another perspective.\n\n",
            "review_date": "2019-08-18",
            "source": "rt"
        },
        {
            "content": "Subversive, hilarious...what more could you want?",
            "review_date": "2019-08-11",
            "source": "rt"
        },
        {
            "content": "Deliberately blasphemous and provocative, but also hilarious Monty Python comedy, probably the team's most coherent feature concerning plot and theme.",
            "review_date": "2019-07-14",
            "source": "rt"
        },
        {
            "content": "Uma excelente sátira ",
            "review_date": "2019-06-14",
            "source": "rt"
        },
        {
            "content": "Excellent and stands the test of time.",
            "review_date": "2019-06-09",
            "source": "rt"
        },
        {
            "content": "One of the Best comedy movies in history. As simple as that.",
            "review_date": "2019-05-16",
            "source": "rt"
        },
        {
            "content": "Good to see this bundle of fun again on the big screen on its 40th birthday. It holds up pretty well and much of the satire is relevant today. The viewing came with a goody bag â\" who could resist the false beard?",
            "review_date": "2019-05-16",
            "source": "rt"
        },
        {
            "content": "Good but The Holy Grail holds up better.",
            "review_date": "2019-05-03",
            "source": "rt"
        },
        {
            "content": "This may be the best comedy ever made. It ripped Catholicism and Judaism equally which was important. One of the days when I am at Mass, I am going to take of my sandal and yell \" It's the sign of the shoe\".",
            "review_date": "2019-04-29",
            "source": "rt"
        },
        {
            "content": "an absolute CLASSIC. we stan monty python. ",
            "review_date": "2019-04-21",
            "source": "rt"
        },
        {
            "content": "An Easter tradition in my home!",
            "review_date": "2019-04-21",
            "source": "rt"
        },
        {
            "content": "So great, funny, witty and awesome. Brain required. ",
            "review_date": "2019-04-21",
            "source": "rt"
        },
        {
            "content": "\" If you have enjoyed this film,\nwhy not go and see \"La Notte\"? \"\n\nThanks for your recommendation, Monty Python! I've just seen it yesterday.\n\nI mean, I knew that this film is ahead of its time, but this is too much!\n\nAnyway, whilst the humor here didn't always work; there are many repetitive, overlong gags, and the jokes, especially in the first act, aren't as sharp and clever as those of The Holy Grail, for me, Life of Brian is just as, if not even more enjoyable and amusing than The Holy Grail, largely because it has a cohesive narrative structure instead of a series of sketches, the thing that made even the lamest and dumbest jokes fairly passable, and completely inoffensive.\n\n(9/10)",
            "review_date": "2019-03-30",
            "source": "rt"
        },
        {
            "content": "A true masterpiece of comedy.",
            "review_date": "2019-03-25",
            "source": "rt"
        },
        {
            "content": "One of my all time favorite movies",
            "review_date": "2019-03-15",
            "source": "rt"
        },
        {
            "content": "Some of the best parts about this movie, are that what was once considered satirical humor in this movie. Became reality in this modern times.",
            "review_date": "2019-03-15",
            "source": "rt"
        },
        {
            "content": "very funny , everything you want in a python film, and yes even I have a very good friend named...biggus dickus..hes got a wife you know",
            "review_date": "2019-03-04",
            "source": "rt"
        },
        {
            "content": "Hilarious, absurd, fast paced and just everything that made The Holy Grail great. \nThis film is peak absurdist comedy and one of the best parody's I've seen in my life.\n9/10",
            "review_date": "2019-02-27",
            "source": "rt"
        },
        {
            "content": "Life of Brian is a hearty iconic British comedy that was well ahead of its time. Very witty, daring and rewatchable, many see it as a contender for Python's best film. This one always make you look on the bright side...",
            "review_date": "2019-02-19",
            "source": "rt"
        },
        {
            "content": "Funny, witty, crass, and controversial. This is Monty Python at their finest. ",
            "review_date": "2019-02-18",
            "source": "rt"
        },
        {
            "content": "My favorite comedy of all time. The Biggus Dickus joke alone is worth the price of admission, although John Cleese giving a Latin lesson is a close second. Hilarious, but also intelligent, topical and scathing on a variety of subjects.",
            "review_date": "2019-01-06",
            "source": "rt"
        },
        {
            "content": "Superbly clever and incredibly funny comedy from the Monty Python team.",
            "review_date": "2018-11-20",
            "source": "rt"
        },
        {
            "content": "Life of Brian es un intento divertido y inteligente de crear una satira religiosa, pero por mas que sus recurrencias estupidas la intenten salvar realmente este film es bastante aburrido, es una propuesta distinta a la cual se le debe grandes cosas pero realmente no tiene nada de divertido ni entretenido, como propuesta es una gran obra pero como film es un intento fallido.",
            "review_date": "2018-11-19",
            "source": "rt"
        },
        {
            "content": "Monty Python created another successful cult classic after Holy Grail. Many will argue this is a better film but i find both films are clever and successful in their own way. Life of Brian is definitely the more commerical of the two films and was more successful at the box office, the topic was definitely ahead of its time. I wish they would create more films like the Life of Brian, sketch comedy is very hard to do and Monty Python make it look so easy. The classic conclusion showcases how original Monty Python were. This is easily one of the greatest comedies ever created, it is topical and original and would serve modern filmmakers a template on how to create something truly wonderful and memorable. A must see.",
            "review_date": "2018-11-06",
            "source": "rt"
        },
        {
            "content": "Religious satire? Blasphemy? Classic comedy? \"Life of Brian\" has it all.",
            "review_date": "2018-11-01",
            "source": "rt"
        },
        {
            "content": "Yet another hilarious work from Monty Python",
            "review_date": "2018-10-24",
            "source": "rt"
        },
        {
            "content": "Monty Python's Life of Brian (1979)\t5 stars\nThe Christian church has done itself few favours in the past by the way in which it has responded to film, and by extension popular culture as a whole. Instead of using the popularity of a particular hot potato as a means to start a conversation - whether it be horror films, violent video games or tabletop RPGs - the default response of at least some aspects of the church has been one of puritanical opposition with no room for counter-argument. And this is not an attitude which is confined to the age of Mary Whitehouse: in August this year, the Christian Institute reported that Derby Cathedral was under fire for screening Don't Look Now, The Wicker Man and Monty Python's Life of Brian within its sacred walls.\n\nThe reaction to the latter in particular demonstrates just how far aspects of the church still have to go in understanding popular culture and bringing the gospel to those who consume it. Nearly 40 years on from its original release, many of my contemporaries would still hold that the film is blasphemous or disrespectful; some may even go so far as openly siding with Malcolm Muggeridge and the Bishop of Southwark in the almost unwatchable TV debate after its release. Needless to say, I count myself among the more discerning group of Christians who regard Life of Brian as a comedic and cinematic masterpiece, which manages to match Holy Grail for laughs and exceed it in intelligence.\n\nAt their 30th anniversary reunion back in 1998, the Pythons spoke at length about their intentions for the film. Their original remit, in the words of Eric Idle, had been to make \"Jesus Christ - Lust for Glory\", but when they read the gospels they found little in Jesus' teachings or actions which they could ridicule or belittle. Since there was little humour to be found in what Idle called \"good moral philosophy\", they changed tack and made a film about someone being mistaken for the messiah and how religions behave when left unchecked and unchallenged.  Terry Jones (who is an authority on the medieval church) put it this way: \"There was nothing funny about what Christ said, and what's funny really is the fact that Christ said all these really good things about 'love thy neighbour' and everything, and for the next 2,000 years people were killing each other and torturing each other because they can't quite decide how he said it.\"\n\nLife of Brian is not a blasphemous film: it is a film about blasphemy, and how a religion which claims to offer salvation for all can end up dividing people over the tiniest details. Speaking on YouTube recently, John Cleese opined that the central problem of any religion was the tendency of people to take literally what the founders of the religion intended to be metaphorical. In Life of Brian we see the kinds of schisms which have shaped the modern Christian landscape played out at rapid speed, with small and often innocent misunderstandings leading to deep divides as the movement races ahead of its level-headed (and in this case unintentional) founder. Christians may not like the comments it may make about how their church is organised, but a wise observer would see this not as blasphemy, but as constructive criticism from the very people that Christians should be attempting to reach.\n\nAs a send-up of both the contemporary church and its origins in the ancient world, Life of Brian is practically peerless. But even if you're not an offended believer or an ardent atheist looking for ammunition, the film is a brilliant study of the absurd behaviour that any form of organised belief tends to propagate. The film is as much a satire of religious groups as it is of political parties and pressure groups; the kind of conversations which the People's Front of Judea have are not a million miles from the dogma of Militant in the 1980s or certain corners of Momentum today. The intended uniformity of such groups (with all members working towards the same goal) is marred by the pettiness of the individuals therein, in what Sigmund Freud called \"the narcissism of small differences\". Such groups eventually come to exist only for the sake of supporting their own bureaucratic tendencies rather than changing people's lives for the better; instead of rescuing Brian, the PFJ just sits around passing motions about how it would be a good idea to help him.\n\nA common debate among Python fans centres around whether Life of Brian is funnier than Holy Grail (with The Meaning of Life usually seen as the runt of the litter). While Holy Grail has a higher hit-rate of jokes and lends itself more readily to meme culture, Life of Brian is the more intelligent of the two works and its humour is more sharp and refined. To a certain extent, this reflects the films' different production stories as much as it does the interests and talents of the performers. On Holy Grail, the Pythons didn't really know what they were doing; they wanted something more cinematic than And Now For Something Completely Different, but many of the greatest successes of that film came about through good fortune or budget limitations. With Life of Brian, the writing process was more agreeable, Jones had a singular voice as director, and the production was made easier thanks to Graham Chapman kicking his drinking problem.\n\nThat being said, Life of Brian is also part of a list of classic films which almost didn't get made. EMI, its main backer, pulled out days before filming was due to begin in Tunisia, concerned that the subject matter would put audiences off. The film only got made because former Beatle and long-time Python fan George Harrison put up the money; he mortgaged his house and set up HandMade Films, which would later produce and distribute the likes of The Long Good Friday, Time Bandits, Mona Lisa and Withnail & I. Harrison's generosity (described by Jones as \"the most anybody's ever paid for a cinema ticket in history\") not only helped to secure Life of Brian's future, it gave a platform to some of the most successful and culturally significant films that Britain produced in the 1980s.\n\nLike Holy Grail before it, Life of Brian is surprisingly cinematic given that its structure is a refinement of the Pythons' surreal, stream-of-consciousness approach to comedy. Many of the sets and locations were reused from Franco Zefferelli's TV epic Jesus of Nazareth, and the Pythons employed many of the same locals as extras. But because its subject matter has so much depth and subtlety, it feels at home on the big screen, with the large crowds of people involved feeling like part of a larger world rather than a mob rented to make up the numbers in a TV sketch. Gilliam's animations, which have become one of the TV show's most iconic elements, are reduced largely to the opening credits, but the sequences with the aliens allows at least some of his anarchic energy to slip through.\n\nThe script of Life of Brian is beautifully structured so that the plot unfolds naturally rather than simply hopping from one sketch to the next. Like Holy Grail, the film benefits by restricting the versatile Chapman to one role and having him serve as the audience's guide through the madness. But where Holy Grail's middle section saw people go their separate ways, playing to the other members' respective strengths, Life of Brian maintains a single focus throughout, making it a more solid narrative experience. Certain scenes still work very well on their own, such as the stoning sequence or the centurion giving Brian a Latin lesson (in a loving middle finger to the Pythons' school days). But all the little bits ends up flowing together seamlessly and skilfully, where The Meaning of Life felt much more picaresque.\n\nAs I've indicated previously, it's very hard to describe what makes a comedy funny without simply listing every joke. If you're a fan of intelligent skewering of authority, there is a wide range of scenes to choose from, from the scenes with the PFJ (which are as good as anything in Yes, Minister) to the broader but no less hilarious scenes with Biggus Dickus and Pontius Pilate. If you love eccentric characters whose words puncture egos and parody traditions, you've got everything from Michael Palin's moaning prisoner to Idle's haggler in the market. And if all you want is to howl with laughter at people who have the world against them, Chapman plays Brian splendidly (and there's also Spike Milligan's cameo as, ironically, the only sane person for miles around).\n\nThe performances in Life of Brian are absolutely top-notch. In addition to Chapman's controlled brilliance, Cleese continues to excel playing authority figures, proving that there are few better at playing people frustrated when things don't go how they had hoped. Palin is brilliant throughout, refusing to allow self-awareness to sneak into his Pilate and his executioner foreshadowing his excellent role in Gilliam's Brazil. Jones (who saves the film's most famous line for himself) is as good in drag as he is out of it, Idle alternates between chipper and chippy with ease, and while Gilliam is left to play the madman or the idiot, he does it so effortlessly that it is pointless to complain.\n\nMonty Python's Life of Brian is a terrific piece of work and arguably the finest achievement of all the Pythons' careers. Its longevity as a satire of religion and organised belief is matched only by the long shelf life of its jokes, which are still fresh, funny and richly constructed after nearly four decade. The performances are excellent, the music is witty and varied, and the visual sensibility can give both Jesus of Nazareth and The Gospel According to Matthew a run for their money. It is a towering achievement of British cinema, showing what intelligent comedy can achieve, and should be seen by anyone with even a fraction of an open mind.",
            "review_date": "2018-09-15",
            "source": "rt"
        },
        {
            "content": "Me superencanto esta pelicula. No dire nadamas solo que siguiendo con mi amor por el budismo y las sabias palabras de Sidartha. \nNUNCA SIGAS A NADIE SIGUETE A TI MISMO. \nVE EL LADO POSITIVO DE LA VIDA \nTantas cosas aqui que te ponen a pensar y esta en Netflix.\n\nI like this movie 4.5 of 5 stars.",
            "review_date": "2018-09-09",
            "source": "rt"
        },
        {
            "content": "An outstanding comedy/satire, so biting, it's hard, even impossible, to imagine it being done in the modern PC world. It's almost perfect, with every scene so filled up with laughter and absurd, I can re-watch some scenes endlessly, so are they to the point and executed flawlessly. And some of their satire is so true to our actual life now, it makes you wonder how could they know back then.",
            "review_date": "2018-09-04",
            "source": "rt"
        },
        {
            "content": "Holy Grail will always be my favorite but it's so hard to keep this from being #1. This is the best thing Python has ever done and that's saying a lot. It is absolutely brilliant, not sacrilegious and has something very important to say. A message that is just as important today. Think for yourself and... Always look on the bright side of life!",
            "review_date": "2018-08-27",
            "source": "rt"
        },
        {
            "content": "It’s always tough when a filmmaker peaks in one of their first outings, and I’m afraid that’s what happened with Monty Python. Once they hit the lofty heights of The Holy Grail it was all downhill. Life of Brian is their first film after Holy Grail, and it is easily their most direct attempt at recapturing the magic. Once again they take some historical and biblical stories, and try to find the humor inherent in those tales. There are some successful moments where I laughed. I quite liked the Latin grammar scene, and a few of the scenes with the People’s Front of Judea. One of the things that Monty Python knows how to do better than most comedians is a solid running gag, and there are quite a few that are carried throughout Life of Brian that work great. They also have a tendency to fight for a laugh even when a gag isn’t the funniest in the world. Sometimes that works because they hold on a joke so long that eventually I find myself chuckling at it, but other times it’s a tedious slog until they get on with it. I think where I have the biggest struggle with Life of Brian is the fact that it clings to the narrative too much. Ordinarily I would prefer a strong narrative in any film, but Monty Python’s bread-and-butter is in sketch comedy and then finding ways to loosely link those sketches together. It feels like this film was created by forming the plot first, and then building sketches into that plot. There are several sections of the film that fall flat, like the lisping Pontius Pilate, and I start to think they felt the scene needed to be there and they were simply searching for a way to make that scene humorous. None of this ruins the film, or makes it unwatchable, I simply have high standards whenever I think of Monty Python and find myself wishing it was better. Life of Brian is merely OK, in fact it might be my least favorite of all the Python films, and yet it still gets me laughing quite a few times, so that shows how high my standards are for this comedy troupe. But all true Monty Python fans need to see this at some point.",
            "review_date": "2018-08-22",
            "source": "rt"
        },
        {
            "content": "This is not just the best Monty Python film's, it's one of the best comedy films ever made.  The central sequence where Brian accidentally acquires his followers and cannot get rid of them is the most brilliantly incisive religious satire ever written.  In defending the film upon it's release, the Python crew correctly defended the film against charges of blasphemy since the film is actually quite respectful of Jesus and does not lampoon him in any way.  However, the target here is not just organized religion, it's the very idea of religion of any sort.",
            "review_date": "2018-07-07",
            "source": "rt"
        },
        {
            "content": "It's just one of those films...",
            "review_date": "2018-07-07",
            "source": "rt"
        },
        {
            "content": "is flat out hilarious and goofy..\n\nMonty Python's Life Of Brian\n\nIt is far better than its predecessor, as it has some sensibility on the plot track and appropriate arc and structure in it, an essential ingredient that makes the feature what it is, and not merely a series of sketchy comic skits or jokes. Having said that, it doesn't suggest that it is one of the finest comic genre feature, in fact it never comes close to its due to its lack of an appropriate three dimensional character. It is short on technical aspects like sound department, costume design and editing. There isn't any specific vision for the director to execute on screen but still the work by Terry Jones is appreciative in here and shows a lot of potential to carry off a logical comic feature. The actors too improvise and blends in as the writer, and is probably the reason why the conversations are mind-numbing but hilarious on its own set terms and the bubble they all reside in. It works like a charm and sweep away its runtime swiftly through its various jokes that is stretched and depicted elaborately in here. Monty Python's Life Of Brian is flat out hilarious and goofy and is an improvement as it has a definite track to cover through the allotted time.",
            "review_date": "2018-06-28",
            "source": "rt"
        },
        {
            "content": "Classic Python humour. Challenges belief and provides laughter. Satire and quick quips across all the characters. A fundamental watch for fundamentalists. Classic Monty",
            "review_date": "2018-06-10",
            "source": "rt"
        },
        {
            "content": "Monty Python's Life of Brian, also known as Life of Brian, is a 1979 British religious satire comedy film directed by Terry Jones.\n1001",
            "review_date": "2018-06-06",
            "source": "rt"
        },
        {
            "content": "It seems almost inconceivable to imagine these days that upon its cinema release in the 1970's, this mad-cap movie was banned by a number of British councils and it sparked a storm of protests from straight-laced cranks claiming that it was blasphemous. The Life of Brian is so obviously, gloriously a spoof that all the controversy and anger it spawned just makes the religious look like a bunch of humourless killjoys with no sense of the ridiculous. \nThe titular Brian Cohen has the dubious fortune to be born in Judea in a stable in Bethlehem next to the one that the Mary and Joseph have taken refuge in as told in the Bible story.  The identity mix up starts with the arrival of the Magi who believe Brian to be the Messiah that they have been seeking. As Brian grows up his life runs parallel to that of Jesus and in the febrile atmosphere of Palestine, he is unwillingly caught up in the political and religious turmoil surrounding the founding of Christianity. \nBeing from the Monty Python stable, the comedy is sometimes silly and sometimes tortuous but always very knowing and timed to perfection. Brian, played by Graham Chapman is very much the innocent stooge, playing things straight while the other Pythons orchestrate the chaos that surrounds him, each taking on multiple roles.\nThe movie is littered with classic comedy scenes that are still pure gold. My personal favourite is the scene where a pompous John Cleese tries in vain to officiate at a stoning where badly disguised local woman, eager to hurl rocks at a man accused of speaking the name of the Almighty, have gained prime positions.\nThe humour of Monty Python may not be to everyone's taste but I defy anybody not to chuckle all the way through this brilliant film that is still fresh and, from a satirical point of view, perhaps more relevant today as it pokes fun at the ludicrous nature of fundamentalism.",
            "review_date": "2018-05-30",
            "source": "rt"
        },
        {
            "content": "Was surprised to find that I didn't like this much.  Quite a lot of lameness.  It banks a lot on making fun of speech impediments and other half-assed jokes hammered to death.  There are a few good bits and sure, lampooning religion is always legit, but just too much lameness overall.  4.9 out of 10",
            "review_date": "2018-05-22",
            "source": "rt"
        },
        {
            "content": "Horfði heima hjá Rebekku.\nHitti mömmu hennar í fyrsta skipti.\nHún kom heim og við rétt náðum að fela grasið lol.\nRebekka var veik, örugglega útaf því að endajaxlinn hennar er byrjaður að grafa sig inní kinnina eða góminn. Hún kemst ekki til tannsa í sirka 2 vikur því hún er að vinna, keyra norður á miðvikudag fyrir Fóu.\nÁttum mjög nice stund.",
            "review_date": "2018-05-21",
            "source": "rt"
        },
        {
            "content": "Preserving style, humor and mock, Life of Brian finds Terry Jones crafting a successful installment in the Monty Python trilogy, with a more centered plot, still serving for some isolated segments, as well as minimum but present strange visuals, as well as great satiric production, all crafting an truly effective comeback of the entire team of comedians, delivering their usual humor, vibrant performances, great musical numbers and their obligatory smart commentary against politics and religion.",
            "review_date": "2018-05-06",
            "source": "rt"
        },
        {
            "content": "Puntaje Original: 6.5\n\nUna acertada forma de tratar temas muy ciertos sobre acepciones religiosas, en honor siempre a la comedia.",
            "review_date": "2018-04-23",
            "source": "rt"
        },
        {
            "content": "My father tells me that he had to travel out of his hometown to see this when it came out because the local church had banned screenings where he was living in 1979.\nMonty Pythons life of Brian finds the time to take the piss out of topics as broad and relevant as fanaticism, imperialism, anti-imperialism, linguistics, capital punishment, bureaucracy, astrology, left-wing politics (particularly the partisan inner-turmoil that is often its burden), and manages to pull off one of the most surprisingly cheerful endings in cinema.\nNot once does it actively take the piss out of the life or acts of Jesus Christ\nStill got banned in many communities and I one of my Christian friends refuses to watch the film to this day.\n10/10 would look on the bright side of life again.\n\nWatched April 17th 2018",
            "review_date": "2018-04-23",
            "source": "rt"
        },
        {
            "content": "One of the most over rated comedy films of all times. I just don't get the humour of the Monty Python comedy troupe.\nI have given the film two viewings but still haven't changed my view of it.\nIn Life Of Brian the early life of Jesus or rather the baby from the stable next door, Brian of Nazarath (Graham Chapman) being the subject. Although it has very little Jesus in it and is not a satire on him or any religious faction.\nSome people call it 'British' humour. Well I'm as British as they come and I don't get it.\nAll I get is several performers playing several characters in a series of supposedly comic sketches loosely put together in a film.\nI suppose some working knowledge of biblical stories might have helped a little although I see little reference to religion more the Roman Empire province of Judea.\nIt was more interesting to see that the late Beatle member George Harrison was Executive Producer and his film company HandMade Films helped release the film. HandMade were behind some of the more controversial films of the period such as this and The Long Good Friday.",
            "review_date": "2018-04-05",
            "source": "rt"
        },
        {
            "content": "Well you all know what I thought of the Monty Python and the Holy Grail and now we have a sequel Monty Python's Life of Brian. So I sat down and watched it and I gotta say, it is really as good as each other. I dare even say on par with Mr Bean, Fawlty Towers and Blackadder. Yeah, after watching Blackadder that what I think about it, I can't believe I'm a huge fan of British comedies. I've been a fan of Mr Bean for years and years and years. Life of Brian is about a young boy named Brian who is jewish mistaken for the Messiah and that's it. What I didn't mention which is quite stupid of me is that six actors Graham Chapman, John Cleese, Terry Gilliam, Eric Idle, Terry Jones and Michael Palin playing different characters in different people. Wouldn't you believe it? It did the same thing to Monty Python and the Holy Grail and I'm sure it did that to the TV show Fliying Circus. There are alot of scenes that automatically make me laugh. Get a load of this. I laughed at the scene where Brian is captured by the guards take him to Pontius Pilate where Michael Palin mentions the joke name but I'm sure you'll know who it is and why. The name that made me laugh hard would be... Biggus... Dickus. That's right and here is how. Anybody else feel like a little... giggle... when I mention my fwiend... Biggus... ... Dickus? What about you? Do you find it... wisible... when I say the name... 'Biggus'... ... Dickus? He has a wife, you know. You know what she's called? She's called... 'Incontinentia'... Incontinentia Buttocks. I just can't stop laughing, it's a f£$king gut-split! After that Brian runs away and he jumped and flew out into space in the spaceship with two aliens on board. Now that will make you laugh! I do like the opening song in the opening credits and the ending song that Eric Idle sings a song about looking on the bright side, Always Look on the Bright Side Of Life. There's is one that everyone's been laughing about much like Biggus Dickus and Incontinantia Buttocks, everyone including my Dad remembers the line which Brian's mother has been saying called \"He's not the Messiah, he's a very naughty boy!\" Now that is memorably hilarious! Life of Brian is fantastic and gut-splittingly funny all the way through the film experience. Throughout my teenagehood I never laughed so hard I am really in tears while laughing at something so funny it made my eyes cry. But whatever they know this is one of the greatest comedies of all time much like Monty Python and the Holy Grail. Two of them are my favourite. Two of them I laughed all the way through and the reason for that is I am in the cutting-edge of laughing. Now is there something I'm missing here? The Meaning of Life? Um, join me in the next one.",
            "review_date": "2018-04-03",
            "source": "rt"
        },
        {
            "content": "Lame not funny British Monty Python movie.",
            "review_date": "2018-03-31",
            "source": "rt"
        },
        {
            "content": "Almost as good as Holy Grail and that's saying something, a true comedy classic. Full of bad taste and downright blasphemous, I'm sure some will be deeply offended, everyone else will be deeply entertained.",
            "review_date": "2017-11-23",
            "source": "rt"
        },
        {
            "content": "While not as good as the previous film. Life of Brian stands on its own with great characters,jokes and commentary on religion.",
            "review_date": "2017-11-12",
            "source": "rt"
        },
        {
            "content": "Life of Brian manages to garner laughs at it’s social satire and WTF humor on religion",
            "review_date": "2017-09-24",
            "source": "rt"
        },
        {
            "content": "The perfect Python Film. Intelligent and stupid. Realistically ridiculous.",
            "review_date": "2017-07-06",
            "source": "rt"
        },
        {
            "content": "A superior movie to the Holy Grail (1975), which was descent, but very low budget and a bit messy. Meanwhile, Life of Brian is much more compitent and much more deserving of it's classic status. Although a comedy movie, it actually has some heart and intelligence to it, and I liked the social satire about how society is just willing to just follow religion. I  also find it amazing how Monty Python can concentrate, longly, on certain scenes, even if they're extremely silly. And Bigus Dickus just killed me. Recommended !!",
            "review_date": "2017-06-16",
            "source": "rt"
        },
        {
            "content": "The best of the Monty Python films.",
            "review_date": "2017-05-24",
            "source": "rt"
        },
        {
            "content": "Oh terrorist attack on Charlie Hebdo and you don´t know why? Watch this movie and you will know.",
            "review_date": "2017-05-22",
            "source": "rt"
        },
        {
            "content": "Unfortunately overshadowed by \"Holy Grail\", and yet this film by the famous comedy group is more clever and less slapstick.  It is overall better written and does not just feel like a bunch of skits loosely weaved together.  One of the only python movies with a solid plot.",
            "review_date": "2017-05-13",
            "source": "rt"
        },
        {
            "content": "It is such a great movie and one of the funniest you'll ever see.",
            "review_date": "2017-04-03",
            "source": "rt"
        },
        {
            "content": "Cynically hilarious film. The Monty Python crew did it again bringing another interesting look at religion and empires.",
            "review_date": "2017-03-24",
            "source": "rt"
        },
        {
            "content": "Besides the quite on point satire about biblical interpretation & Eric Idle's rabble rousing Crucifix Song, this was a total dud that pales in comparison to the earlier pre-Cleese Holy Grail.",
            "review_date": "2017-02-19",
            "source": "rt"
        },
        {
            "content": "Absolutely hilarious!",
            "review_date": "2017-02-18",
            "source": "rt"
        },
        {
            "content": "Every moment is as brilliant as the whole.",
            "review_date": "2016-12-27",
            "source": "rt"
        },
        {
            "content": "Good film. But you have to bear in mind that it is old and outdated now so not as many laughs as you would think",
            "review_date": "2016-11-10",
            "source": "rt"
        },
        {
            "content": "Perhaps the most relevant comedy from Monty Python, but also the weakest for me. However, I love Monty Python so much that even their least good film is a 4 star. I still really like this movie and recommend it to any comedy fan, though if you're expecting the more surreal side of MP, you won't find too much of it here. It's actually pretty down to earth satire, which is totally fine. They do it very well.",
            "review_date": "2016-10-11",
            "source": "rt"
        },
        {
            "content": "Wow, this movie is hilarious, a real classic comedy.",
            "review_date": "2016-09-25",
            "source": "rt"
        },
        {
            "content": "Hace mucho no me reía tanto con una pelicula JAJAJAJ genial.",
            "review_date": "2016-09-09",
            "source": "rt"
        },
        {
            "content": "Life of Brian is a comedy with English humour yhat you'll have to set to understand all the film, with jokes that paint a smlie on your face, but a few with that you laugh during hours",
            "review_date": "2016-07-20",
            "source": "rt"
        },
        {
            "content": "The most realistic movie ever made.",
            "review_date": "2016-07-07",
            "source": "rt"
        },
        {
            "content": "The greatest biblical film of all time",
            "review_date": "2016-07-02",
            "source": "rt"
        },
        {
            "content": "88%     While not nearly as quotable as the Holy Grail, the comedy troupe does it again with Life of Brian, being hilarious as well as satirical, and highly entertaining in its own right.",
            "review_date": "2016-06-05",
            "source": "rt"
        },
        {
            "content": "Less laughs than Holy Grail but still funny and clever satire",
            "review_date": "2016-06-03",
            "source": "rt"
        },
        {
            "content": "Genius. World needs this sort of parody more than ever.\nLook out for George Harrison, the man who is lending them their mounts on Sunday (presumably Palm Sunday)!",
            "review_date": "2016-05-19",
            "source": "rt"
        },
        {
            "content": "Great movie. It's smart and witty in its religious satire, even if the plot is a tad scattershot in moments, but also features great performances (as per usual) from the Monty Python gang.",
            "review_date": "2016-04-29",
            "source": "rt"
        },
        {
            "content": "2nd of my all time favorite comedy :D",
            "review_date": "2016-04-27",
            "source": "rt"
        },
        {
            "content": "Comedy is so individualistic it is, in my opinion, impossible to find one that EVERYone loves. This will surely offend many people, but it will offend them in a timeless way, and that truly is its strength.",
            "review_date": "2016-04-10",
            "source": "rt"
        },
        {
            "content": "Perfection from Start to Finnish. A masterpiece of comedy and social satire.",
            "review_date": "2016-03-27",
            "source": "rt"
        },
        {
            "content": "17 coffee pots out of 17",
            "review_date": "2016-02-12",
            "source": "rt"
        },
        {
            "content": "Sacrilegious fare for the Pythons in this film.  The motley crew apply there socio-political commentary to the life of Jesus Christ.  Difficult material to swallow if you are not a Monty Python or British humour fan.  To me, this does not nearly stand up to Holy Grail, despite many others who would largely disagree with me.  Religious satire is a sensitive topic and not as digestible as other themes they have tackled such as King Arthur, death, etc.  Some classic scenes here are forever embedded in the lexicon of Pythonites everywhere.",
            "review_date": "2016-02-01",
            "source": "rt"
        },
        {
            "content": "First time I saw it, it was better, but it's still good :)",
            "review_date": "2016-01-21",
            "source": "rt"
        },
        {
            "content": "I am a catholic, so...yeah.",
            "review_date": "2015-12-10",
            "source": "rt"
        },
        {
            "content": "Silly, witty, bizarre, and timely all at the same time, \"Life Of Brian\" marks a relatively high point within Monty Python's impressive comedic rap sheet.",
            "review_date": "2015-11-07",
            "source": "rt"
        },
        {
            "content": "If you were expecting another Holy Grail, life of Brian will come as a massive disappointment. One of their worst films,it is also one of the worst of all films. You would think with the amount of time they had between Holy Grail and life of Brian that monty python could come up with something worthwhile, but they must have used everything up making their bbc tv shows and holy grail.",
            "review_date": "2015-10-16",
            "source": "rt"
        },
        {
            "content": "What have reviews ever done for us?",
            "review_date": "2015-10-16",
            "source": "rt"
        },
        {
            "content": "Life of Brian has all that one would expect from a Monty Python production: satire, absurdity, ridiculousness, irreverence. Beyond that I found the sets to be surprisingly good and I also found the daring to touch on controversial topics to be refreshing in these uptight times.",
            "review_date": "2015-10-08",
            "source": "rt"
        },
        {
            "content": "This is how comedy is done, folks. Always look on the bright side of life.",
            "review_date": "2015-09-26",
            "source": "rt"
        },
        {
            "content": "Monty Python proved themselves as the kings of satirical comedy with this classic comedy gem.",
            "review_date": "2015-09-23",
            "source": "rt"
        },
        {
            "content": "Funny and clever. From the greatest comedians of all time.",
            "review_date": "2015-09-05",
            "source": "rt"
        },
        {
            "content": "It is a silly comedy, but it has some really deep critics to society.",
            "review_date": "2015-09-03",
            "source": "rt"
        },
        {
            "content": "A timeless classic, view after view you will still laugh at the same jokes the way you did the first time you watched it. considered one of the all time great comedies & when you see for yourself, you can see why.",
            "review_date": "2015-08-25",
            "source": "rt"
        },
        {
            "content": "There is some fun, but overall it is quite stupid.",
            "review_date": "2015-08-02",
            "source": "rt"
        },
        {
            "content": "Another classic from Monty Python that also brings us the top played funeral song in the UK. There is never a dull moment in this movie and if there is, it is because you aren't focusing on the right part of the scene.",
            "review_date": "2015-07-29",
            "source": "rt"
        },
        {
            "content": "Absolutely clever and impossibly funny, Life of Brian manages to be a parody on so many levels and a very peculiar and original movie in many others, with a great cast and some of the best writting ever in a comedy, with timeless jokes and masterful performances.",
            "review_date": "2015-06-22",
            "source": "rt"
        },
        {
            "content": "Since I missed this one way back in the formative years, but having had a ton of the jokes spoiled or related to me over the years, and just not catching it as a teen or whenever this sort thing might have been a bit more subversive or influential, I found myself sort of amused with this comedy classic, but not blown away.\n\nOh well, it's like certain kids movies that I missed and couldn't figure out what the big deal was when I saw them later in life.\n\nTiming is everything, and YMMV on this one, obviously.",
            "review_date": "2015-06-12",
            "source": "rt"
        },
        {
            "content": "A satire on organized religion, pretty funny at places but rather juvenile. One of the better films from 70s, banking on wordplays and set pieces but didn't crack me up like their Holy Grail did.",
            "review_date": "2015-05-10",
            "source": "rt"
        },
        {
            "content": "Not my favourite Monty Python film, but it's still \"weally\" funny.\n\n\"Now, fuck off!!\" XD",
            "review_date": "2015-05-09",
            "source": "rt"
        },
        {
            "content": "one of the greatest comedies ever made!!",
            "review_date": "2015-03-03",
            "source": "rt"
        },
        {
            "content": "The best monty python writing ever, and with the religious and cultural jokes it stands the test of time. A comedy and cinema classic",
            "review_date": "2015-02-22",
            "source": "rt"
        },
        {
            "content": "Hilarious and groundbreaking.",
            "review_date": "2015-01-31",
            "source": "rt"
        },
        {
            "content": "Incredibly funny and sharp as a knife with some skewering blasphemy along the way. Full review later.",
            "review_date": "2015-01-29",
            "source": "rt"
        },
        {
            "content": "Biting as heck as well as amazingly funny, Life of Brian has a biggus dickus that makes this one of the Python's best.",
            "review_date": "2015-01-18",
            "source": "rt"
        },
        {
            "content": "Monty Python' style of comedy was so unique and mind blowingly funny at the time that they beat us 40 years to it.\nFilled with out-of-the-ordinary comedy that even if you don't laugh, there will always be a smile on your face.\nThis movie surpasses The Holy Grail just by a hair's breadth. Not only for it's ballsy religious finger points but also for it's hilarious characters, surreal humor and awkward conversations done perfectly.",
            "review_date": "2015-01-17",
            "source": "rt"
        },
        {
            "content": "The funniest movie ever made? Well, it's up there (even though I prefer a couple of Zucker-Abrahams-Zucker flicks). Some bits drag, or get pushed a tad too far, but very few of them. Glorious satire of SO many things, religion being just one of them. Too many glorious sequences  (the stoning, the bartering, the grammar class, the shoe) and quotes to list. \"All right, but apart from the sanitation, the medicine, education, wine, public order, irrigation, roads, the fresh-water system, and public health, what have the Romans ever done for us?\" is a famous one. But my favourites - \"You lucky, lucky bastard\" and \"Crucifixion? Good. One cross each, line of the left, out the door.\" - are as much about the genius delivery as the words themselves. And the film gets my vote for the best closing song in film history. So great (although granted, very British humour - many won't get it - like my wife, who was baffled throughout).",
            "review_date": "2015-01-04",
            "source": "rt"
        },
        {
            "content": "One of my favourite movies of all time. You need a very particular sense of humour to enjoy this film in its entirety. The crudeness and the quirkiness of this film always makes my day. If you're looking for a far-out comedy unique in nature from mainstream, contemporary Hollywood, this is the film for you! Also check out Monty Python and the Holy Grail: easily my favourite movie of all time.",
            "review_date": "2015-01-04",
            "source": "rt"
        },
        {
            "content": "The best monty python film ever made, life of brian is also the best satire of religion in cinema and one of the funniest films of all time and, frankly, slightly better than holy grail. This film, as a comedy, is perfect down to every performance and criticism of religion and its structure. A comedy masterpiece of the highest order",
            "review_date": "2014-12-19",
            "source": "rt"
        },
        {
            "content": "Not my favourite Monty Python movie (Holy Grail FTW), but an excellent comedy satire! Many of the jokes I found quite funny, while some didn't really deliver. The story is ridiculous and silly, just like any other Monty Python movie/series, and let's not forget, entertaining! The actors play more than one character, and while sometime that can get a bit confusing, it's mostly amusing and funny. The ending is hillarious. All in all, it's a very good movie with lots of laughs and should be seen by all comedy fans, for this is comedy gold!",
            "review_date": "2014-12-09",
            "source": "rt"
        },
        {
            "content": "About as funny as the first one",
            "review_date": "2014-11-28",
            "source": "rt"
        },
        {
            "content": "92%\nWatched this on 28/11/14\nWhat a film, oh what a film!!! It's so good to see Religion mocked and not just that, I haven't laughed like this in ages. This reminds me of the American Pie days. This film is so satirical that it mocks literally every one, from Jesus to Romans, from the common folk of Rome to the Judas of Jerusalem, who are so blinded by stupidity that they believe anyone's god. It's a great great movie, never laughed like this anywhere before. Also it's got porn, oh yeah it has. The visual effects( Terry Gilliam), sets and direction(Terry Jones) are all marvelous.",
            "review_date": "2014-11-28",
            "source": "rt"
        },
        {
            "content": "This is one of those movies you can always watch & again just for the laughs. \"Romani Ite domum\" --classic!",
            "review_date": "2014-11-23",
            "source": "rt"
        },
        {
            "content": "Review In A Nutshell:\n\nComedy is a tricky thing to achieve, as each individual develops their own brand and sensitivities of humour. From the age of 9, I was mainly introduced by the slapstick and childish humour of Adam Sandler and friends, which is why I cannot completely dismiss those films as complete garbage due to the nostalgia factor. As I grew, my comedic tastes have becomes more fine-tuned and become more appreciative of the intelligent and artistic intentions of the writers and actors behind their craft; but in saying that, I am still anchored by the sensibilities of my foundations.\n\nMany consider Life of Brian to be a risky and offensive film, but in all honesty, the film does not even take any jabs at Christianity or other religion in its chosen time period. The film instead pokes fun at the life, values and culture of humanity during that period in time; this allowed the film to become more intelligent in its humour, as it would have been too easy to just simply create a satire on Jesus and his life. This approach also allows the film to raise and tackle more original and thought provoking ideas and themes, standing out shining from its peers. What drew me in and kept me entertained, was the film's ability to make fun of the Romans and keeping its perspective completely grounded on the citizens of Judea; the writers could have followed members of the Roman Empire and showed the stupidity of their values through poor and idiotic decision making.\n\nThough the film takes bold and unique steps in its satire, it lacks the comedic punch needed in a couple of its key scenes. Some moments felt overly long and characters sometimes show desperation in their comedic execution, allowing the material to suffer rather than flourish. I know it sounds pretentious of me, but Life of Brian could have used some character development throughout his journey. The film concludes with a song that actually packs a philosophical punch in its lyrics and wraps the film's larger ideas; but in regards to the character Brian, I never got a conclusion that justifies the importance of his story.\n\nBoldness and intelligent satire define Life of Brian but issues found in the film's screenplay, prevented the film from being an amazing comedy. Though I was let down with this film, I still possess hope in Monty Python's other films.",
            "review_date": "2014-11-11",
            "source": "rt"
        },
        {
            "content": "His not the messiah his a very knotty boy. A",
            "review_date": "2014-11-07",
            "source": "rt"
        },
        {
            "content": "Has some off moments, but the on moments are just the best. \n\"Crucifixion? Good.\"",
            "review_date": "2014-10-05",
            "source": "rt"
        },
        {
            "content": "When people discuss the greatest movies ever made, it is my view that they must either state that they are excluding comedies, or mention this film somewhere within the discussion. That's how important to the history of film I think this controversial, irreverent laugh-a-minute film truly.\n\nThe Monty Python comedy troupe tell the story of a young lad in Nazereth named Brian. Born under a bright star in a manger, Brian is visited at birth by Three Wise Men, bearing gifts of gold, frankenscence and myrhh, which are happily accepted by Brian's mother (although no-one quite knew what the myrhh was). Then, the Wise Men realize the Messiah was born next door. Hence begins the life of Brian. We follow his life as he joins the People's Front of Judea - a left-wing anarchist movement opposed to Roman occupation, and gets into hijinks that make people believe he is the Son of God. Despite Brian's complaints.\n\nThe film stars the entire Monty Python troupe - Graham Chapman, John Cleese, Michael Palin, Eric Idle, Terry Jones and Terry Gilliam - alongside guest stars Susan Jones, Neil Innes, Carol Cleveland, Spike Milligan and producer George Harrison in a cameo (George Harrison reportedly financed this entire movie by mortgaging his house. When questioned by his wife, George responded \"I want to see the film\".) The cast is a funny, nonsensical and silly as you'd expect from a Monty Python film.\n\nIt touted controversy as \"the film that mocked Jesus\", but this film makes it very clear that Jesus is a different person (who is even seen performing his Sermon on the Mount in the \"Blessed are the Cheesemakers\" skit). What's left in a mirror into the role of religion in life, and a hilarious one at that. Nothing is sacred with the Pythons, and this is the group's magnum opus - with all due respect to the Holy Grail of course.\n\nA glowing 5 star rating for this masterpiece.",
            "review_date": "2014-09-23",
            "source": "rt"
        },
        {
            "content": "Probbaly one of my favorite comedies ever.",
            "review_date": "2014-09-08",
            "source": "rt"
        },
        {
            "content": "One of the Most Irreverent, Sacrilegious & Significant Movies of Religion & Theology of All Time ! ! !",
            "review_date": "2014-08-16",
            "source": "rt"
        },
        {
            "content": "A pointless retelling of the story of Christ, with Python's usual zaniness exchanged for weak recurring jokes.",
            "review_date": "2014-08-10",
            "source": "rt"
        },
        {
            "content": "Not as good as Holy Grail, but better then Meaning of Life. Monty python delivers with another hilarious tale about the man born the same day as Jesus. Loved Pilate and the Romans, and the big nose scene was funny too. Lots of funny scenes that had me laughing pretty hard. Watch it, classic comedy.",
            "review_date": "2014-08-10",
            "source": "rt"
        },
        {
            "content": "Hilarious some scenes are so memorable",
            "review_date": "2014-08-03",
            "source": "rt"
        },
        {
            "content": "Wonderful nonsense. I particularly love the bit with the spaceship.",
            "review_date": "2014-08-01",
            "source": "rt"
        },
        {
            "content": "Always look on the bright side of life...",
            "review_date": "2014-07-30",
            "source": "rt"
        },
        {
            "content": "Watch note \n\nMonty Python Live: Backstage\n\nDate: Sunday 20th July 2014\nChannel: 133 (sky) GOLD +1 ( missed normal channel 110 gold) \nstart time: 8:00pm \nRunning time: 34mins",
            "review_date": "2014-07-24",
            "source": "rt"
        },
        {
            "content": "Woah. This is not for the easily offended. That's about all I can say for this one!",
            "review_date": "2014-07-16",
            "source": "rt"
        },
        {
            "content": "Great movie it's halarious",
            "review_date": "2014-07-16",
            "source": "rt"
        },
        {
            "content": "I get the sense that this movie is what it is, but i couldnt watch it to the end. Nothing against old movies, but after the modern day standards that i get used to its just horrible to watch",
            "review_date": "2014-07-14",
            "source": "rt"
        },
        {
            "content": "Monty Python is The King of Smart Comedy.",
            "review_date": "2014-07-13",
            "source": "rt"
        },
        {
            "content": "Life of Brian is a hilarious, offensive cult classic. This film has great acting, is constantly funny and there isn't a dull moment. The film is so quotable and entertaining I love it.",
            "review_date": "2014-07-02",
            "source": "rt"
        },
        {
            "content": "freakishly smart and funny, this satire got me at those grammar Romans",
            "review_date": "2014-06-30",
            "source": "rt"
        },
        {
            "content": "There is some brilliantly clever writing and acting going on here, but Life of Brian spends more time pushing the envelope than it does ensuring a cohesive narrative.",
            "review_date": "2014-06-30",
            "source": "rt"
        },
        {
            "content": "Even 35 years later, the bite of this satire about the dangers of religious extremism still brings the laughs.",
            "review_date": "2014-06-29",
            "source": "rt"
        },
        {
            "content": "Anybody who gives this less than 5/5 clearly isn't looking on the bright side of life.",
            "review_date": "2014-06-29",
            "source": "rt"
        },
        {
            "content": "very very very funny",
            "review_date": "2014-06-24",
            "source": "rt"
        },
        {
            "content": "????? ???? ????? ????? ??????",
            "review_date": "2014-06-24",
            "source": "rt"
        },
        {
            "content": "So many comical and side splitting scenes makes this Monty Python film one of its best. The scenes are only as perfect with many hilarious and speech impaired characters.",
            "review_date": "2014-06-16",
            "source": "rt"
        },
        {
            "content": "Endlessly funny and witty, this might be the best of all the Python movies.",
            "review_date": "2014-06-12",
            "source": "rt"
        },
        {
            "content": "THR33 P01NT F1V3 ST4RS",
            "review_date": "2014-05-21",
            "source": "rt"
        },
        {
            "content": "Always look on the bright side of life.",
            "review_date": "2014-05-08",
            "source": "rt"
        },
        {
            "content": "The films about a boy is born in the stable next to the Messiah, his name is Brian and he is often mistaken for the messiah. This movie was hard to sit throw at the first but it got better as it went along and more funny-er.",
            "review_date": "2014-05-02",
            "source": "rt"
        },
        {
            "content": "Just wondering where the bright side got left....... as always, the Monty Python things work as short things but the guys just have to always drag them on and on and on until you are ..... just done with it.",
            "review_date": "2014-04-18",
            "source": "rt"
        },
        {
            "content": "Holly Comedy! I bet everyone in Paradise loughed a lot!",
            "review_date": "2014-04-16",
            "source": "rt"
        },
        {
            "content": "The one amusing thing that group has ever done.",
            "review_date": "2014-04-08",
            "source": "rt"
        },
        {
            "content": "Monty Python's \"Life of Brian\" shows that the Pythons are still funny long after \"Flying Circus\" had ended. Parodying the tale of Jesus Christ, the film focuses on poor Brian who creates an (impromptu) absurd faith with numerous equally absurd followers who pester him to no end, especially since Brian made up ridiculous holy sermons just to escape the Romans. Humorous acting & moments & unique direction make this film second best to \"The Holy Grail\" & also proves how silly religion can be (the controversy that arose is understandable, but nevertheless those Christian fanatics have no sense of humor)! \n\nTerry Jones - \"I think the the film is heretical, but it's not blasphemous.\"\nEric Idle - \"It's a heresy.\"\nJohn Cleese - \"I don't think it's a heresy. It's making fun of the way that people misunderstand the teaching.\"\nJones - \"Of course it's a heresy, John! It's attacking the Church! And that has to be heretical.\"\nCleese - \"No, it's not attacking the Church, necessarily. It's about people who cannot agree with each other.\"\n\nThe truth has been spoken, so Always Look On the Bright Side of Life! *whistles*",
            "review_date": "2014-04-08",
            "source": "rt"
        },
        {
            "content": "One of the best historical satires I've ever seen.",
            "review_date": "2014-03-12",
            "source": "rt"
        },
        {
            "content": "Monty Python's Life of Brian, fits perfectly into the Monty Python catalog.  I enjoyed the religious element of the story.  Still, nothing breathtaking to report, just an enjoyable, funny movie.",
            "review_date": "2014-03-08",
            "source": "rt"
        },
        {
            "content": "w/ C. Some parts dragged on, but surprisingly thoughtful and stimulating in a fleeting way. Surely, one of the better Monty Python flicks.",
            "review_date": "2014-03-08",
            "source": "rt"
        },
        {
            "content": "He wasn't the Messiah, just a naughty little boy",
            "review_date": "2014-02-19",
            "source": "rt"
        },
        {
            "content": "http://filmreviewsnsuch.blogspot.com/2014/02/flying-circus-and-python-films.html",
            "review_date": "2014-02-14",
            "source": "rt"
        },
        {
            "content": "i love this film.  really, you can't get a more positive lookout on life than this.",
            "review_date": "2014-01-24",
            "source": "rt"
        },
        {
            "content": "What's my problem: This is movie is way too funny to skip over.",
            "review_date": "2014-01-23",
            "source": "rt"
        },
        {
            "content": "Funny satire of biblical porpotions",
            "review_date": "2014-01-21",
            "source": "rt"
        },
        {
            "content": "One of the funniest films made and not in any way blasphemous or offensive there are more good jokes per minute in this film than in any other",
            "review_date": "2014-01-14",
            "source": "rt"
        },
        {
            "content": "I just laughed so hard I peed my pants",
            "review_date": "2014-01-12",
            "source": "rt"
        },
        {
            "content": "Monty Python has made one of my favorite films of all time, Monty Python and the Holy Grail. Holy Grail was a pure comedic blast, and the funniest movie I have ever seen. So naturally, going into Monty Python's Life of Brian, you had high expectation. The same, random, quirky humor, and the same brilliantly written improv-like comedy. And you get all that from Life of Brian. The same kind of humor, the same actors, for god sake it feels almost like the same movie. So why did I not enjoy Life of Brian as much as Holy Grail? Part of the problem was the two films were going for two completely different things. Monty Python is brilliant, and they have a lot to say, so naturally when they make a movie they will be poking fun at things they felt should be different. But Holy Grail was not a political film, but rather a comedy film with political themes that were so funny you barely caught them. The humor in Holy Grail, no matter if random, was clever. That was the major thing in Holy Grail. The writing was smart, the plot structure was smart, and the brilliance behind entire film is clear. Life of Brian was written well, but was rather more of a satire than anything else. That is what defines Brian and Holy Grail from each other. Holy Grail was very clever, and did not care if anyone saw what the movie was trying to say, but rather cunningly wrote the film for themselves to enjoy and not to care if the film was for making money. The film was different for other films, and even if they Python crew made the movie for money, you could've never told because so much heart and time and wits were put into the film it simply felt like an amazing film from the depths of an awkward video store. Life of Brian, though, was so hung up on its satire it forgot to concentrate more on its clever humor. Life of Brian was a film that felt it was trying to make money, felt like a Monty Python film that tried to be good, but it also felt like a Monty Python film. But its big hold back was that it tried to much on the satire and actually saying something than rather concentrating on the actual humor. Life of Brian satirized the religious world and why some things in religion is absurd, and these times were funny, but they simply were not as clever as in Holy Grail. I enjoyed Life of Brian, understood the random humor, laughed quite a bit, but this film actually tried to leave you thinking about the movie, which is something I give props for, but sadly, it took away from the intelligence of the humor. Sure, the movie tried something different than Holy Grail, and I give props to the Python team for trying something different instead of sticking to the same formula. And I don't mind satire in film, and I don't mind thinking outside of the movies, but when you make a comedy film that works itself more with thought than with better humor, than it is not satisfying. Needless to say, Holy Grail was a brilliantly smart and hilarious film, and so was this movie, but it was not smart  in the comedy as much as what it was trying to say. Monty Python is a brilliant comedy group and is probably the best of all time, but to make a movie about Life of Brian and work more on though than humor, it is not a positive thing for them. Keep satire, but also keep really good humor in a comedy, and you have a great movie not like many others. Python can do better though, they really can.\r\n\r\n   Life of Brian is a 1979 film from the Monty Python troupe about a poor Jew in Biblical times who is mistaken for the Messiah. Typing that out, I laughed a bit. Truly, Life of Brian's plot comes far from Holy Grail's. With an actual leading character and a plot that follows characters thoroughly and makes sense, I think that the actual plot, not the outlandish events though, is pretty good. The plot itself would not make for a bad drama film,  and I give props to the writers for coming up with such good stuff and building comedy on top of that. I won't go into the dialogue, for I do believe it was funny, but the satire took away from what could have been better comedy and I explained that above. The acting is good, always quirky and while the costume and make-up department do not go to great lengths to make the actors look different when they switch characters, the comedy actors fully dispersed into the different roles and made them come off as different when they did switch characters. Major props to one actor by the name of Michael Palin who in one scene plays a completely idiotic and foolish villain with a lisp to the next scene for playing a kind, sincere and sentimental man in charge of executions who you can't help but greatly admire. Top notch comedy and what I think is highly improvised acting from the entire crew. The direction was a bit weak from the film, though. Unlike Holy Grail which felt like it was based in the time of King Arthur's court, Life of Brian at times felt studio-ish. The set design greatly encompassed you into the film, and you felt like it was Biblical times, just a little bit the film felt not well directed for it was long drawn out scenes and the film was murky and the vision was not the same the entire way through. Holy Grail also lacked solid direction, which I guess does not work with this kind of comedy, but I wish it could have for it is something I truly think the film needs at times. Although I enjoyed the improv quite a bit, I also the felt the direction was improvised, as well.\r\n\r\n   Life of Brian is not a disappointing film to watch, for it is very much indeed funny. Some scenes here and there are very fun to watch, very memorable lines as in Holy Grail, and deserves more viewings. Don't get me wrong, Monty Python made a funny movie, with a very feel good ending that is deliberately sentimental, and the entire movie is good for a laugh. But Life of Brian greatly lacks that sense of clever and intelligent humor that Holy Grail encompassed, and in the end does not hold up too well at all from that film, and sadly, feels like to completely and utterly different groups made it. But with fantastic acting, a good, structured plot, and some real funny lines, Life of Brian is not a total underachievement to the Monty Python name. Rather it was just unsatisfying, and Monty Python had a lot to live up to, but even if they could not quite fully reach it, I respect them for trying and for trying something different with Life of Brian. As the end scene states, Always Look on the Bright Side of Life, and this movie had bright laughs, not as though-out laughs, but still, bright and nice laughs. 7/10.\r\n\r\nAnd please, if you are interested in hearing my thoughts or listening me talk more about this film, check out my podcast! The Hostile Monkey Movies Podcast is every Sunday, so listen to the previous ones and check out this weeks for my thoughts on some other good films out there: http://hostilemonkeymovies.podomatic.com \r\nAnd like our facebook page too at facebook.com/hostilemonkeyentertainment",
            "review_date": "2014-01-02",
            "source": "rt"
        },
        {
            "content": "Great movie. So many funny scenes and quotable moments.",
            "review_date": "2014-01-01",
            "source": "rt"
        },
        {
            "content": "It's extremely funny, don't get me wrong. A great British comedy it is.",
            "review_date": "2013-12-30",
            "source": "rt"
        },
        {
            "content": "Dotado do melhor humor politicamente incorreto, brilha pela riqueza de críticas, sátiras e ironias dirigidas à ideologias, políticas e religiões.",
            "review_date": "2013-12-30",
            "source": "rt"
        },
        {
            "content": "????????????, ?? ???? ??????? ??? ??????? ??????? (?? ???? ?????? ?? Monty Python ????? ???????) ???? ???? ?????????? ?? ?????? ??????. ??? ?????? ?? Holy Grail.",
            "review_date": "2013-12-21",
            "source": "rt"
        },
        {
            "content": "Always look on the bright side of life...",
            "review_date": "2013-12-14",
            "source": "rt"
        },
        {
            "content": "The comedy group Monty Python consisted of five British men and one American, and together they changed sketch comedy.  Their writing was unique and brilliant as sketch comedy had not experience something like this before. So when the group went into the movie business, everything was heavily improved. Yes, \"Holy Grail\" is considered a masterpiece as well as a comedy classic, but 1979's \"Life of Brian\" can be argued as the group's best work. However, the subject matter of parodying the life of Jesus Christ can offend some people, but for the most part, it works. \"Life of Brian\" is a great comedy that may not be for everyone.\n\nThe story parallels the story of Jesus Christ by having a man named Brian lead the way to a revolution against the Romans... Yeah, you can see why so many people got offended at this movie.\n\n\"Life of Brian\" is a simple parody of how different one could imagine what really happened during the times of Jesus. The writing is great as the Monty Python team worked together and knew what they were getting themselves into. It's not necessarily blasting the religious culture, just poking fun at what happened and all these beliefs that were happening during that time. The comedy in this film works to perfection as the timing of the jokes and situations happen and are implemented greatly. As for the production itself, the design is great and sets the tone for the movie. The music is a good combination with the pacing of the film, with the song 'Always Look On the Bright Side of Life' being memorable and catchy. Yet what surprises most viewers is how the movie actually got made and turned into this big success; it certainly paid off.\n\nDespite all the praise given to this movie, there are some problems. For one thing, some of the jokes do not work; they can be either hit or miss. Speaking of the humor, it can mostly be shocking at certain moments, especially during the end of the film. This can lead to some people, mainly in the religious atmosphere, to get offended with its subject material, despite the movie being almost 35 years old.\n\nIn conclusion, \"Life of Brian\" is a great comedy that showed that the Monty Python team can go to places where it can go into a great debate. And it's proven here. With this film, everything about it can work if you're in the right mindset.",
            "review_date": "2013-12-12",
            "source": "rt"
        },
        {
            "content": "The one amusing thing that group has ever done.\n\nhttp://pandoraxsage.blogspot.com/2013/10/the-movie-watching-project.html",
            "review_date": "2013-12-02",
            "source": "rt"
        },
        {
            "content": "Simply hilarious. Monty Python at his best!!",
            "review_date": "2013-11-25",
            "source": "rt"
        },
        {
            "content": "Monty Python's Biblical and Historical Epic spoof tries a bit too hard for easy laughs at first. But as the film goes on, the humor hits.",
            "review_date": "2013-11-18",
            "source": "rt"
        },
        {
            "content": "(Upcoming Review)  Rating:  9.3/10",
            "review_date": "2013-11-17",
            "source": "rt"
        },
        {
            "content": "Life of Brian is a very funny film from Monty Python. I've seen all their films, and each are special in their own way. With this one, they really pulled off something highly entertaining and hilarious. Everyone one here brings something truly memorable to the screen, and with its plot, is a fine parody that generates lots of laughs. The film has plenty of great moments that really stand out. Monty Python are terrific comedians, and they deliver a film that is very funny from start to finish. If you loved every other film that Monty Python picture, you're sure to enjoy this one.  I thought that this film was well crafted and definitely delivered on its ideas. The film is a comedy classic, and it's one of those films that any film fan should watch. Monty Python always had that eccentric touch to their humor and they pull off another great movie with Life of Brian. If you this sort of humor, you're sure to enjoy this comedy, and it is a highly memorable picture that is lots of fun due to a well written script, hilarious dialogue and top-notch performances from the troupe. Life of Brian ranks there as one of the finest comedies ever made. The humor is intelligent, hilarious and unforgettable. I think that this is one of those genre films that is much better than most comedies nowadays because this had better humor, while today's comedies tend to be pretty bland in terms of jokes. If you're looking for a film that has some very good jokes, and then check this film out, one of Monty Python's best. Life of Brian succeeds where many other comedies fail, this is a comedy classic that delivers the laughs and boasts a great story as well. Where can you go wrong?",
            "review_date": "2013-10-28",
            "source": "rt"
        },
        {
            "content": "does anyone ELSE have a problem with the name Biggus Dickus",
            "review_date": "2013-10-17",
            "source": "rt"
        },
        {
            "content": "Best work of the Python's group. Timeless classic - especially loving the latin-scene.",
            "review_date": "2013-10-13",
            "source": "rt"
        },
        {
            "content": "Although the humour is (somewhat) less broad than their other films, and made for a more mature audience, this is the most daring, intelligent and cohesive of all the Python films.",
            "review_date": "2013-10-08",
            "source": "rt"
        },
        {
            "content": "Like 'The Holy Grail' it's insanely silly, but unlike 'The Holy Grail', 'Life Of Brian' is a bit more conventional and it's definitely better for it. As a film it feels more developed and as a story it feels more focused.",
            "review_date": "2013-10-02",
            "source": "rt"
        },
        {
            "content": "I got hold of this movie by accident and started to watch it too by accident. But the minute I turned it on, I was absolutely glued to it. All I can tell you is that this is British Comedy at its best.\n\nJohn Cleese, Graham Chapman, Michael Palin, Eric Idle and Terry Gilliam are the main actors - who are also the writers of this religious satire. Terry Jones takes on the helm as the Director and also contributes as one of the lead actors and also its writers.\n\nLife of Brian tells the story of Brian Cohen (played by Chapman), a young Jewish man who is born on the same day as, and next door to, Jesus Christ and is subsequently mistaken for the Messiah.\n\nLet me tell you this - even though the movie is so old, it still remains true to its title 'One of the Funniest Movies Ever'. I highly recommend you to watch it - but only if you can handle religious satire.\n\nBrilliant. Bold. Bashful. British - I loved it!\n\nOverall rating - 10 out of 10.\n\nLoy Machedo\nloymachedo dot com | whoisloymachedo dot com",
            "review_date": "2013-09-06",
            "source": "rt"
        },
        {
            "content": "The outrageous yet very clever unique re-telling of Brian who accidentally get's mistaken as Christ the Messiah.\n\nFilled with many great gags but some not so funny one's as well, however there is one scene with aliens briefly that will do your head in.\n\nVery controversial & really makes fun of organised religion & how it's perceived. It's amazing they got away with all they did & actually pulled it off, a true classic satire of religion.",
            "review_date": "2013-08-31",
            "source": "rt"
        },
        {
            "content": "Classic Monty Python. This film is outrageous from the beginning scene with the three wise men and the wrong baby to the final credits scene where a line of crucified men sing and whistle the hilarious \"Always Look On The Bright Side Of Life\". You can't help but laugh out loud the whole way through the film",
            "review_date": "2013-08-30",
            "source": "rt"
        },
        {
            "content": "Best comedy that I have ever seen",
            "review_date": "2013-08-16",
            "source": "rt"
        },
        {
            "content": "What I think is the best Python Film",
            "review_date": "2013-08-07",
            "source": "rt"
        },
        {
            "content": "A shockingly underwhelming Monty Python film with only a few laughs and a completely nonsensical and illiterate plot.",
            "review_date": "2013-08-04",
            "source": "rt"
        },
        {
            "content": "No, it's not actually making fun of Jesus' story. But for what it is, it's hilarious.",
            "review_date": "2013-07-23",
            "source": "rt"
        },
        {
            "content": "Another intelligent and widely accessible film that not only shows the creators did some research but that they truly had a magic touch when it came to this kind of movie. It has one foot in historically based satire and another in just good old fashion lampoon. While it is indeed a parody of the Biblical narrative, it is not outright disrespectful to Jesus. The one time Jesus does appear, he's not really doing anything silly. So anyone worried about blasphemy can shut up. This tale of a man mistaken for a prophet is one of the best comedic films ever made.",
            "review_date": "2013-07-21",
            "source": "rt"
        },
        {
            "content": "best comedy, if you don't like it you must be brain washed by religion",
            "review_date": "2013-07-17",
            "source": "rt"
        },
        {
            "content": "Not as good as The Holy Grail, but not many films are. It's not the best thing the group has ever done, but it is very funny, and ridiculously clever.",
            "review_date": "2013-07-16",
            "source": "rt"
        },
        {
            "content": "A classic Monty Python film that's big on laughs and satire.",
            "review_date": "2013-07-10",
            "source": "rt"
        },
        {
            "content": "These guys are hilarious and great to watch! Even the wacky antics they pull playing 2 characters in the same scene is enjoyable.",
            "review_date": "2013-07-09",
            "source": "rt"
        },
        {
            "content": "I may be abit bias, but I think that this film.  Is one of the best comedies that's ever been made.\nThe Python team at their best.",
            "review_date": "2013-07-04",
            "source": "rt"
        },
        {
            "content": "A Smart, inovative comedy that is definitley in my top 5 favorite movies!",
            "review_date": "2013-06-12",
            "source": "rt"
        },
        {
            "content": "hard one to rate life of brian is funny but also can be abit annoying its old but totally original i expected more, it really takes the piss out of judea and the romans at the start of the ADs they avoid taking the piss out of jesus in this movie he is only in it once at the top of a hill addressing the people. agustus is the emporer in this but if jesus is of age it should be tiberious, how and ever. i think me and ricky gervais should re-do this movie with a better funnier script and ricky can be lots of characters come on he looks more like a 2000 year old man than any of the monty pythons lads it will be class.",
            "review_date": "2013-06-11",
            "source": "rt"
        },
        {
            "content": "Life of Brian is a unique comedic and satirical film but unlike other Monty Python adventures it places it safe and goes for old gags (men dressed as women) rather than the smart laughs that make the most of the others in the collection.",
            "review_date": "2013-06-03",
            "source": "rt"
        },
        {
            "content": "Pure Python Class....",
            "review_date": "2013-05-31",
            "source": "rt"
        },
        {
            "content": "Brilliant tongue in cheek commentary on organised religion.",
            "review_date": "2013-05-15",
            "source": "rt"
        },
        {
            "content": "Extraordinary comedy.",
            "review_date": "2013-05-10",
            "source": "rt"
        },
        {
            "content": "Takes place in first century Judea and depicts the life of Brian who is born on the same day as jesus in a manger next door. As an adult Brian decides to join a resistance group called The People´s Front of Judea to finally put an end to Roman occupation. The film uses some imaginative cinematography and rich scenery to recreate new testament era Judea, also does a good job to fill up its runtime with lots of hilariously ridiculous scenes, for example a scene where Brian is painting propagandic graffiti and gets grammar correction from a Roman soldier. The People´s Front of Judea and some brilliant irony makes a perfect combo to make fun of Left-wing revolutionary groups and loads of razor-sharp satire is used to deliver hard-hitting comical blows at religion.",
            "review_date": "2013-04-19",
            "source": "rt"
        },
        {
            "content": "This is the funniest film ever made EVER a must watch befor you die!",
            "review_date": "2013-04-14",
            "source": "rt"
        },
        {
            "content": "Though not as funny as it's outstanding predecessor, Life of Brian combines laughs with brilliant satire, making it one of the smartest, and funniest satires of all time",
            "review_date": "2013-04-13",
            "source": "rt"
        },
        {
            "content": "A scatterbrained religious farce from the comedic geniuses of Monty Python.",
            "review_date": "2013-04-09",
            "source": "rt"
        },
        {
            "content": "He's not the messiah, he's a very naughty boy",
            "review_date": "2013-04-09",
            "source": "rt"
        },
        {
            "content": "awesome film!! always look on the bright side of life",
            "review_date": "2013-04-08",
            "source": "rt"
        },
        {
            "content": "Let's just say this: It features a random space chase complete with aliens and a series of men being crucified who break out into a happy song about looking on the bright side of life, all while being an extremely intelligent comment on religion.",
            "review_date": "2013-04-07",
            "source": "rt"
        },
        {
            "content": "I was incredibly surprised at how clever and funny this ancient comedy is. The quality is frightening.",
            "review_date": "2013-04-04",
            "source": "rt"
        },
        {
            "content": "Easily the best film out of the Monty Python troupe's arsenal, it's hilarity and dry wit is memorable, original and iconic of British humour. It's characters are actually well fleshed out and it makes clever points against Fundamentalist Christianity, and in the end just laughs at the face of death.",
            "review_date": "2013-04-04",
            "source": "rt"
        },
        {
            "content": "Finally seeing this movie in full, this will most likely be, alongside the Holy Grail, one of the group's finest attempts at parody comedy movie. Poking fun at religion, instead of making you upset, it will make you entertained.",
            "review_date": "2013-04-03",
            "source": "rt"
        },
        {
            "content": "Hilarious and fun that doesn't let you stop laughing,  lot of critic goes underneath",
            "review_date": "2013-04-03",
            "source": "rt"
        },
        {
            "content": "I give this one four and a half stars only because I think it's one tiny notch below \"The Holy Grail.\"  \r\n\r\nSo many great moments.  I particularly like the scene where Brian -- completely naked -- throws open the shutters only to be greeted by thousands of people outside his house.\r\n\r\nIf I was the ruler of a country, \"Always Look On the Bright Side of Life\" would be its national anthem.",
            "review_date": "2013-03-31",
            "source": "rt"
        },
        {
            "content": "So funny. My girlfriend and I laughed for weeks when we first saw it in '79.",
            "review_date": "2013-03-30",
            "source": "rt"
        },
        {
            "content": "My favorite Python movie.",
            "review_date": "2013-03-24",
            "source": "rt"
        },
        {
            "content": "It's the life and times of Jesus Christ as interpreted by the Monty Python crew. Naturally, it's hilarious in ways simultaneously dumb and brilliant. It somehow helps that everyone is British.\n\n--7.0/10--",
            "review_date": "2013-03-22",
            "source": "rt"
        },
        {
            "content": "Monty Python's Life of Brian.  Classic as classic can be.  Hysterical old school comedy and the Python boys just kill it as they usually do.  Loved it.  8.5/10",
            "review_date": "2013-03-14",
            "source": "rt"
        },
        {
            "content": "One of the funniest movies I've ever seen. Almost as funny as Monty,Python and the holy grail.",
            "review_date": "2013-03-13",
            "source": "rt"
        },
        {
            "content": "A funny movie but the english humor is not hilarious enough for me.",
            "review_date": "2013-03-09",
            "source": "rt"
        },
        {
            "content": "Doesn't do it for me like \"The Holy Grail\" does, but still hilarious.",
            "review_date": "2013-03-07",
            "source": "rt"
        },
        {
            "content": "I love it, and its similarity to the story of jesus (although it has little to do with that), very funny",
            "review_date": "2013-03-06",
            "source": "rt"
        },
        {
            "content": "i like this one better then the other one ha ha lol i can watch it over and over lol",
            "review_date": "2013-03-01",
            "source": "rt"
        },
        {
            "content": "Probably the most historically accurate Jesus-film ever made.\nAnd the most outrageously funniest.",
            "review_date": "2013-02-26",
            "source": "rt"
        },
        {
            "content": "This is the weakest in the Monty Python series. Too loud, with jokes that feel stale.",
            "review_date": "2013-02-25",
            "source": "rt"
        },
        {
            "content": "Crazy, satirical but a good laugh, I'd definitely watch it again.",
            "review_date": "2013-02-20",
            "source": "rt"
        },
        {
            "content": "Though sometimes overly irreverent and far from consistent, Life of Brian delivers plenty of Monty Python's signature brand of slapstick humor to fans and its edgy religious parody should provide newcomers with reason enough to stick along for the rid. If none of that's enough, then watch Life of Brian to experience one of the most gut-bustingly hilarious final scenes in the history of cinema.",
            "review_date": "2013-02-16",
            "source": "rt"
        },
        {
            "content": "Religious satire at its finest.",
            "review_date": "2013-02-15",
            "source": "rt"
        },
        {
            "content": "Doesn't even come close to the wit or imagination of \"Monty Python and the Holy Grail\".",
            "review_date": "2013-02-15",
            "source": "rt"
        },
        {
            "content": "Make sure controversy doesn't catch up within the next 30 years or so, cause Life of Brian is \"cruxifictional\" naughty! Python's sense of comedy is highly original, effective and surely  giggle maker that even \"Judeah's People Front\" love it all, or sex helps to not relate to the biblical praising that surely gives away with laughter that can even be heard all the way through Jerusalem, isn't that lovely to say, Biggus...Dickus...  Brilliant! Thumbs up to the Pythons!",
            "review_date": "2013-02-09",
            "source": "rt"
        },
        {
            "content": "Very funny, albeit silly, satire of religion in the first century which connected with me largely due to the fact that I don't understand people's affinity with it. The jokes are very tongue-in-cheek and it couldn't have ended more perfect!",
            "review_date": "2013-02-07",
            "source": "rt"
        },
        {
            "content": "One of the funniest movies I've ever seen. Love Monty Python.",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "\"Always look on the bright side of life.....\"",
            "review_date": "2013-02-04",
            "source": "rt"
        },
        {
            "content": "-the only worth while Monty Python film. Brazil was alright, but this is the only comedy worth anything.",
            "review_date": "2013-02-04",
            "source": "rt"
        },
        {
            "content": "Amazing. The second best Monty Python movie.",
            "review_date": "2013-02-03",
            "source": "rt"
        },
        {
            "content": "IDK why people find Monty Python funny its retarded",
            "review_date": "2013-01-28",
            "source": "rt"
        },
        {
            "content": "Really messed up AND hilarious, but still not as good as holy grail.",
            "review_date": "2013-01-26",
            "source": "rt"
        },
        {
            "content": "A great monty python film.  I love the humor, sets, and costumes.  However, I felt that the jokes got stale towards the last half of the movie.",
            "review_date": "2013-01-25",
            "source": "rt"
        },
        {
            "content": "A brilliant film, truly defines classic British comedy.",
            "review_date": "2013-01-24",
            "source": "rt"
        },
        {
            "content": "Classic-as-Hell. Funny, quick, and - at times - brilliant.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "A little less spectacular, but good fun nonetheless.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "A lot of hype about this film but I don't think it lives up to it. For a film that is meant to be a comedy, I find it poor. The humour is very specific and I'm surprised it is rated as such a good film on IMDB. This could be because of the Monty Python backing though.",
            "review_date": "2013-01-21",
            "source": "rt"
        },
        {
            "content": "Top 5 funniest movies of all time.",
            "review_date": "2013-01-20",
            "source": "rt"
        },
        {
            "content": "watch it at least twice a month",
            "review_date": "2013-01-11",
            "source": "rt"
        },
        {
            "content": "For the religious with a sense of humor. Do not take offense, learn instead.",
            "review_date": "2013-01-09",
            "source": "rt"
        },
        {
            "content": "Finally watched it. Full of lulz",
            "review_date": "2013-01-08",
            "source": "rt"
        },
        {
            "content": "A hilarious satire directed towards Christianity",
            "review_date": "2013-01-07",
            "source": "rt"
        },
        {
            "content": "This film truly shows how the Pythons are so good at satire.",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "I didn't find this funny at all...well not as funny as John Harris anyway.",
            "review_date": "2013-01-05",
            "source": "rt"
        },
        {
            "content": "They sing and dance about semen.  Come on!",
            "review_date": "2013-01-04",
            "source": "rt"
        },
        {
            "content": "If you ever had to study Latin you know why I rated it five stars.",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "Utterly hilarious, but still put me to sleep at one point, and not quite as good as Holy Grail.",
            "review_date": "2012-12-30",
            "source": "rt"
        },
        {
            "content": "Makes me laugh as much at the people who still go on about this film being blasphemous! :)",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "Not as funny as Grail, much funnier then Meaning of Life.",
            "review_date": "2012-12-26",
            "source": "rt"
        },
        {
            "content": "Blessed are the cheesemakers.",
            "review_date": "2012-12-20",
            "source": "rt"
        },
        {
            "content": "Life of Brian. So I'm not a diehard Monty Python fan, but that's not to say that I don't enjoy their brand of humo(u)r. I've always liked the other films and Flying Circus, so it was natural that I felt the same about this one. However, it's not favorite in the \"series.\" Nor did I find myself laughing out loud throughout. There were some moments (Romans Go Home, Biggus Dickus, the final song, etc.) which I think are brilliant, but like all sketch-y comedies, there are some parts that are a little \"miss\" for me. Overall, however, a very funny movie with a lot of excellent portrayals by the Monty Python cast. 7.5/10",
            "review_date": "2012-12-07",
            "source": "rt"
        },
        {
            "content": "Funny comical and definately worth watching again.",
            "review_date": "2012-12-07",
            "source": "rt"
        },
        {
            "content": "What have the romans ever done for us!",
            "review_date": "2012-12-06",
            "source": "rt"
        },
        {
            "content": "\"always look on the bright side of life!",
            "review_date": "2012-12-03",
            "source": "rt"
        },
        {
            "content": "I want to be a woman. I want to be called Loretta! You can't be a woman! You're a man! Well, let's say he has the right to be a woman then! I love this stuff! Awesomely funny and classic Python!",
            "review_date": "2012-11-30",
            "source": "rt"
        },
        {
            "content": "Funny, but not THAT funny. The first half was a lot better than the second half.",
            "review_date": "2012-11-30",
            "source": "rt"
        },
        {
            "content": "Some of the best quotes from a film of all time.  \"He's not the Messiah he's just a very naughty boy\" only Monty Python could come up with that one.",
            "review_date": "2012-11-30",
            "source": "rt"
        },
        {
            "content": "Important film.  Pushed the envelope, and is still great.",
            "review_date": "2012-11-26",
            "source": "rt"
        },
        {
            "content": "The weakest of the Python films.",
            "review_date": "2012-11-22",
            "source": "rt"
        },
        {
            "content": "Well when i saw this it was really different form Monty Python and the holy grail... in a lot of good ways! The description kinda says what I would say here... only in better wording.",
            "review_date": "2012-11-18",
            "source": "rt"
        },
        {
            "content": "Marvellous comedy that doesn`t make fun with religion, but with human nature. I watch it with my family on Christian holidays.",
            "review_date": "2012-11-15",
            "source": "rt"
        },
        {
            "content": "This is the only Monty Python movie that was actually good. It was actually thought out, the gags were well timed, and the movie was actually finished.",
            "review_date": "2012-11-14",
            "source": "rt"
        },
        {
            "content": "Life of Brian is Monty Python at their best. The overall religious satire is punched by constant sideways and witty jokes, and like much of their other works remains a classic comedy.",
            "review_date": "2012-11-13",
            "source": "rt"
        },
        {
            "content": "Hilarity ensues.. But through all of it I thought the ending was lazy lol",
            "review_date": "2012-11-11",
            "source": "rt"
        },
        {
            "content": "Wonderful, crazy and original in story as well as humour.",
            "review_date": "2012-11-06",
            "source": "rt"
        },
        {
            "content": "I love things that make light of religion, and this does just that.",
            "review_date": "2012-11-05",
            "source": "rt"
        },
        {
            "content": "If you haven't watched it, you haven't lived",
            "review_date": "2012-11-04",
            "source": "rt"
        },
        {
            "content": "Absolutely hilarious. My favourite of the python movies.",
            "review_date": "2012-10-28",
            "source": "rt"
        },
        {
            "content": "Brian of Nazareth is an average guy who gets mistaken for the messiah.  Quite a few funny parts to this one and plays to perhaps Python's greatest strength - poking fun at religion.",
            "review_date": "2012-10-27",
            "source": "rt"
        },
        {
            "content": "Splendid demonstration of English comedy.",
            "review_date": "2012-10-24",
            "source": "rt"
        },
        {
            "content": "The most perfect comedy of all time, how can anyone surpass this , just watch all that goes on in the background \" seven bladed sword not two not four but seven and I'm talking to you sir \".",
            "review_date": "2012-10-20",
            "source": "rt"
        },
        {
            "content": "\"always look at the brightside of life\" (whistle) enough said.",
            "review_date": "2012-10-19",
            "source": "rt"
        },
        {
            "content": "Hilariously blasphemous. Or is it? There is a fair point to be made that this isn't a parody about Jesus, but instead about the guy who happened to live next door. And he is definitely not the messiah; he's a very naughty boy. Probably the best comedy of all time.",
            "review_date": "2012-10-19",
            "source": "rt"
        },
        {
            "content": "Its Monty Python- its pretty stupid comedy but still undeniably enjoyable with lots of good laughs.",
            "review_date": "2012-10-17",
            "source": "rt"
        },
        {
            "content": "This movie is nowhere near as funny as The Holy Grail but Life Of Brain does spawn some powerful laughes with Brains Mother. Brain Cohen was born on Christmas day. He is believed to be the messiah by many people. When he fails to hear any of the Sermon of the Mount his adventure follows him being chased by romans and meeting aliens. Brains Mother Might be one of the only things in the movie they made me laugh hard. Not to mention the roman scene where Pontius says ridiculously funny names. But its all talk and no fun for the most part. The talk is so stale that it bored me to death not to mention its dreadfully long. The music is wonderfully composed. The opening credits scene is so awfully made 3/4 of the time I couldnt tell who's names were being shown. The most memorable line of the movie is when Brain's Mother Said \"Now You Listen Here, Hes Not The Messiah, HES A VERY NAUGHTY BOY!\" That had me laughing out hard. But by far the best part of the movie is the ending of the film where the finale of the film is the music number \"Always Look On The Bright Side Of Life\" it is such a good music number that it should have been nominated for a oscar for best original song. Monty Pythons The Life of Brian isnt that funny but it still worth a watch.\n\n74/100 B-",
            "review_date": "2012-10-12",
            "source": "rt"
        },
        {
            "content": "Una de las 10 peliculas que me llevaria a una Isla Desierta, siempre y cuando pudiera verla en VO, ya que posiblemente el gag de Biggus Dickus es mi preferido de todos los tiempos... y Always look on the Bright side of live...",
            "review_date": "2012-10-05",
            "source": "rt"
        },
        {
            "content": "Sketch comedy assembled to produce a satire told in line with the life and times of Jesus Christ. The most memorable of their feature films, this Monty Python farce eclipses the majority of their contributions to film and television.",
            "review_date": "2012-09-30",
            "source": "rt"
        },
        {
            "content": "The best comedy ever?",
            "review_date": "2012-09-29",
            "source": "rt"
        },
        {
            "content": "My favorite comedy film ever! Chapman in this is brilliant, as well as the other Pythons. The story-line is good but very silly! All time best Python film!",
            "review_date": "2012-09-28",
            "source": "rt"
        },
        {
            "content": "Possibly Monty Python's funniest offering in that it is not just silly but also smart and sharp.",
            "review_date": "2012-09-26",
            "source": "rt"
        },
        {
            "content": "Is not as good as critics say.",
            "review_date": "2012-09-23",
            "source": "rt"
        },
        {
            "content": "Not nearly as catchy as Holy Grail",
            "review_date": "2012-09-19",
            "source": "rt"
        },
        {
            "content": "The  multiple characterization of each and every character is handled so perfectly that you will not find a hint of one character in the other thanks to a wonderful direction from Terry Jones and his troop.",
            "review_date": "2012-09-17",
            "source": "rt"
        },
        {
            "content": "always look on the bright side of life..\nhu hu hu hu h..\nthis movie is brilliantly made.. \nvery funny how a person can easily be worshiped as a god.. hahaha",
            "review_date": "2012-09-15",
            "source": "rt"
        },
        {
            "content": "A very funny satrization of biblical events and beliefs.",
            "review_date": "2012-09-14",
            "source": "rt"
        },
        {
            "content": "I donâ(TM)t like old movie and I usually donâ(TM)t watch them but since I saw Citizen Kane I try to watch some who I maybe would like. But â~Life of Brianâ(TM) was awful, it was confusing and not funny at all.",
            "review_date": "2012-09-09",
            "source": "rt"
        },
        {
            "content": "Always look on the bright side of life.\n\"Life of Brian\" ist eine Parodie; ber eben meistens auch intelligent\nStellenweise muss man sich natürlich über so viel Dummheit und Missgeschick ans Hirn fassen.\nAber so werden sowohl Terroristen, Mütter, Nachfolger, Söhne, Händler und Traditionalisten, Lispler, Asketen und Regenten auf den Arm genommen.\nInmitten all diesen Chaos müht sich ein unschuldiger Brian ab dem Wirrwarr zu entkommen.",
            "review_date": "2012-09-09",
            "source": "rt"
        },
        {
            "content": "Funnier than the previous Monty Python film.",
            "review_date": "2012-09-07",
            "source": "rt"
        },
        {
            "content": "One of the funniest films ever made.",
            "review_date": "2012-09-07",
            "source": "rt"
        },
        {
            "content": "One of the funniest movies of the last 30yrs.",
            "review_date": "2012-09-05",
            "source": "rt"
        },
        {
            "content": "Full frontal male nudity!",
            "review_date": "2012-08-26",
            "source": "rt"
        },
        {
            "content": "can't go wrong with python",
            "review_date": "2012-08-24",
            "source": "rt"
        },
        {
            "content": "I recently turned to British Comedy and enjoy the Monty Python classics.\nHowever, The Life of Brian is interesting for the first half, but it falls apart as the film progressively becomes annoying to watch. It just feels so much different than the first two films, even though they try for the same type of comedy.\nBeing raised a Christian, I find this film very funny, even if it is somewhat controversial to my religion.",
            "review_date": "2012-08-23",
            "source": "rt"
        },
        {
            "content": "Some iconic scenes and some seriously funny moments elevate this low budget movie to near greatness. However, certain scenes, such as the alien interlude, just don't work. Overall though, Brian is a film which puts a big smile on your face.\nIn my humble opinion this is Python's best film, which obviously means it's bloody good.",
            "review_date": "2012-08-21",
            "source": "rt"
        },
        {
            "content": "The guy saying he was stuck on the cross a bunch of times and had his brother cut him down at night was funny.",
            "review_date": "2012-08-16",
            "source": "rt"
        },
        {
            "content": "Religious satire at its finest.",
            "review_date": "2012-08-16",
            "source": "rt"
        },
        {
            "content": "A humorous take on religion that is just as ridiculous as Holy Grail",
            "review_date": "2012-08-15",
            "source": "rt"
        },
        {
            "content": "Wait till Biggus Dickus hears of this!",
            "review_date": "2012-08-14",
            "source": "rt"
        },
        {
            "content": "A classic, bold comedy. It was a brave move parodying one of the world's largest religion's, but any offense aside it was well pulled off. Very funny.",
            "review_date": "2012-08-13",
            "source": "rt"
        },
        {
            "content": "Religious satire at it's best!!!",
            "review_date": "2012-08-12",
            "source": "rt"
        },
        {
            "content": "HAHAHAHAHAHHAHA\nIoved it",
            "review_date": "2012-08-11",
            "source": "rt"
        },
        {
            "content": "My least favorite Monty Python anything.",
            "review_date": "2012-08-09",
            "source": "rt"
        },
        {
            "content": "\"But how should we eff off?\"",
            "review_date": "2012-08-09",
            "source": "rt"
        },
        {
            "content": "One of my top five film. Lmao funny!",
            "review_date": "2012-08-06",
            "source": "rt"
        },
        {
            "content": "Brilliant film. I remember my Father telling me about all these religious comunities protesting outside the cinema.",
            "review_date": "2012-08-06",
            "source": "rt"
        },
        {
            "content": "If you're a fan of \"Monty Python\" I'm sure that you'll enjoy \"The Life of Brian\" on some level, and their is some witty jokes on it, but over-all the repetitiveness and the voices were a little over the top.",
            "review_date": "2012-08-02",
            "source": "rt"
        },
        {
            "content": "Apesar de tratar de judeus e romanos, traz ironias incrivelmente fodas que podemos relacionar com os dias atuais. É a humanidade caricaturada.",
            "review_date": "2012-07-25",
            "source": "rt"
        },
        {
            "content": "It was really amazing to see Monty Python step into the world of serious humor in this awesome comedy with dark political and religious undertones.",
            "review_date": "2012-07-24",
            "source": "rt"
        },
        {
            "content": "A hilarious movie! I personally liked it better than \"Holy Grail!\"",
            "review_date": "2012-07-22",
            "source": "rt"
        },
        {
            "content": "I can't believe I waited so long to see this movie.",
            "review_date": "2012-07-21",
            "source": "rt"
        },
        {
            "content": "As usual for Monty Python, it may seem silly and ridiculous, but that element is the reason for its charm. I also liked what Brian had to say very much. I honestly don't see the point to the controversy it started, we had a debate just because a few fanatics complained that people liked this movie.",
            "review_date": "2012-07-18",
            "source": "rt"
        },
        {
            "content": "I have to say first and foremost, I've been raised on \"The Holy Grail\".  It's literally a part of my birthright; my father instilled it upon me as a child and it shall never be forgotten.  Thank You Dad for exposing me to this excellence, it literally changed my life.  \n\nNow, onto Life of Brian.  I didn't see this until years after I was exposed to the Monty Python world, but it definitely had its impact.  This is a much more political and satirical story, but it proves itself among the few as one of the greatest films ever made.  The plot focuses on a young man named Brian, who incidentally was born on the same night as Jesus Christ, and is repeatedly mistaken for the Messiah.  It touches on issues of religion, government, entertainment, and general point of view in a forcefully literal way, but it manages to make some valid points.\n\nThe opening sequence is awesome, the plot is solid, and the conclusion is right on the nose!  If you've heard Q102 at 9am on a weekday, you will understand.  This movie is monumental, the comedy equivalent of Ben-Hur.  Monty Python fans will agree this is their best work.  All others should agree this is a pretty Goddamn funny movie.",
            "review_date": "2012-07-09",
            "source": "rt"
        },
        {
            "content": "Sick sense of humor and that is why I love it.",
            "review_date": "2012-07-06",
            "source": "rt"
        },
        {
            "content": "not as good as the other two imho",
            "review_date": "2012-07-03",
            "source": "rt"
        },
        {
            "content": "Monty Python is LAME!  NEVER make any Monty Python joke to me and you might die of natural causes, not from me choking your dumb ass.",
            "review_date": "2012-07-01",
            "source": "rt"
        },
        {
            "content": "As always, Monty Python provides a laugh.",
            "review_date": "2012-07-01",
            "source": "rt"
        },
        {
            "content": "\"Crucifixion?\"...\"Yes.\"...\"Good. Out the door, line on the left, one cross each.\" As always, The Pythons deliver. I'll keep this one brief, cuz honestly, how much do you have to say about a MP flick? It's flawless. Very satirical, dirty, and dumb, just the way it should be with these guys. I love how all 6 members of the troupe each play a minimum of 3 characters. I can't even pick out a favorite. Psh, Eddie Murphy doesn't stand a chance against these dudes. Yeah, I basically loved every minute of it. Now I gotta start watching Flying Circus!",
            "review_date": "2012-06-30",
            "source": "rt"
        },
        {
            "content": "I can't understand a word that these people are saying.",
            "review_date": "2012-06-24",
            "source": "rt"
        },
        {
            "content": "Oh! Happy are the MEEK! Oh how nice....they in't got much to be happy for!",
            "review_date": "2012-06-18",
            "source": "rt"
        },
        {
            "content": "dont like monty python.",
            "review_date": "2012-06-18",
            "source": "rt"
        },
        {
            "content": "Quite possibly funnier than Holy Grail, if only because it's more daring and less popular.",
            "review_date": "2012-06-18",
            "source": "rt"
        },
        {
            "content": "He's not the messiah! He's a very naughty boy...",
            "review_date": "2012-06-17",
            "source": "rt"
        },
        {
            "content": "One of the funniest films you will EVER see. Not much more to say really. Despite the silliness (which is really what makes it funny) everything is just so well thought through! Whether it's a joke or just an appropriate movement, it all comes at exactly the right moment. Watch this before you die. You won't regret it.",
            "review_date": "2012-06-17",
            "source": "rt"
        },
        {
            "content": "seen parts all funny",
            "review_date": "2012-06-16",
            "source": "rt"
        },
        {
            "content": "Another great python movie and very funny one of that. I think it cuts slighly above the rest due to its edgy content and satire, it is well written and actually has a fairly good story to it. Plus the characters within (mainly Brian however) are are relatable and you can sympathise with brian a fair bit i think. This actually is what is lacking in all the other python films so its a well thought out film. I think it is still really funny and doesn't lack any of the python charm that either any of the film or series had.\nIt is probably the only film-like of all the python films, since the othe python films tend to be more like hidden sketches in an hour and a half slots. It also carries a simply but really great message about religion and im glad that people rate this film so highly. I think if your religion turned you off this film, i think its a great shame, but and it cleverly states in the film, \"You're all individuals and you're all different\", its a very true message and I like to think that anyone should be chose to watch or not watch this film. Though im really glad I did!!",
            "review_date": "2012-06-14",
            "source": "rt"
        },
        {
            "content": "Some great satire and completely unnecessary male nudity.  Very funny.",
            "review_date": "2012-06-14",
            "source": "rt"
        },
        {
            "content": "My first film with the entire crew from Monty Python (their third feature-length film), whilst I count out Terry Gilliamâ(TM)s TIME BANDITS (1981, a 7/10), which is sort of a post-break-up solo activity (in spite of Cleese and Palinâ(TM)s participation). \n\nWhat can I say? Due to the cultural disparity, comedy maybe the most possible film genre which is predisposed to feel outdated, especially for those from non-native audience. I could only squeeze some scattered laughter to cater for the film, which is a parody of the life of Jesus Christ grafted in a mistaken Messiah with a hotchpotch of haphazard mess and ridicule.\n\nMaybe the film should have a default setting for its viewers, because being an agnostic, I could hardly get the film, thus there is a possibility if one acquires more religious backdrops, there is a chance he or she could appreciate it more. Also it is a perplexing question mark in my mind, how could this film manages a 8.2 out of 10 rating and listed among top 250 in IMDB? (I had the same doubt when encountering THE PRINCESS BRIDE 1987, a 6/10). \n\nSo back to the film itself, the acting is fairly passable (John Cleese and Michael Palin are hilarious in their deadpan performances, but the mis-pronunciation gags are a bit over-abused). Among all the intentional tricks, the paragraphs of pursuing the Messiah and Eric Idleâ(TM)s rib-tickling Loretta are my picks. \n\nIt is no surprise this religious satire would provoke some blasphemy controversy, but the nerves and unconventionality are what should be admired, but if we separate the film from any context liaisons, the film is merely a modest farce, take the example of the ending, when the crucifixion scenes arrive, a sudden bathos ultimately reduces any putative knockout accompanied by the schmaltzy rendition of ALWAYS LOOK ON THE BRIGHT SIDE OF LIFE (which I find enjoys a more suitable circumstances in AS GOOD AS IT GETS 1997).",
            "review_date": "2012-06-09",
            "source": "rt"
        },
        {
            "content": "A great satire from the pythons!",
            "review_date": "2012-06-08",
            "source": "rt"
        },
        {
            "content": "Arguably the most brilliant religious satire ever filmed.  Who would have thought getting crucified and/or stoned to death could be so funny?",
            "review_date": "2012-06-08",
            "source": "rt"
        },
        {
            "content": "Ten for that? You must be mad!",
            "review_date": "2012-06-08",
            "source": "rt"
        },
        {
            "content": "I had so much hope for this movie, but it failed me.",
            "review_date": "2012-06-01",
            "source": "rt"
        },
        {
            "content": "Not as iconic as the Holy Grail, but probably more clever.",
            "review_date": "2012-05-27",
            "source": "rt"
        },
        {
            "content": "Monty Python. How can this be bad?",
            "review_date": "2012-05-23",
            "source": "rt"
        },
        {
            "content": "I feel bad for writing a bad review when it comes to British comedy, but life of Brian was a snore. Was not Monty Pythons best piece of work by any means.",
            "review_date": "2012-05-19",
            "source": "rt"
        },
        {
            "content": "Its good but not as good as holy grail & meaning of life but still got some excellent parts. The space ship scene is probably the greatest minter python scene, like ever... Besides all the false starts in holy grail ...mousse & llamas",
            "review_date": "2012-05-18",
            "source": "rt"
        },
        {
            "content": "Life of Brian is an instantly memorable Python classic, but it's also much more than that. Back in the 70's, this was a very cutting-edge film that took sharp stabs at not just the church, but also what it was to zealously worship a poor man who was thought to be the messiah, except this guy is actually a very naughty boy. The film itself might seem silly to some people, but that's the point. Monty Python were very good at abstract gags, and in this film, the gags manage to be very consistent with the theme without resorting to religious slapstick. The characters are simply classic, and each scene in the film has its own great moments. It's not for everyone, but it doesn't have to be, because this was a great film, and it will continue to be great for decades to come.",
            "review_date": "2012-05-12",
            "source": "rt"
        },
        {
            "content": "One of the top 10 greatest movies ever.  Unbelievably hilarious.",
            "review_date": "2012-05-10",
            "source": "rt"
        },
        {
            "content": "This movie is one of the best ever delivering some of the funniest lines ever said on film",
            "review_date": "2012-05-09",
            "source": "rt"
        },
        {
            "content": "My most favourite film of all time",
            "review_date": "2012-05-06",
            "source": "rt"
        },
        {
            "content": "A must-see for any Python fan!",
            "review_date": "2012-05-03",
            "source": "rt"
        },
        {
            "content": "Brilliant, funny and creative, another Monty Python classic.",
            "review_date": "2012-04-29",
            "source": "rt"
        },
        {
            "content": "The Pythons' 1979 movie has its moments but doesn't replicate the random, whimsical nature of the TV series as well as its predecessor \"Holy Grail.\" It's altogether too linear and plotted for the Pythons, with few of the nonsequitur segues and tangents that defined \"Flying Circus.\" Religious fundamentalism is far too easy a target for the cerebral troupe, and the scenes never end quickly enough after the points have been scored. Satire was always an important part of their act, of course, and there are some very funny instances of it here at the expense of the People's Front of Judea (PFJ) and its similarly-named but much-despised splinter groups, but nothing quite as sharply-written as the exchange with the anarcho-syndicalist peasant in \"Holy Grail.\" The best bits here, apart from the hilarious and memorable closing song \"Always Look on the Bright Side of Life\" sung with perfect earnestness by Eric Idle, is more low-brow: Romans with sophomoric names that send the centurions into uncontrollable giggling fits, and straight-faced full-frontal nudity. Some religious groups and even entire nations (Ireland and Norway) took the Pythons' bait and reacted with great offense to the release of \"Brian,\" a fact that says a lot more about the time period than it does about the movie, which hardly justifies such a response. From a contemporary perspective \"Flying Circus\" seems far more subversive than \"Brian\" in the sense that it forged new comedic ground and tested the limits of the television format. \"Brian\" doesn't reach beyond what the Pythons had already achieved, but it is a passable enough imitation.",
            "review_date": "2012-04-28",
            "source": "rt"
        },
        {
            "content": "Ok so it's not the Holy Grail - but it sure is Python fun!",
            "review_date": "2012-04-28",
            "source": "rt"
        },
        {
            "content": "An absolute tasteless satire on the religious movements, this film never ceases to entertain with its dark sarcastic humor and the usual Pythonesque gimmicks",
            "review_date": "2012-04-24",
            "source": "rt"
        },
        {
            "content": "Satirical and funny, and only offensive to those who don't look on the bright side of life. Both the religiously devout and the religiously without can enjoy its pointed humor.",
            "review_date": "2012-04-24",
            "source": "rt"
        },
        {
            "content": "Many people find this movie offensive, but they also lack a sense of humor.  Brilliantly written & performed, this movie is very funny!",
            "review_date": "2012-04-24",
            "source": "rt"
        },
        {
            "content": "It's not just a incredible satire to the fanatic religious people, but a masterpiece of the british cinema and comedy. Life of Brian is poignant, contoversial and entertaining \"biblical\" comedy and, of course an obligatory film to Monty Pyhton fans and English humor.",
            "review_date": "2012-04-21",
            "source": "rt"
        },
        {
            "content": "\"He's not the Messiah, he's a very naughty boy!\"",
            "review_date": "2012-04-17",
            "source": "rt"
        },
        {
            "content": "great comic film. all monty python stuff is good, but this is just genious. mix the bible with stupid, sexual, crude humor and, presto, magic! i love the crucifiction scene.\"always look on the bright side of life!\"",
            "review_date": "2012-04-17",
            "source": "rt"
        },
        {
            "content": "has the best ending in movie history. \"always look on the bright side of life.....\"",
            "review_date": "2012-04-16",
            "source": "rt"
        },
        {
            "content": "The just as funny but highly overlooked bastard brother of Monty Python and the Holy Grail.",
            "review_date": "2012-04-15",
            "source": "rt"
        },
        {
            "content": "NÃ¤stan lika bra som \"The holy graal\"",
            "review_date": "2012-04-15",
            "source": "rt"
        },
        {
            "content": "different movie. appears to be a parody of....",
            "review_date": "2012-04-14",
            "source": "rt"
        },
        {
            "content": "haha I have seen this and it is hilarious! Wasn't partial to the nudity though but it was so funny I will give it a pretty good score",
            "review_date": "2012-04-10",
            "source": "rt"
        },
        {
            "content": "An outstanding commedy!",
            "review_date": "2012-04-09",
            "source": "rt"
        },
        {
            "content": "Your father was a greek...too  funny...",
            "review_date": "2012-04-09",
            "source": "rt"
        },
        {
            "content": "Monty Python just is awesome!!",
            "review_date": "2012-04-08",
            "source": "rt"
        },
        {
            "content": "Los Monty Python se mofan de la vida de cristo y de los demÃ¡s fundamentos de la religiÃ³n... Hasta ahÃ­, estÃ¡ perfecto, sin embargo conforme avanza la pelÃ­cula el humor se vuelve deleznable y forzado, sin originalidad.... si no fuese por el Ãºltimo nÃºmero musical, la pelÃ­cula fuera una mÃ¡s del montÃ³n.",
            "review_date": "2012-04-08",
            "source": "rt"
        },
        {
            "content": "It's a comedy about Brian, a nameless individual who lives more or less at the same time and place as Jesus.  Brian stumbles through life in a more or less loosely-tied series of unlikely events (that is, sketches with a common spatiotemporal setting... and the same actors often play multiple roles, with amusing results).  This movie puts forth Monty Python's trademark style of intelligent, critical and absurd humor, with grat acting, costumes and sets.  It must be viewed more than once to be fully appreciated.  The storyline in itself lacks focus and seems pointless but it is not clear whether it is a by-product of the absurd humor style (the content thus mirroring the structure) or unintentional (they tried but they failed).  I'll go with the first hypothesis.",
            "review_date": "2012-04-07",
            "source": "rt"
        },
        {
            "content": "Impossible to say more about a film which has totally affected the way we view christianity",
            "review_date": "2012-04-05",
            "source": "rt"
        },
        {
            "content": "An absolute classic. It helped to define my own beliefs (or lack of) as an adolescent attending a catholic school. And hilarious to boot.",
            "review_date": "2012-04-04",
            "source": "rt"
        },
        {
            "content": "it's just something that everyone should see...  I'm just not sure why it's not in my dvd cabinet right now",
            "review_date": "2012-04-02",
            "source": "rt"
        },
        {
            "content": "This is my favorite monty python movie and when the other 2 are what they are that's a bold statement. Everything about this movie is perfect, plus it taught to \"always look on the bright side of life!\"",
            "review_date": "2012-04-02",
            "source": "rt"
        },
        {
            "content": "I've spent way too much time trying to decide for myself which film in the Python trilogy (And Now for Something Completely Different does not count, in my opinion) is my favorite. While I will probably never settle on a definitive answer, I do know this for sure: Monty Python's Life of Brian is the finest film the comedy troupe ever made. It never feels for one minute like a set of sketches or skits sewn together in the editing room. It feels like one whole complete story with the knee-slapping comedy dropped into it. For style, direction, story and social commentary, Life of Brian is the bee's knees of comedy films. On the other hand, I still feel that Monty Python and the Holy Grail is the most accessible and the funniest of the three films. I'm not putting down Life of Brian at all as it's hilarious in its own right, but Holy Grail, to me at least, is the diamond of their comedy routine, while Life of Brian is the diamond of their filmmaking abilities. To be more succinct, everyone should definitely check both of the films out at least once.",
            "review_date": "2012-03-31",
            "source": "rt"
        },
        {
            "content": "Hellarious! Raunchiness makes a better Monty Python movie!",
            "review_date": "2012-03-31",
            "source": "rt"
        },
        {
            "content": "It was definitely the worst Monty Python movie. Not funny. In some parts you actually have to struggle to stay awake.",
            "review_date": "2012-03-29",
            "source": "rt"
        },
        {
            "content": "One of my favorite comedies, all around. As quotable as any. A masterpiece, no matter what the Big-Noses say.",
            "review_date": "2012-03-29",
            "source": "rt"
        },
        {
            "content": "This is one of my favourite Monty Python's movies because they managed to successfully make fun of religious attitudes without making fun of the religion itself telling the story of Brian Cohen (played by Graham Chapman), a young Jewish man who is born on the same day as, and next door to, Jesus Christ, and is subsequently mistaken for the Messiah. A film which is relevant today as it was 30+ years ago or it could be 2000- years ago... why? Just ask a question : \"What have the Romans ever done for us?\" replacing the name Romans with one of your choice! Or just watch the events in the movie replacing the characters with people from your surroundings...\r\n\r\nFive years ago UK television station Channel 4 broadcasted an hour-long documentary called The Secret Life of Brian about the making of The Life of Brian and the controversy that was caused by its release. And the controversy was big! Themes of religious satire were so controversial at the time of its release that drew accusations of blasphemy and protests from some religious groups. Thirty-nine local authorities in the UK either imposed an outright ban, or imposed an X (18 years) certificate - effectively preventing the film from being shown. Some countries, including Ireland and Norway, banned its showing, with a few of these bans lasting decades. The film makers used such notoriety to benefit their marketing campaign, with posters stating \"So funny it was banned in Norway!\". \r\n\r\nControversy wasn't the only big thing - same was the influence on people watching it... especially artists and filmmakers! The alibi of the murderer in Simon Brett's comic thriller Shock to the System (1984) depends on having been in a cinema watching Life of Brian; the stoning scene is referenced in Terry Pratchett's second Discworld computer game; a clip of the stoning scene was shown in the music video \"Yang Yang\" by Anika in 2010; the scene in the ninth episode of 'South Park's fifteenth season, 'The Last of the Meheecans' where a naked Butters opens his window to find the townspeople in the street below hailing him as a god is a reference to the scene where the same thing happens to Brian...  Of course, the film was a box-office success, grossing fourth-highest of any film in the UK in 1979 and highest of any British film in the United States that year.  For me it is one of the great comedies all time! \r\n\r\nMy personal connection with the movie is the location of Monastir in Tunisia, where I spent some time and where Life of Brian production was reusing sets from Franco Zeffirelli's Jesus of Nazareth (1977).  This movie is very professionally done with lots of serious satire under the laughs, making it much deeper than most of the critics will admit. If you love smart satire, silly gags, singing along \"Always Look on the Bright Side of Life\" and everything else this movie has to offer, sit down with snacks and your favourite friends and laugh - if those friends are a rabbi, priest and scholar it could be even better.",
            "review_date": "2012-03-21",
            "source": "rt"
        },
        {
            "content": "Hilarious movie.  The Pythons never cease to amaze me with their comedic timing and jokes.",
            "review_date": "2012-03-17",
            "source": "rt"
        },
        {
            "content": "Really funny and really creative Life Of Brian is a comedy treat.",
            "review_date": "2012-03-10",
            "source": "rt"
        },
        {
            "content": "A must for any true maven of cinematic literature.",
            "review_date": "2012-03-07",
            "source": "rt"
        },
        {
            "content": "not nearly as good as the holy grail",
            "review_date": "2012-03-06",
            "source": "rt"
        },
        {
            "content": "Monty Python does it again!!!",
            "review_date": "2012-03-06",
            "source": "rt"
        },
        {
            "content": "It's one big joke with equal touches of class, fanaticism and ridiculousness.  Monty Python's Life of Brian is extravagantly clever social commentary.",
            "review_date": "2012-03-02",
            "source": "rt"
        },
        {
            "content": "funniest movie ive ever seen",
            "review_date": "2012-02-29",
            "source": "rt"
        },
        {
            "content": "Lmao, this one will deffinatly make you laugh and pick u up if your on a downer ^^ especcially if your against religion i think it's awsome, thanx Sparky for getting me to watch it and letting me borrow it from you",
            "review_date": "2012-02-27",
            "source": "rt"
        },
        {
            "content": "He has a wife, you know. You know what she's called? She's called... 'Incontinentia'... Incontinentia Buttocks",
            "review_date": "2012-02-27",
            "source": "rt"
        },
        {
            "content": "\"Always look on the bright side of life\"",
            "review_date": "2012-02-25",
            "source": "rt"
        },
        {
            "content": "Monty Python's most intellectual film, as well equaling their funniest work",
            "review_date": "2012-02-23",
            "source": "rt"
        },
        {
            "content": "Monty Python's personal best; it brings sacrilege to a higher and funnier level.",
            "review_date": "2012-02-22",
            "source": "rt"
        },
        {
            "content": "good, but the worst of the 3",
            "review_date": "2012-02-19",
            "source": "rt"
        },
        {
            "content": "Not my favorite, but the touchy subject (especially for the time) makes this movie all the funnier.",
            "review_date": "2012-02-17",
            "source": "rt"
        },
        {
            "content": "Vintage Python comedy with some great dialogue mixed in with some dated dialogue.  There are some parts where English subtitles would have been helpful as well.  Better than Holy Grail.",
            "review_date": "2012-02-13",
            "source": "rt"
        },
        {
            "content": "Always look on the bright side of life.",
            "review_date": "2012-02-09",
            "source": "rt"
        },
        {
            "content": "I don't find Life of Brian to be as funny as Monty Python's other film outings. It is nevertheless an exceedingly clever satire that contains some of the most memorable comedic scenes of all time.",
            "review_date": "2012-02-09",
            "source": "rt"
        },
        {
            "content": "\"Always look on the bright side of life\"",
            "review_date": "2012-02-08",
            "source": "rt"
        },
        {
            "content": "hahaha sum damn funny shit",
            "review_date": "2012-02-08",
            "source": "rt"
        },
        {
            "content": "Brian was born on the original Christmas in a stable next door to Jesus and from his birth and throughout his life he is mistaken for a prophet. This film caused some controversy on its release with religious groups as being blasphemous and mocking, but on closer inspection this is not a film out to change the world and peoples beliefs, it's simply a hilarious tale of Brian and his continuing mistaken identity. Brought to our screens by the Monty Python team this is, as expected, a riot of comedy and sometimes disjointed set pieces but they all come together as a rather splendid and timeless British comedy that never fails to raise numerous smiles and belly laughs. Full to the brim with brave and bold satire the likes of which had not been seen on cinema screens before. It's silliness is perfectly counterbalanced by it's cleverness, more structured and accomplished than their other films, razor sharp and well put together. These are just a few reasons why this is my favourite Python film and also one of the best British comedies ever made.",
            "review_date": "2012-02-05",
            "source": "rt"
        },
        {
            "content": "Monty Python's Life of Brian pulls off the rare feat of being a religious satire that is actually laugh-out-loud funny. Of course, it's no surprise that the Python group were able to poke fun at sacred conventions while avoiding the pitfalls of self-seriousness. On the the other hand, it is quite noteworthy that this story of Jesus Christ's doppelganger (Graham Chapman) can elicit such a surprising amount of sympathy from the viewer. Life of Brian matches the humor of Holy Grail while taking things to the next level.",
            "review_date": "2012-02-04",
            "source": "rt"
        },
        {
            "content": "\"It's not my cross. I was holding it for someone... Will you let me down if he comes back?\"",
            "review_date": "2012-02-03",
            "source": "rt"
        },
        {
            "content": "It was great, funny, witty and offensive at the same time. This is the group's greatest comedy and picture",
            "review_date": "2012-02-02",
            "source": "rt"
        }
    ]
}