{
    "rating": 9.2,
    "release_date": "1979-03-14",
    "num_reviews": 230,
    "genres": [
        "Comedy",
        "Drama"
    ],
    "summary": "Director Woody Allen's love letter to New York City stars Allen as frustrated television writer Isaac Davis, a twice-divorced malcontent facing middle age alone after his wife, Jill (Meryl Streep), leaves him for a woman. Isaac is dating fresh-faced Tracy (Mariel Hemingway), a high school girl he knows is wrong for him, and begins to wonder if he and brainy writer Mary (Diane Keaton), the mistress of his best friend, Yale (Michael Murphy), might make a better couple.",
    "reviews": [
        {
            "content": "My 2022 commitment to see every movie featuring Meryl Streep continues.\n\nIn 1979 she appeared in Manhattan, playing the ex-wife of Woody Allen's character.\n\nThe Gershwin soundtrack was sublime and the black-and-white cinematography of 1970's Manhattan was a buffet for the eyes.\n\nNow I need to go take a shower to get the stench of 96 minutes of Woody Allen repeatedly talking about his sexual prowess as he dates an underage girl (Mariel Hemingway) and hangs out with his unpleasant friends off of me.",
            "review_date": "2022-05-04",
            "source": "rt"
        },
        {
            "content": "Uninteresting confused movie that was a chore to get through.",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "My favorite Allen to date. I still find it hard to encompass the whole movie in one review with just two viewings, but everything I've grasped works for me. Brilliant cinematography thanks to an essential black & white; legendary soundtrack from the very first scene; typical Allen's wit at its finest distilled into a relentless screenplay; morally compelling and romantically universal. This masterpiece speaks to me, and it's hella fascinating to hear what it has to say. I'd watch it all again just to see Tracy paralyzed by her emotions around the end of the movie. We are but hostages of passions.",
            "review_date": "2022-02-08",
            "source": "rt"
        },
        {
            "content": "Allen's Manhattan is a director's lovingly idealized depiction of New York City, with glossy black and white cinematography making the landscape seem polished and ethereal. Towering buildings loom and landmarks stand like vaunted monuments; while the grime can't really be avoided in any depiction of New York ca. 1980, it's downplayed and treated like an oddly cherished part of the city's identity. At one point, we trail along behind a white Mustang as it cruises (alone) near the Hudson, listening in on the conversation between the passengers 30 feet ahead. There's no ambient noise, no traffic, no echoes from ten million other lives. It may not be realistic, but it does certainly look great. \n\nIn this somewhat fictionalized playground of the intelligentsia steps Woody Allen as Isaac Davis, the next name given to the same personality that Allen does in most of classics - fretful, highly educated, verbose, and with a sardonic wit. But that's because his character works so well, and is pretty much endlessly entertaining. Isaac forms the centerpiece of a network of current and former lovers, friends, and colleagues who explore the possibilities of companionship through a series of small-scale encounters and everyday meetings where their sincere discussions are intermixed with heavy doses of humor and sarcasm. The roles are all well-played enough for the film to function as a straight-up comedy, but as the runtime rolls on you begin to see that there is an emotional depth behind it all - nobody is sure of themselves, everyone is making it up as they go along, and the passions are fickle. In this carefully photographed NYC that is beautifully accentuated by the musical talents of George Gershwin, there is a commentary on love and life that will end up hitting surprisingly hard after getting you to let your guard down with some great comedy.\n\nThen you get thrown off by the middle-aged Allen having an openly sexual relationship with a 17-year-old girl, and you've got to spend the rest of your day muttering about how \"it was a different time,\" so you can keep liking the film. (4/5)",
            "review_date": "2021-11-13",
            "source": "rt"
        },
        {
            "content": "only one of the greatest, most iconic movies ever made. Gamechanger of gamechangers. Woody Allen is a genius!",
            "review_date": "2021-11-08",
            "source": "rt"
        },
        {
            "content": "A smart, funny, poignant and romantic movie that feels bad due to recent Woody Allen acusations.",
            "review_date": "2021-03-31",
            "source": "rt"
        },
        {
            "content": "Easily one of the very best films of the 1970s. Woody Allen confidently keeps the comedy and drama in perfect balance while coaxing luminous turns from Diane Keaton, Meryl Streep & Mariel Hemingway. George Gershwin's legendary music combined with Gordon Willis' genius black and white cinematography perfectly captures New York's energy and essence; it will never again be this romantic.",
            "review_date": "2021-03-27",
            "source": "rt"
        },
        {
            "content": "Impressive movie. Was sceptical about it first but was won over by its mesmerizing cinematography, its charm, interesting intellectual in a not-boring way dialogues and its ultimate optimism. Every character is distinct and so it gives more interest in watching them interact with each other. The character of Hemingway eventually wins the prize as the most humane.",
            "review_date": "2021-02-27",
            "source": "rt"
        },
        {
            "content": "Lorsque Manhattan arrive dans la filmographie déjà stellaire de Woody Allen, le film est déjà une partie intégrante de son oeuvre. S'il voulait qu'on comprenne ce qu'il est, Woody Allen n'aurait pas pu faire mieux que cette comédie dramatique aussi touchante qu'énervante et parfois même révoltante. Il y joue un quarantenaire en couple avec une fille de 17 ans (formidable Mariel Hemingway) qui découvre que le bonheur n'est pas ce qu'il espérait et qu'il ne peut pas le contrôler. Aussi répréhensible que cela puisse être (et le film le dit très souvent), Woody Allen semble parler de lui avec une sincérité proche de la gêne, n'a jamais été aussi névrosé, drôle et énervant et surtout est filmé par Gordon Willis, qui réalise certains des plus beaux plans de l'Histoire du Cinéma, surtout quand Allen est réuni avec Diane Keaton. Manhattan est un chef d'oeuvre absolu, un film parfois très dérangeant, sincère et empli d'une tristesse et d'une mélancolie inhérente quasiment impossible à évacuer.",
            "review_date": "2021-02-09",
            "source": "rt"
        },
        {
            "content": "Woody Allen and Diane Keaton together is just delightful to watch, while the film is full of romanticism, laughs,  astonishing humor and gets that classic feeling.",
            "review_date": "2020-11-02",
            "source": "rt"
        },
        {
            "content": "Love letter to Manhattan and to an idealized Woody Allen to be linked to Diane Keaton, Mariel Hemingway and Meryl Streep",
            "review_date": "2020-10-22",
            "source": "rt"
        },
        {
            "content": "I find it extremely humorous how in every woody Allen movie he makes himself out to be some attractive desirable guy that all the woman like . He clearly has some narcissistic tendencies but he doesn’t seem to be the creep he’s made out to be 3",
            "review_date": "2020-10-14",
            "source": "rt"
        },
        {
            "content": "Manhattan is a 1979 American romantic comedy film directed by Woody Allen 🍿 \n\nHere is Woody Allen in all of his glory. An intelligent screenplay and some amazing cinematography result in an enjoyable experience. \n\nIt's ok, but I feel mixed about this one 😉\nI'd recommend it if you like this genre, but if not then probably give it a miss 👍🏼👎🏼",
            "review_date": "2020-10-01",
            "source": "rt"
        },
        {
            "content": "Paedophilia propaganda romanticizing statutory rape.  Pervy balding men are irresistible to hypersexual young women.  Intelligent, defiant and confident women incite violence and attempted murder.  Disarmingly diffused with bumbling, neurotic and self effacing humour.  Set to stylish monochromatic cinematography and classical music.",
            "review_date": "2020-09-03",
            "source": "rt"
        },
        {
            "content": "This is another fun romantic comedy by Woody Allen. I have started a long journey of watching all his movies and after 5 of them, I have to say that all were just so delightful to watch. Manhattan was no different: it is fun, it has a good story, great dialogues and beautiful scenes of his beloved Manhattan. Isaac Davis is the main character here (played by Woody, who mastered in playing this similar character over and over), a 40 years old comedy writer that divorced twice and now continues to look for the one relationship of his life. He is currently dating a 17 year old girl who seems to adore him and with whom he seems to feel very safe and just himsef. In this relationship he is the experimented one who is in control of things, he seems to consider this as a temporary thing until he is able to find someone with a proper age. This already hints the feeling that shows up constantly in the movie: people expect to know what they want and feel, who they love more and selfishly chose the best option. Of course, reality is much more complicated than that. Yale, Isaac's close friend, has a marriage of more than a decade but is having his third affair with a woman named Mary. They clearly have strong feelings for each other but also feel a (hypocrite?) guilt for the secret relationship. Isaac meets Mary and, while he is completely annoyed in their first interaction by her intelectual arrogance, it already seems that they will be together at some point. As Yale struggles to find time to be with his mistress, Isaac starts to fill that role and gets involved with Mary as their first encounter suggested. After that, the movie goes on to show us more of the feeling pointed out before as people seem to be so concerned about finding their true love (maybe just true for some time) that hurting the others envolved becomes just an inevitable consequence. The turn of events then is as much unpredictable (at least to me) as the connection between Mary and Isaac was on the first encounter, showing how good directors might even use apparently predictable moments at their favor. Woody's direction in fact is one I am starting to appreciate a lot; I loved the initial scenes of Manhattan while he starts his book (already so indecisive about love and how to describe it), the shots that resembles old silent films are also very interesting and the length of most scenes just blew my mind (it must be a true test for good actors). The movie has a nice and simple story which is told at an amazing rythm that just feels like it is how it was supposed to be (no boring sections at all), there are several funny moments as usual, dialogues are simple but sharpe and entertaining and the beautiful wide shots of Manhattan just complete the whole thing. It might not be the most amazing film but what is not to love?",
            "review_date": "2020-08-13",
            "source": "rt"
        },
        {
            "content": "Really uncomfortable, Mariel Hemingway is the only high point.",
            "review_date": "2020-07-15",
            "source": "rt"
        },
        {
            "content": "Manhattan Pros: Fantastic Acting Amazing Directing Outstanding Writing Striking Cinematography Magnificent Editing Excellent Musical Score Brilliant Pacing Superb Storytelling Mixes comedy and drama well Sublime chemistry between each actor Cons: The storyline has a couple of predictable moments here and there Overall Grade: A (9.5/10)",
            "review_date": "2020-07-10",
            "source": "rt"
        },
        {
            "content": "You know those beautiful 17 year old women attracted to 42 year old balding, midget men who are failed tv writers? No, me neither.\n\nCreepy film. Only good thing about it is that it's twice as watchable as The equally rambling but even more boring Annie Hall.",
            "review_date": "2020-07-05",
            "source": "rt"
        },
        {
            "content": "Manhattan is a very good movie with excellent writing, a lot of depth and New York City in it's best movie role. George Gershwin doesn't hurt either.\nBut I see a movie that, when I first viewed it in college, made me pretty uneasy. Woody Allen with a beautiful girl was hard to understand. It didn't make sense. And then, there it is on the big screen in black and white. He gets girls that are pretty and younger -- so young that it's illegal -- so that he has power over them.\nIt's disgusting when you see he actually practiced this in his real life. Looking back, it takes a lot away from this movie.",
            "review_date": "2020-06-28",
            "source": "rt"
        },
        {
            "content": "I don't care if I'm the only one in the world that thinks it, but Woody Allen is one of the most overrated filmmakers I've ever seen.",
            "review_date": "2020-05-26",
            "source": "rt"
        },
        {
            "content": "Black and white just doesn't cut it.  The world is in color, why isn't the movie?  No young person wants to watch a movie such as this, and it is particularly galling because color was the standard film choice when the movie was made.  I do not agree with people who say that limiting the shots to black and white somehow \"improve\" the movie.  It may make it easier for the cinematographer and for Allen's storytelling, but it does nothing to illuminate or move along the story.  As a postcard this may work, but as a movie, something fluid and meant to be living, it is limiting and short-sighted.  A very poor choice that cannot be supported rationally.  It meaningfully detracts from the movie.",
            "review_date": "2020-04-10",
            "source": "rt"
        },
        {
            "content": "古い映画のくすんだ色も好きだけど、白黒だからこそ出せるNYの雰囲気がとっても良かった。街並みもインテリアもどれも素敵だけど、IsaacとMaryがプラネタリウムみたいな博物館をおしゃべりしながら見てまわるシーンが好き。",
            "review_date": "2020-03-29",
            "source": "rt"
        },
        {
            "content": "A love letter to the city in the first few minutes, then the movie itself, Manhattan had many of the subtle one-liners we associate with Woody (\"You're so beautiful I can barely keep my eyes on the [taxi] meter.\" was probably my favorite) but was just missing something more for me to push it into the 80s. Isaac (Woody Allen), forty-two and dating a seventeen-year-old definitely didn't age well, even if she (Mariel Hemingway) is the most mature character in the movie. And that might be the biggest issue I had with Manhattan, is that the main cast of characters are largely unlikable in a generally likeable movie. I suppose it's a microcosm of a piece of NYC that still exists today; successful, egotistical, neurotic people making problems for themselves, spending too much on rent, and looking at art. I also could've moved it into the 80s with a better ending. It was so shitty how Isaac treated Tracy, only for the film to want us to want them together in the end. It did give us that gorgeous shot of the Queensboro Bridge, however, even if the bench was never really there.",
            "review_date": "2020-03-24",
            "source": "rt"
        },
        {
            "content": "Literally shaking dude",
            "review_date": "2020-03-14",
            "source": "rt"
        },
        {
            "content": "Allen's greatest love letter to New York City. Allen, Keaton & Streep give solid performances and Hemingway was nominated for a Best Supporting Actress Oscar as Allen's young girlfriend. Magnificent cinematography done with wide-angle cinemascope and presented in black-and-white. The script is wit of the highest order. The selection of music is outstanding. Oscar-nominated story by Allen & Marshall Brickman examine impossible relationships and guilt complexes with witty humor and touching emotion. Irony, good acting and soundtrack always make a movie worth watching. And Manhattan can boast the best here . 8/10",
            "review_date": "2020-02-22",
            "source": "rt"
        },
        {
            "content": "Manhattan is a boring and worthless movie, that won't appeal even romance genre fans. What it does in a great way is show and explore New York places combined with a good soundtrack, but the rest is not appealing.",
            "review_date": "2020-01-31",
            "source": "rt"
        },
        {
            "content": "see myself , see everyone",
            "review_date": "2019-12-23",
            "source": "rt"
        },
        {
            "content": "One of the definitive love letters to New York City this is a film that provided an aspirational vision of adulthood to me at a young age as troubling as that thought was when revisiting the film. Watching the film now I see that it was as brilliant as I thought it was when I first saw it but in different ways as I was now able to look past the glamour of a group of highly intelligent people having conversations about art in a beautiful location to see how lonely all of these people were despite their talents and position in life. I no longer aspire to be divorced and can see that suffering is painful even if you look attractive or have seen several art films. With this ability to look past the surface attractions of the film I could see how it delved into the emotional confusion that people experience when they reach a certain point in their lives and begin to feel lonely.\n\nTelevision writer Isaac Davis, Woody Allen, has left his job ostensibly to write a boom but struggles to formulate ideas. He wallows in the pains he experienced during his relationship with his ex-wife Jill, Meryl Streep, who left him for her lesbian lover and is now writing a tell all book about their marriage. In trying to find himself he has fallen into a relationship with the sexually explorative teenager Tracy, Mariel Hemingway, who he attempts to break up with repeatedly. He eventually leaves her when he falls in love with a woman his own age in the damaged Mary Wilkie, Diane Keaton, who happens to be the former mistress of his married best friend Yale Pollack, Michael Murphy. Davis and Wilkie break up when she returns to Pollack and Davis finds himself alone despite trying to reconcile with Tracy.\n\nFor some this could be considered a better film than Annie Hall (1977), although I still like that film more, as it presents the audience with a tougher ending in that this man never really loved any of the women he was romantically involved with. His relationship with Jill was based on his physical desire for her as he often describes her as attractive while failing to take into account her combative personality or lack of attraction to him. Tracy is a girl that he uses to try to recapture his youth as he remains immature even though he knows about classic films and enjoys wielding a certain power over his inexperienced girlfriend while also having an ‘equal' in terms of maturity in many ways. Finally he falls into a romance with the equally tragic Wilkie who has her heart set on various men who she can not commit to because they either overwhelm her or do not provide her with enough of their time. She is shown to throw herself wholeheartedly into a relationship at it's beginning before backing away for fear of being hurt as all of the rejection she has experienced in previous relationships is recalled. He is not satisfied in his relationships with any of these women and is in a perpetual state of discontent as he wants what the other women can provide when he is with one of his love interests.\n\nWhy is it then that this sad little story of a weak man who does not understand his desires or needs makes New York City look so glorious? Mixed in amongst the depressing story and troubled characters are scenes in which characters visit the landmarks of the city which are seen in glorious black and white and set to a score full of classic songs. The opening and closing montages featuring shots of New York City feel exactly like what one imagines when they think of a stereotypical Woody Allen film and for good reason because few directors have the knowledge of the city that he does. There is one spectacular scene in which Allen and Keaton wander through a museum exhibit set in the solar system and without seeing their faces we understand exactly how each of them feels as they consider starting a relationship before he hesitates. Where the films of other New York directors focus on gangsters or plain middle class families Allen aims for insecure upper class Manhattanites who concern themselves with The Grand Illusion (1937) and Kierkegaard. It is too easy to be taken in by these people as they seem to know everything about culture and speak with authority but underneath all of this Allen tells us that even those living in the greatest city on earth can feel hurt, rejection and even love.",
            "review_date": "2019-12-18",
            "source": "rt"
        },
        {
            "content": "On par with his previous masterpiece Annie Hall Woody Allen's study of love life amidst New York intellectuals scores  with beautiful b&w cinematography and more subtle humor than before.",
            "review_date": "2019-11-11",
            "source": "rt"
        },
        {
            "content": "A great beginning, a mediocre middle, and a terrific ending.",
            "review_date": "2019-08-29",
            "source": "rt"
        },
        {
            "content": "Woody Allen at his best, interesting script and beautiful photography.",
            "review_date": "2019-05-17",
            "source": "rt"
        },
        {
            "content": "A perfect film. All of Woody’s genius, warmth, intellect, cynicism and humor in one of the best films of the 70’s. I’ve converted those who profess to ‘hate Woody Allen movies’ with this one.",
            "review_date": "2019-03-24",
            "source": "rt"
        },
        {
            "content": "Total MEH with a bit of YUCK. Woody Allen's real-life perversions are expressed within this dated crapper.",
            "review_date": "2019-03-04",
            "source": "rt"
        },
        {
            "content": "I gather this boring stuff is mostly loved by new-yorkers...",
            "review_date": "2018-11-26",
            "source": "rt"
        },
        {
            "content": "Manhattan tells a tale that is funny and romantic, even agonizing at times, but it never looses its optimistic core. Woody creates a web of relationships that are all so tangible and therefore make it hard for you not to relate to any of them.",
            "review_date": "2018-10-05",
            "source": "rt"
        },
        {
            "content": "Actually I'm disappointed because the movie didn't answer a lot of question, such as:\n\n* How on earth the tone slips so gracefully between the gut-busting one-liners and emotionally exhausting romantic moments like that?\n\n* How can a black-and-white film still be considered as one of the most beautiful movies ever with its gorgeous cinematography?\n\n* How can a 96 min film has such character development? * How can a single quote make a lot of change to the characters and the story itself?\n\n* How can a soundtrack that features only the rhythms of songs can speak for the hero at every stage he get through?  * How can a movie this complex and presents messages about love and loss seems to be so simple that can be rewatched. .... and many more questions left unanswered.\n\n\nMariel Hemingway performance is phenomenal! Hands down one of the smartest and most subtle screenplays ever written!\n\nBy far, Manhattan is the best Woody Allen movie. By the way, I'm a big fan of Annie Hall.\n\nThis movie is the definition of \"Bittersweet\"! \n\n(10/10)",
            "review_date": "2018-06-01",
            "source": "rt"
        },
        {
            "content": "I’d like to go on record in saying that I am pretty good at keeping my opinions about actors’ personal lives completely separate from my opinions of the films they make (and frankly I don’t know enough about whatever scandals Woody Allen has been involved in to form a strong opinion anyways.) But what his character does in a film I’m perfectly willing to judge. I struggled early with Manhattan because statutory rape just isn’t something I’m capable of chuckling about. This movie asks me to see it as no big deal and a genuine relationship I’m supposed to enjoy. Not only was the main character actively involved in this inappropriate relationship, everyone around him reacts to it with casual acceptance. When I tried to compartmentalize this one aspect of the film, I still didn’t find myself laughing much. The humor is mostly built around Woody Allen’s neurotic personality, and his struggle in romantic relationships. I liked the cast, and the actors do have good comedic timing, but few of the jokes resonated with me enough to get me laughing . I was annoyed by the fact that the characters were pretty despicable, and everyone made the worst decisions. As a result, I didn’t like anybody in Manhattan at all. Plus Woody Allen made the pretentious decision to film it all in black-and-white for no discernible reason. Manhattan is basically all the things I dislike about other Woody Allen movies all rolled into one. I’ve seen worse comedies, but Manhattan did little to interest me. ",
            "review_date": "2018-04-15",
            "source": "rt"
        },
        {
            "content": "Movie about a weird 40 something guy who dates a 17 year old girl. Didn't like it.",
            "review_date": "2017-12-16",
            "source": "rt"
        },
        {
            "content": "Stumbled on this movie by chance when surfing VUDU's free movie with ads category. This is a great movie, Woody Allen's fantastic take on romance in the Big Apple. I loved the opening monologue, setting the tone of the movie. The soundtrack is great, the black and white photography worked perfect for this film. See this movie, you will not be disappointed.",
            "review_date": "2017-12-05",
            "source": "rt"
        },
        {
            "content": "This film is like Woody Allen's mixed up version of Lolita, underage girl and man around forty in a fairly romantic  relationship but with an art-film vibe to it. Unlike Kubrick this film has more humor. Despite the controversy and raciness of this film, it is still a masterpiece.",
            "review_date": "2017-11-28",
            "source": "rt"
        },
        {
            "content": "He likes this one, she likes him, or is it the other him, oh but he likes someone else again - who cares!  Empty little soap opera with an upper-middleclass NY bent.  Pretends like it wants to see beyond its own nose, but doesn't really mean it.",
            "review_date": "2017-11-09",
            "source": "rt"
        },
        {
            "content": "An oddly satisfying commentary on the nature of love. Carried by Woody Allen's zany persona, along with phenomenal supporting actors, witty satirization, historical plot tangents, and verbose yet never dull dialogue. Not to mention a moving encapsulation of New York City's soul.",
            "review_date": "2017-08-01",
            "source": "rt"
        },
        {
            "content": "No. Creepy, negative, rambly, pretentious, unfunny, gross worst of human drama, not an ounce of real romance. Competent film-making though.",
            "review_date": "2017-06-16",
            "source": "rt"
        },
        {
            "content": "Good story,everybody plays very well in that movie,except Woody Allen absolutely disaster",
            "review_date": "2017-05-16",
            "source": "rt"
        },
        {
            "content": "I love Manhattan even more than I do Annie Hall. I think this has incredible themes off love, regret and maturity. The movie also looks beautiful, the cinematography of New York in black and white was truly stunning. The performances were terrific from the whole cast. Woody Allen is his usual negative self but more lovable and his comic timing is spot on here. As is Diane Keaton's, you can't take your eyes off here in this movie. Mariel Hemingway shows real maturity in her performance, similarly to her character. Michael Murphy and Meryl Streep also do some good work here in the scenes that they are in. This doesn't take the regular route of a romance film luckily, it is actually very unpredictable and has no set path, like love itself.",
            "review_date": "2017-04-22",
            "source": "rt"
        },
        {
            "content": "Aptly employing George Gershwin's music and filming in black-and-white, Woody Allen composes a love serenade to the titular borough and its neurotic romanticists in one of his adored productions.",
            "review_date": "2017-04-22",
            "source": "rt"
        },
        {
            "content": "Grade - B+\n'Manhattan' is a highly enjoyable addition to Woody Allen's filmography, with great performances and a witty script, all helped along by an excellent score by George Gershwin.",
            "review_date": "2017-04-03",
            "source": "rt"
        },
        {
            "content": "I don't think that there's any other movie that captures the essence and the beauty of what New York really is. Sure Taxi Driver does a marvelous job at showing New York but it's more so the underbelly of New York. Here, your getting to see how marvelous New York really is, and it's not even in color. Woody really nailed it to the tee. \n\nWhat a fantastic movie! Everything. The acting, the charm of the characters, the location, the writing. Everything.\n\nDefinitely deserves a re-watch.",
            "review_date": "2017-03-24",
            "source": "rt"
        },
        {
            "content": "If you ever wish to study cinema in any area, watch \"Manhattan\", it's a true movie lesson. First, its visual, the cinematography is so stunning that if this was a silent movie, the film would remain equally beautiful. The lighting in this movie is the greatest work done since The Godfather(1972). The way that Woody Allen shoots widely in closed places makes you feel inside the room. The chemistry between the actors, the naturalness of the dialogue and narration make this film completely unique and amazing. This is one of the greatest movie ever made.",
            "review_date": "2016-12-26",
            "source": "rt"
        },
        {
            "content": "even though woody allen is a creeper i liked the movie.",
            "review_date": "2016-10-30",
            "source": "rt"
        },
        {
            "content": "Director/screenwriter Woody Allen strikes gold once again in this glamourized, self-satisfying depiction of several lives and their relationships with one another in contemporary (late 1970s) Manhattan. Cast includes Woody Allen at his most neurotic and hyperanalytical, Diane Keaton at her most abrasive and concealed, Meryl Streep at her most fed up and antipathetic, Mariel Hemingway at her brightest and most easygoing, and Michael Murphy at his most cocksure and seesawy. Fragile, dry humour deflates the grandest romantic gestures committed in this story, and, without ever coming close to preaching, confronts the viewer with a necessary deconstruction and reconstruction of romance, commitment, and separation.",
            "review_date": "2016-09-20",
            "source": "rt"
        },
        {
            "content": "Well, petty distractions turned watching this movie into an 8 hour extravaganza of rewinding and replaying, but it delivered despite how I watched it. Woody Allen makes me feel better about life. Always. I love his masterful delivery of moving art, I love his storytelling, I love his depth, I love that I can always relate to him and like him no matter what horrible things people are doing to each other in the movie, and I love that he gives that perspective to acknowledge that people are just people and are going to be fallible but can still be beautiful and loveable and worthy full fledged humans, flaws and all.  I loved the movie in its entirety, but as always with me it comes down to the ending being what makes or breaks a movie, and this ending was beautiful. When I'm at my lowest, multiple Woody Allen movies have reminded me that life is still worthwhile, and I'm glad this was one of those. I needed it. It's weird when someone speaks to your soul and you know you'll never get the opportunity to thank them.",
            "review_date": "2016-09-04",
            "source": "rt"
        },
        {
            "content": "Essentially Annie Hall 2 but more complex and shot in glorious black and white.",
            "review_date": "2016-08-24",
            "source": "rt"
        },
        {
            "content": "A brilliant romance between New York (Diane Keaton) and Allen, who masterfully portrays both one's natural love for, and natural longing to leave New York City. Allen's use of black and white filming and Rhapsody in Blue in the beginning underscores the idea of people over romanticizing the city, and also explains the unanimous love for New York City. However, just like in his relationship with Tracy (Mariel Hemingway) Allen wants to break away, and move on. A beautiful parallel. Allen also accurately portrays the personality of many New Yorkers.\n\n\"Well, I don't get angry, okay? I mean, I have a tendency to internalize. I can't express anger. That's one of the problems I have. I-I grow a tumor instead.\"\n- Woody Allen\n\nAs somebody with a father who grew up in New York City, this line couldn't be more accurate. Truly the New Yorker way.\n\nAllen makes few mistakes in this film -- it was very deftly done. Definitely one of my top films of all time.",
            "review_date": "2016-08-12",
            "source": "rt"
        },
        {
            "content": "I'm starting to doubt my ability to understand what ends cinema is actually supposed to achieve.  When films such as Manhattan and Citizen Kane are regarded as great achievements, I begin to feel as if some mechanism is not functioning in my brain, or perhaps is over-functioning in everybody else's. \n\nThis is the story of a bunch of boring, unlikable, over educated but under-scientific privileged white people trying to create sexual relationships with each other.  Who cares?  Why do people enjoy these movies?  It didn't teach me anything, none of the character's behavior seemed admirable  or interesting.  \n\nThis movie reminds me of weak and asinine people, and doesn't do George Gershwin's music any justice.  (Although the brief dialogue about Gustav Mahler being overrated is the only thing that I resonated with in the film).  \n\nI'm going back to studying physics and listen to Beethoven now.  Bye.",
            "review_date": "2016-07-25",
            "source": "rt"
        },
        {
            "content": "\"-You know a lot of geniuses, y'know. You should meet some stupid people once in a while, y'know, you could learn something.\"",
            "review_date": "2016-06-29",
            "source": "rt"
        },
        {
            "content": "My go-to NY love letter. Really interesting narrative on relationships and how they intertwine uncontrollably.",
            "review_date": "2016-06-04",
            "source": "rt"
        },
        {
            "content": "Manhattan takes Woody Allen's love for New York plus women to a whole new level with being bittersweet and glorious in cinematography",
            "review_date": "2016-06-03",
            "source": "rt"
        },
        {
            "content": "One of Woody Allen's best films, Manhattan gives the viewer an inside look into the complexities of what love can truly represent to different people. Beautifully crafted, well-written, and well-acted, Manhattan is a triumph.",
            "review_date": "2016-05-06",
            "source": "rt"
        },
        {
            "content": "cinegeek.de Ich hatte ganz vergessen, wie wundervoll Woody Allens Manhattan ist und die Balance zwischen Komödie und Romanze mit traumwandlerischer Sicherheit hält! Einige Jahre lang hatte ich Manhattan nicht mehr gesehen und konnte mich nur noch an die witzigsten Einzeiler erinnern und daran, dass die Liebesgeschichte zwischen einem Mann älteren Datums und einem Schuldmädchen erzählt wird. Manhattan ist aber so viel mehr! Es ist kein Film über die Liebe, es ist ein Film über den Verlust. Der Soundtrack beinhaltet eine Menge romantischer Songs, die im Grunde gar nicht zum Film passen, dessen Protagonist Isaac (Allen) die Liebe gar nicht kennt. Seine Sommerliebe heisst Tracy (Mariel Hemingway, die Nichte des Dichters) und vordergründig hat sie mit Isaac nichts gemein. Sie hat aber das, was ein Liebhaber so dringend braucht: Die Fähigkeit, ihren Gegenüber zu idealisieren. Genau darin besteht der Geburtsfehler dieser Beziehung, weil sich Isaac dessen gar nicht für würdig erachtet. Er fühlt sich nicht als etwas Besonderes und sieht für sich und Tracy keine Zukunft. Angesprochen, auf ihr Vorhaben, in London zu studieren, weiss er nichts Besseres zu antworten, als dass sie ihn als schöne Erinnerung behalten soll. Die Hälfte der Zeit, in der sie zusammen sind, versucht Isaac Schluss zu machen - letztgültig mit Erfolg. Er sagt ihr, er würde eine andere lieben. Hemingway reagiert ganz simpel und herzzerreissend, während Isaac wie immer zu viel redet. In dieser Szene wird mir bewusst, dass ich die Figur des Isaac nicht mag. Er hat etwas Grausames an sich. Später erzählt er seinem Freund; ''I think I really missed a good bet when I let Tracy go\". Vielleicht hat er das, obwohl er bereits 42 ist und sie erst 17? Darum geht es aber nicht in Manhattan. Der Film handelt vom Zynismus und der Oberflächlichkeit solcher Menschen wie Isaac, die permanent um sich selbst kreisen, während sie kultiviertes Zeug quasseln. Die Trümmer seines Beziehungsleben umfassen ausserdem seine Ex-Frau (Meryl Streep), die nun den gemeinsamen Sohn mit einer anderen Frau gross zieht. Währenddessen schreibt sie einen Bestseller über ihre Ehe mit Isaac, der ernste Zweifel aufwirft, ob ihre neue \"Liebe\" sie genauso obsessiv hassen lassen kann? Dann hätten wir Isaacs Freund Yale (Michael Murphy), der seit Jahren verheiratet ist und nun eine Affäre mit Mary (Diane Keaton) pflegt. Genau wie Isaac pflegt er die Taktik, aus seiner Beziehung auszubrechen und der Frau anschliessend zu erklären, er hätte es nur zu ihrem Besten getan. So wie Isaac erklärt Yale Mary, sie hätten keine Zukunft und übergibt sie an seinen Kumpel: ''You'd be great for her.\" Zwischen Isaac und Mary entsteht eine Liebelei, bis Yale sie wieder zurück fordert und behauptet, er sei zuerst da gewesen. Beide Männer sind überfordert im Angesicht echter Gefühle. Manhattan handelt deshalb auch nicht von der gegenwärtigen Liebe, sondern der zurückliegenden. Es ist der Moment, wenn wir uns darauf besinnen, was wir gerade zerschlagen haben. Stellen wir uns Manhattan mal als konventionelle \"Romantic Comedy\" vor: Hier wären Yale und Mary das zentrale Paar, Tracy und Isaac ihre besten Freunde. In seiner ganzen Karriere aber hat Woody Allen daran gearbeitet, die Charaktere aus der zweiten Reihe in den Mittelpunkt zu schieben. Isaacs Beziehung zu Mary hat nichts von einer \"RomCom\". Sie ist kompliziert, da Isaac nicht weiss, ob er nun vorwärts gehen soll oder nicht? Was für eine grandiose Idee ist es deshalb, diese Beziehung vor dem Hintergrund Manhattans zu filmen - denn New York liebt Woody Allen nun wirklich! Manhattan heisst der heimliche Hauptdarsteller des Films und in den Strassenschluchten verschwinden die permanent quatschenden Neuroiker. Tatsächlich gibt es so einige Szenen, in denen jemand redet, den wir gar nicht im Bild erblicken. Isaac und seine Freunde werden auf so aus das reduziert, was sie sind: Nicht so wichtig (anders als sie selbst denken mögen). Die Untermalung mit Gershwins ''Rhapsody in Blue'' schafft es, dass wir uns transzendent fühlen, einfach hochtragend! Dazu die berühmten Gebäude und Orte wie Guggenheim, Elaine's, Zabar's deli... Isaac und Mary sitzen unterhalb der Manhattan Bridge und erleben den Sonnenaufgang. Sie spazieren durch den Central Park. Vermutlich bietet der Film so viele Insider, dass ich als Berliner gar nicht alles verstehen kann! Woody Allen weiss genau, wie einige Songs das Leben der meisten von uns untermalen. Für Isaac hat er den passenden Song ausgesucht: ''But Not for Me''. Unvergesslich, das Finale, als Isaac endlich merkt, mit wem er zusammen sein will und los rennt: ''Strike Up the Band\". All diese Schauplätze in Verbindung mit den Songs hätten nicht die Wirkung ohne Gordon Willis' Schwarzweiss-Fotografie, die Manhattan zu einem der schönsten Filme aller Zeiten macht! Dank Willis wird die Stadt zum Hauptdarsteller. Er erweckt sie zum Leben! Diane Keaton, die bereits ein Star war, bevor sie Woody Allen heiratete, spielt Mary. Sie ist eine Frau, die ihre Intelligenz vor allem dazu nutzt, um ihre Einsamkeit zu unterdrücken. Sie erklärt Yale, dass sie auf keinen Fall eine Ehe brechen möchte, obwohl sie da bereits eine Affäre mit ihm hat. Schliesslich ruft sie an einem Sonntagnachmittag Isaac an, weil sie einfach niemanden anderes kennt. Mariel Hemingway erleben wir in ihrer ersten Hauptrolle. Ihr Spiel ist so direkt und unaffektiert, dass es mich tief gerührt hat. Sie ist grösser als Isaac, der sie im sozialen Leben immer verstecken möchte. Tracy lässt sich aber nicht verheimlichen. Auf die Frage von Mary, was sie so machen würde, antwortet Tracy: ''I go to high school\". Woody Allen zuletzt, wird oft vorgeworfen, immer dieselbe Rolle zu spielen. Das ist reichlich unfair! Seine Figuren haben mitunter ähnliche Anlagen, Marotten und eine gewisse Ausdrucksweise - dennoch sind sie nicht eins. Isaac ist ein Mann von grosser Unreife, einer der nicht weiss, was er will. Gegenüber Tracy verhält er sich nichts weiter als selbstsüchtig und versucht sie sogar, von ihrem London Aufenthalt abzubringen. Beide wissen, dass ihre Zeit vorüber ist. Isaac ist unfähig, Pläne für die Zukunft zu schmieden. Er wird einfach nur die Vergangenheit bereuen und versuchen, daran herum zu basteln.",
            "review_date": "2016-04-28",
            "source": "rt"
        },
        {
            "content": "Near-perfect film that is both enthralling and comedic.",
            "review_date": "2016-04-05",
            "source": "rt"
        },
        {
            "content": "I liked this classic Woody Allen and it's honestly one of my favorite films of his filmography. It's a great film about New York and the people that live there. It's got its usual Woody Allen quirks and the love lives of the main characters are as weird as always, but I liked most of its characters. The music by George Gershwin is great and really affected how much I appreciated the film. Overall 'Manhattan' is one of Woody Allen's best and most enjoyable films.",
            "review_date": "2016-02-28",
            "source": "rt"
        },
        {
            "content": "That black and white photography really makes my eyes water, it's just gorgeous. One of my very favorite opening sequences to any film ever, and in the top 5 best Woody Allen films.",
            "review_date": "2016-02-19",
            "source": "rt"
        },
        {
            "content": "It's just pretty damn good, very much original.\nRewatching it, Mariel Hemingway was very real and beautiful with her character and almost makes the film what it is.",
            "review_date": "2016-01-09",
            "source": "rt"
        },
        {
            "content": "To laugh about yourself, to pretend and to dream something you won't be.\nSmart satyrical dialogues, great filming in B&W. It took a long time to finally watch this magnificent film.",
            "review_date": "2015-11-06",
            "source": "rt"
        },
        {
            "content": "Manhattan is such a good movie that is unfortunately creepy and too convoluted in premise, but is still so grounded in its characters, it has fantastic acting across the board, the cinematography and score are both terrific and the movie has such a sophisticated, cliché-ridden screenplay, great conversations and really good humor.",
            "review_date": "2015-10-30",
            "source": "rt"
        },
        {
            "content": "Classic. In every sense of the word.",
            "review_date": "2015-10-22",
            "source": "rt"
        },
        {
            "content": "I can't really get into this movie.  I love the look of the film.  Willis' black and white photography of New York is incredible.  Some of the performances are wonderful.  I'm particularly fond of Mariel Hemingway in this film.  I just cannot warm up to the story or any of the characters.  I don't demand of a film that I like the characters, but I do want to feel that the film knows that the characters are terrible people and has some idea of why they are.  I don't get that from this film, and I'm left with no real indication of why I should have watched a story about them.",
            "review_date": "2015-09-13",
            "source": "rt"
        },
        {
            "content": "My favorite Woody Allen movie. Absolute brilliance on every level. SIX stars out of five. :)",
            "review_date": "2015-09-11",
            "source": "rt"
        },
        {
            "content": "woody Allen is a child molester",
            "review_date": "2015-09-11",
            "source": "rt"
        },
        {
            "content": "Woody Allen and music by  Gershwin - what a combination Superb!",
            "review_date": "2015-08-03",
            "source": "rt"
        },
        {
            "content": "My favorite Woody Allen film is a loving post card to the great city.",
            "review_date": "2015-07-07",
            "source": "rt"
        },
        {
            "content": "A nice Woody Allen film with wonderful black and white cinematography, a rousing score, and winning performances from Diane Keaton, Woody Allen, and Meryl Streep.",
            "review_date": "2015-05-29",
            "source": "rt"
        },
        {
            "content": "Manhattan is a gem.it is smart funny and intelligent and there's a great look at relationship.",
            "review_date": "2015-05-29",
            "source": "rt"
        },
        {
            "content": "A little more serious than Woody Allen's other masterpiece, \"Annie Hall,\" but  \"Manhattan\" is just as witty and enjoyable.",
            "review_date": "2015-05-14",
            "source": "rt"
        },
        {
            "content": "If I could, I would rate this film 10 stars -- but that is not an option on Rotten Tomatoes. It is my opinion that this is one of the best films ever to emerge from American cinema. Gordon Willis' cinematography is magical.",
            "review_date": "2015-05-10",
            "source": "rt"
        },
        {
            "content": "This is my favourite Woody Allen film.  The dialogue is great and I absolutely love the B&W cinematography of Gordon Willis.  This film has to be one of the great films about NYC, Allen really makes the city almost a character in the film.  Highly recommended!",
            "review_date": "2015-04-04",
            "source": "rt"
        },
        {
            "content": "One of the better Woody Allen offerings. It got better as it went along. It started kind of slow: the first 30 minutes felt like just a bunch of scenes of people chatting with no real direction. But I thought it really picked up steam from the heartbreaking scene where Isaac breaks up with Tracy. Mariel Hemingway was the highlight of this movie, so great at such a young age. It was also cool to see a young Meryl Streep in a small part. I was conflicted about who I wanted Isaac to end up with, which I think is a credit to the screenplay. It's worth checking out.",
            "review_date": "2015-03-25",
            "source": "rt"
        },
        {
            "content": "Allen's real love affair in this movie is with Manhattan.",
            "review_date": "2015-03-07",
            "source": "rt"
        },
        {
            "content": "I surely won't watch another Woody Allen film...",
            "review_date": "2015-03-02",
            "source": "rt"
        },
        {
            "content": "A stunning visual poem on the unique beauty of Woody's home Manhattan, the introduction of his first post-Oscar comedy is a loving tribute. The entire film is shot in black & white with an abundance of gorgeous photography throughout. Allen plays another New York writer who gets involved with a complicated woman, this time it's after she ends her affair with his best friend. The plot is standard, but this is still a top 10 classic in the Woody cannon.\nAllen & Keaton both do an excellent job, as do Meryl Streep & Mariel Hemingway (who earned an Oscar nod), but all that is distracted by the one major flaw of this otherwise great film. Playing a 42 year old writer dating a 17 year old girl. At the time I'm sure it was odd at the time, but with all the rumors & allegations we have now about his private life, it's kind of unsettling to watch. He calls it out immediately at the beginning of the movie to normalize it but I doubt most people will ever be comfortable with his May/December choice. Of course, he leaves her for a woman that challenges him intellectually but Freud could have a field day with this. I find the ending to be completely false and unrewarding. Considering that this is Allen's least favorite of his own work I'm sure he agrees. \nThis was my favorite Allen movie in college with it's lush city imagery set to the tunes of Gershwin. Absolutely worth watching if you can get past the the ickiness.",
            "review_date": "2015-02-23",
            "source": "rt"
        },
        {
            "content": "Manhattan may be accessible to anyone who can relate to it's themes about love, the complexity of relationships, and bizarrely to forty year old's dating minors.  The glacier pacing however was off putting, the characters weren't engaging and their development seemed thin, and Woody's annoyingly relentless neurotic personality exacerbated the experience further.  The natural dynamics between characters and performances couldn't save Manhattan for me in the end.  Yet another underwhelming Woody Allen experience.",
            "review_date": "2015-02-13",
            "source": "rt"
        },
        {
            "content": "Truly amazing. Allen's most visually beautiful film with an incredible screenplay executed by a team of incredible actors. Full review later.",
            "review_date": "2015-01-30",
            "source": "rt"
        },
        {
            "content": "Manhattan is definitely one of my favorite films of all time. It not only is a smart and bittersweet human study, but also a witty comedy heavily based on the dialogue. The characters are so damn likable, and everything they say cuts through our heart. Just like Linklater's Before trilogy, this movie inspires me in many ways.",
            "review_date": "2015-01-28",
            "source": "rt"
        },
        {
            "content": "Captures the essence of New York like only Woody Allen can.",
            "review_date": "2015-01-10",
            "source": "rt"
        },
        {
            "content": "Came from the experience after \"Annie Hall\" in chemistry and some charms, Woody Allen's genuine best work done some emphasizing while under the same length with the charm growing at the processing speed, bringing up social points - a usual trait for these kind of films, occasionally showing some matching sense of humor, putting some energy to the spirit and the city of Manhattan in a black and white shine. The way Allen puts those pieces together is what made this his best work in an artistic form he usually take a liking of trying out in his films. (A-)\n\n(Full review coming soon)",
            "review_date": "2015-01-10",
            "source": "rt"
        },
        {
            "content": "Going into it, I wanted and expected to see a loving tribute to the greatest city in the world. I'll put it to you this way, the first scene is by far, the greatest use of New York City in film history. The movie that follows, doesn't quite live up to that. I remained interested, but I couldn't help but be repulsed by these overly privileged New Yorkers. Woody's character was the worst of them all. I hated him in this. He's literally romancing a child. This is the closest we're ever going to get to seeing Woody Allen's pedophilia in action. Not only that, it seems to be all about him here, more so than Annie Hall. If it weren't for the incredible backdrop, I would care less about everything.",
            "review_date": "2014-12-31",
            "source": "rt"
        },
        {
            "content": "As expected, a very well written story. I really cannot stand Woody Allen, though, and don't see how any woman could find him attractive. Yeah, I get the sense of humor thing, but he's so obnoxious. (waits for someone to comment about much I'm like Woody Allens character in my thoughts and views)\nThe relationship with him and the 17-year old girl is a bit pedo-creepy, and too close to real life for him. Why Mariel Hemingway won awards for this role is baffling as well, as I didn't think she was that good. \nThe gale guy was an idiot, and I just wanted to punch him. \nI still lik4ed the movie overall, but it's most certainly overrated.",
            "review_date": "2014-12-31",
            "source": "rt"
        },
        {
            "content": "If I made a movie about me dating a 12 year old with disproportionately large breasts in Chicago talking to my friends about the history of film where only character development occurs and minimal story, I want to believe that everybody would trash it like they damn well should. But Woody Allen is able to coast off of the critics who vicariously live through his role as a guy who dates a 17 year old with disproportionately big eyebrows and has absurd sexual success in a major cultural center, and a few legitimately hearty laughs. It's a good movie, but if you're one of the die-hards, please enlighten me.",
            "review_date": "2014-12-28",
            "source": "rt"
        },
        {
            "content": "Manhattan is a self-referential, self-deprecating if not an autobiographical work of Woody Allen. Focusing to a group of problematic and complex people in a sentimental urban setting, Manhattan offers more complexity and sentimentality than Annie Hall, although both of them were built on really similar blueprints. It is also brutally honest with abundant numbers of Freudian jokes and psychoanalysis.",
            "review_date": "2014-12-22",
            "source": "rt"
        },
        {
            "content": "This is Woody Allen at his finest.",
            "review_date": "2014-12-20",
            "source": "rt"
        },
        {
            "content": "Teeming with both genuine pathos and sheer hilarity, Manhattan is Woody Allen at the pinnacle of his considerable prowess and is only made more brilliant by its gorgeous cinematography and the beauty of the city is so dearly admires.",
            "review_date": "2014-12-18",
            "source": "rt"
        },
        {
            "content": "New York City is perhaps the only character large enough to overshadow Allen's trademark narcissism, and it appropriately stars in this film which encompasses byproducts of urban living, young adulthood, liberal self indulgence, and social exposition, fused together by an eye for city beauty, a reverence for history, and a timeless modern pulse.",
            "review_date": "2014-12-07",
            "source": "rt"
        },
        {
            "content": "\"I can't express anger. That's my problem. I internalize everything. I just grow a tumor instead.\"\n\nManhattan is a deserving classic. Allen's subversive script is used well in context and creates a well established system in which Allen delightfully tears down. The whole film is rough like Manhattan itself but just alike it contains a beautiful core.",
            "review_date": "2014-11-23",
            "source": "rt"
        },
        {
            "content": "***Due to the recent RT changes that have basically ruined my past reviews, I am mostly only giving a rating rather than a full review.***",
            "review_date": "2014-11-14",
            "source": "rt"
        },
        {
            "content": "Hermosa, con un humor tan ácido y a la vez romántico...",
            "review_date": "2014-11-05",
            "source": "rt"
        },
        {
            "content": "Being one of Woody Allen's most critically acclaimed pieces, Manhattan sounded like an intelligent film.\n\n\nFrom a stylish perspective, Manhattan presents a large step out for Woody Allen's tradition of filmmaking. It does not incorporate the same visual or story style to his trademark comic pieces as the film is more comedy-drama yet maintains the same form of atmosphere he establishes in a lot of his films. And in terms of visual style, the cinematography in the film is a lot more atmospheric as it takes on a wider range of angles and incurs more movement and editing than the standard piece. It establishes a feeling of isolation in the atmosphere for viewers and gives them a sense of peeking in on the underside of people's lives. This gives Manhattan a new level of complex depth to it and stronger meaning, and it allows the drama of the film to flourish. And the black and white style of the film gives it an interesting sense of nostalgia. It evokes memories to a much simpler time of cinema, and considering that Manhattan is a rather simple and easy film to watch. The black and white colour palette of the film and lighting evoke a truly classical feel, and that is a great thematic for a Woody Allen film because it makes it all the more meaningful coming from him, as if it is a stylish homage to the films he grew up with. The classical style of the musical score helps to add to this, so Manhattan really is an interesting experience.\nManhattan has the naturally lighthearted feel to it which makes it an easy viewing pleasure. It is not one of Woody Allen's funnier films, but the quality of the comedy in it is fine and it blends with the drama really well. Admittedly it is a rather familiar film in terms of subject matter, but it is still a touching sentiment which is crafter really well with a strong screenplay. The complicated exploration of relationships in Manhattan are an all new angle of exploration for Woody Allen. He has a natural knack for it, and in Manhattan he incorporates it with a new style of filmmaking. It is a very ambitious film, and while it is familiar and relatively slow in pace as well as so realistic in narrative that its drama can only hit a certain level of strength, it is an enjoyable experience. It is a gentle film with a lot of touching plot dynamics to it, although I feel that there is certain predictability to it. It is different to the predictability of a lot of his films as they tend to follow a formula. The thing about Manhattan is that the ending of the film is inevitable, and is somewhat of a letdown. Considering that it is another film about the relationship between characters played by Woody Allen and Diane Keaton, it has an ending to similar to Annie Hall from the preceding year. Both films are good, although Manhattan fails to reach the heights of Annie Hall. It is more stylish, but the fact that the ending is so similar makes it slightly disappointing. Considering the unpredictable nature of the film it would be hard to pick a perfect ending, but I guess I just felt that the one in Manhattan was a letdown which was a bit too similar to Annie Hall. But still, a lot of the other elements that Manhattan borrows from Annie Hall are good.\nAnd thanks to a fine cast, Manhattan remains a solid film on a human level.\nWoody Allen plays out a character less like his stereotypical nebbish than in many of his other films. This time he tones down to Jewish shtick and focuses more on a character who seems naturally like him. His performance is realistic and easily likable which makes the frequently cartoonish character a more humane one. This makes the sympathy in the film a lot stronger as the protagonist is one that audiences will more likely care about. Woody Allen's subtle comic approach to the material and legitimate dramatic work is just grand in Manhattan which makes it one of his greatest leading performances, and his chemistry with every other actor, particularly Diane Keaton, is just wonderful. I was thoroughly impressed with his leading performance in Manhattan as it is very far from indulgent.\nDiane Keaton does a fine job in Manhattan as well. She conveys a great sense of confusion and unpredictability in the role which makes her an intriguing character. Her emotional confusion contributes a great part to the film's exploration of complicated love in relationships, and she pulls it off really easily. Her role is ripe with charisma and finely dramatic without ever descending to melodrama or any sort of cheap comic ploy. She steps away from her iconic Annie Hall role to deliver another excellent performance in a Woody Allen film, so her presence as the leading actress is very welcome.\nMariel Hemingway proves to make herself a likable foil in Manhattan as well. She has a youthful spirit to her and her chemistry with Woody Allen is just great. She is sweet, and in her young age she is easily able to work the best out of Woody Allen's script which is impressive as it is such complex stuff. She makes a name for herself very well in Manhattan, and despite a small period of screen time she is easily memorable.\nMeryl Streep also delivers an early performance in Manhattan where viewers get to see her talents from the same year when she won the Academy Award for Best Supporting Actress in Kramer vs. Kramer. Her brief appearance contributes some grand moments to the film, so she is really genial.\n\nSo Manhattan is a rather slow film with a somewhat unsatisfactory  ending and a sense of familiar themes, but it is powerfully stylish, touching and extremely well-acted which makes use of all of Woody Allen's greatest talents.",
            "review_date": "2014-11-02",
            "source": "rt"
        },
        {
            "content": "The first time I viewed \"Manhattan\" in high school, it repulsed me in a way that I couldn't put into words. After giving it a second look, I now see that I perceived it to be Allen's declaration of his own self-absolution, an embracing of his deeply flawed nature (the 17 year-old love interest specifically), when in actuality it proves to be less of Allen forgiving himself of his sins and more of his own self-flagellation. The perfect rendering of New York, the sentimental and nostalgic social-construct of an idea of New York, is intoxicating and emotionally mirrors his sense of self, the two irreparably fused and co-dependent at the same time. With a bittersweet tone, wealth of critical insight, and impeccable production, \"Manhattan\" is a masterpiece, and rivals only the great \"Annie Hall\" for the title of Allen's most perfect work.",
            "review_date": "2014-10-23",
            "source": "rt"
        },
        {
            "content": "Woody Allen at his finest.",
            "review_date": "2014-10-17",
            "source": "rt"
        },
        {
            "content": "DiÃ¡logos excepcionales con el toque de Woody Allen ... Un clÃ¡sico !",
            "review_date": "2014-10-12",
            "source": "rt"
        },
        {
            "content": "Woody's 2nd best film. Mariel Hemingway really did it for me in this one, she was perfect.",
            "review_date": "2014-10-09",
            "source": "rt"
        },
        {
            "content": "those exterior shots of the City, and the Bridge! Wow! Photography is literally Amazing!",
            "review_date": "2014-09-22",
            "source": "rt"
        },
        {
            "content": "It's basically a slightly altered version of Annie Hall, Manhattan features the same characters as we're used to in a Woody Allen movie and also the same conflicts. Like always, the script is pretty witty, but this movie was rather disappointing",
            "review_date": "2014-09-21",
            "source": "rt"
        },
        {
            "content": "Review:\nThis movie is definitely a tribute to New York City. The scenery looks great throughout the film and the black and white theme, really does work. As for the movie itself, it just seemed like your typical Woody Allen movie, which are usually about relationships between friends and lovers. For 1979, this must have been a unique movie because of its mixture between comedy and serious relationship issues, which we all can relate to, but for this day and age, we have seen this type of film many times before. The relationship between Woody and the young girl was interesting, along with the ex-wife, played by Meryl Streep, whose become a lesbian after having a child with Woody, so there's enough material to keep the movie watchable. Personally, it does go down as some of his best work because he got everything right, but I'm still struggling to get his humour. Watchable!\n\nRound-Up:\nAfter watching some of Woody Allen's later work, I can see why everyone rated his earlier on projects because he had a unique style of directing/writing which is very dry and offensive but in a joking type of way. Half of his jokes in his earlier movies, wouldn't be politically correct for modern times, which is why it's easier to stick with Romantic Comedies. Anyway, Mariel Hemingway put it a emotional and realistic performance, at such a young age, and the rest of the cast made the movie believable interesting.\n\nBudget: $9million\nWorldwide Gross: $40million\n\nI recommend this movie to people who are into there Woody Allen movies about finding love and relationships with close friends. 6/10",
            "review_date": "2014-09-20",
            "source": "rt"
        },
        {
            "content": "While Allen's intelligence, capability as a director and love of the medium are evident in this well made film, it is very hard to ignore the feeling that you are looking at something from a narrow and limited perspective.",
            "review_date": "2014-09-17",
            "source": "rt"
        },
        {
            "content": "I liked Annie hall a lot better than this and I don't care who disagrees. For one, the characters were better - like able  and it was funnier. There was a really good love story. This one had a creepy love story btw him and a 17 year old which is rather gross considering all the scandals with him n young girls. What I do agree with like others is on good music, shots, and cinematography. The black and white imagery at night of the city is truly romantic and beautiful. I did feel like it was a good tribute to the city-showcasing all the arts, theatre, architecture, and activity manhattan has to offer. that's mostly all I liked of it other than some occasionally inciteful or funny dialogue. I couldn't stand him or Diane Keaton talking constantly referencing this artist or that pretentious pop culture thing-other big pet peeve.",
            "review_date": "2014-08-23",
            "source": "rt"
        },
        {
            "content": "Very interesting film, one of my favorites black & white films along with Raging Bull & Sunset Boulevard. Overall the dialogue is on point very sophisticated which creates this high class mood. Plus the 42 year old Mr. Allen relationship with the young 17 year is the frosting to the cake. Truly a classic and worth to watch.",
            "review_date": "2014-08-06",
            "source": "rt"
        },
        {
            "content": "Very unbelievable movie.  Woody Allen as a lady's man?",
            "review_date": "2014-08-02",
            "source": "rt"
        },
        {
            "content": "Woody Allen really knows how to create uncomfortable love situations that makes you feel completely comfortable about it.",
            "review_date": "2014-08-02",
            "source": "rt"
        },
        {
            "content": "A masterpiece.. humorous movie by the genius",
            "review_date": "2014-07-24",
            "source": "rt"
        },
        {
            "content": "Bittersweet humor, raw emotion, and captivating performances allow Manhattan to capture the gritty beauty of New York as well as it's intriguing, deeply complicated characters in one of Woody Allen's best.",
            "review_date": "2014-07-18",
            "source": "rt"
        },
        {
            "content": "Manhattan to this day remains a classic cinematic feat. It's a gorgeously filmed picture, filled with Woody Allen's signature accompanying storytelling. The performances feel real and the black and white strikes deeper than color. It's truly a wondrous film.",
            "review_date": "2014-07-09",
            "source": "rt"
        },
        {
            "content": "I am simply in love with this movie. Allen delivers some of the best dialogue in film that holds strong to this day. Witty and bittersweet, like I've come to expect from any Allen movie.",
            "review_date": "2014-07-07",
            "source": "rt"
        },
        {
            "content": "Woody Allen movies that he and Diane Keaton are in start to seem like the same thing after a while, but they're just so good. The love crazy stories between basically every character is so entertaining to follow, and the script is really honest and heartfelt.",
            "review_date": "2014-06-21",
            "source": "rt"
        },
        {
            "content": "It's overrated, but it has a lot of the angry humor and the compelling pessimism that was starting to creep its way into Allen's work at the end of the 1970s.",
            "review_date": "2014-06-15",
            "source": "rt"
        },
        {
            "content": "We can all see part of ourselves in Isaac/Allen. The film is nostalgic, wistful, yet with no intention of depicting a story from a single lens or to a single destination. What truly clicked within me are the few subtle moments filled with Isaac's mumbling and his looking away. Allen said \"he has no problem in meeting women\", yet with some careful thought, we realized he has no problem drawing women's attention, but failed at maintaining them. As in \"Chapter 1\", New York meant beautiful women and street smart guys who know all the angles. Isaac is witty, but not in the same way as the street smart guys. The women Isaac met are all beautiful, yet they're not particularly after Isaac's gifts. With an identity crisis, Isaac holds too strong of an ideal that's most likely developed from unsuccessful attempts with women and life. An intangible ideal is perfect for escaping reality and putting oneself at a higher ground above anything else. Yet Isaac is just an ordinary guy, with a witty sense of humor, chasing after delicately decorated faces, shaped by modern advertising, only with a romantic touch of his own interpretations. Allen Woody was absolutely incredible at interpreting the character that has struck my emotions so hard with the subtle, delicate moments.",
            "review_date": "2014-06-05",
            "source": "rt"
        },
        {
            "content": "I found the whole thing more unsettling than funny, particularly Woody Allen's character's romance with a teen, perhaps in part due to recent allegations. That was just something I couldn't get over, and colored the whole viewing.",
            "review_date": "2014-05-29",
            "source": "rt"
        },
        {
            "content": "I normally hate Woody's talkies, and this one is no exception. But I still give this film a full five-star for its exquisite black-and-white look - one of the best filmed film I've ever watched.",
            "review_date": "2014-05-22",
            "source": "rt"
        },
        {
            "content": "Beautiful black and white. Boring plot. Disgusting relationship between a 40 year old high maintenance creep and a 17 year old airhead. I know this was a different time but it kinda all makes sense given his current drama with the Farrows.",
            "review_date": "2014-05-21",
            "source": "rt"
        },
        {
            "content": "Mixing a devastatingly bleak depiction of New Yorker lifestyle with devastatingly bitter humor, what I take from Manhattan is not an ere of escapist romanticism, but an unflinching depiction of pure and utter existentialistic misery.",
            "review_date": "2014-05-20",
            "source": "rt"
        },
        {
            "content": "Clever, humorous and with Allen's signature all over the film, Manhattan is an instant classic.",
            "review_date": "2014-05-16",
            "source": "rt"
        },
        {
            "content": "If ever there was a movie that made New York City one of its characters, it was this one.\nAnd while it feels very similar to other Allen films (especially \"Annie Hall\"), the black and white really shows some good contrast between light and darkness, artistically.",
            "review_date": "2014-05-04",
            "source": "rt"
        },
        {
            "content": "\"Manhattan\" is Woody Allen's best movie so far, right up there next to Annie Hall. The film is an in-depth character study about relationships in the greatest city on Earth and how people affect each other. The movie is convincing with its amazing acting, wonderful story, and almost flawless screenplay. Woody gives his character such quirk and self conceit that you can't help but feel sorry for the poor man.",
            "review_date": "2014-05-01",
            "source": "rt"
        },
        {
            "content": "\"Chapter One: He was too romantic about Manhattan, as he was about everything else. He thrived on the hustle bustle of the crowds and the traffic. To him, New York meant beautiful women and street smart guys who seemed to know all the angles. Ah, corny, too corny for, you know, my taste. Let me, let me try and make it more profound.\"",
            "review_date": "2014-04-28",
            "source": "rt"
        },
        {
            "content": "Smarmy, holier-than-thou, arrogant New Yorker tone overpowers the obvious talent that Woody Allen has. This movie has its merits, but I'm just not a fan.",
            "review_date": "2014-04-25",
            "source": "rt"
        },
        {
            "content": "Slowly paced but refreshingly funny, Woody Allen's Manhattan is a quirky offbeat comedy that had me laughing practically the whole time. Although the plot doesn't really go much of anywhere, it goes farther than most comedies dream. Admittedly characters do get annoying but it all plays into the feel of the film. The cinematography is mindbogglingly good at some moments, but it's fitting as it has the same cinematographer as the Godfather trilogy. Through and through funny, and always a joy to look at. 4.5/5",
            "review_date": "2014-04-19",
            "source": "rt"
        },
        {
            "content": "\"A lot is my favourite number\"",
            "review_date": "2014-04-15",
            "source": "rt"
        },
        {
            "content": "Perfect up until the end.",
            "review_date": "2014-04-05",
            "source": "rt"
        },
        {
            "content": "Here there is a lot of previous Allen but also a more acute observation of the characters and their relationships, as well as an excellent picture of the city's atmosphere.",
            "review_date": "2014-04-03",
            "source": "rt"
        },
        {
            "content": "Woody Allen offers a moral and romantic test for his character, one that with a brilliant script he allows us to see him fail. A must watch movie for romantics, the middle aged, and film buffs alike.",
            "review_date": "2014-03-27",
            "source": "rt"
        },
        {
            "content": "Beautifully shot with smart dialogue and metaphorical images.",
            "review_date": "2014-02-28",
            "source": "rt"
        },
        {
            "content": "a classic story, mariel hemingway knew how to captivate us.",
            "review_date": "2014-02-26",
            "source": "rt"
        },
        {
            "content": "Anxiety in all its beautiful colors. Definitive Allen.",
            "review_date": "2014-02-26",
            "source": "rt"
        },
        {
            "content": "I love Woody Allen's work but didn't know he was capable of something like this. My favorite of his movies.",
            "review_date": "2014-02-24",
            "source": "rt"
        },
        {
            "content": "This movie represents new york very well, and the music is amazing!",
            "review_date": "2014-02-17",
            "source": "rt"
        },
        {
            "content": "A great film shot entirely in black and white, that many people believe is Woody Allen's best. Stylistically, I would agree even if I think some of the black and white is too dark, though I'm pretty sure that's intentional. There are 4 separate love stories here, so if this gets confusing, just read the next few sentences over and over again til you get it. Woody is in love with two women, Diane Keaton and 17 year old Mariel Hemingway. There's two. Then there is Michael Murphy and Diane Keaton, the former being married and Woody's best friend. That's three. The 4th and final is the real Woody Allen's love affair with New York. This is by far the most interesting of all the love stories in this flick. The way the film is shot and written and by using Gershwin tunes as the final brush stroke, Woody paints a picture of his New York. It is very easily, a New York anyone can see themselves living in. While it's not my favorite and I tend to the story is basically the same one he always tells, I've learned to enjoy this film more over the years. Tho I wouldn't mind a Gershwin only audio track on a future release. So I can sit back and pretend I am in the Woody Allen's ideal heaven. New York City.",
            "review_date": "2014-02-17",
            "source": "rt"
        },
        {
            "content": "How can you not fall in love with New York City after watching a movie like this!  How can you not fall in love with its people?  Or what about the music.  \"Manhattan\" is a classic.  There's no question about it.  You find yourself swept away as you fall in love with two things at once, the movie and the city. The plot and Manhattan itself.  Woody Allen is so witty and brilliant.  The movie is so reflective of the vulnerabilities in real love.  It's reflective of the fact that when you really love someone you love them with all of their flaws.  You don't just love their good side, you love everything about them.  In this case that involves a girl as well as a city.  An excellent, breathtaking, fantastic, musical, and  classic tale of, well, Manhattan.",
            "review_date": "2014-02-01",
            "source": "rt"
        },
        {
            "content": "Poniéndome al corriente.",
            "review_date": "2014-01-30",
            "source": "rt"
        },
        {
            "content": "Romantic, funny, & beautiful. A great film about the nature of love in our bustling lives as only Woody Allen can show it.",
            "review_date": "2014-01-30",
            "source": "rt"
        },
        {
            "content": "Definitely lived up to its hype, Woody Allen's comedic and touching masterpiece is nothing but brilliant.",
            "review_date": "2014-01-29",
            "source": "rt"
        },
        {
            "content": "Always great to see NYC back in the day, as it arouses a certain nostalgia in me. \nLots of wit and banter, which sometimes seems to be the ultimate ground of the film. \nPeople driven by self-destructive impulses due to a lack of maturity and direction, which leads to forest fires that they then try to put out with more fire causing a downward spiral of self-absorbed ever-escalating drama. \nIt was best summed up by Woody Allen's ex-wife in her book telling all of their marriage and divorce. My rendition of it is my own observation. \nAnd then at the end there's a excellent summation of the lunacy of it all with the great simple wisdom, \"It's very important to have some kind of personal integrity.\" \n\nThe one with the greatest wisdom is the 17-year old played Mariel Hemingway.\n\nLoved hearing of the psychoanalyst that goes into a coma due to a bad acid experience. There were some very funny scenes.  Listening to that and hearing of EST really grounded it in its time. Despite it being a 1979 New York film, it fortunately isn't weighted down with too many references of its time.  Also, the deep emotional and behavioral themes it deals with has it be entered into the cinematic annals as a timeless work of art. \n\nPresenting it in black and white works really well as a nice artistic touch. ",
            "review_date": "2014-01-12",
            "source": "rt"
        },
        {
            "content": "This is Woody Allen's autobiography, fully realized and never since matched, although it did lead to an incredible output of some of the best American film comedies. With his beloved city as the backdrop, Allen's definition of human nature is beautifully illustrated, and he leaves us with the hope that we all can do better.",
            "review_date": "2014-01-06",
            "source": "rt"
        },
        {
            "content": "Quite possibly my favorite Woody Allen film, also one of my favorite films in general. Amazing screenplay and some beautiful cityscapes (iconic bridge sequence). Allen captures the essence of relationships and the trials and tribulations that go along with them. If you want to see a fantastic film look no further. It's on Netflix so go watch it!",
            "review_date": "2014-01-05",
            "source": "rt"
        },
        {
            "content": "The ultimate valentine to the title city.",
            "review_date": "2014-01-05",
            "source": "rt"
        },
        {
            "content": "After Watching Annie Hall, this movie was a great next project for Woody Allen.   They complement eachother so well! Allen makes the film Black and White not only to show the beautiful lights and shadows that make Manhattan, but also to distinguish this film from his previous achievements. \n\nManhattan has truly pointed out the specific things I like about Allen's work. The long shots, the off centered frames, the talking over each other. Truly shows that with a few good actors, you could make some fantastic films.\n\nThank you Woody Allen. You truly are an inspiration!",
            "review_date": "2014-01-04",
            "source": "rt"
        },
        {
            "content": "F\n\n8.2\n\n[Woody Allen]",
            "review_date": "2014-01-02",
            "source": "rt"
        },
        {
            "content": "Great character development, great dialogue - witty, romantic, neurotic...New York City. Classic movie shot in black-and-white which seems to be an homage to an earlier era.",
            "review_date": "2014-01-01",
            "source": "rt"
        },
        {
            "content": "Meets minimum expectations for smart dialogue and nice shots, but it's oddly boring.",
            "review_date": "2013-12-30",
            "source": "rt"
        },
        {
            "content": "Brimming with autobiographical allure and widely recognised as one of the great auteur's finest and fullest films, Manhattan might just be the definitive Woody Allen romcom. Wry wit and romantic realism set against a blissful black-and-white backdrop ensure that love in the big apple never looked or felt so good, and though neither as zesty as Annie Hall or as enigmatic as Crimes & Misdemeanours, Allen's loveletter to the great metropolis begs repeat viewings and oozes cinematic charm. A must-see for fans, and a vivid romantic portrait for all.",
            "review_date": "2013-12-30",
            "source": "rt"
        },
        {
            "content": "Visually stunning, great dialogue.",
            "review_date": "2013-12-26",
            "source": "rt"
        },
        {
            "content": "Saw this originally in the 80s and it still holds up as one of my all-time favorite Woody Allen films.",
            "review_date": "2013-12-21",
            "source": "rt"
        },
        {
            "content": "Classic Woody Allen. He's always a delight to watch and listen to. The filming is so exquisitely masterful - the opening sequence, the realistic portrayal of unglamorous characters, the interesting and believable conflict/plot, and the choice of music, among other things - I was simply in awe of the technical and narrative strategies coordinating to make love to our eyes, ears, and hearts.",
            "review_date": "2013-12-17",
            "source": "rt"
        },
        {
            "content": "Early Woody Allen movie - if you have seen one, you have pretty much seen all of them.",
            "review_date": "2013-12-16",
            "source": "rt"
        },
        {
            "content": "A eterna insatisfação humana que desgasta.",
            "review_date": "2013-12-11",
            "source": "rt"
        },
        {
            "content": "It struggles to engage throughout, but it has a strong start, great acting, and is definitely worth seeing as so to experience the genius of Woody Allen's witty humor.",
            "review_date": "2013-12-09",
            "source": "rt"
        },
        {
            "content": "A great example of true character development and stark yet beautiful realism, and it's incredibly optimistic beneath the gritty setting.",
            "review_date": "2013-11-24",
            "source": "rt"
        },
        {
            "content": "I might actually like this film more than I like Annie Hall.  The only real quibble I've got can be aimed at just about every Woody Allen film, and that is: why do all of these gorgeous women date a guy who looks like Woody Allen?  I mean, is he supposed to be playing himself in all of these films?  In the world of his movies, is he this big time celebrity just as he is in real life?  It's not that I have anything against beautiful women choosing the scrawny bookworm type, in fact, I welcome it.  It's just, I keep hearing time and again from people who make movies that you can't strain the suspension of disbelief by this wide a margin.  In fact, they've told me that there's no way anyone will buy a romance between a geeky looking guy and the hot supermodel.  Are my film professors just a bunch of jerks who've had their minds twisted by a Hollywood mode of thinking, or is it the sad truth?  Personally, I like to think that any good man fits well with any good woman regardless of what they look like, but, according to film school, most audiences just won't buy it.  On the subject of Woody Allen's Manhattan, I think it's a winner, and I found myself easily charmed by it regardless of the seeming mismatch between the romantic leads.",
            "review_date": "2013-11-23",
            "source": "rt"
        },
        {
            "content": "Clasico de Woody Allen",
            "review_date": "2013-11-22",
            "source": "rt"
        },
        {
            "content": "Not just possibly the best film Woody Allen has ever made, but possibly the best film anyone has ever made. Perfection.",
            "review_date": "2013-11-18",
            "source": "rt"
        },
        {
            "content": "one of allen's best pix",
            "review_date": "2013-11-02",
            "source": "rt"
        },
        {
            "content": "I Had Never Seen A Woody Allen Film Until Today And I Don't Know Why I Waited So Long. Manhattan Is Amazingly Well Done one Of The Best Films From The 70's That Is A Different Approach From Most Directors As He Thinks Out Side The Box Brilliant Is How To Describe This Film",
            "review_date": "2013-10-30",
            "source": "rt"
        },
        {
            "content": "I'm ashamed to say that this is one of the first Woody Allen movies I've ever seen, but wow, Manhattan absolutely blew me away. It's sharply shot and very funny throughout. Unfortunately I could all too well align myself with the neurotic, self-obsessed crowd, which is more or less the whole focus of movie. I loved it.",
            "review_date": "2013-10-29",
            "source": "rt"
        },
        {
            "content": "\"Has anybody read that Nazis are gonna march in New Jersey? Y'know, I read this in the newspaper. We should go down there, get some guys together, y'know, get some bricks and baseball bats and really explain things to them. \"\n\"There is this devastating satirical piece on that on the Op Ed page of the Times, it is devastating. \"\n\"Well, a satirical piece in the Times is one thing, but bricks and baseball bats really gets right to the point. \"\n\nDo I need to say more?\nAnyone with this kind of mindest can ONLY make good movies.\nRight?\n\nSO WTF IS HE DOING NOW????",
            "review_date": "2013-10-15",
            "source": "rt"
        },
        {
            "content": "so hilarious.. can understand why many of beautiful intelligent women are so attracted by Woody Allen's movie and the person himself..",
            "review_date": "2013-10-14",
            "source": "rt"
        },
        {
            "content": "Charming in its black-and-white presentation. Woody Allen shines in this. A love story to the city of New York.",
            "review_date": "2013-10-13",
            "source": "rt"
        },
        {
            "content": "Manhattan displays Woody Allen and Diane Keaton at their best, with sharp commentary and hilarious control of dialogue. This is a film about romantic decisions and finding what you truly want which plays out in a subtly heartbreaking manner.",
            "review_date": "2013-10-08",
            "source": "rt"
        },
        {
            "content": "Manhattan is, by all accounts, a classic masterpiece.",
            "review_date": "2013-09-26",
            "source": "rt"
        },
        {
            "content": "Woody Allen has often played pessimistic intellectuals about everything. In Manhattan, he played against the glamarous and precocious Mariel Hemingway, the erudite, charming yet capricious Diane Keaton and the eccentric Meryl Streep. Struggling between the three women, Woody Allen discussed his philosophy on love (again, yet profound and genuine), share his passion of great artists like Ingmar Bergman, and presented the romanticism of New York with his genius vision and literature knowledge. One of his best.",
            "review_date": "2013-09-25",
            "source": "rt"
        },
        {
            "content": "Arguably one of the autuer's best !",
            "review_date": "2013-08-31",
            "source": "rt"
        },
        {
            "content": "Doesn't rise to the heights of \"Love & Death\" or \"Annie Hall\", but as a love letter to the Big Apple it's surprisingly poignant and insightful.",
            "review_date": "2013-08-31",
            "source": "rt"
        },
        {
            "content": "It's a classic film with a dispassionate screenplay. Mariel Hemingway's character is heartbreaking, her performance is sweet, tender, and award worthy. Woody Allen's character on the other hand is well developed, but very unlikable. His neurosis and narcissism are unbearable. The film is set up and use of locations are romantic, but the story's deep selfishness loses and lacks heart. Not to mention that the story is also a little creepy... a 42 year-old man who is dating a 17 year-old high school girl, and so on. (Apparently Woody Allen didn't even like the film himself. He asked for it not to be released and offered to make another film for free.)",
            "review_date": "2013-08-28",
            "source": "rt"
        },
        {
            "content": "I see why all the fuss...",
            "review_date": "2013-08-21",
            "source": "rt"
        },
        {
            "content": "It is my opinion that this is one of the best made films of all time. It is as if all the gifts of Woody Allen, his team and his actors come together to create an unforgettable portrait of late 1970's Manhattan and the Intellectuals of that era. Funny, romantic, societal import and amazing cinematography of Gordon Willis make this film ageless and forever endearing. \n\nA major cinematic achievement.",
            "review_date": "2013-08-17",
            "source": "rt"
        },
        {
            "content": "in a black and white Manhattan delivers a simple story of certin muture characters who are unsure of what they want or feel in a perky and whimsical kind of way that can be too simple yet behind such story presents the most artistic and polish outlook on a city that is larger than life....hence  the background symphony",
            "review_date": "2013-08-10",
            "source": "rt"
        },
        {
            "content": "Woody Allen's love letter to New York City is as beautiful as its namesake. Focusing on day-to-day interactions, Manhattan plays more as a series of interesting conversations with relatable characters than as a narrative, very much in the vein of Ernest Hemingway's The Sun Also Rises. Like Hemingway, Allen has the most remarkable gift for writing dialog. With  Manhattan he crafts such organic conversations that one would think they were improvised rather than scripted. While the film embraces the corny side of romantics to mixed degrees of success, it also strikes at the heart of everyday life and resonates deeply on an emotional level. Allen crafted an unforgettable, nearly flawless film that will never be outdated.",
            "review_date": "2013-08-05",
            "source": "rt"
        },
        {
            "content": "Very beautifully combining romance, comedy, and drama; this modern day equivalent to Casablanca is another winner from Woody Allen. One highlight of the film includes shots of New York City with \"Rhapsody In Blues\" playing in the background. (This later inspired one of the animated segments in Fantasia 2000.)  Manhattan will always remain a classic. \n(10/10)",
            "review_date": "2013-08-02",
            "source": "rt"
        },
        {
            "content": "By this point, people had already become acquainted with Allen's intelligence in portraying the love machinations of the New York intellectual crowd in a delightful and genuinely funny satirical way. With Manhattan he returned to that world with added grace and a more nostalgic style, including the usual perfect use of a jazz soundtrack and a wonderful black and white photography which indeed feels like a glorification of its titular setting. Already a modern classic at the time of its release, Manhattan is not only among the best film by Woody Allen but also one of the most poignant looks at the myth of romanticism and the mystery of adult and mature relationships.",
            "review_date": "2013-07-30",
            "source": "rt"
        },
        {
            "content": "Almost perfect movie. Like people, you're attracted to them for their quality, but you love them for their flaws.",
            "review_date": "2013-07-29",
            "source": "rt"
        },
        {
            "content": "You can truly see why many call this Woody Allen's best film. Although in black and white the aesthetic of the city can truly be appreciated.",
            "review_date": "2013-07-29",
            "source": "rt"
        },
        {
            "content": "Will never get tired of such masterpiece in movie making. W. Allen at best substance and style.",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "I definitely liked this more than Annie Hall! Allen is much more endearing in this film, and it's a nice love 'pent-angle' between him, Keaton, Hemingway, Murphy & Byrne. The black & white works well, as does the score, making it feel like a classic romantic-comedy. Great acting from the cast and a pretty realistic ending - you can't always get what you want!",
            "review_date": "2013-07-20",
            "source": "rt"
        },
        {
            "content": "Gordon Willis' photography masterfully captures the spirit of New York with wonderful shots of the great city, and Woody Allen's witty script and slightly pessimistic take on romance is a delight to behold when brought to life by charismatic and honest performances.",
            "review_date": "2013-07-19",
            "source": "rt"
        },
        {
            "content": "More heartfelt and emotionally satisfying than Annie Hall.",
            "review_date": "2013-07-11",
            "source": "rt"
        },
        {
            "content": "Woody Allen's neurotic character is searching for love but fails to recognize it. The movie features spectacular black & white imagery of New York and a list of things 'that make life worth living for'.",
            "review_date": "2013-07-08",
            "source": "rt"
        },
        {
            "content": "My Favorite Film Is 1941's Citizen Kane.",
            "review_date": "2013-06-28",
            "source": "rt"
        },
        {
            "content": "A friend of mine watched this and said that nothing happens and all the movie does is show unlikeable characters speaking pretentiously in museums and restaurants and running through Central Park in the rain. And that's kind of true and it's also kind of true that Woody Allen's character, were we to meet him in real life, we would more than likely feel an urge to hit him right on the nose. But as there is a movie screen in between him and us we can enjoy his neurotic dialogue and strange tangents and ramblings and ravings and it doesn't matter that the other \"pseudo-intellects\" aren't all that likeable. It is absolute bliss just to watch them all stumbling through their lives talking absolute nonesense. A great cast, all with their little quirks and idiosyncracies. And you can't forget the absolutely beautiful shots of New York, the silhouettes, the streets, the cars, the people, and one of the most iconic and obvious moments; the long shot of Diane Keaton and Woody Allen sitting on a bench just before dawn looking at the lights on Queensboro Bridge. Can't say anything bad about this one. The man was at his peak.",
            "review_date": "2013-06-28",
            "source": "rt"
        },
        {
            "content": "a very creative and touching film.",
            "review_date": "2013-06-20",
            "source": "rt"
        },
        {
            "content": "I've never really been a fan of Woody Allen. He's definitely that type of person where you need to like his style in order to like his films. Personally I wasn't a huge fan. Don't get me wrong, this had great acting and I respect Woody Allen as a director and actor, but I'm just not a fan of his storytelling.",
            "review_date": "2013-06-15",
            "source": "rt"
        },
        {
            "content": "Def one of my favorite Allen movie's, possibly even my favorite.",
            "review_date": "2013-05-31",
            "source": "rt"
        },
        {
            "content": "Manhattan is so fresh, so touching, so wonderful, one can't help but smile when the credits begin to roll.",
            "review_date": "2013-05-27",
            "source": "rt"
        },
        {
            "content": "A classic, but like most of Woody's earlier films, take some to get into.",
            "review_date": "2013-05-19",
            "source": "rt"
        },
        {
            "content": "\"Manhattan\" is such a beautiful comedy that truly makes me want to visit the beautiful city of New York once more.\n\nFull review at filmbroadcaster.weebly.com",
            "review_date": "2013-05-15",
            "source": "rt"
        },
        {
            "content": "The ultimate cinematic love letter to a given city. Woody Allen talks about the city life with an almost reluctant love at times. For all his neurotic tendencies, Allen loves this city, because he sees exactly as the audience does. Thanks to the lensing of Gordon Willis and the great writing and directing of Mr. Allen, we see New York like a grand cityscape filled with impossibly weird and complex people, and a painterly landscape that moves and breathes.\n\nThis is also a celebration of unrequited love, missed connections, and ambiguity. For all his musings on how pointless life ultimately is to him, Allen is a man who keeps coming back to \"fate\" or purpose, and that's all over this film.",
            "review_date": "2013-05-14",
            "source": "rt"
        },
        {
            "content": "Woody Allen's choice of soundtrack captures the setting perfectly - too bad the rest of the movie falls a bit short.",
            "review_date": "2013-05-09",
            "source": "rt"
        },
        {
            "content": "Manhattan is an amazing, subtle, and very mature handling on romanticism in the city, represented by contemporary imagery, stern writing, and characters that idolize very realistic matters of our very human society.",
            "review_date": "2013-05-08",
            "source": "rt"
        },
        {
            "content": "Woody Allen's work as always is at once funny and philosophical.",
            "review_date": "2013-05-07",
            "source": "rt"
        },
        {
            "content": "Brilliant. Must see. My favourite movie of Woody Allen.",
            "review_date": "2013-05-03",
            "source": "rt"
        },
        {
            "content": "\"Manhattan\" has a rightful place alongside \"Annie Hall\" in featuring Woody Allen at his neurotic best.",
            "review_date": "2013-05-02",
            "source": "rt"
        },
        {
            "content": "A terrific continuation of Allen's work after Annie Hall, Manhattan is graceful and often dark look at the true duality of a relationship, while placed against the backdrop of a dual city. Woody Allen is very much aware of the Romantic beauty of New York, which is the white of Manhattan, but the underbelly of all-too familiar sex, lies and betrayal is the black of Manhattan. Together they fit perfectly to be a black-and-white film about a black-and-white idea. Other than that, the performances are again brilliant and natural, and Allen succeeds in displaying truly beautiful romanticism in his, in my opinion, finest film.",
            "review_date": "2013-05-01",
            "source": "rt"
        },
        {
            "content": "Yale: You are so self-righteous, you know. I mean we're just people. We're just human beings, you know? You think you're God.\nIsaac Davis: I... I gotta model myself after someone.\n\nB+",
            "review_date": "2013-04-28",
            "source": "rt"
        },
        {
            "content": "Very funny with a strong message on escapism.",
            "review_date": "2013-04-21",
            "source": "rt"
        },
        {
            "content": "Decent movie. Very realistic. But the dialogue is so boring, which is typical of Woody Allen movies.",
            "review_date": "2013-04-21",
            "source": "rt"
        },
        {
            "content": "Woody Allen's masterpiece and one of the best American films of all time",
            "review_date": "2013-04-09",
            "source": "rt"
        },
        {
            "content": "Smart and savvy dialogue; my favourite of Woody Allen's work in the 70s.",
            "review_date": "2013-04-04",
            "source": "rt"
        },
        {
            "content": "What a great way to spend this afternoon. I just loved the movie. It was an excellent form to portrait a serious topic in a funny way. Black and white. :)",
            "review_date": "2013-03-28",
            "source": "rt"
        },
        {
            "content": "This is a love affair between Manhattan and Woody Allen. Modern, witty and timeless",
            "review_date": "2013-03-23",
            "source": "rt"
        },
        {
            "content": "\"Manhattan\" é uma belíssima declaração de amor de Woody Allen a Nova York e um estudo dos relacionamentos humanos.",
            "review_date": "2013-03-20",
            "source": "rt"
        },
        {
            "content": "Woody Allen's true masterpiece. Perfect film.",
            "review_date": "2013-03-13",
            "source": "rt"
        },
        {
            "content": "Love the black and white, LOVE the music and the movie.",
            "review_date": "2013-03-13",
            "source": "rt"
        },
        {
            "content": "This classic's use of location is close to perfect, but unfortunately the story taking place in this romanticized metropolis is at its best standard and at its worst a bit creepy. If you've seen Annie Hall, the rambling wit and wisdom here is pretty much identical. If not for the beauty of the cinematography, I'd be hard pressed to find anything particularly special about this as opposed to more focused and more unique Allen movies.",
            "review_date": "2013-03-11",
            "source": "rt"
        },
        {
            "content": "woody allen's flicks never fail to disappoint with their charming funny characters and colorful dialogues.  another timeless classic no less!",
            "review_date": "2013-03-10",
            "source": "rt"
        },
        {
            "content": "By far, my favorite Woody Allen.",
            "review_date": "2013-03-04",
            "source": "rt"
        },
        {
            "content": "Although seeming like a sequel to Annie Hall, Allen doesn't run out of witty humor and one liners, far from it. As a major plus,  it's BEAUTIFULLY shot. This film not winning an Oscar for it's cinematography is a travesty.",
            "review_date": "2013-03-02",
            "source": "rt"
        },
        {
            "content": "Basically a classic, Woody Allen really shows what a great actor/director he really is in this. A great story that grabs you right from the beginning. Interesting seeing one man becoming so confused by all these women and what his friend even gets into. I really thought this was a great movie that even captures the great sights of New York City. Woody's character was funny and very crazy, always giving his view on everything and basically turning everything into a joke. He got annoying at times but that's what made his character so great. It's a great story that throws so much in with romance, comedy and even drama. I never really knew much of Woody Allen, all I recognized his voice from was that movie Antz (which looking back isn't that great and had horrible voice acting). Really interested in seeing what else he has done and see if anything else comes close to this great movie. It was the perfect length too and with so many color films around that time this was released even to today, it was cool seeing he chose to shoot it in black and white.",
            "review_date": "2013-02-28",
            "source": "rt"
        },
        {
            "content": "Blends contemporary, poignant wit and ageless romance with infallible beauty.",
            "review_date": "2013-02-26",
            "source": "rt"
        },
        {
            "content": "Very funny and beautiful portrayal of life in New York and the complexities of modern relationships.",
            "review_date": "2013-02-21",
            "source": "rt"
        },
        {
            "content": "43 year old dating a 17year old. I just cannot condone",
            "review_date": "2013-02-14",
            "source": "rt"
        },
        {
            "content": "It never gets old...",
            "review_date": "2013-02-02",
            "source": "rt"
        },
        {
            "content": "Great. The humor, the message, the awkwardness, the cinematography. All top notch.",
            "review_date": "2013-01-28",
            "source": "rt"
        },
        {
            "content": "Excellent! Woody Allen is such a brilliant actor, writer and director... and this film proves it!",
            "review_date": "2013-01-28",
            "source": "rt"
        },
        {
            "content": "Manhattan represents one of Woody Allen's greatest critical responses, widely considered to be among his best. It's a well conceived film, to be sure, with amazing cinematography, a unique story, and a script penned by Woody that is filled with his characteristic wit and dialogue, with good characterizations and an avoidance of clichés. \n\nSet against a beautiful backdrop of late 1970s New York, and filmed in black and white, it looks brilliant. The acting is as strong as most Allen pieces, with solid early performances from greats Diane Keaton and Meryl Streep. All of this contribute to what feels like a very real story. This is what Allen is perhaps best at, injecting humor and comedy into realistic situations.\n\nMy issue with Manhattan, however, is that the story isn't as involving or as engaging as his other works. It's also not nearly as funny. This is perhaps at least partly due to the dated nature of the film, not aging as well in humor as even some of his earlier works, such as the fantastic Annie Hall. It's enjoyable, but it never reaches the pinnacle of Allen's other work which are often more poignant, hilarious, and engaging.\n\n3.5/5 Stars",
            "review_date": "2013-01-27",
            "source": "rt"
        },
        {
            "content": "Very funny and beautiful portrayal of life in New York and the complexities of modern relationships.",
            "review_date": "2013-01-18",
            "source": "rt"
        },
        {
            "content": "Very funny and beautiful portrayal of life in New York and the complexities of modern relationships.",
            "review_date": "2013-01-18",
            "source": "rt"
        },
        {
            "content": "Woody Allen is definitely one of the greatest filmmakers in all of history. That is without a doubt.\r\nI need to expose myself to more of his films, especially because he is one of the best romantic comedy filmmakers ever and he starred Diane Keaton a lot because they were together back then. I chose to see Manhattan first because it also stars Meryl Streep whom I am in love with.\r\nI can't wait to see Annie Hall. I am also in love with Diane Keaton. I have to see the other two Godfathers.\r\nIt's interesting how Manhattan is Allen's least favorite film he ever made. I really liked it.\r\nI am jealous of Isaac and Mary's relationship they had. They were great together. They were so intelligent and so opinionated about various types of pop culture and art.\r\nI wish I had someone who I can be like that with.\r\nManhattan, I give you an 100%.",
            "review_date": "2013-01-18",
            "source": "rt"
        },
        {
            "content": "Woody Allen's magnum opus. An ode to New York City in the guise of a complicated love story revolving around four people. Hemingway is heartbreaking as Allen's young, often naive lover. Keaton is the pseudo-intellectual that drives viewers and Allen batty with her arrogance. Shot is exquisite black and white, with the enduring image of Allen and Keaton sitting with the Queensboro Bridge in the background. Best scenes: the party scene wherein a female guest doing her best Judy Holiday impression quips: \"I finally had an orgasm, and my doctor said it was the wrong kind,\" and Allen's character recording himself in the final fifteen minutes of the film.",
            "review_date": "2013-01-15",
            "source": "rt"
        },
        {
            "content": "In New York City, we find Woody Allen dating a woman (Mariel Hemingway, who was famed writer's Ernest daughter) that is more than two decades younger than him. He is a divorced man, whose ex-wife (Meryl Streep) has become a lesbian and writes a book that slams his ability to have sex. In addition, Woody is also friends with a married couple (Anne Byrne and Michael Murphy), in which the husband, who is a total visionary, begins engaging in a relationship with a writer (Diane Keaton). Oddly, the writer and Woody start to have an affair themselves, two-timing their other relationships. Interesting character study that is almost a Jerry Springer scene waiting to explode, but thankfully doesn't materialize to that extent (three different people are being screwed by others for others for goodness sakes). Not one of my favourites by Allen, but still pretty interesting and entertaining. It should be noted that Streep and Hemingways' performances exceed everyone else's by a mile.",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "A divorced New Yorker currently dating a high-schooler brings himself to look for love in the mistress of his best friend instead.",
            "review_date": "2013-01-05",
            "source": "rt"
        },
        {
            "content": "Insightful and filled with symbolic atmosphere for modern problems and relationships, but almost too cliche, as i can see why Woody was \"surprised he got away with that\"",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "Has moments of idiosyncratic charm, but otherwise leaves the audience aloof.  Gershwin was definitely a good choice",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "\" You have to have a little faith in people\"",
            "review_date": "2012-12-29",
            "source": "rt"
        }
    ]
}