{
    "rating": 8.9,
    "release_date": "1962-01-23",
    "num_reviews": 170,
    "genres": [
        "French(France)"
    ],
    "summary": "In the carefree days before World War I, introverted Austrian author Jules (Oskar Werner) strikes up a friendship with the exuberant Frenchman Jim (Henri Serre). Both men fall for the impulsive and beautiful Catherine (Jeanne Moreau), but it's Jules who wins her hand. After the war, Jim visits Jules, Catherine and their daughter in their Austrian home and discovers not only that his feelings for Catherine are unchanged, but also that they're reciprocated.",
    "reviews": [
        {
            "content": ")\nA masterpiece. Comedy that turns to tragedy, as in Truffaut's earlier films. This film has everything: comedy, tragedy, great cinematography that was innovative at the time, and well drawn characters very well portrayed by the principals. It is funny, sad, and touching, and surprisingly fresh after 60 years. A throuple in 1962? Wow.",
            "review_date": "2023-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There needs to a sixth star for some movies. I watched this film, in the late 70s, as an artsy snob cinephile and raves about to the unwashed who had barely heard of it. And I hadn’t watched it since. Some of the things I watched in that era have paled with the passage of time. This film, which I hadn’t seen in more than 20 years, is as resplendent and overwhelmingly beautiful and heartfelt as the first time I saw it. One of the top ten great films EVER. ",
            "review_date": "2023-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolute masterpiece, loved just about everything about it from start to finish.",
            "review_date": "2023-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film is like fast reading through a novel, uncomfortable, though Moreau's performance is good.",
            "review_date": "2022-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jules and Jim is yet another overrated French New Wave movie that does benefit from a fantastic performance from Jeanne Moreau in the main role. The movie may have been called Jules and Jim, but it is entirely about Catherine herself. The cinematography and editing are terrific and the diverse tone in the film is interesting. The problem here is that it's another case of style over substance as the characters are uninteresting and underdeveloped and the script is very weak.",
            "review_date": "2022-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truffaut captures the essence of the 60's in a deeply turbulent and emotional narrative that defined a whole generation, while setting the standarts for love triangles.",
            "review_date": "2022-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Director François Truffaut of \"The 400 Blows\" continuously depicted enigmatic realism through loss of innocence towards anguish at his genuinely arguable best work as a definitive representational sample into the French New Wave with unconventional pacing that speeds up a solid story without losing the narrative sense. (B+)",
            "review_date": "2022-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fancuckingtastic movie! Brills",
            "review_date": "2021-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love triangles, passionate affairs, questionable sanctity in marriage, fleeting interests, restlessness, excessively dramatic gestures - it's all the stereotypes of the French view on romance crystallized in a single film. Events happen quickly but not necessarily with much force as this trio float through their lives according to their own set of rules, having latched onto a dynamic that sustains them even if they don't adhere to traditional depictions of relationships. \n\nMoreau's Christine, though the sole protagonist left our of titular honors, is the key figure defining the drive of the film; she's irrational, spontaneous, romantic, and unsure of what she wants in life - it's understandable and even empathetic in a sterile environment but infuriating to see play out in relationship to her principle dual love interests, Werner's Jules and Serre's Jim. The film's strength lies in bringing out the positive elements of their boisterous relationship rather than following through on the heartache, as you watch the three cavort around pre-War Paris in defiance of cultural standards simply living life as they see fit in a potent chemistry that emerges despite their different personalities. When Truffaut tries to dive into the flip side of that irrationality as it begins to threaten the long-term stability of their affections, you'll start to wonder exactly what he was trying to say beyond the incorporation of tragedy and discord. Jeanne Moreau pulling a gun on her withdrawn lover with some shockingly lazy delivery can really take you out of the moment. Plenty of good content here, but to call it among the greatest films of the French New Wave is a pretty far-fetched claim.\n\nUnfortunately, in the current Criterion release of this film, many early French subtitles were left in, with the result that some scenes have their updated English subtitles awkwardly pasted over their earlier iterations. (3.5/5)",
            "review_date": "2021-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jeanne Moreau is mesmerizing. The tempo is pretty fast and some things appear very artificial. But was a great watch overall.",
            "review_date": "2021-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliantly original and quintessentially french, this study of polyamorous nihilism is jaunty, complex and painful. Ultimately it's not about Jules and Jim, they're mere pawns in the life of Catherine who suffers mental health difficulties.",
            "review_date": "2021-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly, this was the most overrated film that I have ever seen. I kept waiting for it to improve but it did not. And I kept looking for a redeeming factor. Indeed, I struggled through mental gymnastics in order to find some merit in its tediousness. To no avail. Whimsical heterosexuality does not an excellent film make. I would truly like those two hours of my life back or receive compensation from the film studies community.",
            "review_date": "2021-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "About, oh, fifty years Jules and Jim was the selection for our University Film Club. The scene where Catherine runs ahead of Jules and Jim on a bridge has stayed with me over the years as the rest faded away. When I saw the movie just now, that scene still stands out and it is a metaphor for the relationships between all three. Catherine is always running ahead of them both, setting the pace, them never quite catching up with her. She is a willful, free spirit, first married to Jules, then to Jim, frustrating them both but neither lose their devotion to her while remaining best of friends to each other. Johnny C. sez check it out because it's a good 'un, but isn't so sure it's one of all-time greats.",
            "review_date": "2020-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's hard to tell why you care about these characters, but if I had to try I'd say that is because the movie is so direct that it shows right from the beginning who these characters are in relation to each other, and you see them live and struggle with their love until the ending which tears your heart apart, even if you were kind of expecting it and couldn't really think about a finer one",
            "review_date": "2020-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I understand the importance of this film but unfortunately, I don't think it works great in today's times without understanding its premise. It starts with an exhilarating montage and interesting voice-over which narrates the story of two best friends Jules and Jim. The film spans over decades following their friendship which ends in the tragic note. The character build-up is not moment to moment but can come off as extremely unpredictable. Sometimes Truffaut chooses not to explain character motives and other times they talk with each other in endless long monologues with tremendous exposition and subtext. The french new wave techniques used in cinematography, editing, blocking are incredible. Montages are thrilling, use of changing aspect ratio is cool, voice-over is powerfully used. Martine Scorsese has stated the influence of Jules and Jim on the casino and many of his other films. \n\nWithout a doubt its an extremely important film of those times but did it age well with time? I don't know.",
            "review_date": "2020-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Happiness can't be told,\nbut it wears off without anyone noticing it.\"\n\nI'm not sure whether this is a most unconventional character study of a most unique psycho character, a cautionary tale about unrestrained, uncontrolled and boundless love, or just a story about a love triangle concerning two friends and an impulsive woman, as IMDb's plot summary says. But what I'm sure of is that this is one of the most extraordinarily original, and powerful films I've ever seen!\n\nThe ending is just as, if not more, shocking and devastating as The 400 Blows'!\n\nThe way Truffaut used War to switch the movie from a most charming, joyous and cheerful thing I've seen only before in Chaplin's silent comedies to a painful look at relentlessly whirling, troubled relationships is simply unprecedented and unsurpassable!\n\nAlso, I can't believe that I hated Catherine more than I hated Amy Dunne! But as for Jeanne Moreau, she probably became one of my favorite actress ever after I've seen her prodigious acting abilities in The 400 Blows, La Notte and now in this movie.\n\nIf only the movie was a bit shorter, and the pacing was a little faster....\n\n(9/10)",
            "review_date": "2019-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1st arts movie I saw. Very important to my life.",
            "review_date": "2019-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jules and Jim: A dissapointing new French wave film, hearld as a masterpiece. Francis Truffaut’s second film is to goofy and to boring to kickstart with dissapoiting narrative and characters.",
            "review_date": "2018-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truffaut's intellectually ambitious film -perhaps too much for its own good- is nevertheless highly satisfying on a cinematic approach and seems to have had a significant influence on Woody Allen's 'Vicky Christina Barcelona'.",
            "review_date": "2018-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first thing that strikes you about Jules and Jim is the exuberance (joie de vivre?) with which director Francois Truffaut endows the story.  As in his first two films (The 400 Blows, 1959, and Shoot the Piano Player, 1960), Truffaut experiments with film technique, mixing and matching styles in a way that keeps the viewer interested and shows off what Raoul Coutard (cinematographer) could do.  In fact, the first reel, detailing the relationship between best friends Jules and Jim (and the women they loved before they met Catherine) speeds by so fast, with so much cutting between anecdotes, that it is hard to keep up. Part of this may be due to the use of offscreen narration that fleshes out the story and reveals the characters' inner thoughts and feelings - there are a lot of subtitles to read!  But once Jules (Oskar Werner) and Jim (Henri Serre) meet Catherine (Jeanne Moreau), the film slows a bit to better observe their melodramatic relations across the decades from just before WWI until some years after.  I suppose it comes as no surprise that Truffaut takes the male point of view and treats Catherine and her willful ways as both an object of desire and the cause of suffering; perhaps it is a bit ambivalently sexist but Moreau is nothing if not empowered in the role.  Yet, despite the exuberance, there is a profound melancholy at the core of the film - a yearning for a love that cannot be and perhaps an acknowledgement that it may be difficult for a free spirit to maintain a stable relationship with any one person, let alone two (or three), no matter how strong their passions sometimes are.  Those around them can and do get burned. Ultimately, it isn't clear whether Truffaut is advocating the sort of compromises that most people make to keep their relationships alive or whether he sides with Catherine's unfettered approach. Perhaps, as the ending suggests, he knows that some candles burn much too brightly to last.  Fortunately, this jewel of the French New Wave is ours to treasure forever.",
            "review_date": "2017-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jules and Jim is the story of an Austrian and a Frenchman who become best friends but both fall in love with the same woman. The friendship between the two guys was charming and I liked how they respected one another and did their best to be open and honest about the whole situation. They also touched on the idea of two friends on opposite sides of the war which could have been really cool. But we only hear about that part in voiceover.\n\nCatherine, the object of their affection, is one of the most infuriating characters ever captured on film. The fact that these guys put this much effort into being with her made me want to rip my hair out. The film fully invests in the idea that you can\u0092t help who you fall in love with and that you\u0092re bound like an idiot to that person you love no matter how horrible they behave. And there was no hiding the fact that people were completely unfaithful either. \n\nThere was something about the way people behaved in Jules and Jim that didn\u0092t make sense to me. It\u0092s possible that there\u0092s a cultural difference that I didn\u0092t connect with, but I can\u0092t count how many times I thought \u0093Why are you doing that?!\u0094 The conclusion of the film was probably my biggest moment of confusion, because a character seemed clueless to what was obviously going to happen and just blindly followed. A combination of illogical behavior and annoying characters was enough to ruin this film for me..",
            "review_date": "2017-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun--and bold. Jeanne Moreau, you were a great actress.",
            "review_date": "2017-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jules and Jim is the ultimate get-under-your-skin film. It starts out charming and ends cynically. Well-crafted film and not easy to forget.",
            "review_date": "2017-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that moves with whimsy and joy. Truffaut wasn't making a straightforward love story, or a straightforward story of any kind, really. No, this is a story about what it feels like to reflect on being in love. It's about falling in love; time is irrelevant, realism is irrelevant. The only thing that matters is truth.",
            "review_date": "2017-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first hour: brotherhood!\nThe rest: how a woman, possibly a femme fatale, could break up the best of brothers apart and how much brothers need each other.",
            "review_date": "2017-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good but not great. This is the more Godard-like side of Truffaut.",
            "review_date": "2016-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "François Truffaut's celebrated adaption of autobiographical novel by Henri-Pierre Roché about a bizarre love triangle with a free-spirited femme fatale dazzles with nifty camera work and inventive narrative. Notwithstanding, it is French cinema of an acquired taste.",
            "review_date": "2016-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5,6. So much overrated. Oskar Werner's acting was so bland, the narrator's voice too. Many cuts in the movie that doesn't feel like a fluid transition. Poor writing, is it normal if I laughed at the end. I don't think so.",
            "review_date": "2016-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The basis for this movie is a love triangle between two friends (Oskar Werner as Jim and Henri Serre as Jules) and a free-spirited young woman (Jeanne Moreau as Catherine).   It's a joy to watch, all three actors are fantastic, and the filmmaking by Francois Truffaut is very creative, with brilliant sequences which make it clear that he had an influence on Wes Anderson.    The movie captures universal truths about relationships, while at the same time highlighting the very French attitude towards affairs.   Never slow, and definitely worth watching.",
            "review_date": "2016-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An inconsequential melodrama made required viewing only because of it's nouvelle vogue aesthetic.",
            "review_date": "2016-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very ambitious and daring essay on friendship, love and adulthood, especially for its time. Of course it is French. Of course it belongs to a long gone era. Of course Truffaut is to blame for it.",
            "review_date": "2016-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As with all great films, this made me think about it long after viewing.  I just had to probe deeper into it.  Why did Catherine behave as she did?  What drove Jules and Jim towards this woman?  Questions, on and on.  This is the sign of a great film.\n\nMost men have known a Catherine.  She defines a egocentric stereotype that thrives on attention and the affections of men.  Without this, she becomes bored.  She needs constant stimulus and excitement.  This is the trap that the love triangle of Jules, Jim and Catherine find themselves.\n\nTruffaut's rapid storyline provided the basis of the genre for filmakers such as Martin Scorcese to emulate in works such as Goodfellas.  This is one of the many reasons this film is a classic.\n\nThe ending is intended to leave the viewer emotionally devastated.  I hope you have this experience as I have found that one of the traits of a great film is one that makes you think about it for days after viewing.  It makes you crave for more, to research its history, plot, etc.  From this perspective, Jules and Jim is a classic film.",
            "review_date": "2016-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truffaut's classic is a film of great pathos, Jeanne Moreau is both haunting and playful, and so is the story. The first half narrates and moves about quickly, the second half settles into deadly a seriousness and reflection on love, liberty and loss.",
            "review_date": "2016-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truffaut's vibrant tale of a menage-a-trois gone wrong is still one of the defining films of the French New Wave, but it's interesting to view it now and consider how much it takes from classical Hollywood and 50's melodrama.",
            "review_date": "2016-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story of two friends, Jules and Jim.  They meet in Paris before World War 1 and strike up a friendship.  Jules falls in love with the enigmatic, volatile Catherine.  However, Jim also has feelings for her... \n\nI really don't know why this is regarded so highly.  The story is mostly quite dull, the characters are not that engaging, the ending is abrupt and there isn't much point to the whole thing.  Performances are unconvincing and a tad irritating.\n\nIt is quite morally progressive for 1962, and the relationships involved are quite liberal for the time, so maybe that's what all the fuss is about.",
            "review_date": "2015-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jules and Jim has all you expect from a French film of the early 60s: charm, playfulness, pensiveness, melancholy, and verve. This all becomes manifest through characters involved in a very different kind of love triangle. The film is very romantic in the full sense of the word: life is an experience! The direction and story portray a world very open and changing, happening and dangerous. You get a feeling of movement as the action goes back-and-forth between Austria and France, the moods of the lovers are up and down, and the tension builds up to the memorable climax of the film. The performances were good, especially for Jules and Catherine, but to enjoy this film, and find it to live up to the acclaim it has got as \"the ultimate love triangle\", one must have an active empathy and be a bit sentimental. The characters do crazy things and one has to be able to at identify with their emotions for the film to work, even if one does not like the things they do. It also helps if one is able to find excitement in the pages of a book; this is really a film that one must \"read\" to be able to get much out of it (and there is much to be got).",
            "review_date": "2015-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jules and Jim is an excellent film. It is about a love triangle concerning two friends and an impulsive woman. Oscar Werner, Henri Serre, and Jeanne Moreau give amazing performances. The screenplay is well written. Francois Truffaut did a great job directing this movie. I enjoyed watching this motion picture because of the drama and romance. Jules and Jim is a must see.",
            "review_date": "2015-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "François Truffaut's \"Jules and Jim\" is a masterful examination of a true ménage à trois remains oddly \"current.\" \n\nThe film takes place both before and after WWI. Jules and Jim fall in love with the same woman. \"Catherine\" played with casual sensuality and eroticism by Jeanne Moreau, is strangely transfixing. This has always been Moreau's unique gift as an actor. Far from conventional ideas of \"beauty\" or \"the erotic\" -- she non-the-less is irresistibly alluring. To Truffaut's credit, he captures Moreau's unique presence, intelligence and sensuality so that just about every viewer will feel something for her.\n\nThe two friends never surrender their friendship despite a tragic war and their shared love for the increasingly fickle and odd Catherine. Ultimately the two friends end up trading places as her lover. There are vague hints that the two men might also be in love with each other, but that doesn't really need to be explored. It is a given. \n\nAs fun, wistful and beautiful as the film is -- it is equally devastating. After years of friendship and love, these two men gain the true insight into their Catherine. The insight comes too late to avoid tragedy. \n\nWe are left forever wondering if we were in love with Catherine or some misplaced idea of what we thought Catherine was. Freedom and love come at a price. But the market place will only bear so much. \n\nA true French Cinematic Masterpiece of La Nouvelle Vague. Not to be missed!",
            "review_date": "2015-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The evolution of French cinema in one film.",
            "review_date": "2015-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Before he was French UFO Dude in Close Encounters, Francois Truffaut made films and this, his third feature, is a cracker. It's a simple yarn - the titular friends fall for the free-spirited Catherine  - but Truffaut makes it sing through a freewheeling approach - newsreels, freeze frames, film stills, voiceover and tracking shots are all thrown in - that never soft peddles the emotional core. It's a film in the thrall of movies and in love with being in love, with all its ups and the downs.",
            "review_date": "2015-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jules and Jim signaled a more adult and middle-of-the-road effort than Truffaut's previous two films without losing any of the young and disruptive energy of the revolution he and his accomplices had just launched in world cinema; the result is an emotionally haunting, cerebral and very funny film that stands as one of the crowning achievements of the French New Wave.",
            "review_date": "2015-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie more than anything else Truffaut has made",
            "review_date": "2015-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's beautiful, sincere and heartbreaking...",
            "review_date": "2015-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "truly among the greatest films ever made!",
            "review_date": "2015-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved the first 3/4 of this film.  Pacing was great. The cinematography was stylish and the chemistry between Jules, Jim and Catherine was believable.  It was a nice commentary piece too as to what a woman's place was like in a male centric world.  The last 1/4 of the film though felt rushed, repetitive and unnecessarily dramatic to operatically tragic proportions.",
            "review_date": "2015-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've always thought that Jules was a girl and Jim a boy. And that it was about their love story. But I was surprised to find out they were the names of two best friends. In the beginning it seems a nice movie. The boys have fun together. Fall in love for the same girl, but they still continue to have fun.  Then one of the boys ask the girl to marry him right before the beginning of the war. She accepts and then he goes to war. And here the story starts to become weird and kinda boring. We learn that the girl is pretty \"slutty\". She goes with anyone she likes and it seems her husband doesn't mind so much as long as she stays with him. He even gives the permission to his best friend to come and live with them, or more likely live and sleep with his wife. So at this point I start to hate all the characters in this movie. Most of all Catherine, she just seems to me hard-hearted. She doesn't care about her husband's feelings or her lovers' feelings, she just lives for herself. I think we're suppose to feel pity for her, because she's an unsettled soul trying to find love or her place in the world. But I just can't relate to her... She's so annoying to me.",
            "review_date": "2015-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another masterpiece I had never seen before, what a great film.  Truffaut brought such an energy to this movie.  I must admit the characters annoyed me at times, and didn't love the ending, but it made sense and didn't take away from my appreciation of the film.  This is a MUST for all serious film fans.",
            "review_date": "2014-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two men, one French & one German, become the best of friends right before The Great War breaks out. Catherine is the enigmatic & alluring woman both men love. Their love is both timeless & tragically flawed.",
            "review_date": "2014-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truffaut's technique and Georges Delerue's score are mesmerizing.",
            "review_date": "2014-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A tragic and heartbreaking exploration of polyamory, friendship, and war. Incredible film by Truffaut as he builds upon the classic films of the early French New Wave.",
            "review_date": "2014-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A dreary tale of malicious polyamory.",
            "review_date": "2014-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review In A Nutshell:\n\nJules and Jim is about two close friends who meets a girl, Catherine, which then develops into a love triangle that ultimately affects both of these men's lives.\n\nThe film explores ideas of loyalty, friendship, and love in a way that would normally come off as interesting and entertaining, especially for someone like me who has a weakness for digestible and clichÃ (C) themes. Sadly the film falls short in making these aspects interesting due to the film's central characters. I have not read the novel, and this film would mark as my first in exploring Francois Truffaut's filmography, so I had no expectations coming into this. Truffaut handles the film's characters and story in a quirky and offbeat kind of way, where the events and emotions that films like these would normally walk on would be manipulated in order to have them look and feel stripped down. I see what Truffaut is trying to do with it, as he wants the film to feel more natural, with emotions not always being expressed in a clear and heavy way paralleling to the true nature of humanity, but he has forgotten to give the film a handle for audiences to easily hold, therefore leaving me feeling detached with the characters and the story almost throughout the film's running time. I have to search so much into each scene that by the time I get to its emotional core, I end up feeling exhausted and the drive to figure out what the film is truly trying to deliver starts to fade away from me.\n\nIn terms of the film's plot and narrative, I found it to be interesting as the struggle between each member of the trio of keeping the one they truly care about from leaving and it wasn't hard to follow the intentions of each character. My main issue with the narrative is the pacing and it's delivery of its emotions, which is something I have already discussed. The film flies by the first act of the film, with the introduction of its two male leads and the relationship the characters have. The film doesn't slow down to give us any room to breathe and take it all in, therefore I gave up trying to keep up with it and hopefully as the film goes on, I'll gain a better insight on the characters, which in a way did. The second and third act does eventually slow down the film's pace, but not by a lot. Truffaut gives us a bit more time to take in the characters' motives and persona but I still personally felt that the tempo was still too elevated for me to really feel comprehensively invested, as there was just so much that Truffaut wanted to flesh out but didn't want to lose that sense of urgency and offbeat quality. At first I felt that the film's climax happened too suddenly and lacked any sense of impact, it started to grow on me a little bit as I'm writing this and developing some sort of empathy towards the decisions both of the characters would make; I think it would be something that would come off much better during a second viewing.\n\nWith all of the film's issues, it would be normal for one to find the dialogue in this film to be lacklustre, but surprisingly, it's actually one of the film's best qualities. This is not to say that it's perfect but it is a clear notch up when compared to other aspects of the film. The dialogue really made the characters feel interesting to watch, as they ramble on things that definitely resemble the personality and interests of Truffaut and his colleagues. The topics being discussed throughout the film are of the \"higher\" class, going in depth in things like wine, plays, and psychology. Even after the war that the male characters has went through, the way they discuss it upon reflection is more along the lines of a third-person rather than first; discussing how it impacted others rather than how it was for themselves, almost as if they didn't participate in it. Though, I did find the film's dialogue at times to be a tad bit too indulgent. Characters at times tend to ramble on a tad longer than they should and therefore coming off as a bit tedious in particular moments. The dialogue also lacked a bit off emotion, which was definitely needed on defining moments in the film. The film also includes a voice-over which was used in a way that was smarter than the characters themselves. It acts as a support for the audience to make up for the emotional core and insight that the film lacks, which did its job wonderfully but I personally found unnecessary. The film would have been much more effective if the characters were a bit more clear in themselves and let out a sliver, just a sliver, of elevated drama to give the film a bit weight.\n\nThe film's black and white photography looked quite good though I felt could have been much better in making scenes feel more impacting. Throughout the film we see wonderful tracking shots and pans that do occasionally create that parallel to the film's themes and ideas, but it wasn't enough to carry the film. The film's score on the other hand was a much more satisfying aspect. It was able to heighten that offbeat and quirky style that the director was going for. It also wonderfully captures the mood of the scene perfectly, with at times keeping me highly engaged due to the score alone.\n\nThe film's acting was actually great for what it was. If the actors weren't so restricted by Truffaut's direction and script then the actors would have definitely gotten more praise from me as their characters would have felt more fleshed out and genuine in a cinematic way. All of the three main actors, Henri Sarre; Oskar Werner; and Jeanne Moreau, were great in their roles. All were able to give that energy that Truffaut demanded from them while also sneaking in a hint of internal vulnerability in their characters. Each actor was able to deliver their dialogue really well and they were able to make use of the space that was given to them, exhibiting great physical performances.\n\nI can definitely understand the praise that this film has received as I do see the qualities that make it a unique and great film, but it just didn't hit home for me at an emotional level, coming off as over-directed rather than the genuineness that it was clearly trying to evoke.",
            "review_date": "2014-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review In A Nutshell:\n\nJules and Jim is about two close friends who meets a girl, Catherine, which then develops into a love triangle that ultimately affects both of these men's lives.\n\nThe film explores ideas of loyalty, friendship, and love in a way that would normally come off as interesting and entertaining, especially for someone like me who has a weakness for digestible and cliché themes. Sadly the film falls short in making these aspects interesting due to the film's central characters. I have not read the novel, and this film would mark as my first in exploring Francois Truffaut's filmography, so I had no expectations coming into this. Truffaut handles the film's characters and story in a quirky and offbeat kind of way, where the events and emotions that films like these would normally walk on would be manipulated in order to have them look and feel stripped down. I see what Truffaut is trying to do with it, as he wants the film to feel more natural, with emotions not always being expressed in a clear and heavy way paralleling to the true nature of humanity, but he has forgotten to give the film a handle for audiences to easily hold, therefore leaving me feeling detached with the characters and the story almost throughout the film's running time. I have to search so much into each scene that by the time I get to its emotional core, I end up feeling exhausted and the drive to figure out what the film is truly trying to deliver starts to fade away from me.\n\nIn terms of the film's plot and narrative, I found it to be interesting as the struggle between each member of the trio of keeping the one they truly care about from leaving and it wasn't hard to follow the intentions of each character. My main issue with the narrative is the pacing and it's delivery of its emotions, which is something I have already discussed. The film flies by the first act of the film, with the introduction of its two male leads and the relationship the characters have. The film doesn't slow down to give us any room to breathe and take it all in, therefore I gave up trying to keep up with it and hopefully as the film goes on, I'll gain a better insight on the characters, which in a way did. The second and third act does eventually slow down the film's pace, but not by a lot. Truffaut gives us a bit more time to take in the characters' motives and persona but I still personally felt that the tempo was still too elevated for me to really feel comprehensively invested, as there was just so much that Truffaut wanted to flesh out but didn't want to lose that sense of urgency and offbeat quality. At first I felt that the film's climax happened too suddenly and lacked any sense of impact, it started to grow on me a little bit as I'm writing this and developing some sort of empathy towards the decisions both of the characters would make; I think it would be something that would come off much better during a second viewing.\n\nWith all of the film's issues, it would be normal for one to find the dialogue in this film to be lacklustre, but surprisingly, it's actually one of the film's best qualities. This is not to say that it's perfect but it is a clear notch up when compared to other aspects of the film. The dialogue really made the characters feel interesting to watch, as they ramble on things that definitely resemble the personality and interests of Truffaut and his colleagues. The topics being discussed throughout the film are of the \"higher\" class, going in depth in things like wine, plays, and psychology. Even after the war that the male characters has went through, the way they discuss it upon reflection is more along the lines of a third-person rather than first; discussing how it impacted others rather than how it was for themselves, almost as if they didn't participate in it. Though, I did find the film's dialogue at times to be a tad bit too indulgent. Characters at times tend to ramble on a tad longer than they should and therefore coming off as a bit tedious in particular moments. The dialogue also lacked a bit off emotion, which was definitely needed on defining moments in the film. The film also includes a voice-over which was used in a way that was smarter than the characters themselves. It acts as a support for the audience to make up for the emotional core and insight that the film lacks, which did its job wonderfully but I personally found unnecessary. The film would have been much more effective if the characters were a bit more clear in themselves and let out a sliver, just a sliver, of elevated drama to give the film a bit weight.\n\nThe film's black and white photography looked quite good though I felt could have been much better in making scenes feel more impacting. Throughout the film we see wonderful tracking shots and pans that do occasionally create that parallel to the film's themes and ideas, but it wasn't enough to carry the film. The film's score on the other hand was a much more satisfying aspect. It was able to heighten that offbeat and quirky style that the director was going for. It also wonderfully captures the mood of the scene perfectly, with at times keeping me highly engaged due to the score alone.\n\nThe film's acting was actually great for what it was. If the actors weren't so restricted by Truffaut's direction and script then the actors would have definitely gotten more praise from me as their characters would have felt more fleshed out and genuine in a cinematic way. All of the three main actors, Henri Sarre; Oskar Werner; and Jeanne Moreau, were great in their roles. All were able to give that energy that Truffaut demanded from them while also sneaking in a hint of internal vulnerability in their characters. Each actor was able to deliver their dialogue really well and they were able to make use of the space that was given to them, exhibiting great physical performances.\n\nI can definitely understand the praise that this film has received as I do see the qualities that make it a unique and great film, but it just didn't hit home for me at an emotional level, coming off as over-directed rather than the genuineness that it was clearly trying to evoke.",
            "review_date": "2014-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed this movie for the most part. He loves her. She loves him, then she does love either him or him, but then she does love one, but not the other. The she hates both of them. Catherine just can't make up her mind! I especially like Truffaut's use of stock footage of Paris before and after WWI; how aware of itself this film is in certain historical and social contexts. My favorite part, however, was the whole 'Catch me!' vibe Catherine exudes throughout the film, forcing Jules and Jim to compete for her affections. The little visual metaphors Truffaut sprinkles throughout the film are a nice touch, too, such as the portrait of Napoleon in Catherine's apartment in the early part of the film.",
            "review_date": "2014-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched Jules et Jim a few weeks ago as part of my course. At first I didn't really enjoy the film too much, I felt that there was something missing from it and the ending completely took me by surprise. However, after discussing it with classmates and my tutor, I reflected on the film and came to the conclusion that I did in fact enjoy the film. It was just that I hadn't seen anything before similar to it, so it was strange to me. Jules et Jim is witty, tragic and fun all at once. I recommend this film.",
            "review_date": "2014-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this could be one of my new favorite films.",
            "review_date": "2014-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most terrible movie I've seen",
            "review_date": "2014-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally got around to checking this one out: It's an interesting look at interpersonal relations between three close friends, told over the course of a few decades.\n\nWorth tracking down, give it a rental.",
            "review_date": "2013-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was this the birth of the manic pixie girl?  Love triangle with an existential twist.  Worth seeing but very french.",
            "review_date": "2013-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed this film, after it was over I just wanted to watch it again. It is such an amazing French New Wave film, Truffaut does so many thing right here and it comes together perfectly.",
            "review_date": "2013-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie done over 50 years ago taking place 30 to 50 years before that but still could be easily placed to this day, a century later. The director called it a \"hymn to life\" and it's about love, a polyamorous triangle of sorts between two best friends and a woman who enters their life, about the basic human emotions in relationships not constrained by cultural norms.",
            "review_date": "2013-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can finally scratch another \"I've been meaning to see this for years\" movie off my list. Well worth the wait.",
            "review_date": "2013-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bizarre Love Triangle Will Tear Us Apart",
            "review_date": "2013-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pure cinema, one of the great french new wave films. Jules et Jim is the total existential romance. Jeanne Moreau makes the film single handedly as nothing matters to her, love is a game, who she loves is not important as long as she loves. It is just a compulsion. In an act as quotidian as tying her shoe she drives off a bridge to show that her love means nothing and he means nothing to her and it does not matter if they live or die because all is an illusion. Everything about this film is wonderful, fresh, breezy, full of life. One of the best films about love, ever.",
            "review_date": "2013-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the character of Catherine.",
            "review_date": "2013-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I found this movie intriguing and had a love triangle theme going on. It shocked me and kept me engrossed. I found the acting made the characters come to life thanks to the great acting talents of the actors.",
            "review_date": "2013-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I understand this film is highly acclaimed but, unfortunately, either due to the era in which I was born, my \"Americanized\" point of view on cinema or some other lack of sophistication, I was unable to fully appreciate it.  It is a beautiful piece of art and makes for nice background scenery (maybe good to have on while hosting a formal cocktail party), but in the end, I found it to be idealistic to the point of unrealistic, whimsical to the point of annoyance and repetitive.  But hey, what do I know?",
            "review_date": "2013-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece in romance film that never stops with the fascination factor. You really become part of this world within and fall in love with it. Never a dull moment, and the only thing you wish by the end is a want for more.",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If one would want to witness the sheer complexity of love without the utter abundance of unnecessary despair, then I believe that one should not look any further than this film. Although a visually joyful film, \"Jules and Jim\", based on the novel by Henri-Pierre Roche, is ironically all about the slow decay of a freewheeling love affair. The film's central focus, of course as suggested by the title, revolves around a friendship between two men and how time (or war) can never undo such a strong knot. But then again, the film is also about how a friendship can easily fall prey to the idiocy of romance, the bipolarity of love and the captivating beauty of a woman before they can even know what has hit them.\n     \nEffortlessly becoming the best of friends immediately after their first meeting, Jules and Jim's friendship is suddenly drawn into a moody yet, to a certain extent, wonderful ride of both love and life via an adventurously unpredictable woman named Catherine (perhaps a prelude to the character trope we now know as 'The Manic Pixie Dream Girl'). \n     \nFrancois Truffaut, a most visually playful auteur, is dead set on exploring love with a sure grasp of irony and relentless energy. \"Jules and Jim\", with its constant visual frolics and overall feel, is really hard to categorize within a single genre. Part-comedy, part-drama and part-romance (with some hints of war-time dramatics), the film is everything a cinephile can ask for. For the entirety of the film's almost 2 hours of running time, I was just engrossed with what I'm seeing, and it's not just about the film's pioneering visuals. Even when the three central characters are just talking, exchanging reflective remarks and laughing, one can still sense the same tight energy that was fully evident in the film's fast-lipped narration, silent film-like music and playful cinematography. This is definitely because of how well-realized and inspired the performances in the film really are, specifically by the centerpiece threesome comprised of Oskar Werner (Jules), Henri Serre (Jim) and Jeanne Moreau (Catherine). \n     \nDespite the film tackling a relatively heavy-handed tale about romantic deceit, Truffaut was able to inject a sense of childish gayness in it all. And it is in this childishness that the film was able to separate itself from other films of its kind. \n     \nFor me, what makes \"Jules and Jim\" stand out and be rightfully heralded as one of the best films of all time is how it has took on infidelity and romantic apprehension with such carefree warmth and transcendental tenderness. Truffaut, one of the ultimate film intellectuals in cinema history, has relied solely on one concept and it has repaid him and \"Jules and Jim\" a hundredfold: Optimism. \n     \nEven in the face of tragedy and melancholy, Truffaut was hopeful enough to make us feel that the pursuit of love, no matter the context, the situation and even the consequences, is something that is just truly wonderful to be denied an entry into our hearts. But in the end, he was also able to highlight the fact that obsession, even in the context of love, is an entirely different matter. \"Is it the pursuit of an elusive, on and off love or the subtle pains of moving on?\" That, for me, is the film's ultimate question. \"Jules and Jim\" is about how something's got to give.",
            "review_date": "2012-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "everyone raves about this i can't see what all the fuss was about.",
            "review_date": "2012-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A breath of fresh air for its time, Jules and Jim now remains an admirably-constructed and well-acted, but far too repetitive love triangle movie.",
            "review_date": "2012-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truffaut is the French Olmi :)",
            "review_date": "2012-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolute masterpiece of romance, war, and passion. Jules et Jim is nothing short of beautiful. Incredible story-telling, great dialogue, and perfect acting by the best three-some in the history of film. To say this is one of the best French films of all-time would be an understatement...",
            "review_date": "2012-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jules and Jim is a well-shot foreign film that is filled with lots of sweetness and emotion.",
            "review_date": "2012-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A real treat. This is the film that shot Truffaut into another realm in my opinion. Nobody can beat this guy when it comes to love and romance in film. The characters feel like real people. The first 40 minutes is purely to set the picture and to give exposition. The real drama starts once we've really gotten to know the three major characters.\r\n\r\nThe movie keeps things light with a fun score and plenty of laughs scattered throughout. The movie's shot to perfection. Truffaut keeps things smooth and casual. He's a real professional. He makes it all look so easy.\r\n\r\nJeanne Moreau is an absolute doll in this film. She's such a great actress, and just like she did in Elevator to the Gallows, she steals the show here. I also quite enjoyed the actor who played Jim. Moreau's Catherine may not be the most perfect girl in the world, but as the characters mention, she's a real woman and in terms of that she nailed it.\r\n\r\nJules and Jim is quite an accomplishment. It proves that in \"love triangles\" it is often the relationship of the friends rather than the lovers that actually has more love. The roller coaster ride of relationships in the film all felt authentic because the characters felt so real. The writing was so strong that it was easy for me as a viewer to relate to what was going on in the characters' heads. This tender and iconic film truly has it all.",
            "review_date": "2012-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A magical tale of love and betrayal and one of Francois Truffaut's finest films, \"Jules and Jim\" is unforgettable. The movie is a blast from the clever editing, to Raoul Coutards wide- shots and zooms, and the heart crushing acting from the main trio of Moreau, Serre, and Werner. The honest beauty of the story coupled with gorgeous settings imagined wonderfully in black and white is only a luxury to a movie that already comes off as too much of a delight.",
            "review_date": "2012-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's as if Truffant took a Renoir film, and New Waved the crap out of it. What's left has all the charm of its predecessors, and all the edge and pop of its contemporaries. It stretches film into new horizons, while staying full of heart and remaining wildly entertaining. It's very good.",
            "review_date": "2012-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a 1962 movie, the daring tale is absolutely ahead of time, with Jeanne Moreau performing a character that never lets her love becoming boring,  feelings and desires with lovers and then returning for her husband. The friendship of Jules and Jim is unusual.",
            "review_date": "2012-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "hmm im not sure how i feel about it. i liked it but I was definitely expecting more",
            "review_date": "2012-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "in this film , truffaut returns one of your main themes : the relationship and love . More movie with truffaut Ã,Â´style.",
            "review_date": "2012-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was really depressing.",
            "review_date": "2012-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautifully filmed movie about the nature of love and friendship with excellent performances from the whole cast.",
            "review_date": "2012-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An epic romdram, this is one of those movies that once seen is never forgotten. Another step on the celluloid road to me seeing the 175 Greatest Movies of all time as designated by The Guardian, it's the story of two friends whose relationship is threatened both by love and war. A movie from the Sixties tackling the subject of bipolar disorder sounds astonishing and this is certainly that.",
            "review_date": "2012-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie I utterly adore..! Like I always say, love is never easier expressed but in french.",
            "review_date": "2012-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautifully shot film about three friends and the love triangle that entangled them all. And while their sentiments about love were markedly European, one can't help but think that was due to one of them being somewhat crazy . . .",
            "review_date": "2012-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a movie with charm, excitement, and tragedy.",
            "review_date": "2012-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "watch how a stupid self absorbed girl ruins and destroys a powerful friendship between two men.  despite that little comment, its a very well made film, beautifully acted by the three leads and you experience a wide range of emotions all the way to the chilling tragic end.  its the tragic love that you often seen in shakespeare's plays and the way how love can bring death to that you don't expect it to...",
            "review_date": "2012-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "expect too much before watching the movie is no good. sorry to the movie.\nA delirious romance among three friends results in tragedy. Love cannot be shared or intruded especially it is entitled to marriage, highly prohibited. The filming style is fresh, witty and swift, no wonder he can lead the french movie to the next level in the early ninety. \nA great experience despite of the coarse resolution on screen.",
            "review_date": "2012-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Francois Truffaut's artistically ingenious tale of two friends and the troubled woman which they both love. This doomed triangle is captured in one of the most alive and exuberant pieces of cinema ever dedicated to celluloid. Truffaut has the craft and skill of Godard's behind the camera work, but more importantly, his nose for a good story is impeccable.",
            "review_date": "2012-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The dynamics of any relationship are always fascinating but when you add a third person to the mix, and all three love each other equally, the results are unpredictable and captivating.  This mixture is exactly what you see in JULES ET JIM (Francois Truffaut, 1962) and this film is a great stepping stone for Truffaut.  He crafts a narrative which focuses on adult issues and problems but paints his characters in a way to identify them as children, a task not readily achieved.  His narrative is controversial and a reflection of issues bubbling quietly below the surface of when the film was made.  He stretches as a filmmaker, using techniques he hadn't used before.  He continues his examination of human interaction and the intricacies entailed there.  Finally for the first time in his filmmaking he allows a star to dominate his film and believe me there is no time when Jeanne Moreau doesn't hold the strict attention of the viewer.\n\nPlaying the part of Catherine, Moreau teams with Oskar Werner (Jules) and Henri Serre (Jim) in forming a childlike trio.  Truffaut skillfully creates a childlike presence to his characters in dress, activity and emotion.  One scene particularly stands out.  Jules has been spending a lot of time with Catherine and he wants Jim to join them.  Jim arrives and Catherine proceeds to dress up as \"Thomas\".  The three run through the streets of Paris masquerading as three boys.  They come to a bridge and race across, with \"Thomas\" using a childlike subterfuge to win.  As the trio laugh and giggle at the finish line they decide to visit the sea.  For these three adults, life is childlike and innocent.  It is a vacation and this is exactly how Truffaut wants them portrayed.  They become an extension of characters he already has shown us on screen.  Jules and Jim can be seen as extensions Antoine and Rene, older versions of his two truants.\n\nCinematically Truffaut himself showcases a more experienced and experimental filmmaker.  Throughout the film he uses techniques previously unseen in his work.  When we are introduced to Catherine we see several images of her frozen on the screen.  Later he uses the same technique for her again, giving us a glimpse of the fracturing taking place inside her mind.  Truffaut uses handheld camera more extensively and even takes to aerial work, imparting a dreamlike quality to aspects of the narrative.  He also is more experimental with camera placement and movement.   His narrative subject matter is adult and controversial, tackling a subject long considered taboo not only in cinema but in society in general.\n\nThis tackling of controversial narrative fascinates me.  Truffaut's examination of the human condition and our interactions with each other is often quite profound.  With this film he tackles love and monogamy, forcing a look at not only our own personal views but societal ones.  The societal conventions he places under the microscope are remarkable in regards to where we stand presently.  The place in society for marriage, cohabitation and the roles children play in our adult decisions are prevalent topics today.  And what of his examination for love outside marriage?  Truffaut's dealing with three people that love each other equally is deftly and tastefully done.  In fact it is almost Utopian, if it weren't for a brilliant and fractured protagonist, Catherine.\n\nAnd to me, ultimately Catherine is the protagonist to the film and much of this has to do with an outstanding portrayal by Jeanne Moreau.  So many adjectives describe Catherine; powerful, strong, broken, imperfect, joyful, morose, loving.  Moreau skillfully maneuvers between her three loves (can't forget Albert), seeking and finding that which she needs from the three.  Unable to comprehend the needs of others and being full of disdain for the conventions of society, Catherine exudes the essence of a contemporary woman.  Her best moment in the film is as she sings Le Tourbillon de Vie.  The lyrics are  melodic and the tune catching.  But placed into the context of where she is in the film, they are haunting.  Who is she singing to?  And can't the lyrics really be aimed at all three males?  Truffaut's genius really shines through here in his composition of the scene in how he positions Catherine to face Albert but still be amidst the three.\n\nThe more I watch of Truffaut the more he grounds himself in my mind as a genius director.  This film is great, albeit paced a little slowly.  And as I always write in my notes on his films, remember his films are always autobiographical.  Which makes me wonder what inspired this gem.  Oh to know that!",
            "review_date": "2012-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beauty. That's all I could say. Addictive movie. Terrific actors. The mood. The characters.",
            "review_date": "2012-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"We played with life and lost.\"",
            "review_date": "2012-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ah, French New Wave...didn't love this as much I expected I would, but it had some very interesting things to ponder about friendship, love & sanity - worth checking out, solid performances.",
            "review_date": "2012-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "an interesting film, and in many ways not what i expected. i mean the beautiful cinematography and cinema verite camera work that's emblematic of the french new wave, as well as the metaphysical characterizations and nonconformist scene structures that define the film movement were all in place, but it still felt a bit off to me, mostly because i had heard a lot about this film and was expecting something much different. for one thing, i found it odd that the film was set in the early 1900s because i so readily associate the aesthetic of the new wave with the 1960s - that aesthetic was in some ways still preserved in this film, but at other times clashed with the period wardrobe and sets. it just felt a bit unnatural to me. in terms of plot and characterization as well, i think this film suffered. for one thing, i found it to be excruciatingly slow, which hints at some severe pacing problems, given that the film was only an hour 40 minutes. to me, \"pace\" has nothing to do with \"action\" and i completely respect the new wave style - goddard's breathless for example had 30 minute dialogue scenes where absolutely nothing happened, but it still felt like it was moving at a fast pace, because the dialogue and the characters and the dynamics between them were interesting. with this film i think, the main problem, which highlighted all other problems, was that the lead trio weren't interesting - i didn't particularly understand them or their behaviours and soon found myself bored, especially because the same dynamic seemed to loop over and over again, nothing new developed. the story's sweeping timeline and constant narration slowed the pace even further - i found myself being TOLD of all the important plot points and character dynamics that defined the film, instead of SEEING them for myself. for example, jules and jim's friendship, which the central point of the film, is defined by the narrator as \"having no equivalent in love\". this is a grand statement, but one that i found unfounded in the film - i sensed no closeness between the two characters throughout the film and as a result felt nothing at the film's tragic end. i realize the way these characters are depicted is in keeping with the new wave style, but in most new wave films, the characters are interesting enough to sustain their nonchalant depiction - in this film, however, i found that they were not.",
            "review_date": "2011-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest love affairs.",
            "review_date": "2011-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful and life-affirming film.",
            "review_date": "2011-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe I'm not that big a fan of French New Wave...but in the end I just thought \"what was the point\". Basically 2 best friends have awkward relationships with the same batshit crazy lady.",
            "review_date": "2011-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truffaut doing what Truffaut does.",
            "review_date": "2011-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truffaut I wanna give you a big kiss for this one! One of the greatest french films ever made!",
            "review_date": "2011-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ah, the French New Wave.  And poor \"Jules et Jim\"-- it's probably the best film of the period and Godard's \"A bout de Souffle\" gets all the credit for being the big one.  I love the latter, but it doesn't have that total magic that \"Jules et Jim\" offers, and it doesn't feel the same the second time like this film does.  François Truffaut is my personal favorite French director, and this is certainly one of his best films. Jules (Oskar Werner) and Jim (Henri Serre) are fast friends in 1912, traveling the streets together and having mini-adventures to pass the time.  Their relationship is rocked quickly when the charismatic and outgoing Catherine (Jeanne Moreau) becomes a part of their lives, working as a sort of love object and temptress.  Eventually, Jules is the one that gets the girl, but it isn't happy for long. The war separates the three friends for a period of time, and once they're reunited, Jules and Catherine are married, with a young daughter.  Jim has shaved his cartoonish mustache, and sports a more mature outlook that suits him better.  The two men have aged, and their friendship seems more trusting than ever, but Catherine, who inside is still the the inconsiderate, unstable woman, desperately wants Jim's affection once again.  He knows it's completely the wrong decision-- after all, she cheated on her own husband multiple times-- so he doesn't take the opportunity.  But Catherine isn't the kind to just \"let things go\". \"Jules et Jim\" moves along with the frenetic energy of a silent movie.  Something is always happening, and the characters are either animated, and if not, capture the look of a '20s film star.  Serre especially, has the awkward lankiness that fits perfectly to be a comedic actor, whereas Werner is his foil.  The film isn't really funny, and neither are its characters, but there's something in the relationship that's somewhat exciting and reminiscent of a comedian with the best sidekick in then world.  As the film gets darker, the friendship takes a downward turn that is undoubtably a little bit sad. The friendship at first seems solid and friendly, and quickly it turns into something much worse.  In the second half of the film, one is left to wonder-- is Jim really that selfish of a friend, or is it Catherine that's turning him into a jerk? I'll pick the latter, but some won't think so.  People trying to look too deep might misinterpret the dissolving as artificiality, but truly it shows how much simply \"growing up\" can change a person.  Then Truffaut turns the tables once again and the plot is twisted right under our noses. In the meantime, the technical aspects, especially the voiceover, are highly important to the new wave.  While it shouldn't work, the voiceover makes the period setting feel just as chic as '60s France itself, all the while maintaining to give \"Jules et Jim\" a light touch of experiment and total modernization.  Voiceovers were mostly used in America in hard-boiled film noir, but Truffaut uses it as though he's trying to prove everyone wrong.  It, if anything, makes the film even better.  It's a huge component. The setting is set between 1912 and 1933, but Truffaut, unlike most directors, isn't as concerned about the costumes or the set pieces.  He knows this is a character piece, and the focus goes on the trio.  The filming style is certainly dreamy, and the editing is artistic beyond belief, but not once can we take our eyes off of Jules, Jim and Catherine.  This is certainly one of the best casts in a film, even though there is so few. Truffaut's direction is masterful, and sets the standard of modern filmmaking completely.  He throws away the conventions of directing that the '60s brought on and shapes it into a statue of a film that's incredibly appealing.  It shines almost with the feeling of a \"new car\", even though it's 50 years old.  \"Jules et Jim\" is almost exciting to watch because, while it's entertaining like a film should be, it's also artistically fascinating without being pretentious.  Truffaut is a better version of Godard, one that can make a film pop all the while maintaining a fascinating story. The men who play Jules and Jim aren't the \"actor\" types like Alain Delon or Jean-Paul Belmondo (even though they're both important to the French New Wave), and are instead portrayed by Oskar Werner and Henri Serre, more average looking and relatable.  They're portrayals are simple, likable and subtle, but the fact that they aren't so good-looking make femme fatale Jeanne Moreau all the more appealing. Moreau is certainly the most talented (and most memorable) of all the French New Wave.  The other important actress of the era, Anna Karina, always managed to look cool and mysterious, but never did much otherwise.  Moreau on the other hand constantly gave terrific performances and almost always stole the film from everyone else.  She has a look that's totally distinct and unique, and a voice that rings with sweetness but can deliver bit.  Moreau is the archetypal French actress; while she's beautiful, she has the elegance and range to pull off any role.  \"Jules et Jim\" might be her most intriguing role.  She is the focal point of the film, even if she isn't a titular character.  There isn't a second where we don't believe she isn't a seductress, but there also isn't a minute we don't like her.  She's to enigmatic for that.  Catherine is a character unlike any other, and Moreau is probably the only one that could have pulled it off so well-- Catherine obviously has a few mental troubles, but Moreau doesn't once overdo it. \"Jules et Jim\" is obviously a film I could go on and on about.  The point is-- see it.  This is the definition of what an important film is, and there isn't one doubt in my mind about that statement.",
            "review_date": "2011-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An interesting french movie about a love triangle.",
            "review_date": "2011-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Had no idea this was based off true events until after watching it. One of Truffaut's most accomplished, a love triangle that actually features no sex, rarely features jealous emotions or anger towards one another. As unusual as that sounds, Jules And Jim works because it doesn't feature any of those cliches. The relationships gone on and off throughout the years between the 3 are portrayed in a very repressed style for the men, but very freespirited through the female view, will make it obvious that the story is told through a male writer. Ironically, the women in the 60s loved and wanted to model after the Catherine character (in a slutty way), which was not anything the original writer intended... silly how things end up.",
            "review_date": "2011-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was overwhelmed with love and admiration for this film the whole time I watched it. Highly recommended.",
            "review_date": "2011-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "True old school French film having extreme and splendid emphasis on acting, dialogues and emotions.",
            "review_date": "2011-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked this movie, and I enjoyed watching it, but I was left expecting more. As part of the French New Wave, I knew to expect this film to be overflowing with style and technique, but I also expected it to be fun. Maybe I shouldn't have been so insistant on that last part. This film is fun, at times, but it gets serious too, and when it does, I find it harder to swallow. Maybe because it's hard to completely identify with or care deeply about the characters.\n\nThis story is all about an Austrian named Jules who is friends with a French guy named Jim. They share a mutual love for a (probably bi polar) woman named Catherine. The story takes place over a coupkel of decades from the 1910s to the 1930s, and hops all over Europe (mostly France and Germany). I don't mind love triancgle movie, but the way the story progresses seemed very odd and all over the place and unlkely. Also, this is a period piece, but I never really got that sense. It seemed more like the time it was released than the time it was supposed to be portraying.\n\nBecause this film is style over substance, and because the characters are nuts, ridiculous, and hard to identify with ocmpletely, I should, by all rights, knock this down a notch or two. However, the film has a gorgeous look, great camera work, wonderful music, good performances, and the aforementioned style, so there. \n\nI do recommend this movie, despite it being overrated. Part of its importance and legacy and undeniable and understandable, but this film is a bit of a mess. It's not always apparent though since often this film is light, breezy, and not restricted by a super dense plot.  See it, but don't expect it to be the masterpiece that many claim it to be.",
            "review_date": "2011-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although at first it seems quite annoying (unconvincing scenes, abundant voiceovers), the film grows on you as it explores the fascinating love triangle revolving around the fickle Catherine.",
            "review_date": "2011-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "French New Wave certainly was a turning point for cinema across the globe. Jules and Jim is my latest excursion into these amazing examples of free flowing films. While I didn't find it quite to be the masterpieces such as \"A bout de souffle\" or \"The 400 Blows\" it was very enjoyable. I loved the first half of the story a lot more than the second half. It lost most of its charm in the second half and it became a bit of a drag until the end. \n\nWhile I wouldn't label this a masterpiece, it has had an enormous impact that can still be seen today. The most obvious being \"Vicky Christina Barcelona\" which borrowed heavily from this film. However the directing by Truffaut is spectacular. Many times I caught myself being impressed by the camerawork above the story being told. Now I'm off to explore more of this old New Wave.",
            "review_date": "2011-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved most of this movie but I really hated Catherine for at least the last 30 or so minutes. It was pretty heart-wrenching to see the way that she conferred with Jules about her relationship with Jim. That, for me was hard to swallow. All of the promotional material for this film that I had seen indicated that it would be more light-hearted, which is true at points, but it definitely isn't something that I would be able to watch in all moods. I didn't find it to be as good as the 400 Blows, but overall, a superior film with phenomenal music, acting and camerawork.",
            "review_date": "2011-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sadly, I've really only seen a couple of French New Wave movies, but this one was the best so far. Seeing this movie back in 1962 must have been astonishing for audiences; it moves quickly and feels alive and raw in a way virtually nothing else I know of up to that point had. The style of the film is mainly what made it so important at the time and why it is still famous today, but unlike Godard's cold, clinical Pierrot le Fou, there is actually a story here too.\n\nThe film shows us the lives of Jules and Jim, a German and a Frenchman who are best friends before they fall in love with the same woman, and actually continue to be best friends anyway after falling in love with the same woman. The woman, Catherine, played in a great performance by Jeanne Moreau, marries one of them, but then decides she wants the other to move into their house, then sleeps with the first one again, and so on. Their story unfold over the course of about 20 years, from 1912 to 1932 or so.  While it's easy to see Catherine's charm and why they would like her, it's also tempting to dislike her for her the way she toys with the two men, and to think them contemptible for the way they put up with her shenanigans. \n\nDirector Francois Truffaut's style is what really sets this movie apart. I especially liked the lightning-fast prologue, which bounces through a lot of exposition about Jules and Jim's early friendship very quickly. Especially towards the beginning, the film seems to have a much shorter average shot-length than was common in the early 1960s; it's like the movie wants to rush headlong into its story and expects you to be able to keep up. Truffaut uses other little tricks here and there, but they always make sense in terms of the story - I especially liked one little sequence in which he uses brief freeze-frames to capture some of Catherine's facial expressions. Other shots are great just for the way they're set up, such as the scene in which the three characters shout to each other from three different windows. The whole film is characterized by a certain immediacy that Hollywood films of the same period tend to lack. It's clearly a very important part of film history, and I can't believe I just now got around to seeing it.",
            "review_date": "2011-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Name an emotion. This movie will make you feel it!",
            "review_date": "2011-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Highly recommended by cosmo313 with 4, count em 4 Stars.There was an episode of Sex & the City where Miranda is Watching this with her Sports Doctor Boyfriend(Taye Diggs).If it's good enough for cosmo313 & Miranda fr SATC, I can't argue with that, giggle",
            "review_date": "2011-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Le Tourbillon... beautiful song performed by Jeanne Moreau :)",
            "review_date": "2011-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Frenetic, fresh, and still fun to watch even as it approaches it's fiftieth birthday. While certainly the most stylish of the New Wave films that I have seen so far, the frequent use of freeze frames, jump cuts, and panning shots, surprisingly isn't distracting. In fact, Trauffaut's use of these devices is very judicious and really elevates the film as a whole. This sets the work apart from films such as Goddard's Breathless where it seemed at times that many of the devices used in the film were used because they were \"cool\" or different, rather than augment the power of the story. \nIt is a dynamic rumination on friendship, love, war, and the changing nature of femininity, and certainly one not to be missed.",
            "review_date": "2011-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's so much infectious life and energy in this one that its hard not to like. It's been so long since I've seen a Truffaut that I'd forgotten how wonderfully breezy his word can be.",
            "review_date": "2011-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seminal New Wave film from Truffaut that is bursting with style telling the story of three bohemians trying to figure out what love is. Shoulda been a warning to all those nascent hippies.",
            "review_date": "2011-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "love this film! the acting and characters make me smile.",
            "review_date": "2011-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Jules and Jim\" is a tragic love story that begins as a innocent affair but ultimately leads to unstable infidelity, and strained friendships and relationships. Everyone involved feels some sort of pain. Francois Truffait seems to love taking simple subjects and putting them up on the screen with clarity and beauty, and the results are marvelous. \"Jules and Jim\" is another sad film from the influential film critic and director. The dialogue is clear and powerful; the filming techniques are magnificent and inventive, especially through the stills. In particular, one scene where Catherine, the woman at the centre of Jules and Jim, is showing off her attitudes towards life before she even met them and then after she met them. Those were some very unique shots. Below the sadness, there is exhuberence, as well, showing how the two men are constantly flirting with Catherine, that is before the WWI came. There are number of poetic devices in the dialogue, including the reference that Catherine is the queen of hive (the house in which the three of them live in). Truffait sure was a neat human and he came up with this fine, beautiful great work.",
            "review_date": "2011-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is an abundance of cinematic artistry on display here, with Truffaut playfully experimenting with camera angles and film editing.  The story itself is bizarre, to say the least, with Jeanne Moreau starring as both romantic and lunatic.",
            "review_date": "2011-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "French new wave swinging love triangle.  The film references and explores some of the themes in Goethe's Elective Affinities.  Jeanne Moreau plays an amazing nouvelle vague femme fatale.  The score highlights the fanciful moments and keeps a foggy dream like melancholy tension at other times.  Oskar Werner is excellent in his role- when he sings the Austrian song it is scary and the way he plays Jules resignation is wonderful- his walk down the hill at the end with that spring in his step.  Catherine jumping in the canal while Jules qutoes Baudelaire is a memorable scene.  The scene with Jim and Catherine at the corner of the house and Jules on the balcony is primo.  Also in the scene near the end with Jim and Catherine when the camera shakes after he mentions still being able to have children with Gilberte--is brilliantly evocative of Catherine's psychological state.  Some quotes I enjoyed from the film: Happiness isn't easy to record and wears out without anyone noticing.; You wanted to invent love.  But pioneers must be humble and unselfish.; ...but that was against regulations.",
            "review_date": "2011-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strange and beautiful.",
            "review_date": "2011-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have mixed feelings about Jules and Jim. On one hand it's stylistically profound, of another world, a mile marker in the great journey of filmmaking content and technique; on the other hand it's about an insane muse that makes every man who comes into her life fall madly in love with her, including two best friends who revolve their entire lives around her capricious cries, calls and random disappearances to sleep with other men. \n\nI can't quite put my finger on what irks me overall about this film, whether it's of knowing actual women like that in real life who gave harm to my friends, not being enchanted by Jeanne Moreau, the weakness of both men, perhaps all of it. \n\nI can imagine if this film were made today, how Kate Hudson, or someone equally attractive, would play the role, while two helpless shmucks whined around her slapstick suicide attempts, eating sandwiches together, while on the side--eating whatever shit she doled out, depending on her boredom. \n\nGwyneth Paltrow's Margot in the Royal Tenenbaums got it right at least with her cold sincerity and regal demeanor, but she was a misunderstood genius, not a cataclysmic mess for the sake of being cataclysmic. \n\nFemale characters feasting on the souls of pathetic men is not compelling, unless the genre is horror, thriller or comedy, none of which was Jules and Jim--a \"quirky, romantic, cerebral\" drama? Undoubtedly cerebral, yes, but romantic, I couldn't say, unless romance is declared synonymous with terminal illness. But ask most poets; they'll say yes to that one in a snap.\n\nBut many people love this film, especially because of the director and the directing, because it's French and quirky in that dark, French manner of dysfunction being real and hilarious and charming women who are crazy drive men mad with desire versus boring beautiful women with every their predictable mannerism just sitting there with nothing to say--yes, yes, yes, I see the attraction and the fodder for conversation this film would bring, the debates of what is what defines art and New Wave greatness. \n\nJules and Jim is a walloping time capsule of style preserving culture, attitudes, an homage to joie de vivre and the struggles in love which make even the strongest of humans vulnerable in its pursuit. Hence, its classic infamy, and its ever growing list of admirers placing it on the pedestal of greatness. \n\nI myself wouldn't watch it again unless I got in a time machine, went 12 years back into my reckless, carefree lifestyle and turned it on to watch after downing half a bottle of wine with a malleable male admirer, or two. Ah, then it would all make sense.",
            "review_date": "2011-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the landmark films of the French New Wave, Francois Truffaut's Jules and Jim embraces contradiction to create meaning. For some this movie will enrage(some think that the critical acclaim isn't justified) while others will be drawn into the web(just like Catherine draws Jules and Jim in). It is a difficult call as to whether someone will like it or not. For people who need to make sense out of relationships between people and the world around them, they will be lost. There are few answers here, so if you need all questions answered, then it is best to watch another French New Wave film first(The 400 Blows maybe).\r\n\r\nThe film has great lead performances, a psychologically draining story and a brilliant, energetic style. All of the French New Wave films pushed the boundaries of what film had been. The French New Wave(Breathless, Band of Outsiders) changed film and so many of the techniques used here ar still used today. It was a very influential movement.\r\n\r\nThe movie is about a romantic love triangle that lasts for decades. So much of this will be quite frustrating for some viewers, because the person at the center of the triangle is such a complex and difficult character. She will never commit to anyone or anything, which will only infuriate and confuse a mainstream audience. This and the other French New Wave films are essential to anyone who considers themselves a lover of film. Memorable for me, but could be just too intolerable for you. If you take the plunge, let me know what you think.",
            "review_date": "2011-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Masterpiece! Friendship, Romance, Resignation!",
            "review_date": "2011-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can't break the ties that bind.",
            "review_date": "2011-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. Time changes things. 20 years ago I watched this as a movie on friendship and French way of living, now it was more like a psychopathology of bi-polar and narcissists. There's some delicate beauty in the heart of darkness and in the way this setting is directed.",
            "review_date": "2011-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What else is left to say other than it's one of the most essential films from the French New Wave? Rapid editing, freeze frames, jump cuts, extended voice overs. C'est un film magnifique.",
            "review_date": "2010-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most compelling romances ever. It beautifully and intelligently explores friendship, love, loss, longing, and desire all while exercising some hidden form of exposition and adventurously delving into adultery and depression. One of the best movies ever made.",
            "review_date": "2010-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My only 2nd Truffaut movie...The story of an impulsive women & two friends... shown in  such simple yet so beautiful way.Sheer Brilliance...Cinema at it's Cinematic Best!!!",
            "review_date": "2010-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an absolutely fantastic film! About unusual love and a very strong friendship through decades with Paris and the Austrian alps as backdrops. Put your conventional morality aside and watch this wonderful movie!",
            "review_date": "2010-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "French New Wave isn't really my bag. That woman could not have died fast enough.",
            "review_date": "2010-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that shows what the French New Wave is all about",
            "review_date": "2010-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fine study of relationships in which the director, Traffaut, takes a deliberate approach including the outlined themes such as war and culture of Parisian to build a quirky, selfish and self-absorbed relationship consumption. The characters are well-divided, which I prefer to call Catherine \"a devil in disguise\" for her actions, Jules as \"the angel who only passes by at 20 past\" because his presence exists only in the absence of Jim's and Catherine's love, and Jim as \"the stranger\" who, from the very first time, is exactly a stranger to Catherine (this refers to the lines she said in one of the last scenes). There is much to learn from the film; the egoistic view on relationship between man and woman, the relationship between Jim and Jules, and the character of Catherine itself, form an intriguing, wide-ranged and endless study of social relationship.",
            "review_date": "2010-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "you can't fully love 'vicky christina barcelona' until you've seen the film it pays homage to, 'jules and jim.' here is the original story of two friends who love each other enough to share their love of a woman who cannot be contained by either of them. together the trio struggles to find the delicate balance required to keep them all happy, though circumstances prevent it from lasting. it's a tragic, beautiful and honestly told portrait of young, articulate, generous hearts struggling to find their proper place in the world.",
            "review_date": "2010-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think it's interesting that this is considered one of the greatest films of all time. It's slow, meandering, and features no likable characters. The dialogue is, at times, witty; but it's not enough to make me care about anything that happens in the movie.\n\nThere was one scenes however, that stands out in my mind, in which the three main characters have a foot race across a bridge. It's one of those scenes that has a kinetic quality to it, and almost forces you to smile. That's it though.\n\nSo far, The 400 Blows is still the best French film I've seen.",
            "review_date": "2010-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly great, yet painful film about friendship, love, and loss.  Certainly one of Truffaut's better works.  Jules and Jim are the best of friends.  Jules marries Catherine and goes off to war.  Jim and Jules fight on opposing sides in WW2, and get back together after the war is over.  Jules's marriage is failing. Catherine has cheated on Jules numerous times and is about to walk out of his life for good.  Out of desperation, he begs his best friend Jim (who has always found Catherine intriguing and beautiful) to marry his wife, if only so that he can still see her.  Jim and Catherine fall in love, but Catherine just can't seem to figure out who she loves.  After Jim gets tired of Catherine's incessant infidelity and diva complex, Catherine takes him out for a drive, and plunges the car into a lake, killing them both. Yes, I realize my pathetic synopsis does this brilliant film no justice.  :)",
            "review_date": "2010-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hated Catherine. She was an utterly terrible woman. Both Jules and Jim I liked, and the entire movie I was hoping that Catherine would just leave and never come back, leaving them to their own lives. But no. She has to continue be a freaking nightmare for the both of them. I liked the style of the film, though (I'm guessing the same style was intentionally applied to Amelie, but I don't know). Especially in the beginning. Very lighthearted and fun. Until Catherine goes totally psycho.",
            "review_date": "2010-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Francois Truffaut's artistically ingenious tale of two friends and the troubled woman which they both love. This doomed triangle is captured in one of the most alive and exuberant pieces of cinema ever dedicated to celluloid. Truffaut has the craft and skill of Godard's behind the camera work, but more importantly, his nose for a good story is impeccable.",
            "review_date": "2010-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jules and Jim is one of those films that epitomizes the French New Waves--in fact, almost an entire film class could be tought off of the various cinematic devices that is uses. It is a filmic lexicon unto itself. Aside from its stylish flourishes, it is also an irreverant exploration of identity and love.As he does in several of the Antoine Doinel films, Truffaut explores love with a master's hand--it is an emotion that both elevates us to heaven and damns us to hell. And to this reviewer, there is no better definition of love than that. It is a bipolar emotion as evidenced by the character of Catherine whose love oscillates from Jules to Jim to others and ultimately can only be satisfied in death. Ultimately, Jules and Jim is about the hollow nature of our expectations of love--it is picture of the disappointment entailed by our love of love. We expect to find an other that will complete us in ways that are ultimately impossible as evidenced from Catherine's jumping from one love to the next.",
            "review_date": "2010-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great actors, great writing, good story, great filming, great score\r\n\u0095\tThis movie was great. A little fast and hard to understand but all in all a great movie. I love the love triangle but its a little confusing on her frequent switch of the 2 men. I did love the music and filming. The actors were great and the movie was wonderfull",
            "review_date": "2010-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic French movie about a love triangle and it's consequences.  All three lead performances are excellent.",
            "review_date": "2010-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gruesome end to a twisted tale :) Sure glad Vicky Cristina didn't follow that closely ...",
            "review_date": "2010-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic Truffaut film that shows why he's a master of filmmaking.  The storytelling, the imagery, and how Truffaut conveyed emotions through his characters are all brilliant.\n\nHowever, I will admit that the character of Catharine, and how the men in her life (most notably the title characters Jules and Jim) acted around her got really old by the end of the film.  For me, a movie is successful if I can somehow relate to the characters and can understand their emotions and actions to some degree.  Here, I couldn't understand why someone like Jules would stay in this situation or why none of the men acted angry or confrontational when the other men who have slept with their girl were around.  I know Europeans look at adultery and the like a tad differently (or at least that's how it's portrayed in most movies), but I wouldn't be able to just hang out with two guys who have been sleeping with my wife.  \n\nThose elements, along with the end of the film (which Jim should have seen coming seeing the gun being pulled on him in an earlier scene) are what make this film tarnished for me.  The first two thirds are great, but that last third grated on me.\n\nStill, it's a great film that's a must see.",
            "review_date": "2010-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's an off-beat romance that's definitely original, but I just didn't care about these characters at all. It wasn't that they were poorly developed, I just didn't approve of their lifestyle, and if I were the two men, I would have left Catherine way beforehand. I think Truffaut at this point was embracing the French New Wave a little too heartily, and he just wanted to make a romance that was dramatically different. While this is certainly admirable, it leads to a film that doesn't quite work. Luckily, when Truffaut indulges in style, he does it in a way that helps tell the story (unlike the stylistic tendencies of Godard). You can tell he's having fun with the material, and the music certainly backs him up on that. All in all, \"Jules and Jim\" does have moments of brilliance, but I was disappointed by the overall story. It's not particularly compelling. Still, \"Jules and Jim\" is worth a watch if you're looking for something original. I'm not sure I've ever seen a romance quite like this one.",
            "review_date": "2010-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed this film.",
            "review_date": "2010-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very interesting Truffaut film, it's one of those movies that you can watch again and again and discover something new, that's a rare quality in a movie. The movie focuses on three, essentially crazy people, Jim, Jules, & Cathrine, all whom are caught up in a love triangle that expands for nearly 25 years. Jim & Jules fall in love with Cathrine, Cathrine marries Jules, Cathrine then ends up with Jim, then back and forth, she cannot make up her mind. It's one of those ingenious plots that really captures you in the moment of it all. The film does tend to over stay it's welcome by the length, but it makes up for it's cinematic art work, great camera, flashy fast paced editing, and terrific direction by Francois Truffaut.",
            "review_date": "2010-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In certain ways this is a sprawling story about love in all its suits and disguises. The performances between the trio are natural and believable, and Jeanne Moreau is a beautiful, beguiling screen presence.",
            "review_date": "2010-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you aren't enchanted by this film, you're useless.",
            "review_date": "2010-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable love story.  Seemed a bit uneven at times but very watchable.",
            "review_date": "2010-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was really surprised all those men liked her for as long as they did, but I suppose the whole movie was symbolic not realistic.. Sometimes you just can't turn away from attraction even when all signs point to \"no.\"",
            "review_date": "2010-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jules and Jim find each other -- and subsequently a strong friendship -- in a small coffee shop in 1912 France. Jules (Oskar Werner) is an Austrian writer whose generosity and tendencies for the serene have kept women at an earnest length, while Jim (Henri Serre), also a writer, seems to attract attention with his eager confidence and stately French charm. The two men share curiosities for such things as literature, strange art, and eccentric living -- and when Jules finds Catherine (Jeanne Moreau), a whimsical (and rather rickety) girl who bares a strong resemblance to a beautiful stone sculpture both he and Jim admire, all of the friends' interests seem to radiate through her. As the relationship between Jules and Catherine grows, so does the friendship between Jim and Catherine -- she even tells them that she never knew happiness until she knew them. But as the years pass, her claim proves to have been either naive infatuation or coincidental irony, for she becomes miserable and irresolute with and about her desires, and her desolation spreads to Jules and Jim and eventually ends in calamity. \r\n\r\nFrancois Truffaut is known as one of the great directors of French New Wave -- a brand of French filmmaking that rejected classical cinematic methods and ideas in favor of more unorthodox, gallant ones -- but he was more a student and great architect of cinematic speak and relationships, and \"Jules and Jim\" is his finest example of each. Not only is it visually audacious, but also the sound of its words is as smooth and lovely as that of Shakespeare's (a common reference in the film), and discernibly more provocative and sensual than that of other great films spoken in Truffaut's native tongue (\"Breathless\", \"The Bay of Angels\", \"Day for Night\"). And the love triangle (easily film history's most elegiac menage a trios) that binds the three stars together is calculated and expertly crafted -- by both Truffaut and his actors. We care for (at least two of) these characters, and though the decisions they make may range from innocent to detestable, their happiness, confusion, and anguish are too palpable to brush away or simply ignore. And above all else, that's what makes \"Jules and Jim\" not only Truffaut's highest directorial achievement, but also one of the best films of the New Wave movement, and of the 1960s and all decades -- because of how effectively it captures the beauty of life in spite of life's dull and morbid times. It's a movie about love that has and should continue to be celebrated as an example of passion and possibility.",
            "review_date": "2010-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe one of the most (simultaneously) exhilarating yet devastating romances ever filmed.",
            "review_date": "2010-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good movie, a bit slow at times but the characters are really well written",
            "review_date": "2010-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A \"must watch\" film. :)",
            "review_date": "2010-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truffaut iconic Jules and Jim had many moments of clarity which were timeless and groundbreaking. It was one of the more interesting love stories I've seen.  But the film, much like Jeanne Moreau's character, seemed to be bipolar.  The characters at times were lovable, but you could never have enough to care what really happened to them.",
            "review_date": "2010-04-07",
            "source": "rt",
            "lang": "en"
        }
    ]
}