{
  "title": "A Wrinkle in Time",
  "rating": 2.9,
  "release_date": "2018-03-09",
  "summary": "After the disappearance of her scientist father, three peculiar beings send Meg, her brother, and her friend to space in order to find him.",
  "critic_reviews": [
    "Ava DuVernay’s beautiful and visually imaginative A Wrinkle In Time is a magical mystery tour for teenage girls. It’s a female empowerment movie that says love triumphs over evil and light trumps darkness. It says that the many teenage girls who believe they’re not good enough can find their strength and beauty, even through their flaws.",
    "By showing that self-worth and acceptance of one’s faults are to be valued, DuVernay has shown how empowerment can come from changing your own outlook, and perhaps adults as well as kids will be able to take something positive from this movie.",
    "Director Ava DuVernay emphasises an emotional clarity and narrative simplicity that allows the book’s sci-fi examination of friendship, family and forgiveness to resonate with almost mythic force.",
    "It’s refreshing to see a kids’ movie that’s content to remain just that, and doesn’t feel a need to douse itself in pop references or inside jokes. Find the right frequency, and you just might enjoy yourself.",
    "Even without every flaw completely ironed out, it offers values worth celebrating across the time-space continuum.",
    "This is Meg Murry’s movie, and while DuVernay’s visually stunning film may occasionally stumble, Reid does nothing less than soar.",
    "Its message is of a young woman’s empowerment, and of how love can save a family — and if the special effects sometimes overwhelm that message (such as a glorious field of flowers that takes flight in a colorful frenzy), it rings through loud and clear by the end.",
    "This Wrinkle in Time is undoubtedly flawed, wildly uneven and apt to tie itself in narrative knots in a quest to wow you with sheer Technicolor weirdness. It's also undeniably DuVernay's movie as much as Disney's, and works best when she puts her feminine energy, high-flying freak flag and sense of empathy front and center.",
    "I was transported by DuVernay’s adaptation to the mind-set of my girlhood — embarrassing insecurities and all. This is not a cynic’s film. It is, instead, unabashedly emotional.",
    "By turns gorgeous, propulsive and feverishly overwrought, A Wrinkle in Time is an otherworldly glitter explosion of a movie, the kind of picture that wears its heart on its tie-dyed sleeve.",
    "A Wrinkle in Time, faithful to the affirmative, democratic intelligence of the book, is also committed to serving its most loyal and susceptible audience. This is, unapologetically, a children’s movie, by turns gentle, thrilling and didactic, but missing the extra dimension of terror and wonder that would have transcended the genre.",
    "Awash in bold colors, bright patterns and ebullient kids, director Ava DuVernay’s new take on A Wrinkle in Time dazzles its way across time and space even if it doesn’t quite stick the landing.",
    "The opening act, I’m sorry to report, is a mess.",
    "Only Reid and Pine feel like they’re playing fully imagined characters, and DuVernay wrestles with how to make the overstuffed material both contemporary and timeless.",
    "A Wrinkle in Time is ambitious, hopeful, and imaginative, but it’s also messy, overwrought, and oddly paced.",
    "Although advertised as a family-friendly feature, A Wrinkle in Time is a poor choice for younger children. The glacial pacing of the first half-hour, coupled with less-than-easily-digestible chunks of exposition will cause many kids under 10 (and a few adults as well) to squirm in their seats with impatience.",
    "There's a lot here that feels insufficiently shaped or fitfully realized, but at the same time, there's a lot to like. It's the Platonic ideal of a mixed bag. The newness of the new parts counterbalances the ineffectiveness of the stuff that seemingly every fantasy blockbuster does, and that this one doesn't do well.",
    "So how’s the movie already? Not terrible, not great, something of a disappointment after what feels like a geological epoch of hype.",
    "It has flashes of inspiration and raw emotion, and beyond the famous faces in the cast, Disney’s Wrinkle in Time is graced with a wonderful, natural Meg courtesy of the young actress Storm Reid. Now 14, she’s easy and versatile screen company. The movie around her is a little frustrating and rhythmically stodgy, however, partly for reasons inherent in bringing tricky, elusive material to a different medium.",
    "Reid’s a fine lead, but DuVernay’s usually firm footing wobbles in the CGI clouds of Disney fantasy.",
    "The film’s messaging, heavy-handed as it can be, has some firework moments that might really spark the imagination.",
    "No Hollywood film can ever solve the central problem of adapting this book, in that it inevitably does too much of the imagining for you. DuVernay makes a big-hearted go of it, even if she seems slightly dazzled by her own magical mystery tour.",
    "This spectacular adventure sometimes wanders across the borders of invention into artificiality, but finds its feet when it focuses in on its characters and their relationships.",
    "For all of Wrinkle’s unevenness, DuVernay still manages to draw out some glimpses of more intimate beauty, the kind that one expects from the filmmaker.",
    "What follows is a phantasmagoria that is more cheesy than transporting.",
    "It almost doesn’t matter that the movie is too emotionally prescriptive to have any real power, or too high on imagination to leave any room for wonder; DuVernay evinces such faith in who she is and what she’s doing that “A Wrinkle in Time” remains true to itself even when everything on screen reads false.",
    "Trying to juggle complex theories of metaphysics and cosmology with simple themes of self-acceptance and the deterioration of the “darkness,” A Wrinkle in Time comes off as a disjointed and miscalculated project, rather than a visual and contemplative journey.",
    "This pretty movie feels convenient rather than meaningful.",
    "It’s hard to understand what went wrong — the cast couldn’t be more appealing, and the film is bursting with special effects. But as an emotionally satisfying experience, it’s a bust.",
    "Too often content to smile beatifically instead of delivering the necessary thrills.",
    "It’s also all over the map, in every way possible. It’s visually gorgeous at times but then boring to behold at others, emotionally poignant at times but stunningly cloying at others. It’s also confusing (though to be fair, many might call the book confusing, too.) Mostly, it’s just a frustrating whole comprised of some pretty promising parts.",
    "For as much as DuVernay’s film is a lovely and good-hearted movie that delivers lots of eye-popping, imaginative awe, its status as an adaptation necessarily raises the question: Was A Wrinkle in Time the right source material through which to tell this story?",
    "There are moments of real power and beauty in Ava DuVernay’s film, based on the much-loved Madeleine L’Engle novel. You just have to work too hard to find them.",
    "It’s conscientious. It’s watchable, and it’s never less than competent. But it seems to strive so hard to be inspirational, rather than letting the inspiration come through the story, that it becomes preachy and self-conscious.",
    "Movie magic is an elusive thing. A Wrinkle in Time is a bold film that takes big chances from start to finish, in a courageous effort to be something special.... But for all its scenes of characters flying and soaring and zooming here and there, it never really takes off.",
    "Despite its strong performances, notably from Reid, Pine, and Witherspoon, its wide collection of marvels and it’s joyful sense of self, A Wrinkle in Time crumbles under expectations. But it’s not so much a failure as it’s a flawed do-gooder that could make our world better. It doesn’t dazzle like the stars and it doesn’t transport us away, but it still offers hope.",
    "Director Ava DuVernay’s version of the beloved children’s classic has a big cast and the best of intentions. It’s socially progressive, racially diverse and packed with positive messages. It’s just not much fun.",
    "L'Engle's source material is a sneakily deep novel for youngsters, and Jennifer Lee and Jeff Stockwell's screenplay doesn't do nearly enough with those themes of death, loss and parents letting their children down. Instead, theirs is a patchwork adaptation with weak character development, a lack of narrative groove and a haphazard finish.",
    "A Wrinkle in Time hits that unfortunate un-sweet spot common to big-budget science-fiction/fantasy, where the spectacle feels more summarized than experienced.",
    "The film may involve the instant movement among unfathomable distances and the shattered limits of space and time, but it’s only Storm Reid's character who feels multidimensional.",
    "A Wrinkle in Time is wildly uneven, weirdly suspenseless, and tonally all over the place, relying on wall-to-wall music to supply the missing emotional connection and trowel over huge plot holes.",
    "Only the faintest glimmers of genuine, earned emotion pierce through the layers of intense calculation that encumber Ava DuVernay's A Wrinkle in Time.",
    "There are movies that fail because they are misguided, or because their heart isn’t in the right place. This movie wants to be special, which makes the fact it is such a lumpy, clumsy mess all the more frustrating. You root for this movie, and the movie tries to go a long way on that good will. It doesn’t make it far.",
    "It’s a pretty take on the story, but it’s also a frustratingly safe and squishy one. It’s infinitely well-intentioned, full of warm self-affirmation and positivity, and absolutely nothing about it feels emotionally authentic enough to drive those messages home.",
    "DuVernay finds herself in the unenviable position of being both the right and wrong person for an important job. A Wrinkle in Time is gratifying for what it is, a step forward for creative women of color, and so disappointing for what it turns out to be.",
    "A Wrinkle in Time, was strong enough to carry me through the film’s first, wobbly 15 minutes — but not a lot further.",
    "DuVernay can’t seem to settle on a consistent visual or narrative cadence. Her camera is all over the place, hurtling in for woozy close-ups and then rearing back to reveal what is meant to be vast splendor but is often just bland C.G.I. prettiness.",
    "It’s honestly a little baffling how so many good choices could produce something so frustrating.",
    "The film is tentative and over-protective, as though it’s terrified that a story empowering kids to help good battle evil could give someone a nightmare. It reduces the whole universe to one girl’s self-esteem.",
    "Which is a big build-up to essentially saying, “This movie’s a stiff.”",
    "If there’s a secret to a successful screen adaptation of A Wrinkle in Time, it’s still secret. Disney’s version of the Madeleine L’Engle young-adult novel is a magical mystery tour minus the magic and mystery, and a great disappointment, since there were so many reasons to root for the film’s success.",
    "If anything, the trouble with Wrinkle is that you never really get a sense of DuVernay’s personal touch. In fact, it feels a lot like Brad Bird’s big budget, equally smarmy 2015 Disney film, Tomorrowland. Both attempt to be so broad and universal that they feel disconnected from anything human."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "I'm a bit biased, having loved the book since I was in elementary school, as early as the third grade when my parents bought me my own copy because I loved the book.    It was my first \"novel\" so to speak, even if it was geared somewhatI'm a bit biased, having loved the book since I was in elementary school, as early as the third grade when my parents bought me my own copy because I loved the book.    It was my first \"novel\" so to speak, even if it was geared somewhat toward younger readers.    Not that Madeleine L'Engel didn't propose some silly ideas in her book  (defining the \"Mrs.'\" characters as former stars didn't make sense even when I first heard it, but it didn't take away from the overall imagery and storyline), but as usual Disney Studios have a way of sanitizing, omitting and ultimately ruining this adaptation a second time, after an even worse earlier version that was so bad I couldn't believe it.    We don't expect movie scripts unless they're bios or historical to follow to the letter the books they use for their movies, but this is ridiculous.    There is no mention of the Murry twins, Sandy and Dennys, who would be in a book of their own later.    Charles Wallace was not adopted, and Meg's father disappeared as a part of a military experiment with several other scientists, and they were not part of NASA.    Further details include the \"Mrs.\" Whatsit, Who, and Which as young, and Whatsit a young first time whatever she is, which is the opposite of her book personality, very very old, as are the others.    In fact, in the book, while Mrs. Which is the strongest of the three, she barely if ever materializes completely, and then in a typical witch form.    But Disney really blows it as their version of Meg and Charles Wallace are so far from the book characters it's maddening.    Meg was angry - smart, and much more impetuous in the book, and Charles Wallace was more vulnerable, and likable.    The boy playing him does okay, but comes off as a young smartass most of the time.    The worst thing they did was screw around with Camazotz, a planet controlled by an evil entity called It.    It didn't suddenly change backgrounds like the movie claims.    The cul-de-sac with the automaton children did not convey the sinister behavior of It controlling their every breath and movement, along with the rest of the city where the kids had to go to find Meg and Charles Wallace's father.    The book had a far more sinister feel - all identical buildings that didn't fold up, then to apartment style buildings as they neared the city center, and finally the skycrapers, all identical, except for the monolithic CENTRAL Central Intelligence building, higher than any building on Earth and just as wide and deep.    Here is where the Man With The Red Eyes encountered them, not on a beach with a stupid Wizard of Oz reject who takes them to a single room instead of the great building.    Believe me - the millions of us who loved the book I'm positive thought these plot aberrations were silly and distracted from the menace of the story.    Your kids might think it's okay, but I hate this movie.    It fails every which way to convey the dangers of the book, removes the cold sinister feel of Camazotz, and falls woefully short of doing the classic book justice.    Maybe if some film company besides that lukewarm Disney could give it a go, but I doubt anybody will.    Not even Chris Pine or Reese Witherspoon can save this dog.",
      "review_date": "2018-03-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What a crap movie. Don't waste your money. Take your kids to peter rabbit insted.",
      "review_date": "2018-03-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Major disappointment.....No magic....Great trailer terrible movie. Director Ava DuVernay does not deliver.",
      "review_date": "2018-03-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nOverall not a great movie. Lacks the basics needed for story telling. No character has any development. The characters never actually solve a problem. The villain had no motivation or purpose. And the solution was the power of love, which is just lazy story telling. The tone was consistent with that of a soap opera. Scenes that were trying to be magical were just dull.At one point of the main characters becomes a flying lettuce. This scene took up about ten minutes but didn't lead to anything. Nor did it come up again. It was pure fluff.At no point did any main character solve a problem.  A lot was grown at them but they were basically completely passive in a solution. The villain also did not have clear motivations as to why it wanted to kidnap the main character. But it was defeated by love.There were no subtlety in any narrative or character. If a character had an insecurity you were directly told. If they overcame this you were not shown this but instead directly told this. It's just bad story telling.",
      "review_date": "2018-03-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The fact that Disney put this out is insulting.  If you like horribly written movies with lame, annoying characters, and terrible special effects, this movie will be heaven for you!",
      "review_date": "2018-08-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is one of the tope 10 worst movies I have ever seen in my entire life.",
      "review_date": "2018-04-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A complete disappointment in every sense of the word. A story with a huge potential, it becomes something tedious, confusing and somewhat boring. There is no continuous flow in history and only special effects are the only thing that can beA complete disappointment in every sense of the word. A story with a huge potential, it becomes something tedious, confusing and somewhat boring. There is no continuous flow in history and only special effects are the only thing that can be rescued from this film so deficient.",
      "review_date": "2018-04-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There aré bad films that get to laugh, but this films doesn't get that, it is horrible and i feel that Disney should give baca my money.",
      "review_date": "2018-06-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Honestly I feel bad for Ava DuVernay. This film had to have been a turning point for her career, a defining moment for an African-American female director leading a huge 100 million dollars production but the result is perhaps the first greatHonestly I feel bad for Ava DuVernay. This film had to have been a turning point for her career, a defining moment for an African-American female director leading a huge 100 million dollars production but the result is perhaps the first great disappointment of mainstream cinema in this 2018.Frankly I don't think it's the disaster that many people have said it is, but it's a film that lacks of direction. Visually is beautiful but it has a formation and rhythm that affects the development of the whole film and the truth is that it ends up consumed by its own ambition. Ambition that was unable to exploit with the best quality.Considering that Disney is drowing audicences with sequels and franchise development, is remarkable they tried this but the end result was sadly disappointing.",
      "review_date": "2018-04-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A poorly conceived movie,from the director of Selma and the writer behind Zootopia,this movie was a monumentally disaster.It had good things in it:great visuals and some good performances.But apart from those things,this movie was basicallyA poorly conceived movie,from the director of Selma and the writer behind Zootopia,this movie was a monumentally disaster.It had good things in it:great visuals and some good performances.But apart from those things,this movie was basically unwatchable,very incoherent.One of the worst films of 2018",
      "review_date": "2018-04-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie is stilted, stiff, and uncomfortable. Why can't a good movie version of this amazing story be made?",
      "review_date": "2018-06-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I see so many people champion this movie as important because of what it represents as a step forward for representation, with Ava DuVernay being the first black female director to direct a film over $100 million, and being a high conceptI see so many people champion this movie as important because of what it represents as a step forward for representation, with Ava DuVernay being the first black female director to direct a film over $100 million, and being a high concept fantasy film with young black female lead. Which I can respect. But here's the thing...it is true that black girls deserve a film like this. But they also deserve better! They do not deserve a poorly acted, poorly written, safe, pandering, no stakes film that is only made to make a franchise that this pap is! Like this is really bad and the fact people are seriously giving this film a pass for **** identity politics makes me sick! That's not moving forward, that's blatant tokenism and I will not stand for it!The acting is all around awful! And I do not mean from the child acting, which yes they are terrible! Storm Reid is wooden, Pan survivor Levi Miller is awkward, and Deric McCabe honestly feels like he came from a Disney sitcom (he wasn't, but still my point stands). But honestly I think they might be better than the adult acting, which outside from Chris Pine (who is too good for this movie) and Reese Witherspoon, is just embarrassing. Oprah is underacting, which is surprising from a force of personality like her, Mindy Kaling is miscast and flat as hell, Zack Galifianakis is not even trying, Michael Pina is only in this film for like 5 minutes and even then he's just awkward, and Gugu Mbatha-Raw outside of one scene is just terrible.I cannot believe Ava DuVernay directed this, and I mean I legit refuse to believe she did because this feels like a half assed studio directed job. Some of the shots are decent, but she was the wrong choice for this. The movie needs to have a surrealist touch like Terry Gilliam or Alejandro Jodorowsky, not someone who is known for making grounded, serious dramas like Selma and Middle of Nowhere. There are a few shots where she is close to that, but overall this film feels lazy from a directorial standpoint. And speaking of lazy, holy **** the green screen compositing is dreadful! Like some of the worst from a major motion picture that I have ever seen all year! The worlds the characters go to look great, but it is so clear that they are on a green screen set and not in these beautiful planets. This cost over $100 million and it is flushed down the drain!But I do not blame DuVernay for this. I blame it squarely at Disney! This is the second the titular book was adapted from the company, the first being a terrible made-for-TV adaptation from the early 2000s, and it is clear that they are going for yet another high concept adventure film like John Carter, the Lone Ranger, and Tomorrowland, desperate for another Pirates franchise. They should stop because they all are box office disasters! I remember reading the book but barely remembering a large portion of it, but what I do remember is one scene where the main girl sees the life of her love interest (who A, just pops in and have no real reason to be there other than he just tagged along, and B, they have no chemistry what-so-ever) and she sees that his mother abuses him and his siblings, which was a huge moment because this perfect guy has his walls broken down and seeing what he considers a flaw. That never happens in this movie. They completely brushed it aside because that might be too much for families and it will hurt their FEE FEES. What I am getting at is that there is no sense of danger in this film. Even if the visual effect integration was amazing, I would never feel that there was a sense of tension with anyone. They always end up just fine in the end. Like there has to be any sense of grit or an element of stake in a movie to has the audience care, but if nothing bad ever happens to them besides forced conflicts in the third act, then why should I bother caring. Like I said before I don't blame DuVernay for this because more than likely this was micromanaged to **** by Disney to make the safest, cleanest, non-threatening film they could. It's the equivalent of dangling keys in front of the audience, along with poorly integrated pop songs (all originals and all awful) or a cheap and bland movie score.I remember hearing that the author of the book wanted to make a book that was about exploring complex themes of physics to young readers so that they can understand, but that barely gets addressed, or whenever it does the dialogue is so poorly written that they just flat out spell it out to the audience. The writing in general is dreadful, watering down any element of the book to cringe-worthy lines about love and weird gibberish that Oprah mumbles out of her monotone mouth.Like how the hell can you make a big budget blockbuster worse than the lame made-for-TV film made over a decade ago? Clearly Disney found a way with their toothless, virtue signal of a film!",
      "review_date": "2018-10-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There were some interesting messages that were positive. The \"MRS\" costumes were beautiful.The biggest challenge was that there was no engagement with the actor specifically Meg. She was dull and boring. I didnt really \"care\" about her. ReeseThere were some interesting messages that were positive. The \"MRS\" costumes were beautiful.The biggest challenge was that there was no engagement with the actor specifically Meg. She was dull and boring. I didnt really \"care\" about her. Reese Witherspoon's role as Mrs Whatsit wasn't up to her usual standard of work. The special effects were interesting but they never felt \"real\" - like say Jurassic Park seemed believable. You were aware of the special effects and were tempted to figure how how they did that. Don't pay to go see this at the theatre. Wait until you can watch it in the comfort of your own home.",
      "review_date": "2018-03-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nNice try but what the???? The trailer made this movie look amazing. so i had to see it. The movie is nothing like the trailer. Instead it is a mind-numbing, pointless mess. All it relied on was CG effects, nothing more. The only reason I watched the whole thing was because I wanted to see how the kids find their father by just walking through the entire universe. Supposedly he had been missing for 4 years and was found crouched down in some tunnel. How long was he there for? Well, he looked pretty healthy and sane and clean for someone lost in the bad part of the universe with absolutely none of his basic needs met, like food or water. I liked the character of Meg and the girl who played her did a great job considering the terrible script. But that was the only character. The rest were absolutely ridiculous. Why keep casting the same faces over and over and over and over again? None of the dialogue or silly quotes made sense. As for Calvin, that was just total cringe. This \"gorgeous guy\" just happens to come along for this bizarre ride, just for the sake of trying to turn this movie into a romance somehow? Stop leaving out substance and realism and replacing it with corny romantic possibilities Disney! This movie needed to expand on the key concepts but it kept getting side tracked by \"stunning\" visuals.",
      "review_date": "2018-06-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Awful in all ways it could be. No Magic. No story. No good characters. I just can't believe it's from Disney.",
      "review_date": "2018-07-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What a boring non whimsical movie that should have never existed.Do not waste your money and your time on this movie",
      "review_date": "2018-11-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A Wrinkle in Time - 2/10  This is an ugly movie with poor acting. There is not a single thing going for it unless you watch it ironically for its comedic value, then it's alright.  However, I recommend you just watch some other comedyA Wrinkle in Time - 2/10  This is an ugly movie with poor acting. There is not a single thing going for it unless you watch it ironically for its comedic value, then it's alright.  However, I recommend you just watch some other comedy instead. The CG was horrible to look at and was overall very distracting, on top of this, many things didn't make sense logistically and plot-wise. The movie couldn't make up its mind about what it wanted to be, is it a dumb kids film (yes, but not in an intended way) is it an action flick, is it a comedy, is it a drama, or what is it. It turns out its none of these things, in fact, it is not much of anything. This movie is utterly incapable in every department, it fails to not only to capture the nature of the source material but also fails at being a comprehensive piece of film. Please avoid this one, the plot is nonsense, the characters are generic and cliche. Overall the movie is just an ineffective leech that has no purpose, is self-redundant, and involves no apparent genuine talent.",
      "review_date": "2018-09-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A pointless, bland movie that was not entirely forgettable only because how poorly it was made, and how much money it clearly wasted. Our entire family (inc 8 and 14 yo) just couldn’t believe how bad it was. Quite possibly the worst DisneyA pointless, bland movie that was not entirely forgettable only because how poorly it was made, and how much money it clearly wasted. Our entire family (inc 8 and 14 yo) just couldn’t believe how bad it was. Quite possibly the worst Disney movie we have seen (in modern times). Just didn’t understand or care what was happening... it may be the source material, but then someone should have been putting a stop to this movie early on in its development. So much wasted opportunity. No redeeming qualities. Such a shame.",
      "review_date": "2021-03-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Oh boy, what you'd expect from a Disney movie; a lot of visual candy, perfect looking teens, an all American message, but also unfortunately trying so hard to be an epic film without a lot of substance. I think the smallest saving grace isOh boy, what you'd expect from a Disney movie; a lot of visual candy, perfect looking teens, an all American message, but also unfortunately trying so hard to be an epic film without a lot of substance. I think the smallest saving grace is the message to love yourself, as your faults make you who you are.",
      "review_date": "2018-12-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Poorly DoneThough the visuals are top notch and pretty good casting, This adaptation of A Wrinkle In Time is a huge disappointment with a fatally flawed script and bland characters.",
      "review_date": "2019-12-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The first act provided us with a very thin and clichéd background of the story and the characters, but the worst thing about the first act in general is that the directing and the camera work in it is so bad; weird camera angles, crankyThe first act provided us with a very thin and clichéd background of the story and the characters, but the worst thing about the first act in general is that the directing and the camera work in it is so bad; weird camera angles, cranky camera movements. That's often noticed in scenes which feature conversations between characters. I felt if I was watching documentary or something, and that made me so confused and I really felt uneasy. There are tons of plot holes and unexplained things from the get-go to the end of the movie. But most of the nonsensical things happened to be related to the character of Charles Wallace. Charles Wallace is a very bizarre character. This character and everything related to it don't make any sense ,alas, Charles Wallace is really a big deal in the story and its messy plot. To add insult to injury, the child who played this character, Deric McCabe, is a very bad actor; for a big part of the movie he was trying to act like a cool sweet young kid, but he is not, then we see him overacting. I wonder if this character, Charles Wallace, is also poorly written in the novel? Mrs. Which, Whatsit, and Who characters have many cringe-worthy moments, and I blame no one but the director, Ava DuVernay, and maybe also Mindy Kaling (Mr. Who) who I should blame; what an annoying character and infuriating performance from Mindy Kaling!I don't have so much to say about Zach Galifianakis or Peña's performances, but I didn't neither like their characters.I think Storm Reid who played Meg, the protagonist, did a really god job. But the only performance that I can really praise is Chris Pine as Meg's father; he is great and due to his performance, the dramatic and the emotional value, which I didn't get, became slightly better. There are very few scenes where the CGI was okay, but, in general, it's weak and cartoonish, and that's due to the bad green screen that is glaringly obvious.I liked the comprehensive concept of the evil as an antagonist, but what we got from it in the third act was disgraceful! I really suffered while watching this act with all its dull and illogical twists.I'm very disappointed! I haven't watched many movies that have been released this year, but this is definitely the worst one of them so far.From now on I'll call this movie A Wrinkle in Logic!(4/10)",
      "review_date": "2018-06-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I found this movie just weird.  The plot is bizarre and not really that enjoyable.  I've never read the book and this movie doesnt make me want to at all.",
      "review_date": "2018-10-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Chris pines streak of terrible movies . It's a adaptation that spoils any of the books labored lore into a dull cameo fest .",
      "review_date": "2022-07-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Who casted the kid Charles Wallace? TERRIBLE is a compliment to this young actors sub par performance. Even our kids commented on the un-acting of Charles Wallace. So much potential all ruined by a single poor casting choice.",
      "review_date": "2019-01-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "couldn't even finish it. Everything is bad here. The acting, the special effects, the story, everything. Boring mess.",
      "review_date": "2019-06-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What am I even supposed to say about this? Yes it's bad, yes it's confusing...but that's it. This film is just...empty. I will say that I liked the Chloe X Halle song, some of the trippy visuals, and the sci-fi feel and plot, but I have toWhat am I even supposed to say about this? Yes it's bad, yes it's confusing...but that's it. This film is just...empty. I will say that I liked the Chloe X Halle song, some of the trippy visuals, and the sci-fi feel and plot, but I have to imagine I could find things like those outside of the movie. I can't say I hate it cause deep down I know I kinda unironically like it...maybe just because no one else does and I like the concept. But in reality this is an empty shell masquerading as a movie. And a bad movie at that.",
      "review_date": "2020-08-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wow, never watched something so boring. The book was always overrated and the acting just sucks. I couldn't stand watching this, sorry for anyone that was excited and the let down by this piece of ****",
      "review_date": "2021-03-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A movie needs more than \"diversity\" to carry it at the box office. People are not going to movies out of virtue. The movie either delivers the entertainment goods (which could be totally serious, not necessarily comic, of course), or itA movie needs more than \"diversity\" to carry it at the box office. People are not going to movies out of virtue. The movie either delivers the entertainment goods (which could be totally serious, not necessarily comic, of course), or it doesn't. Compare Wrinkle with a really good fantasy movie by a director who knows what he's doing like The Shape of Water, and you instantly see the limitations of DuVernay's talent. One doubts that she'll ever get $100 million to play with again.",
      "review_date": "2018-03-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There is no excuse for a movie with a $100 million budget to be this bad.  It was really disappointing. The pacing is terrible.  The actors are terrible.  The script is terrible.  The only upside, IMO, was the hair/makeup/costumes, which wereThere is no excuse for a movie with a $100 million budget to be this bad.  It was really disappointing. The pacing is terrible.  The actors are terrible.  The script is terrible.  The only upside, IMO, was the hair/makeup/costumes, which were beautiful.  Even that was kind of annoying, because it was obvious that all time, energy and money was put into that aspect and almost no attention was given to character development.  The script is embarrassingly bad.  I can't remember any other movie that I seriously considered walking out of.  I drug my 14 yr old son to see this movie because I really enjoyed reading the book when I was younger.  I apologized to him multiple times throughout the movie, but at least we were able to laugh our way through it.  Please, don't waste your money on this one.",
      "review_date": "2018-03-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you want to see a movie completely gutted from the book author's original Christian themes, but want to instead see something remade to fit the new age mindset of the director, then this movie's for you.  If you're not interested in seeingIf you want to see a movie completely gutted from the book author's original Christian themes, but want to instead see something remade to fit the new age mindset of the director, then this movie's for you.  If you're not interested in seeing new age drivel then buy the book instead.",
      "review_date": "2018-04-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I found the movie to be slow (I dozed off a couple times) and more-than-unusually unbelievable (just hand-waving explanation of why / how the heroine surmounted the evil forces)",
      "review_date": "2018-03-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A mangled, saccharine, dumbed-down adaptation of the classic children's novel.  The plot will likely be incomprehensible to anyone who hasn't read the book, the acting is so-so (*this* Charles Wallace is a child prodigy?  *This* Meg is aA mangled, saccharine, dumbed-down adaptation of the classic children's novel.  The plot will likely be incomprehensible to anyone who hasn't read the book, the acting is so-so (*this* Charles Wallace is a child prodigy?  *This* Meg is a geeky, unpopular misfit?), and the shoehorning of girl-empowerment affirmations into everything gets hamhanded and annoying.  Madeleine L'Engle's books are rightly classics but, as this movie demonstrates, may be essentially unfilmable.",
      "review_date": "2018-03-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I left the theater just wanting the time back I spent watching this poorly directed and sadly cast piece of nothing. It could have been so much more but ended up just being a complete waste of time.",
      "review_date": "2018-03-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "0/10, Did not like, walked out of movie. Main characters annoying, we saw Peter Rabbit and Paddington 2, so much more entertaining..",
      "review_date": "2018-03-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In this baffling narrative feature follow-up to her 2014 hit \"Selma,\" director Ava DuVernay trades socially resonant thematics and solid performances for what's basically a couple hours of infuriating logic vomit. Both movies do have Oprah inIn this baffling narrative feature follow-up to her 2014 hit \"Selma,\" director Ava DuVernay trades socially resonant thematics and solid performances for what's basically a couple hours of infuriating logic vomit. Both movies do have Oprah in them, though, that's for sure. It's  honestly been a long time since I've seen such an immeasurably dumb, narratively tone-deaf movie backed by a studio with such confidence. There's such an impossibly small amount of sense in this story that it's actually hard for me to believe some sort of snafu didn't happen between the Disney executives and the creative minds at hand. This might just be 2018's living embodiment of \"biting off more than one can chew.\" So many ideas, yet no consistency or care to explain any of it. Yeesh.",
      "review_date": "2018-03-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A Wrinkle in Time is easily the most disappointing movie I have seen thus far in 2018, and also the worst Disney film I have seen in a while. I have not read the book \"A Wrinkle in Time\" but the person I saw this movie with did, and theyA Wrinkle in Time is easily the most disappointing movie I have seen thus far in 2018, and also the worst Disney film I have seen in a while. I have not read the book \"A Wrinkle in Time\" but the person I saw this movie with did, and they disliked it even more than I did.This film has a lot of problems. The biggest problem is that the script makes no sense. Nothing is explained, the plot jumps around everywhere, and the word \"universe\" is said probably 80 times in the first hour. There's a cheesy \"be yourself and believe in yourself\" message that feels tacked on, and not truly genuine. Character motivations aren't really discussed outside of Meg's, and the pacing is diabolically bad.The direction is not much better. Some of the visuals actually look really bad. My two favorite shots of the film were Meg's room at the beginning, and the reunion between Meg and her father. Unfortunately this is not Ava Duvernay's best work at all.The acting is all over the place. Charles Wallace and Meg are fine, but Calvin is the most wooden actor I have ever seen. The talents of Oprah Winfrey, Chris Pine, Reese Witherspoon, Mindy Kaling, and Zach Galifianakis are completely wasted. Chris Pine also does this weird face through the whole movie? You'll see what I mean.I knew this was going to be bad when the theater showed a trailer for \"A Wrinkle in Time\" before the movie itself started playing. Skip this one. There are better kids movies to see.",
      "review_date": "2018-03-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nHere are some of the things I learned about while reading the novel \"A Wrinkle in Time\":1. The evils of totalitarianism2. The transcendence of the soul3. The connectedness of all things4. The seductive danger of vanity and pride5. The redemptive power of loveHere are some of the things I learned while watching an apparently unrelated movie of the same title:1. Fairy godmothers have a funky fashion sense and quote everyone from Rumi to Outkast, but never the Bible.2. Riding a giant piece of lettuce enables the human body to achieve aerodynamic lift.3. When yoga therapy with a cave-dwelling guru doesn't lead to the answers you're seeking, sheer desperation will light the way.4. When your desperation leads you into the path of a tornado spawned from the Matrix, outwit it with your superior knowledge of aerodynamics and the pattern recognition skills you no doubt honed while playing endless hours of Cuphead. Trust me, it's science.5. Trust no one EXCEPT carnival barkers at Coney Island.6. Never take hoagies from a carnival barker while interacting with the holodeck.7. Saying your times tables activates your latent mutant powers.8. Even as a child, Magneto was a savage.9. If two of your children are in mortal danger, save your favorite and ditch the mouthy one. That's why you had two.10. I can be obligated to leave a movie 15 minutes before the end and feel not even a little bit of regret.",
      "review_date": "2018-03-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "horrible movie, lost interest in the movie after about 10 mins, 20 minutes later got a headache...nothing is good in the movie, direction, screenplay, acting, dialogues....nothing.",
      "review_date": "2018-03-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not being familiar with the book, I had no idea what to expect. Having seen the trailer (too many times), I assumed Oprah Winfrey, Reese Witherspoon and Mindy Kaling would be the guiding forces. However, the 3 stars bow out about half wayNot being familiar with the book, I had no idea what to expect. Having seen the trailer (too many times), I assumed Oprah Winfrey, Reese Witherspoon and Mindy Kaling would be the guiding forces. However, the 3 stars bow out about half way thru and leave the quest to the young people. A girl, her brother and their friend set out across the universe to find her scientist father. There are expected otherwordly visuals. Although they're sometimes pretty, none of them is especially dazzling or groundbreaking. More of a disappointment is the leaden pace, dreary earnestness and never-ending messages of self worth and empowerment.  A spectacular disappointment.",
      "review_date": "2018-03-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Happily went to see with my child since he had recently read the book, but this movie is just so terrible.  Seems to been made more for the egos of certain people in the film.  With one character having to be 2-3x bigger than the others, theHappily went to see with my child since he had recently read the book, but this movie is just so terrible.  Seems to been made more for the egos of certain people in the film.  With one character having to be 2-3x bigger than the others, the film is about them not the book.  Ridiculous film.",
      "review_date": "2018-03-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The road to mediocre movies is paved with good intentions. Ava DuVernay is a master publicist and one of Hollywood’s reigning social media mavens, so it’s not surprising that her take on “A Wrinkle in Time” plays like a live-action adaptationThe road to mediocre movies is paved with good intentions. Ava DuVernay is a master publicist and one of Hollywood’s reigning social media mavens, so it’s not surprising that her take on “A Wrinkle in Time” plays like a live-action adaptation of your cool aunt’s Instagram account. It’s an intermittent and repetitive scroll through a series of photoshopped images, overly-obvious inspirational quotes, celebrity fashion spreads, new-agey pseudo-science, self-help clichés, “please like me” generalities, and smarmy \"haters gonna hate\" defensive posturing. Just when you’re annoyed or bored enough to unfollow, you get sucked back in with some surprisingly cool content, like a moment of pure artistry, a genuinely inspiring Oprah-branded “Aha!” moment, or a dreamy new Sade song. The movie does an adequate job of dutifully hitting the main plot points of the novel, but it’s treatment of the story’s complex themes is only skin deep. Tellingly, the three Mrs. W’s have been translated here into a trio of intergalactic glamour-pusses, characterized primarily by their outward appearance, costume changes, and connection to pop culture. Such materialism is perhaps necessary when translating a largely abstract novel to the screen, but when overdone, as is the case here, it becomes distracting rather than illuminating. I’d recommend this movie for DuVernay or Disney diehards and tweens in desperate need of a crash course in standard self-esteem and lowest-common-denominator courage. For everyone else, skip the movie and read the book. Your own imagination will surely create something better. (And you can always go ahead and download that new Sade song.)",
      "review_date": "2018-03-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Just overall a bad movie even for a kids movie. The plot just kind of jumps around and really doesnt provide a reason for anything. The ending is even worse with just ok its all fixed now moment. Really bad writing, acting and story....",
      "review_date": "2018-03-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was gay. Like off the scale gay. Hard to imagine kids would even find this interesting. Nice visuals, but its so cringy! Read the book instead.",
      "review_date": "2018-06-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Full of plot holes, awful computer graphics and shoved political correctness down your throat. It made no sense.",
      "review_date": "2018-04-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A Wrinkle In Time is at times visually stuning, and at times very cringy. The performance by the supporting cast feels like they could have casted anyone else and it wouldn't have made a difference. Storm Reid is by far the best of the movie,A Wrinkle In Time is at times visually stuning, and at times very cringy. The performance by the supporting cast feels like they could have casted anyone else and it wouldn't have made a difference. Storm Reid is by far the best of the movie, and her story is the most compelling. However, it isn't enough to save this trainwreck of a movie. Very dissapointed.",
      "review_date": "2018-04-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A blind man would be glad to see.Great expectations for a crappy movie. Bad actor play, no action, boring, couldn't wait for the end, almost fell asleep.I'm sorry I wasted my time and money.",
      "review_date": "2018-03-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Dissapointing. \"A Wrinkle in Time\" suffers from a lot of flaws. To be honest, I'm surprised the script got passed by the producers. It's weird but the exhibition in this film is either too much or not enough, so I was at either \"I get it,Dissapointing. \"A Wrinkle in Time\" suffers from a lot of flaws. To be honest, I'm surprised the script got passed by the producers. It's weird but the exhibition in this film is either too much or not enough, so I was at either \"I get it, move on!\" or \"Wait, what!? Explain!.\" The dialogue among the humans just doesn't sound like how regular human beings speak. It doesn't help that the kids who play the three main characters aren't good actors. The two boys in particular are wanting. Between the acting and the dialogue, the love interest kid is a wedged-in, purposeless dummy, and the super-intelligent younger brother is obnoxiously precocious and a bit hard to understand sometimes.The film does have some strong parts. All the big name actors who play the alien beings did a great job. In fact, this was probably my favorite performance by Reece Witherspoon as a weird, unintentionally rude alien. Visually, the effects, the costumes, and sets are all a joy to watch. Lot of creativity there.In fact, I liked the second act. The focus on the aliens and other planets are when things got good. Unfortunately, the third act focuses on the human characters again and falls into the mistakes of the drawn-out first act.Kids may enjoy the visuals here, but If you're a parent be prepared to be bored for part of this.",
      "review_date": "2018-03-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Pretty average through out.  14 year old daughter would have probably given it a 5.  I thought it had a decent message but my daughter and her friend were confused at points.",
      "review_date": "2018-03-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Since i saw the tráiler i knew this was going to be another Tomorrowland but god this is worst,they should worry more about the story and less on the promotion and visual effects its so borring i didnt care for the caracters at all, thisSince i saw the tráiler i knew this was going to be another Tomorrowland but god this is worst,they should worry more about the story and less on the promotion and visual effects its so borring i didnt care for the caracters at all, this disney movies are becoming a waste of time.",
      "review_date": "2018-03-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Who do I talk to about a refund? Seriously, someone needs to compensate me for my loss of time watching this. Who is making the financial decisions at Disney? Are they perpetually drunk or just high?",
      "review_date": "2018-05-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is so awful that I don't even want to see it what I heard of this is the story is full of holes and confuses more than entertains also if you want a black movie just watch black panther instead at least you won't be wondering uponThis movie is so awful that I don't even want to see it what I heard of this is the story is full of holes and confuses more than entertains also if you want a black movie just watch black panther instead at least you won't be wondering upon your poor life choices of watching a confusion in time",
      "review_date": "2018-05-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is one of the worst movies I have seen in years and an insult to the source material. The film has gutted the themes of the book and replaced them with empty platitudes and terrible production design and costuming. Do not waste your timeThis is one of the worst movies I have seen in years and an insult to the source material. The film has gutted the themes of the book and replaced them with empty platitudes and terrible production design and costuming. Do not waste your time or money on this, instead go read Madeleine L'Engle's book.",
      "review_date": "2018-03-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A Total Trainwreck. A Total misstep from talented director Ava DuVernay who had solid films. My Advice to Disney is not to milk all their properties into Live-Action and Walt Disney's works.",
      "review_date": "2018-03-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It is amazing that a film with a top rated director, Ava DuVernay, a smart cast led by Reese Witherspoon, Oprah Winfrey, Mindy Kaling, the beautiful Gugu Mbatha-Raw, a seasoned 14-year-old television and movie actress Storm Reid, a too goodIt is amazing that a film with a top rated director, Ava DuVernay, a smart cast led by Reese Witherspoon, Oprah Winfrey, Mindy Kaling, the beautiful Gugu Mbatha-Raw, a seasoned 14-year-old television and movie actress Storm Reid, a too good looking for his own good 15-year-old Levi Miller plus handsome in his own right Chris Pine, along with 11 year old Deric McCabe handling a difficult role making it look easy, among others, can make such a boring movie!It starts off with exciting special effects, startling, glittery makeup and costumes for Witherspoon, Winfrey and Kaling, a screenplay by Jennifer Lee revolving around a father missing 4 years being transported to another universe that combines expectations of a really involving, emotionally breathtaking film that quickly becomes a one too many makeup and costume change, way too many special effects and a story that just doesn't move you. 'A Wrinkle In Time\" doesn't quite make it for adults and at some points will be too intense for the young ones while teenagers may laugh at things said and done that are already old hat to them.Though it is early in the year \"A Wrinkle In Time\" will be in the top 5, at least, of the most boring films of the year.",
      "review_date": "2018-03-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I did not love or hate the movie adaptation of “A Wrinkle in Time”.   I read the book prior to seeing the movie, and personally I didn’t really care for either iteration of the story.  Both book and movie, felt as if they were made up ofI did not love or hate the movie adaptation of “A Wrinkle in Time”.   I read the book prior to seeing the movie, and personally I didn’t really care for either iteration of the story.  Both book and movie, felt as if they were made up of multiple scenes crammed together, then a single flowing story. The movie adaptation did clean some things up I didn’t like in the book by added more depth to create more believable character motivations.  The one big  saving grace for this movie was it had some very impressive visuals throughout the second half of the film.    Overall the story just felt empty to me. I never really felt attached to any of the characters and quite frankly I didn’t like the little boy who played (Charles Wallace). It’s a passable movie in theaters, but not a bad kids movie to watch on TV with the family.",
      "review_date": "2018-03-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I actually really like things that challenge me. This does not challenge me. This film is utterly mindless and incoherent virtue signaling drivel. You know, to create something so fiercely and blatantly tokenistic, one has to accept thatI actually really like things that challenge me. This does not challenge me. This film is utterly mindless and incoherent virtue signaling drivel. You know, to create something so fiercely and blatantly tokenistic, one has to accept that there is some truth to stereotypes to begin with, and I am not a big enough cretin to do that. Director DuVernay can shriek, 'Patriarchy!', until she's blue in the face, it will not make this a good movie in anything resembling objective terms. Once again Disney should be ashamed of themselves for this arrogant insult to our collective intelligence, but as usual is likely just laughing all the way to the bank. Don't bother with this one. If you loved the book series, double don't bother. If you would like to see Oprah Winfrey in a truly awesome role, see 'The Immortal Life of Henrietta Lacks' instead.",
      "review_date": "2018-03-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was literally the worst piece of over-the-top garbage i've ever seen in my life.Any critic who gave this even a marginally decent review, needs to quit. Critics and movie studios are nowadays like politicians and big business.",
      "review_date": "2018-03-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Oh dear what happened, I thought Ava Duvenay was going to be the next messiah after her mediocre Selma was decried as one of the greatest film ever made. Turns out, shes a complete hack with little talent to even make a decent film given allOh dear what happened, I thought Ava Duvenay was going to be the next messiah after her mediocre Selma was decried as one of the greatest film ever made. Turns out, shes a complete hack with little talent to even make a decent film given all the resources she had for this film. A wrinkle in time is non-sensical, boring, has stale characters and is ultimately downright assault on the senses. Its so poorly paced that even a 6 year old could have told a better story in their sleep. This proves that hiring people on their race and gender alone is a sure misfire and thank the heavens she won't be getting a chance to ruin any more franchises down the line.If you want to see mediocrity on the screen, then Ava's wrinkle in fraud will be a great time for you. She needs to go back to doing her small revisionist history, something I'm sure she will be crawling back to after this disaster.",
      "review_date": "2018-03-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was so disappointing with this guys...this movie and its director were so hyped and we got this boring movie...how was this green-lighted guys.. few movies bored to the point that I simply want to walk out of the movie Theater...and thisI was so disappointing with this guys...this movie and its director were so hyped and we got this boring movie...how was this green-lighted guys.. few movies bored to the point that I simply want to walk out of the movie Theater...and this movie had me tempted",
      "review_date": "2018-03-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Severely under the usual standards of Disney. After the first 30 minutes my son became so bored, he wanted to leave... so we left.",
      "review_date": "2018-04-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It was largely disappointing. The visuals are fantastic and the message clearly rings throughout the movie but it couldn't save the mess of a script. I have not read the books but watching the movie doesn't even make me want to read it. ReeseIt was largely disappointing. The visuals are fantastic and the message clearly rings throughout the movie but it couldn't save the mess of a script. I have not read the books but watching the movie doesn't even make me want to read it. Reese Witherspoon, Mindy Kaling and Oprah was fantastic but not present enough in the movie. I think the whole budget was just to put big name actors and spent little time with writing. The kid actors was also very problematic. Storm Reid and Calvin O'Keefe was fine but the youngest actor, Deric McCabe was overtly annoying. Talk about overacting Disney Style.",
      "review_date": "2018-03-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Total dumpster fire. Bland, cynical, and unengaging from start to finish. The tokenism (seemingly the whole point of the movie) is very in-your-face and obnoxious as well. If you are a real fan of the books, don't give Disney a dime for thisTotal dumpster fire. Bland, cynical, and unengaging from start to finish. The tokenism (seemingly the whole point of the movie) is very in-your-face and obnoxious as well. If you are a real fan of the books, don't give Disney a dime for this travesty.",
      "review_date": "2018-03-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was a huuuuge fan of the whole book series as a kid, and could not have been more let down by this cynical cash-in. None of the characters or locations were the way I pictured them, and the directing seemed very stiff and TV-grade. II was a huuuuge fan of the whole book series as a kid, and could not have been more let down by this cynical cash-in. None of the characters or locations were the way I pictured them, and the directing seemed very stiff and TV-grade. I would've thought it was tough to screw up such an amazing story but DuVernay pulled it off.",
      "review_date": "2018-03-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Did you hear there’s a language across the universe called “color?” Apparently, as a scarlet-haired Reese Witherspoon taught me recently while she spoke to living flower critters. Nope! I don’t think so, miss “give me a paycheck and send meDid you hear there’s a language across the universe called “color?” Apparently, as a scarlet-haired Reese Witherspoon taught me recently while she spoke to living flower critters. Nope! I don’t think so, miss “give me a paycheck and send me home!” I’ll demonstrate how it’s done:A black hole of an experience, despite its hard attempts to look indigo fresh, all hope loses its way in A Wrinkle in Time’s milky world dyed by the residue of Lucky Charms marshmallows. Thru each overly long scene, the dreadful dialogue literally spills down excessive messages, even letting the radio hand out plot information. Believe me, you’d rather be marooned on an island of tan sand than suffer through such awful sound editing throw in dialogue at random, as is done here.Like similar kid/teen movies, a romantic side plot attempts to glitter up a bond between the protagonist, Meg, with a guy she just met that day, Calvin. It may top Twilight in its love story, yet still falls way short beneath Timothée Chalamet doing you-know-what inside a peach in Call Me by Your Name. Worse, Meg’s treatment may turn any parent hot-red, because she somehow sees a new boyfriend she knows nothing about as a symbol of success, completely contradicting the independent woman image Disney intended.Now, its core message does give a decent moral takeaway: generosity delivers greater rewards than material rewards, since the grass may not always be greener. However, in scene one, Meg receives from her father a decorated origami representing love’s eternal omnipresence, which could’ve been a powerful image, yet it never appears again. This could’ve helped kids differentiate between symbolic light and darkness, but the writers used zero grey matter to keep anyone older than twelve from boredom. In further speculation, Meg’s father also left their sepia-tone family photo to follow his own desires after the universe’s secrets, eliminating any sympathy in such a selfish man, no matter what the script wants you to feel about him.Some Blacks might find some empowerment by seeing a young Black girl achieve scientific explorations, although its focus misses the mark. When Meg slumps around school on the four-year anniversary of her father’s disappearance, some popular White girls write on her locker “If only you’d disappear to.” Why? Where did those girls’ cruel motivation originate? Race? Popularity? Brown-nosing? WHAT?! Little details like this throughout the film are rarely, if ever explained for clarity.Book fans may particularly feel quite blue from the careless spectacle-over-purpose adaptation process. To its credit, art director Naomi Shohan (American Beauty, The Lovely Bones) does achieve to create a destructive, infinite environment that towers above the heroes in an amber crystal cavern, then she counteracts that with a blanketing hallway coded in fresh hues of magenta and orange, which reflect back to some key shots in Alejandro Jodorowsky’s The Holy Mountain. Though everything still looks cheap, such as Meg, Calvin, and Meg’s brother, Charles Wallace’s flight on Mrs. Whatsit above the emerald and sapphire CGI landscape. Some wind kicks them up, so they appear to fly themselves… beneath an obvious sight of digitally removed copper wires… in front of a green screen that blurs out their outlines.Other left out details in the book include:Mrs. Who doesn’t turn invisible.Instead of a winged horse, Mrs. Whatsit turns into a giant jade artichoke behemoth.Aunt Beast is left out.Instead of a brain, the “It” takes the form of a colorless alternate dimension.But the disloyalty to the source material isn’t the worst part—it’s the performances free of any silver lining. This casting disaster’s nonexistent pacing moves slower than a periwinkle at full speed, impossible to soothe by a lavender scented candle. The cringeworthy kid actors are the worst; Levi Miller’s (Calvin) screen presence has perhaps gotten worse since he starred in the overly saturated flop Pan, but no worse than the bothersome Deric McCabe (Charles Wallace), a perfect example of an unfunny overactor.The three audience-bait women pain your purple veins to watch too—worst one being Reese Witherspoon; just… UGH!!!! She puts on her own show for a bronze metal by shouting her lines too fast against the momentum of her exaggerated hand motions that bulge out her eyes. Plus, Zach Galifianakis (Birdman, The Hangover) plays the Happy Medium without a hint of a golden sunshine smile.See? To speak color, all you need is some clever writing, an imagination, and a furious vigor against an atrocity which failed in the things I just listed.",
      "review_date": "2018-03-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A Wrinkle in Time is absolutely gorgeous to look at. I'd say it even deserves Oscar consideration for Costume and Production Designing. However, the film falters in a lack of focus, bouncing around from place to place rather clumsily.",
      "review_date": "2018-03-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "While not unwatchable, \"A Wrinkle in Time\" fails to live up to the hype and high expectations set out for by flashy trailers and an all-star cast. Though visually stunning, it feels as if too much information is trying to be crowded into twoWhile not unwatchable, \"A Wrinkle in Time\" fails to live up to the hype and high expectations set out for by flashy trailers and an all-star cast. Though visually stunning, it feels as if too much information is trying to be crowded into two hours, while upon conclusion, it also seems as if very little has happened at all. If you're a fan of the book or are looking for a feel-good action, sci-fi, and coming-of-age crossover, you may very well enjoy \"A Wrinkle in Time\". Personally, I found the corniness a little too much to handle and would not recommend seeing this film unless you're looking for something to fit exactly those criteria.",
      "review_date": "2018-03-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nWhen they announced this movie would be progressive, I was so happy. At last, an adaption which got rid of all the things that had made the book appealing! I was not disappointed. The Christian elements from the Christian author were thoroughly expunged. Also, they made sure not to make it too exciting, because that's toxic masculinity, not to mention sexist and racist.I was only sad to see they still had *some* white people in it. Couldn't they at least have made them pansexual muslims? Still, perhaps they can make a sequel which consists of three hours of screaming about Donald Trump? We can only hope!",
      "review_date": "2018-03-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The primary criticism of A Wrinkle in Time seems to be that it is so unfaithful to the book. Neither I or my lot have read it so I can only judge based what we saw on the screen. Technically good. Visually very colourful and warm ifThe primary criticism of A Wrinkle in Time seems to be that it is so unfaithful to the book. Neither I or my lot have read it so I can only judge based what we saw on the screen. Technically good. Visually very colourful and warm if  bland.The lead Meg Murry was very competent especially at the beginning when interacting with the weirdly unpleasant adults at her school. Charles Wallace( Two names?) did his very best but the director asked too much of him. The adult actors (more than a few big stars) were OK though Oprah's enormous (literally) presence detracted from even kid's suspension of disbelief.The narrative was a little confused to put it kindly. The director Ava DuVernay is a political animal not apparently suited to fantasy.Still the strong message of love and kindness as the ultimate family value is always appreciated in my book",
      "review_date": "2018-03-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I went in not knowing what to think after seeing some of the reviews going in. I really disagree in the end with the majority of them. I love the portrayal of Meg here, Storm Reid is very good and well cast for how I always pictured theI went in not knowing what to think after seeing some of the reviews going in. I really disagree in the end with the majority of them. I love the portrayal of Meg here, Storm Reid is very good and well cast for how I always pictured the character. My mother also liked it, but since it was her favorite book as a child she had internalized more of it. So there were a few things she felt would have been key to leave in that weren't.",
      "review_date": "2018-03-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I loved this story so many years ago when I was a tween. So I was excited about the film. I forced my boyfriend to go who had never heard of this book, but he loves science fiction. The movie did seem to lack character development as I had toI loved this story so many years ago when I was a tween. So I was excited about the film. I forced my boyfriend to go who had never heard of this book, but he loves science fiction. The movie did seem to lack character development as I had to explain to my boyfriend why a character was motivated to do what they were doing, especially Calvin and Charles Wallace. However, it was still the story I loved from long ago about the fight between good and evil from the viewpoint of tweens.",
      "review_date": "2018-03-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The classic children’s book A Wrinkle In Time has come to the big screen with a big-budget presentation under the direction of noted Director Ava DuVernay.  The story had been adapted prior in a 2003 television movie but this time out theThe classic children’s book A Wrinkle In Time has come to the big screen with a big-budget presentation under the direction of noted Director Ava DuVernay.  The story had been adapted prior in a 2003 television movie but this time out the scope is much larger as are the names associated with it.The story follows a young girl named Meg (Storm Reid), who has withdrawn following the disappearance of her father (Chris Pine), four years earlier. Her brilliant adopted brother Charles Wallace (Deric McCabe) is very protective of Meg and wants to help ease the suffering she has endured over the loss of their father.Enter the quirky Mrs. Whatsit (Reese Witherspon), who Charles Wallace has been talking to unbeknownst to his family who in turn seem taken aback by her arrival and strange nature.  Charles Wallace soon introduces his sister and schoolmate Calvin (Levi Miller), to Mrs. Who (Mindy Kaling), who also shares some unusual quirks as well. With the arrival of the final piece in Mrs. Which (Oprah Winfrey), the children are whisked away to another planet on a search to find the missing father and help restore light to the universe from a dark threat that endangers the universe.What follows is a series of adventures, quirky characters, and bright visuals as the children and mysterious strangers embark on a grand adventure.The cast is very appealing but I would love to know if the three stars filmed their scenes at the same time as it did appear at times if they were added in post-production as they did not seem to have much direct interactions with one another. The film does tackle some deep and at times dark subject matter which may be a bit much for younger viewers. One would think that Quantum Entanglements and folding space would be subjects more likely found in Star Trek vs a family film but the film does have some good messages and themes which are essential for younger viewers to note.The film moves at a deliberate pace and does not erupt into overblown action sequences so viewers expecting a rousing action/adventure will need to temper their expectations.For those looking for a film with an empowering message aimed at younger viewers, than “A Wrinkle in Time”, may be just the thing for an enjoyable family outing to the local cinema.3.5 stars out of 5",
      "review_date": "2018-03-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "On visuals and talent alone this film delivers for the most part, but the story fails to do the same. A film with big ideas that really goes from scene to scene with head scratching issues. Not a terrible film but one that's highly forgettable. C",
      "review_date": "2018-06-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Well intentioned and entertaining, but never profound and consistent, \"A Wrinkle in Time\" is a mixed bag.",
      "review_date": "2018-07-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I don't disagree with the details of the pro critics here.  Let's do cheer a movie which holds authentic emotion at its heart and competently conveys this thru spot-on watchable performances.  Movies about an inner journey are notoriouslyI don't disagree with the details of the pro critics here.  Let's do cheer a movie which holds authentic emotion at its heart and competently conveys this thru spot-on watchable performances.  Movies about an inner journey are notoriously difficult to produce into a commercial success.  What Dreams May Be with Robin Williams comes to mind.  For viewers open to an inner journey story, this is about as good as they get. The critic who only gave it a 25 and connects Brad Bird's failed Tomorrowland and this film I think has the right idea for where both went off track to be bigger artistic-commercial successes.",
      "review_date": "2018-06-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I don't get all the hate for this film, I found myself really enjoying it. A Wrinkle in Time is gorgeous to look at and a very entertaining film overall. I found the characters to be really interesting and compelling and the story was alsoI don't get all the hate for this film, I found myself really enjoying it. A Wrinkle in Time is gorgeous to look at and a very entertaining film overall. I found the characters to be really interesting and compelling and the story was also really good. There were some really touching moments too.The pacing was a little iffy, but other than that I was really enjoying it. Overall, I found this to be a really entertaining film to watch and I don't understand the hate at all. B",
      "review_date": "2018-03-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI liked the movie very muchI think the story is good and all the actors are wonderful in terms of acting and formI loved this film and also was concerned about it because of the wonderful actors in the film",
      "review_date": "2018-03-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Visually stunning.  Follows a different format than your typical \"save the cat\" film would.  A great diverse cast.  Great messages for children and adults alike.  Fresh narrative.   Inspiring and Gentle.  Seen in 3D 4DX",
      "review_date": "2018-03-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Visually intense and emotionally confused.  DuVernay directs children well but a dedication to the already hard to understand source material makes for dull movie material.",
      "review_date": "2018-12-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A wrinkle in time is sweet and sentimental as it is emotionally enchanting and visually appealing.",
      "review_date": "2020-05-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's good it's okay it's all right like not like I'm saying it's not bad it's just okay but it's just not bad than Tim Burton's Dumbo",
      "review_date": "2021-06-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"A Wrinkle In Time\" was not a big deal, with the exception of photography, it looked good but visually the rest of the film is grim. The performances are very bad and annoying, the special effects were very good, except for the gigantic Oprah\"A Wrinkle In Time\" was not a big deal, with the exception of photography, it looked good but visually the rest of the film is grim. The performances are very bad and annoying, the special effects were very good, except for the gigantic Oprah Winfrey, because in giant size it was a sad stumble for the visual effects, and for the film itself, and the story is bad and boring. No doubt a cruel and totalitarian failure for a large distributor like Disney.",
      "review_date": "2018-06-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I finally watched this Disney-fied version of a favorite childhood novel.  As I feared--This movie was terribly disappointing.  It was like cotton-candy--no substance at all.  Pretty pictures and platitudes.  There is very little characterI finally watched this Disney-fied version of a favorite childhood novel.  As I feared--This movie was terribly disappointing.  It was like cotton-candy--no substance at all.  Pretty pictures and platitudes.  There is very little character building.  What characterization there is goes exclusively to Meg.  Everyone else are cardboard cut-outs.  The story from the novel has been cut to almost nothing.  I'm learning to distrust Disney with anything but the most childish of stories.  Even then they over-simplify and prettify everything.",
      "review_date": "2020-11-09",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 142,
  "genres": [
    "Adventure",
    "Sci-Fi",
    "Fantasy",
    "Family"
  ]
}