{
  "title": "Bohemian Rhapsody",
  "rating": 7.7,
  "release_date": "2018-11-02",
  "summary": "Bohemian Rhapsody is a celebration of Queen, their music and their extraordinary lead singer Freddie Mercury. Freddie defied stereotypes and shattered convention to become one of the most beloved entertainers on the planet. The film traces the meteoric rise of the band through their iconic songs and revolutionary sound. They reachBohemian Rhapsody is a celebration of Queen, their music and their extraordinary lead singer Freddie Mercury. Freddie defied stereotypes and shattered convention to become one of the most beloved entertainers on the planet. The film traces the meteoric rise of the band through their iconic songs and revolutionary sound. They reach unparalleled success, but in an unexpected turn Freddie, surrounded by darker influences, shuns Queen in pursuit of his solo career. Having suffered greatly without the collaboration of Queen, Freddie manages to reunite with his bandmates just in time for Live Aid. While bravely facing a recent AIDS diagnosis, Freddie leads the band in one of the greatest performances in the history of rock music. Queen cements a legacy that continues to inspire outsiders, dreamers and music lovers to this day. [20th Century Fox]… Expand",
  "critic_reviews": [
    "You will not see a more perfect and imperfect rock and roll biopic than Bohemian Rhapsody, which does many things extremely well, other things sort of average, and one thing flawlessly: capturing the immense charisma and panache of Queen singer Freddie Mercury. Jamie Foxx’s full-body inhabitation of Ray Charles just got some competition at the top.",
    "Deftly tweaking the tropes of rock biopics, this drama of singer Freddie Mercury and British hitmakers Queen dazzlingly captures an era, a man and the universal quest for identity.",
    "As with all dramatized stories of real lives, artistic license hammers messy reality into a watchable film. Dramas are not documentaries. The essential emotions of Freddie’s life and the history of the band are here. There’s nothing unexpected in the structure of the movie. It’s a visit with some old mates you’ve not seen in a long time.",
    "As with a concert or favorite record, sometimes it's best not to overthink things but simply let the visceral power take over. That is what made Queen and Freddie Mercury so special and that is why Bohemian Rhapsody will rock you, if you let it.",
    "Appropriately for a group known for its theatrical, crowd-pleasing tunes, this authorised-by-the-band biopic carries itself lightly, serving up familiar plot points with panache and a sense of humour, while at the same time investing in the story’s emotional through-line, building to a genuinely moving climax.",
    "Bohemian Rhapsody is probably what Freddie Mercury was aiming for all along, a big, splashy, half-true biopic in the Hollywood style. It’s a bit corny, but grand; a bit obvious, but entertaining, and inspiring almost in spite of itself.",
    "Bohemian Rhapsody and Rami Malek cleverly and warmly distill an era and its music into a thoroughly entertaining piece of music history.",
    "Bohemian Rhapsody is fun but entirely superficial, playing it safe rather than trying to be as bold or brazen as its larger-than-life subject. It ultimately relies on the magnetism of Rami Malek’s portrayal of Freddie Mercury and Queen’s bombastic, beloved music to make up for its narrative shortcomings and by-the-numbers direction.",
    "Bohemian Rhapsody may not totally rock you, but Rami Malek channels the thrilling, show-stopping charisma of the late Queen super singer, ensuring this inappropriately timid biopic is as entertaining as it can possibly be.",
    "If you’re immune to Malek, there’s no hope for you. The actor might not be as handsome as Mercury and might not do much actual singing (it’s all Freddie), but he’s nearly as magnetic, and he makes you believe that that voice is coming out of that body — an amazing feat.",
    "To the filmmakers' credit, and even though they don't entirely avoid the clunky factoid-itis that often plagues the genre, this is a biopic that favors sensory experience over exposition. It understands what pure, electrifying fun rock 'n' roll can be.",
    "Maybe unavoidably, the movie that’s emerged from all that has the distinct whiff of compromise and art by committee — the opposite, in other words, of nearly everything Queen’s flamboyant, defiant frontman stood for.",
    "Bohemian Rhapsody doesn't throw itself into the tale of the band with anything approaching the abandon of the boldly unconventional 1975 smash hit that gives the movie its name. Instead, Bohemian Rhapsody plays it safe in a manner that's often cliched and always predictable — but not entirely unsatisfying.",
    "It’s too bad no one working on the production recognized the disparity in quality between the performance/non-performance scenes or they might have leaned more heavily on the former at the welcome expense of the latter.",
    "It's the centrifuge around which the rather uneven film whirls, and Malek keeps it going with his sheer will and talent, aided by a parade of legendary Queen hit singles.",
    "Winds up being giddily entertaining, first as an exercise in so-bad-it’s-funny kitsch, and ultimately as something far more meaningful and thrilling. Every now and then, a film comes along that defies the demands of taste, formal sophistication, even artistic honesty to succeed simply on the level of pure, inexplicable pleasure. Bohemian Rhapsody is just that cinematic unicorn: the bad movie that works, even when it shouldn’t.",
    "As an inducement to dig into the Queen back catalog, Bohemian Rhapsody is an unqualified success. But when it tries to be a genuine biopic of a groundbreaking band and its singular lead singer, it’s more like a little silhouette-o of a man.",
    "In strict filmmaking terms, Bohemian Rhapsody is a bit of a mess. Some of its scenes connect awkwardly, and it hits every beat of disaster and triumph squarely, like a gong. Yet if it has many of the problems we associate with “bad” movies, it has more ragged energy than so many good ones, largely because of Rami Malek’s performance as Mercury, all glitter and muscle and nerve endings.",
    "The rousing life that Malek brings to this extraordinary recreation deserves all the cheers it gets. Screw the film’s flaws — you don’t want to miss his performance.",
    "If it doesn’t have the family drama of “Walk the Line” or the psychodrama of “The Doors,” Bohemian Rhapsody does deliver what any music biopic must: convincing characters and some kick-butt simulated concert experiences.",
    "Definitely not Killer Queen, but thanks to a blinding turn from Malek, fans of the band will get their kicks.",
    "The final hurrah for Mercury’s genius, this huge, hubristic spectacle lets you grant his troubled film a pass: at least it keeps on fighting to the end.",
    "A lively, uncomplicated jukebox movie. Bohemian Rhapsody is a feature-length earworm that leaves “Don’t Stop Me Now,” “We Are the Champions,” “Another One Bites the Dust” and the rest of them wriggling in your cochlea and helping to drown out any inner whisper suggesting that you’ve just had the wool pulled over your eyes by these masters of rock theatrics.",
    "Like Queen, Bohemian Rhapsody is three parts good but not terribly exciting, and one part absolute joyful, fabulous entertainment that makes you forget everything else around it.",
    "In the best scenes, the filmmakers make the case that Queen’s musical decisions grew out of the musicians’ restless inability to fit in with either pop conventional wisdom or, sometimes, each other. The rest of the movie fits in all too well.",
    "There are some individual moments and elements to like here, but taken as a whole, Bohemian Rhapsody is mostly a flatline with occasional blips of life here and there—and not nearly enough to bring the whole body back from the dead.",
    "It's a fascinating story told by the rote conventions of the musical biopic.",
    "All in all, the movie’s a muddled and overlong experience, one that every so often drifts into dull, unintentional camp.",
    "Except for its songs, Bohemian Rhapsody too quickly becomes forgettable; something the real-life man at its center, who died of AIDS-related illness in 1991 at the age of 45, never was. Watch the real footage; you’ll see.",
    "The only time Bohemian Rhapsody works is when it finally retreats from not just the standard biopic narrative but from storytelling altogether.",
    "The later sections of the story, dealing with Mercury’s AIDS diagnosis, are carefully handled, but most of the film is stuffed with lumps of cheesy rock-speak (“We’re just not thinking big enough”; “I won’t compromise my vision”), and gives off the delicious aroma of parody.",
    "As it turns out, “Bohemian Rhapsody” the song is a sonic masterpiece and Bohemian Rhapsody the movie is just a conventional rock flick, one all too ordinary for a man and a band that exemplified the extraordinary.",
    "The movie, despite its electrifying subject, is a conventional, middle-of-the-road, cut-and-dried, play-it-safe, rather fuddy-duddy old-school biopic, a movie that skitters through events instead of sinking into them.",
    "This charitable act of resuscitation for the benefit of Mercury’s admirers is something that the film as a whole ultimately fails to accomplish, as Bohemian Rhapsody mistakenly believes that simply trudging through a workmanlike overview of the Queen frontman’s life will allow it to arrive at something approaching intimacy.",
    "The irony is that Bohemian Rhapsody, a song that triumphantly bucked convention, should now serve as the title of a movie that embraces every cliché in the days-of-our-lives biopic handbook.",
    "Fans of the band might enjoy watching the movie cycle through their hits (and there are many), but those, like me, hoping for a more robust appraisal of the late Freddie Mercury may find themselves disappointed.",
    "If Bohemian Rhapsody’s superficial gloss on the band’s rise sometimes feels like a useful feature, the hackneyed way it treats Mercury’s life and fall is close to fatal. And after you leave the theater, you may find that first part isn’t such an asset after all.",
    "Look, I get it, scripted films are not documentaries. And, sometimes, creative license has to be used to move a story forward. But I’ve never seen a film distort its facts in such a punitive way. It’s like the movie wants to punish Freddie Mercury.",
    "Although Malek looks the part, and has Freddie’s dance moves down, his performance is all stiff British accent and overbite (Mercury was born with four extra teeth). Singer never gets beyond the superficial to tell us anything profound or meaningful about Queen or Freddie Mercury or the perils of rock stardom.",
    "Bohemian Rhapsody honours Mercury the showman but never really gets to Mercury the person.",
    "\"Rhapsody” has a shallow script, oversize performances and looks like it was shot in a sauna.",
    "Despite its intentions to get close to Mercury, Bohemian Rhapsody is as intimate as a sold-out stadium show, with none of the accompanying power.",
    "The critical failure of Bohemian Rhapsody is that, 134 minutes after the lights go down, the members of Queen just seem like four blokes who’ve been processed through the rusty machinery of a Hollywood biopic.",
    "Bohemian Rhapsody’s problems aren’t specific to this movie. They are the bane of biopics broadly speaking, especially those tackling artists. I want to leave this kind of movie with a sense of the artist’s art, not just of the headlined subsections of a Wikipedia summary.",
    "In short, Bohemian Rhapsody isn’t just prone to music-biopic clichés—it’s practically a monument to them, a greatest-hits collection of every narrative shortcut one can possibly take in summarizing a legendary act’s rise to fame.",
    "A baroque blend of gibberish, mysticism and melodrama, the film seems engineered to be as unmemorable as possible, with the exception of the prosthetic teeth worn by the lead actor, Rami Malek, who plays Freddie Mercury, Queen’s lead singer.",
    "The only redeeming value of Bohemian Rhapsody is it’s so bad, there’s plenty of room left for a much better biopic about the one and only Freddie Mercury.",
    "For a film insistent upon getting the dramaturgically correct 1985 Pepsi logo into the frame, very little effort seems to have been applied to exactitude elsewhere. Freddie Mercury deserves better.",
    "Bohemian Rhapsody is bad in the way a lot of biopics are bad: it's superficial, it avoids complexity, and the narrative has a connect-the-dots quality. This kind of badness, while annoying, is relatively benign. However, the attitude towards Mercury's sexual expression is the opposite of benign.",
    "Bohemian Rhapsody is another lame music biopic, and its failures ultimately lie in the poor creative choices, the gutless approaches to potentially explosive events in the life of this band. We’re not buying this new album. There’s no new material to be found in Bohemian Rhapsody."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "It's about legends. Whether or not this is a fair and accurate account of Freddie Mercury's life, I'm honestly not bothered. All I know is that the film electrified it's audience by putting the thrill of the greatest Rock and Roll performanceIt's about legends. Whether or not this is a fair and accurate account of Freddie Mercury's life, I'm honestly not bothered. All I know is that the film electrified it's audience by putting the thrill of the greatest Rock and Roll performance in history on the big screen. The elation stays with you after you leave the Cinema. Legendary!",
      "review_date": "2018-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This are plenty of moments of glamorous grandeur that you would hope to see from a film about the great Freddie Mercury. Those moments have the tendency to sweep you up and overwhelm you making you momentarily forget that the overall filmThis are plenty of moments of glamorous grandeur that you would hope to see from a film about the great Freddie Mercury. Those moments have the tendency to sweep you up and overwhelm you making you momentarily forget that the overall film lacks the depth or script to be great. Overall a low to solid 7 a B.",
      "review_date": "2018-12-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \n\"Bohemian Rhapsody\" is much like Queen itself: soaring transcendent music at times and questionable thematic choices at others (\"Fat-Bottomed Girls,\" really?).  The shame is that there's so much material to work with and Director Bryan Singer (best known for the X-Men series) does so little with it.The most egregious oversight is any thoughtful exploration of Mercury himself.  Mercury had a long-term, apparently heart-felt, relationship with Mary Austin (who inspired “Love of My Life”) before embarking on a series of relationships with men.  While there is the broad suggestion that Mercury’s sexuality was considerably more complicated than a simple “coming out,” the topic remains unexplored.  In general, Mercury’s emotional life, much like his rampant alcohol/drug abuse, goes unremarked in the screenplay.  Director Singer seems to justify this choice by offering a scene where Mercury defends his privacy against a stereotypically prying press corps.  Like the scene itself, it’s all a little jumbled and out of focus.Even the Mercury vocals represent a curious choice.  In fairness, it would be nearly impossible for any actor to replicate Mercury’s unique vocal style.  However, when album tracks are not used, the creative team has used isolated master tracks of Mercury in the studio mashed up with tracks from Canadian Christian rock singer Marc Martel and, perhaps, others.  It is unclear what Rami Malek, who plays Mercury, contributes.  In one interview, Malek charitably describes the result as “an amalgamation of a few voices.”Worst of all, this screenplay reduces a potentially fascinating story to an exercise in paint-by-numbers.  The arc of the story is totally predictable: star rises from humble beginnings, achieves great success, becomes an arrogant jerk, has a flash of self-awareness and a moment of redemption just before the final credits roll.  In service of this trope, several facts are omitted or alternative facts created.  SPOILER ALERT:  The screenplay depicts Queen’s 1985 participation in Live Aid at Wembley Stadium as Mercury’s act of final redemption following his diagnosis.  Inconveniently, Mercury was not diagnosed as HIV+ until well after the event.Having said all that, when the music rolls, wow!  It is majestic, sweeping, moving, transcendent.  Queen offers a soundtrack of the 70’s and 80’s.  “We Are the Champions,” “Somebody to Love,” “We Will Rock You,” and so many more. The catalog is lengthy and this show does them full justice, even occasionally offering insight into the creative process behind anthems many of us have hummed for decades.  The director and performers take full advantage, making these musical numbers well worth the price of admission.Malek is riveting in the leading role.  He fully commits to this character, even to the point of wearing a dental prosthesis throughout the film.  Because of Malek’s skill, the general impression of his character as Mercury is, at times, eerie, particularly the scenes on stage.  Malek’s ability to convey emotional distance yet accessibility, so clearly on display in Mr. Robot, serves him admirably in this role.The CGI of some of the concert scenes, particularly Wembley Stadium, is extremely effective, giving the moviegoer an acute sense of the size and passion of Queen’s following around the world.  One would hope that these effects are put to good use – the closing credits for CGI personnel seemed to number in the hundreds.Bottom line:  If you want to watch the soundtrack of an iconic band, portrayed compellingly, this film delivers in full measure.  “Bohemian Rhapsody” is a whole lot more than a tribute band.  However, if you want a thoughtful examination of the human condition, Freddie Mercury’s or anyone else’s, you’re in for a lengthy disappointment (running time is 2:13).",
      "review_date": "2018-12-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The musical enable and experience in this film is great. I felt like I was at a Queen performance and it had me hooked. Unfortunately some of the forced humour and moments of the band's personal life was lost on me. It felt almost hollow. IThe musical enable and experience in this film is great. I felt like I was at a Queen performance and it had me hooked. Unfortunately some of the forced humour and moments of the band's personal life was lost on me. It felt almost hollow. I expected a lite more drama or grit to their movie, and from what I hear they took some huge poetic licence liberties with it. Could have been a lot stronger, but as I said, the music holds it together and it's a movie about music, so worth a look if that's your jam.",
      "review_date": "2018-12-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Was it good? mm..yeah. Was it good enough? No. Even though i think it could've been better - i don't think you should miss it if you haven't seen it yet. Freddie is a legend, and so are \"Queen\". There's a lot more to say about them than inWas it good? mm..yeah. Was it good enough? No. Even though i think it could've been better - i don't think you should miss it if you haven't seen it yet. Freddie is a legend, and so are \"Queen\". There's a lot more to say about them than in this movie, but for a two hour film - they did a pretty good job. Rami deserved the oscar without any doubt.",
      "review_date": "2019-02-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Its a good performance and is very stylish, but doesn't really have much substance",
      "review_date": "2019-02-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Though the performances, particularly that of Rami Malek, are impeccable, a bad screenplay and rapid shift in tones bring this film way down. It should have been much better.",
      "review_date": "2018-11-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Bohemian Rhapsody is the bare minimum for a movie of this genre, instead of being a dramatic retelling of one of the greatest bands of all time, it instead plays it way too safe and instead becomes the cliffnotes version of some of Queen'sBohemian Rhapsody is the bare minimum for a movie of this genre, instead of being a dramatic retelling of one of the greatest bands of all time, it instead plays it way too safe and instead becomes the cliffnotes version of some of Queen's greatest hits. Bohemian Rhapsody plays it like the classic rise to fame but with consequence story,and it's at time hilarious how they hollowoddize things in this movie. The only thing that helps the film is the performance of Rami Malek as Freddie Mercury, the performance is genuinely amazing, and the only Oscar this film truly deserves. He perfectly encompasses Mercury's presence on stage, but also his quiet and awkward demeanor off stage. The rest of the movie however is an overall mess, relying only on the love of Queen's music and Malek's performance, so if you like Queen's music and don't care for a proper retelling of their story than this is the movie for you. For me it was just kind of an average movie, with one stand out element.",
      "review_date": "2019-02-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wow! the critics got it so wrong! Maybe it's because I'm not a massive Queen fan, but this was one of my most enjoyable films of 2018. Admittedly, it's the Freddie Mercury story rather than the bands but there are excellent performances andWow! the critics got it so wrong! Maybe it's because I'm not a massive Queen fan, but this was one of my most enjoyable films of 2018. Admittedly, it's the Freddie Mercury story rather than the bands but there are excellent performances and all the hits are there to be enjoyed on the big screen. I doubt the film would have been as popular had Sacha Cohen taken the Freddie role? Some people are born for certain roles and Rami Malik is outstanding. I particularly loved watching the band take the stage at Live Aid, it really gave you the feeling of being there. One to be watched on the big screen for sure.",
      "review_date": "2019-01-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie proves that so called \"fans\" don't care about historical accuracy.",
      "review_date": "2018-11-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I will start by getting this out of the way--I'm not a big Queen fan. Please, please, read until the end. They always lacked a deeper, more intricate meaning in their music, insight, they are all about externalizing themselves; but if this isI will start by getting this out of the way--I'm not a big Queen fan. Please, please, read until the end. They always lacked a deeper, more intricate meaning in their music, insight, they are all about externalizing themselves; but if this is a problem when it comes to their music, it works magic in film.Director Bryan Singer gets this. 'Bohemain Rhapsody' is visible in lacking insight or bravery into Freddie Mercury's life. When he confesses to his lover, Mary (Lucy Byonton) the fact that he is bisexual, she is like--damn, sucks, bro. And he is like--yeah, i know, right. That's about it. But this is not a documentary. This is an artistic film. Like Mercury himself, Singer gives the people what they want--an extravagant, elegant, virtuoso exodus embodied by the march of Rami Malek's career-defining performance. Seriously, he was astounding as the legendary lead singer.If the late Freddie Mercury was alive, he would approve of this. Throughout this formulaic biopic, one thing managed to stand out, though, albeit it was not that obvious--Mercury's devotion to his fans. \"I'm a performer, darling!\" Even after discovering his incurable disease, his sole focus was on putting on a nice show. I admire this about him and I admire the film for at least trying to portrait this. And while I am not a huge Queen fan, damn it if Freddie Mercury is not the greatest performer ever.The first half had its moments of tediousness, mostly due to its straight-forward basic Wikipedia-style of standard biographic presentation. But the ending performance at the 1985 Live Aid was so explosive, cursive that when I looked at the time left and saw less than 20 minutes, realizing it was not a full recreation, I was a bit frustrated. Still, the glory was there and, I admit it, I like Queen a bit more now.",
      "review_date": "2019-02-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Music biopics are arguably more entertaining than documentaries since they tell a (largely) true story about the subject matter while following a cinematic movie formula. However, this happens to be the biggest weakness for them, as historyMusic biopics are arguably more entertaining than documentaries since they tell a (largely) true story about the subject matter while following a cinematic movie formula. However, this happens to be the biggest weakness for them, as history is often rewritten and edited for the sake of dramatic effect. Since this review is overall positive, I will begin with the negatives by addressing historical inaccuracies as one of the films biggest weakness. For Bohemian Rhapsody, the same issue occurred during the writing of the script, which made many of the dramatic elements seem overacted and unnecessary. Many moments of Freddie’s real life are implemented into the story to add tension and drama to the relationship among the band members when in actuality there was not nearly the same level of tension. While largely paying homage to the legend, many parts of the film make him look like the stereotypical **** diva superstar that was not the complete truth. Another aspect of weakness that I found with the film was the dramatic “cheese”, moments added to add drama to make the film more like a film. Even with the largely amazing performance from Rami Malek (more on him later), there were moments where his dramatic acting fell short and the scene came across as almost laughable. While I do have more to say on his performance and the performances of the other cast members, I do not believe that Malek deserves an Oscar nomination.With that said, the film also seemed to rush through the rise of Queen as a band and their ascent to fame. It takes a matter of twenty minutes or so for the band to go from starting off to signing with John Reid (Aiden Gillen, did good), which was a big deal since Reid was the manager for Sir Elton John. Bohemian Rhapsody wasn’t able to use this formula the best way nor did the movie suffer as a whole, but I certainly would’ve liked to see more scenes centering on the band’s rise. Overall, the film “needed” to add drama and fake history to add to the cinematic effect and fill in the runtime. While these aspects may have hurt Bohemian Rhapsody from being truly amazing, the music and performances were amazing.I must bestow praise to all those involved with camerawork, film editing, and set designers for their amazing artistic input that brought the movie to life. Every music biopic that I have seen has made me appreciate the music and the artist(s) more. I have felt a connection with these films that have made them worth investing time into over and over again. All previous biopics, however, pale in comparison to the magic of Queen that Bohemian Rhapsody brought to life with such realism. The settings, costumes, and perfect recreation of the band’s performances allowed this film to emerge from its weaknesses to become a truly enjoyable experience. It also set this film apart from other biopics by adding a unique style and flair that exemplifies what Queen as a band embraced back in the day. It’ll send chills through your spine and maybe inspire you to become the next great music artist, because God knows we need much help fixing music (except rap).The performances by the cast members themselves were amazing across the board, from the band members of Queen to the supporting characters of the story. The highlights were Rami Malek as Freddie Mercury (obviously), who prevails through some bad moments by nailing all the movements and mannerisms of Mr. Mercury. The live performance scenes in particular were perfectly executed, as the lip-syncing and Mercury theatrics would make you believe that Rami was Freddie himself. I was also impressed with Gwilym Lee’s excellent turn as guitarist Brian May, achieving the perfect recreation of May from accent to acting according to the scene’s tone and objective. One more performance I would like to highlight was Lucy Boynton as Mary Austin, who I believe brought the most emotional complexion among the cast, being able to properly add drama to an otherwise lighthearted film.As with all films, Bohemian Rhapsody is not without flaws; there are moments of overly-dramatic elements, and some of the actual history has been rewritten to add to this effect. These flaws should only be in a made-for-TV movie on Lifetime Network, but certainly not the film’s positive qualities. Bolstered by the set design, amazing cinematography, editing, and cast performances, the film is certainly an achievement for music biopics. It brings one of the greatest songwriters and vocalists to life, and gives audiences a movie centered on a band who made music for the people. Critics can say what they want, but ask the fans of rock and they’ll place Queen among the greatest acts of all time. The film brought them to life in astounding fashion, and has allowed to world to gain a greater appreciation for art that we may never encounter again.",
      "review_date": "2018-11-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is like every other story ark cliches combined but with a Queen paint over it. Off the immense catalog of Queen songs to feature in this film, the people behind it chose the most consumer-friendly, recognizable and predictableThis movie is like every other story ark cliches combined but with a Queen paint over it. Off the immense catalog of Queen songs to feature in this film, the people behind it chose the most consumer-friendly, recognizable and predictable songs that every Queen fan that went to the theater too see the movie is tired to hear. 20th Century Fox is REALLY afraid to dive deep into the dense library of masterpieces that Queen produced over the years, even so that Innuendo is not mentioned in any way in this movie, which, alongside the title track, is one the most \"off the wall\" track queen has in their discography.The acting was pretty solid, although Rami Malek really looked comical as young Freddie for me. The band members were alright as charatcers, besides John Deacon, the bassist, whose appearance was really not that much important besides the 'Another One Bites the Dust' section.Bohemian Rhapsody is a really good movie if you want to become a Queen fan and dive deep into the band's history, but it's disappointing for a long time fan who wanted to see something new.",
      "review_date": "2019-01-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "ENG: If you put the love that you have for \"Queen\" aside, is just another generic rock band movie.PT-BR: Se colocarmos de lado o nosso amor por \"Queen\", o filme é apenas mais um filme genérico de bandas de Rock.",
      "review_date": "2019-02-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It was not waste of a time to see this movie,it is a documentary or maybe biography movie,musical,and fast rhythm movie that don't let you become bored.But it is not a MOVIE,it is not CINEMA. The screenplay is so poor,it doesn't have a StoryIt was not waste of a time to see this movie,it is a documentary or maybe biography movie,musical,and fast rhythm movie that don't let you become bored.But it is not a MOVIE,it is not CINEMA. The screenplay is so poor,it doesn't have a Story line,characters are poor,i can't feel them. It's just an actor mediated Documentary;A poor one.I don't know anything about Directing and i don't judge it.At all,it wasn't that type of movie that makes me drop deeply in the story to feel the characters and their lives, their world, and think about them.not good,not bad,but Ugly...#MRD_TG",
      "review_date": "2019-02-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was a fine movie, a FINE movie. The performances are amazing, specially from the lead Rami Malek, but the rest of this movie is bland and forgettable. For most of the movie the direction and cinematography were just okay (however theThis was a fine movie, a FINE movie. The performances are amazing, specially from the lead Rami Malek, but the rest of this movie is bland and forgettable. For most of the movie the direction and cinematography were just okay (however the live aid concert scene was really good) and this is just a very standard, formulaic and predictable biopic about Freddie Mercury and Queen.Not a bad movie but not a great movie or a masterpiece, it's a fine movie and I give it a 6/10. A 6 is a pass and a \"positive review\" for me, but the minimum for a green score is 7 but that's too high for me. When I saw it I never thought that this could be an Oscar-worthy movie.The fact that this won Best Drama Picture at the Globes over Blackkklansman, If Beale Street Could Talk and A Star Is Born, is just as laughably hilarious as when Crash won Best Picture at the Oscars over Brokeback Mountain. I'm shocked.",
      "review_date": "2019-04-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Simplistic but highly enjoyable. The movie plays like a best off Queen’s greatest hits and achievements, which isn’t a bad thing. The music still has the power to sway any audience and Freddie’s commanding stage presence is excellentlySimplistic but highly enjoyable. The movie plays like a best off Queen’s greatest hits and achievements, which isn’t a bad thing. The music still has the power to sway any audience and Freddie’s commanding stage presence is excellently  recreated by an outstanding performance by Rami Malek. Freddie’s band mates are equally well portrayed, albeit a bit of the card board variety.  Brian May is the other stand out, every detail and nuance of his mannerisms has been captured, one could easily be fooled he was the real person. To me the biggest let down was the watered down story. It was competent but without any rough edges. Nothing that ruffles the feathers. It’s a tribute to Queen and a very entertaining one at that.",
      "review_date": "2019-04-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Baffled by the negative critic reaction to the film. The film does tread lightly on the darker aspects of Freddy's life, but it's a celebration of Queen, not an expose.It's a highly enjoyable film with good performances, especially from RamiBaffled by the negative critic reaction to the film. The film does tread lightly on the darker aspects of Freddy's life, but it's a celebration of Queen, not an expose.It's a highly enjoyable film with good performances, especially from Rami Malek and would recommend  it to any fan of Queen or great rock.",
      "review_date": "2018-11-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I have no idea why the critics didn't enjoy this movie as much as the audience does. I loved every second of it!!! It was an emotional rollercoaster. The cast is perfect, and they paid a very respectful tribute to the band. Rami Malek did anI have no idea why the critics didn't enjoy this movie as much as the audience does. I loved every second of it!!! It was an emotional rollercoaster. The cast is perfect, and they paid a very respectful tribute to the band. Rami Malek did an exceptional job portraying Freddie. It's worth your time !!!",
      "review_date": "2018-11-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "So glad I stopped reading the so-called \"critic reviews\" quite a while ago. They are almost always off nowadays, it's funny, the movies I enjoy have rotten reviews and vice versa. Anyways - great movie this one. Go watch it if you like Queen.So glad I stopped reading the so-called \"critic reviews\" quite a while ago. They are almost always off nowadays, it's funny, the movies I enjoy have rotten reviews and vice versa. Anyways - great movie this one. Go watch it if you like Queen. If you don't know or don't like Queen, you probably won't connect with the movie and I wouldn't suggest it for you...",
      "review_date": "2018-11-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I rarely do reviews on movies as what makes a good movie for someone is is soooo subjective.I just saw this movie yesterday and was blown away. A solid 9 out of 10. If Rami Malek who played Freddie Mercury doesn't get an Oscar nod for hisI rarely do reviews on movies as what makes a good movie for someone is is soooo subjective.I just saw this movie yesterday and was blown away. A solid 9 out of 10. If Rami Malek who played Freddie Mercury doesn't get an Oscar nod for his stellar effort there is no justice in the movie business these days. Lastly the critics are totally clueless on this one. Must be the same critics who trashed Led Zeppelin in the 70's. Must see movie....",
      "review_date": "2018-11-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A must-see film. I am not a queen fan...never been.Got to say that the acting, story and music gave me the chills. By the end I was smiling and almost crying.P.S.Still trying to understand which planet are those movie critics coming from.",
      "review_date": "2018-11-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was never a fan of Queen's music or Freddie Mercury, but this film fosters an appreciation of both. The story covers the band's career with the focus on Mercury. As the lead singer, Rami Malek beautifully creates a character who'sI was never a fan of Queen's music or Freddie Mercury, but this film fosters an appreciation of both. The story covers the band's career with the focus on Mercury. As the lead singer, Rami Malek beautifully creates a character who's headstrong, brilliant, charismatic and outrageous (for his day). The narrative follows a traditional arc, covering the band's creative output and success (with all the hits), as well as Mercury's personal struggles. Without ever being emotionally involving or especially original in approach or direction, it still manages to create an interesting biopic. NOTE: In an ironic (and somewhat disguised) role, Mike Myers gets to diss the title song, which was a reference to his performance of the song in \"Wayne's World.\"",
      "review_date": "2018-11-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I don't understand the critics. This movie was great. It's not perfect that's true, but you will enjoy it. I cried several times during the film. It was a very emotional experience. Rami Malek was awesome, great work.",
      "review_date": "2018-11-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a very respectufl film about a legendary group and character.DO NOT trust the critics, they were worng before with QUEEN, and they are wrong again.This is a fantastic film that every Queen fan will enjoy.",
      "review_date": "2018-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wanted to take this opportunity to express some of the backlash and negativity from those who dislike this film. Opinions will be opinions, and reading through some critics' reviews, I can certainly see their point sometimes,but the filmWanted to take this opportunity to express some of the backlash and negativity from those who dislike this film. Opinions will be opinions, and reading through some critics' reviews, I can certainly see their point sometimes,but the film literally ends with a song about having a good time. If the audience was entertained, so what if you didn't get the rated-R Queen story you wanted? So what if Freddie Mercury wasn't played by Sacha Baron Cohen? So what if the filmmakers made artistic changes? Will the audience even care? Isn't film supposed to entertain?Pushing all the film's production issues aside, it can't be understated how much of a feel-good movie this really is. From what I can see, repeat watches will be immensely entertaining.All the acting here is on point. As you've no doubt heard already Rami Malek gives the film his all as Freddie Mercury. He is the heart and soul of this movie and it wouldn't work without his electrifying performance. It's the little things that define his Mercury: the little facial tics, cracked smiles and so on. He's definitely a shoe-in for that Best Actor.I was also very impressed by Gwilym Lee as Brian May and Ben Hardy as Roger Taylor. The two of them are great foils to Malek's Mercury and both embody their real-life selves so well.As for filmmaking, I have one or two small gripes here and there. The editing was choppy at times, (during dialogue scenes) cutting away abruptly after someone has finished his/her lines; to my knowledge it happened twice or thrice. The camerawork is spectacular, lots of close-ups, puts you in the moment. The CGI isn't anything specialbut it gets the job done.Overall, I really loved Bohemian Rhapsody. The last 30 minutes really did encapsulate the audience in experiencing Queen and Freddie Mercury; and it's been some time since my friends and I left the cinema feeling this good.",
      "review_date": "2018-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie got just so so reviews and to an extent, it deserved them. That stated, its an enjoyable film. Malek nails his performance and the music highlights the story. Its a little long but the Live Aid scenes are just great. Forget theThe movie got just so so reviews and to an extent, it deserved them. That stated, its an enjoyable film. Malek nails his performance and the music highlights the story. Its a little long but the Live Aid scenes are just great. Forget the critics. If you liked Queen , you'll enjoy the movie",
      "review_date": "2018-11-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "so we have 4.9 critic score and 8.3 user score average: ladies and gentlemen - we have another \"critics don't get it\" scenario.Just like Freddie said in this movie - everyone's a critic now.This was great movie to watch, someone who is NOTso we have 4.9 critic score and 8.3 user score average: ladies and gentlemen - we have another \"critics don't get it\" scenario.Just like Freddie said in this movie - everyone's a critic now.This was great movie to watch, someone who is NOT A QUEEN FAN (but am now) I enjoyed this experience and happily provided my money to support the film which is shot amazingly and Rami of course - who played great! After movie - I am Queen fan now, and have been THE Queen fan since I came to UK (I have big respect for Her Majesty).Movie is 2 hours but feels exactly right. It never bores, but I wish some creative music-making scenes were longer. Overall, this is solid movie, since I have to provide score, I guess 8/10? But an Oscar nominee for sure, for performance",
      "review_date": "2018-11-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "We really enjoyed it. The actors did a great job and the music was fantastic. It left us feeling quite emotional and also very inspired. My teen really enjoyed it as well. She said felt a little bummed though that she wasn't around to seeWe really enjoyed it. The actors did a great job and the music was fantastic. It left us feeling quite emotional and also very inspired. My teen really enjoyed it as well. She said felt a little bummed though that she wasn't around to see them together in concert.",
      "review_date": "2018-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Bohemian Rhapsody\" honours Queen with a rousing and persistently entertaining biopic. The musical scenes are electrifying and the performances are exemplary.",
      "review_date": "2018-11-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Yes this film may have a few historical inaccuracies, but that doesn't really matter, the film was two hours of fun and I enjoyed ever minute as a huge Queen fan. Rami Malek was the perfect fit to play Freddie Mercury even getting hisYes this film may have a few historical inaccuracies, but that doesn't really matter, the film was two hours of fun and I enjoyed ever minute as a huge Queen fan. Rami Malek was the perfect fit to play Freddie Mercury even getting his mannerisms down to a T, the Live Aid scene was done very well. This film is a must watch for any Queen fan, it will get you singing and crying throughout.",
      "review_date": "2018-11-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Critic review\" WTF? 49?! \"Critics\" does not deserve your attention. The movie is AWESOME! Go watch it. (Sorry my bananas english. It's not my native language)",
      "review_date": "2018-11-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A very good movie, well done.  Rami should get an Oscar nom for this one.  Shed new light on the bands history and it was great to reminisce my childhood memories of the music.  New respect for Freddy Mercury, he was a great performer andA very good movie, well done.  Rami should get an Oscar nom for this one.  Shed new light on the bands history and it was great to reminisce my childhood memories of the music.  New respect for Freddy Mercury, he was a great performer and musician.  I'd give a 10, but the teeth for Freddy's character were overdone, to the point of being comical.  Should fire the prop guy because he just didn't get his teeth right.  They look like they should have been backed off by 4mm.",
      "review_date": "2018-11-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wow !! What a beautiful, mesmerizing and moving Music Flick. The Live Aid Concert will paint a big Smile on your face, but also leave you quite impressed and with tears in your eyes. The acting ist really great and the chemistry between theWow !! What a beautiful, mesmerizing and moving Music Flick. The Live Aid Concert will paint a big Smile on your face, but also leave you quite impressed and with tears in your eyes. The acting ist really great and the chemistry between the actors seems real and fluid. Music might be the Best of the Last Century and its transformed perfectly for the Big Screen. In Quality (especially IMAX), Choice of Tracks, Loudness and perfect acting in Concert Scenes.No one wants to see a Wikipedia Movie or a chronological correct Biography reconstruction with Actors (there are enough Lifetime Documentaries about Queen).You can't squeeze over 40 Years of Queen (or over 20 with Freddie) into a 2 Hour Music Movie. It's just about the biggest and finest Rock Music Tracks in the Last Century and capsuled in nice, entertaining Stories how the Songs were Written, Created or Recorded. The Acting of the Band and it's chemistry is just phenomenal.The Music is at it's Best. What do you want more ? Go an see it",
      "review_date": "2018-11-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My third concert experience in two weeks. So I'm satisfied. Rami Malek perform is outstanding. They should have put more efforts in the physical appearance of Malek who didn't look much like Freddy. I loved the Bohemian Rhapsody, basically ofMy third concert experience in two weeks. So I'm satisfied. Rami Malek perform is outstanding. They should have put more efforts in the physical appearance of Malek who didn't look much like Freddy. I loved the Bohemian Rhapsody, basically of the music and Rami in it. What I expected to see was more of the true Freddy - how he got into music, why he was passionate about it, reveal of his family and so on. As Biography the film fails, but as Music experience and Drama Bohemian Rhapsody nailed it.",
      "review_date": "2018-12-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie saved my year. The music is terrific and made me want to watch it again.",
      "review_date": "2018-11-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "IM not a super fan of queen but this movie is one of the best I’ve ever seen. Emotional, funny and an amazing story of pure talent. The direction and production of this movie was so spot on and Malek’s performances amazing",
      "review_date": "2018-11-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Among the worst movies I've had the misfortune to see in a theater in about a decade. It's a joke. And offensive on several levels. I'm not even a Queen fan and I cringed for Freddie Mercury, reduced here to a caricature.",
      "review_date": "2019-03-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Once again critics are wrong and the public understands what rock & roll was and is. Freddy would have been proud.",
      "review_date": "2018-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I thought it was very entertaining and way better than the critic reviews indicate.  If you like the music of Queen, you will enjoy this film, because it is filled with music.  And because it is so greatly oriented to the music, pick aI thought it was very entertaining and way better than the critic reviews indicate.  If you like the music of Queen, you will enjoy this film, because it is filled with music.  And because it is so greatly oriented to the music, pick a theater with excellent sound.  I have no idea whether it is an accurate portrayal of Freddie Mercury's life, but it is not just about Freddie Mercury.  It's about the band too and their amazing success and the legacy of their music.",
      "review_date": "2018-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nthis movie is amazing, so emotional and so well acted i would watch it over and over again! Freddie Mercury is such a legend!!",
      "review_date": "2018-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Loved it. Showed the rise of Queen and how Freddie Mercury became a rock legend. Some complain that it didn't delve into Mercury's sexuality enough, but that's ok. The film was a positive one and its ok to leave feeling inspired and hopeful,Loved it. Showed the rise of Queen and how Freddie Mercury became a rock legend. Some complain that it didn't delve into Mercury's sexuality enough, but that's ok. The film was a positive one and its ok to leave feeling inspired and hopeful, realizing its ok to have heroes and legends. Particularly touching was how the film depicted Mercury's relationship with his Parsi Indian parents. I guess it will come as a shock for many to know that Mercury was of Indian ethnicity.",
      "review_date": "2018-11-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wow. What an interesting film. I have never been a huge fan of Queen's music, nor do I know how the real story of this band actually played out in the real world... So I have nothing to compare my analysis of this film on besides the filmWow. What an interesting film. I have never been a huge fan of Queen's music, nor do I know how the real story of this band actually played out in the real world... So I have nothing to compare my analysis of this film on besides the film itself.This film was absolutely brilliant in so many ways, yet I didn't realize I liked it so much until the last 30 minutes. I had no idea what direction the plot was going, which kept me watching, hoping it didn't head south. To my enjoyment it didn't go south at all; Instead it became one of my favorite films of the year. My point in saying this is: Don't knock the movie until you watch it in its entirety and really look back at the movie as a whole.The acting and character development was outstanding. The music was, to my surprise, heartwarming, fun, and meaningful to listen to in conjunction with what was presented on the screen. Touching back on one of my original points, and why this movie was so damn good: The story was riveting and easy to follow but it didn't give away the end result (unless you knew already). For someone like myself who didn't know the story of the band, the story progression was subtle and kept me glued to the screen waiting to see what was going to happen next.Overall it was just an amazing movie with awesome music, great acting, small bursts of comedy, meaningful but not overbearing important messages, drama, conflict, and some tear-jerking moments. The film had it all and it is definitely worth watching, regardless of whether you know the story of the band from beginning to end. (A side note, my girlfriend saw the film with me and enjoyed it even more than I did and she loves Queen and knew how the plot was going to turn out)",
      "review_date": "2018-11-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "For a biopic on a band that went against the musical formula, the film Bohemian Rhapsody is depressingly formulaic. This movie feels more like a cash-grab for the surviving members of Queen than an honest look at the band or Freddie Mercury.For a biopic on a band that went against the musical formula, the film Bohemian Rhapsody is depressingly formulaic. This movie feels more like a cash-grab for the surviving members of Queen than an honest look at the band or Freddie Mercury. In that vein, Freddie Mercury's portrayal is ultimately the downfall of the film.On one hand, Raimi Malek does a great job portraying the legendary frontman. On the other hand, Bryan Singer's direction is lazy, the script is bad and the movie drags along, spending way too much time on Mary Austin for one thing, but the biggest problem with the script is this: It feels like Queen is trying to take credit for Freddie Mercury being as good as he is, and that is just not the case in real life. Also, there is not nearly enough music in this film. I left the theater feeling unfulfilled.The movie Bohemian Rhapsody feels a lot like a serious Walk Hard: The Dewey Cox Story. This is not a compliment. Bohemian Rhapsody is contrived, way too safe (the PG-13 rating is indicative of this) and way too boring. This should have been a straight-to-Netflix movie, and it really does feel like that. This is easily one of the most disappointing movies of the year. I would have given this a 4 if it were not for Raimi Malek's performance, which places this movie at a low 5.",
      "review_date": "2018-11-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is just phenomenal through and through. I swear to God, Rami Malek sounds just like Freddy Mercury. A bunch of critics have these unrealistic or straight up bizarre expectations for the film, like, says Consequence of Sound,This movie is just phenomenal through and through. I swear to God, Rami Malek sounds just like Freddy Mercury. A bunch of critics have these unrealistic or straight up bizarre expectations for the film, like, says Consequence of Sound, \"[It's] like watching 40 years of musical biopic tropes in brief, shortened and scrubbed and marketed within a bank-friendly PG-13 presentation.\" You heard them. They're complaining that it's not rated R (read the full review to see what I'm talking about). Now, I respect the opinions of others, but they're just straight up acting like edgy teenagers who play Fortnite. Anyways, this is a great film that is definitely worth 2 hours in your day.",
      "review_date": "2018-11-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "absolute masterpieceBohemian Rhapsody is a clear example of a biographic movie done right.spoilerfreddie goes from his early 20s all right to live aid concert",
      "review_date": "2018-11-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I have been a fan since the early 70s, and I loved this movie. Being a movie there are liberties taken with when events occurred and some things were dramatized for the movies sake. But the overall feel and story were fantastic. would haveI have been a fan since the early 70s, and I loved this movie. Being a movie there are liberties taken with when events occurred and some things were dramatized for the movies sake. But the overall feel and story were fantastic. would have gave it a 10 but dropped it to a 9 for the timeline being mutable.",
      "review_date": "2018-11-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is a great celebration of the music of Queen,and Freddie Mercury.  True, the facts and timeline of his life are not 100% accurate. I assume they took liberties for dramatic enhancement.  If you love the music of Queen, you willThis movie is a great celebration of the music of Queen,and Freddie Mercury.  True, the facts and timeline of his life are not 100% accurate. I assume they took liberties for dramatic enhancement.  If you love the music of Queen, you will find this a fun way to experience their hits while getting an overview of the bands formation and ride to stardom. Rami Melek puts in a great performance.  This movie is worth seeing in the theater just for the recreation of the Live Aide performance on a big screen. Totally worth it!",
      "review_date": "2018-11-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is a good example of where the \"Hollywood\" sensibility of sacrificing truth for narrative didn't work out in the favor of the filmmakers.  Admittedly, I was no Queen expert going into this movie.  I went into the theater as a hugeThis film is a good example of where the \"Hollywood\" sensibility of sacrificing truth for narrative didn't work out in the favor of the filmmakers.  Admittedly, I was no Queen expert going into this movie.  I went into the theater as a huge fan of the music while lacking a broader knowledge of the band's history.  Having said that, I couldn't shake the feeling that almost all the thematic and narrative choices in this movie were just that, intentional choices made by the filmmakers to tell a mostly fictional story.  Doing a quick Youtube search after viewing proved my instincts correct.  The worst part about their trade of truth for story?  The story just wasn't all that good.  While never really giving a chance for anything to be fully fleshed out, the filmmakers attempted to show Mercury as a superhuman talent, a larger than life personality, and a flawed but tragic individual all while ham fisting wonderful songs into oddly fitting \"origin stories\" because it fit some executive's formula for a biopic.  The two saving graces of this picture are the casting and the music.  Although, Malek is shamefully underutilized as Freddie Mercury, he does get several chances to shine through and rise above this mirky money grab to show you what could have been.  Speaking to the second saving grace... if the best thing about a movie is the catalog of music that inspired anyone to care about the topic matter in the first place, wouldn't you rather just listen to the music?  Yeah, me too.",
      "review_date": "2018-12-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Another one bites the dust!I heard the movie was bad but still wanted to give it a try. Besides a Queen fan, I am also a huge Beatles fan. I am the kind of dad that gives his 10 year old kids 'The Story of the Beatles' in comic version as aAnother one bites the dust!I heard the movie was bad but still wanted to give it a try. Besides a Queen fan, I am also a huge Beatles fan. I am the kind of dad that gives his 10 year old kids 'The Story of the Beatles' in comic version as a present (and must read for 'general education'). This movie felt like I had just read the story of Queen in comic version. The wikipedia page of Queen translated in Disney style pictures on the white screen with a tribute band and a dental prosthesis as lead actors. Awful!",
      "review_date": "2019-04-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I found it very difficult to fault this. Well acted and a blast to watch. Critics say it doesn’t focus enough on Freddie as a person and his personal challenges. I say it’s spot on with a good amount of focus on the whole band and theirI found it very difficult to fault this. Well acted and a blast to watch. Critics say it doesn’t focus enough on Freddie as a person and his personal challenges. I say it’s spot on with a good amount of focus on the whole band and their journey. Loved it!",
      "review_date": "2018-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I think it was done very well and was excellent and entertaining. Rami Malek deserves a Best Actor Academy Award in my opinion.  I cannot understand anyone who likes Queen's music and appreciates how great they were not liking this movie.",
      "review_date": "2018-11-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "very good, exciting, you'll cry if you're a fan.all the actors do a good job starring their characters, and when you see Rami Malek in the movie, you'll see Freddie Mercury.",
      "review_date": "2018-11-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I really enjoyed the movie. My wife and kids also liked it. I thought Rami Malek did an amazing job portraying Freddie Mercury.",
      "review_date": "2018-11-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Rami is awesome.  But this movie is trash.  Scattered, sugarcoated, and UNTRUE.  Half the events in the movie are edited or totally made up.  This is NOT a movie about Queen.  It's a movie about a fake band based on Queen. Poor cheap writing.",
      "review_date": "2019-03-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Weather or not this is objectively a good movie it is a fun movie and you'll and enjoy watching it even if you don't know much about queen.",
      "review_date": "2018-11-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Shockingly, insidiously, profoundly homophobic.  Freddy's sexuality is presented as the central tragedy of his life, and his illness as the inevitable outcome of it. Simply disgusting.",
      "review_date": "2018-12-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I guess I'll never make it as a movie critic because we loved this movie and we disagree with the poor ratings by the critics. It was a long movie, yet didn't feel long. What we got out of is how he succeeded, by believing in himself andI guess I'll never make it as a movie critic because we loved this movie and we disagree with the poor ratings by the critics. It was a long movie, yet didn't feel long. What we got out of is how he succeeded, by believing in himself and being supported by his band members. We don't need to know everything about him. This movie showed why Freddie Mercury was great, despite his many flaws.",
      "review_date": "2018-11-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I enjoyed it.  It's not perfect, but it's very, very good.  The core was right, and people will know about one of the best bands of all time again.  How can I not be excited?",
      "review_date": "2018-11-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Pacing might be a little strange at times, but overall a great story with amazing performances. Many emotional moments and of course the amazing soundtrack in a theater setting (especially Imax) alone was worth experiencing this movie.",
      "review_date": "2018-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "trash performance, trash story, trash movie.Let's retell the whole story again with some better people.",
      "review_date": "2018-12-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Naturally great music and a stellar performance by Rami Malek aren't enough to carry what is ultimately a self-aggrandizing CliffsNotes take on one of music's greatest talents",
      "review_date": "2018-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nBlow my mind. we really enjoyed it how the producer mixed the crowd scenes in the movie. The actors did an awesome job as well, especially Malek.",
      "review_date": "2018-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best movies I have seen in years. The music was fantastic, the acting was excellent and I felt like I was at a Queen concert only better!  I do not repeat movies but this one is worth seeing over and over again.  Amazing! LauraB",
      "review_date": "2018-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a great film, simple as that!A story that covers a 15 year period of one if not the greatest bands and showman there has ever been.If you were lucky enough like me to grow up with the music of Queen and witness them live along withThis is a great film, simple as that!A story that covers a 15 year period of one if not the greatest bands and showman there has ever been.If you were lucky enough like me to grow up with the music of Queen and witness them live along with their triumphant set at Wembley for Live Aid then this film is everything you wanted and more.For a new generation of people who knew nothing about this period then it give a entertaining potted history to this once in a lifetime event.The acting I tremendous and all the main cast members must be commended on their work in looking and sounding the part, I would think Brian, Rodger and John would feel like they were looking into a mirror, and I’m sure Freddie would be delighted with Rami Malek’s portrail of him.Although some of the critics reviews have been a mixed bag I feel some are missing the point, this film is a joy an uplifting story it has drama,humour and some of the best music that all filmgoers will enjoy. It covers some of the less glamorous parts of Freddie’s life but doesn’t dwell on them, it’s been made as a celebration for everyone to enjoy, if you want a warts and all tail then there is plenty of books and documentaries out there.Go see this movie you won’t be disappointe!",
      "review_date": "2018-11-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie tries to make a caricature about the image of Freddie Mercury, treats him as a steric person and a totally different person than he was. The performance of Erick Malek was medium but in no way should he have won the Oscar. HorribleThe movie tries to make a caricature about the image of Freddie Mercury, treats him as a steric person and a totally different person than he was. The performance of Erick Malek was medium but in no way should he have won the Oscar. Horrible Movie !!!!",
      "review_date": "2019-02-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Bohemian Rhapsody is a true masterpiece, even if it has some non truth in it. Rami Malek does a brillant job as Freddie!  I don't care what does the critics says, every Queen fan will like it.",
      "review_date": "2018-11-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's a kind of magic. Bohemian Rhapsody makes up for its lack of depth and accuracy with rocking rollicking entertainment. Yes! a film that is actually entertaining, a rarity these days. Rami Malek's performance as Queens frontman FreddyIt's a kind of magic. Bohemian Rhapsody makes up for its lack of depth and accuracy with rocking rollicking entertainment. Yes! a film that is actually entertaining, a rarity these days. Rami Malek's performance as Queens frontman Freddy Mercury is pitch perfect. If your a fan of Queens music, go see it. If you do see it, see it in IMAX.",
      "review_date": "2018-11-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The cast of this movie did a fantastic job in capturing each character's charisma!  I heard Brian May a few years ago on an interview saying how each member contributed to their song-writing - and this is so well displayed in the movie.  ItThe cast of this movie did a fantastic job in capturing each character's charisma!  I heard Brian May a few years ago on an interview saying how each member contributed to their song-writing - and this is so well displayed in the movie.  It takes a lot of talent to portray a character like Freddy Mercury - and Rami Malek does an excellent job. As I read the negative comments, I am shaking my head because if you like Queen and their music, you will love this movie.",
      "review_date": "2018-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Academy Award performance by Romy Malek. Amazing look at an extraordinary man. Brilliant musical scenes. I loved it! No idea what all the criticism is about- He was portrayed as a brilliant beyond talented confused and passionate flawed andAcademy Award performance by Romy Malek. Amazing look at an extraordinary man. Brilliant musical scenes. I loved it! No idea what all the criticism is about- He was portrayed as a brilliant beyond talented confused and passionate flawed and wonderful human being! Well done!!! A Must See for music lovers!",
      "review_date": "2018-11-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was so disappointed... and i am not even a big queen's fan.The movie is full of very bad dialogues, and also editing is not so good.Rami Malek's freddie is somehow caricatural...:-/",
      "review_date": "2019-01-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If ever Disney decided on making a rock biopic this would be it; a sanitized fairy-tale about one the greatest rock bands and frontmen in  history. Neither good or bad the film crafts their greatest hits and Wikipedia facts into one easy toIf ever Disney decided on making a rock biopic this would be it; a sanitized fairy-tale about one the greatest rock bands and frontmen in  history. Neither good or bad the film crafts their greatest hits and Wikipedia facts into one easy to swallow happy meal. Big on nostalgia, a bit short on the actual  grit that goes in to becoming a band of such magnitude.",
      "review_date": "2019-04-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Critic reviews who moan about it not being 100% factually accurate, clichés or parts of the story that could have been expanded on are missing the point or taking things too seriously; Bohemian Rhapsody (like the band it's self) is justCritic reviews who moan about it not being 100% factually accurate, clichés or parts of the story that could have been expanded on are missing the point or taking things too seriously; Bohemian Rhapsody (like the band it's self) is just outrageous, joyful entertainment with pitch perfect performances and breath taking concert scenes that almost make you feel like you're there. You'll laugh, cry and cheer. It may even make you sing and dance!",
      "review_date": "2018-11-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Bohemian Rhapsody is quite a dissappointment. The music is the only thing worth listening to and there's just not enough of it. The portrayal of Freddy Mercury is seriously off and the movie falls flat because of it. It's like the survivingBohemian Rhapsody is quite a dissappointment. The music is the only thing worth listening to and there's just not enough of it. The portrayal of Freddy Mercury is seriously off and the movie falls flat because of it. It's like the surviving band members want to put Freddy down after having lived in his shadow during the meaningful part of their carreers. While some of what we see may be true, it does not make the movie enjoyable to watch. The historical inaccuracies make everything you see highly questionable. Telling their truth and then telling things that are blattantly wrong do not go well together.I can't believe all these 10's in the User ratings. These inflated user ratings undermine the credibility of the site.",
      "review_date": "2019-05-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Malek does a fantastic job but he's not good enough to carry the film on his own. It very much does downplay his sexuality and they certainly do take quite a few \"liberties\" by twisting what really happen in order to fit a better storytellingMalek does a fantastic job but he's not good enough to carry the film on his own. It very much does downplay his sexuality and they certainly do take quite a few \"liberties\" by twisting what really happen in order to fit a better storytelling narrative, Which is quite annoying and disappointing considering how well known Freddie's story is.And there really is no sense of drama in this movie. It doesn't come off as emotional or captivating. It can be entertaining enough to sit through but I feel like it just doesn't do Freddie Mercury justice in telling his life story as they really just glance over his upbringing and his rise to fame in face of just short snippets of their famous songs.",
      "review_date": "2019-01-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Rami Malek's show-stopping performance is capable, on its own, of lifting up a biopic that somehow lacks when it comes to screenplay and direction. This one is sure to please Queen fans all around the world, and will definitely make the bandRami Malek's show-stopping performance is capable, on its own, of lifting up a biopic that somehow lacks when it comes to screenplay and direction. This one is sure to please Queen fans all around the world, and will definitely make the band a lot more accessible to new generations. Amazing film.",
      "review_date": "2018-11-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Considering how many issues I actually had with this film, it feels odd giving it as high of a score as this. Maybe that's the power of music and seeing the legends behind some of the best music of all time onscreen for the first time. RamiConsidering how many issues I actually had with this film, it feels odd giving it as high of a score as this. Maybe that's the power of music and seeing the legends behind some of the best music of all time onscreen for the first time. Rami Malek's performance and the music alone honestly allow me to look past the film's many flaws (the sanitized feel, the cliches, the blatant falsehoods/omissions in the narrative). But it's the earnest approach, though, that really won me over in the end. This is a great time and an easy listen overall. Good stuff.",
      "review_date": "2018-11-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Bohemian Rhapsody has some fails, but nothing that gets close for its biggest defect: it's absolutely innocuous. Based in ascension-decadence-ascension (although Freddie Mercury's death), movie's formula couldn't be more basic. Some dataBohemian Rhapsody has some fails, but nothing that gets close for its biggest defect: it's absolutely innocuous. Based in ascension-decadence-ascension (although Freddie Mercury's death), movie's formula couldn't be more basic. Some data about band's origins and dates are wrong, formulaic image of bigger-than-world ego about Freddie Mercury are some example of mistakes. In another side, soundtrack is excellent (obviously Queen's songs) and movie can holds viewer and somehow teases its curiosity. Between mistakes and goals, almost everything are submerse in a kind of plot indefatigably repeated by cinema's industry.",
      "review_date": "2019-02-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was a pretty fun biopic that greatly highlighted the life and times of Freddie Mercury and the legendary rock band Queen. However, it is a bit by the numbers in terms of a biopic and the story and pacing felt rushed at times, but RamiThis was a pretty fun biopic that greatly highlighted the life and times of Freddie Mercury and the legendary rock band Queen. However, it is a bit by the numbers in terms of a biopic and the story and pacing felt rushed at times, but Rami Malek's highly energetic and fully committed performance as Mercury greatly carries much of the film to make up for that. He's definitely what makes the film the most fun to watch. Overall, like I said, it felt pretty standard for a biopic, but that doesn't mean I didn't have any fun with it, and even if you're not a huge Queen fan, there's no denying how catchy and fun most of their songs are, so there's plenty of great things to enjoy in this film.",
      "review_date": "2018-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Awesome film. Rami deserves its Oscars. People forgot how awesome Freddy was, this film made a new wave of interest for Queen.",
      "review_date": "2019-02-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I have no idea why critics are giving this film such low scores. This film was just pure goosebumps throughout, especially the final 20-25 minutes.Rami Malek did a great job portraying Freddie, particularly on stage. He was a larger thanI have no idea why critics are giving this film such low scores. This film was just pure goosebumps throughout, especially the final 20-25 minutes.Rami Malek did a great job portraying Freddie, particularly on stage. He was a larger than life kind of guy and the film portrays that well.The rest of the cast is excellent and everyone does a fine job in the more dramatic moments of the film.And well the music stands out of course, It's Queen, what's not to love?Any Queen fan will get a kick out of this film, whether you are a casual or die hard fan.",
      "review_date": "2018-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I loved this movie!  Freddie Mercury was a unique and fascinating person with a talent for innovation In music.  Rami Malek is superb as Mercury and I thought the story was so interesting.  Loved nearing the music of Queen and learning theI loved this movie!  Freddie Mercury was a unique and fascinating person with a talent for innovation In music.  Rami Malek is superb as Mercury and I thought the story was so interesting.  Loved nearing the music of Queen and learning the backstory of how the group came to be and how it evolved into being one of the biggest groups of its time.  The supporting cast was all terrific and I really enjoyed this movie.  JUSt wish it didn’t have to end the way it had to.  Heartbreaking.",
      "review_date": "2018-11-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I really enjoyed this film, the casting is one of the best i've seen in a while, but i found so many mistakes in this film that I can't give it a better user score, I found the characters so underdeveloped,and the story too \"happyish\" to beI really enjoyed this film, the casting is one of the best i've seen in a while, but i found so many mistakes in this film that I can't give it a better user score, I found the characters so underdeveloped,and the story too \"happyish\" to be true. If i didn't love Queen so much I don't think I would be really attached to the characters (and in this case my attachment to the characters was really reduced to Rami Malek's performance as Freddie)",
      "review_date": "2019-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "'Bohemian Rhapsody' is ... nice.  Whenever I describe something as being \"nice\" it's done through clenched teeth.  The truth is that I've never gotten over the fact that Sacha Baron Cohen was supposed to play Freddie Mercury while, in turn,'Bohemian Rhapsody' is ... nice.  Whenever I describe something as being \"nice\" it's done through clenched teeth.  The truth is that I've never gotten over the fact that Sacha Baron Cohen was supposed to play Freddie Mercury while, in turn, providing a gritty and unambiguously honest re-telling of the history of the band--warts and all.  Of course, the surviving members of Queen would have none of that, so Cohen abandoned ship and the glossy, paint-by-numbers result is what we now have to live with.It isn't all bad.  It isn't even mostly bad.  Queen's music and the concert segments are enough to power this biopic through most of my criticisms.  Furthermore, Rami Malek did a great job leading this project through to fruition (you can google how much of a disaster Bryan Singer was while directing the film, nearly de-railing it entirely).To this point, Sheila O'Malley provides a great review via RogerEbert.com in which she summarizes her feelings thusly:\"Malek taps into Mercury's ferocious energy, particularly in the concert sequences, all of which give you the electric sense of what it might have been like to be there in person. The single star of this review is for Malek's performance.\"",
      "review_date": "2018-11-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's a kind of magic...with all of the feels.It may not be absolutely accurate with the timeline and the band's history, but it is a great story. A great story backed up with a fantastic soundtrack.\n\nDespite what the critics say, this isIt's a kind of magic...with all of the feels.It may not be absolutely accurate with the timeline and the band's history, but it is a great story. A great story backed up with a fantastic soundtrack.Despite what the critics say, this is one of the rare instances where you can go to a movie and simply have a great time.Be warned though, if you're a fan there will be some real tear-jerking moments.",
      "review_date": "2018-11-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Bohemian Rhapsody is the one of the most shallow and annoying films I have seen in awhile, not to mention, factually incorrect. Just Queen fan service.37/100",
      "review_date": "2019-01-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "While not a perfect movie, the film does a good job to evoke and portray the entertainment of Queen and its frontman Freddie Mercury. The plot is generic, but the music and performances are wild and take you in from the very beginning. RamiWhile not a perfect movie, the film does a good job to evoke and portray the entertainment of Queen and its frontman Freddie Mercury. The plot is generic, but the music and performances are wild and take you in from the very beginning. Rami Malek is great at evoking the showman and entertainer that was Freddie Mercury, and the troubled, lonely man that he was behind the stage. 9/10",
      "review_date": "2018-11-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wow! It's a joy for eyes, ears and heart! Rami Malek was amazing as all the cast and sometimes you will forget that who are you seeing aren't the real Queen! This film is fantastic, one of the best movie of 2018 ❤",
      "review_date": "2018-12-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is a MESS. I did not enjoy it. Yes, the Live-Aid scenes were the only acenea that made me happy. However, this PG-13 version of Freddy is a very bad movie. There was no exposition. There was no intensity into it. The only goodThis movie is a MESS. I did not enjoy it. Yes, the Live-Aid scenes were the only acenea that made me happy. However, this PG-13 version of Freddy is a very bad movie. There was no exposition. There was no intensity into it. The only good thing about this movie, besides the Live-Aid parts, is the performances. Rami Malek is perfect. Singer is a good director, and he does well for this movie as well. However, the script is so weak. At the end of the day, I do not find this non-R-Rated movie interesting at all.",
      "review_date": "2019-02-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I've never seen a movie quite like this before, and I've seen all the music docs.  It starts out really well, and then gets incredibly boring in the middle third, before finishing in triumphant fashion. I'm not sure that moviegoers whoI've never seen a movie quite like this before, and I've seen all the music docs.  It starts out really well, and then gets incredibly boring in the middle third, before finishing in triumphant fashion. I'm not sure that moviegoers who weren't music fans during Live Aid (1985) will appreciate it nearly as much - that was an incredible day. I agree with the critics in general that the songs are pretty much the entire film.  The connective tissue between them is average at best.  This movie makes Control (the Joy Division movie) look like high art.",
      "review_date": "2018-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Awful putrid, badly directed film. Singer as a director is over. He made a great men a miserable worthlessness. Looking at it is physically painful.",
      "review_date": "2019-04-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was not a big Queen fan back in the day, but this movie converted me. Rami Malek is phenomenal, and the movie rocks. Saw it in IMAX and felt I was part of the crowd. I say it is the best rock and roll film of all time.",
      "review_date": "2018-11-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An incredibly boring film with little plot or conflict. One of the biggest disgraces to Freddie Mercury, painting him as an entitled, stubborn, and flamboyantly gay man instead of the genius that he was. Giving no insight into the band orAn incredibly boring film with little plot or conflict. One of the biggest disgraces to Freddie Mercury, painting him as an entitled, stubborn, and flamboyantly gay man instead of the genius that he was. Giving no insight into the band or anything that inspired one of the greatest discographies of one of history's greatest bands. The movie has nothing to say and plays more like a high budget Lifetime movie than a film that has earned accolades at award shows. Rami Malek embodies Mercury and is the only thing worth salvaging from an overall dreadful film.",
      "review_date": "2019-01-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a masterpiece. Rami Malek gives an excellent performance. This movie is also a good tribute to Queen.",
      "review_date": "2018-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nEXCELLENT!!!  A must see! This will win and Emmy!!!!  Rami is unforgettable!",
      "review_date": "2018-11-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What makes 'Bohemian Rhapsody' a well-made biopic is its unrestrained look at the personal life of its main character, what stops it from being a truly great biopic is its rather mellow and simple exploration of certain themes, especiallyWhat makes 'Bohemian Rhapsody' a well-made biopic is its unrestrained look at the personal life of its main character, what stops it from being a truly great biopic is its rather mellow and simple exploration of certain themes, especially since its supporting characters all feel the same just to make its central focus stand out that much more. Rami Malek portrays the musical legend Freddy Mercury in a very convincing and committed performance (one that I'm sure might even land him an Oscar nomination). He lives a very typical and peaceful life with his family and one day he goes to a college club where a band performs and he thinks he has what it takes. He meets the band members; Brian May (Gwilym Lee), Roger Taylor (Ben Hardy) and John Deacon (Joseph Mazzello) and he shows them what he's capable of. He joins the band as their lead singer, and despite his Asian background and his teeth abnormality, his image is outweighed by his charisma and lead performance to wow the crowd. Freddie believes that he can take this band further by finding them an agent and signing a record contract and giving them the ability to record any song they wish. Their ambitions are always limited whether it's because the band itself constantly disagree on many things, or that their managers and record companies say that they can't release certain songs because of many concerns including the length and confusing names that may not catch on. They come across many obstacles in their early career, but manage to get their message spread across. The film also focuses on Mercury's sexuality, as he tells his girlfrend, Mary (Lucy Boynton) that he wants to marry her one day, but she figures out time after time that he is gay. Freddie tries to deny this but he can't seem to stop himself each time he comes across a man who appreciates him for who he is. Overall, this film is great if you are a fan of Queen and are interested in the story of how they became one of the most groundbreaking bands of all time. Despite some clunky direction and maybe even some historical inaccuracies, this movie works if you really care about it. Malek shines the most as the lead singer, and the film's final act - despite a very dragging second act - is definitely worth sitting through, it's craftsmanship is amazing and you will feel like you were just a part of history. The production design and cinematography alone make this worth watching on the big screen. 'Bohemian Rhapsody' the movie may not come close to the song of a similar name, but when it gets good, it's alive.",
      "review_date": "2018-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I nearly fell asleep. How could they do this to Freddie? Its so by the books and lazy! Where is the celebration of Queen and Freddie's music? Bryan Singer needs to get his act together!",
      "review_date": "2018-11-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's really not a zero, but doing this to just offset the craze at least a bit - more like a 5/10 or soSome of the set pieces and songs are pretty good as is Rami Malek's acting, but the story, as presented, is very vanilla with noIt's really not a zero, but doing this to just offset the craze at least a bit - more like a 5/10 or soSome of the set pieces and songs are pretty good as is Rami Malek's acting, but the story, as presented, is very vanilla with no chemistry between any of the characters - it was a very forgettable movie reallyA Star is Born is a far superior film",
      "review_date": "2018-11-15",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 150,
  "genres": [
    "Biography",
    "Drama",
    "Music"
  ]
}