{
    "title": "Deadpool 2",
    "rating": 7.9,
    "release_date": "2018-05-18",
    "genre": [
        "Action",
        "Adventure",
        "Sci-Fi",
        "Comedy"
    ],
    "summary": "After surviving a near fatal bovine attack, a disfigured cafeteria chef (Wade Wilson) struggles to fulfill his dream of becoming Mayberry’s hottest bartender while also learning to cope with his lost sense of taste. Searching to regain his spice for life, as well as a flux capacitor, Wade must battle ninjas, the yakuza, and a pack ofAfter surviving a near fatal bovine attack, a disfigured cafeteria chef (Wade Wilson) struggles to fulfill his dream of becoming Mayberry’s hottest bartender while also learning to cope with his lost sense of taste. Searching to regain his spice for life, as well as a flux capacitor, Wade must battle ninjas, the yakuza, and a pack of sexually aggressive canines, as he journeys around the world to discover the importance of family, friendship, and flavor – finding a new taste for adventure and earning the coveted coffee mug title of World’s Best Lover. … Expand",
    "critic_reviews": [
        "Far from lazy, it is a fairly brilliant sendup of comic-book action movies, as well as also being an excellent example of one.",
        "The film ends on a remarkably touching emotional note. Had it held to the strength of its convictions—and it is immensely obvious why it did not—it might have been the best ending of any superhero movie to date. (No, the bar’s not terribly high.) But it’s nonetheless awfully good, and we can still look forward to, mid-credits, the world’s best-ever Green Lantern joke.",
        "A superhero movie so tightly made and brilliantly entertaining that even Deadpool himself would have trouble finding fault with it.",
        "Deadpool 2 is wicked, dark fun from start to finish, with some twisted and very funny special effects, cool production elements, terrific ensemble work — and for dessert, perhaps the best end-credits “cookie” scene ever.",
        "Deadpool 2 throws everything it has at you until you throw your arms up in happy surrender.",
        "Is Deadpool 2 obnoxious? Is it needlessly self-aware? Is it drunk on its own fairly tame naughtiness? Is it so stuffed full of unrelated pop culture references that it sort of feels like a meme shirt come to life? The answer to all those questions is a resounding yes, but it’s also, weirdly, refreshing.",
        "Deadpool 2, while extremely thin on plot, is gleefully impish, entertaining and often laugh-out-loud funny. Almost everything that felt forced, crass and hamfisted in the original film now feels organic and effortless; a constant breezy stream of gags, quips and expertly choreographed action. Deadpool 2 is filthier, funnier and ferociously manic.",
        "The result isn't as novel as the original, or as effortlessly kinetic, but it is nevertheless a joke-packed action film that continues to deliver on the character's potential, while opening up the door to an even bigger series of sarcastic superhero adventures.",
        "Infinity War will likely be first choice for the summer season crowd, but Deadpool 2 wins hands down in terms of personal stakes and visual flair.",
        "This is the rare comedy sequel that doesn’t just equal the original: it betters it, with bells and ball-sacks on.",
        "Right now, he's the perfect \"Avengers\" antidote.",
        "Deadpool 2 is, above all else, a lot of fun. (And yes, you must stay for the post-credit scenes.) Sometimes it maybe doesn’t take itself seriously enough (after about the 50th crack you do kind of want to tell Reynolds to hold off for a minute). But in a genre that takes itself so deadly seriously, this is like a breath of fresh air.",
        "Funnier, filthier, and damn entertaining, Deadpool 2 leaves no stone un-deconstructed: the naughty man-child of the X-Men universe who manages to beat them at their own game.",
        "There's action aplenty throughout the film, but Deadpool 2 doesn't bog down in it as many overcooked comic-book sequels do. With Reynolds' charismatic irreverence at its core, the pic moves from bloody mayhem to lewd comedy and back fluidly, occasionally even making room to go warm and mushy.",
        "Despite the character’s trademark flippancy, there’s a real unexpected warmth to Deadpool 2. Not only does the sequel explore this flawed character, it firmly establishes him as a loveable and effective hero.",
        "The film’s greatest asset is Reynolds, who in Deadpool finally found the role of his dreams. Reynolds totally sells the character’s blend of reckless self-absorption and reluctant heroics.",
        "Here, Leitch uses brevity to do for witty action what it famously does for wit alone.",
        "The bottom line is that viewers who enjoyed Deadpool will almost certainly enjoy Deadpool 2, although perhaps not quite as much.",
        "After shooting lots of people and cutting lots of throats, Deadpool tries blowing himself up, something he probably should have done first. And with that, the movie shifts. Deadpool 2 becomes less violent and a lot funnier. It becomes a much better movie than the original “Deadpool,” not an action bloodbath with laughs, but a knowing spoof of the superhero genre.",
        "If you’ve got comics-movie fatigue, with frequent fourth-wall breaks to point out lazy writing, blatant foreshadowing or heavy reliance on CGI for fight scenes, Deadpool 2 is here for you. That doesn’t mean those things aren’t there (they are) — but the eagerness of Deadpool to call out its own shortcomings earns this trash-talking franchise a lot of goodwill.",
        "Deadpool 2 is chock-full of all the cartoonish ultraviolence, meta commentary and pop-culture references you’d expect. Where it surprises — and why it works so well — is how it balances an actually touching undercurrent alongside superhero subversiveness.",
        "Reynolds is once again at his arch and nihilist best here, while acting and jumping in so much facial prosthetics that it makes him look like he’s inside melted cheese — or, as the first movie put it, an avocado that had relations with an older avocado.",
        "It’s in Deadpool’s DNA to channel the wild id of a 12-year-old boy — a very clever one who happens to love boobs, Enya, and blowing stuff up. Which is dizzy fun for a while, like eating Twinkies on a Gravitron. Eventually, though, it just wears you out.",
        "Deadpool 2 is just like “Deadpool” only more so. It’s actually a fair bit better — funnier, more inventive than the 2016 smash...and more consistent in its chosen tone and style: ultraviolent screwball comedy.",
        "Like so many franchise-starting first films, “Deadpool” had to push through some necessary evils to get to the good stuff, fortunately, all that subversive goodness is on wild display in Deadpool 2, which delivers on the promise of the first film (and more).",
        "Does Deadpool 2 pick up its predecessor’s baton and run off to new and exciting places? Not really. Is it as tasty as leftovers on the second day? Absolutely. Temper your expectations accordingly.",
        "Deadpool 2 gets by as simply on a par with “Deadpool,” an ultra-violent joked-up Energizer Bunny of a comic book movie with a fun supporting cast, dead-pan deaths and deadpan Deadpool jokes about those deaths.",
        "Deadpool 2 is at its best when it cheerfully doesn’t give a shit. The more it cared, the less I did.",
        "Deadpool 2 is an overstuffed cinematic burrito of raunchy insults, dismembering violence and a \"no f#*ks given\" attitude that's ready to burst at any second, but somehow holds together bite after enjoyable bite.",
        "In almost every respect, this sequel is an improvement on its 2016 predecessor: Sharper, grosser, more narratively coherent and funnier overall, with a few welcome new additions. It’s a film willing to throw everything — jokes, references, heads, blood, guts and even a little bit of vomit — against the wall, rarely concerned about how much of it sticks.",
        "It all boils down to one important fact: Reynolds gets these comics.",
        "It still works. Maybe not as well, since the element of shock and awe can’t be put back into its bottle, but anyone who enjoyed Wilson’s transformation into a bullet-hole-riddled leotard that can’t shut up should have as much fun.",
        "Though bringing in a bona fide action-cheese aesthete like David Leitch (Atomic Blonde, John Wick) to direct counts as a minor coup, Deadpool 2’s attempts to fight superhero fatigue with self-awareness and meta shock value can become exhausting. Indulgent and uneven, but in spots gruesomely funny, the new film badly lacks the basic momentum of the original’s formulaic plot.",
        "Deadpool 2 is very good at what it does, which is flattering the audience into feeling like it’s in on the joke. If you’re a doubter, though, you may wonder if the joke’s on us.",
        "Since Deadpool 2 shows no sign of wanting to rewrite a whole genre with its audacity, we might as well concede that it does the job it apparently wants to do with professionalism and flair, and that the faster we end this piece, the faster you can go on social media and complain about it.",
        "The original “Deadpool” caught lightning in a bottle. The sequel sparks only intermittently.",
        "The fight sequences aren’t as good as director David Leitch’s previous work like Atomic Blonde and the John Wick movies, but it’s better than the standard superhero fare, with enough clever touches to keep things interesting.",
        "There is something ever so slightly dishonest about this character, something false about the boundaries drawn around his sadism and his rage. Deadpool 2 dabbles in ugliness and transgression, but takes no real creative risks.",
        "Perhaps it’s the effort of introducing so many new characters that has sucked out the spontaneity from Deadpool: still, it’s nothing that can’t be sorted for the likely next installments.",
        "The movie’s other major weakness is its continued foregrounding of the white guys at the expense of the consciously inclusive cast around them.",
        "With its uncompromising commitment to gross-out injuries, nerdy pop culture in-jokes and inappropriate touching, Deadpool 2 was clearly made to cater to existing fans with every innuendo-filled moment (they should stay through the credits for some important story points that are very nearly thrown away).",
        "Deadpool 2 likes to situate itself as the subversive alternative to so many bloated X-Men films, with all their grave self-importance and bombastic action, but even more of this go-around resembles those movies than its predecessor, and if it reads to you as more than a bit hypocritical, just know you’re hardly alone.",
        "In Deadpool 2, the manic antics fly fast, but the franchise loses its edge as wise-cracking antihero Deadpool goes dadcore, attempting to infuse standard-issue four-quadrant studio blockbuster beats into what was once a revolutionary R-rated premise.",
        "Rather than face its own moral incoherence, Deadpool 2 blinks.",
        "Deadpool 2 muddies the distinction between parodying comic-book-movie conventions and perfunctorily adhering to them.",
        "Never before have the demands of my inner man-child been so stirred, though, than while experiencing Deadpool 2, a movie that feels scribbled in pencil crayon, drenched in Jolt cola and coated with the dust of a thousand discarded bags of Flamin’ Hot Cheetos.",
        "Not too far beneath the movie’s superficial abrasiveness is a desperate desire to be loved, a puppyish determination that is both hard to resist and, eventually, difficult to endure.",
        "There’s no other way to put this: Deadpool 2 is a regular, shmegular superhero movie, distinguished only by an obnoxiously unearned dose of “see what I did there?!” It’s a drag.",
        "It’s a long movie and when its star isn’t on screen and cracking wise, the boundary-pushing shocks and endless self-references wear thin. Still, if you’re the Deadpool fanatic who recently had Reynolds’s name tattooed on his arse, you definitely won’t be grumbling.",
        "We’ve reached superhero saturation point, and Deadpool 2 is less a satire of that condition than a symptom of it. It has zero suspense — it’s too hip, too meta, for suspense.",
        "It’s overstuffed, and essentially empty."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "Simply better than the first movie, and even better than Infinity War in my opinion, great movie, great over the top FX, great story with unexpected twists, hilarious jokes and very positively surprised!",
            "review_date": "2018-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Overall, Deadpool is a hilarious, over the top, self aware movie that has the best after credits scene i have ever watched. With the pressure of making a movie better than the 2016 adaptation, i could tell they wanted to make it moreOverall, Deadpool is a hilarious, over the top, self aware movie that has the best after credits scene i have ever watched. With the pressure of making a movie better than the 2016 adaptation, i could tell they wanted to make it more everything than the first movie, and it most ways they did. The gore is kicked up a notch, the humor is on point, and i never got bored when watching this movie. The cast did a great job brining their characters to the big screen. Most especially domino, Zazi beetz does a great job playing the lucky badass all throughout the movie. Its great to see colossus and negasonic teenage warhead back but i feel like i could've seen a little more of her. But cable is in a league of his own. Josh brolin does an amazing job playing the badass super soldier. But the one thing this movie has a problem with is its mood and pacing, at some points it tries to be romantic but it just made me feel awkward watching this with my parents next to me. same thing with the pacing at times. But those are just small points that dont affect how i feel about this movie and i believe deadpool 2 was well worth the wait and was everything i wanted the movie to be and more. But is it better than the first? In my opinion it is in most ways, but i feel like their are more iconic scenes in the first deadpool than in the second. But no matter what i say, If you have the time, i highly recomend you watch this over the top \"family\" movie.",
            "review_date": "2018-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ryan Reynolds has made a career for himself by playing Ryan Reynolds in literally every movie he's ever been in. And by being handsome. Mostly the handsome thing. It never won him much critical praise though until he started playing theRyan Reynolds has made a career for himself by playing Ryan Reynolds in literally every movie he's ever been in. And by being handsome. Mostly the handsome thing. It never won him much critical praise though until he started playing the character of Deadpool. Who, as the comics will tell you, is actually just Ryan Reynolds. So kudos to him for finally finding a way to make that work and getting that superhero franchise he's tried umpteen times for.Deadpool 2 is more of the same with tons of callbacks to the previous film. I kind of wish they would ditch the sentimentality and just go full on superhero farce already. The cliché emotional stuff with Morena Baccarin is easily the least interesting part of the whole thing. The movie is at it's best when it's delivering more of the crude, irreverent humor and gleefully gratuitous violence of it's predecessor. Luckily, that's what it spends most of it's time doing.Nearly every bit of pop culture you could think of gets skewered here. Especially other superhero movies. Deadpool once again did a way better job of having the characters operate like the do in the comics than any of the main X-Men films ever have. Even to the point of fixing another tragically mishandled fan-favorite villain. It's also still very refreshing to experience a superhero film make such liberal use of gore, heavy profanity, and killing. Let's hope Disney and Marvel take some notes from what Fox was able to achieve by making R-rated cape and costume flicks now that they've recovered their long absent mutants. Oh, and that they keep Reynolds around.Deadpool 2 doesn't really take it's title character in any new directions or branch out from what the previous film did much at all. And it didn't really need to. The first Deadpool was such a breath of fresh air (even in spite of sticking close to origin story conventions) that a second helping feels like exactly what we needed. Especially since round two might actually be a bit funnier. Let's also not forget how it's one of the best Fox movies at doing the comics justice. Even the X-Men films I've really liked have managed to butcher a character in one way or another. Deadpool 2 gets them all right and limits it's use of the overexposed Wolverine to a few well-placed jokes.8.6/10",
            "review_date": "2018-09-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I didn't expect a film as good as the first one, and in some ways it wasn't - a few gags were overcooked (notably the 'proposition' one - but for most of the running time my wife and I were laughing constantly and loving the action. VeryI didn't expect a film as good as the first one, and in some ways it wasn't - a few gags were overcooked (notably the 'proposition' one - but for most of the running time my wife and I were laughing constantly and loving the action. Very close to GotG as the best \"funny\" Marvel movie to date.",
            "review_date": "2018-06-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "All the pre-screening reviews: don't believe any of 'em. Fox did an awesome job making sure the finalized cut released to the public is rock solid (unlike, you know, DC/Warner Bros.). I will say this: I think this one is better than theAll the pre-screening reviews: don't believe any of 'em. Fox did an awesome job making sure the finalized cut released to the public is rock solid (unlike, you know, DC/Warner Bros.). I will say this: I think this one is better than the first. It's very entertaining, with all the layers of humor and quips we expect from Deadpool. If you have any interest at all, it's totally worth the money.",
            "review_date": "2018-06-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Action packed and funnay A.F!  Many nods to various Heroes and villains in the Marvel universe.  Biggest complaint is the first quarter is a bit slow...  But picks up fast.  If your a fan of the first movie see it!",
            "review_date": "2018-06-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Deadpool is its own genre of movie - action/comedy/commentary, oh, and foul, foul language, my god, it's like over the top with the most foul of them. So though it's an \"R\", there should be a lower limit of age 14 due to language and so muchDeadpool is its own genre of movie - action/comedy/commentary, oh, and foul, foul language, my god, it's like over the top with the most foul of them. So though it's an \"R\", there should be a lower limit of age 14 due to language and so much massive amounts of gratuitous death and dismemberment. Seriously, there's a portion of the public that may need trauma therapy after viewing this. Anyway, it's a heck of a fun ride. Ryan's snarky commentary throughout is funny but it's uneven because he doesn't apply it to his love scenes with Vanessa (Morena B), but that's a minor nit that's certainly offset by so many other areas of strength. TJ Miller is always a comedic treat, just saw him in \"Ready Player One\" last night, too. And the character \"Domino\" made for some entertaining moments with her super ability of \"luck\". A fun, solid \"9\" of a movie - and I don't hand those out often.",
            "review_date": "2018-08-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I laughed alot.  I wish I had laughed more.   Two of the set pieces had me rolling on the floor with the best comedy in a movie I've seen in a long time.   Overall, I think they risk making him too lovable though",
            "review_date": "2018-06-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "So many aspects of this movie i liked1. Great writing and jokes. I found my self howling most of the time\n2. ORIGINAL. So nice to watch a marvel movie that doesnt kind of put me to sleep.\n3. Soundtrack. Feels like deadpool is creating theirSo many aspects of this movie i liked1. Great writing and jokes. I found my self howling most of the time2. ORIGINAL. So nice to watch a marvel movie that doesnt kind of put me to sleep.3. Soundtrack. Feels like deadpool is creating their own style in the midst of a 80s obsessed era.Deadpool is also an example of a movie that relies heavily on CGI but does so in a way that still keeps you engaged and entertained rather than desensitized... if you know what i mean Overall i loved this movie and it deserves your hard earned money :)",
            "review_date": "2018-05-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Infinitely better than the original. Reynolds has upped the ante and the result is a far funnier action movie. The story is just as generic and predictable as the first. For fans of the original or even new comers this movie is a blast!",
            "review_date": "2018-06-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I loved the first one a lot, and believe it or not, I love this one a lot more!",
            "review_date": "2018-08-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Deadpool 2 is a worthy sequel to the original movie. New director David Leitch (of John Wick fame) makes Deadpool 2 feel like an actual John Wick movie from time to time. Ryan Reynolds is again great in the role of Wade Wilson (aka Deadpool),Deadpool 2 is a worthy sequel to the original movie. New director David Leitch (of John Wick fame) makes Deadpool 2 feel like an actual John Wick movie from time to time. Ryan Reynolds is again great in the role of Wade Wilson (aka Deadpool), but this time his character takes a bit of a backseat because there are Cable, Domino, the fat kid, and other characters fighting for screen-time, and even taxi driver Dopinder becomes a bit annoying. Still there is a lot of humor, plenty of situational jokes (some of them targeting the cinematic universes of both DC and Marvel, as well as the X-Men film series and Disney which are about to acquire 20th Century Fox) and many awesome action scenes that can only be found in a Deadpool movie. This time Wade Wilson/Deadpool's character actually develops a bit more, thanks to his girlfriend Vanessa and the quest to save the fat kid. To top it off, there is an awesome mid-credits scene that literally blasts everything off. Just be wary of a few gory scenes in the film though, which are lifted straight from the Deadpool comics.",
            "review_date": "2018-06-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A worthy successor to the original, yet not as refreshing and vibrant, Deadpool 2 is the best possible sequel for the merc with a mouth. With a noticeably higher budget, the multitude of action sequences are more absorbing than the first (asA worthy successor to the original, yet not as refreshing and vibrant, Deadpool 2 is the best possible sequel for the merc with a mouth. With a noticeably higher budget, the multitude of action sequences are more absorbing than the first (as one could guess with the addition of David Leitch as director). Said action is balanced with an abundance of jokes and fourth-wall breaks, which are as strong as ever, and cement Ryan Reynolds as a comedic master. But what’s more impressive is the ensemble surrounding him, which handles the balance between intensity and hilarity flawlessly. The villain in Cable is a near-perfect representation of the character, and Josh Brolin brings his A-game. Where the film faults, though, is its story, which is seemingly over-convoluted when compared to the genius simplicity of its predecessor. A lack of motivation for the events taking place on screen, besides the fact that they’re funny as hell, is kind of frustrating, and the poor writing choices chosen for these setups serve as through away jokes (as referenced by the merc himself). But in the end, Deadpool 2 knows what it is, and uses that to its advantage when creating some of the funniest sequences ever put to film.",
            "review_date": "2018-06-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I'll be the first to admit that I was not expecting much when entering the theatre for this movie. As we all know, sequels can and usually are just...eh. This movie surprised me with its current jokes and vibrant cast. I don't want toI'll be the first to admit that I was not expecting much when entering the theatre for this movie. As we all know, sequels can and usually are just...eh. This movie surprised me with its current jokes and vibrant cast. I don't want to say/talk about any of those jokes for spoiler reasons. The part in which I did not like was the mid-credit scene. Something happens in it which kind of makes the entire movie pointless. It confused me and left me wishing that it never happened. The cast/acting was great and the jokes were on point so I'll give this movie an 8.5. Since I had a great overall movie experience when seeing this, I've decided to round up to a 9. Marvel fans who liked the first one should see it, but do not bring your kids. The jokes are as raunchy as they come. That's not a fault... that is just Deadpool.",
            "review_date": "2018-05-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ha ha ha oh my god this movie was hilarious. Jokes were so good I couldn't stop laughing at the times. Brilliant movie, Ryan Reynolds is absolutely fantastic. You need to watch previous DC/Marvel movies to get the jokes though but I believeHa ha ha oh my god this movie was hilarious. Jokes were so good I couldn't stop laughing at the times. Brilliant movie, Ryan Reynolds is absolutely fantastic. You need to watch previous DC/Marvel movies to get the jokes though but I believe most people seen them anyway. Highly recommended.",
            "review_date": "2018-06-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Deadpool 2 is a movie for Deadpool fans, a lot of the hand-holding in the first movie is is not here. Many of the references in the film are from the Deadpool universe so much so that they will go over most people's head.  the action is thereDeadpool 2 is a movie for Deadpool fans, a lot of the hand-holding in the first movie is is not here. Many of the references in the film are from the Deadpool universe so much so that they will go over most people's head.  the action is there the jokes are there the entertainment is there. Deadpool 2 builds up on the first movie in the lot of good ways and then not some good ways. if you are a fan of the Deadpool character you owe it to yourself to see this movie if you are only a fan of the first Deadpool movie you may not like the left turns taken in this movie",
            "review_date": "2018-06-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "DP 2 was a cool and fun movie. Funny but also emotional in many ways. The story is pretty good and it starts very strong. Domino was for me the best part of the movie. Interesting acting for that character. Cable was easy to relate. TheDP 2 was a cool and fun movie. Funny but also emotional in many ways. The story is pretty good and it starts very strong. Domino was for me the best part of the movie. Interesting acting for that character. Cable was easy to relate. The action is well displayed with good timing and the CGI got much better. I think most of the budget went there...More Xmen jokes, maybe because of the Xforce team. And don't miss the end credits, it's a blast. I give it a 85%. This isn't the movie for peoples that never saw a superheroes movie. There is a lot of reference and jokes about them.  Maximum effort.",
            "review_date": "2018-05-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie was very therapeutic for my support pug, which I no longer need as Wade has fixed my PTSD from the several terrible movies Ryan Reynolds forced down our throats and not in the fun, feel it in your fluffy bunny slippers, kind ofThis movie was very therapeutic for my support pug, which I no longer need as Wade has fixed my PTSD from the several terrible movies Ryan Reynolds forced down our throats and not in the fun, feel it in your fluffy bunny slippers, kind of way. I might be able to tolerate maple syrup during sex again. Thank you Deadpool!",
            "review_date": "2018-05-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Fun and enjoyable. Some of the jokes did not mix well with the serious story.",
            "review_date": "2018-05-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Better than the first, I thoroughly enjoyed it and laughed throughout. Cable was my absolutely jam.",
            "review_date": "2018-05-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "\"Deadpool 2\" is a worthy sequel to the first Deadpool but with just a smidge less. Once again, Reynolds proves himself the best fit for the character with plenty of laughs to go around. But what holds the film back is it's uneventful plot and\"Deadpool 2\" is a worthy sequel to the first Deadpool but with just a smidge less. Once again, Reynolds proves himself the best fit for the character with plenty of laughs to go around. But what holds the film back is it's uneventful plot and lack of villain. I walked out not disappointed nor blown away.",
            "review_date": "2018-05-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Deadpool 2 is fun, entertaining and has an emotional touch to it. However, it seems to me what the whole movie eventually wraps around one simple mediocre and foreseeable message. On the other hand, this movie is a good comedy withDeadpool 2 is fun, entertaining and has an emotional touch to it. However, it seems to me what the whole movie eventually wraps around one simple mediocre and foreseeable message. On the other hand, this movie is a good comedy with interesting characters. I wouldn't say that this movie is a worthy sequel but it isn't a bad movie either.",
            "review_date": "2018-05-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's a very good film, in my opinion not better then the first one. Some parts of the movie I found a bit underwhelming, but humor is again at it's best.Colossus owned in this movie! :)",
            "review_date": "2018-05-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "My expectations for Deadpool 2 started out fairly modest because I wasn't sure if it could live up to how fun and unexpectedly good the first one was, but as more and more of my friends saw it my expectations started to rise. And, I had aMy expectations for Deadpool 2 started out fairly modest because I wasn't sure if it could live up to how fun and unexpectedly good the first one was, but as more and more of my friends saw it my expectations started to rise. And, I had a great time watching it. I do think that the first one is better, but overall I think I may have enjoyed this one more. It's kind of weird. Story: The story of the Deadpool 2 is definitely more complex than the first one (although it does essentially boil down to \"Guy from future wants to kill kid, Deadpool no like that\"), and as a result I did find myself more invested in it than the first one. It seemed a bit more serious and the stakes did seem higher. It really is a paint by numbers superhero story, but it completely works for Deadpool 2 because you could almost look at it as part of the joke that is Deadpool. He likes to take shots at superhero stuff, but he happens to be in a movie that follows the standard superhero formula. A big thing that didn't work for me story wise, and a big reason why I think that the first one is a tiny bit better, is that the kid who Deadpool wants to protect is straight up not likable. I didn't like his character, wasn't super impressed by the kid portraying the character, and honestly was quite annoyed by him any time he was on screen.Humor: This is where it gets weird. I found Deadpool 2 to be funnier than Deadpool, but I feel like Deadpool 2 overcooks it a bit with the comedy. There was a point in the movie where it felt like it was just constantly pelting me with jokes, and not all of them landed. So while I found it incredibly funny overall, I think it could have benefited from toning down the number of jokes by just a smidge.Acting: Ryan Reynolds is Deadpool. That's all that really needs to be said. Overall: Deadpool 2 is a solid movie and a worthy sequel to Deadpool, although it may not be quite as good.",
            "review_date": "2018-05-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Loved it much more than the first movie. With better story, better humor, better visuals and action scenes, Deadpool 2 is a great comic book movie that delivers lots of fun. Post-credit scene is a freaking masterpiece. And despite that myLoved it much more than the first movie. With better story, better humor, better visuals and action scenes, Deadpool 2 is a great comic book movie that delivers lots of fun. Post-credit scene is a freaking masterpiece. And despite that my favourite 2018's comic book movie is still Infinity War, DP2 came very close to it. Can't wait for DP3 and X-Force!",
            "review_date": "2018-05-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Deadpool 2 is more of the same; more action, more humour, more banter.  Yet it lacks the 'energy' of the first one, settling itself into a comfortable position of a 'summer blockbuster'.  It's throw everything but the kitchen sink approachDeadpool 2 is more of the same; more action, more humour, more banter.  Yet it lacks the 'energy' of the first one, settling itself into a comfortable position of a 'summer blockbuster'.  It's throw everything but the kitchen sink approach works sometimes: but jokes felt flat, some elaborate set pieces don't work as well as before.  It's telling when the funniest jokes are the ones in the post ending credit and its own brilliant marketing.",
            "review_date": "2018-06-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "“I’m Batman”‘Deadpool 2’ is a massive improvement over the first in terms of film making and having more freedom to go balls to the wall. Not feeling so contained. Having more laughs and soul in this serious drama about the ‘F’ word. Well“I’m Batman”‘Deadpool 2’ is a massive improvement over the first in terms of film making and having more freedom to go balls to the wall. Not feeling so contained. Having more laughs and soul in this serious drama about the ‘F’ word. Well that’s what Deadpool thinks. A lot more ruthless when referencing other movies or other source materials surrounding this movie.Now my main issue from the first movie is how colorless and bland the film making was. Something lacking or anything stuck out as memorable in terms of visual comedy. This time it’s directed by David Leitch, best known for John Wick and Atomic Blonde, who added a lot of his mystical tricks into this. How Leitch filmed the action scenes was slick and flowed smoothly. Especially in the musical numbers (played for comedy) that plays along during those sequences as a parody for blockbusters trying to be serious. Also not forgetting the truck chase.Ryan Reynolds returns as the mouth taking anti-hero, but more crude and plenty of fourth wall breaking to go around. It’s clear from interviews and the behind the scenes that Reynolds is having an absolute blast playing this role. Probably the most fun he’s ever had. Taking past failures into account for humor and doesn't waste time to erase them. Reynolds once again captures the character in spirit through his sharp line delivery and comedic timing. But also giving the character heart by showing a softer side, which stops him from being annoying.Josh Brolin is having such a great year it’s unbelievable. First ‘Infinity War’, than this, and Sicario 2. I've never seen an actor who’s been in three movies within three months back to back. His physical work and keeping up the straight man phase throughout also adds to the comedy. Never cracking a smile and keeping up the ‘tough guy’ appearance. He commands the scene whenever he appears on screen. Brolin delivers a great performance, what’s new?While the achievements deserves it's praise, but please keep in mind it’s not perfect by any mean, like a masterpiece level. It’s freaking stupid if you ask me. Some of the CGI looked a bit noticeable and since there’s a lot of jokes, not all land. While all the actors played the parts well, small or big, were excellent either way and have such great chemistry with each other. Unfortunately the same couldn't be said about T.J Miller who was one of the worst parts of the movie. The running gag of “You look like an avocado had sex-” or “you look like Freddy Krueger **** a topographical map” was never funny in the first place. Glad he’s screen time was short. I really hope they kill his character off in the next one, which seems more possibly if you heard the recent news surrounding the actor. Or knowledge his absence.Other than that, Deadpool 2 is an extremely enjoyable film that succeeds and falls short in certain areas. If you like the first, then you will or probably have enjoyed this. For me, I was laughing and smiling for 2 hours.Overall rating: Zazie Beetz and Rob Delaney are national treasures.",
            "review_date": "2018-06-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Deadpool is back in the big screen and he's funnier than he already is in his first theatrical film. Like the first movie, Deadpool 2 can literally only work if you laugh at its idiotic, fourth wall-breaking humor (which is what Deadpool isDeadpool is back in the big screen and he's funnier than he already is in his first theatrical film. Like the first movie, Deadpool 2 can literally only work if you laugh at its idiotic, fourth wall-breaking humor (which is what Deadpool is always known for and it needs to always work to make Deadpool humor literally Deadpool humor). I'm not saying you should laugh at 100% of its humor, but at least 60% or higher of its humor. Of course if that isn't your cup of tea, there's always tons of action to come along with the humor (because it's Marvel). Undeniable flaws from the first movie returns, but can thankfully be ignored by its action and humor which shines just in time before the first flaw can even get reached.",
            "review_date": "2018-07-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I wasn't expecting to enjoy this movie as much as I did. Deadpool 2 has a pretty rocky start, the first 20 minutes were straight up hard to enjoy and made me worried for the rest of the film. After the first act the real plot kicks in andI wasn't expecting to enjoy this movie as much as I did. Deadpool 2 has a pretty rocky start, the first 20 minutes were straight up hard to enjoy and made me worried for the rest of the film. After the first act the real plot kicks in and things get into a really good groove. This sequel is not as fresh or in a sense special as the original Deadpool was, but it made up for it in its wonderful action set-pieces and the addition of some pretty great new characters (Cable, Domino and Peter) with the glorious return of Colossus. So all in all I'd say that Deadpool 2 has the same good and bad qualities of its predecessor (fun as balls with humour that's equally hilarious as it is forced wrapped in a pretty conventional plot), but DP 2 has a more interesting story and overall I'd say it's more rewatchable. It's quality entertainment.",
            "review_date": "2018-05-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "When considering ‘Deadpool 2,’ there hasn’t been another superhero sequel as good if not better than the original since Christopher Nolan flexed his muscles in the genre with ‘The Dark Knight.’The main body of ‘Deadpool 2’ blends togetherWhen considering ‘Deadpool 2,’ there hasn’t been another superhero sequel as good if not better than the original since Christopher Nolan flexed his muscles in the genre with ‘The Dark Knight.’The main body of ‘Deadpool 2’ blends together the action, plot and soundtrack to such a high degree that it’s virtually unparalleled compared to other films.  From recent memory, the only other film that comes close—besides the first Deadpool—was last year’s ‘Baby Driver.’The film’s dialogue is packed with movie references, nods at pop culture, and even jokes at Ryan Reynold’s own expense, so much so that a second viewing would absolutely be necessary to try and catch them all.The movie isn’t perfect.  For example, the first half of Cable’s storyline feels a bit disjointed from the rest of the film.  However, it steadily becomes increasingly well integrated over time.However, for a franchise that prides itself on violent irreverence, it’d be unthinkable to assume that they were capable of making audiences well up with emotion at the end, yet they had the entire theater choking back tears, a rare achievement that strongly rounds out this film and places amongst the best in its class.",
            "review_date": "2018-05-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nAs expected it is completely entertaining movie, with great jokes, good performances Ryan Reynolds owns this character like it's his own soul, and some of the action scenes are simply superb.But this movie loses the appeal the first had, the first was very straight forward, while this one starts wanting to be one thing and shifts. The first act was really slow, and the jokes weren't landins at first, but after Vanessa's death the movie just picked up and started getting better and better.Some of the dialog is really farfecthe'd, trying to hard to be funny, and sometimes when you expect that seriousness, that the movie has at times, you get some really dry jokes that ruin what could have been a great moment/sceneSo this is definetely worth the watch, but i guess being a sequel from a sucessful movie, it really stretched itself thin. and not forget to mention basically the best post credit scene in history of cinema.",
            "review_date": "2018-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "When Josh Brolin said in an interview that Deadpool 2 was funnier was the first Deadpool I thought it was some promotion BS but was i glad I was wrong Deadpool 2 was funnier and more action packed than the first Movie.Before I say what IWhen Josh Brolin said in an interview that Deadpool 2 was funnier was the first Deadpool I thought it was some promotion BS but was i glad I was wrong Deadpool 2 was funnier and more action packed than the first Movie.Before I say what I enjoyed about Deadpool I would just like tonsay although DP2 is funnier and more action packed it is not better than the first one and I will talk about that.First off the first act of this movie was weird ot feels like the movie is transitioning from the first movie even thought it uses from jokes from the first movie and surprisingly they work throughout the film.Although something emotional happens in the first act involing Deadpool and Mellisa's character Vanassea it felt like the director or writers did not know how to fully utilize until the later stages of The second act of the movie.Although I have to say again again Ryan Reynolds Performance as Deadpool is Great and is never boring throughout the movie.When the movie starts to go into the second act the story felt more clear and focused amd the action and humor are amped up with Cable being added to the mix making jokes about Dubstep and Deadpool with his dry humor.The kid in the film firefist potrayed by Blah was okay he had a simple story with was the catalist for the entire movie and the performance was fitting.The second half of the movie is were all the excitinv this happen with all the X-Force stuff amd the do something with X-Force thats hilarious some people may find it dissaponting but for me it was wonder amd Betaz character Domino was kind of badass who had the superpowet of luck with proved to be cinematicThe last act of the film was also well done a bit weird but well executed with very funny humor,explosive actionNow the villains of the story there was a surpriseVillain in the movie that I won't spoil but when whenever tnis villain was onscreen he was awesome and the other viallain which involved firefist and doing these bad experiments was kinda weakni mean you understood why they where villians but it was too generic and weakAnd then there was the story arc involved the Cable and the kid which was a bit take it or leave it lod of thing but never riuned the experience of the movie at all.The story may have felt of in the first act of the movie the sfory became more focused in the second act and again the movie is very funny on certain scenes i was literary crying from laughing even thought this certain basic instinct moment happened with was a bit much the movie was still great and the action was better and more epic.The retirning characters like Colossus were also good in the film so that gets an up.And again Ryan Reynold performance was great the man can do no wrong as Dead pool.",
            "review_date": "2018-06-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "You will have fun with this movie, it's great, good action & jokes etc. But it doesn't feel quite different from the 1st one. It tries to bring back everything we loved from Deadpool 1, but it kinda falls short. Some jokes don't land,You will have fun with this movie, it's great, good action & jokes etc. But it doesn't feel quite different from the 1st one. It tries to bring back everything we loved from Deadpool 1, but it kinda falls short. Some jokes don't land, breaking the 4th wall was used way too much often. Things like that makes the 1st one shine a lot more than this one. I felt this movie lacked some originality, but still it's a great movie.Also, some CG it's way off, you will see it and feel it. We are talking about (more or less) 2005-2010 CG level.",
            "review_date": "2018-05-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Wade Wilson is trying to live up with the super hero life, he fight criminals and also still in his relationship with Vanessa. During some events in the future, a person killed the familly of a militar, and for get them back, he decides to goWade Wilson is trying to live up with the super hero life, he fight criminals and also still in his relationship with Vanessa. During some events in the future, a person killed the familly of a militar, and for get them back, he decides to go back in time and killed that person while is still a kid, and that crosses the deadpool way. Directed by David Leitch.The story of this movie does have some really up moments and some really up down ones. Right at the very beginning one thing is going on, and that thing leads to one big deal that happens, and this happening feels so dislocated of the whole plot of the movie that it is disturbing, and they keeped bringing that back apparently having not to do with the plot, but at the very end that makes sense and it is important, i like to think in this story as two circles, one around the other that first seems to be completely disconnected but in the end of the circle the find eachother, it is good. The other circle would be the Cable one, his motivation wasn't bad, but still there was some moments that didn't felt right, like somethings that was kind of out of place, some things that he did during his journey that aren't really a thing that made sense, but considering that the movie makes joke about everything, incluiding itself, it get a free pass and doesn't bother much. The tone and narrative change from times, but not all of the moments are organic, some felt just threaded there. The chemistry between the characters in some moments works in others not that much.The comedy in this movie gets fantastic, it started slow, with some common lines, but as the keep goes, the comedy start getting another level, there are a few ways that the movie try to get you to laugh, wich is lines, actions that break the expectation and some really not convenient moments. All of these work ? No, but generally made me laugh the hell out of me in some moments, there are some big things that they did just to make a giant joke, and that killed me completely, was really funny, there at least two moments that i got broke of how much i did laugh. There are some lines that are good, but there are some that just don't work, wich is normal, there are those simple fart jokes, wich i don't find them funny anymore, was so much used in so many different ways, for me that is exhausted already. There are jokes that got repeated from the first one, but most of them get to a new level and can still be fun, jokes with Ryan or with Fox for example, worked out very well for me. The movie also is a machine gun of references, it does reference so many things, musics, movies, events, most of the time it is very cool. The break of the fourth wall is a big differential, always that he spoke to us, it was a nice moment.Ryan Reynolds as Deadpool one more time, just proved why he is the perfect one for this role, his voice and comical time are perfect, he convinced me in his physicality and also in the personality, in the dramatic moments he didn't convinced me perfectly, but i can't say that it was bad, surely wasn't as good as the comic ones, but it was functional. Josh Brolin was badass, his dramatic moments wasn't the best of the history, his character didn't seemed to have much expressions, it was pretty simple, he worked more as a ladder for deadpool and for the plot to flow, but in the action moments he was great. Zazie Beetz as Domino was pretty cool, she didn't had much challenge in the acting, i believe, but she fit well in that role. Morena Baccarin have a small role here, but she convinced me in the romantic parts, you could see that she was kind and full of love, really good.The action here can be dope and at the same time hilarious. It was pretty fun, the choreography of fight wasn't insane, but it was good, there are some sequences with swords and shots that are really nice to see. The powers of Cable were well demonstrated and it was badass. There is one specific moment that the characters used their powers togheter to beat a villain, wich was dope. The way that they show Domino's powers was great, they didn't just said that she was luck and showed a lucky moment, the showed the whole process to make the ending to be that lucky one, also pretty damn cool.The soundtrack was good, it had some uses of already known songs, in some moments that worked really well, in some not that much, but in general it was different, wich is always nice.The cgi was better than the first one, but not by far perfect, it had some moments that wasn't really that good, but generally it also worked out very well.The movie have some switches between drama and comedy that doesn't work everytime, but singularly they both deliver some good moments. The comedy is very nice in general, so as the action.",
            "review_date": "2018-08-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Please, for the love of all things holy, DO NOT listen to the critics on this one. This movie **** rocks my cock. THE best superhero movie this year. **** Black Panther, it's overrated, sorry. I will admit that I liked, but did not love thePlease, for the love of all things holy, DO NOT listen to the critics on this one. This movie **** rocks my cock. THE best superhero movie this year. **** Black Panther, it's overrated, sorry. I will admit that I liked, but did not love the first deadpool. I thought alot of the jokes didn't land but in this movie, nearly all of them land with guttural laughter. How this could currently have a 66 from the critics is insanity. With some saying it's more of the same...not even close. It's shocking, gory, funny, heartbreaking and sweet and loving in all the right ways. Now I will admit, some of the jokes don't land and I wished they had more action scenes without as many cuts. But when they don't cut away from the action...its so badass. The 4th wall breaks are top notch and...im sorry but a 66!? Seriously. Youll tongue punched Black Panthers ****. Just go watch this movie. It's is the best movie of the year, so far. Oh and Cable is better than Killmonger and Thanos, @ me",
            "review_date": "2018-05-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I liked the movie but it did not feel like the Deadpool we had in the first movie. The main reason why its like that is because the writers wanted us to learn more about Wade`s character and what happens when somebody takes everything awayI liked the movie but it did not feel like the Deadpool we had in the first movie. The main reason why its like that is because the writers wanted us to learn more about Wade`s character and what happens when somebody takes everything away from him. Overall its a great movie.I expect to see that infamous Hitler baby murder after credits scene on bluray.",
            "review_date": "2018-07-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great, an independent film without the disney **** black humor, no censorship, infinite references to the previous films and the universe, characters with charisma, funny but humble jokes that do not clash as in other marvel movies thatGreat, an independent film without the disney **** black humor, no censorship, infinite references to the previous films and the universe, characters with charisma, funny but humble jokes that do not clash as in other marvel movies that pretend to be serious but are a joke in itself, 2 hours very fun",
            "review_date": "2018-05-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nEvery joke works in this movie (except for Brown Panther, as it's offensive), but if you're not a big fan of Mr.Pool, then please avoid the sequel too, because you're not gonna like it either. Otherwise, great fun's ahead and Ryan Reynolds did it again by bringing in youngsters who could take this franchise for the next 10-12 years!! Really amazing!!",
            "review_date": "2018-05-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The movie contains more action and characters than the first one while having the funny aspect from the first one a almost perfect sequel.",
            "review_date": "2018-05-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A great fallow through from it's predecessor. It's not perfect but I went into the theatre expecting exactly what I got plus a bit more. I'm not going to spoil it for you but was really surprised at how the events turned out in the second toA great fallow through from it's predecessor. It's not perfect but I went into the theatre expecting exactly what I got plus a bit more. I'm not going to spoil it for you but was really surprised at how the events turned out in the second to third act. Love how it doesn't take itself seriously and some say that it does it too much but if you are a Deadpool fan you know that's the whole point. Ryan Reynolds was born to play Deadpool, can't wait for the X Force Movie!",
            "review_date": "2018-05-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nI loved the first movie and I’m happy to say was a lot better. I loved the characters of cable and domino. The entire X force scene was hilarious. I loved the jokes in this movie such as the calling cable Thanos. I also loved the fight scene with cable and Deadpool while bangarang is playing. Overall a good movie",
            "review_date": "2018-05-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "In Deadpool you will only see how an actor loves his character, how he only wants us to come and go with a smile from the cinema and how he gets it, Jesus.After thinking that the first was unsurpassed, this wonder comes to my face, winksIn Deadpool you will only see how an actor loves his character, how he only wants us to come and go with a smile from the cinema and how he gets it, Jesus.After thinking that the first was unsurpassed, this wonder comes to my face, winks very well put, frenetic humor, much action in the best Deadpool style, in short if you liked comics and the first movie, this time you will love it, and if you are only from the movies, you will love her as well. DOMINO I LOVE YOU",
            "review_date": "2018-05-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Script not as good as for D1, not even close, but still a decent movie and certainly better and way less juvenile than any Avengers movie or spinoffs.Classic Deadpool: he just can't STFU, and that's the way we like him. Decent fights,Script not as good as for D1, not even close, but still a decent movie and certainly better and way less juvenile than any Avengers movie or spinoffs.Classic Deadpool: he just can't STFU, and that's the way we like him. Decent fights, violence, acting and humour. Cable is awesome, too.Verdict: Spandex!",
            "review_date": "2018-05-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie was basically part 1 extra amped up. It's a wild ride, the characters are memorable for the most part and this movie knows no boundaries. I can highly recommend it to anyone who enjoys to laugh unashamedly. People who don't likeThis movie was basically part 1 extra amped up. It's a wild ride, the characters are memorable for the most part and this movie knows no boundaries. I can highly recommend it to anyone who enjoys to laugh unashamedly. People who don't like this movie are people who are either too old to understand what Deadpool the character is all about, or they  just don't like the character at all. If you are not in either of these categories and you are of age then you will like this.",
            "review_date": "2018-05-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Dissecting a Deadpool film is sort of like explaining a joke: it exists in the moment and is funnier left untouched. This second installment in the sarcastic loud-mouthed superhero’s series is a bit of a surprise, since sequels rarely conjureDissecting a Deadpool film is sort of like explaining a joke: it exists in the moment and is funnier left untouched. This second installment in the sarcastic loud-mouthed superhero’s series is a bit of a surprise, since sequels rarely conjure up the same passion and fandom as the original film. Much like 22 Jump Street, Deadpool 2 succeeds in its self-awareness. Multiple self-deprecating jokes about lazy writing and some surprisingly bold decisions with regard to the story make this sequel, in some ways, more memorable, and certainly more unique in its genre, than the original. Deadpool is a standard superhero film with some R-rated humor baked into its crust whereas Deadpool 2 is a superhero film distancing itself from the formula. Without this distinction, Deadpool 2 would not be worth two hours of anyone’s time.Little can be discussed with regard to the story without leading to spoilers (not that a film of this nature demands or deserves much analysis). Many of the jokes will not age well, and audiences may soon tire of Ryan Reynolds’s brand of humor in general. While I am certain that I left the theater the same person as before I walked in and had zero of my core beliefs or ideas challenged, I am not sure if I have been more entertained on a base level this year.",
            "review_date": "2018-06-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie was great. Absolutely great. Ryan Reynolds nails the part as Deadpool. Cable was also very well done by Josh Brolin. Domino really surprised me. Was not looking forward to her, but she ended up becoming one of my favoriteThis movie was great. Absolutely great. Ryan Reynolds nails the part as Deadpool. Cable was also very well done by Josh Brolin. Domino really surprised me. Was not looking forward to her, but she ended up becoming one of my favorite characters. The X-Force were very important and interesting characters and I can't wait to see them interact more in more movies. And the reveal of the classic X-Men character was awesome. So happy to see them on screen again. Overall, it's not amazing. But it is funny af and a great watch",
            "review_date": "2018-06-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "You liked the first movie, this one may be even better.Directed by David Leitch \"The man who killed John Wick's dog\" as they call him in the movie, this is a step up from the previous one in terms of action scenes.\nAlways lead by the charmYou liked the first movie, this one may be even better.Directed by David Leitch \"The man who killed John Wick's dog\" as they call him in the movie, this is a step up from the previous one in terms of action scenes.Always lead by the charm of the merc with a mouth we see a tale of doing the right thing, saving a mutant child from Cable with the help of the newly assembled X-Force.Not as risky as the previous film but still interesting, you leave with a smile on the face.Remember: There are post-credit scenes.",
            "review_date": "2018-06-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's no secret that the film industry today is bursting at the seams with superhero movies. It's a crowded genre, and it's becoming very difficult to find one that stands out and breaks free of clichés. Deadpool 2 most definitely stands outIt's no secret that the film industry today is bursting at the seams with superhero movies. It's a crowded genre, and it's becoming very difficult to find one that stands out and breaks free of clichés. Deadpool 2 most definitely stands out and provided many pleasant surprises, but there are just some tropes that it can't overcome.But that's not to say that it's without originality. The story takes many unanticipated turns that completely defy expectations. It takes quite some time to reveal the true nature of the plot, and that's something that's difficult to achieve and is commendable here. However, once everything is understood at the end of act two, the third act plays out pretty much exactly how one would expect it to. There's nothing compelling about it. The conclusion is very generic, which is disappointing when it's considered that there's a decent amount of unconventional material present in the rest of the film.Deadpool as a character gets an entirely different side shown to him in this sequel, and that's one of the fresh things about the movie. The merc with a mouth exposes his darker side and actually becomes a much deeper character as a result. Unfortunately, the rest of the characters are comparatively poorly written and hardly develop at all.Serious stuff aside, though, the gleeful violence and unhinged humor definitely serve their purpose here. Not all of the jokes hit as hard as they should, but the fourth-wall-breaking script pokes plenty of fun at its own flaws and it makes for a fun ride!Deadpool 2 isn't a film that's particularly memorable; the overall package is one that ends on a note that leaves it blending in with other movies in the genre. But it's an incredibly entertaining, action-packed, and hilarious thrill that is definitely worth seeing, preferably with some friends.Story: 7Acting: 7.5Script: 7Visuals/Sound: 8Entertainment Value: 8OVERALL SCORE: 7.5/10",
            "review_date": "2018-06-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "While I very much like this movie and also think, that this is one of the better superhero movies out there (one might look at the garbage Marvel / Disney has been pumping out since the early 2010s), it still falls short of its predecessor.While I very much like this movie and also think, that this is one of the better superhero movies out there (one might look at the garbage Marvel / Disney has been pumping out since the early 2010s), it still falls short of its predecessor. It's still an entertaining movie, I just don't think it adds much value to the \"franchise\".",
            "review_date": "2021-07-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Deadpool 2 was way better than that overrated first movie. josh brolin was great as cable",
            "review_date": "2020-12-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Lacks the novelty of its predecessor, but still delivers a healthy amount of big laughs. Best end credits scene ever.",
            "review_date": "2018-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I saw this movie last month and forgot to review it. Given my general bias against sequels, 'Deadpool 2' is actually a smart, hilarious film that continues what it's predecessor does. It subverts the traditional superhero movie and all itsI saw this movie last month and forgot to review it. Given my general bias against sequels, 'Deadpool 2' is actually a smart, hilarious film that continues what it's predecessor does. It subverts the traditional superhero movie and all its cliches, starting with its eponymous protagonist, someone you can sympathize with and route for, even if he is a downright a**hole. The writing is obviously less original (sequel) but it's still a fun ride while it lasts. And it leaves me already anticipating 'Deadpool 3.'",
            "review_date": "2018-06-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Deadpool 2 is very funny. It is funnier than the original. But in the grand scheme of things, it is not better than the original. Why? Because while it ver funny, the rest of the movie is just ok. The story is meh, and the moments that areDeadpool 2 is very funny. It is funnier than the original. But in the grand scheme of things, it is not better than the original. Why? Because while it ver funny, the rest of the movie is just ok. The story is meh, and the moments that are supposed to be serious just left me blank, I felt very little connection to the characters other than I know who they are from the comics and how funny they were. That being said, by no means it's a bad movie, it is R-rated fun all the way, and I'm glad I saw it and laughed all the way through, If you liked the first or dark humor in general, then it is definitely worth the time.",
            "review_date": "2018-05-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I can't hate this film. It was more violent compared to the last one, but I liked his jokes and especially post credit scene. However, Cable was to weak, and all the greatest action was done in first 5 minutes. I understand that they didn'tI can't hate this film. It was more violent compared to the last one, but I liked his jokes and especially post credit scene. However, Cable was to weak, and all the greatest action was done in first 5 minutes. I understand that they didn't have enough budget as Deadpool said himself, and I really hope for Deadpool 2.",
            "review_date": "2018-05-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Directed by David Leitch and starring the inimitable Ryan Reynolds, Deadpool 2 delivers more of the same hilarious R-rated action we were served in the first instalment of this Marvel franchise. Reynolds holds the fort with his on-pointDirected by David Leitch and starring the inimitable Ryan Reynolds, Deadpool 2 delivers more of the same hilarious R-rated action we were served in the first instalment of this Marvel franchise. Reynolds holds the fort with his on-point portrayal of every fanboy's favourite off the curve comic book hero with a wry, unceasing wit and the explosive energy of a man constantly jacked up on speed. The action is pretty consistent although there are a few dips into the soppier stuff here and there because....the audience has feelings(yawn)! All said, the pace and is excellent and there's more than enough to hold your attention throughout. As a cast, there are some very familiar faces as well as some choice cameos from Hollywoods finest. Josh Brolin is fantastic as the big baddie Cable, Zazie Beetz as Domino does some serious scene-stealing and the film's youngest star, Julian Dennison brilliantly portrays the angst-ridden teenager Russell. On the negative side, I thought the X-men were given too significant a role and took away rather than added to the story. The characters are quite bland and all the humour centred around them had been exhausted the first time around. Some of the VFX could have been better, notably Colossus and Juggernaut. They never looked convincing, and the animation was distractingly stilted at times. Many of the jokes centred around Colussus, in particular, didn't land. All in all pretty minor quibbles in what is otherwise a very satisfying venture with plenty of laughs and gory action.",
            "review_date": "2018-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Overall this movie is joy to watch; even more self-aware than the first film, it is high energy and fun. My only problem was that the writing is quite lazy, this is even addressed twice in the film. There is also a lot of attention and jokesOverall this movie is joy to watch; even more self-aware than the first film, it is high energy and fun. My only problem was that the writing is quite lazy, this is even addressed twice in the film. There is also a lot of attention and jokes about dubstep, if this was 2012 that may have been a bit funnier.",
            "review_date": "2018-05-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Better than the first one. Really funny, dark humor, lots of action sequences, gore, romance, drama and the most sad moments i've watched in a lot of time. Many references to pop culture (OST as well) and Marvel, and it mocks on DC Comics andBetter than the first one. Really funny, dark humor, lots of action sequences, gore, romance, drama and the most sad moments i've watched in a lot of time. Many references to pop culture (OST as well) and Marvel, and it mocks on DC Comics and Warner Bros at least 4 times. The opening credits are a tribute to James Bond, really well done and performed by Celine Dion. Good performances of Domino, Rusell (the kid) and Cable.There are 2 mid-credit scenes; the second one is the best mid-credit scene of all times in cinema history.",
            "review_date": "2018-06-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ryan Reynolds gracing our screens yet again playing the role he was born to play, everyone’s favourite antihero Deadpool is back and hilarious as ever. Bringing together a team of fellow mutants (Zazie Beetz, Terry Crews, Bill Skarsgård, RobRyan Reynolds gracing our screens yet again playing the role he was born to play, everyone’s favourite antihero Deadpool is back and hilarious as ever. Bringing together a team of fellow mutants (Zazie Beetz, Terry Crews, Bill Skarsgård, Rob Delaney etc.) to protect a young boy (Julian Dennison) with supernatural abilities from a time traveling mutant, Cable (Josh Brolin). Shocking for all the right reasons, and laugh out loud funny from the opening scene all the way to the end credits.I’ve already mentioned we’re living in the time where superhero movies are becoming mind numbingly boring and Deadpool couldn’t have come at a better time. With the first one setting the bar very high there was always the fear that it would slowly decrease in quality with each sequel until there’s no more money to be made and the franchise dies. Deadpool 2 could have been a disaster but with Ryan Reynolds and director David Leitch in control there was no need to worry. I loved every minute of Deadpool 2, from the crude jokes to the ultra violent action sequences. Sure I could have done without a slow-motion scene every five minutes but I’m willing to forgive that. Fun and entertaining to the max. The addition of some new characters was a definite step in the right direction particularly, Zazie Beetz as Domino and Josh Brolin, who is having a great year. I hope I don’t have to sell this movie to you, the marketing alone should have done that, if you enjoyed the first Deadpool then get yourselves to a cinema and check out Deadpool 2, not only does it not disappoint but it’s just as good as the first one. Highly recommended.",
            "review_date": "2018-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Exactly what you would expect with a few surprises, funny and gory, what more can you ask for?",
            "review_date": "2018-06-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nThis movie was very entertaining. Matched if not exceeded the first film in terms of cinematography, humor, action, etc... Deadpool is a series that doesn't take itself too seriously and that is never more apparent than at the end scenes were some humorous course correction takes place. Deadpool doesn't set out to tell a large, detailed story but mostly tells a story of an anti-hero who is just making it up as he goes. The breaking of the 4th wall is still Deadpool's signature selling point and he uses it to perfection in this movie. Highly recommend this movie to anyone who loves a good laugh and good action.",
            "review_date": "2018-05-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Deadpool 2 is an incredibly worthy sequel that is more than worthy of the original film! The jokes are great, the new characters of Domino, Cable, and Fire Fist were incredible additions to the cast, and the story had a surprising amount ofDeadpool 2 is an incredibly worthy sequel that is more than worthy of the original film! The jokes are great, the new characters of Domino, Cable, and Fire Fist were incredible additions to the cast, and the story had a surprising amount of heart. If you're feeling sad after the ending of Infinity War, Deadpool 2 is a definite pick-me-up!",
            "review_date": "2018-05-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Deadpool 2 was even better than the first, it had better action sequences and funnier jokes. The new and old characters were all likeable and Cable was a better villain. It even had some emotional moments that struck harder than the firstDeadpool 2 was even better than the first, it had better action sequences and funnier jokes. The new and old characters were all likeable and Cable was a better villain. It even had some emotional moments that struck harder than the first movie did. All around a great sequel and a super entertaining movie.",
            "review_date": "2018-05-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Realy good better than the first one, Deadpool knows what his about and doesn't take himself too seriously and even with that, the movie does better justice to characters in comparison to the comics than previous X Men or any superhero movies.",
            "review_date": "2018-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not quite as successfully written in comedy or drama, as the first one. But the charm of the lead character, the cool supporting cast and funny action never fail.",
            "review_date": "2018-06-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nThis bizarre superhero comedy was laugh out loud funny but balanced out the humour with seriousness at certain key points. The sequel was far greater to it's predecessor giving the villain (Cable) a sympathetic view in the eye of the audience when you realise why he wants to stop the child (fire fist). The end credits were very unexpected and hilarious.",
            "review_date": "2018-05-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I wanted to like this, as I love the first Deadpool movie! But this wasn't as enjoyable as I had hoped. I guess I should start by saying that I did find some parts funny and I really liked Cable. However the plot was a mess and fairly dull.I wanted to like this, as I love the first Deadpool movie! But this wasn't as enjoyable as I had hoped. I guess I should start by saying that I did find some parts funny and I really liked Cable. However the plot was a mess and fairly dull. I'm aware that the plot isn't a big factor and it is more about the humour but I found many jokes fell flat for me. The first half in particular was fairly boring but I enjoyed the second half far more, and THAT cameo. Overall, Deadpool 2 isn't a flop but it doesn't come close to how good the first film was. I hope they deliver something better for the third instalment.",
            "review_date": "2018-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "While the story lacks some of the bite of the first one, its comedy chops are as strong as ever. The film captures the essence of the character and for a sequel that is the most important part. B+",
            "review_date": "2018-05-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Loved the first one, but this one just wasnt funny. Sure, a few laughs here and there, but nothing like the first one. The first one was just genius.The jokes in 2 feel like a 10 year old wrote them, they are repeated all the time.TheLoved the first one, but this one just wasnt funny. Sure, a few laughs here and there, but nothing like the first one. The first one was just genius.The jokes in 2 feel like a 10 year old wrote them, they are repeated all the time.The characters behavior seem totally out of place, as if its from a parallel universe.The CGI is actually really bad.Too much PC and leftist humor injected as well. It feels extremely artificial, like someone wants to screw you over.I dont know anyone who liked this movie even remotely close as much as the first one, yet the reviews are going through the roof everywhere. Very, VERY weird.",
            "review_date": "2018-10-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a fun movie to watch, don't miss it. It has great soundtrack, good jokes, and great action.",
            "review_date": "2018-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not as good as the original. It's basically just a bunch of crude comedic scenes all patched together with way too much goofing around and talking by Reynolds. It has a paper thin plot and story that makes no sense .Much of the humour we'veNot as good as the original. It's basically just a bunch of crude comedic scenes all patched together with way too much goofing around and talking by Reynolds. It has a paper thin plot and story that makes no sense .Much of the humour we've already seen and is just repeated from first film.The character  Domino pretty much steals the film really .Her superpower is funny and interesting .Watching Deadpool getting ripped apart in various ways gets tiresome after awhile .The 'first' death scene ending of the film gets tedious like a bad high school amateur play but then they add on several others.The whole film just seems to be written on the run.A few decent laughs,Domino  and a couple nice effects make it watchable.",
            "review_date": "2018-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Rockin! Thumbs up peeps. The sassy Brolin's in it so even your Mom will enjoy.",
            "review_date": "2018-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I enjoyed it but didn't find it as entertaining as the first. Too many recycled jokes (looking at you X-Men/FOX Studios jokes), some of the references and fourth-wall breaks felt overly contrived. It's definitely a film for fans of DeadpoolI enjoyed it but didn't find it as entertaining as the first. Too many recycled jokes (looking at you X-Men/FOX Studios jokes), some of the references and fourth-wall breaks felt overly contrived. It's definitely a film for fans of Deadpool -- if this is going to be your first experience with Deadpool, STOP  and go get the first movie NOW. I can think of many worse ways to spend 2 hours of my time but, unlike the first movie, I probably won't see it again until it hits Blu-ray/digital release.",
            "review_date": "2018-05-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I loved the first Deadpool and I really like Deadpool 2.  I am, in general, a fan of Superhero movies.  DP2 has many of the same things that made DP great.  It is raunchy, R-rated and funny.  I don't quite understand why Josh Brolin is theI loved the first Deadpool and I really like Deadpool 2.  I am, in general, a fan of Superhero movies.  DP2 has many of the same things that made DP great.  It is raunchy, R-rated and funny.  I don't quite understand why Josh Brolin is the bad guy in two Marvel movies released so close in time to each other.  But he is good here.  Ryan Reynolds is perfect for the tone of both DP movies.  The new character Domino is great.  The opening credits are a wonderful homage to the Bond films.  The story is a little predictable and somewhat schmaltzy.  There is a scene  near the end where there is a snarky (albeit funny) comment about the conventions of these movies, then the movie simply follows the convention.  Nevertheless, I laughed, was entertained, and had a good time.  The other Marvel convention, one that I can't seem to get enough of, is the extra scene during or after the credits and the one in this movie is simply awesome.  Do not walk out until it plays out; it's very funny.",
            "review_date": "2018-05-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Absolutely great fun and daft in just the right amounts, if you enjoyed the first deadpool (which is now available on Netflix in EU at least) you're going to love this one just as much as it picks up pretty much right where the first ends.Absolutely great fun and daft in just the right amounts, if you enjoyed the first deadpool (which is now available on Netflix in EU at least) you're going to love this one just as much as it picks up pretty much right where the first ends. While I was firstly thinking that it was cool to see a marvel movie without 20 previous films you need to see to enjoy it... the more you know about MCU and even the DCU you'll get more of the jokes from this as it is reference mania at times.",
            "review_date": "2018-06-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This was a great movie. Domino and Cable were awesome. Not as great as the first. But it still stands on its own merits. Never bored once and the previews did not ruin it. Will probably wait a week or two to see it again.",
            "review_date": "2018-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If you like R-Rated Marvel movies that have constant fourth-wall breaks featuring a Merc with a mouth, the latest sequel of Deadpool is for you. Deadpool 2 is an instant comedic delight that would make you laugh like hell. The actionIf you like R-Rated Marvel movies that have constant fourth-wall breaks featuring a Merc with a mouth, the latest sequel of Deadpool is for you. Deadpool 2 is an instant comedic delight that would make you laugh like hell. The action intensity, characters, and the clever writing is what made this movie even special than the first. Sure, the first was awesome, but the sequel however, sets a golden standard for future R-Rated Marvel movies. Sometimes the plot may lack a little, but the whole overall feel of Deadpool 2 is extremely entertaining to watch. Mark my words, Deadpool’s “third film” will be about “family” (AKA the X-Force) and it’s gonna be a billion dollar box office success in the near future.",
            "review_date": "2018-05-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not many films can survive the sophmore jinx. Deadpool 2 survives this curse in spades and joins the ranks of great second installments such as Terminator 2, X2, Winter Soldier and Aliens. Action packed, a comedy masterclass and aNot many films can survive the sophmore jinx. Deadpool 2 survives this curse in spades and joins the ranks of great second installments such as Terminator 2, X2, Winter Soldier and Aliens. Action packed, a comedy masterclass and a surprisingly emotional story which is stronger than the first film makes this film a definitive must see for the summer",
            "review_date": "2018-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Deadpool is a good movie, but there were times in the movie where the jokes just didn’t go over well. The action was amazing just like the first one, and the cameos were a nice touch. Josh Bolin and Zazie Beets both kill it as Cable andDeadpool is a good movie, but there were times in the movie where the jokes just didn’t go over well. The action was amazing just like the first one, and the cameos were a nice touch. Josh Bolin and Zazie Beets both kill it as Cable and Domino please bring them back ASAP.",
            "review_date": "2018-05-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nis a excellent film and i like the Movie shows Deadpool And Presents a Old Partner of The Merc With Mouth in The Comic books, Cable and the another Partner of the Same Domino",
            "review_date": "2018-05-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nI wanted to love it, I really did.I went to see it with huge expectations but they vanished and became just simply ideas, because in the end that's what Deadpool 2 really is; good ideas that never get a real development.Deadpool is a funny comic book character, yes he pretty much has always been like that and both the writers and Ryan Reynolds have understood it very well but unfortunately what initially works because it feels funny is used in an extreme and excessive way, that too soon for its own good, the character feels like a simple parody, instead of a true developed being.Yes, the plot tries to give depth with Vanessa's death but what's the point when 5 minutes later he already seems to have forgotten everything to be able to say a joke in time?The story of Deadpool 2 is too simple and it's not like I was expecting something deeper or dramatic but let's say that it felt quite rushed.From the cast only Josh Brolin as Cable and Zazie Beetz as Domino manage to be more proactive for the story. The trailers showed X-Force but I'll just say they were a scam as big as Ben Kingsley playing The Mandarin, while Colossus, Negasonic and Dopinder repeat their same supporting roles.The action is 10 times bigger and better than its predecessor but the CGI at times looks very bad, but definitively Deadpool 2 has better moments than the shooting on the highway of the first film, yet surprisingly, the final battle felt quite anticlimactic.In summary Deadpool 2 is more of the same only than on a larger scale and that was disappointing.It's still fun but the same joke doesn't work the same way twice.If you loved the first one, you will love this one, but if you expected something more like me, Deadpool 2 was far from offering it.By the way there is indeed a scene in the credits and it was quite worth it. Guaranteed laughter.",
            "review_date": "2018-05-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nGreatest Superhero ever seen! Best one since Deadpool 1, Loved the performances and new characters, this holds the title of the last film which Hugh Jackman played Wolverine which was sad to see! If you guys haven't seen it, you guys gotta see this! Lots of Action scenes and laughs! DON'T TAKE YOUR KIDS TO SEE THIS!!",
            "review_date": "2018-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Firstly I'd like to say how I am delighted that the trailer did not ruin any of the jokes, plot or surprises of this movie (as was the same with the first Deadpool). Secondly and without doubt, the only thing I can say about this movie isFirstly I'd like to say how I am delighted that the trailer did not ruin any of the jokes, plot or surprises of this movie (as was the same with the first Deadpool). Secondly and without doubt, the only thing I can say about this movie is that it is even better than the first one, which is rare for a sequel. Fox obviously saw the light after the success of the first movie. You must see this movie if you are a fan of laughing a crude humor.",
            "review_date": "2018-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's just great. Really. It is better than the first, sharper and more edgy. The action is legit as well. If you liked the first film even a little go see it. If you didn't like the first one, you are a grumpy grand parent and you shouldn'tIt's just great. Really. It is better than the first, sharper and more edgy. The action is legit as well. If you liked the first film even a little go see it. If you didn't like the first one, you are a grumpy grand parent and you shouldn't go to any movies.",
            "review_date": "2018-05-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "better than the prequel.  great writing. cant believe i am saying this but i could watch a dozen more of these, if he can keep up the writing.",
            "review_date": "2018-06-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "What is it with Marvel writing? Historians of the future will have to figure out what made these movies so incredibly good, and luckily they will have ample source material. This one isn't a perfect ten because it doesn't have the \"how canWhat is it with Marvel writing? Historians of the future will have to figure out what made these movies so incredibly good, and luckily they will have ample source material. This one isn't a perfect ten because it doesn't have the \"how can this be so surprisinlgy good\" effect of the first one, but it's close. Top notch acticing, a perfectly paced story with flawless CGI and sound track, I can't wait for the next iteration. Holy **** indeed.",
            "review_date": "2018-05-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Despite occasionally falling back on a few clichés the original Deadpool movie, with it’s over the top violence and self-aware sense of humour, was a bit of a breath of fresh air in the superhero genre and this sequel turns the dial up evenDespite occasionally falling back on a few clichés the original Deadpool movie, with it’s over the top violence and self-aware sense of humour, was a bit of a breath of fresh air in the superhero genre and this sequel turns the dial up even further.The plot itself, which I won't spoil here, isn't overly important but does offer enough suitably emotional beats to allow audiences to invest in the plight of the characters. As with the first movie however it’s the humour that really shines. Yes, some might describe things as \"childish\" or \"crude\" but Ryan Reynolds was simply born to play Deadpool and I'm happy to admit that I found myself laughing out loud during many scenes. I for one would be happy to see another entry in this series.",
            "review_date": "2018-05-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Awesome.  I liked it even more than the first.  No boring parts.  It's action packed when it needs to be and sensitive when the story's tempo calls for it.  The whole thing works well.  Josh Brolin is fantastic as Cable, Brianna Hildebrand isAwesome.  I liked it even more than the first.  No boring parts.  It's action packed when it needs to be and sensitive when the story's tempo calls for it.  The whole thing works well.  Josh Brolin is fantastic as Cable, Brianna Hildebrand is just what the movie needs when it needs it.  All the parts work well together, just great story telling.",
            "review_date": "2018-05-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Finally, after all the underwhelming repetitive single-use superhero flicks Deadpool returns to save the day.Deadpool 2 is the exemplary sequel - it just takes all the original's ingredients and carefully improves upon them.\n\nThe firstFinally, after all the underwhelming repetitive single-use superhero flicks Deadpool returns to save the day.Deadpool 2 is the exemplary sequel - it just takes all the original's ingredients and carefully improves upon them.The first movie felt a bit confined with just a couple of locations due to its low budget - this one feels like a proper blockbuster. The first had modest action - here the amount, scale and choreography (thanks to director Devit Leitch) of fight scenes is heightened noticeably. The situation with jokes here is on par with the original - there are a lot of them, some don't work, but many do and the overall impression is very much favorable, there are plenty of laughs to be had here. The sheer number of characters involved is also increased, which does leave some with little screen time, like Negasonic Warhead.Had it not been for the stretched-out ending and a few story hiccups, this might've even been a 10/10 contender. While WB keep wasting their comic universe's potential and Disney keeps spitting out generic junk of descending quality, Deadpool 2 manages to be as good as its predecessor and set directly set things up for sequels. And I say, keep them coming.",
            "review_date": "2018-05-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Lightning may not have necessarily struck twice for Ryan Reynolds' \"Deadpool\" sequel \"Deadpool 2,\" but that doesn't mean it's not a fun movie overall. Indeed, like the film's titular protagonist, \"Deadpool 2\" is as irreverent, violent, and asLightning may not have necessarily struck twice for Ryan Reynolds' \"Deadpool\" sequel \"Deadpool 2,\" but that doesn't mean it's not a fun movie overall. Indeed, like the film's titular protagonist, \"Deadpool 2\" is as irreverent, violent, and as hilarious as ever, with the improved action set pieces and additions to the cast embodying the highest marks I can give the film. And though the plot may not really be as simple and clean-cut as I was hoping, there's enough smile-worthy gags and eye-popping kills to keep me wanting even more.",
            "review_date": "2018-05-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I liked it; I can't say u will too!If u are not watched and never got to know the style of this movies genre! I don't know how u will take it; this is not a common or well mannered super hero movie!This is bad,dirty,foul mouth super heroI liked it; I can't say u will too!If u are not watched and never got to know the style of this movies genre! I don't know how u will take it; this is not a common or well mannered super hero movie!This is bad,dirty,foul mouth super hero movie with a lot of vulgarities and trolls to many movies,studios; Don't take it seriously, its just for fun!This movie is done what sequels should do,double upon what the previous movie did,deadpool 2 succeeded it,full on one liners, self praise and teasing ,funny screenplay with highly energetic performance by Ryan Reynolds he **** nailed it,i was entertained,my rating 8.4( may be you dont feel 8.4,i dont care)",
            "review_date": "2018-05-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I gotta admit, I did end up liking this a hair better than the first, although really they're both neck and neck with each other! This film really kicks up the violence, fun, and fourth wall-breaking quite a few notches and adds some fun andI gotta admit, I did end up liking this a hair better than the first, although really they're both neck and neck with each other! This film really kicks up the violence, fun, and fourth wall-breaking quite a few notches and adds some fun and awesome characters into the mix, such as Josh Brolin's Cable, Zazie Beetz's Domino, and even some rather unexpected blink-and-you'll-miss-it cameos in a couple spots. Reynolds is once again spot-on and fully committed to the role he was born to play, which is especially made evident and credible in the hilarious mid-credit scenes! Overall, I really couldn't have asked for a better sequel to an already hilarious and enjoyable first film! Keep doing what you're doing Mr. Reynolds!",
            "review_date": "2018-05-19",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 151
}