{
  "title": "Holmes & Watson",
  "rating": 2.9,
  "release_date": "2018-12-25",
  "summary": "A humorous take on Arthur Conan Doyle's classic mysteries featuring Sherlock Holmes and Doctor Watson.",
  "critic_reviews": [
    "As a director, Coen commits comedy’s most cardinal sin: He gets between us and the performers.",
    "There are moments, however fleeting, that suggest there’s a decent Mel Brooks-ian farce hiding amidst the wreckage. Deeply, profoundly hidden moments, but peeking through every now and then, an annoyingly sporadic Christmas miracle.",
    "Holmes and Watson will probably make you smile, and occasionally, it earns that goodwill. But it’s nowhere near where it should be with the company present. Forgive the pun, but it’s elementary to find what’s off with this movie. It’s being solved by detectives missing a key clue.",
    "The trouble with Holmes & Watson, a witless Sherlock Holmes spoof that supplies fewer laughs in its entirety than “Step Brothers” does in its deleted scenes, is that the movie can never decide how dumb it wants to be. Or, more accurately, what kind of dumb it wants to be.",
    "The lazy gags, wasted supporting cast and unfocused writing make the film an unfunny chore, which evokes but doesn't come close to their earlier comedic outings.",
    "You’ll need a magnifying glass to find the jokes in this send-up of other, better Holmes screen adaptations. With stars this funny, there are inevitably some moments of mirth (several of them onion-based), but it falls well short of their previous team-ups.",
    "Because of the talent involved, every now and then Holmes & Watson hits on something bizarrely inspired.",
    "The trouble is, Sherlock Holmes exists so large in audiences’ minds already that the pair’s uninspired take feels neither definitive nor an especially fresh take, but just an off-brand, garden-variety parody.",
    "There is still intermittent joy to be found in their autumnal bromance.",
    "The real crime in Holmes & Watson is the waste of the supporting cast.",
    "Considering Ferrell and Reilly’s immense talents, Holmes & Watson is an even more unsettlingly unfunny experience.",
    "The gags involve cocaine, bees, primitive MMA, raw unions, and a selfie that goes horribly wrong with the queen, all of which are terribly tired and unfunny. This is the kind of damaged goods studios have been quietly selling to streaming services.",
    "A brilliant supporting cast, which includes Hugh Laurie, Steve Coogan, Ralph Fiennes, Lauren Lapkus, Rebecca Hall, and Kelly MacDonald, is utterly wasted on this lame and forgettable outing. The only real mystery is why they wanted to be apart of this project at all.",
    "Combined with some awfully lazy riffs on Holmes’s fondness for his seven-per-cent solution, Holmes & Watson is not so much a case of whodunit as it is a question why bother.",
    "It’s just not funny.",
    "Puerile, imbecilic and imbued with the kind of casual 1970s sitcom homophobia that reads all male friendships as somehow suspect, this slack-jawed grossout comedy represents the nadir of Conan Doyle adaptations.",
    "A completely charmless, laughs-free experience.",
    "When people talk about Hollywood movies feeling more and more like product, this is what they’re driving at.",
    "So excruciatingly awful that you have to wonder what it was, other than their paychecks, that could have possessed the cast and crew to keep coming back each day, when it must have been obvious from the first day of shooting that the project was the most hopeless of cases imaginable.",
    "You can only swindle audiences by thinking you simply throw A-list stars in anything and people will still show up, drooling like Pavlov’s pups, for so long before the echo in empty theaters is deafening.",
    "Making their previous vehicles Step Brothers and Talladega Nights seem the height of comic sophistication by comparison, Holmes & Watson features the duo parodying Arthur Conan Doyle's famous characters to devastatingly unfunny effect.",
    "Coroners of comic failure will find much to uncover in the corpse of Holmes & Watson, a thoroughly tedious and never-amusing spoof of Arthur Conan Doyle’s legendary detective.",
    "If there are any new jokes left to tell about Holmes, they’re nowhere to be found in the abysmal Holmes & Watson, which might be the worst feature-length film ever made about the “consulting detective” from Baker Street."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "24% seems harsh. My girlfriend and I saw this Christmas day, and it was about what I expected it to be- Juvenile stupidity. I thought it was on par with other collaborations between Riley and Ferrel. Probably not quite as good as Anchorman,24% seems harsh. My girlfriend and I saw this Christmas day, and it was about what I expected it to be- Juvenile stupidity. I thought it was on par with other collaborations between Riley and Ferrel. Probably not quite as good as Anchorman, but still funny. If you were expecting high-minded, deep art, or a movie of great social importance, then you must have never seen their work. If you want a bit of silly slapstick-y nonsense, and you've liked their other movies- you'll likely enjoy this. Not sure if this movie has suffered in the user reviews because of pissed off right wingers (like the ratings for the all female Ghostbusters, The Last Jedi, etc.) -it does have few jokes about the baby-in chief.",
      "review_date": "2019-01-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "No one laughed at this movie? Really? No one found this funny? I knew I was going to love this movie the second the little girl grabbed (young) Sherlock's turtle and threw it shouting (I paraphrase), \"What kind of stupid dog is this!?\" ThisNo one laughed at this movie? Really? No one found this funny? I knew I was going to love this movie the second the little girl grabbed (young) Sherlock's turtle and threw it shouting (I paraphrase), \"What kind of stupid dog is this!?\" This is not a satire - it's a total send up, and if you love Sherlock Holmes but realize how freaking inherently goofy the famous detective is, and how the Holmes/Watson relationship is so similar to the hilarious dynamic between Ricky Bobby and Cal Naughton, Jr. - you must appreciate this. There is a plot for anyone paying attention. Sherlock refuses to feel anything (he uncries!), and learns that he needs to understand love in order to solve crimes. They have a fricking full out Hollywood musical number at the end which alone makes the film as brilliant as any Will Ferrell/John C. Reilly film you've ever seen. Honestly, were all these negative reviews written by people who hate comedy?  Also - the not-so-subtle digs at American culture are spot on and hilarious. Pay attention. Slapstick humor, gross-out humor, plus witty dialogue (\"A lady doctor!\" \"How do you spell doctor?\" \"Does doctor mean something different in America?\") equals another Will Ferrell/John C. Reilly triumph. New favorite movie.",
      "review_date": "2019-04-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you watch it intoxicated or really really high this is one of the best movies ever created or... even one of the greatest art pieces ever in existance.",
      "review_date": "2019-03-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Utterly encapsulating and moving. A thespian masterpiece of utter brilliance. Jolly good fun. Pure bravado in it's message and bravery. When Holmes poisoned his fellow Watson it was as if I was watching pure Shakespeare! Holmes and WatsonUtterly encapsulating and moving. A thespian masterpiece of utter brilliance. Jolly good fun. Pure bravado in it's message and bravery. When Holmes poisoned his fellow Watson it was as if I was watching pure Shakespeare! Holmes and Watson will be uttered beyond time through the generations as a film of delight on a bright spring day with your stash of breakfast tea ready for consumption!",
      "review_date": "2019-04-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The problem with 'Holmes & Watson' is largely the same as many modern comedies--it's witless, opting for the cheap joke instead of something that takes a few brain cells to process. 'Holmes & Watson,' however, is simply that much more witlessThe problem with 'Holmes & Watson' is largely the same as many modern comedies--it's witless, opting for the cheap joke instead of something that takes a few brain cells to process. 'Holmes & Watson,' however, is simply that much more witless than most.",
      "review_date": "2019-01-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Paul Walker with a Porsche, Michael Jackson with a documentary... and Will Ferrel with this movie.",
      "review_date": "2019-03-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Much of what you would expect from the duo, albeit not their best. I wouldn't condemn the movie entirely, but it surely isn't worth the ticket price.",
      "review_date": "2019-01-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I don't know if it counts if you laugh ironically at something but this movie was tough.  I try to picture if this movie was free and I was at home and had nothing to watch would I go check it out.  The answer is NO.  Seemed like a funnyI don't know if it counts if you laugh ironically at something but this movie was tough.  I try to picture if this movie was free and I was at home and had nothing to watch would I go check it out.  The answer is NO.  Seemed like a funny concept too and I did want to like it.  But the movie was not enjoyable",
      "review_date": "2019-02-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There's quite a lot of jokes in this movie which made me laugh but I'm really not impressed about the movie: contentless, almost nothing good about it.",
      "review_date": "2019-04-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Horrendously unfunny, Holmes and Watson wastes its dyanmic duo's amazing chemistry, as well as the audiences time.",
      "review_date": "2018-12-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Reminds me of an old Fawlty Towers bit with an incorrigible child who sends back his order of bread and salad cream saying, \"That's PUKE, that is.\" To which Basil Fawlty replies, \"Well, it's FRESH puke.\" Holmes & Watson is indeed PUKE, withReminds me of an old Fawlty Towers bit with an incorrigible child who sends back his order of bread and salad cream saying, \"That's PUKE, that is.\" To which Basil Fawlty replies, \"Well, it's FRESH puke.\" Holmes & Watson is indeed PUKE, with it's only redeeming quality of being FRESH Puke. Don't even watch it on free TV, it's inevitable and imminent destination. Bad news for the Ferrell - O'Reilly team. Bad news.",
      "review_date": "2018-12-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A perfect illustration of poorly made pointless movie.  I think the Congress should make a law requiring to return the money to anyone who walks from the viewing earlier.  I did.  I could not take the stupidity.",
      "review_date": "2018-12-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I just went to see this with my family this evening and we were not impressed. Acting was not great, and there really weren't any parts that were really very funny, a huge disapppointment.",
      "review_date": "2018-12-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If anyone saw the trailer for this they would have a hard time justifying going to the film and torturing themselves long enough to do a proper review.Even the 'best 'parts in the trailer were brutal.",
      "review_date": "2018-12-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Each minute is packed with what should be several laughs, but none of them hit home to the point that the entire film feels like an improv piece. In addition, the whole mystery at the center of it all couldn't possibly be more bare-bones. InEach minute is packed with what should be several laughs, but none of them hit home to the point that the entire film feels like an improv piece. In addition, the whole mystery at the center of it all couldn't possibly be more bare-bones. In the end, the joke will be on you if you sit through an entire viewing of Holmes & Watson.",
      "review_date": "2018-12-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Movies like this is what killing my faith in humanity. Ralf Fiennes...Hugh Laurie...why?WHY?!",
      "review_date": "2018-12-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was bangin. When i watched this movie I decided that I was gonna name my kids Holmes and Watson.",
      "review_date": "2019-01-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This \"comic\" take on Sherlock Holmes stars Will Ferrell and John C. Reilly as the titular duo. I put the quotes around comic, because this film dredges the bottom of the comedy barrel and comes up flailing with a flat farce. I didn't laffThis \"comic\" take on Sherlock Holmes stars Will Ferrell and John C. Reilly as the titular duo. I put the quotes around comic, because this film dredges the bottom of the comedy barrel and comes up flailing with a flat farce. I didn't laff once during the entire movie. Much of the silliness is just that: silly (with some equally uninspired contemporary references). Reilly has a few mildly amusing moments with Queen Victoria, but that's still pretty anemic. There is absolutely nothing to recommend this miserable coupling.",
      "review_date": "2019-01-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you're a fan of Will Ferrell's early films, Anchorman, The Ballad of Ricky Bobby etc and in particular Stepbrothers, you'll absolutely love this. I wanted to see why the critics gave it such a low score and I think I understand...theyIf you're a fan of Will Ferrell's early films, Anchorman, The Ballad of Ricky Bobby etc and in particular Stepbrothers, you'll absolutely love this. I wanted to see why the critics gave it such a low score and I think I understand...they think the absolute stupidity of it is somehow accidental. If you go into a film starring these two guys expecting some kind of thrilling plot and something at all serious then you're missing the point, this is just pure, farcical lunacy which for me works on every level. The characters of Holmes and Watson are parodied so effectively, it's obvious the writers know them well and are fans of Holmes. This film is as quotable as Anchorman and I think that over time it will also achieve cult status. Any film that Rotten tomatoes gives 3% should spike your interest. I read people were walking out of cinemas but the one I was in was full of people roaring with laughter and the film even got an applause at the end, which I've never seen before. I recommend you make your own mind up about this film and don't listen to people who don't appreciate this kind of bizarre and daft comedy. The writing is top notch and Ferrell and Reilly are a joy to watch",
      "review_date": "2018-12-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "the movie is doodoo do not go and watch it , it was not funny at all and it is just an utter waste of Money and totally a waste of your time DON'T EVER WATCH THIS MOVIE I REPEAT NEVER WATCH THIS MOVIE!!!!!!! spoilers bomb in drum and Holmesthe movie is doodoo do not go and watch it , it was not funny at all and it is just an utter waste of Money and totally a waste of your time DON'T EVER WATCH THIS MOVIE I REPEAT NEVER WATCH THIS MOVIE!!!!!!! spoilers bomb in drum and Holmes send Watson to prison on suspicionthat he wants to kill the queen",
      "review_date": "2018-12-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'm not an automatic Will Ferrell fan, but my husband and I laughed all the way through this movie. It followed the traditional framework while blowing up with ridiculous glee. Both stars are delightful, as are the supporting actors, theI'm not an automatic Will Ferrell fan, but my husband and I laughed all the way through this movie. It followed the traditional framework while blowing up with ridiculous glee. Both stars are delightful, as are the supporting actors, the latter could easily play it straight. Both guys have silly love relationships which are a stitch. Go ahead and see it no matter what the reviews say.",
      "review_date": "2018-12-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was so bad. Just so bad. It is insulting to see such a talented cast wasted and look like amateurs",
      "review_date": "2019-01-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "its the worst movie that Ive seen on the big screen. really. worst scenario, at least.",
      "review_date": "2019-01-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "You can practically see the sweat flying off of Ferrell and Reilly as they struggle to mine the confused, lazy script for laughs.  They mostly succeed but don't look for the ludicrous plot to make any sense.",
      "review_date": "2018-12-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not the worst movie ever-made. Very stupid but not totally unamusing. Pretty much what you'd expect.",
      "review_date": "2020-02-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I got about 2 or 3 minutes in before I wanted to stop watching. I made it 15 minutes total before I did. Simply put, It's trash and rightfully deserves the low ratings it got.",
      "review_date": "2019-03-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you like movies filled with toilet humour, bad english accents and plot so dumb a 12 year old will be bored than this film is for you. John C. Reilly really deserves credit for being decent in probably one of the worst films of the year.",
      "review_date": "2019-04-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ignore the bad reviews! It has many laugh out loud moments, maybe some went over the heads of american audiences due the accents and british vocabulary. It's silly and a tad childish sometimes but nowhere near as bad as the metacritic scoreIgnore the bad reviews! It has many laugh out loud moments, maybe some went over the heads of american audiences due the accents and british vocabulary. It's silly and a tad childish sometimes but nowhere near as bad as the metacritic score would suggest. It's honestly worth a go.",
      "review_date": "2021-11-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "'Holmes & Watson' is an annoying and uninspired comedy that completely misuses the reliable talents of Will Ferrell and John C. Reilly. The film focuses on how Dr. John Watson (Reilly) was once contemplating suicide, but stumbles across a'Holmes & Watson' is an annoying and uninspired comedy that completely misuses the reliable talents of Will Ferrell and John C. Reilly. The film focuses on how Dr. John Watson (Reilly) was once contemplating suicide, but stumbles across a clever and mysterious man named Sherlock Holmes (Ferrell), and the two guys seem to get along and hit it off and become a duo. We see that Holmes and Watson crack many cases and solve many crimes, until they one day let the evil Moriarty (Ralph Fiennes) escape making everyone believe that he is innocent. The film then ponders along with unfunny scenes followed by even more unfunny scenes, we see that the duo are invited to meet the Queen, and discover that there was a murder and that the Queen's life is in potential danger, so the duo get on the case to find out who the culprit could be. There is no clever moments in this film, I usually admire the sharply funny Will Ferrell and John C. Reilly, whether they are together ('Step Brothers'), or when they're apart. The film, written and directed by Etan Cohen seems to restrain them from doing anything genuinely funny, and instead they are resorted to just screaming to the top of their lungs, talking and talking about unfunny things, or just making faces at each other without any worthy punchline. It's a largely misconceived comedy that badly tries to squeeze a laugh out of the audience without any use of subtlety and uses an Adam Sandler type approach. Sometimes less is more.",
      "review_date": "2019-05-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I found this a bit silly and dumb. It had its moments but still, quite forgettable overall.",
      "review_date": "2019-12-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Well... at least a bunch of people got paychecks. Not much else positive coming out of this one. Some laughs here and there, but few and far between.",
      "review_date": "2019-03-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Of Will Ferrell I could expect it without a doubt, but John C. Reilly left me very disappointed.It shows they had fun doing it. A pity that that doesn't translate into fun for the audience.",
      "review_date": "2019-02-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Honestly, was kinda underwhelmed... it was funny in segments & I love Ferrell & Reilly together, but I expected more... I expected \"Step Brothers\" level of humor... I was just felt... well \"Eh\".",
      "review_date": "2019-01-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Average comedy from what are usually very funny chaps.Not the best movie this comedy duo have ever worked in but still amusing.",
      "review_date": "2019-03-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I love reading all these pseudo intellectual ‘reviews’ They are merely your opinions - if you don’t like it, cease watching. Why prolong your agony? Life’s too short.",
      "review_date": "2019-03-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is possibly the worst movie I've ever seen. This has the most cringe and unfunny jokes of all time. The jokes are way too childish, and I don't even know if there were a lot of jokes in this movie, because they were EXTREMELYThis movie is possibly the worst movie I've ever seen. This has the most cringe and unfunny jokes of all time. The jokes are way too childish, and I don't even know if there were a lot of jokes in this movie, because they were EXTREMELY UNFUNNY. Now I think everyone knows that Will Ferrell is possibly the worst joke maker in the world. I am pretty sure that even my friends can make a funnier joke than this whole entire movie. This has a **** plot and jokes, if you still want to watch this movie even though it features will ferrell, than just go watch peppa pig because I am sure it is funnier and has a better plot and even better rating than this absolute ****",
      "review_date": "2019-03-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is Great one the Funniest movie i ever seen.. If you like Step Brothers or The Other Guys you will love this Movie.. Don't listen to the Bad reviews these are the same people that Loved Twilight the WORST movie of all time",
      "review_date": "2019-05-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie is ok, the guy who said it's really good when you are high lied. I was high. and it was OK.I just wanted to point out the fact that democracy was established in England before the first Sherlock Holmes book was written, so theThe movie is ok, the guy who said it's really good when you are high lied. I was high. and it was OK.I just wanted to point out the fact that democracy was established in England before the first Sherlock Holmes book was written, so the ridiculous rant about how Americans have democracy and don't believe in monarchy is totally stupid.Google it if you don't believe me.Anyway the movie starts off ok but slowly ends up being so boring by the end you don't even care what happens. the queen part was funny, I thought. It's OK, just OK.",
      "review_date": "2019-06-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Good movie. It just needs to be seen as an absurd Comedy....................",
      "review_date": "2019-12-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not bad as I heard or some websites are saying. This movie would not be one of best 2018 movies but the movie was okay.",
      "review_date": "2022-06-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Holmes & Watson is a comedic take on Arthur Conan Doyle's classic detective stories, featuring Sherlock Holmes and John Watson. Written and directed by Etan Cohen, the film is widely considered one of the biggest flops of 2018. The movie hasHolmes & Watson is a comedic take on Arthur Conan Doyle's classic detective stories, featuring Sherlock Holmes and John Watson. Written and directed by Etan Cohen, the film is widely considered one of the biggest flops of 2018. The movie has been criticized for its poor slapstick humor, sexual innuendo and a lack of chemistry between the lead actors Will Ferrell and John C. Reilly. The cast, which includes Kelly Macdonald, Rebecca Hall, Ralph Fiennes, Steve Coogan, Hugh Laurie, Pam Ferris and Rob Brydon, are also said to be wasted in this poorly written script. The story takes place in 1881 London and follows Watson as he meets and befriends Holmes, becoming his assistant and later moving in together to become the ultimate crime-solving duo. However, the film fails to live up to the humor and storytelling of previous adaptations and is criticized for its inconsistent and anachronistic portrayal of Victorian London. Overall, it's a movie best avoided by both fans of the original stories and comedy lovers.________________________Holmes & Watson es una versión cómica de las clásicas historias de detectives de Arthur Conan Doyle, con Sherlock Holmes y John Watson. Escrita y dirigida por Etan Cohen, la película es ampliamente considerada como uno de los mayores fracasos de 2018. La película ha sido criticada por su pobre humor, sus insinuaciones sexuales y la falta de química entre los actores principales Will Ferrell y John C. Reilly. También se dice que el elenco, que incluye a Kelly Macdonald, Rebecca Hall, Ralph Fiennes, Steve Coogan, Hugh Laurie, Pam Ferris y Rob Brydon, está desperdiciado en este guión mal escrito. La historia tiene lugar en Londres en 1881 y sigue a Watson cuando conoce y se hace amigo de Holmes, se convierte en su asistente y luego se mudan juntos para convertirse en el dúo definitivo para resolver crímenes. Sin embargo, la película no está a la altura del humor y la narración de adaptaciones anteriores y es criticada por su interpretación inconsistente y anacrónica del Londres victoriano. En general, es una película que es mejor evitar tanto para los fanáticos de las historias originales como para los amantes de la comedia.",
      "review_date": "2023-01-21",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 64,
  "genres": [
    "Adventure",
    "Mystery",
    "Comedy",
    "Crime"
  ]
}