{
  "title": "Papillon",
  "rating": 6.5,
  "release_date": "2018-08-24",
  "genre": [
    "Biography",
    "Drama",
    "Mystery",
    "Thriller",
    "Crime"
  ],
  "summary": "Based on the international best-selling autobiographic books Papillon and Banco, Papillon follows the epic story of Henri “Papillon” Charrière (Charlie Hunnam), a safecracker from the Parisian underworld who is framed for murder and condemned to life in the notorious penal colony on Devil’s Island. Determined to regain his freedom, PapillonBased on the international best-selling autobiographic books Papillon and Banco, Papillon follows the epic story of Henri “Papillon” Charrière (Charlie Hunnam), a safecracker from the Parisian underworld who is framed for murder and condemned to life in the notorious penal colony on Devil’s Island. Determined to regain his freedom, Papillon forms an unlikely alliance with quirky convicted counterfeiter Louis Dega (Rami Malek), who in exchange for protection, agrees to finance Papillon’s escape. … Expand",
  "critic_reviews": [
    "It is an impressively staged and appropriately rain-soaked, mud-splattered, bone-crunching tale, more violent and filled with rougher language than its predecessor, if not quite as powerful or moving.",
    "As director Michael Noer struggles to tease a theme out of a string of exploits, Papillon remains as entertaining as ever.",
    "Noer isn’t interested in the pulpy, wannabe mythic journey of Papillon when there’s a meatier through-line highlighting our humanity in dire straits. Rather than make his film about how far our bodies can go, he seeks to portray the lengths are hearts will.",
    "This new version, directed by Danish filmmaker Michael Noer, brings to the story a refreshing intensity and sweep, and even a sense of adventure.",
    "On its own terms, Noer’s adventure is ultimately a dramatic and dynamic-enough telling of an indelible fact-based story to connect with viewers.",
    "Even as a reboot, it remains both scenically beautiful and an ordeal at the same time.",
    "It’s true that no one’s really making films like this anymore, but it’s also true that everyone pretty much wants to.",
    "If you’re a fan of the two leads, it is worth your time, but if you’re a fan of the original film, it becomes more of a curio, an interesting comparison of filmmaking in the Seventies to what contemporary cinema gives us today.",
    "Hunnam’s reliably charismatic in suffering and in joy, but with most of the political and wartime context shaved off the story, once again, we’re left with the basics.",
    "A sumptuous-looking but slow-moving prison drama that at times will have you dreaming about an escape of your own.",
    "Mr. Malek gives an eccentric performance, but he won’t make anyone forget Dustin Hoffman, whose original Dega was an endearing coward, a fatalist and a masterpiece.",
    "What we see onscreen instead is mere competence, handsomely shot but bereft of purpose. One gets the sense that it was remade for no other reason than because more tolerant 21st-century content standards mean you can spill a man’s guts onscreen.",
    "Amazingly, the remake—by Danish director Michael Noer—is nearly as long and equally as depressing. But he’s made a slightly more exciting movie.",
    "Papillon pushes too hard with diminishing returns. Though Hunnam and Malek give it everything they’ve got, they’re denied the chance to make their characters as indelible as McQueen and Hoffman did.",
    "Hunnam and Malek both hold up their end of the deal. Noer, for his part, meets them halfway by conjuring golden-hued beauty for the jungle surroundings and a due griminess for the danker chambers of their holding compound. He doesn’t overcomplicate things for himself, keeping the clunky dialogue to a minimum and focusing on the guiding light of Papi’s indomitable willpower.",
    "Charlie Hunnam as Parisian safecracker Henri “Papillon” Charrière and Rami Malek as his pal-in-hell, counterfeiter Louis Dega, were sorely in need of richer characters written (or directed?) with more complexity, coloring, backstory, tics, or whatever might humanize them more.",
    "For despite how much I liked about Hunnam’s work here, I could never completely engage with Papillon given how little it adds to the story that’s already been told and the overdone genre of humans surviving outright torture.",
    "Hunnam makes a strong impression as a tough guy in the title role, but there’s something about either him or the filmmaking or the subject matter that allows viewers to resist making his problems our problems.",
    "What’s missing is a more personal directorial imprint.",
    "As for the new Papillon, it wisely doubles down on high adventure, but it’s still as lifeless as its predecessor. Just in different ways.",
    "This remake proffers the sort of cinematic nowhere place that's all too common of an increasingly corporate, globalized cinema.",
    "The remake of Papillon doesn’t lack for potential metaphorical riches, yet this brutal, bruising film never quite connects with its deeper themes, resulting in a story full of suffering but not enough transcendence.",
    "Just as in the book, the memorable part of this story is its ripe black-comic business.",
    "At a slow two hours plus, the film feels stretched.",
    "Mr. Hunnam isn’t yet a movie star, and given current industry trends (big-studio cartoons, superhero flicks, etc.) might never get that chance. His talent is for quiet, unshowy moments, not leading-man grand gestures and important speeches.",
    "This Papillon just lopes from place to place, and indignity to indignity, without any special style or verve.",
    "There’s no real voice in the storytelling, nothing distinctive about the imagery, if it’s not a doubling up on the violence and gore, and the result doesn’t remotely resonate in the same way.",
    "But for all the period detail, characters are a little too healthy and well-scrubbed to be convincing and the actual look of the film is video-flat and dull — ugly.",
    "The story is far less gripping than the consistency of the hunky lead actor’s facial hair. For most of the two hours or so, the beard is perfect. Frozen in time.",
    "The only real crime here is the debasement of a great film’s name.",
    "With no unique viewpoint on the story of its own, it’s perplexing why Papillon went in front of cameras at all."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "After appreciating the 1973 original, I honestly didn't think I'd enjoy viewing the remake; but I did. Not a great movie, but enjoyable. It's primary purpose, I think, was to show how terribly cruel men can become when they're given too muchAfter appreciating the 1973 original, I honestly didn't think I'd enjoy viewing the remake; but I did. Not a great movie, but enjoyable. It's primary purpose, I think, was to show how terribly cruel men can become when they're given too much power over other men. It's definitely worth seeing, but it's not for young children.",
      "review_date": "2019-03-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "La película empieza demasiado rápido no nos explican mucho y todo parece pasar por que si, eso me hizo mucho ruido y es mi principal punto negativo pero mientras avanza la película me di cuenta que lo que realmente importa es él desarrolloLa película empieza demasiado rápido no nos explican mucho y todo parece pasar por que si, eso me hizo mucho ruido y es mi principal punto negativo pero mientras avanza la película me di cuenta que lo que realmente importa es él desarrollo del personaje en la prisión. Muy buenas actuaciones de charlie hunnam y rami malek, excelentes maquillajes y una fotografía casi impecable todo bien manejado por él director michael noer. Muy recomendable",
      "review_date": "2018-11-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "As I was watching “Papillon” a few thoughts went through my mind such as:1) Why did I come to see this movie?\n\n2) When will I learn it is okay to walk out of a boring movie?\n\n3) Charlie Hunnam could walk into Daniel Craig’s shoes as JamesAs I was watching “Papillon” a few thoughts went through my mind such as:1) Why did I come to see this movie?2) When will I learn it is okay to walk out of a boring movie?3) Charlie Hunnam could walk into Daniel Craig’s shoes as James Bond and I don’t many would know the difference.4) Hopefully Rami Malek’s next movie as Freddie Mercury in “Bohemian Rhapsody” will be a big hit because as he tries to make the move from television star, with his series “Robot” going into its last season, “Papillon” isn’t helping him.5) Why does Hollywood continue to spend millions on making remakes when very few are as good, and even few better, than the originals? Especially those that are thought of as classics or have had unforgettable leads?6) Does adding more violence and/or more nude males in prison make a movie better?7) Though I am not familiar with previous works of Charlie Hunnam he does express a lot with just his face and emotions he is feeling but, right now, he is not quite the Steve McQueen of the 1973 original “Papillon”.Obviously, my thoughts strayed as I was watching the movie or turning my head away with some of the gratuitous violence but the bottom line is the story screenplay and none of the actors drew me into the movie to knock those thoughts out of my head.The next remake coming up is “A Star Is Born” starring Bradley Cooper, who also directed, and Lady Gaga. I have seen and am a fan of the original and the two remakes, each for different reasons, and am hoping this new version will be the exception to the rule about remakes and be their equivalent.The bottom line is I found “Papillon” a bore and would suggest you watch the original as that is a film that Hollywood doesn’t make, a two-star action prison film epic that you really believed happened.",
      "review_date": "2018-08-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Everybody always says the book is way better than the movie. This book is way way way way better than the movie. That would be 4 times better but its exponential. So the book is 64 times better.Don't see this movie. Buy the book, settle inEverybody always says the book is way better than the movie. This book is way way way way better than the movie. That would be 4 times better but its exponential. So the book is 64 times better.Don't see this movie. Buy the book, settle in for a day, a be prepared for total amazement, inspiration, entertainment, and awe. THEN buy the next book Banco which tells about Papillons life after escape. Follow my advice be bored and waste a precious day of your life. Your choice!",
      "review_date": "2018-08-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This remake of the remarkable true story sentences Charlie Hunnam and Rami Malek to the brutal penal colony in French Guiana for misery, struggle and 2 escape attempts. Thru it all, their friendship prevails. This relentlessly cruel andThis remake of the remarkable true story sentences Charlie Hunnam and Rami Malek to the brutal penal colony in French Guiana for misery, struggle and 2 escape attempts. Thru it all, their friendship prevails. This relentlessly cruel and desperate situation is effectively portrayed, but Hunnam brings only steely determination to his portrayal…not much depth. The character weakness in Malek's character makes it easier for him to be more sympathetic. Still, this is more about the wretched conditions than about human resolve, leaving it bleak and less powerful that the story deserves.",
      "review_date": "2018-08-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Malek and Hunnam's performances can't save this film from the overly long run time and slow pace. So much of this film could have been edited down, Especially that near 20 minutes long solitary confinement scene, but wasn't and that's whatMalek and Hunnam's performances can't save this film from the overly long run time and slow pace. So much of this film could have been edited down, Especially that near 20 minutes long solitary confinement scene, but wasn't and that's what really kills it for me. It's not exciting, It's not interesting. It's boring and it fails to keep your interest.",
      "review_date": "2019-03-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a remake of the 1973 movie that starred Steve McQueen and Dustin Hoffman.  I thought i remembered liking that movie, but I am not so sure now.  In this new version, Charlie Hunnam plays the title character and Rami Malek plays Degas.This is a remake of the 1973 movie that starred Steve McQueen and Dustin Hoffman.  I thought i remembered liking that movie, but I am not so sure now.  In this new version, Charlie Hunnam plays the title character and Rami Malek plays Degas.  They both do a great job of portraying their characters, and you will find that you really care about them.  But, the movie is so dark, humorless and relentlessly depressing, that it is difficult to sit through.  I kept wishing I was watching it on DVD so I could fast forward through some of it.   Because it is so dark, I would not recommend it.  But, if you really want to see it, wait until it comes out on DVD so you have the option of fast forwarding or walking away from it.   Plus it is way too long.  There were at least a few places that the movie could have been edited much better to save time.",
      "review_date": "2018-08-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I found this movie really interesting. Based on real events and great acting from both leads. Might be a bit slowed paced for some but I liked it anyway",
      "review_date": "2019-12-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Both Charlie Hunnam and Rami Malek give good performances but lack chemistry and considering the story is entirely based on their characters that becomes a problem.It's entertaining enough but its narrative rhythm doesn't do any favors toBoth Charlie Hunnam and Rami Malek give good performances but lack chemistry and considering the story is entirely based on their characters that becomes a problem.It's entertaining enough but its narrative rhythm doesn't do any favors to it, especially considering the slowness with which the first half hour unfolds but the film gets recovered and although it will not leave any memorable impression or I doubt you talk about it after finish it I think it deserves the opportunity to be seen.",
      "review_date": "2018-09-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie missed a real chance to be something special. All the ingredients are there, two very strong leading roles, a story with real potential, but somehow it all just doesn't exactly fall in to place. I enjoyed myself for large parts ofThis movie missed a real chance to be something special. All the ingredients are there, two very strong leading roles, a story with real potential, but somehow it all just doesn't exactly fall in to place. I enjoyed myself for large parts of the movie, but also found myself desperately wishing for the end of some scenes that got dragged on for far to long. That being said, Charlie Hunnam has come a long was since Green Street Hooligans, and will hopefully make an appearance in another movie that better suits his talents. He and Rami Malek both play excellent roles, it's the writers that fail to bring emphasize the chemistry between the two characters that is obviously there (hence the coconut scene). Conclusion, this movie could had the potential to be a lot better, but thanks to it's leading actors, was still acceptable to watch.",
      "review_date": "2018-10-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A story about a man that was too arrogant, and got himself into jail. From that point on, his story transforms into one about heroism and strength as he never gives up on his hope to escape the hellish prison in French Genua in 1931. .\nWhatA story about a man that was too arrogant, and got himself into jail. From that point on, his story transforms into one about heroism and strength as he never gives up on his hope to escape the hellish prison in French Genua in 1931. .What strikes me the most from watching this movie, is the sheer strength in Papillon to survive 7 years of solitary prison, and yet not give up. By the time he does escape, and probably settles in Venezuela, the world is at the tipping point of going into World War II. For this man however, that must have weight much less considering what he has been through.Despite what some critics are saying with 'this movie offers little', i judge every story for what it is. And the story in this movie was very interesting and entertaining to watch. It's an excellent movie, and i give it an 8/10.",
      "review_date": "2019-08-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The movie is a bit long but never boring. Its a repetitive mix between hope and letdown. What will gain the upper hand?",
      "review_date": "2021-04-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I hadn't  watched the 1973 Papillon.I liked this powerful story. It made me feel Googling about it.The French Guiana is beautiful.But I didn't know there was very brutal atrocities here.I learned a lot of things!",
      "review_date": "2019-07-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "On dirait déjà un téléfilm… rien qu’au bout d’un quart d’heure ! et la suite des évènements ne fait que confirmer ce triste état de fait. Tout y est en effet sans relief et sans génie, tout baigne dans la médiocrité d’un remake poussif duOn dirait déjà un téléfilm… rien qu’au bout d’un quart d’heure ! et la suite des évènements ne fait que confirmer ce triste état de fait. Tout y est en effet sans relief et sans génie, tout baigne dans la médiocrité d’un remake poussif du film original de 1973, un classique à la mise en scène brillante de Schaffner et servi évidemment par deux acteurs exceptionnels…Or, ici le charismatique McQueen est remplacé par un bellâtre (pour ne pas dire une andouille) qui joue comme un pied et quant au rôle d’Hoffman, si Malek n’est pas un mauvais acteur en soi, il ne peut certainement pas rivaliser avec le monstre sacré !A tenter de visionner ce truc, on ne cesse de le comparer à son aîné, lequel malgré son âge vénérable ne s’en laisse pas compter par le petit nouveau, loin de là ! un vrai bleu-bite, ce Papillon moderne qui sonne creux et faux à l’instar de sa réalisation de téléfilm ; on s’irrite de ses maladresses, c’en devient un supplice à suivre : on arrête donc les frais rapidement et on tire la chasse, point merde.",
      "review_date": "2022-06-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "There was no way that this remake could surpass the original Movie from 1973. After watching this version my thoughts got confirmed. But i still very enjoyed this Movie. I think its primary purpose is to show how heartless and cruel HumansThere was no way that this remake could surpass the original Movie from 1973. After watching this version my thoughts got confirmed. But i still very enjoyed this Movie. I think its primary purpose is to show how heartless and cruel Humans can be when there are given way to much power. The two Main Actors have some chemistry together but sadly it never reaches the same Level of believable Friendship like in the Original Movie. But still if you don't expect to much you have an solid Adaptation of the Book. Overall nothing Special but an enjoyable Movie with interesting themes, so its worth watching.",
      "review_date": "2019-06-14",
      "source": "metacritic"
    }
  ],
  "num_reviews": 46
}