{
  "title": "Spider-Man: Into the Spider-Verse",
  "rating": 8.2,
  "release_date": "2018-12-14",
  "genre": [
    "Action",
    "Adventure",
    "Sci-Fi",
    "Comedy",
    "Animation",
    "Family"
  ],
  "summary": "Spider-Man: Into the Spider-Verse introduces Brooklyn teen Miles Morales, and the limitless possibilities of the Spider-Verse, where more than one can wear the mask.",
  "critic_reviews": [
    "There’s never been anything like this animated exaltation of the Spider-Man canon. The animation is glorious, and more faithful to its comic-book roots than any big-screen graphics in the past. The story is deliciously witty and preposterously complex, but perfectly comprehensible, whether or not you have studied quantum physics. The scale feels vast, yet the spirit is joyous. It’s as if everyone had set out to make the best Spider-Man movie ever, which is exactly what they’ve done.",
    "[A] crazily imaginative, hilarious and frenetic animated feature that’s practically a palate-cleanser for comic book earnestness.",
    "One of the wittiest and most creatively exuberant movies of the year, and maybe one of the best.",
    "This is an inclusive, diverse, multi-level, multi-layered, funny, warm, cool, richly detailed, lovingly rendered, friendly neighborhood instant classic.",
    "Besides the huge smiles on your faces, Spider-Man: Into the Spider-Verse offers mainstream moviegoers an overwhelming feeling of optimism. If this kind of risk-taking and artist-driven creativity can exist in Hollywood’s biggest money-making genre, then our superhero movie future is filled with hope.",
    "Fresh, funny and frequently bonkers, Into The Spider-Verse is an astonishing shot of cinematic superhero adrenaline. For such an over-familiar character, somehow, this feels original and entirely new.",
    "A joyful, trippy new incarnation of Spider-Man that you didn’t know you needed, brimming with wit, soul and jaw-dropping visuals.",
    "Spider-Man: Into the Spider-Verse is a raucous, smart, self-referential adventure. The comics-inspired visuals are stunning, and the emotional coming-of-age story is relevant and inspiring, even as it acknowledges the many Spider-Man movies that have come before it.",
    "It’s incredibly thrilling to watch, impressively emotional throughout, and easily the best Spider-Man movie since “Spider-Man 2.”",
    "Ultimately, this particular intensely collaborative endeavor clicks on all cylinders in a manner even the MCU could learn from. As a result, Spider-Man: Into the Spider-Verse vaults into consideration as one the best Spider-Man films ever.",
    "Spider-Verse feels fresh precisely because it breathes new life into an old story without abandoning the basics.",
    "There’s a breathless sense of discovery and play that makes the film seem new, even as it’s tap-dancing through the imprints of so many sci-fi stories throughout the years. Simply put, superhero movies don’t often carry this sense of possibility anymore.",
    "It breathes youthful life into a tired franchise and makes the smartest transition yet of characters from the comics to the big screen with clever animation and thoughtful storytelling.",
    "Spider-Man: Into the Spider-Verse contains a vital element that has been missing from too many recent superhero movies: fun.",
    "Not only the coolest Spider-Man epic ever, it’s one of the best movies of the year.",
    "Spider-Man: Into The Spider-Verse is a celebration of limitless creativity that honors comic book runs of the same freeing mentality.",
    "This animated movie has more heart and emotion than most live actions films of this genre. If you give it a chance, Spider-Man: Into the Spider-Verse will knock your socks off.",
    "It’s terrific — a quick-witted entertainment, daring and familiar by turns, that also proves to be sweet, serious and irreverent in all the right doses.",
    "Spider-Man: Into the Spider-Verse delivers a dynamic visual experience unlike any other.",
    "It all comes back to the heart of the Spidey story, the old adage that \"with great power comes great responsibility.\" It's tough doing the right thing, and sometimes it's thankless and can come with a lot of pain, but it's still the right thing, and that's why you do it. Spider-Man: Into the Spider-Verse always comes out swinging.",
    "The visual design is a trip, combining a comic-book aesthetic (not just the use of panels and dialogue balloons, but also digital tricks that mimic the hand drawing and paper printing of an actual comic) with the dynamism of state-of-the-art animation.",
    "The more-is-more approach to superhero movies is usually a deadly mistake, but it works nicely in the animated Spider-Man: Into the Spider-Verse.",
    "Might be the best Spider-Man film ever made.",
    "The move is a blast.",
    "A film that’s fantastically fresh, both visually and narratively, trippy and post-modern at the same time and packed with intriguing storytelling tools, humor, empathy and action, while also true to its roots — still telling the story of a young man learning to accept the responsibility of fighting for what’s right.",
    "It would seem like an impossible feat, but somehow, directors Bob Persichetti, Peter Ramsey, and Rodney Rothman have breathed thrilling new life into the comic book movie. The way they play with tone, form and texture is constantly inventive and giddily alive.",
    "Into the Spider-Verse is pure fun, nonstop from start to finish.",
    "It’s zippier than “Incredibles 2,” and nearly as witty as the first “Lego Movie,” with whom it shares a very funny screenwriter, Phil Lord.",
    "The experience is simultaneously intimate and stirring; the film brings its audience to a thrillingly colorful and utterly relevant world of its own at a time when the primary purpose of other superhero movies seems to be to tease future installments and fill corporate coffers.",
    "The movie proves a New York teen superhero can do more than just excitedly swing around. He can move us, too. It’s the best stand-alone film to feature the iconic character so far. And it’s animated.",
    "It’s a slightly insane, hilariously daring and often touching mashup of everything that makes super-flicks so darn popular with the introduction of a Spider-Man who's ready-made for today’s generation of kids.",
    "Spider-Verse is a dreamy, funny, self-aware, visually explosive delight, with a sharper sense of humor than the sophomoric, wearying Deadpool, a keener, more kinetic sense of action than most of the live-action Avengers films (save maybe Ant-Man), and richer ideas than most of the visually muddy, self-serious DC films we’ve gotten to date.",
    "The filmmaking itself is often witty, finding gags in whip-crack editing and shifts in perspective.",
    "Tragic news for anyone who’s sick of superhero movies: Spider-Man: Into the Spider-Verse completely reinvigorates the genre, reaffirms why it’s resonating with a diverse modern audience that’s desperate to fight the power, and reiterates to us how these hyper-popular spandex myths are able to reinvent themselves on the fly whenever things get stale.",
    "Spider-Man: Into the Spider-Verse is probably the best-animated superhero tale to do justice to the pulp comic book fan both in style and content. It upholds the spirit of Marvel Comics by juxtaposing the humanity of each hero and villain against the prerequisite kick-ass action sequences. At let’s face facts, the art direction is the true star of the film.",
    "There’s lots to love here, not least the animation itself, which uses split screens, Ben-Day dots and onomatopoeic text that mimic the tactile experience of reading physical comics – panels, hatching and primary colours intact and ready to leap off the page.",
    "Sure, some of the plot twists are a bit labored, and there’s maybe a henchman too many—but, trust me, you’ll be too busy rooting for the superhero with a snout to care.",
    "The world doesn’t really need another Spider-Man movie, which is exactly what makes Spider-Man: Into the Spider-Verse such an unexpected delight: Here’s the latest entry in a fully saturated genre that somehow, through sheer creative gumption, does something new.",
    "Perischetti, Ramsey and Rothman’s picture is an irresistible treat throughout, an unadulterated confection crafted with wit, vivacity and heart.",
    "Much like the first \"Lego Movie,\" Spider-Verse feels like a bit of a conceptual dare, but it wins with its nano-second sharp timing, and percussive rat-a-tat-tatting of panels and split screens that make the action and visual gags feel jumpy and alive.",
    "After a solid decade of Marvel movies modeled on the same template, it’s a thrill to watch one that’s allowed to find its own rhythms, to play with form and content without contorting the plot to fit in a minor character who might become important five movies from now.",
    "It’s the kind of seemingly effortless success that makes producing a good superhero movie look easy: find a likable hero and a colorful villain, hire someone who knows how to write a punch line, and for Stan Lee’s sake, keep it fun.",
    "A confident blend of comic-book élan and stirring sentiment, Spider-Man: Into The Spider-Verse finds fresh ways to tell the familiar story of everyone’s favourite web-slinger.",
    "With its risky visual storytelling and tender script, Into the Spider-Verse earns the greatest honor that one can bestow on a Spider-Man movie: It somehow makes you want to see more Spider-Man movies. Including at least a few more for Miles Morales alone.",
    "Into the Spider-Verse really is the ultimate Spider-Man film in a lot of ways, the one that crystallizes the character’s moral philosophy, his life lessons, his arachnid athleticism, and his quirky sense of humor into one hugely appealing package. It’s pure dorky fun.",
    "With its fine-tuned comic timing and feeling of constant action, Into the Spider-Verse is downright invigorating, and that’s evident even before it gets to its dazzling, dimensional-colliding climax.",
    "In the end, while the movie’s wit is its most satisfying selling point, “Spider-Verse” proves too clever for its own good. But in this universe, where audiences are suffering from the very real phenomenon of superhero overload, ambition and originality are to be encouraged, especially it broadens the mythology to include women, people of color, and yes, even that hammiest of scene-stealers, Peter Porker.",
    "The freshest and most stimulating aspect of the film is the visual style, which unites the expected Marvel mix of “universes” (it used to be assumed there was only one universe in creation) with animation that looks both computer-driven and hand-drawn, boasts futuristic as well as funky urban elements, moves the “camera” a lot and brings together a melting pot of mostly amusing new characters.",
    "For a film that invites so much self-aware chortling over franchise in-jokery, you feel Spider-Verse has missed something essential from its own screen history.",
    "No, Sony Animation should not have let Spider-Man: Into the Spiderverse out its doors and onto big screens in this blurred, jerky, pixelated condition."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "The Best Spiderman Film since the Sam Raimi's Adaptation.This film is an Art a Masterpiece, and a jaw dropping beautyI just can't stop awe-ing at every scenes especially the best parts in the movie,because the animation is just so damnThe Best Spiderman Film since the Sam Raimi's Adaptation.This film is an Art a Masterpiece, and a jaw dropping beautyI just can't stop awe-ing at every scenes especially the best parts in the movie,because the animation is just so damn eyegasm and unique There are no flaws in the story and Under-developed Character...Every character is developed perfectly, Miles Morales his character itself is likeable and relatable.I love this movie, it is a must see to every Spiderman fansI WOULD LOVE TO SEE A SEQUEL",
      "review_date": "2018-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Apparently my score will seem low and while I wasn’t blown away by this like everyone else, I found this film colorful, fun and surprisingly poignant. The climax gets pretty cluttered in all that’s going on, but by that time you’re investedApparently my score will seem low and while I wasn’t blown away by this like everyone else, I found this film colorful, fun and surprisingly poignant. The climax gets pretty cluttered in all that’s going on, but by that time you’re invested in the characters. Oh, and the Stan Lee cameo is an accidentally brilliant sendoff to the legend.",
      "review_date": "2018-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Blurry animation, lame cliched multiple-universe plot, and ultimately the whole thing is just derivative of the real Spider-Man story with fake affirmative action characters. Hard pass!",
      "review_date": "2018-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Absolutely awesome, thoroughly enjoyed this movie. To be honest, initially I was skeptical, but the animation as well as the storyline blew me away. Great job.",
      "review_date": "2019-03-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nOne of the best comicbookmovies ever made, the animation is fantastic ,its funny, the action is good, and it is also a very emotional movie, with his uncle being the villain !Great movie 9,5/10",
      "review_date": "2020-06-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie was excellent! First of all, this has some of the most stylish and unique animation I have ever seen! It’s unlike anything I’ve seen from an American animated film before, it was fantastic to see! The story was really great tooThis movie was excellent! First of all, this has some of the most stylish and unique animation I have ever seen! It’s unlike anything I’ve seen from an American animated film before, it was fantastic to see! The story was really great too with a lot of heart and lots of twists and turns! I do think that there probably were too many characters in the movie, but that’s the only issue I have with it. This is a must-watch for any superhero fan and fans of animation in general! It looks stunning, the action is thrilling, and it has all the feels! Highly recommended if you haven’t seen it yet.",
      "review_date": "2019-09-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Truly original.I thought I had seen almost everything I could see in relation to Spider-Man, because he is one of those characters who insists on returning to the cinema with some regularity. To make matters worse, the industry, andTruly original.I thought I had seen almost everything I could see in relation to Spider-Man, because he is one of those characters who insists on returning to the cinema with some regularity. To make matters worse, the industry, and particularly Marvel, flooded theaters with films about cartoon characters, from the most famous to the most obscure, and this became repetitive, trivializing the genre.But this film has nothing to do with the others. In fact, instead of following the path of ultra-realism that other animated films have followed or limited to being a spin-off or reissue of the character's story, the film transports us totally to the world of comic books, assuming for you that stylized look that these publications have, and bringing a totally new and different story, with an African American Spider-Man who tries to succeed the original, after witnessing his death, and save the world from destruction with the help of several versions of the hero from various parallel universes. Even the famous Spider Pig (even those who have never seen the Simpsons know) will appear!The film features several famous actors who give the voice to the various characters (Shameik Moore, Jake Johnson, Mahershala Ali, Hailee Steinfeld, Nicolas Cage etc.) and is visually impressive, full of effects taken from the comic books on paper and a CGI state-of-the-art. The sound is also impressive, both in the action scenes and in relation to the soundtrack, where Hip Hop and suburban rhythms predominate. The pace of the film is quite fast, with breathtaking scenes.I had little expectations when I went to see this film, but I have to admit that it is truly exceptional. However, it turns out to be so bold and so different from the ordinary that this can make it indigestible to some audiences.",
      "review_date": "2020-02-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "O filme é otimo, boas referências e aquela cena pos credito foi bem engraçada, mas acho que a homenagem para o stan lee deveria ser bem maior.",
      "review_date": "2019-06-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Simply the best superhero movie ever. No false note, no errors, supports a lot of vision. PERFECT.",
      "review_date": "2020-09-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Oh wow. I am blown away. How on Earth did an animated film such as this do so well? And how were they able to take all these separate characters and give them so much development without the film feeling like a drag.",
      "review_date": "2020-01-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don't typically go for superhero movies (although I love the superheroes behind them), and I had little faith in Sony's animation team at the time. That being said, Spider-Man: Into The Spider-verse has proven to me to be among the mostI don't typically go for superhero movies (although I love the superheroes behind them), and I had little faith in Sony's animation team at the time. That being said, Spider-Man: Into The Spider-verse has proven to me to be among the most memorable films of the last decade. It has this incredible sense of charm, humor, and whimsy in way Spider-Man hasn't been able to capture since Spider-Man 2 in 2004. What's more, this is the most well-animated film I have ever seen, seamless blending a smorgasbord of styles while maintaining a magnificent sense of stylistic cohesion so as to not allow the numerous styles to crowd one another out.",
      "review_date": "2020-05-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An animated superhero masterpiece. Great animation and visual designs. Please watch.",
      "review_date": "2020-05-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best superhero movie in my opinion. This is just a masterpiece through and through. The soundtrack is absolutely incredible. Animation as everyone has pointed out is breath taking to say the least. Character development throughout the movieBest superhero movie in my opinion. This is just a masterpiece through and through. The soundtrack is absolutely incredible. Animation as everyone has pointed out is breath taking to say the least. Character development throughout the movie is great. Really felt like by the end of it no one was underused or overused. All played their part well. And it was just a really satisfying movie altogether. Would recommend to, pretty much everyone.",
      "review_date": "2020-11-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Spider-Man and Miles Morales enter an animated world with Into The Spiderverse, one of the best Spider-Man movies that mixes a good story, good animation and good humor.",
      "review_date": "2022-04-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is my second favorite Spider-Man film and easily a strong contender for best Spider-Man movie ever made right up there with Spider-Man 2. I gave the movie a 10 but it is a light 10 as I do have some problems with it. He has some of theThis is my second favorite Spider-Man film and easily a strong contender for best Spider-Man movie ever made right up there with Spider-Man 2. I gave the movie a 10 but it is a light 10 as I do have some problems with it. He has some of the most stylish and unique animations I have ever seen! It’s unlike anything I’ve seen from an American animated film before, it was fantastic to see! The story was really great too with a lot of heart and lots of twists and turns! I do think that there probably were too many characters in the movie, but that’s the only issue I have with it. This is a must-watch for any superhero fan and fans of animation in general!",
      "review_date": "2021-12-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was a thoroughly enjoyable and awesome movie! The music was spot-on, the animation slick, and it made me laugh and sit up in my chair more than once. Peter B Parker was fantastic when contrasted with Peter Parker, and I'd have liked toThis was a thoroughly enjoyable and awesome movie! The music was spot-on, the animation slick, and it made me laugh and sit up in my chair more than once. Peter B Parker was fantastic when contrasted with Peter Parker, and I'd have liked to see more of Spiderman Noir! Totally blew me away.",
      "review_date": "2019-03-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "On one point I stopped watching animated movies. And spider man is really not my favourite character. But as the trailer came in and the critics who had already have seen the movie have been so positive about the movie I thought, OK, let'sOn one point I stopped watching animated movies. And spider man is really not my favourite character. But as the trailer came in and the critics who had already have seen the movie have been so positive about the movie I thought, OK, let's give it a chance. And wow. I was so surprised: this is the best animated movie I have seen. There are parts of the settings where I was blown away by the visual ideas. The tone, the mood, the style. Everything was just mastrefull. The story was well structured, although the twist was not that hard to figure out. Still: worth see as it hits you a little bit emotionally. No spolers, so you should get that experience yourself.I hope we will get a second part … This is my approach to spider man. And I like it.",
      "review_date": "2019-03-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie was amazing. Visuals were great, the best media that Spiderman was attached to and just an interesting idea that had a great execution. Also Nicolas Cage was in it.",
      "review_date": "2019-05-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Everything is great on this tape.I love the color balance,bright in every way.",
      "review_date": "2019-02-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "To be honest I didn't know what to expect from this movie it came from a studio that made amazing Spider Man films like SpiderMan 1 and 2. Then Sony made mediocre and almost bad films with The Amazing Spider-Man series and SpiderMan andTo be honest I didn't know what to expect from this movie it came from a studio that made amazing Spider Man films like SpiderMan 1 and 2. Then Sony made mediocre and almost bad films with The Amazing Spider-Man series and SpiderMan and Sony's animation films are hit and miss but some how they nailed it with this one.First off the visuals and animation were amazing at first I thought it would be jarring but that wasn't the case as usually films which try to do movies in comic book style usually fails...cough Hulk(2003)cough.but luckly this is an animation movie so it works brilliantly so well done Sony. The characters in this movie are also well fleshed out and contributed to the story significantly in one way or another.Miles Morales and Peter Parker and Spider-Gwen were the best characters and each were a delight to watch,funny and more. And shout out to (spiderman) the peter parker voice actor who usually acts in comedy did great voice work for Peter Parker and I can confirm is very different to what you see in love action films but really captures the feel of Spiderman.The movie was really bold as well from the different visuals the story involving parallel dimensions and universes which worked because you could see from glimpse that every universe felt different and unique.Also the film felt really mature even from a PG movie it felt like a hardcore PG film with its themes,drama and consequences especially the Kingpin charcter and a heartbreaking arc involving Peter Parker and I for one enjoyed that.The music was also nice.Miles Morales who the story is based on is a good lead from the voice acting and up. You could see the struggle he was dealing with trying be Spiderman and the responsibility of it and that's what Spidernan has always been about with great power comes.....you know the line.His character grows and develops over time as he dealt with the trails and tribulations of being Spiderman and by the end it payed off which was nice to see. The main Villain Kingpin had a compelling reason for his evil actions and has kind of intimidating a bit like like the Netflix Kingpin, which was a really mature take on a pg movie so agian another plus for the movie although there some generic bad guy things and dumb decisions that villians make in this movie but since its a kids movie i'll just let it slide.The other Spiderman people were really good too like Spiderman Noir, Spiderham and Pennie Parker were really entertaining with the screen time they were on though sometimes they felt have much variety sometimes compared too Spider Gwen,Peter Parket or Miles Morales.The action is pretty good as well and its done well with the comic book style animation as words or phrases would pop up on the screen like a comic book so that was fun and the comedy was really well timed and hasn't forced unlike the MCU movies it balanced the drama and humor aspect well in the movie.However my biggest gripe about the movie is that some character arcs weren't would fully resolved or plot holes per say especially for Miles Morales' Dad and his Uncle I cant go into details without spoiling but there was an issue that happened that semed it was forgotten about and never fully solved. Also just minor nitpicks is that you dont get to see Miles Morales be Spiderman for really long or really show off what he can do but I understand its an origin story so its understandable and sometimes the movie wanted to do some fourth wall breaking like Deadpool but only in minor moments which felt kind of out of place.So in the end there was very little wrong with this movie, I enjoyed almost every bit of it. It was funny, fun,colorful with really good animation,bold art style, amazing characters, blanced humor,great lessons about responsibility and courage and the drama was really well and was just an overall great movie. So again Well done Sony for making one of the best Spiderman movies ever and one of the best films of 2018.",
      "review_date": "2018-12-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "By far the best Marvel movie since Spider-Man 2, Into the Spiderverse reinvigorates the comic book movie genre by perfectly integrating the comic book art form with cinematic conventions. It succeeds as both an art film and as a kid-friendlyBy far the best Marvel movie since Spider-Man 2, Into the Spiderverse reinvigorates the comic book movie genre by perfectly integrating the comic book art form with cinematic conventions. It succeeds as both an art film and as a kid-friendly studio franchise film in unexpected ways. There are a few moments where the animation and story veer towards \"direct to video\" kiddie cash-grab territory, but overall this film accomplishes more than most big-budget live-action superhero franchise films even attempt.",
      "review_date": "2018-12-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Amazingly how SpiderMan has come to animation. I love every characters in this movie and I really want to watch it twice",
      "review_date": "2018-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I came into this movie with larger-than-life EXPECTATIONS. After a horde of online praise from both critics and users alike, not to mention instant Oscar buzz, I was primed for disappointment as i thought a movie can never be that good.II came into this movie with larger-than-life EXPECTATIONS. After a horde of online praise from both critics and users alike, not to mention instant Oscar buzz, I was primed for disappointment as i thought a movie can never be that good.I was huge Spider Man fan, from the first Sam Raimi movie to the 2nd, and then it stopped there. I watched the third movie in the franchise (and had to re-watch it just to make sure I didn't see it on a bad day) and was just thoroughly confused. The Andrew Garfield movies were just awkward to me and I just gave up.This new movie however? BALL-BUSTERS!From the opening image referencing the Comics Code Authority (I promise that would be the last and only spoiler this will have!) I knew right then and there that this movie means business, the business of not taking itself too seriously.I had my doubts about having \"another\" Spider Man or any other Spider Man for that fact. I never was a fan of the early nineties story arc of cloned versions of Peter Parker. I thought this would be another way of today's media just pissing on already existing beloved IP like the way CW is doing to Superman in their Super Girl series. I was ready for Sony to just poop all over Spider Man, especially now that he's part of the MCU. More on this point later.We're introduced to Miles Morales, a brilliant kid from Brooklyn who just wants to make his own mark in the world and find his own special place, just like everyone of us. He is a character that all us can relate to with his constant struggle with the mundane. Even worse, being a teenager while he's at it.It is a totally down-to-earth story filled with everyday stories about growing up and handling expectations, until that is, he gets bitten by a radioactive spider. If you feel like that's a spoiler, where the hell have you been hiding the past few decades? It's every Spider Man's right of passage, get bit by a Spider, be Spider Man.He then gets thrust into a the bizarre world of being Spider Man and along the way realizes that it's not all fun and games and yes, indeed, with great power comes great... No I won't finish that sentence, Peter!Being a comic-book movie, the action is non-stop but what really sets it apart from a sea of such movies is the absolute grandeur of all it.The wonderful set-pieces beautifully drawn and rendered, will make you believe that this alternate universe of Brooklyn really does exist, and makes you wish you live there instead. It's captures Brooklyn's hipster and art culture beautifully, just that short of being artistic. Mind you not Blade Runner 2049 artistic, It wont give you headaches and make you think about the meaning of life or anything. Just wonderful.The best part, apart from the visual orgasm, is the soundtrack. It is never obtrusive and always on point. Lead by the promotional singe \"Sunflower\" by Post Malone and Swae Lee, the hip-hop and pop inspired score and soundtrack is absolutely blissful. Ever since the Black Panther soundtrack blew me away, I feel that i now love this music in EVERYTHING.This may be a super-hero movie but this is an offering I highly suggest the whole family watch. It has everything for everyone, with nostalgic (and I do mean NOSTALGIC) easter-eggs and shout-outs for even the snootiest of fans to references to the culture for today's youth. I give that an absolute perfect score. This is what a super-hero movie should be like. Hands down MY favorite movie of the year.",
      "review_date": "2018-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nE-Value: 9Acting: 9Plot: 9Similar to Venom which was released months ago, this is one of the perks from sharing the movie rights of Spider-Man between Sony and Disney. Unlike the previous Spider-Man movies, not only did Spider-Man receive an animated movie with a theatrical release for the first time but it also stars Miles Morales as Spider-Man instead of Peter Parker.Miles Morales (Moore) is a boarding school student, who admired Spider-Man as a hero. One day while hanging out with his uncle, Aaron Davis, in an abandoned subway, he was bitten by a radioactive spider which gives him similar abilities like Spider-Man. Later on, he discovers a secret laboratory where he witness notorious crime lord, Wilson Fisk/Kingpin (Schreiber), who is building a particle accelerator for some evil purpose and Spider-Man is trying to stop him.Although Spider-Man successfully disables the machine, Kingpin manages to kill him due to Spider-Man being wounded from the fight. With his death and identity exposed, the city mourns their beloved hero. Inspired by his death, Miles wants to fight crimes to honour him. He is then approach by what appears to be Peter Parker. Confused at first, Miles soon realise that this Peter Parker (Johnson) is actually from another universe where Miles does not exist and he is still Spider-Man but having trouble with his personal life.Both Peter and Miles learn that Kingpin’s particle accelerator have brought him to Miles’ universe. Peter reluctantly trains Miles to be Spider-Man while working together to stop Kingpin and brings Peter back to his universe using the same machine. They soon find out that Peter isn’t the only one in Miles’ universe as they are join by other Spider-Men from their respective universe including Gwen Stacy/Spider-Woman. Meanwhile, Kingpin is restoring his particle accelerator to use again for his upcoming plan.Although this movie is not made by Marvel Animation, the movie’s animation done by Sony Pictures Animation is very good and very artistic which actually resemble the actual comic book. The story of using multiverse concept for the movie is well written and utilised without making it complicated or confusion.The decision of using Miles Morales as Spider-Man is pretty much a good choice in my book because he is lesser known superhero to most people and Peter Parker’s Spider-Man have been very well known to everyone. This is a perfect opportunity for Miles Morales’ Spider-Man to shine.The voice acting is very good and the casts are managed to deliver their best performances. There are many funny moments which I laughed so many times and those moments make the movie very fun and entertaining to watch. This could be the best Spider-Man movie I have seen so far. Stan Lee had a voice cameo in this movie posthumously which I won’t spoil it here and you may not want to miss this movie. Having said this, I highly recommend you to watch this movie. Be sure to stay back for a post credits scene which could be a hint for future movies.",
      "review_date": "2018-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great movie. The only thing that bothered me was the Sony product-placement. They have to stop doing that one day and actually start believing in themselves. Otherwise there is absolutely nothing bad to say about this movie. If you likeGreat movie. The only thing that bothered me was the Sony product-placement. They have to stop doing that one day and actually start believing in themselves. Otherwise there is absolutely nothing bad to say about this movie. If you like Spider-man, you'll probably enjoy this movie more than all the previous movies. It's really pretty darn great. If you're a dad with a bit of a soft spot for Spidey, with kids around that age (you know what I mean), must see, really.",
      "review_date": "2018-12-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a great animated movie, and a great Spider-Man movie. The animation is unique, fun, and refreshing from other animation styles. The voice actors fit the characters very well. The story was awesome. The beginning wasn’t amazing for theThis is a great animated movie, and a great Spider-Man movie. The animation is unique, fun, and refreshing from other animation styles. The voice actors fit the characters very well. The story was awesome. The beginning wasn’t amazing for the first few minutes, but after that it was funny and exciting. The middle was filled with interesting characters that each had their own stories and reasons for who they are. The ending was amazing. The action scenes were detailed and spectacular. The characters got better and you could see how the progressed from the begging to the end of this movie. Miles Morales is a great character, as a person and a Spider-Man. I recommend it.",
      "review_date": "2019-01-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "divertida, muy buen estilo de animación la película en general estuvo bien aunque ya me esta cansando del tema de la inclusión",
      "review_date": "2019-03-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The must-see movie of 2018, not 'superhero movie' but 'movie' as a whole. Stunning art, an emotional story, humor and intense action all make a perfect balance in this amazing flick everyone can get behind.",
      "review_date": "2018-12-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Estamos ante una buena película de superhéroes que sale un poco de lo convencional donde tendremos una buena dosis de emoción y risas de mano de la pandilla de arañas.En cuanto a la calidad de animación fue simplemente impecable uno sentíaEstamos ante una buena película de superhéroes que sale un poco de lo convencional donde tendremos una buena dosis de emoción y risas de mano de la pandilla de arañas.En cuanto a la calidad de animación fue simplemente impecable uno sentía como una rara especie de comic explosivo, lo cual fue sin duda alguna una de las ventajas que esto no lo haya hecho Disney por que dio vida a nuevas libertades creativas. El diseño de personajes estuvo excelente(exceptuando a los dos casos que mencionare al final) donde los colores llamativos y esas líneas de diseño fluidas creaban un ambiente muy contemporáneo sobre todo con el atuendo de Morales donde esas Nike air force one lucían en toda su gloria con ese traje negro.Lo que no me acabo de convencer fue la implementación de los dos personajes que no eran Spiderman, sobró un poco el spider pork, ya que si da risa pero tampoco es que sea un personaje muy memorable, que valga la pena recordar y con respecto al segundo personaje si lo se sony es japonesa pero no había la necesidad de implementar eso  o por lo menos no de una manera a lo Big Hero, se sintió algo antinatural a mi gusto.El apartado musical estaba presente con ese hip hop cuando debía estar y en ningún momento se sintió que interfiriera con la experiencia así que muy bien por ese lado.El cierre de trama fue espectacular, sin embargo se pudo haber explotado un poco mas el terreno de la familia de Kingpin donde había posibilidades para entender mejor a este personaje y sus motivaciones.El cameo de Stan Lee fue un lindo detalle además de esas frases que salieron en el momento de crisis del personaje, ya que forman momentos genuinamente conmovedores sin caer en ridiculeces ni amor familiar incómodo.Si bien hubo momentos donde sentía un poco lenta, casi en su totalidad pudo llamar mi atención y la de la mayoría de la sala donde todos estábamos expectantes de ver que sucedía con nuestro “amigable vecino”.En cuanto a mí me encanto esta versión, se siente como algo fresco para el cine de superhéroes donde no están grandes actores y presupuestos récord sino simplemente una historia interesante con una animación de calidad. Deben ir obligatoriamente  a verla, lleven a sus hijos, sus hermanos, sus primos o sobrinos créanme que la disfrutaran y le alegraran el día a alguien.",
      "review_date": "2018-12-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Into the Spider-Verse is a real treat. An animated, family friendly film that manages to please general audiences and hardcore comic fans at the same time. All carried by a unique comic like animation style that puts the film in a league of its own.",
      "review_date": "2019-03-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The best animated film...let me correct that, one of the best film of 2018, is a thrilling, heart breaking film of epic proportion.  The fact that it is animated is the icing on the cake: it has an art style that is bold and different,The best animated film...let me correct that, one of the best film of 2018, is a thrilling, heart breaking film of epic proportion.  The fact that it is animated is the icing on the cake: it has an art style that is bold and different, emphasizing that this is literally a comic book that comes to life. However, such razzle dazzle will all be for nothing without an incredibly solid and engaging story line and characters. The fact that this film has loads of Spider-'men', each having their own arc is an amazing feat.  It has also action set pieces that are incredible, the best in 2018.  Literally, the best Spider-man flick since Sam Raimi's saga many years ago.",
      "review_date": "2019-01-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Kind of animation which Spiderverse is paradoxically the comic artistic and realistic, which for itself is pure innovator. More than a superhero movie full of battle, Spiderverse knows how develops their characters, especially Morales, beyondKind of animation which Spiderverse is paradoxically the comic artistic and realistic, which for itself is pure innovator. More than a superhero movie full of battle, Spiderverse knows how develops their characters, especially Morales, beyond uses humor in form absolutely precise.",
      "review_date": "2019-02-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A fun Spiderman story.  It is familiar but with a twist.  I think any fan of this character should see this movie. It is also Visually pleasing with a unique animation that feels straight from the comic pages.",
      "review_date": "2019-03-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "At first I was like what are you kidding me!? After a long struggle, I watched it and turns out it is not that bad. Amazing introduction of the multiverse, nice comic-like storytelling and the structure. Love it!",
      "review_date": "2019-03-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Однозначно лучший фильм года и один из лучших фильмов, что я смотрела за всю жизнь.",
      "review_date": "2018-12-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I have to  say I wasn't sure what to expect from this movie when it was announced. After seeing it, I'm convinced it has to be one of the most beautifully animated movies I've ever seen. The direction and art style is truly visually stunningI have to  say I wasn't sure what to expect from this movie when it was announced. After seeing it, I'm convinced it has to be one of the most beautifully animated movies I've ever seen. The direction and art style is truly visually stunning and the story is actually pretty nice. It helps expand the mythos behind the Spider-Man mythos in new and interesting ways without doing too much. I especially liked the fact that they used Miles as the main character instead of Peter. It showed an appreciation for diversity that is often lacking in films. Top notch film that will be on many people's favorites list.",
      "review_date": "2019-01-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "At last, the first success of Sony Animation. The animation work is so far the best job of the favorite web-slinger of comics. Mixed elements of humor, emotive details and action makes it the best choice of winter 2018. Perchance the one whoAt last, the first success of Sony Animation. The animation work is so far the best job of the favorite web-slinger of comics. Mixed elements of humor, emotive details and action makes it the best choice of winter 2018. Perchance the one who will rain the parade of Disney-Pixar. Everyone are SpiderMan.",
      "review_date": "2018-12-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Before we start,I just need to point out that the best Spider-Man Movie (and best Comic-Book movie of 2018) is made by the same animated studio that delivered movies with fart and poop jokes as their trend. Onto the review.Let’s talk aboutBefore we start,I just need to point out that the best Spider-Man Movie (and best Comic-Book movie of 2018) is made by the same animated studio that delivered movies with fart and poop jokes as their trend. Onto the review.Let’s talk about the ‘Set-Up’ Movie. A ‘Set-Up’ Movie is a term that I often use to point out some cinematic garbage that milks money out of its production value just for the sake of setting up a big Cinematic Universe (that started all the way back in 2008 with Marvel Studios,precisely with Iron Man). Sony started this 4 Years Ago with The Amazing Spider-Man 2,a movie with some decency in its runtime,but still ruined by the likes of Alex Kurtzman’s “JJ Abrams Mystery Box” style writing,but it was later taken to a new level by Universal Pictures (Jurassic World Fallen Kingdom or The Mummy with their 3rd Acts).Now Sony is still trying to start their own Universe as of 2018 with movies like Venom (“When I get out of here...And I will...There’s gonna be Carnage”) and now Spider-Man Into The Spider-Verse,a movie that may be the best movie out of all these Set-Up Movies for the reasons it’s not supposed to work (but somehow,it does).Literally everything about this movie is flawless. Yeah,sure,there are some jokes that didn’t land as much as the previous one...Yeah,the Animation was interchangeable at times and yes,it has a soundtrack with classic hits (aside from Sunflower and What’s Up Danger?) that feels perfect for a dumb YA Movie,but who cares? There’s a real Entertainment value behind this movie,and it shows all its hard work put into this. It may also be the most Personal movie I’ve ever seen,considering the fact that Miles Morales (the main character of the movie,played by Shameik Moore) is me,but black and Spider-Man.Difficult relationship with his dad? Check.Being in the wrong school because of the dad’s reasons? Also Check.Always trying to save/help somebody out? Umm,hell yeah.This is my favourite Screenplay of the year for all these reasons and so much more,but also because it manages to combine all the previous Spider-Man outings (for example,the Raimi trilogy for its Origin story,the character getting beaten to the ground morally and….maybe too many villains?) and still trying to be a movie of its own,with new characters,frenetic action scenes (some of them brutal for a kids movie,where even Japanese media ain’t got nothing,even if that means whatever the hell that was in Akira),brilliant character development (we get to care about a living pork,for Pete’s sake) that is all accompained by fantastic animation. Sometimes it’s a living comic-book,sometimes it’s a Borderlands game,and sometimes a PS2 game (mainly for character animation),which keep in mind,makes sense for the world we’re watching.Th screenplay also manages to get excited for its future Cinematic Universe (with a sequel and an all-female spin-off already in development). When’s the last time you’ve seen a non-MCU Movie that got you excited for its universe of future movies? As I said before,the Screenplay also manages to get brutal at times,with a punch by a big buff dude like Kingpin that feels like the Apocalypse and a gunshot that kills a character. Again,when’s the last time you’ve seen a brutal non-Pixar animated movie?It also doesn’t stop to reference something classic for laughs and be Deadpool or LEGO Batman for a second,no no no,because the references are actually in favor of the story,whether it’s a character introduction or a post-credit sequence.Oh,and the 3D is so good,it’s honestly the best use of 3D since Avatar. Not even a second to be on screen and the colors pop out the screen on purpose,making this movie the best acid trip since 2001 A Space Odyssey. The Comic-Book effects leap as if we’re seeing a literal comic-book,and the image sometimes feels worthy of a Best Cinematography award.Overall,there’s really nothing to complain about in here. After walking out of the theater,I said to myself “Man,this one will be hard to write because everything about it is really good”,but no. I really had fun doing this. This is also the kind of guts a typical movie critic has. Usually,we enjoy talking TNTs about a bad movie,but sometimes,a good movie can feel like a new quest,a new journey in a movie critic’s life,and I didn’t think a Spider-Man movie would accomplish that (But again,this was a year where an Action Movie made me scream at an IMAX). I will come back at a new Sony Spider-Man movie full of hope,and luckily,with pure excitement. Please,go see this movie.It's really worth your time and pennies.",
      "review_date": "2018-12-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Sony made a good (dare I say great) superhero movie!Spider man into the spider verse is a piece of modern art. With stunning visuals and funny characters it is hard to be disappointed, it felt like reading a graphic novel front to back!TheSony made a good (dare I say great) superhero movie!Spider man into the spider verse is a piece of modern art. With stunning visuals and funny characters it is hard to be disappointed, it felt like reading a graphic novel front to back!The down fall is the plot. It is the best depiction of different universes I have ever seen but the story line is taken over by the visuals. Some of the characters felt mismatched (the anime girl with the robot) but in the end it came together.Most importantly, we need a spider man noir sequel!",
      "review_date": "2018-12-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Was that very hard to make a very decent Spider-man movie, Sony?Spider-man: Into the Spider-verse is directed by Peter Ramsey, Robert Persichetti Jr. and Rodney Rothman, screenplay by Phil Lord and Rodney Rothman, and voices-starring byWas that very hard to make a very decent Spider-man movie, Sony?Spider-man: Into the Spider-verse is directed by Peter Ramsey, Robert Persichetti Jr. and Rodney Rothman, screenplay by Phil Lord and Rodney Rothman, and voices-starring by Shameik Moore, Jake Johnson, Hailee Steinfeld and Mahershala Ali.Story by Phil Lord, and it's about Brooklyn teen Miles Morales, and the limitless possibilities of the Spider-Verse, where more than one can wear the mask.First time I heard about this movie I wasn't that hype about the idea of the movie or the animation. The trailer wasn't so clear about its animation, or the very bold storyline! When I went to see this movie I was blown away by the striking animation and the bold storytelling.. I think it's a very risky step for Sony to take, to make a very unique, new and comic-alike animation, I mean what if the audience didn't like it? It could have been a big disappointing movie, because it has an amazing story, I think this story is definitely the best story of the whole Spiderman movies, also the animation is amazing, it's flawless! When an animation movie brings the live-action movies down, it means that it's definitely unique and bold!!The story didn't take so long to get you into the main plot, it went with its surprising \"scene\" -I'm not gonna spoil anything in this review- and though it made a very good introduction of the characters, so the first act was very good, shocking and humorous too!The second act still a very funny and thrilling as the first act, introducing the rest of the characters, so it took more time to get us back to the main plot, and I loved it, because some characters wasn't that clear in the first act that I wanted to know more about, and others that I wanted more of their backstories because I liked them! After introducing the \"rest of the characters\" we get another shocking scene, driving us to another shocking scene.. excuse me if I'm mysterious about some stuff, but I don't want to spoil anything, and still, if you watched the movie, you're gonna understand me very well.The third act was very predictable though, but still very thrilling because of its amazing animation combined with the amazing action, and emotions... Oh yeah, the third act is completely emotional, and action-full!There're not any subplots like Fantastic Beasts the Crimes of Grindelwald or something, it's very straight and clear.. very good for kids, and amazing for Spider-man fans and adults as well.I think that Spider-Man Into the Spider-verse is the Spider-Man that we deserve as fans of Spider-Man and it's definitely the best Spider-Man movie of all the time.! And of course, Spider-Man Into the Spider-verse gets an A+!Alright, guys.. thank you as always for reading and supporting my work, and if you liked this you can click on my name above and read all of my reviews, lots of movie-reviews are coming ahead.. thanks again!",
      "review_date": "2018-12-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I really liked the movie. A wonderful soundtrack, a picture that pleases the eye, I really liked the plot, not intricate, but with sharp turns. Could squeeze a tear.Why then 9/10? There was a thought: \"When will it end?\"Sony, you are notI really liked the movie. A wonderful soundtrack, a picture that pleases the eye, I really liked the plot, not intricate, but with sharp turns. Could squeeze a tear.Why then 9/10? There was a thought: \"When will it end?\"Sony, you are not there **** such a cool movie to do?I'm a child from Russia, so forgive me for the clumsy translation.",
      "review_date": "2018-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It felt like this film will be a major influence on future films (animation or live action). A wildly successful experimental art film in a genre that allows it to make perfect sense! A must see.",
      "review_date": "2019-01-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Amazing, just amazing. Don't start wondering why this would be good, trust me, it is. Just go watch it, especially if you are a Spider-Man fan.",
      "review_date": "2018-12-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I didn't know it was possible, but somehow Into the Spiderverse brings freshness and innovation to the superhero genre. What is even more impressive is that it takes a new spin on the age-old Spiderman origin story. From a structuralI didn't know it was possible, but somehow Into the Spiderverse brings freshness and innovation to the superhero genre. What is even more impressive is that it takes a new spin on the age-old Spiderman origin story. From a structural standpoint, this movie is the complete package. The animation style and character design are a aesthetically pleasing mix of vintage and digital. The script packs emotional punches and hilarious laughs. The voice acting cast is great. This is a rollercoaster of a movie that has no right being as good as it is. Easily one of the best animated pictures of 2018.",
      "review_date": "2019-01-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don't want to say much of anything about this movie, as it needs to be experienced. The less you know about it going into the viewing, the better. It's almost perfect in every way. If I HAD to come up with something to complain about, itI don't want to say much of anything about this movie, as it needs to be experienced. The less you know about it going into the viewing, the better. It's almost perfect in every way. If I HAD to come up with something to complain about, it would be that Miles' personality gets a little too smug in places towards the end, but even that is really reaching. There's also one logic issue in the movie, but it's very minor. Other than that, it's perfect.",
      "review_date": "2019-03-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The movie has a distinct visual style, which I thoroughly loved for the entire film. There was also an excellent music soundtrack that accompanied every scene of the movie, and I appreciated the hip hop influences on the music and theThe movie has a distinct visual style, which I thoroughly loved for the entire film. There was also an excellent music soundtrack that accompanied every scene of the movie, and I appreciated the hip hop influences on the music and the characters. The story was fun, although I thought that some of the characters were a bit superfluous. It also followed many of the superhero origin tropes, which I wasn't expecting based on some of the reviews calling this \"like nothing you've seen before\". Overall, very enjoyable and I look forward to a sequel.",
      "review_date": "2018-12-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Absolutely incredible in every sense of the word. The visuals, the story, the music, the voice acting (especially Cage, Steinfeld and Johnson) are stellar. I'm not a fan of Miles Morales or the character but this movie far exceeded myAbsolutely incredible in every sense of the word. The visuals, the story, the music, the voice acting (especially Cage, Steinfeld and Johnson) are stellar. I'm not a fan of Miles Morales or the character but this movie far exceeded my expectations in every way.",
      "review_date": "2019-01-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie was a huge - and pleasant - surprise, 'Spider-Man: Into the Spider-Verse' isn't another live-action Spider-Man reboot from Sony, nor is it part of the Marvel Cinematic Universe. It's well and truly its own story that focuses on theThis movie was a huge - and pleasant - surprise, 'Spider-Man: Into the Spider-Verse' isn't another live-action Spider-Man reboot from Sony, nor is it part of the Marvel Cinematic Universe. It's well and truly its own story that focuses on the character of Miles Morales (Shameik Moore) and his pretty ordinary teenage life. Dealing with his father's moral ways because he's a cop, coping to get through school even though it's boring for him. Everything just gets routine for him, except for the one person he looks up to, his uncle Aaron Davis (Mahershala Ali) who gives him the right amount of confidence boost that he needs in his daily life. Miles also meets a young girl in his class, Gwen Stacey (Hailee Steinfeld), and she appreciates his wit and even odd - yet quirky - personality. One day, Miles stumbles across an incident that involves the evil Kingpin (Liev Schreiber) who has invented a device that can create portals from one universe crossing paths with another. A rift causes another Peter Parker (Jake Johnson) to slip through the vortex and enter the universe that Miles is in. Miles aspires to be just like Peter after he was also bitten by a radioactive spider, but Peter tells him that there is much to learn. It seems that Peter isn't the only one that crossed paths with Miles, as there are a handful of other \"Spider-People\" that somehow got lost into this universe too, from; Spider-Noir (Nicolas Cage), Spider-Gwen, Peni Parker (Kimiko Glenn) and Spider-Ham (John Mulany). They all team up to try and come up with a plan to get each of them home back to their own universes. The movie certainly is a breath of fresh air into a character we have seen in the movies so many times before. This may just seem like Sony - once again - trying to cash-in on the character, but thanks to a script by Phil Lord ('The LEGO Movie') and Rodney Rothman, it has heart and very self-aware humor that keeps it afloat. It acknowledges its silliness and embraces that, it's overstuffed but also is aware of that too. Most importantly, it captures the spirit of the Spider-Man character and the world (or 'worlds') that he inhabits. Sony has been desperately trying to adapt a Miles Morales story for years and years, and this is the best introduction for him, especially for people who may not be familiar with his story. The animation is eye-popping as well, making it feel like a comic book leaping off the pages. Overall, this movie is fun, fast-paced, touching and wildly funny. If you love Spider-Man, this might just be the movie you've been looking for since 'Spider-Man 2' (2004).",
      "review_date": "2018-12-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "this movie was genuinely fresh, beautiful and kinetic, a perfect comic book visual style movie, with the blend of sound and movement. story in it self is not extraordinary, theme also remains somewhat similar to old movies, but the executionthis movie was genuinely fresh, beautiful and kinetic, a perfect comic book visual style movie, with the blend of sound and movement. story in it self is not extraordinary, theme also remains somewhat similar to old movies, but the execution is great, which makes it unique in its own style.",
      "review_date": "2019-02-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Spider-Man: Into the Spider-Verse is one of the best movies of the year.A different and unique animation, a perfect soundtrack and a narrative and incredible characters.\nSpider-Man: Into the Spider-Verse is the Spider-Man movie that wasSpider-Man: Into the Spider-Verse is one of the best movies of the year.A different and unique animation, a perfect soundtrack and a narrative and incredible characters.Spider-Man: Into the Spider-Verse is the Spider-Man movie that was already needed.",
      "review_date": "2019-01-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nOne of the best cartoons this year! Cool collaboration, great soundtrack and gorgeous animation all in one movie.",
      "review_date": "2018-12-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie was just about perfect. The animation style was killer. The backstory of Miles Morales and his introduction to the other Spider Mans was just awesome. My daughter was riveted watching the movie from the edge of her seat. It is aThis movie was just about perfect. The animation style was killer. The backstory of Miles Morales and his introduction to the other Spider Mans was just awesome. My daughter was riveted watching the movie from the edge of her seat. It is a rare film for us to both be in awe of the content.",
      "review_date": "2018-12-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "didn't expect to enjoy this as much as I did, but this was a GREAT film, don't miss it because it's animated.",
      "review_date": "2019-03-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The animation takes a bit to get used to but this is a really good story. Lots of fun!",
      "review_date": "2019-03-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of or better yet, the BEST COMIC BOOK MOVIE EVER! Expect a really fun, thrilling, and action-packed adventure with one of our childhood characters in animation we've never seen before. That's what you get. And that is why I rated itOne of or better yet, the BEST COMIC BOOK MOVIE EVER! Expect a really fun, thrilling, and action-packed adventure with one of our childhood characters in animation we've never seen before. That's what you get. And that is why I rated it 10/10. Phil Lord is just absolutely amazing at world building and this film had a lot of it. Just the animation alone made this movie and I'm not at all surprised that it won twice in the animated feature field. Definitely looking forward to the sequel and kudos to Phil Lord and amazing crew to this movie.",
      "review_date": "2019-03-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A masterpiece from start to finish!I'm into diversity and equality via unity and teamwork - not blame and division.\nSpider-Verse is as shining example.\n\nPositive family values, hilarious humor and a visual style as stunning as theA masterpiece from start to finish!I'm into diversity and equality via unity and teamwork - not blame and division.Spider-Verse is as shining example.Positive family values, hilarious humor and a visual style as stunning as the storytelling.Everybody is unique with special talents. Kids should learn to focus on that more, and to obsess over race, gender, and so on less.",
      "review_date": "2019-03-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If you ever wanted to experience what it is to be inside a comic book, then this is the movie for you. The animation style is amazing in this film, and it comes with a very emotional story. Every sub-plot in this film has a purpose, and theyIf you ever wanted to experience what it is to be inside a comic book, then this is the movie for you. The animation style is amazing in this film, and it comes with a very emotional story. Every sub-plot in this film has a purpose, and they all wrap up quite nicely at the end of the film. Go and watch it.",
      "review_date": "2018-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Spider-Man: Into the Spider-Verse is not only the best-animated film I've ever seen but also, quite frankly, the BEST FILM I'VE SEEN IN MY ENTIRE LIFE PERIOD. It was funny, touching, heartfelt, gorgeously animated and just awe-strucking. ItSpider-Man: Into the Spider-Verse is not only the best-animated film I've ever seen but also, quite frankly, the BEST FILM I'VE SEEN IN MY ENTIRE LIFE PERIOD. It was funny, touching, heartfelt, gorgeously animated and just awe-strucking. It truly is a work of art and it's a one-of-a-kind experience you should not miss. 10/10 would definitely see again!",
      "review_date": "2018-12-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I Love love love love this movie. Don't get me wrong, it isn't particularly innovative in its story. Origin stories usually follow a certain track in order to include necessary features. The thing that makes this movie great is the way itI Love love love love this movie. Don't get me wrong, it isn't particularly innovative in its story. Origin stories usually follow a certain track in order to include necessary features. The thing that makes this movie great is the way it tells a story we all know. The characters: Great!! They are well fleshed out, and I rarely actually feel for a character in movies, but there was authenticity that just led to likable people, and the humor helped a lot.The plot: As said before, the story wasn't particularly special, but the pacing was fantastic. Each scene seamlessly bled into the next, and narrative momentum is something I think we, unfortunately, lack in modern movies, but this definitely had it. You won't feel like a scene is unneeded.The cinematography: DAMN was it good. You just have to see it to know what I mean, but the stylistic choices of the movie give it such an original feel and work as a story-telling tool that makes it fresh and new. It's just a beautiful movie if you only care about that.Overall: It was an emotionally resonant, visually stunning, and narratively exciting movie that is near-perfect, and by far, one of my favorite super-hero movies ever :)",
      "review_date": "2018-12-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Spider-Man: Into the Spider-Verse, is probably the best Spider-Man ever made (live action or animated), and is a must see, even if you don't like superhero or animated movies.  The animation alone is worth the price of admission, and is justSpider-Man: Into the Spider-Verse, is probably the best Spider-Man ever made (live action or animated), and is a must see, even if you don't like superhero or animated movies.  The animation alone is worth the price of admission, and is just beautiful to watch.  The action scenes are just awe-aspiring, and the plot has a nice balance of comedy and dark moments (this movie is A LOT darker than I expected).  People have been complaining about Kingpin, but I honestly thought he was a great villain, and despite his motives is very menacing.  Overall, just go see this movie.  It's simply amazing.",
      "review_date": "2018-12-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film was a cinematic masterpiece. It is really shocking that the same studio that made the EMOJI MOVIE was able to make this unbelievable film. The film has the theme of old comics as seen by the grid of dots and the text boxes used toThis film was a cinematic masterpiece. It is really shocking that the same studio that made the EMOJI MOVIE was able to make this unbelievable film. The film has the theme of old comics as seen by the grid of dots and the text boxes used to narrate. This movie was also surprisingly emotional for a superhero movie. The plot was also pretty good. I would recommend anyone see this movie.",
      "review_date": "2019-01-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "(NO SPOILERS)It has been a long time since I have seen a film that resonated with me on so many levels. There is clearly so much passion and care put into this project, and it is hard to believe that the same company released the 'Emoji(NO SPOILERS)It has been a long time since I have seen a film that resonated with me on so many levels. There is clearly so much passion and care put into this project, and it is hard to believe that the same company released the 'Emoji Movie' this year. I could harp on for hours about all the positives of this movie, but for your ease of reading, here are the highlights broken down into a digestible list:1) Art style. Seriously, it's phenomenal the level of detail in this film, and we may never see an artistic vision executed so thoroughly and expertly in this kind of movie again. Nearly every frame could be hung on a wall for a Comic Book Gallery.2) The dialogue and acting are on point, with smart, snappy exchanges between both believable and lovable characters. All the vocal performances are fitting for the characters and bring the story to lift.3) The soundtrack, good song choices that are well integrated into the film, complimenting the scenes they cover without distracting from the story.There are lots of other positives, but I think the best way to understand them would be for you to go an see this for yourself. Films this good need your support!",
      "review_date": "2018-12-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An absolute incredible Spider-Man movie like no other seen before! Spider-Man: Into the Spider-Verse is an absolute spectacle joy ride to watch. It's chalk full of gorgeous art and action, lovable and awesome characters, and a heartfelt andAn absolute incredible Spider-Man movie like no other seen before! Spider-Man: Into the Spider-Verse is an absolute spectacle joy ride to watch. It's chalk full of gorgeous art and action, lovable and awesome characters, and a heartfelt and motivating story. All this blends together perfectly to bring us a superhero movie that's not too goofy, not too gritty, but just right for all ages and even the most die hard Spider-Man fans to enjoy. Every Spider-Man reference will have you smiling under your breath until the very post- credit scene!",
      "review_date": "2018-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Beatiful, emotional and the ultimate love letter to Spider-Man. Just fantastic.",
      "review_date": "2018-12-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best Comic Book Movie of All Time! This is not a summer blockbuster action movie. This is a comic book movie. It makes use of unique comic book innovations in its graphic design and layouts. It almost like they let Marvels world class comicBest Comic Book Movie of All Time! This is not a summer blockbuster action movie. This is a comic book movie. It makes use of unique comic book innovations in its graphic design and layouts. It almost like they let Marvels world class comic artists go to work and make their movie. The quality of the action sequences is unmatched. The use of layers of text and animation is brilliant. If you are a true comic book fan, you must see this film while its still in theaters. You probably cant see this in IMAX, but check it in Real 3D and sit in the front five rows to get an immersive VR like experience. The use of animation layers is ground breaking.  If you think the animation was scribble... Then you don't know the work of one of top two greatest comic book artists of all time, Bill Sienkiewicz. Expressive energetic use of lines and and textures give this film an extra edge beyond any animated movie you have seen. The story walks the line between formulaic Hollywood sentimentality and over the top comic book bombast and delivers something both familiar and groundbreaking. The character animation and voice performances are charismatic and believable. The new Spiderman feels real. He feels modern and relevant. There is no comic book franchise reboot that is this daring and successful. It makes Thor: Ragnaraok seem tame and conservative. This is the new bar that all super hero movies will be judged. It makes every super hero movie before it seem dated and obsolete and It raises the bar for all animated movies. Bravo!",
      "review_date": "2018-12-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"Hey...\"I'm honestly astonished how much I liked this, because before I couldn't be bothered with yet another incarnation of Spider-Man.\n\nDespite a cliched narrative towards the end with \"everyone doubts the main hero and he needs to prove\"Hey...\"I'm honestly astonished how much I liked this, because before I couldn't be bothered with yet another incarnation of Spider-Man.Despite a cliched narrative towards the end with \"everyone doubts the main hero and he needs to prove himself\", type of trope, and inappropriate song choices during dramatic moments - yet that didn't bog down the experience for me.Still, I wished this movie came out during my childhood when Spider-Man was my bible, as I would've died and gone to heaven from the feeling of glee.I think the message that anyone can be Spider-Man, no matter your race, gender and sexuality is powerful and empowering.Some of the best animation I've seen in awhile. Refreshing to find little details that people may not pick up on. It's so creative and visually wonderful, it pops out of the screen. The action scenes are exciting and the comedy was generally funny. Every character is handed with care and it's clear that the creators understand the different incarnations of Spider-Man.It's tragic seeing mass audiences overlooking this germ - 2018 is the year of the spider.",
      "review_date": "2018-12-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film is simply amazing! Spider-Man: Into the Spider-Verse is a fantastic Spider-Man animated film with beautiful animation, a well written story and great characters. The story behind Miles Morales is very interesting and well developed.This film is simply amazing! Spider-Man: Into the Spider-Verse is a fantastic Spider-Man animated film with beautiful animation, a well written story and great characters. The story behind Miles Morales is very interesting and well developed. This has to be one of the best animated films ever made! Thanks to Sony for making this amazing film!",
      "review_date": "2019-01-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The best Spider-Man movie to date – it even improves on aspects from the comics, like a certain romantic subplot, but I won't spoil.",
      "review_date": "2018-12-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A visually beautiful, superbly crafted, well acted, Spider-Man movie that encapsulates all the crazy multi-universe stuff that's been going on in Peter Parker's world (or I should say, worlds) in the Marvel comic books for the past couple ofA visually beautiful, superbly crafted, well acted, Spider-Man movie that encapsulates all the crazy multi-universe stuff that's been going on in Peter Parker's world (or I should say, worlds) in the Marvel comic books for the past couple of decades. I would give it a 10 for its heart, it's capturing of the various character personalities, and the skill with which it introduces us to the complex tapestry of multiple universe stuff while still finding plenty of time to tell a good story.However, I take off two points (I was tempted to take off 5) for one gigantic, and I mean gigantic, gaffe.If you've kept up with the Spider-Man comics, you know there are multiple parallel universes within the Marvel scheme of things, each one with tweaks and modifications: in one, Peter Parker died and Miles Morales was then bitten by a super duper spider and became Spider-Man; in another, Gwen Stacy was bitten by the spider and became the super hero; her Peter Parker died, too. In our universe, of course, the biggest event in comic book history took place some years back. Gwen Stacy, to whom Peter Parker was engaged, was murdered before his very eyes by the Green Goblin. Spider-Man comics have reiterated and revisited and reminded us of this tragedy consistently ever since. Everyone knows about it. In fact, part of the reason the comic book telling the adventures of parallel universe Gwen has been so successful, is because it is so wonderful to see a version of Gwen who is still alive and, who to boot, is a super hero in her own right.So it is nothing short of bizarre when in the movie, Peter Parker, our universe Peter Parker, doesn't even recognize his fiancee's twin from another dimension. She recognizes him, but he's oblivious. This just doesn't make sense. It's like a parallel universe version of Lois Lane showing up and Superman not recognizing her. It's a gaffe the size of the Grand Canyon. And a huge disappoint in what was otherwise an nearly perfect comic book movie.",
      "review_date": "2018-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Such a fun and endearing movie. Great pacing, amazing characters, laugh out loud moments. It might be my favorite superhero movie, period.",
      "review_date": "2018-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I have a new favorite Spider-Man film!Into the Spider-Verse looks amazing. I've seen combinations of two- and three-dimensional animation before, but not anything like this. The movie is very colorful and makes excellent use of action. TheI have a new favorite Spider-Man film!Into the Spider-Verse looks amazing. I've seen combinations of two- and three-dimensional animation before, but not anything like this. The movie is very colorful and makes excellent use of action. The whole thing is supposed to look like a comic book and has some wildly creative ideas, including color slightly popping off the lines and thought captions and bubbles. This movie takes place in an alternate reality from more traditional Spider-Man timelines, giving the creators liberty to come up with some inventive visual twists on classic Spider-Man villains without feeling like real betrayals to the characters.Now, the movie does have a couple things that I adjusted to but may bug people with more sensitive eyes. As mentioned, the color is off-line and the background in particular can be blurry-looking. The motion frame rate is a little jerky, which I assume is a stylistic choice.The plot is equally impressive. The film features Spider-Men from multiple dimensions and multiple other characters yet manages balance and develop them all almost seamlessly. (Wouldn't have minded a little more time on Mile's relationship with his uncle, but that's a minor issue.) The comedy and drama is equally good. The movie has fun, but there are also stakes. There is real loss in this. (Parents who are more selective in what their children watch, may consider this more of a \"big boy\" film).The movie stars Spider-Man Miles Morales (voiced by Shameik Moore), who started off in Marvel's Ultimate comic line. He became popular enough that when the Ultimate universe was shut down, because Ultimate Spider-Man was the only real big seller, he was transferred to the main Marvel line. Hardcore Peter Parker fans may be upset that he isn't the star, but they did such a great job with Miles' character that I don't think you'll mind. He is likable and has personal issues like Peter, but in his own unique way. He forms a mentor relationship with a down-on-his-luck and world-weary Peter Parker (New GIrl's Jake Johnson), and the two of them have great chemistry and basically make the movie.This is one of those truly innovative steps in moviemaking and a sincere homage to comic books.",
      "review_date": "2018-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don't know what to say. This is the best film of 2018, no questions asked.",
      "review_date": "2018-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I wasn’t prepared for just how much I was going to enjoy this movie. It wasn’t what I was expecting, in part because it is so dynamic. It’s dorky yet slick, funny yet emotional, whimsical yet dark. The film bears closer similarity to Big HeroI wasn’t prepared for just how much I was going to enjoy this movie. It wasn’t what I was expecting, in part because it is so dynamic. It’s dorky yet slick, funny yet emotional, whimsical yet dark. The film bears closer similarity to Big Hero 6 than to Miller and Lord’s earlier films; and – if pushed – I might have to say that I actually prefer Into the Spider-Verse, which is high praise indeed. Watch this movie, before the inevitable implosion of our universe.",
      "review_date": "2018-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I never expected this film to be the best animated film of all time. It feels like watching the Lego Movie for the first time, but more awesome! The perfect combination between action, story, and o.s.t, this could be one of the best MarvelI never expected this film to be the best animated film of all time. It feels like watching the Lego Movie for the first time, but more awesome! The perfect combination between action, story, and o.s.t, this could be one of the best Marvel comics based film.",
      "review_date": "2018-12-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "For me it is realy good film. If you do not want to read this reviev ,go to the cinema and enjoy this film. For me the best part is sound. Songs fit to the situations.Just listen Duckwrth - Start a Riot or Lil Wayne - Scared of the Dark.",
      "review_date": "2018-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It’s been a long year without something unique.And here it is.You don’t have to know a lot of specific words about this picture...Maybe,only 4 words:The Best Spider Movie Ever...wait,there are 5 of them.Ok,it’s don’t matter,because visualIt’s been a long year without something unique.And here it is.You don’t have to know a lot of specific words about this picture...Maybe,only 4 words:The Best Spider Movie Ever...wait,there are 5 of them.Ok,it’s don’t matter,because visual design is fantastic,soundtrack is very dynamic and glorious and story very exciting,because you’ve never seen something like that in a cinema or TV indrustry.Just watch this (in my opinion,of course) Film Of The Year(not only the cartoon).",
      "review_date": "2018-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie was far beyond then my expectations. Amazing story telling, amazing jokes and references. Every web-head must see this masterpiece",
      "review_date": "2018-12-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I didn't quite expect this level of good when going to the cinema - Into The Spider-Verse ended up delivering on pretty much everything.The jokes are actually funny - no underage cringy garbage shoehorned by Disney into their movies.I didn't quite expect this level of good when going to the cinema - Into The Spider-Verse ended up delivering on pretty much everything.The jokes are actually funny - no underage cringy garbage shoehorned by Disney into their movies. Special thanks to Nicholas \"Noir\" Cage. The visual style is astonishing, pays close homage to the comics, but still looks distinct and aesthetically pleasing. The drama here surprisingly works, and some moments in this movie are very far from being childish. Of course the Spider-Verse also has a ton of references to everything from the Raimi trilogy to the recent PS4 game, and they're also great, make sure to stay for the after-credits scene. Even the protagonist Morales also works, as opposed to the aforementioned PS4 game, where he was kind of dull.So yeah, miles (no pun intended) ahead of the MCU and of Sony's own previous live-action attempts, Into The Spider-Verse is a great animated movie, totally looking forward to the announced spin-off and sequel.",
      "review_date": "2018-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The significance of this film is analogous to The Toy Story.  It redefines the western perception of an animated feature.  It fulfilled the \"diversity\" prerogative with artistic-integrity, originality, respectful and believable plot.  ItThe significance of this film is analogous to The Toy Story.  It redefines the western perception of an animated feature.  It fulfilled the \"diversity\" prerogative with artistic-integrity, originality, respectful and believable plot.  It brilliantly introduced the audience into the fantastic Spiderverse.  The long wait for silver screen debut of Miles Morales and Spidergwen was worth it. Franchise fatigue is only a thing if all you do is hire bloodsuckers to leech it to death, instead of talented artists to breath life into the franchise.",
      "review_date": "2018-12-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Possibly the biggest swing with the best result of the entire year, it's not simply the fact that \"Spider-Man: Into The Spider-Verse\" is so many things, but it's the fact that it's so many things executed outstandingly well that makes itPossibly the biggest swing with the best result of the entire year, it's not simply the fact that \"Spider-Man: Into The Spider-Verse\" is so many things, but it's the fact that it's so many things executed outstandingly well that makes it possibly the year's best comic-book movie, nay *movie* (arguably). I'm a simple guy. I walk into an animated movie, I ask for two things. Number one -- tell me an interesting story. And number two -- make it look good. And, dear God, does this do both of those things to an almost excruciatingly original degree. Add my favorite Marvel character and one of my favorite working creatives -- Phil Lord -- into that mix and you get something I never even realized could turn out as objectively magnificent as this. This is a fantastically deep study on not only what the idea of \"Spider-Man\" means to the characters within the film, but what it means to all people -- including the audience. Spider-Man, the movie posits, is not just a hero, an example, or a cultural fixture, but a mechanism to help people believe in things bigger than themselves. Yes, the movie is that deep. And, boy, does it work. One of the only movies I've seen this year that immediately made me want to about-face my happy ass back to the box office and buy another ticket. It's pure, cinematic candy at its finest.",
      "review_date": "2018-12-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is fascinating visually. I was very impressed by how like a living comic book it was. I found the experience of watching this movie exhilarating. It's sweet and funny and the action sequences are not boring as they so often can be.This movie is fascinating visually. I was very impressed by how like a living comic book it was. I found the experience of watching this movie exhilarating. It's sweet and funny and the action sequences are not boring as they so often can be. I love the characters (especially Miles) and the empowering message. I am planning to see it again in the theater, which is something I almost never do. Highly recommended.",
      "review_date": "2019-01-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's been a long time since I haven't watched animated films for 3 years despite I was interested in watching one that was both unique and satisfying. Even realizing that this was a movie about my favourite Marvel Character, \"Spiderman\". I'veIt's been a long time since I haven't watched animated films for 3 years despite I was interested in watching one that was both unique and satisfying. Even realizing that this was a movie about my favourite Marvel Character, \"Spiderman\". I've always loved the Spiderman franchise regardless if it was live action or animation, my money is always in it for these movies. For this movie, I clearly recommend watching it because it just comprises familiarity from previous films that were mentioned. Along with the cliche backstory of Peter Parker himself. It also introduces to a gateway to other Spider Heroes from the MCU even though some fans would know about them. Miles Morales (the main character) does appropriately fit well with the plot because he is the focus of the movie and presents it with a goofy and humorous behaviour. Which everyone could make a laugh out of. It's technically a film for everyone to watch which does have little to no adult themes, from the style. The animation is another factor to include as it's really awesome to see too.",
      "review_date": "2018-12-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This visually, stunning, funny, emotional a must see for everyone this a amazing movie and a spectacular spider man movie",
      "review_date": "2018-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "My thoughts on #SpiderManIntoTheSpiderVerse: It is the best animated movie and one of the best comic book movies of the year. Very emotional, very complex, visually stunning with bursts of psychedelic color and has a meta feel to it thatMy thoughts on #SpiderManIntoTheSpiderVerse: It is the best animated movie and one of the best comic book movies of the year. Very emotional, very complex, visually stunning with bursts of psychedelic color and has a meta feel to it that never loses it’s charm nor distracts from the main story. And, the 3D of the film alone is the format to see this movie in. Also, in future sequels, I hope to see more of Spider-Man Noir, Peni Parker and Spider-Ham. 10/10. 5 stars. ⭐️⭐️⭐️⭐️⭐️P.S. The way they honored the late Stan Lee was very well-done.",
      "review_date": "2018-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is the finest superhero film of 2018, possibly even the finest of the modern age. It is a game changer, one that sets a bar that even the upcoming live action Marvel Comics slate will have a hard time surpassing, let alone meeting. SonyThis is the finest superhero film of 2018, possibly even the finest of the modern age. It is a game changer, one that sets a bar that even the upcoming live action Marvel Comics slate will have a hard time surpassing, let alone meeting. Sony took the same Leap of Faith that Peter tells Miles to make, I hope the other studios were paying attention, because they have their work cut out for them. http://latetothegame.blog/2018/12/16/a-leap-of-faith-a-review-of-spider-man-into-the-spider-verse-2018/",
      "review_date": "2018-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If you plan to watch - sit for credits, there is AFTER CREDIT SCENE﻿, it is hilarious.film had amazing twists, plot twists. I like the store, characters and sound!\nOk, now the problems - fake 3D. I was watching in 2D, but in Many scenes IIf you plan to watch - sit for credits, there is AFTER CREDIT SCENE﻿, it is hilarious.film had amazing twists, plot twists. I like the store, characters and sound!Ok, now the problems - fake 3D. I was watching in 2D, but in Many scenes I felt like there was \"double edges\" effect. not deal breaking but felt very strange. also the moment Miles gets his \"powers\" like actual powers towards the end was not clear for me. He didn't even use it much of that specific power anyway.storyline is actually very good. this is better than homecoming i feel like.10/10 worth watching, oscar worthy",
      "review_date": "2018-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Spider-Verse **** murdered it. This has game changing potential for the medium. See it yesterday.",
      "review_date": "2018-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An incredibly unique and self-aware take on Spiderman, that contrasts a compelling human story with hyper stylised animation. Within the context of the film industry, its refreshing to see so many creative risks taken, as well as boldAn incredibly unique and self-aware take on Spiderman, that contrasts a compelling human story with hyper stylised animation. Within the context of the film industry, its refreshing to see so many creative risks taken, as well as bold storytelling decisions (considering this film is for children). Would sincerely recommend for families with kids, and adults alike.",
      "review_date": "2018-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I saw the 2D version of Spider-man into the spider-verse, and it was an exceptional interpretation of comics put to film. Although the animation style was slightly jarring to me at times, out of focus with a blurred 3D look, and the pace isI saw the 2D version of Spider-man into the spider-verse, and it was an exceptional interpretation of comics put to film. Although the animation style was slightly jarring to me at times, out of focus with a blurred 3D look, and the pace is almost completely manic, I guess to keep up with todays attention span. Cut twenty minutes off of this movie and its a perfect ten. Colorful, and fun for the whole gang. Miles Morales is the Spiderman of the next generation and he is absolutely competent to take the reigns. Loved it, well worth the price of admission. Take as many people as you can to see this film and dont be afraid to laugh and cheer the whole time!",
      "review_date": "2018-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "That is a great movie!!! Its amazing to see Peter Parker and Miles again #SpiderManIntoTheSpiderVerse is one of the best movie of the hero",
      "review_date": "2018-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The best picture that I had seen from Spider Man universe. It has all successful pieces: drive sound, amazing visual style, wonderful and subtle humor, smooth dynamic actions...You need to watch it in 3D vision",
      "review_date": "2018-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I loved Miles. Following him on this fun, action filled journey is amazing. The animation style works great with the action and comedy presented in this film. Throughout the film I kept thinking how much fun I was having. A must see for anI loved Miles. Following him on this fun, action filled journey is amazing. The animation style works great with the action and comedy presented in this film. Throughout the film I kept thinking how much fun I was having. A must see for an Spidey fan. There are end end credits. So hilarious and the Stan Lee scene is touching.",
      "review_date": "2018-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Exciting, fun, treats the character of Spiderman like it should be. I can't say I loved it because some elements of the animation didn't quite work for me, but still this was a fun time at the movies. Overall a low 8 an A-.",
      "review_date": "2018-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The movie is incredible. It’s not just the Ultimate Spider-Man, it’s the ULTIMATE Spider-Man movie. Most movies tend to focus on a few characters and forget the rest or focus on lots of characters, but they don’t have enough screen time forThe movie is incredible. It’s not just the Ultimate Spider-Man, it’s the ULTIMATE Spider-Man movie. Most movies tend to focus on a few characters and forget the rest or focus on lots of characters, but they don’t have enough screen time for each of them. The movie pulls it off where each character is on screen for an appropriate amount of time where you can invest your emotions in each one of them. You can also distinguish each character due to their unique personalities and designs. And every single character is redeemable (except for the main villain). The art style is bold and expressive and it makes the movie stand out above many motion animated pictures. It fits so well with the peoples’ and the environment’s actions as you are going through the movie, and it does not ever seize to amaze me. The story is great with relatable characters and as well as an adventure filled with comedy, heart, and passion. It’s pacing only feels slow once or twice and it always manages to catch my attention no matter which scene I am watching. The combination of the art and the story makes the movie feel interesting and I get invested with it all. In the end, it’s a movie full of not only comedy and self-referential parts, but it’s also a movie with (again) heart, passion, and effort. Which is what all movies should be made with today. A+",
      "review_date": "2018-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "While some of the coincidental plot points in the movie were annoying,overall the movie not only had probably the best  also animation style I've seen all year, but also maintained surprisingly developed characters and jokes. This movie showsWhile some of the coincidental plot points in the movie were annoying,overall the movie not only had probably the best  also animation style I've seen all year, but also maintained surprisingly developed characters and jokes. This movie shows what Sony Pictures can do when they put their mind to something.",
      "review_date": "2018-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Spider-Man: Into The Spider-Verse is a whole lot of fun and actually has some pretty hilarious moments, although, at times, it does feel like a predictable superhero flick. Perhaps the most worthwhile movie to see in 3D of the year, as well!Spider-Man: Into The Spider-Verse is a whole lot of fun and actually has some pretty hilarious moments, although, at times, it does feel like a predictable superhero flick. Perhaps the most worthwhile movie to see in 3D of the year, as well! Very impressive!",
      "review_date": "2018-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie pushes the boundaries of animated films and the standard we should hold animated films too. It included an all star cast and soundtrack with creative plot, animation, humor and writing. Compelling stories and characters I wasThis movie pushes the boundaries of animated films and the standard we should hold animated films too. It included an all star cast and soundtrack with creative plot, animation, humor and writing. Compelling stories and characters I was invested throughout the entire film all three times I saw it.  film to be truly beloved by any movie patron of any age.",
      "review_date": "2018-12-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Stunning. Visually jaw dropping. Moving. Beautiful. Emotional. Best animated motion picture without question. Best picture, perhaps?",
      "review_date": "2018-12-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI'm not really into animation but the trailer seemed interesting so decided to check it out. I saw it in IMAX 3D. The animation was spectacular. It was a style that I've never seen before; it was as if the pages of a comic book sprang to life. So colorful too. The story was good, and surprisingly emotional. I highly recommend this film.",
      "review_date": "2018-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is the most absolutely great surprise of all time.  I thought for the longest time that Disney can create the best feature animation film of all time.  Boy am I so wrong!  This is what Disney can not create but it is surely deserving toThis is the most absolutely great surprise of all time.  I thought for the longest time that Disney can create the best feature animation film of all time.  Boy am I so wrong!  This is what Disney can not create but it is surely deserving to be called one of the best films this year.",
      "review_date": "2018-12-16",
      "source": "metacritic"
    }
  ],
  "num_reviews": 150
}