{
  "title": "The Guardians",
  "rating": 5.7,
  "release_date": "2018-05-04",
  "genre": [
    "Drama"
  ],
  "summary": "An affecting human drama of love, loss, and resilience unfolds against the backdrop of World War I. The women of the Paridier farm, under the deft hand of Hortense, the family's matriarch (Nathalie Baye), must grapple with the workload while the men, including two sons, are off at the front. Hortense reluctantly brings on an outsider, theAn affecting human drama of love, loss, and resilience unfolds against the backdrop of World War I. The women of the Paridier farm, under the deft hand of Hortense, the family's matriarch (Nathalie Baye), must grapple with the workload while the men, including two sons, are off at the front. Hortense reluctantly brings on an outsider, the hard-scrabble teenage orphan, Francine (Iris Bry), to help her daughter Solange (Laura Smet). New tools allow the women to triumph over the land, newfound independence is acquired, yet emotions are stirred especially when the men return from the front on short leaves. … Expand",
  "critic_reviews": [
    "The performances are extraordinary, as they often are in Beauvois’ films, with Baye a study in quiet suffering and Bry wonderfully enigmatic — seemingly simple, but hinting at a soul capable of expansion and adaptation.",
    "The Guardians, though, is special in a new way. Imagine devoting several years, as Mr. Beauvois did, to making a reflective, bucolic feature that is organized around the themes of community and evolving culture. It’s all too subtle for words, but perfect for moving pictures.",
    "The Guardians is an intimate French epic, elegantly made and quietly emotional, a family story filled with characters whose lives we sink into, feeling the hope, the sadness, the sorrow and the joy right along with those on the screen.",
    "Unassumingly powerful details make The Guardians one of the year’s most affecting love stories.",
    "There are two special moments in the film.",
    "The beauty and the pathos of the film are vivid in every frame.",
    "Inspired by prize-winning French author Ernest Pérochon’s 1924 novel, director Xavier Beauvois’ emotionally devastating adaptation — which some may find as arduous as the wartime chapter it depicts — dispenses with a fair amount of the suffering to be found in the book, forgoing the contemporary tendency toward gritty, handheld realism in favor of a more timeless, almost painterly aesthetic.",
    "Meditative in its pacing, painterly in composition, quietly devastating in its low-key drama, the latest film from Xavier Beauvois shares some of the slow-burning potency of his acclaimed study of religious faith, Of Gods And Men.",
    "It proves that Beauvois still masters his uniquely classical brand of filmmaking, coaxing strong performances out of veteran Nathalie Baye and newbie Iris Bry, who makes an impressive screen debut.",
    "The Guardians is a historical drama that doesn’t lose itself in decorative period detail, a beautifully photographed chronicle of rural existence that refrains from picturesque sentimentality and grinding misery, the usual modes for this kind of film.",
    "This handsomely staged production plays like a soothingly thoughtful balm.",
    "Part of the allure of The Guardians comes from the casting: The radiant, real-life mother and daughter Baye and Smet play mother and daughter Hortense and Solange.",
    "The film captures the pictorial beauty of old-fashioned farm life, but director Xavier Beauvois is careful not to romanticize hard labor for its own sake.",
    "The Guardians is a subtle, beautifully made and quietly feminist work about the fortitude of women during wartime.",
    "What starts out as a testament to female fortitude, reminding us that sacrifices were also made on the home front, gradually turns into high-toned soap opera."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "All the French food (movies) tastes the same. You either love them or hate them.",
      "review_date": "2018-09-07"
    },
    {
      "review_title": null,
      "content": "An understated, poetic film set in a quiet countryside during a tumultuous time. Serves as an alternative perspective to war and its casualties. Nathalie Baye, Laura Smet, Iris Bry all gave a first-rate performance. The pacing is on the slowAn understated, poetic film set in a quiet countryside during a tumultuous time. Serves as an alternative perspective to war and its casualties. Nathalie Baye, Laura Smet, Iris Bry all gave a first-rate performance. The pacing is on the slow side. Needs patience to take it all in.",
      "review_date": "2018-06-03"
    }
  ],
  "num_reviews": 17
}