{
  "title": "Thugs of Hindostan",
  "rating": 2.5,
  "release_date": "2018-11-08",
  "genre": [
    "Action",
    "Adventure",
    "Drama",
    "Crime"
  ],
  "summary": "Vijay Krishna Acharya (Victor), the writer-director of the all-time YRF blockbuster Dhoom:3, teams up once again with Aamir Khan in Thugs of Hindostan along with Amitabh Bachchan to give the audience a never seen before experience of larger than life filmmaking! The film is set to treat audiences across age groups with the biggestVijay Krishna Acharya (Victor), the writer-director of the all-time YRF blockbuster Dhoom:3, teams up once again with Aamir Khan in Thugs of Hindostan along with Amitabh Bachchan to give the audience a never seen before experience of larger than life filmmaking! The film is set to treat audiences across age groups with the biggest jaw-dropping action sequences seen by audiences on screen to date. With its edge-of-the-seat thrills and an epic adventure and war on the seas, the film is set to light up this Diwali. … Expand",
  "critic_reviews": [
    "For all its recycled elements and predictable narrative stratagems, this diverting Diwali-timed extravaganza stands on its own merits as a lightly satisfying popcorn epic — provided, of course, you have a taste for such over-the-top amusement.",
    "It has that rare and unmistakable look of an event movie that was huge fun to assemble. Whether you’re watching in Hindi, Tamil or Telugu – or reliant on English subtitles – much of that enjoyment does translate."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "This was the worst possible movie for Amitabh and Amir to share the screen for the first time. They deserved a lot better. ..Good : Amir Khan's performance. That's perhaps the only saving grace. Still, not his best work at all. The openingThis was the worst possible movie for Amitabh and Amir to share the screen for the first time. They deserved a lot better. ..Good : Amir Khan's performance. That's perhaps the only saving grace. Still, not his best work at all. The opening was fairly decent. Some parts were visually appealing. ..Bad : This movie is just f**king bad. The role of Khudabaksh could've been given to any B grade actor. Bachchan was wasted as Khudabaksh. It was a shameless ripoff of Pirates of the Caribbean. Okay, I can tolerate that. But, that's not all. It has the same old Indian rebels vs Angrez storyline which has grown stale over the years, and it doesn't even try to make it more interesting. Instead, it gives us lamer version of that storyline. It also jinxed some promising characters, but like in almost every Bollywood mainstream film, it makes a parody out of it and books it completely over the top, if the initial characterization wasn't much of something called \"over the top\". The action scenes look super fake. There are sword fights, and not a single drop of blood. We can clearly see the swords going under the armpits (THAT'S VIJAY KRISHNA ACHARYA FOR YOU). It is too laughably bad. The character of Amir Khan feels like too much. He continues to trade sides between Angrez and Indians, to the point where it feels absolutely nauseating and to every point beyond that. You would want to scream \"pleaaase, stop\". There is one gigantic \"twist\" in the film. But, if you have seen any of these stupid masala entertainers, you can predict it. Since they won't kill of a major character, the twist becomes trivially predictable. That's how lame this piece of s**t is. There is no character development to understand why some characters get their mind changed, except for the fact that they wanted to include a cheap shock value. Katrina Kaif serves her usual purpose of showing her skin for some sexually appealing scenes and dancing in a semi nude costume. Other than that, she is a plot device. And her acting is too good. Even a mannequin gives more expressions than her. The story is crazy and lame. It looks too big, but is the same old s**t. If you want to see an Angrez vs Indian film, watch \"Kranti\" (1981), not this garbage. ..Conclusion : If you are a fan of Amitabh or Amir, check out this film, because it may be the only film in which they both are together. But except for their mere presence, do not expect anything. It sucks big time. Otherwise, do anything productive. Spend your time locking yourself in the bathroom doing nothing, rather than watching this rat's a$$ of a movie. ..Rating. ..Score : 0/10Grade : F",
      "review_date": "2019-03-13"
    }
  ],
  "num_reviews": 3
}