{
    "rating": 4.5,
    "release_date": "1990-10-12",
    "num_reviews": 290,
    "genres": [
        "Horror"
    ],
    "summary": "When young Joshua (Michael Stephenson) learns that he will be going on vacation with his family to a small town called Nilbog, he protests adamantly. He is warned by the spirit of his deceased grandfather that goblins populate the town. His parents, Michael (George Hardy) and Diana (Margo Prey), dismiss his apprehensions, but soon learn to appreciate their son's warnings. Guided by his grandfather's ghost, will Joshua and his family stand a chance in fighting off these evil beings?",
    "reviews": [
        {
            "content": "One of the finest films you will ever see!",
            "review_date": "2023-04-18",
            "source": "rt"
        },
        {
            "content": "Awful worst film I've ever watched almost feel asleep five times through the movie terrible acting horrible puppets I am giving it 1 full star because it had some cool body horror, unless your into bad movie DO NOT WATCH",
            "review_date": "2023-04-05",
            "source": "rt"
        },
        {
            "content": "That was propbably one of the worst movies I've ever seen",
            "review_date": "2023-03-28",
            "source": "rt"
        },
        {
            "content": "Perhaps the worst film ever made.",
            "review_date": "2023-02-24",
            "source": "rt"
        },
        {
            "content": "A modern classic, more influential than Beethoven, more artful than Michelangelo. Without a doubt Troll 2 is the movie to show your family. Show it to your kid! Show it to your mother! Show it to the dog! Troll 2 is without a doubt the peak of modern entertainment, despite being more than 30 years old! Watch now!",
            "review_date": "2023-01-10",
            "source": "rt"
        },
        {
            "content": "This was objectively the most amazing movie ever created. I hope people from all over the world can experience the wonder of this movie. This movie changed my life.",
            "review_date": "2022-12-31",
            "source": "rt"
        },
        {
            "content": "This film has proven a truly phenomenal and groundbreaking masterpiece of the genre. Never has the film industry ever been so graciously blessed with such undeniable talent and beauty in the form of a film.",
            "review_date": "2022-12-28",
            "source": "rt"
        },
        {
            "content": "Might be one of the best worst movies ever made.",
            "review_date": "2022-12-18",
            "source": "rt"
        },
        {
            "content": "So bad it's good. Pair it with the doc about the making, \"Best Worst Movie,\" and you've the perfect date night.",
            "review_date": "2022-12-08",
            "source": "rt"
        },
        {
            "content": "Greatest movie of all time. try to convince me otherwise",
            "review_date": "2022-11-04",
            "source": "rt"
        },
        {
            "content": "This is the quintessential \"so bad it's good\" movie. The first thing you need to know about Troll 2, to adjust your expectations, is that it contains not a single troll. If that seems like a pretty big problem for a film called Troll 2, then you haven't seen anything yet. This movie contains such fantastical scenes as... as... a helpful ghost stopping time so that a kid can jump onto a dinner table and pee all over his family's food, which is naturally the only sane way to prevent them from eating a substance that would otherwise turn them all into goblin snacks (oh, yes, there are goblins in Troll 2, just no trolls). In another scene, the villainous witch who rules the goblins becomes a sexy femme fatale and seduces a young man in his trailer, brandishing what I can only describe as a corn-on-the-cob dildo. After the lad falls under the witch's spell, so to speak, the two frolic on his bed \"eating\" the phallic corn until, at the climactic moment, popcorn erupts out of thin air, shooting everywhere and covering them. This is some pretty strong visual allegory for a PG 13 rated release! The narrative purpose of the scene, though, like much in Troll 2, is unclear, given that after the witch leaves the lad he seems perfectly fine and none the worse for his experience. Others victims are not so lucky, finding themselves turned into edible vegetation for goblins to feast upon. Some of the acting in Troll 2 vies with the best that Tommy Wiseau's The Room or Neil Breen's Fateful Findings has to offer. I would say that Troll 2 is unintentionally hilarious, but I'm not so confident in offering an opinion on what the filmmakers intended when making Troll 2. What I can say is that, although Troll 2 is \"bad\" on a whole different level from most of its competitors, I unironically love it.",
            "review_date": "2022-09-21",
            "source": "rt"
        },
        {
            "content": "For the specific genre that this movie falls into (Trainwreck), this is one of the best. The directing, acting, writing, and production are all some of the worst in the history of filmmaking. Ever. Not to mention that the title has absolutely no connection to the movie whatsoever. This movie is a must if you are into trainwrecks. I guarantee you that it will not disappoint.",
            "review_date": "2022-08-13",
            "source": "rt"
        },
        {
            "content": "So bad it's laughable, acting appalling, not so special effects. How this even made it onto VHS is beyond me.",
            "review_date": "2022-06-11",
            "source": "rt"
        },
        {
            "content": "Troll 2 is the pinnacle of human creation. It can make you laugh, cry, shout in terror, and more in its short 1h35m runtime. I couldn't handle some of the rather terrifying angles, which only made the whole experience better in my opinion. The costume designs are fantastic and extremely scary. I commend the actors for their terrific performance, and can't wait for more. This movie has absolutely no weak points and is, in my opinion, the movie I've ever seen!",
            "review_date": "2022-05-28",
            "source": "rt"
        },
        {
            "content": "i ate this movie it tasted like a gerald",
            "review_date": "2022-05-23",
            "source": "rt"
        },
        {
            "content": "Life changing experience. Not sure if it changed my life for better or for worse but I will certainly never be the same man I was before, and for that it deserves some merit.",
            "review_date": "2022-05-04",
            "source": "rt"
        },
        {
            "content": "The film starred an unknown and hypnotically strange group of Utah non-actors and does not contain any \"trolls\" at all. No, the beasts of the perfect B-movie are actually vegetarian, shape-shifting GOBLINS whose cuisine of choice is humans who've been turned into plants. The joy of this movie is that neither the crew nor the cast is able to convey anything resembling real human interactions, reactions, or emotions at any time during the film. The result is 94 minutes of aliens pretending to be humans pretending to be in a movie where they pretend to be threatened by other aliens pretending to be goblins",
            "review_date": "2022-04-07",
            "source": "rt"
        },
        {
            "content": "Don't mistake the half star rating, this is a very entertaining and quotable movie. Don't mistake my last sentence, this is a horrible movie. It is without a doubt the Best/Worst Movie.",
            "review_date": "2021-11-24",
            "source": "rt"
        },
        {
            "content": "Troll 2 is a film, Troll 2 was made with a camera. People used that camera to make this film. In fact I would go as far as to say that troll 2 is one of the films of all time and was certainly made in 1991. There are actors in this film, they act out scenes written by the writer. Troll 2 is a film that exists on earth. Troll 2 is a film. Thank you for coming to my ted talk.",
            "review_date": "2021-11-21",
            "source": "rt"
        },
        {
            "content": "I love this movie so much. It's fun and weird.",
            "review_date": "2021-11-11",
            "source": "rt"
        },
        {
            "content": "Troll 2 gets 2 stars for being bad enough to be (sorta) good. I didn't laugh out loud that much, but I was baffled enough by every \"creative\" decision to be mildly entertained.",
            "review_date": "2021-10-26",
            "source": "rt"
        },
        {
            "content": "Movie of the year for 1990.",
            "review_date": "2021-10-24",
            "source": "rt"
        },
        {
            "content": "Is Troll 2 the worst horror movie ever? It is bad. Bad writing, bad acting, and bad overall everything. But I feel like it runs the fine line of being so bad it's good. Go into it knowing you are going to laugh instead of being scared and you'll like it more.\n(foreverfinalgirl.com/troll-2/)",
            "review_date": "2021-10-04",
            "source": "rt"
        },
        {
            "content": "Those snacks tasted weird.",
            "review_date": "2021-10-03",
            "source": "rt"
        },
        {
            "content": "Honestly if I could give this movie a negative rating than I definitely would, I think I lost all my brains cells watching this, it was funny at first because of how bad it was but then somehow it got way worse. I definitely do not suggest this whatsoever. My officially rating is -1million, worst movie that was ever made",
            "review_date": "2021-09-30",
            "source": "rt"
        },
        {
            "content": "this movie sucks Troll 2 is a very bad movie and a meme?",
            "review_date": "2021-08-04",
            "source": "rt"
        },
        {
            "content": "I only seen this movie once, idk if I would watch it again. I don't think that I would reccomend this movie to others. I thought that I was being kind and I went with 1 star for this movie. I watched it because I had to see what all the hype was about this movie. They say that this is one of the best worst movies made. So I was in, I kinda had a tough time finding a score to rate this movie. I was watching it the a few days ago and my bf told me this movie scared him as a kid. I had just seen it for the first time. Not the best movie I ever seen and not the worst movie I have ever seen. I say watch it just for laughs if you're bored one day. This is such a corny type movie with the people in the troll outfits, you may like it who knows. Kinda funny and not scary at all 1 star.",
            "review_date": "2021-07-31",
            "source": "rt"
        },
        {
            "content": "This film not only changed my perspective on the medium of filmmaking, but my perspective of the human condition as a whole. This film is so unabashedly life changing. It is in no way anything but in the true sense of the word \"awesome\". This movie has inspired me to take full control of my life, I was once a crippled man without the ability to walk. Watching \"Troll 2\" (better known as \"Goblin\"), Cured my disability and my cancer, and my aids, and my Bubonic Plauge Symptoms. I used to live on the streets with nothing but a small pouch of beads to trade with other homelessmen. Now I am a succesful businessman owning over 12 1/2 companies. I was a man who was biggoted and predjudiced. Now I am friends with over 12 1/2 black men. I went through serious psychological reconditioning after seeing this film for the first time, now i have seen it over 12 1/2 times and I am truly a completley different man/being. Please i urge NAY! PLEAD YOU TO WATCH THIS FILM! IT WILL TRULY INSPIRE YOU TO CHANGE FOR THE BETTER! THIS FILM SHOULD BE PLAYED IN CHURCH AND IN SCHOOLS! SO ALL UNINTELIGENT CREATURES CAN KNOW THIS FILMS WORTH, MESSAGE, BEAUTY AND, POWER!",
            "review_date": "2021-07-30",
            "source": "rt"
        },
        {
            "content": "Motocicleiton approves dis movi.\nSeriously tho, this is a work of a dilligent director and a fantastic crew with production quality all aroud, I WISH I could chop off my left leg in homage to this masterpiece, if I ever have a battalion of sons, each one of them will be named Troll 2.\n\n       \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTroll 3 when?",
            "review_date": "2021-06-20",
            "source": "rt"
        },
        {
            "content": "It's so bad, but it's so funny because it's so bad. It truly is one of the best worst movies ever made.",
            "review_date": "2021-05-28",
            "source": "rt"
        },
        {
            "content": "this movie is like a mosaic of all movies, it is well written, the casting is perfect, and the story is beautifully told. this movie made my life better after I saw it, it has made me a different person than that before seeing this film. 10000000/10 must-watch (:",
            "review_date": "2021-04-26",
            "source": "rt"
        },
        {
            "content": "Ok here's where I stand. I need this audience score to go way down so I have it half a star which production wise, it deserves. But it brings joy to almost everyone who watches it so it's a GOOD movie. So what the acting and directing isn't very good. The legacy is amazing.",
            "review_date": "2021-01-09",
            "source": "rt"
        },
        {
            "content": "Ha this is the best movie ever for all the wrong reasons\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTYhis movie is too amazing\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTHEIR EATING HER AND THEIR GONNA EAT ME OMGOOOOOOOOOOODDDDDDDDDDDDDDD",
            "review_date": "2020-11-17",
            "source": "rt"
        },
        {
            "content": "my god, this film is very bad, flawed, terrible in all possible situations, don't waste your time with this film, one of the worst films of all time.",
            "review_date": "2020-11-17",
            "source": "rt"
        },
        {
            "content": "(Spoiler alert) I liked the movie until the ending... like what the fuck? Why would you kill the mother infront of the child....  I watched all that for it to end that way!!!",
            "review_date": "2020-10-09",
            "source": "rt"
        },
        {
            "content": "This movie is so bad and so strange that it's hilarious! It's a cult classic for a reason.",
            "review_date": "2020-10-05",
            "source": "rt"
        },
        {
            "content": "Its perfection incarnate",
            "review_date": "2020-09-20",
            "source": "rt"
        },
        {
            "content": "There is no review can do this justice. It has to be seen to be believed. It's incredible, I love it.",
            "review_date": "2020-07-25",
            "source": "rt"
        },
        {
            "content": "Having just watch some of the worst movies ever made (Manos hand of fate, Birdemic, Santa and the Ice Cream Bunny) this is Not the worst movie. it also not the Best Worst movie, no matter what the documentary says. its just bad. bad acting, story, and directing. the effects are good, the makeup is fine. not good by any stretch, but there is much worse out there",
            "review_date": "2020-06-28",
            "source": "rt"
        },
        {
            "content": "If you watch this for the right reasons it is one of the funniest movies ever. Many many movies have been called the worst piece of crap of all time but none of them hold a candle to Troll 2",
            "review_date": "2020-06-28",
            "source": "rt"
        },
        {
            "content": "awful movie, great entertainment. a true must watch classic.",
            "review_date": "2020-06-07",
            "source": "rt"
        },
        {
            "content": "Just awful. I can't believe I spent 20$ to rent.",
            "review_date": "2020-04-17",
            "source": "rt"
        },
        {
            "content": "Watched this in a playwriting class to illustrate how not to craft dialogue. Insufferable, poor quality trash. I also find it amazing how a film could have been made as late as 1992 with zero awareness of women’s rights and diversity, absolutely no people of color in the entire film. Only enjoyed for how bad it is, but if that’s your thing I feel bad for how some people waste their time. ",
            "review_date": "2020-04-08",
            "source": "rt"
        },
        {
            "content": "We spent the movie looking for a trans rights Garfield shirt dot png",
            "review_date": "2020-02-02",
            "source": "rt"
        },
        {
            "content": "Is \"Troll 2\" really that bad?!? Have you seen \"The Video Dead\" or \"Smokey and the Bandit 3\"?!?\nAnd don't get me started on every movie Jennifer Lopez has been in!!!!",
            "review_date": "2019-11-26",
            "source": "rt"
        },
        {
            "content": "Greatest movie ever made. The acting, the effects, the plot are all a masterpiece. ",
            "review_date": "2019-11-07",
            "source": "rt"
        },
        {
            "content": "there is no logical explanation for this ",
            "review_date": "2019-10-06",
            "source": "rt"
        },
        {
            "content": "Oh my goooood!!! How terrible this movie was ",
            "review_date": "2019-09-27",
            "source": "rt"
        },
        {
            "content": "A 'horror' story, Brady Bunch style. They all sound like barely literate ball stars reading a teleprompter screen for the first time. \nHorrible acting. It's a 90's movie but more 70-ish. I actually liked Part 1 better.\nThe acting is terrible but there's just so many things worse about  even the plot. \nAnd the 'go vegan' theme is a bit over the top. I could probably think of better ways to preach the vegan ideal than this movie. There needs to be a negative star rating for movies like this one. ",
            "review_date": "2019-09-06",
            "source": "rt"
        },
        {
            "content": "This film is the embodiment of the phrase \"So bad it's good\".",
            "review_date": "2019-08-15",
            "source": "rt"
        },
        {
            "content": "Maybe fans of this inexplicable, inept, yet entirely enjoyable drivel have gotten it wrong for years, and the titular \"troll\" is not so much a noun nowhere to be found but a verb, less \"troll two\" than it is \"to troll\" the audience. At least, that's the only explanation I can muster for this madness, which really is as bad (and as good) as people say—so don't let the score fool you: this is really a five star experience, in the same sense that doing loads of meth is a five star experience.",
            "review_date": "2019-08-02",
            "source": "rt"
        },
        {
            "content": "Esto es un Clasico de Verano ",
            "review_date": "2019-07-27",
            "source": "rt"
        },
        {
            "content": "Literally the best movie to hate watch ever.",
            "review_date": "2019-07-12",
            "source": "rt"
        },
        {
            "content": "So bad it's good. I've watched this movie at 4 am and I think that's the only suitable time for putting up with its brilliant bullshit.",
            "review_date": "2019-04-23",
            "source": "rt"
        },
        {
            "content": "Barely a dull moment!",
            "review_date": "2019-04-12",
            "source": "rt"
        },
        {
            "content": "It's bizarre and VERY entertaining! Barely a dull moment.",
            "review_date": "2019-03-28",
            "source": "rt"
        },
        {
            "content": "I really thought there was potential in this,considering its the sequel to my favorite movie.But sadly,it went the wrong way,as troll 2,has bad acting,bad music,and overall,a bad movie.But it is known to be the best worst movie,so you gotta give it stars for something.",
            "review_date": "2019-02-05",
            "source": "rt"
        },
        {
            "content": "A kid defeats a town of demented goblins with a bologna sandwich. Great movie!",
            "review_date": "2019-02-01",
            "source": "rt"
        },
        {
            "content": "Oh is this just classic cheese ! In a way a good movie, rather dumb , goony plot , not TOO BAD of acting . But of course rather stupid . Something to watch if you're just REALLY bored . How to improve ? . . Well special effects were rather simplistic . . But you just want some \" Cheese \" ? Here ya go",
            "review_date": "2019-01-27",
            "source": "rt"
        },
        {
            "content": "Iv never been one of the people to watch the (so bad its good) movies because in reality so bad its anything other then bad is rare. this is one of the rare exceptions it really is so over the top and rediculous thats its a good watch if just for the goblin masks and the \"oh my god\" scene lol",
            "review_date": "2019-01-25",
            "source": "rt"
        },
        {
            "content": "A must for the \"so bad its good\" horror flick lover. \nThe acting & script make it feel like a low budget porno without the porn or acting skills.",
            "review_date": "2019-01-13",
            "source": "rt"
        },
        {
            "content": "If you're a fan of hilariously terrible movies, then look no further than TROLL 2. There aren't actually any trolls in this film.",
            "review_date": "2018-12-29",
            "source": "rt"
        },
        {
            "content": "hahah troll 2 baby. great movie, but kinda scary, so not for kids under 12. the trolls look like real trolls, so impressive CGI! all in all great movie\nWritten by Blend S 17/12-2018",
            "review_date": "2018-12-17",
            "source": "rt"
        },
        {
            "content": "One of the worse movies of all time. Just watch the Youtube video of all the worst moments and you got all you could out of it.",
            "review_date": "2018-12-03",
            "source": "rt"
        },
        {
            "content": "So bad that its good. Its one of those horror movies you could watch in the middle of the day. The actors are terrible that its really funny.",
            "review_date": "2018-11-18",
            "source": "rt"
        },
        {
            "content": "After watching this movie, I realize the title of the Movie sums it all up.",
            "review_date": "2018-10-22",
            "source": "rt"
        },
        {
            "content": "My friends uncle is the guy who has the corn orgasm",
            "review_date": "2018-10-14",
            "source": "rt"
        },
        {
            "content": "Hahahahaha wow... this movie really was something else. Normally something like this would get a half star for how atrocious it is, but this was like a slow motion train wreck that you can't keep your eyes off. Two stars for being amused by just about everything from the corny acting to the bad plot.. the cheesy soundtrack, it has it all and then some. This could give The Room a run for it's money on how awful it is. WTF indeed.",
            "review_date": "2018-09-14",
            "source": "rt"
        },
        {
            "content": "Undeniably qualifies as one of the worst films ever.",
            "review_date": "2018-08-25",
            "source": "rt"
        },
        {
            "content": "Incredbile film!!!!!",
            "review_date": "2018-04-16",
            "source": "rt"
        },
        {
            "content": "This is such a poorly made movie, but it's very entertaining. The awkwardness and randomness is what makes this movie being so bad, it turns out to be brilliantly stupid.",
            "review_date": "2018-03-24",
            "source": "rt"
        },
        {
            "content": "it certainly is a farce, but it's amusing and significantly better than movies that were bad enough to make me angry.",
            "review_date": "2018-03-12",
            "source": "rt"
        },
        {
            "content": "Oh my goooooooooood.",
            "review_date": "2018-01-09",
            "source": "rt"
        },
        {
            "content": "The possibly the best but also most horribly made movie of all time. It's not for everyone but if you want to have a fun cheesy time watch this freaking movie.You will come out on the other side not believing what you have just witnessed. Gets better and better the more you watch it and the more you drink. Then you wake up the next morning going like, what the hell was I thinking?",
            "review_date": "2017-12-17",
            "source": "rt"
        },
        {
            "content": "Wow, they didn't even try with this movie, all I can say is\n\"You can't piss on hospitality\"",
            "review_date": "2017-11-17",
            "source": "rt"
        },
        {
            "content": "If this was a living being like that kid with the fly on his forehead: \"He reviewed the first film. And then he's going to review me. OH MY GOOOOOOOOOOOOOOOOOOOOOOOODDDDDD!!!!\" This movie is one of the worst things to ever exist. I find it debatable whether this or The Room is the best worst movie, especially since I'm a huge fan of The Room's awful quality. The effects and makeup look rather cheap, there's the misleading title and it's rather weird, but not in a good Tim Burton-esque kind of way. The acting is just awful but I don't find it to be as memorable as that of Tommy Wiseau whose indecipherable accent made the movie amusing especially during that awkward James Dean nod. There are multiple instances of bad editing, errors in filmmaking and things that make you think \"What?\". Like the time-stopped sequence, the kid has 30 seconds which means 1 minute in the \"cleverly titled\" Nilbog and does the kid remove the food that turns people into plants from his family's hands? No, he \"pisses on hospitality\". And everyone knows you can't piss on hospitality. Everyone is one side of the spectrum. They're either overacting or they barely are. The villain, a druid witch, speaks in a slow manner. Not 0.5 speed YouTube slow but she unnecessarily makes sentences longer than they actually are. Padding, ladies and gentlemen, padding. This movie has one of the most absurd ways to defeat a villain EVER. It's actually rather infuriating. But I like to keep my reviews spoiler-free excluding minor ones, so I'll let you figure out this way how the goblins were defeated. The funny thing is the mother is the scariest character in the entire movie but it isn't intentional. And the movie is categorized as a comedy but I don't know where the intentional humour is. Or wait, are you saying the unintentional humour including the timeless quotes were done on purpose unlike Tommy Wiseau who'd rather hide from his mistakes by saying \"Yes, yes. Movie is flawed. But I do that on purpose\". Just, what the hell was this movie all about? Especially with the dead grandpa. I have no idea. Maybe I should dive deeper into the depths of cinematic hell for VERY terrible movies. I hear Birdemic is absolutely awful, not even reaching \"so bad, it's good\" status. And I've been planning on investigating what made The Garbage Pail Kids Movie such a mess for months now since I believe that with most of my movies, I too often play nice with what I see. Yeah, I'm taking a cue from I Hate Everything. Troll 2, everybody. A movie that may or may not be the best worst movie ever. I still consider The Room to fall under that category.",
            "review_date": "2017-11-12",
            "source": "rt"
        },
        {
            "content": "Epic, Masterpiece \n3 Star Wars Fanboys out of 3",
            "review_date": "2017-10-15",
            "source": "rt"
        },
        {
            "content": "The worst film ever made",
            "review_date": "2017-09-23",
            "source": "rt"
        },
        {
            "content": "3/5.  Possibly the greatest bad movie of all time.",
            "review_date": "2017-07-17",
            "source": "rt"
        },
        {
            "content": "Fantastically bad. They don't make bad this good anymore.",
            "review_date": "2017-06-25",
            "source": "rt"
        },
        {
            "content": "Very entertaining, awful film. Better watched in a group setting, to get the full effect of the crazy you're witnessing.",
            "review_date": "2017-05-25",
            "source": "rt"
        },
        {
            "content": "This truly is one of the greatest examples of a truly charming film that is terribly bad. Some of the most worst acting I have ever seen.\n\nThe ridiculous story of a family going to Nilbog (Goblin spelt backwards) & the town is infested by goblins.\n\nSuch a terrifically bad film that is just so fun to watch & reached such a cult status there is now a documentary focusing on its pathetic charm.",
            "review_date": "2017-04-30",
            "source": "rt"
        },
        {
            "content": "It's something to laugh at.",
            "review_date": "2017-04-21",
            "source": "rt"
        },
        {
            "content": "Pure genius.  It's an acquired taste to fully enjoy.  If you haven't seen it, you're truly missing out.",
            "review_date": "2017-04-20",
            "source": "rt"
        },
        {
            "content": "I am not part of the Troll 2 cult. The film \"Best Worst Movie\" makes the concept and production details more entertaining than the movie itself !! Claudio Fragrasso (uncredited on the RT page above) is an Italian film director with limited grasp of English trying to make a fantasy horror film with two cameras and about five hundred dollars. Or something. The second act of this dismal little creeper follow a group of murderous, insane vegetarian rednecks and butt-ugly trolls as they terrorize a family of just, decent, bland Americans.",
            "review_date": "2017-03-03",
            "source": "rt"
        },
        {
            "content": "Rating: 0/10\n\nWow.  This is awful.  Unspeakably, undeniably, inexcusably awful.  The acting, the story, the music, the dialogue...it's just horrendous.  How does something like this happen?  Why?  It's just so, so, so, so, so, so, so, so, so, so...bad.  And it's hilarious.  Unspeakably, undeniably, inexcusably hilarious.",
            "review_date": "2017-02-20",
            "source": "rt"
        },
        {
            "content": "A film so god-awful, so convoluted, so campy, and so mysterious, that you are left floored at how horribly entertaining it is. At least the cinematography is decent. Definitely recommend for horrible movie night.",
            "review_date": "2017-01-20",
            "source": "rt"
        },
        {
            "content": "wow so bad. it made me laugh a bunch of times but not enough for this to be an overall enjoyable experience. i now know what is considered by many to be the worst movie of all time. i've seen worse :) (1 viewing)",
            "review_date": "2016-12-07",
            "source": "rt"
        },
        {
            "content": "This is among those movies which are so bad, it's actually pretty good. Or at least, entertaining. In what seems to be a totally different story from the first movie, Troll 2 proves that no matter what the subject is, you can have a cult film. Personally, I think that this should be Cult Movie Gold, stored in a Hall of Fame somewhere, with the likes of 'The Room'.\n\nI honestly don't know what's worse though, the mother's acting in this movie or the just how plain disgusting the slime from the trolls is. Grosses me out. Yuck.",
            "review_date": "2016-11-07",
            "source": "rt"
        },
        {
            "content": "This has got to be the worst film I've ever seen.",
            "review_date": "2016-11-04",
            "source": "rt"
        },
        {
            "content": "This movie is one of best unintentional comedians you will ever see the writing is beyond strange the acting horrible but in such way that makes you laugh the plot isn't terrible but the way they handle it is there are so many moments in this film that will have you speechless if you fan of the so bad there good this is one you must watch",
            "review_date": "2016-09-28",
            "source": "rt"
        },
        {
            "content": "A piece of trash that you have to see",
            "review_date": "2016-09-26",
            "source": "rt"
        },
        {
            "content": "\"They're eating her! and then they're going to eat me! Oh my gooooooooooooooooooooooooooooood\" Movies contains 0 trolls and calls itaelf Troll 2, this movie is a troll",
            "review_date": "2016-08-18",
            "source": "rt"
        },
        {
            "content": "Honestly this movie is as cheesy as a bad episode of the Goosebumps TV show",
            "review_date": "2016-08-10",
            "source": "rt"
        },
        {
            "content": "Was I supposed to laugh that much?",
            "review_date": "2016-07-19",
            "source": "rt"
        },
        {
            "content": "This film can only be a guilty pleasure. It is one of the most entertainingly bad films of all time, it's writing, acting, directing, story is all atrocious and It's so much fun.",
            "review_date": "2016-07-06",
            "source": "rt"
        },
        {
            "content": "This is plain and simply a bad movie. The all of the following things are superbly awful: the writing, plot, acting, scenes, production value, and above all the scariness. The fact that people say that the movie is so bad it is hilarious, shows it is not scary.",
            "review_date": "2016-07-03",
            "source": "rt"
        },
        {
            "content": "This is a pretty bad movie!",
            "review_date": "2016-06-04",
            "source": "rt"
        },
        {
            "content": "Holy Christ, what a wretched dumpster fire.  There is nothing redeeming about this crap.  Some will have you believe it's so-bad-it's-good, but that's a bold faced lie.",
            "review_date": "2016-05-29",
            "source": "rt"
        },
        {
            "content": "I saw the best worst movie ever before this.  It indeed is some of the worst acting ever.  It is very entertaining is its so bad its good kind of way.",
            "review_date": "2016-05-18",
            "source": "rt"
        },
        {
            "content": "que asco de pelicula la verdad es que es tan mala pero tan mala que se gana 394 premios razzies a peor guion y pelicula.",
            "review_date": "2016-04-28",
            "source": "rt"
        },
        {
            "content": "Troll 2 (1990) ??\nHideous--but extremely funny--schlock B movie may be the all-time worst. Dubious family vacations to Nilbog (spell it backwards) where they slowly-very slowly-discover there are little monsters who want to eat them. Hilariously awful \"horror\" entry features \"goblins\" instead of \"trolls\" (not that there's much of a difference), and is apparently a sequel to TROLL 1, a film that doesn't even exist.",
            "review_date": "2016-04-27",
            "source": "rt"
        },
        {
            "content": "one of the greatest cinematic achievements of all time",
            "review_date": "2016-04-15",
            "source": "rt"
        },
        {
            "content": "the best worst thing ever.",
            "review_date": "2016-04-15",
            "source": "rt"
        },
        {
            "content": "It's bad, it's been said already. There are a lot of moments that make you bug eyed and laugh out loud. The acting, the costumes, the effects- they're all terrible and funny. The story goes all over the place.",
            "review_date": "2016-04-10",
            "source": "rt"
        },
        {
            "content": "This movie is so hilariously bad that you can play an assorted number of drinking games to the numerous dumb moments in this \"film\"",
            "review_date": "2016-04-04",
            "source": "rt"
        },
        {
            "content": "The film starred an unknown and hypnotically strange group of Utah non-actors and does not contain any \"trolls\" at all. No, the beasts of the perfect B-movie are actually vegetarian, shape-shifting GOBLINS whose cuisine of choice is humans who've been turned into plants. The joy of this movie is that neither the crew nor the cast is able to convey anything resembling real human interactions, reactions, or emotions at any time during the film. The result is 94 minutes of aliens pretending to be humans pretending to be in a movie where they pretend to be threatened by other aliens pretending to be goblins.",
            "review_date": "2016-03-25",
            "source": "rt"
        },
        {
            "content": "Everyone loves a trainwreck.",
            "review_date": "2016-03-23",
            "source": "rt"
        },
        {
            "content": "Unwatchable. Skip at all costs!!!",
            "review_date": "2016-03-12",
            "source": "rt"
        },
        {
            "content": "Troll 2 is amazing for all the wrong reasons, did this movie make me laugh and smile a ton? Yes, but from a filmmaking standpoint  its absolute garbage. If you like a bad movie every once in a while like me though, you'll certainly enjoy yourself.",
            "review_date": "2016-02-29",
            "source": "rt"
        },
        {
            "content": "Best worst movie ever",
            "review_date": "2016-01-12",
            "source": "rt"
        },
        {
            "content": "It fucking sucks and I love it. I would recommend this to people, it takes its so bad its good to a whole new level that hasn't since been achieved. I'm proud to say I own the blue ray!",
            "review_date": "2016-01-09",
            "source": "rt"
        },
        {
            "content": "it's so bad but it works - a blast ;)",
            "review_date": "2016-01-09",
            "source": "rt"
        },
        {
            "content": "God bless Troll 2, God bless America.",
            "review_date": "2016-01-02",
            "source": "rt"
        },
        {
            "content": "So bad that it is pure genius",
            "review_date": "2015-11-01",
            "source": "rt"
        },
        {
            "content": "Like rehearsing for a high school play with overly exaggerated lines, poorly constructed costumes, badly executed fake looking special effects. Seriously, after watching Troll and then Troll 2, they do not follow as sequels at all in so many ways.",
            "review_date": "2015-11-01",
            "source": "rt"
        },
        {
            "content": "Watched the doc \"the best worst movie\" about this movie before this. Not sure that was a good idea, but then again not sure if it matters. This is one of the better bad movies out there, it live up to a lot of the hype but its not the best bad movie IMHO. Everything you would expect from a good bad film, but the best part is that there are NO TROLLS IN THE ENTIRE FILM! A must watch for fans of bad cinema.",
            "review_date": "2015-10-31",
            "source": "rt"
        },
        {
            "content": "It's goblin spelled backwards!",
            "review_date": "2015-10-31",
            "source": "rt"
        },
        {
            "content": "Let's face it, Troll 2 is a terrible movie, but it's impossible for me to hate it, because of how unintentionally hilarious it is. The terrible acting, ridiculous premise, and extremely cheesy costumes are all impossible not to laugh at. When you see this film all you can say is \"OH MY GOOODDD!!!\".",
            "review_date": "2015-10-15",
            "source": "rt"
        },
        {
            "content": "This movie is so bad that it is awesome, I fee that it was intended to be that way and if you don't see that then your sense of humor needs a check.",
            "review_date": "2015-09-29",
            "source": "rt"
        },
        {
            "content": "Spectacularly awful, Troll 2 is a train-wreck that must be seen to be believed.  The writing is atrocious, with painfully unnatural dialog and a ludicrous plot about goblins (NOT TROLLS!) turning people into plants in order to eat them.  And the \"acting\" is truly something to behold, as it's indescribably bad.  Additionally, the costumes and makeup effects look incredibly cheesy and ridiculous.  Yet there's something about how monumentally terrible Troll 2 is that makes it immensely entertaining and fun in that \"so bad, it's good\" kind of way.",
            "review_date": "2015-09-11",
            "source": "rt"
        },
        {
            "content": "Masterpiece of our time. Forget about films like The Godfather, Citizen Kane and Raging Bull...this is where it's at.",
            "review_date": "2015-09-10",
            "source": "rt"
        },
        {
            "content": "Four stars just for the laughs. \n*you can't piss on hospitality!*",
            "review_date": "2015-09-01",
            "source": "rt"
        },
        {
            "content": "It is so bad, but yet one of the funniest movies i have ever seen.  if you are looking for a laugh i highly recommend!",
            "review_date": "2015-08-22",
            "source": "rt"
        },
        {
            "content": "The best movie that I have ever seen in my entire life.",
            "review_date": "2015-08-12",
            "source": "rt"
        },
        {
            "content": "Troll 2 has it all ridiculous dialogue, plot holes galore, Bigfoot with a jet pack, weird popcorn \"sex\" scene?  I don't really know how to review a film like this, it is on one hand complete trash, but it's highly entertaining trash.  Where are the trolls by the way considering this film is about goblins and has nothing to do with the original.  For more insight into the phenomenon that is Troll 2, you should consider the documentary Best Worst Movie that is entirely about the making and impact of this film.  Cult classic stasis is guaranteed to last forever!",
            "review_date": "2015-08-10",
            "source": "rt"
        },
        {
            "content": "I love Troll 2.  It's so bad.",
            "review_date": "2015-08-09",
            "source": "rt"
        },
        {
            "content": "'Troll 2' is one of those movies you could go all 'Mystery Science Theater 3000' on. It's that bad, but in a so-bad-it's-good way.",
            "review_date": "2015-08-07",
            "source": "rt"
        },
        {
            "content": "Horrible everything.  The script doesn't make any goddamn sense. Vegetarian trolls who turn people into plants so they can eat them?  Also there aren't even any trolls in the film despite the title.",
            "review_date": "2015-07-25",
            "source": "rt"
        },
        {
            "content": "A film so bad it makes Battlefield Earth look like the work of a genius.  Any way to give a movie negative stars?  A million stoned monkeys couldn't come up with something this bad!",
            "review_date": "2015-07-19",
            "source": "rt"
        },
        {
            "content": "Surprisingly watchable for a movie with bad acting, a ridiculous plot, and so-low-budget-they-are-on-welfare special effects.",
            "review_date": "2015-07-11",
            "source": "rt"
        },
        {
            "content": "You can't piss on hospitality.\n\nDuring a family exchange between a suburban family and a country family things turn bad quick.  The son in the family keeps seeing his deceased grandfather, and the grandfather keeps warning him to get him and his family out of the town.  The town is filled with goblins trying to devour the family.  Can the family survive the goblin attacks?\n\n\"Trying to turn me into a homo?\n\"Wouldn't be too hard.\"\n\nClaudio Fragasso, director of Zombie 2, 3, and 4; Beyond Darkness; The Squad; Strike Commando; Monster Dog; and Rats: Night of Terror, delivers Troll 2.  The storyline for this picture is terrible with some mediocre acting but some of the gore scenes and settings were entertaining.  \n\n\"You're human?\"\n\"Very human.  Want to see?\"\n\nI came across this on Netflix and remembered having seen this on HBO a ton as a kid.  This is one of those entertaining bad movies.  It is definitely a bad movie, but it always holds my attention.  I strongly recommend seeing this fun bad movie.\n\n\"They're eating her.  Then they are going to eat me!\"\n\nGrade: D",
            "review_date": "2015-07-09",
            "source": "rt"
        },
        {
            "content": "Lolololololololol...... LOOOOOOOOL\n\nThat's what \"Troll 2\" basically sums up to be. A movie that doesn't talk about trolls, but, instead, \"Goblins\". The first half was just godawful then the second half just became ridiculous and absurd. For some reason, Sharknado was better than this. That's how BAD this movie was. Haha",
            "review_date": "2015-07-01",
            "source": "rt"
        },
        {
            "content": "funniest worst movie ever.",
            "review_date": "2015-06-20",
            "source": "rt"
        },
        {
            "content": "A friggin awful classic. Watch for the sake of cult movie status hilarity - and no other reason.",
            "review_date": "2015-06-20",
            "source": "rt"
        },
        {
            "content": "Troll 2 is a complete mess of a film, but that is the main reason why this film is entertaining. The acting is absolutely horrible, everything in the film is done completely wrong, the costumes are so bad they look like they were bought from a cheap Halloween store, and it's basically not even a sequel to the first film. Frame to frame, this movie is horrendous and is fulfilled with obviously noticeable mistakes, but that's what makes this film hilarious and very enjoyable. I don't know if the people who worked on this film were trying to actually be serious about it or make it look like a awful film on purpose, but they succeeded at making it a film so bad and horrible that it's actually pretty good. A must watch for a lot of laughs!",
            "review_date": "2015-06-14",
            "source": "rt"
        },
        {
            "content": "Terrible In the best possible way",
            "review_date": "2015-06-07",
            "source": "rt"
        },
        {
            "content": "It's so bad in a formal sense that it transcends any traditional notions of a \"bad movie\" and manages to be consistently entertaining.  A one star or four star rating seem equally appropriate depending on the expectations you have on first viewing.",
            "review_date": "2015-05-25",
            "source": "rt"
        },
        {
            "content": "Best film I've ever seen.",
            "review_date": "2015-05-19",
            "source": "rt"
        },
        {
            "content": "In expecting hilarious horribleness, this movie was disappointing. Too ridiculous, weird, creepy, and terribly made to even begin to wrap your head around it, this movie doesn't leave you with laughs; just plain confusion and ridicule.",
            "review_date": "2015-05-14",
            "source": "rt"
        },
        {
            "content": "An absolute masterpiece in crap, Troll 2 is the true so bad it's good flick with everything so wrong, that it's so right at the same time.\n\nOh my gaaaaaaaaaaaaaawd!",
            "review_date": "2015-05-13",
            "source": "rt"
        },
        {
            "content": "Loved it even though its considered on of the worst movies ever made this goes into my top ten.",
            "review_date": "2015-05-13",
            "source": "rt"
        },
        {
            "content": "The scale from good to bad isn't a straight line, it's a circle. When a film is so terrible that even 0% is too high a score then the scale comes full-circle and we have a masterpiece in terrible film-making and a cult classic for all the wrong reasons. Troll 2 is that kind of movie. It will make you piss your pants and spill your popcorn, while the movie spills its piss and popcorn too.",
            "review_date": "2015-04-23",
            "source": "rt"
        },
        {
            "content": "From producer Joe D'Amato, the man who brought you \"Porno Holocaust\" and \"The Erotic Nights of Aladdin\" brings you \"Troll 2.\" D'Amato actually billed himself as David Hills since he name has been forever associated with cheap and poorly made Italian productions. This film actually has no connection to the Charles Band film \"Troll\" and was originally written as titled \"Goblin.\" Trolls are never actually mentioned in the film. This story is about the small town of Nilbog where the inhabitants are all acting quite strange and doing their best to get visitors to it their strange green food and drinks, which then turn them into on of their zombified townsfolk who try to get others to join them in their green food eating ways. Supposedly the director and his co-screenwriter wife wrote this in reaction to too many of their friends becoming vegetarians. But this film is one that has now deservedly earned a cult following in a \"Plan 9 From Outer Space\" so-bad-it's-good kind of way. Many of the film's actors showed up for auditions to play extras but ended up being cast in lead roles. The director an his co-screenwriter wife did not speak English well and there screenplay was written in that same broken English, but to add to the film's ridiculousness, they forbade actors from altering their grammatically incorrect and nonsensical dialogue. It's an embarrassingly awful and ineptly made film to be sure, but that's wherein it's entertainment value lies.",
            "review_date": "2015-04-09",
            "source": "rt"
        },
        {
            "content": "The Best Worst Movie Ever Made",
            "review_date": "2015-03-25",
            "source": "rt"
        },
        {
            "content": "best worst movie ever.",
            "review_date": "2015-02-28",
            "source": "rt"
        },
        {
            "content": "Such a good bad movie! no more... no more popcorn",
            "review_date": "2015-02-19",
            "source": "rt"
        },
        {
            "content": "Poor dialogue, but funny as hell. Cult. Cult. Cult.",
            "review_date": "2015-02-16",
            "source": "rt"
        },
        {
            "content": "The best worst movie of all time. This walking disaster of a movie that's supposed to be a serious commentary to vegetarianism is so bad it's hysterical. Enjoy the hot mess!",
            "review_date": "2015-02-09",
            "source": "rt"
        },
        {
            "content": "e serve anche che commento?",
            "review_date": "2015-01-20",
            "source": "rt"
        },
        {
            "content": "As a perfect example of \"so bad it's good,\" this is an inadvertently hilarious trash gem that earned its reputation as the best worst movie ever made, with a terrible script full of plot holes the size of a goblin, ridiculously over-the-top performances and shocking continuity errors that should make you choke with laughter.",
            "review_date": "2014-12-24",
            "source": "rt"
        },
        {
            "content": "With the absolutely most horrifically-bad acting you can imagine, Troll 2 is perhaps one of the dumbest movies you'll ever see. The stupidity dances between hilarious and excruciating throughout the film but it's only a bit more of the former. But the best bits are well-worth the ride.",
            "review_date": "2014-12-05",
            "source": "rt"
        },
        {
            "content": "The absolute best movie ever made. There is no doubt that this movie is badly made, but there is also no doubt that it tells a story of the human condition better than any other movie you could imagine.",
            "review_date": "2014-11-24",
            "source": "rt"
        },
        {
            "content": "Almost everything in this film is unintentionally comical. 0/100",
            "review_date": "2014-11-14",
            "source": "rt"
        },
        {
            "content": "Sooo bad but so funny. Nothing makes any sense! The acting was so campy I loved it, super cheap, plus the effects were bad and great and cheezy, and the cinematography was awfully funny (or funnily awful). Crappy in all the right ways; very entertaining. 2/10 for competence, but 9/10 for fun!",
            "review_date": "2014-11-10",
            "source": "rt"
        },
        {
            "content": "brilliant! the movie is brilliant! :D",
            "review_date": "2014-11-01",
            "source": "rt"
        },
        {
            "content": "The worst movie ever? It isn't great, but the worst movie...far from! The acting is awful but in a funny way. The plot is random and weird but at the same time entertaining.\n\nWatch it if you like:\nThe Room",
            "review_date": "2014-10-29",
            "source": "rt"
        },
        {
            "content": "It's so bad, it's good. What's really funny about this movie is how it wouldn't have been the worst thing on today's SyFy if it had better acting and direction. Seriously though, it's so stupid.",
            "review_date": "2014-10-28",
            "source": "rt"
        },
        {
            "content": "For me, doesn't quite rank as high as the best bad movies, but is still... pretty bad. And good.",
            "review_date": "2014-10-27",
            "source": "rt"
        },
        {
            "content": "Astoundingly crap comedy horror with just one genuine laugh, though it does have a scarily good 80s style soundtrack!",
            "review_date": "2014-10-26",
            "source": "rt"
        },
        {
            "content": "It's as bad as it can get, but that's why it's actually so funny.",
            "review_date": "2014-10-06",
            "source": "rt"
        },
        {
            "content": "Comedy... Horror movie? Undecided so ill just leave this right here.",
            "review_date": "2014-09-15",
            "source": "rt"
        },
        {
            "content": "Terribly made, without a doubt, but it's bad in the fun kind of way",
            "review_date": "2014-09-10",
            "source": "rt"
        },
        {
            "content": "this movie is so bad it is awesome! need some good mindless fun, this is the movie for you.",
            "review_date": "2014-09-09",
            "source": "rt"
        },
        {
            "content": "93%\nTroll 2 lives up to its hype with enough incompetence to amp up a whole new level of garbage.",
            "review_date": "2014-09-09",
            "source": "rt"
        },
        {
            "content": "The worst movie ever made. By far. Why? I'll tell you why...\n\nThis pathetic excuse for a film begins with a fat old man named \"Grandpa Seth\" narrating a pointless story to his grandson Jonathan. According to \"legend\", some guy with a silly hat ran through the woods once, attempting to escape the clutches of some evil goblins who were undoubtedly attempting to catch and hit him with their fake plastic masks. The idiot guy with the hat eventually falls down and is picked up by a comically dorky woman who feeds him magical green porridge. This pastel green soup makes him sweat Cascade dishwashing detergent and turns him into \"half man, half plant\", which I like to call a \"mlant.\" He is then supposedly eaten by the goblins, but I'm not exactly sure how this happens because the prop guy didn't cut the holes for their mouths big enough to get anything larger than a Tic-Tac through. Maybe when \"Goblin Mask v2.0\" is created, they'll be able to physically put something in their tiny mouths other than the director's minuscule penis.\n\nThe back-story-story is then interrupted when Jonathan's mom walks into the room and Grandpa Seth instantly disappears. According to the movie, this is because Seth has been dead for half a year. Mom and dad begin to talk about how excited they are to go to the town of \"Nilbog\", where they're swapping houses with a farm family. \n\nYes, \"Nilbog\". The town is named NILBOG. Do you get it? Are you impressed with the extreme degree of cleverness and creativity the \"writers\" exhibited when brainstorming this plot in their respective jail cells? I won't even go into detail with how intensely stupid the idea of swapping houses with a random farming family in the woods is, but then again, this movie seems to have been filmed in some sort of alternate universe where aliens dress up and try to act like how they guess human beings would. Nobody in this film reacts in any explicable sense to the events that occur around them. It's almost as if they wrote down six basic human emotions on a piece of paper and rolled a die every scene to determine which one they would attempt to portray.\n\nAnyway, the family of Jonathan, Michael, Diana, and Holly heads out to the wonderful and wacky town of NILBOG (NILBOG!!!) and begins to get in an argument in their minivan on the way there. The daughter and father fight about her boyfriend, who the father believes is a \"rotten good-for-nothing\" just because the kid's really stupid and hangs out with his homosexual friends all day. To break up the tension and bickering, the mom steps in and requests Jonathan to \"sing that song I like so much.\" The song, \"Row, Row, Row Your Boat\" was obviously too technical and confusing for the mother to recall the name of, but that still doesn't quite explain why she liked it \"so much.\" I would guess it's because she's an idiot, but I've been wrong before.\n\nThe family finally pulls into NILBOG (haha, NILBOG!), a town full of farmers who participate in a constant foam hat conventions, and meets the antisocial weirdos who they're swapping houses with. In a terribly scary moment of foreshadowing, the little farmer boy tosses a baseball to Jonathan which reads \"Eat up before we eat you\". Ooh, scary! Jonathan's family enters the house and are overjoyed to find a table full of prop food which doesn't look even remotely like anything anybody reasonably intelligent would consume. There's green biscuits, pitchers full of bright red and green liquid, and corn on the cob with green paste smeared all over it. So, being the braindead morons they are, Michael, Diana, and Holly all immediately dig in and prepare to shovel the filth down their throats. Before they can cram a single moldy biscuit into their stomachs, Grandpa Seth appears in a mysterious and shocking way (he knocks at the window). He explains to Jonathan that he has to stop his family from eating any of the food because it will turn them into goblins, or even worse, legitimate actors. Jonathan gets Grandpa Seth to stop time for 30 seconds (I really can't explain how he does it, I guess it's a perk you get for being dead) and does the only rational thing he can do to stop them from eating the food;he pees all over it. I'm not kidding. Once time resumes again, Michael takes Jonathan to his room and gives him a stern lecture that contains the phrase \"you can't piss on hospitality\", which is one of those lessons that you just can't learn on the mean streets of Nilbog.\n\nHolly's boyfriend and his cretin pals show up in their mobile home and park it in the woods, undoubtedly so the rest of the residents of Nilbog won't be awakened by their lusty cries of ecstasy during the night. One of the friends named Arnold goes outside the camper to smoke, sees a pretty girl running through the woods, starts chasing her, and gets a spear thrown into him by some marauding goblins. Arnold and the girl decide the best place for them to hide from the goblins would a nearby ominous, gothic, scary house, so they go in and get molested by a Druid lady. The woman playing the Druid is one of the most embarrassing examples of overacting in the history of modern film. She stretches out every vowel to approximately four hours in length, wildly gesticulates as if she were petting electric dogs, and forces her eyes open to the point of looking as if dinner plates were lodged in her forehead. She offers her guests a couple mugs full of dry ice and lime Jello, which they drink. This causes the girl to turn into a lump of slime and Arnold to transform in a tree (a tree that sweats dishwashing detergent). Drew, another one of the fools in the trailer, decides to run to town and get some milk. Oh, the wild and crazy kids these days, what will they do next? On the way to the general store, Drew is given a ride by Sheriff Freak, the law authority of Nilbog. Sheriff Freak (that's really his name, I swear) gives the kid a green sandwich and he immediately eats. The kid is dropped off by the sheriff, buys some milk, and then runs into the Druid's house to hang out with his buddy Arnold, who is still a mlant. I think he ends up being killed or something, I don't remember. It's not very crucial to the plot, all the kids were just cannon fodder anyway.\n\nJonathan stumbles upon the evil goblin church, which is actually the director's unfurnished basement, and gets captured by them (the goblins, not the director). They try to make him eat evil Nilbog ice cream, but his dad shows up and scares them away by threatening to call their parents and tell them that their kids are dressing up in goblin costumes and making lame movies when they should be studying for school. Grandpa Seth, who took time out of his busy schedule of \"being dead\", shows up and hands Jonathan a Molotov cocktail so he can blow up the goblins, which surround his family and chase them into their house. Well, they don't really chase them, they just stand in place while the family runs away. The goblins surround the house (by standing in place) and throw bags of sandwiches onto the porch, which I assume is how goblins traditionally attack their enemies. There's a scene placed in the movie around this point which involves some kid and the Druid eating corn together (which explodes and turns into popcorn), but I'm not going to bring it up because even mentioning it makes my brain hemorrhage. Oh wait, too lateeeesahhf0940945y9h)$))\n\nEventually Jonathan and his family hold a seance to summon the spirit of dead ol' Grandpa Seth, and Jonathan mysteriously appears in the Druid's house. I don't know how, he just teleports there or something. He and Grandpa Seth attempt to kill the entire goblin race by touching the \"Stonehenge Magic Stone\" (I'm not making that name up), but it doesn't work. I though it might be more effective if they just pushed the damn foam rock over onto the Druid lady, but apparently that wasn't a valid option. The goblins storm into the house and make menacing gestures at the kid, but he repels them by taking a bite out of a bologna sandwich that he had in his backpack. Yes, the movie is that stupid. Soon the rest of Jonathan's family shows up, they all touch the Stonehenge Magic Stone of Magical Stonehenge Stone Magic and the goblins all explode and fall over railings. Everything goes back to normal, the family goes home, and the mom gets eaten by goblins (in order to leave the door open for \"Troll 3\", which will probably be about mutant giraffes or something).\n\nIn case you didn't notice, Troll 2 is a very, very, very bad movie. Is so damned bad that there isn't even a single fucking troll anywhere in the film. They manage to pack every bad and embarrassing \"sub b-movie\" cliché into one mindless piece of electronic urine. None of the characters exhibit anything that could even remotely be called \"human traits\", and the retards in goblin masks act more like people than the actual actors do. Move over, \"Feeders 2\", there's a new king in town.\n\n1/10",
            "review_date": "2014-08-29",
            "source": "rt"
        },
        {
            "content": "Horrifically, wtf bad, which is why it's so fun to watch. It doesn't make a bit of sense, the acting is appalling, and it's everything you could ask for in a terrible B movie.",
            "review_date": "2014-08-26",
            "source": "rt"
        },
        {
            "content": "It's so bad that it's.....bad.",
            "review_date": "2014-08-22",
            "source": "rt"
        },
        {
            "content": "If you thought Troll 1 was bad, this takes it to another level. Fookin' hilarious, with quite possibly the worst ending of all time.",
            "review_date": "2014-08-03",
            "source": "rt"
        },
        {
            "content": "\"OH MY GOOOOOOOODDDDDDDD!!!!!\". This movie is straight up awful, but just like the room, it is so bad it's good. The acting is one of the worst that I have ever seen and the way the movie shots is a bit off.",
            "review_date": "2014-07-31",
            "source": "rt"
        },
        {
            "content": "People consider this \"so bad, it was good.\"\n\nNo..... No.. It was so bad. Just leave it there.",
            "review_date": "2014-07-25",
            "source": "rt"
        },
        {
            "content": "The worst film put to screen. Period.",
            "review_date": "2014-07-13",
            "source": "rt"
        },
        {
            "content": "BEST MOVIE EVER!! NILBOG IS GOBLIN BACKWARDS!!!!!!!!",
            "review_date": "2014-07-02",
            "source": "rt"
        },
        {
            "content": "Created by an Italian women who wrote it out of anger for vegetarians and directed by her husband who could barley speak English, this movie is by far one of the worst movies ever but is hilarious because of it you have to watch it over and over. An American family goes on a trip to nilbog to their horror the residents turn out to be goblins. That eat people after they eat the food that turns them into plants. The movie takes many twists and turns such as paranormal intervention and teleportation it's over all disorienting. But well worth it!",
            "review_date": "2014-06-29",
            "source": "rt"
        },
        {
            "content": "A brief sampling of the script of this movie. \"This is MY House!\" (As his dad unbuckles his belt) \"What are you gonna do to me, daddy?\" \"Good night, dear.\" \"For the love of God don't let them eat.\" (After his girlfriend punches him in the groin) \"Are you nuts? You tryin' to turn me into a homo?\" \"Nilbog! It's goblin spelled backwards!\" And of course, \"OOOH MYYY GOOOOOOOOOO...\" \n\nAlthough a few of these lines don't seem to indicate the awfulness of the movie, once the tragically inexperienced cast gets their hands on the script, these seemingly normal lines are immortalized in American cinema history for all the wrong reasons. Don't get me wrong. I haven't laughed as hard as I did during Troll 2 in a very long time. But my laughter stemmed not from intentionally well delivered one-liners, witty dialogue, or hilarious and well thought-out situations. In fact, the funniest thing about this movie was how completely inept every single person involved in this movie really was at making movies.\n\nAlthough the buck stops at the film's director and his wife, the actors (if you could call them that) are what really punch home just how truly awful a movie \"Troll 2\" was and how truly awful movies can be. And I loved every second of it. Words cannot begin to describe how bad \"Troll 2\" is. It must be seen to be believed.",
            "review_date": "2014-06-17",
            "source": "rt"
        },
        {
            "content": "95%\nRight up there with classics like The Godfather...and The Room.",
            "review_date": "2014-06-15",
            "source": "rt"
        },
        {
            "content": "Troll 2 is hilarious.... But it sucks still ya know.",
            "review_date": "2014-06-14",
            "source": "rt"
        },
        {
            "content": "So-bad-it's-good film.\r\n\r\nGather round your friends, get some alcohol (or other substance) in, & revel in the idiocy that is Troll 2.\r\n\r\nI've read a few negative reviews from the critics, which had me laughing as I was made to remember how ludicrous & fucking bizarre every second of this movie is.\r\n\r\nImmensely enjoyable for those with a sense of humour.",
            "review_date": "2014-06-12",
            "source": "rt"
        },
        {
            "content": "A complete disaster from start to finish, it's delightfully awful.  I will never look at an ear of corn in the same way again...or green frosting...",
            "review_date": "2014-06-09",
            "source": "rt"
        },
        {
            "content": "i saw its and its sucks",
            "review_date": "2014-06-08",
            "source": "rt"
        },
        {
            "content": "Funny from start to finish!",
            "review_date": "2014-05-28",
            "source": "rt"
        },
        {
            "content": "Troll 2 is one of the most famous (or infamous) bad movies of all time, alongside stuff like Manos: The Hands of Fate, The Room, and Santa Claus Conquers the Martians. It's not a direct sequel to the film before it, but it has some very loose connections. It's certainly not the worst movie I've ever seen, nor is it, as it's referred to by its fans, the \"best worst movie\" out there, but I can see why people enjoy it so much. It's definitely worth repeat viewings and is an enjoyable bad movie. Not everything about it is terrible though. If anything, it's actually pretty well shot. That doesn't count for much when it comes to its content, but everything is in focus and is filmed well. That counts for me. I'd definitely recommend the movie for fans of movies that are so bad that they're good, and I'm sure many will fall in love with its awfulness as so many others already have.",
            "review_date": "2014-05-25",
            "source": "rt"
        },
        {
            "content": "Supposedly one of the worst movies ever and indeed, it is very, very bad. Try as you might, you can't find *one* redeeming quality.",
            "review_date": "2014-05-25",
            "source": "rt"
        },
        {
            "content": "OH MY GOOOOOOOOOOOOOOOOOOOOOOOD!!!!!!",
            "review_date": "2014-05-21",
            "source": "rt"
        },
        {
            "content": "Greatest sequel ever to be made. This film, if you will, somehow surpassed the insurmountable expectations that were tied to it, even though it's predecessor, Troll 1, became neck-deep in accolades.",
            "review_date": "2014-05-15",
            "source": "rt"
        },
        {
            "content": "The funniest movie ever made",
            "review_date": "2014-05-01",
            "source": "rt"
        },
        {
            "content": "one of the most ambitiously bad movies I've ever seen. set the standard by which all \"so bad it's good\" movies are judged. earns it's well deserved cult status.",
            "review_date": "2014-04-24",
            "source": "rt"
        },
        {
            "content": "So many unforgetable lines and scenes. Awful acting, poor screenplay, amateur directing, cheep production, a perfectly bad / weird movie and it's because of this Troll 2 is one of the best movies I ever saw.",
            "review_date": "2014-04-22",
            "source": "rt"
        },
        {
            "content": "Hilariously awful... the epitome of unintentional comedy.",
            "review_date": "2014-04-19",
            "source": "rt"
        },
        {
            "content": "Fuck Citizen Kane, this is the real cinematic classic of the 20th century.",
            "review_date": "2014-04-14",
            "source": "rt"
        },
        {
            "content": "You thought you'd be going to see an epic bad epitome of campiness featuring some rubber goblins.\nThe truth is; you saw a deeply disturbing metaphor for the futile attempts of several Teenagers of escaping the sexually repressive and violent society of their home and neighbourhood to reclaim their own body and therefore sensuality.\n\nJoshua, the about ten years old son of the Waits' family, frequently hallucinates about his dead grandfather, Seth, a wise and kind man, and therefore represents the typical aspects of the ideal Machiavellian patriarch. Joshua's father, on the other hand, is a classical example of a cinematic interpretation of the Freudian ?Primal Father? - elder of the so-called ?Primal Horde?, ?where all of the sons knew that they were equally persecuted by the primal father, and feared him equally? - and  it follows the tradition of famous examples like Shining's Jack Torret, or ?The Godfather? Don Corleone.\nHolly is, despite being only sixteen, is wildly eroticised and objectified by the camera's male gaze. \nShe would like to date a young boy from the neighbourhood, Elliot.\nIn a moment of female empowerment, she tries to seduce him and in consequence reclaim an autonomous state of sexuality, besides her father's means of control.\n\nThey rudely are interrupted by Elliot's friends, representing the homosexual tendencies of typical adolescent desires: but forced by a heterosexual matrix, the boys are only allowed to discover those sensual and emotional depth of their subconsciousness only thinly veiled by the excuse of boyish camaraderie, and only accompanied by a permanent reassurance about one's own heterosexuality ? they might cuddle half-naked in bed together, but they still talk about girls in mini skirts. \nHolly demands him to decide between her and his friends.\n\nThe father announces the next day, the family is going to have a vacation in the rural village of ?Nilgob?, much to his children's dismay, shortly followed after by Elliot and his friends in a caravan.\nSoon after arrival, the family realizes there might be something wrong with the inhabitant's of their idyllic vacation paradise-to-be. \nSoon after, the son once again hallucinates about his Grandfather, who orders Joshua to stop his family from eating the offered food: it is the first scene Joshua encounters the true face of Nilgob's population: ugly, grey-faced monsters living off of humans turned to plant slime.\nJoshua only sees one way to save his relatives from eating said green goo:\nhe urinates on the table.\nBy this phallic act he has fulfilled his grandfather's wish who here represents the absolute bourgeois sovereign,  to commit regicide by symbolically castrating the cruel ruler and establishing civil society.\n\nNear the town lives the mysterious Creedence Leonore Gielgud of Druid Origins, representing sinful, promiscuous female nature and thus a permanent thread to the fragile order of patriarchal reign of pure instrumental, male-connotated reason.\n\nTwo of the boys succumb her succubical suction: one of them is turned into a tree, she lovingly tends and caresses: the young man is forced to embrace effeminacy.\nSince nature in this movie is a symbol of femininity ? of course one might feel inclined to criticise the antiquated display of the female as uncontrolled, elemental, almost even anarchic, force and masculinity as reason, that has to overthrow and subdue nature, even if it's cruel and instrumental ? the Druid compels him to do a drag performance. She wants to make him realize that his idea of gender is mere a social construct that has to be reproduced by everyday actions to maintain the stable power of the heterosexist discourse. \n\nSince he refuses to become a tree willingly, this scene is easily read as a female-to-male rape scene, who are often parts of sexual fantasies experienced by submissive Oedipal characters.\n \nThe other boy is watching the telly, a highly sexualized music video, but the excitement on his face seems shallow ? like he's only watching the video because he is supposed to.\nIn the next scene, Creedence offers him a corn cob ? an obvious metaphor for the phallus.\nThis boy on the other hand embraces his homosexuality ? they both enthusiastically eat the corn cob, which strongly resembles oral sex performaned on a phallic object.\n\nDuring the movie, the family encounters and successfully fights the now goblin-turned villagers. But they only manage to do so with the help of Grandfather Seth, whose ?ghost? is getting stronger and stronger every time he appears.\n\nIn the final quest given by his mentor, Joshua faces both the Druid and his own awakening sexuality, as he enters what appears a giant, glowing vagina: he's re-entering his mother's womb, just to resurrect again now as a grown man.\nHe commands his family to touch the sacred Stonehenge Crystal, Creedence hides in her lair, and in this last act, the family, who, for once sticking together for the greater good, defeat the perilous element.\nJoshua proves himself as a greater, better patriarch than his tyrannous father, who stood helpless against the goblinish embodiment of the threat of castration.\n\nReturned home, everything seems peaceful and quiet, only Joshua isn't able to deal with the traumas witnessed ? it implies, the whole episode in the town of Nilgob was only a fantasy of him to deal with his own awakening sexuality, Elliot's friends nothing but a projection of his own, repressed homosexual desires.\nA fantasy to escape the cruel, abusive reality forced upon him by the Primal Father.\nFirst a strategy to overcome the terror Joshua has to face everyday, his daydreams have become more and more vivid and blur the thinning line between fantasy and reality.\nSince his daydreams are his way to develop his sexuality within a house, where it is controlled by his father, their increased frequency indicates that it has become an urge too strong to control: only the daydreams are left to explore his desires.\nAs we see in the scene in which the goblins return to the seemingly peaceful household and kill his family, ending up devouring Joshua's mother, the camera rests upon the last part of her body that has remained human: her snow-white, maternal breasts.\nOnce again, Freud can be applied here: his daydreams overcome his whole personality, the It overthrows the already broken home: his sexual urges become this forceful, he is n\nThe final cut shows Joshua's horrified face as the goblins turn towards him, leaving an interpretation about the end to the spectator.\n\nThis, as a clever device of postmodern film, that we as the spectators do have the power to write and end for this story ourselves, that we created as discourse,as we name it in a performative utterance as proclaimed by Judith Butler, that we, in conclusion, are nothing but discourse ourselves, written by the matrix of society.\n\nJoshuas daydreams display the prevailing of his unbridled sexuality. The only way his family can be viewed now through the eyes of the compulsive beast as effeminate green goo.\nThe goblins, his subconscious representation of this kind of nature, that only can be expressed as a violent one, finally may swallow Joshua himself.\n\nHe has destroyed his father in an act of feminizing and therefore, in this patriarchal society, destroying his father ? but thus, became in this ironic moment of dethronement, the bigger monster himself.\n\nSummary: ?Troll 2? is fucking deep.",
            "review_date": "2014-04-13",
            "source": "rt"
        },
        {
            "content": "A steaming pile of cow shit. Everybody should give this half a star because it deserves to be the worst movie ever made.",
            "review_date": "2014-04-11",
            "source": "rt"
        },
        {
            "content": "It's obviously godawful but godawful in the best way imaginable. It's just Troll 2, quite possibly the Citizen Kane of bad movies.",
            "review_date": "2014-04-10",
            "source": "rt"
        },
        {
            "content": "F-\nIf I hadn't had the misfortune (or fortune depending on how you see it) of seeing Birdemic I would say this is the worst movie I've ever seen... but it is hilarious.",
            "review_date": "2014-04-03",
            "source": "rt"
        },
        {
            "content": "This is suppose to be the best worst movie ever made and I can see why. It's terrible in every way. The acting is the worst I've ever seen, effects and make up are just laughable and the story makes no sense but through all of that I was entertained the whole way through just laughing at how bad something could be.",
            "review_date": "2014-03-23",
            "source": "rt"
        },
        {
            "content": "funniest movie I have ever seen. it is so bad that it makes it hilarious. script was written by nonenglish speaherrs so the dialogue was hilarious. just don't let your dead grandpa give your kid a molotov cocktail",
            "review_date": "2014-03-22",
            "source": "rt"
        },
        {
            "content": "There's a good and a bad thing about this one. First the bad thing: From a technical/artistic point of view this movie is a total pile of garbage. The good thing: You can laugh your ass off to it. It has to be the king of unintentionally funny movies.",
            "review_date": "2014-03-21",
            "source": "rt"
        },
        {
            "content": "It's so bad, it's good. Corn on the cob.",
            "review_date": "2014-03-05",
            "source": "rt"
        },
        {
            "content": "In honor of best/worst.",
            "review_date": "2014-02-18",
            "source": "rt"
        },
        {
            "content": "Every bit as peculiar and bad as I had been led to believe, and it's also the very best kind of bad movie: a movie that's trying to be good... and failing in spectacular fashion.  Objectively, there's so much that's gone wrong with this film that it's actually kind of hard to describe (hence the 1 and 1/2 star rating), but it sure does pack a lot of entertainment value into the badness.",
            "review_date": "2014-02-11",
            "source": "rt"
        },
        {
            "content": "A masterpiece of unbelievably bad film making. Endlessly entertaining.",
            "review_date": "2014-02-09",
            "source": "rt"
        },
        {
            "content": "I give this the lowest score I can, with all my heart. I love this so genuinely!",
            "review_date": "2014-02-07",
            "source": "rt"
        },
        {
            "content": "You either love this film or you hate it.",
            "review_date": "2014-02-01",
            "source": "rt"
        },
        {
            "content": "They're eating her. And then they're going to eat me. Oh my gooooooooooooooooooood",
            "review_date": "2014-01-27",
            "source": "rt"
        },
        {
            "content": "This is the type of film that, when you pick up the DVD case in the \"Just take it!\" section at your nearest rental store, you look it over and expect it to be ridiculous. Then you watch it and your expectations are exceeded by miles - no, light years - no, infinity. This film cements itself as one of the best-worst just in Joshua's decision to get his family to stop eating poisoned food by pissing all over it alone. In hindsight, that might've worked for me too when I was a kid back in Florida being \"forced\" to eat pumpkin pie for Thanksgiving. Plus, how often are you gonna get to see corn on the cob being popped into popcorn during a sex scene? I know. Tarantino who?\n\nFull review at http://silverscreenfanatic.com/2014/01/27/what-the-hell-were-they-thinking-4/",
            "review_date": "2014-01-27",
            "source": "rt"
        },
        {
            "content": "Ohhhh my gawwwwwwwwwwwwwwwwwwwwwwwwwwwd!",
            "review_date": "2014-01-07",
            "source": "rt"
        },
        {
            "content": "We loved watching this disaster because \"you can't piss on hospitality!\"",
            "review_date": "2014-01-03",
            "source": "rt"
        },
        {
            "content": "Film criticism should be thrown out the window when watching Troll 2. As a piece of art, it is a complete failure in every way. As an experience, it's about as good as it gets, mainly because of the extreme sincerity and complete lack of self-awareness in every shot. It's a strangely preachy, poorly acted, beautiful disaster.",
            "review_date": "2014-01-01",
            "source": "rt"
        },
        {
            "content": "Wasn't a fan of the first so I was a little hesitant to wath this one, but I gave it a chance anyways. This movie is bad, really really bad. The direction isn't good. The acting is bad across the board. The dialogue is cringe worthy. There are scenes that make no sense (The popcorn lovemaking one, namely). It feels like vegetarian propaganda against the meat industry. Yet I enjoyed this. Sure, it is terribly done, but this is a case where everything comes together and this movie is actually somewhat enjoyable despite being horribly made. This isn't high entertainment, don't get me wrong, but shut your brain off and come to have an hour or so of fun and this movie will deliver.",
            "review_date": "2014-01-01",
            "source": "rt"
        },
        {
            "content": "\"Troll 2\" is regarded by many as one of the worst films ever made, and it is. But the film has become a cult classic and has built up one hell of a legacy. I have to admit, up until about 30 minutes in I was going to give this movie 4 stars because I was really getting a kick out of watching such an atrocity. But that eventually wore off and it just became annoying. So yes, \"Troll 2\" is, without a doubt, one of the worst films ever made and deserves nothing more than 1/2 a star; however, I still received a little bit of enjoyment from laughing at this abomination, so I might have to side with the cult audience on this one, at least a little bit. If you get a chance to see \"Troll 2\", take it, because it is a movie you'll never forget.",
            "review_date": "2013-12-27",
            "source": "rt"
        },
        {
            "content": "So bad it's almost good. A sequel that has nothing to do with trolls, some of the worst acting ever caught on film, plot holes bigger then the ozone, dialogue and actions that just don't make sense at all. Was hard to get through and shouldn't be taken serious at all, probably would have been funnier watching with a group making jokes.",
            "review_date": "2013-12-19",
            "source": "rt"
        },
        {
            "content": "I'm torn on whether to rate this badly for how technically awful it is at what it's trying to be, or rate it well for how amazing it is at being comedically bad. Truly the best-worst movie of all time, hands down.",
            "review_date": "2013-12-17",
            "source": "rt"
        },
        {
            "content": "I've heard this movie is the best worst movie. That may be true. It has so many laughably bad moments. Hilariously terrible dialog. Hilariously terrible story. Bad monster masks, one of which I can't help but laugh at. Bad effects. Bad acting. Some really silly scenes. And this movie has nothing to do with Troll 1. Feel free to watch one without the other. In fact, despite the name, this movie doesn't even mention trolls once; it's all about goblins. I thought the dad might have been the kid from Troll 1 grown up, since they look so similar, but he wasn't. There's nothing wrong with the camera work, and the music is odd but not annoying, which helps keep the movie fun. Even the VHS box cover makes no sense; it looks like it has a werewolf on it. And the moral of the story is that vegetarians are monsters.",
            "review_date": "2013-12-17",
            "source": "rt"
        },
        {
            "content": "If you watch it Mr science theater style it can be enjoyable. But other wise that is some of the worst acting I have ever seen, not to mention its horrid plot. There is so much wrong with this movie. So much.",
            "review_date": "2013-12-15",
            "source": "rt"
        },
        {
            "content": "Playing out like a retarded Tolkien addict's acid-induced wetdream, Claudio Fragasso's criminally bad fantasy flick is a testament to just how wrong filmmaking can actually go. It's a little like The Rocky Horror Picture Show, with the music and comedy replaced by a sincere undertone of family bonding, in a dreadfully acted PG horror about vegetarian goblins on a mission to turn humans into plants in order to feed the fellow residents of Nilbog (Yes, that is indeed \"goblin\" spelt backwards).\nSurprisingly, the whole thing is actually an absolute blast and whatever your thoughts, there's no denying that Troll 2 is a truly magical, one of a kind piece of entertainment, not to mention one of the most unintentionally funny films ever made. You have to see it to believe it.",
            "review_date": "2013-12-06",
            "source": "rt"
        },
        {
            "content": "Really ridiculous. A family travels to the backwoods for a vacation only to learn from the dead grandpa that it is a goblin-infested area. Goblins like to eat people, but only after turning them into plant-people hybrids first. Goblins also disguise themselves as people so they can go about their daily business which includes belonging to a cult. Over-the-top acting and unnatural dialogue provide a lot of unintentional comedy.",
            "review_date": "2013-12-03",
            "source": "rt"
        },
        {
            "content": "Unwatchable. Steer far clear from this disaster.",
            "review_date": "2013-12-03",
            "source": "rt"
        },
        {
            "content": "The quintessential hilariously bad movie. It's bad, very bad, but so so good. Honestly one of my favorite movies.",
            "review_date": "2013-12-02",
            "source": "rt"
        },
        {
            "content": "(Upcoming Review)  Rating:  2.1/10  Overview:  Although worse than the original, i found this one more memorable and yet so terrible I couldn't help but laugh more than scream.",
            "review_date": "2013-11-24",
            "source": "rt"
        },
        {
            "content": "It is difficult to estimate the importance of Troll 2 in movie history....for several reasons in fact. First and foremost it foretold the vegetarian and vegan revolution that would eventually sweep the nation. It was a warning we now wish we had heeded. I fear for my children being attacked by little anti-meat goblins and keep bologna readily available in my home. And who could have predicted the rise of \"The Devil's Drink\".....coffee. The residents of Nilbog wouldn't have imagined how addicted to Starbucks we've become.\nSecondly, the personality of George Hardy was introduced to the world. This important event in cinema lore has to be witnessed. I can't explain it in a movie review. Suffice it to say his scene carrying little Joshua through the house rhapsodizing the merits of hospitality has to be viewed over and over. It's that good. \nAlso the brilliance of Troll 2, and this can't be overstated, is the irrelevance of a film's title. I finally understand that you can call a movie whatever you want and still create a masterpiece. I am thinking of making a movie about cyborgs taking over a tractor pull and monster truck rally before infiltrating Washington politics and calling it The Many Loves Of Allison. Or Possibly a love story at a nursing home where aliens leave pods that cause the elderly to become young again and call it DIABEETUS 3. The Title doesn't matter. It's the story that will draw in an audience. But whatever I or anyone else creates in the world of cinema it probably won't achieve the mind-blowing brilliance of Troll 2.",
            "review_date": "2013-11-23",
            "source": "rt"
        },
        {
            "content": "You can't piss on hospitality, I won't allow it!",
            "review_date": "2013-11-22",
            "source": "rt"
        },
        {
            "content": "So bad it's enjoyable. Not as awful/awesome as The Room mind, but I still had fun with the ridiculousness of this film more than Man of Steel.",
            "review_date": "2013-11-17",
            "source": "rt"
        },
        {
            "content": "Quite truly the worst film ever made, EVERYTHING is bad, the lighting, art direction, acting, cinematography etc. however it epitomizes the \"so bad it's good\" genre. It's absolutely hilarious - one couldn't make a film this funny and this bad on purpose.",
            "review_date": "2013-11-12",
            "source": "rt"
        },
        {
            "content": "We watched this because Hank had watched  the documentary Best Worst Movie, but I had actually seen the last five minutes many years ago. The acting is laughable, and it's thanks in no small part to the terrible storyline. In what universe do people happily accept food that is stained with an unnatural shade of green?",
            "review_date": "2013-11-10",
            "source": "rt"
        },
        {
            "content": "a stunning achievement. the aptly named, troll 2, is the second installment in the troll series and somehow improves upon the Oscar winning troll.0. troll 2 is this generations troll 1.",
            "review_date": "2013-11-01",
            "source": "rt"
        },
        {
            "content": "Great background noise while studying. Who really cares what is going on. when ever you look up from your study you will smile.",
            "review_date": "2013-10-25",
            "source": "rt"
        },
        {
            "content": "Best Movie EVAR\nSee this. Now. \nErmahgerd. \nDat acting. \nDose special effects. \nDem goblins. \nI want to live in Nilbog.",
            "review_date": "2013-10-24",
            "source": "rt"
        },
        {
            "content": "Crappy and funny at the same time, scenes like the pop corn sex are hardly forgettable. Or the clearly fake goblin masks. Or the nonsense dialogues and one liners. Or the average plot and the bad acting...If you loved this movie I recommend the documentary, kinda sad but actually cool.",
            "review_date": "2013-10-22",
            "source": "rt"
        },
        {
            "content": "\"They're eating her! Then they're going to eat me! Oh my God!\"",
            "review_date": "2013-10-22",
            "source": "rt"
        },
        {
            "content": "There are bad movies...then there are BAD movies.\n\nI can see why the ratings here would be bad. This is a BAD movie, but its so BAD its like a modern art masterpiece. Some people like me believe its a work of art but to most people its garbage.",
            "review_date": "2013-10-21",
            "source": "rt"
        },
        {
            "content": "OH MY GOOOOOOOOOOOOOOOOOOOOODDDDD!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2013-10-14",
            "source": "rt"
        },
        {
            "content": "Gloriously, fantastically, incredibly entertainingly bad.",
            "review_date": "2013-10-12",
            "source": "rt"
        },
        {
            "content": "Give it a half star rating but absolutely had a blast watching this.   Not sure how you rate a so bad its good movie but this is a really fun film.   The Best Worst Movie documentary is also a must watch.",
            "review_date": "2013-10-11",
            "source": "rt"
        },
        {
            "content": "Ah, Troll 2. Arguably the worst horror movie ever made, and in-arguably one of the worst movies of all time. The story is convoluted in the sense that the filmmakers had no idea what to do with the story. The dialogue is anus in every sense of the word. Seriously, not since The Room have I heard such anus-y dialogue in a film. Not to mention the characters are all fucked up. The Mom tells him in the beginning of the film that the kid needs to \"banish\" the dead grandpa from his mind. What a bitch. The father is a closeted homosexual who gets great lines like, \"You can't piss on hospitality!\". In all fairness, the father seems like the only guy trying to act, but that still doesn't make it good. The sister sounds like she's reading a play, and the main kid is about as awful as every other child actor. Let's talk about the scares in this so-called horror film... there are none. All of the attempts to frighten the audience are absolutely hilarious and poorly done. Not to mention tons of throwaway characters that are introduced purely so they can throw in some goblins for a few minutes. Man, this movie is bad. Like REALLY bad. \nOverall: Barely qualifies as a real film and is filled with awful dialogue, acting, writing, directing, EVERYTHING about this movie sucks. It's entertaining to watch and make fun of though. \nFinal Score: 0/10",
            "review_date": "2013-10-07",
            "source": "rt"
        },
        {
            "content": "Troll 2 is terrible but it so terrible that manages to be incredibly entertaining. Arguing over which bad movie is worse than another is like arguing bout which pile of dog crap smells worse. This movie is ridiculous and I wish I could go back to see the actors reading the script for the first time.",
            "review_date": "2013-09-16",
            "source": "rt"
        },
        {
            "content": "Happy accident.  So this is about a family that goes on a vacation for the month to Nilbog, participating in some household exchange program (...?), only to find all of the inhabitants of the town are all goblins in disguise, trying to trick them into eating vegetables so as to turn them into half-plants in order to eat them.  I finally took the time to watch one of the most infamously bad movies ever made, and let me tell you, I had a great time.  Don't be put off with how I am rating it, as I am grading it purely from a filmmaking standpoint; it is unintentionally hilarious to the core.  The thing about making a good bad movie is that you can't set out to make a bad movie; if you wink too hard at your audience, the joke ceases to be funny, and then you end up with something like Machete.  You have to have a madman sitting in the director's chair and let it happen naturally, and that's how you wind up with something like Troll 2 or The Room.  Everything about this is fun if you watch it in the right atmosphere, from the clunky exposition to the wooden performances, from the laugh-worthy troll masks and make-up to the drunkenly penned dialogue, there is nothing here that doesn't fail hard.  This is the type of movie that the more people you watch it with, the better, and it ends up being a create-your-own MST3K.",
            "review_date": "2013-09-15",
            "source": "rt"
        },
        {
            "content": "I was finally brave enough to sit through this train-wreck, and it's every bit as bad as it's reputation preceded. The acting is non-existant, the dialogue completely awkward, the story doesn't make sense, and the title has nothing to do with the film. I can't hate on it too bad, because I can't believe this director was trying to make a good film. It is definitely so bad it's almost good, and there's just way too many awfully bad scenes that make it slightly entertaining. OH MY GODDDDD",
            "review_date": "2013-09-11",
            "source": "rt"
        },
        {
            "content": "Full revised review coming soon",
            "review_date": "2013-09-04",
            "source": "rt"
        },
        {
            "content": "the worst and the best movie ever made.",
            "review_date": "2013-09-04",
            "source": "rt"
        },
        {
            "content": "Believe the hype. It is probably the worst movie of all time, and definitely the worst sequel of all time.",
            "review_date": "2013-09-02",
            "source": "rt"
        },
        {
            "content": "Were they serious?  I mean really?  And what the hell was up with the corn scene?",
            "review_date": "2013-09-01",
            "source": "rt"
        },
        {
            "content": "One of the worst and most misguided films ever made, and, although it is so awful that it's funny, I cannot actually review it as being a good movie. For a bad movie to actually be good, it needs self-awareness, which Troll 2 does not have. The writers/director of the movie, namely Fragasso, who is a complete clown, aren't even aware of how terrible the film is. Any entertainment value it might have is unintentional.",
            "review_date": "2013-08-31",
            "source": "rt"
        },
        {
            "content": "Watching a film because it is \"so bad, it's good\" is not somthing intend to do again in a hurry. This is ridiculous, cringeworthy, and only worth watching as an example of how not to make a film. It saddens me that so much money and effort went in to producing such a pointless result, someone at MGM should have been sacked for this, the so-called actors probably didn't work again and, aparently, the director doesn't understand why people laugh at him at conventions; idiot.",
            "review_date": "2013-08-31",
            "source": "rt"
        },
        {
            "content": "With the language barrier between the cast and crew, special effects that would make Ray Harryhausen roll in his grave, and a cast that thought they were auditioning to be extras, Troll 2 is a hilarious, so-bad-it's-good midnighter",
            "review_date": "2013-08-28",
            "source": "rt"
        },
        {
            "content": "an unforgettable midnight movie with strange acting and direction, clumsy writing and some of the most realistic looking trolls ever put on film.",
            "review_date": "2013-08-27",
            "source": "rt"
        },
        {
            "content": "This movie isn't so bad it's good, it's so bad it's horrible. First of all there are no trolls in this movie, only goblins. The special effects are horrendous, only one of the goblin's mouths move and none of them blink. It has acting that would be considered dreadful even in a porno. But the worst part off all is the stupid-jumbled-nonsensical plot. This movie should be avoided at all costs.",
            "review_date": "2013-08-12",
            "source": "rt"
        },
        {
            "content": "the documentary will tell you how bad it is",
            "review_date": "2013-08-10",
            "source": "rt"
        },
        {
            "content": "Oh. My. God! \"Troll 2\" is the title but you won't even see a single troll in this movie, but what you will experience is some abnormal filmmaking, at its best, where nothing is done right. From the smallest placement of the camera to the most stage-played performances known to mankind. It is so bad that it truly is a must see, and for crying out loud it is a joy to see!",
            "review_date": "2013-08-05",
            "source": "rt"
        },
        {
            "content": "a sequel to a terrible \"horror\" movie with bad acting a horrible plot and need I talk about the niblogs or the random dead grandfather. This is a good movie to roast and that is honestly all that this movie has.",
            "review_date": "2013-08-03",
            "source": "rt"
        },
        {
            "content": "I watched this film because I wanted to see for myself why it had been branded the worst movie ever made, and I can see why. The acting is horrendously over the top or unconvincing by many of the characters, which is fine when in a pantomime, but not in a 'horror' film. I didn't see the point in Elliot's friends, they just disappeared with no proper explanation, and that scene in the mobile home in which they're sucking on a corn on the cob had to be one of the most ridiculous and disturbing things I have ever seen. Troll 2 is consistently pointless and bizarre, with a somewhat incoherent plotline, clunky acting and dialogue, and a rubbish villain. It's not even bad enough to be funny, it's just complete trash.",
            "review_date": "2013-07-27",
            "source": "rt"
        },
        {
            "content": "About 4.7 times better than schindlers list! Everything in this world has to do something with troll 2! If you don't sit through this movie then you have not lived because TROLL 2 is the best film in the last 47 years! I watch it every single day and it's like the PULP FICTION of horror movies!",
            "review_date": "2013-07-27",
            "source": "rt"
        },
        {
            "content": "Best worst movie ever made!",
            "review_date": "2013-07-25",
            "source": "rt"
        },
        {
            "content": "Rivaling Tommy Wiseau's \"The Room\" for the best unintentional comedy ever comes Troll 2, a horrendously inept trainwreck of a movie that is as fascinating as it is bad. There's really not much that I can say that hasn't been said already, but here's a start:\n\nThe acting isn't nearly as consistently bad as The Room's, but certain key moments stand out when they become a spectacle of hilarity (see: \"They're eating her...and now they're going to eat me! OH MY GOOOOOOOOOD!\"). The storytelling is tremendously weak, and showcases tremendously obvious foreshadowing that any sane person could see. The writing is just plain awful, featuring lines such as \"Nilgob! It's goblin spelled backwards!\" and the immortal \"You can't piss on hospitality!\" And the plot? Oh yeah, don't even get me started. This is a movie about goblins (despite being called Troll 2) that feed people food that makes them sweat/bleed chlorophyll and turns them into half-plant, half-human hybrids, \"the goblins' favorite food\". Yeah. Not even joking. \n\nWhat does elevate this movie to \"so-bad-it's-good\" status are any of the scenes that involve Grandpa Seth or the dad, played by Robery Ormsby and George Hardy, respectively. It's never really explained if Grandpa Seth is a figment of the kids imagination or not, and that just adds to the comedic factor in the movie. Also noteworthy is the horrifyingly creepy shopkeeper, who, if you've watched the documentary based on this film, \"Best Worst Movie\", was actually in a mental institution at the time of filming. Explains quite a bit.\n\nIf there's one person to blame for the astoundingly bad quality of this film, it's Italian director Claudio Fragrasso. If you look up some of the backstory to this film, you'll learn that he thought he knew more about American teenagers than the actual cast and crew, and also thought that he was pretty much the best director of all time. It's pretty clear that he had no clue what he was doing or what constitutes a good movie. \n\nThough Troll 2 isn't nearly as hilariously bad as other unintentional comedies (see: The Room), you can find a lot to have fun with in this movie, even if sometimes it is just boring. I personally didn't think that this film was as notoriously bad as its reputation suggests, but there's still a lot to enjoy when watching Troll 2. \n\n\"They're eating her! Then they're going to eat me! Oh my gaaaaaaaawwwd!\"",
            "review_date": "2013-07-19",
            "source": "rt"
        },
        {
            "content": "They don't call this \"The Best Worst Movie\" for nothing. You MUST see this movie to know just how BAD filmmaking can be! Though the production value is ridiculously horrible, this pile of crap is the most entertaining crap you will probably (and hopefully) ever find. The most unintentional hilarity packed into 90 minutes! I've yet to meet someone who's seen it who does not share in the universal love-hate relationship with it.",
            "review_date": "2013-07-17",
            "source": "rt"
        },
        {
            "content": "There's only one reason Troll 2 stands out in the vast sea of bad movies I've seen: it was never meant to be bad at all. Sure, it was destined for cinema hell from the start. Sure, the cast had no experience. Sure, the budget could, at best, buy me a coffee table from Ikea. But despite all that, you get a sense watching this movie that everyone involved really, really wanted to make a good movie. I'm not saying that Troll 2 is worth seeing. But I give it an E for effort.",
            "review_date": "2013-07-15",
            "source": "rt"
        },
        {
            "content": "So bad it's almost impossible to not enjoy.",
            "review_date": "2013-07-01",
            "source": "rt"
        },
        {
            "content": "I saw the end of this movie when i was about 5, and it scared me.  How honored i am to be one of the only people ever to think this movie was harcore.",
            "review_date": "2013-06-28",
            "source": "rt"
        },
        {
            "content": "I love his reaction when the girl got eaten which made it fantastic",
            "review_date": "2013-06-24",
            "source": "rt"
        },
        {
            "content": "!!!parc dnoyeb s'eivom sihT (NILBOG)",
            "review_date": "2013-06-23",
            "source": "rt"
        },
        {
            "content": "I'm happy to say that this is the worst movie I've ever seen.",
            "review_date": "2013-06-23",
            "source": "rt"
        },
        {
            "content": "They made a documentary about this movie that's just awesome.  This movie is so bad it's great.  The acting is horrible and the story...lmao...the worst!  But the movie definitely has it's charm and is a great movie to watch and just laugh at.  NILBOG IS GOBLIN SPELLED BACKWARDS!",
            "review_date": "2013-06-22",
            "source": "rt"
        },
        {
            "content": "GRANDPA, GRANDPA SETH",
            "review_date": "2013-06-22",
            "source": "rt"
        },
        {
            "content": "A movie so bad that it actually comes off as entertaining. Is it a must watch? Hell yes! If you watch it for the laughs, you won't regret it.",
            "review_date": "2013-06-04",
            "source": "rt"
        },
        {
            "content": "Genious. This right here is pure entertainment.",
            "review_date": "2013-05-26",
            "source": "rt"
        },
        {
            "content": "Lives up to its reputation.  It really IS that bad!",
            "review_date": "2013-05-23",
            "source": "rt"
        },
        {
            "content": "Absolutely terrible.",
            "review_date": "2013-05-21",
            "source": "rt"
        },
        {
            "content": "One of the most entertaining bad films out there. I'm having difficulty thinking of a scene that stretches on too long without being somehow unintentionally funny. Love to watch this with a friend.",
            "review_date": "2013-04-24",
            "source": "rt"
        },
        {
            "content": "Notoriously known as the worst movie ever, it would be difficult to disagree with anyone labelling it just that. It displays every kind of bad you can think of. Clearly made on a budget of about $10, it's so hideously, atrociously bad you have to watch it with your mouth agape struggling not to laugh, from the shoddy performances to the pathetic special effects, this movie leaves no stone of badness unturned.\nThe story (or lack of) follows a family of bad, bad actors as they vacation in the small town of Nilbog (Goblin spelt backwards. Yes! Seriously!!) where the Goblins, disguised as townsfolk, want to turn people into plants so they can eat them (the Goblins are Veggies. Yes! Seriously!!)\nFor a movie titled \"Troll 2\", it does seem kind of ironic that not a single troll features in the running time. The original Troll wasn't even that big a hit! It was a lukewarm horror flick which just happened to have a character called Harry Potter in it!\nThis movie has gathered a cult following, simply down to how awful it is, but I could never recommend anyone to watch it, it truly is the Holy Grail of crap movies.",
            "review_date": "2013-04-24",
            "source": "rt"
        },
        {
            "content": "The best part was when the little kid pisses on the food and his dad yells at him for it. It is so terrible you just can't stop laughing.",
            "review_date": "2013-04-19",
            "source": "rt"
        },
        {
            "content": "This movie changed my life. It's the ultimate best worst movie.",
            "review_date": "2013-04-08",
            "source": "rt"
        },
        {
            "content": "Troll 2 owes those two stars to its awful acting, horrible script and inept direction that turn it into a so-bad-it's-good film, that manages to keep you entertained and waiting to repeat the experience.",
            "review_date": "2013-04-06",
            "source": "rt"
        },
        {
            "content": "It is the best worst movie I have ever seen. EVER.",
            "review_date": "2013-04-06",
            "source": "rt"
        },
        {
            "content": "Best worst movie ever made! :D",
            "review_date": "2013-03-30",
            "source": "rt"
        },
        {
            "content": "So bad that it's hilarious.",
            "review_date": "2013-03-30",
            "source": "rt"
        },
        {
            "content": "So bad it's fucking awesome.",
            "review_date": "2013-03-22",
            "source": "rt"
        },
        {
            "content": "One of the worst of the worst, but is still a really good guilty pleasure movie.",
            "review_date": "2013-03-21",
            "source": "rt"
        },
        {
            "content": "Near the beginning the movie was enjoyably bad. But when that witch lady came in her acting was painfully bad. I watched this for Saint Patricks Day hoping I could get some good laughs, but it was just a bad movie.",
            "review_date": "2013-03-20",
            "source": "rt"
        },
        {
            "content": "If you list the movie under the comedy genre, its suddenly a five star piece. I'll never look at popcorn the same way again.",
            "review_date": "2013-03-19",
            "source": "rt"
        },
        {
            "content": "Holy shit, this is one of the worst/best beastie movies ever! The director the actors all worked for crack! Crazy ass shit here, highly recomended!",
            "review_date": "2013-03-13",
            "source": "rt"
        },
        {
            "content": "It's hard to fathom the amazingness of this movie, it compels, it takes breath, it truly speaks to your soul. There's not a day that goes by without me thinking positively of this movie, beautiful acting, amazing writing.",
            "review_date": "2013-03-09",
            "source": "rt"
        },
        {
            "content": "\"Troll 2\" is as treacherous and repulsive a film as I've ever seen. Judging by the actors' crude performances and the incredible lack of technical skill, it doesn't seem like anyone involved in the production knew what they were doing or what was going on. The first explanation that comes to mind is that all of the badness is intentional, but even I don't think that a purposely awful film would come close to the ineptitude shown on display here. It's ugly, poorly-strung together, not scary in the least bit and altogether a real horrible thing. The only half-redeeming quality about it is that its own awfulness may cause you to laugh, but don't count on it.",
            "review_date": "2013-03-09",
            "source": "rt"
        },
        {
            "content": "What's remarkable about this film  is how refined its awfulness is,  as if the basics of film acting, logic & coherence were like  rocket science to the filmmakers.",
            "review_date": "2013-03-04",
            "source": "rt"
        },
        {
            "content": "I can't believe that this movie was ever made. Anyone that was even associated with this film should be ashamed that they were a part of this monstrosity. One of the worst movies ever made.",
            "review_date": "2013-03-02",
            "source": "rt"
        },
        {
            "content": "It has to be seen to be believed. The acting is absolutely atrocious. There are so many things wrong with this movie that it would be pointless to name them all. I must say I enjoyed the movie for it being so bad and it was fun to watch for all the wrong reasons.",
            "review_date": "2013-02-28",
            "source": "rt"
        },
        {
            "content": "re review: the premise of troll 2 is so ridiculous and over-the-top that you can't not enjoy it. but seriously why would you hire a dentist to play one of the main characters?",
            "review_date": "2013-02-27",
            "source": "rt"
        },
        {
            "content": "Very good movie. Fantastic plotline. Great acting. Many people didn't like this movie because of their simple-mindiddness. So many metaphors made this movie a masterpiece. Claudio Fragasso is an artist in his prime. George Hardy and Michael Stephenson give heartfelt beautiful performances. Probably my favorite movie of all time",
            "review_date": "2013-02-23",
            "source": "rt"
        },
        {
            "content": "Close to one of the worst movies ever, but so hilariously bad that it can be a riot to watch with friends. If you have an evening to kill and have a fondness for bad movies, this movie's pretty great for that (thus my average rating). That said, the movie itself is terrible.",
            "review_date": "2013-02-21",
            "source": "rt"
        },
        {
            "content": "Troll 2 is famously the worst movie ever made in the history of film, and for a good reason. This movie is just utter shit. \"They're eating her... and then they're going to eat meeeee!!!\" Rotten Tomatoes calls this a horror/comedy, but I'm not sure that was the intention. As mind-numbing as it may seem, I think the director actually intended to make a scary and good movie.",
            "review_date": "2013-02-19",
            "source": "rt"
        },
        {
            "content": "Troll 2 serves as the litmus test for \"terrible movies\".",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "Though 'Troll 2' is mostly evidenced for is crisp cinematics, director Claudio Ragu's real test is an allegory for the pervasivity of pro-vegan sentimentalism in today's culture.",
            "review_date": "2013-02-16",
            "source": "rt"
        }
    ]
}