{
    "rating": 6.1,
    "release_date": "2019-10-25",
    "num_reviews": 85,
    "genres": [
        "Hindi"
    ],
    "summary": "Three pairs of reincarnated lovers reunite in the present day -- but the men wind up falling for the wrong women.",
    "reviews": [
        {
            "content": "Only worth the watch if you want to see the fresh faces and a very different storyline, but the end result is still pretty disappointing.",
            "review_date": "2022-06-10",
            "source": "rt"
        },
        {
            "content": "A film that's very badly made. It's vulgur at times and absolutely illogical and formulaic but for me it works as a guilty pleasure so I can watch it multiple times and laugh at its absurdity while criticizing it as well.",
            "review_date": "2022-02-09",
            "source": "rt"
        },
        {
            "content": "It was funny and so amazing",
            "review_date": "2021-08-15",
            "source": "rt"
        },
        {
            "content": "It's an absolute pathetic film , just a time waste. I feel like why did I watch this rubbish. Is movie ko na apni gaand main daal lo (take this up you ass).It's so bad.",
            "review_date": "2021-03-19",
            "source": "rt"
        },
        {
            "content": "'Hkusefull 4' is going to be a bad comedy of errors and we just knew that. But this is another level of shit. It's place is confirmed in the list of worst Hindi films of 2019 and also the decade, but the performances and the blatant women-selling this film does needs a slap- a hard, tight slap. The manipulative emotional chord never lands in providing for a forgettable laugh- or two, but other than Akshay Kumar's below-average screen presence, nothing can come to salvage this sloppy film that trips over the first second. No reason for the idea, forget the fourth film. You don't have to suffer this one.",
            "review_date": "2020-02-15",
            "source": "rt"
        },
        {
            "content": "It is the most disgusting disgrace movie i have ever seen",
            "review_date": "2020-02-02",
            "source": "rt"
        },
        {
            "content": "In the name of comedy, akshay kumar is trying to sell his third class performance, Wast of time",
            "review_date": "2020-01-17",
            "source": "rt"
        },
        {
            "content": "I asw the movie and the movie is awesome",
            "review_date": "2020-01-10",
            "source": "rt"
        },
        {
            "content": "This movie provides a lot of humor and an exceptional story line. It doesn't deliver much entertainment than it's predecessors but will still make you feel like your money was worth it.",
            "review_date": "2020-01-03",
            "source": "rt"
        },
        {
            "content": "Bakwaas movie of 2019",
            "review_date": "2019-12-29",
            "source": "rt"
        },
        {
            "content": "This is a meme movie that is just meant for passing time, and that is precisely what it is good at. The CGI is pretty bad, the acting is bad, the jokes are bad (but sometimes funny) and this isn't even the best Housefull movie, but it's still overall kinda funny.",
            "review_date": "2019-12-26",
            "source": "rt"
        },
        {
            "content": "Love the bahubali reference\n.",
            "review_date": "2019-12-22",
            "source": "rt"
        },
        {
            "content": "This movie is handbook to suck a movie making.",
            "review_date": "2019-12-15",
            "source": "rt"
        },
        {
            "content": "Nice movie \nrecommended",
            "review_date": "2019-12-05",
            "source": "rt"
        },
        {
            "content": "comaedy movie that,s",
            "review_date": "2019-12-01",
            "source": "rt"
        },
        {
            "content": "It was real fun watching this movie! I really liked the background music. This movie is a must watch!",
            "review_date": "2019-11-24",
            "source": "rt"
        },
        {
            "content": "Funny hilarious movie but taking it to extreme making it boring sometimes",
            "review_date": "2019-11-09",
            "source": "rt"
        },
        {
            "content": "Hayreee, Ghar jao or chai banao, lassi bnao pr aisi kachra movie mat bnao yr please.",
            "review_date": "2019-11-09",
            "source": "rt"
        },
        {
            "content": "Must watchable movie of 2019",
            "review_date": "2019-11-08",
            "source": "rt"
        },
        {
            "content": "One of the worst movie of 2019",
            "review_date": "2019-11-08",
            "source": "rt"
        },
        {
            "content": "Amazing full of laughter",
            "review_date": "2019-11-06",
            "source": "rt"
        },
        {
            "content": "Utter garbage. Went off to watch something else after 30 minutes in.",
            "review_date": "2019-11-05",
            "source": "rt"
        },
        {
            "content": "What a wastage of resources! Piece of crap",
            "review_date": "2019-11-04",
            "source": "rt"
        },
        {
            "content": "Worst movie to watch ever",
            "review_date": "2019-11-04",
            "source": "rt"
        },
        {
            "content": "This movie is very funny and entertaining. It's great for family, friends and people who like comedy movies.",
            "review_date": "2019-11-03",
            "source": "rt"
        },
        {
            "content": "Worst movie of the year.  Please do not waste your money.",
            "review_date": "2019-11-03",
            "source": "rt"
        },
        {
            "content": "HOUSEFULL 4 ARE BEST COMEDY MOVIE BEST MOVIE OF HOUSEFULL SERIES MY RATING 10/10",
            "review_date": "2019-11-03",
            "source": "rt"
        },
        {
            "content": "Terrible. Torture at best. If you think this is comedy, go get a sense of humor.",
            "review_date": "2019-11-03",
            "source": "rt"
        },
        {
            "content": "Awesome movie and it comedy make me happy and acting of kriti I like most all actor are fantastic I think it was my favorite movie",
            "review_date": "2019-11-03",
            "source": "rt"
        },
        {
            "content": "If you go in with no expectations, this movie will definitely entertain you. Go in with an open mind and a willingness to laugh and you will truly enjoy the movie.",
            "review_date": "2019-11-03",
            "source": "rt"
        },
        {
            "content": "Eeh !! Ye kya bawasir bana diye ho be.",
            "review_date": "2019-11-03",
            "source": "rt"
        },
        {
            "content": "Nice cinematography, funny actors, and settings are good, but the story would have been better with more twists other than just switching partners",
            "review_date": "2019-11-02",
            "source": "rt"
        },
        {
            "content": "Tooooo funny!!! Must know old Bollywood references!!!",
            "review_date": "2019-11-02",
            "source": "rt"
        },
        {
            "content": "i like the movie. i went to watch this movie with lest expectation and it turned out to be good. I like many punches and specifically Akshay kumar's Comedy. If you like to watch Akshay kumar you should definitely watch this movie.",
            "review_date": "2019-11-01",
            "source": "rt"
        },
        {
            "content": "Its a piece of utter shit ... I mean how can someone watch a movie soo gross ... There is a scene in the movie where akshay kumar revives his spider by blowing air in his ass..... What can be more disgusting.... Only thing to appreciate in this movie is the vfx work... This is the worst movie of the housefull franchise...",
            "review_date": "2019-11-01",
            "source": "rt"
        },
        {
            "content": "This movie is full of comedy  because of reincarnation of three couples so it form very comedy",
            "review_date": "2019-10-31",
            "source": "rt"
        },
        {
            "content": "Stupid plots, unoriginal comedy, shitty songs, occasional funny jokes.",
            "review_date": "2019-10-31",
            "source": "rt"
        },
        {
            "content": "Full on Comedy Movie In unique (Incarnation based Comedy) Way.",
            "review_date": "2019-10-31",
            "source": "rt"
        },
        {
            "content": "totally enjoyed....aki sir is awsm",
            "review_date": "2019-10-31",
            "source": "rt"
        },
        {
            "content": "Good entertainment.. watched with kids today.. husband thought it was ok.. we 3 liked it.. it was funny all the way..  Enjoy the show !!!",
            "review_date": "2019-10-31",
            "source": "rt"
        },
        {
            "content": "What many people donot realize is that major part of it is a spoof of baahubali and magadheera - telugu movies - and if you are looking for logic in a spoof movie, may god bless the movie goer and the movies!  Its a 4 star in spoof standards! Go watch it, even if you did not watch the originals... go go!",
            "review_date": "2019-10-31",
            "source": "rt"
        },
        {
            "content": "Jokes were forced. No originality and you could see Akshay Kumar did the role only because he was contractually obligated to. No story and you were lost as to what was happening.",
            "review_date": "2019-10-30",
            "source": "rt"
        },
        {
            "content": "बहोत बकवास movie   है ,",
            "review_date": "2019-10-30",
            "source": "rt"
        },
        {
            "content": "It has nothing without comedy",
            "review_date": "2019-10-30",
            "source": "rt"
        },
        {
            "content": "DO NOT WATCH THIS MOVIE ONE OF THE WORST MOVIES MADE NO COMEDY NO ORIGINALITY LEFT THE THEATER IN 30 MIN\nBC SAARE MILKE HUMKO PAGAL BANA RAHE ...! AISE LOGO KO MOVIE KAISE BANANE DE SAKTE",
            "review_date": "2019-10-30",
            "source": "rt"
        },
        {
            "content": "Loved the movie akshay,ritiesh specially",
            "review_date": "2019-10-30",
            "source": "rt"
        },
        {
            "content": "Super Movie From Bangladesh",
            "review_date": "2019-10-30",
            "source": "rt"
        },
        {
            "content": "It's a mass entertainer. Don't expect logic, just watch it like a fantasy film and you'll love the comedy and one-liner humor. Had a great time laughing till I cried after a long time.",
            "review_date": "2019-10-29",
            "source": "rt"
        },
        {
            "content": "some of the parts of the movie was genuinely funny but the movie as a whole was a big failure the concept of it taking 600 years ago for a comedy film was not a big favourite of mine but the ending was little good, so 2.5 is a good rating for this movie.",
            "review_date": "2019-10-29",
            "source": "rt"
        },
        {
            "content": "We really like this movie specially the landscape 🥰❤️❤️❤️❤️",
            "review_date": "2019-10-29",
            "source": "rt"
        },
        {
            "content": "I love this movie \nNo logic but amazing story and Akshay Kumar ritesh, Bobby Sir brilliant performance \nAll characters is amazing act love it 😍😍❤❤",
            "review_date": "2019-10-29",
            "source": "rt"
        },
        {
            "content": "Ok like not Indian movies like b4",
            "review_date": "2019-10-29",
            "source": "rt"
        },
        {
            "content": "The movie is great I know people disliked the story but it's a comedy film so story doesn't matters for me.",
            "review_date": "2019-10-29",
            "source": "rt"
        },
        {
            "content": "One of the worst movie ever made. Cant understand what made Akshay even think about working in this movie. No sense no logic and trust me no laughs at all just severe head ache. Does not deserve any star in fact negative 5 star.",
            "review_date": "2019-10-29",
            "source": "rt"
        },
        {
            "content": "Waste of time and money.. ",
            "review_date": "2019-10-28",
            "source": "rt"
        },
        {
            "content": "Over acting actress foreign board bore and bore",
            "review_date": "2019-10-28",
            "source": "rt"
        },
        {
            "content": "Funny movie......Best funny movie in the \"Housefull\" series",
            "review_date": "2019-10-28",
            "source": "rt"
        },
        {
            "content": "dumb movie.\ndont think we are fool.\ntell the director that dont make fool of the people.\nthanks",
            "review_date": "2019-10-28",
            "source": "rt"
        },
        {
            "content": "Worst Bollywood movie of 2019.",
            "review_date": "2019-10-28",
            "source": "rt"
        },
        {
            "content": "It was bad and this is coming die hard movie buff headache",
            "review_date": "2019-10-28",
            "source": "rt"
        },
        {
            "content": "Good movie for laughs",
            "review_date": "2019-10-27",
            "source": "rt"
        },
        {
            "content": "Omg great movie, full of fun and laughter.",
            "review_date": "2019-10-27",
            "source": "rt"
        },
        {
            "content": "There is no reason to dislike this movie. I would love to watch again.. Must watch movie in Theater (Cinema)",
            "review_date": "2019-10-27",
            "source": "rt"
        },
        {
            "content": "Pros:\n\nI laughed a few times.\n\nCons:\n\nkinda confusing plot\n, sex discrimination\n, predictable jokes.\n\nReview:\n\nThere are better movies to watch out there.",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "Save your money and time.",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "Must see movie!! I don’t know what these bores are talking about. This movie was hilarious from beginning to end. Absolutely the best from the Housefull series!",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "Comedy not much better",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "One of the best comedy movie . Love from Nepal",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "'Housefull 4' is an outrageous comedy which had the potential to be a lot better, yet serves anyone looking for sheer craziness, and madness.",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "Funny but didnt like the way it kept going from 1419 to 2019..",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "if you dont support these movies you shouldn't expect good comedies to be made...\nthis is the best Housefull so far and pretty hilarious. \ndefeat the negative campaign by the haters....go for it.🥰😆😆👌👍👍👍👍👍👍👍👍👍",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "The movie is great don't hear anyone just go and watch it it is very entertaining",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "Full on entertainment with lots of funny moments, Akshay again proves that he is one of the best with comic timings.",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "Worst movie ever I have seen ever ",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "Wonderful and fabulous movie. Great job with making this movie.",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "Disappointed disaster movie of decades",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "Horror and Funny movie...👍🏻👍🏻👌🏻",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "Fun...drama.... somewhat good....",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "Total timepass movie. Leave your brain at your house and enjoy it.",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "Full time pass movie!! Kids can’t stop singing all the songs!! :)",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "I love the way that Kriti Senon is very nice actress.",
            "review_date": "2019-10-25",
            "source": "rt"
        },
        {
            "content": "Unbearable, screams of OTT, misogynistic and crass comedy is what this movie is made of. Akshay Kumar is the inhaler to this asthma attack of a movie. Save yourself from such an attack. ",
            "review_date": "2019-10-25",
            "source": "rt"
        },
        {
            "content": "Best Housefull part in all the franchise...\nLoved it 🤩😍",
            "review_date": "2019-10-25",
            "source": "rt"
        },
        {
            "content": "don't dare to watch this shit... ",
            "review_date": "2019-10-25",
            "source": "rt"
        },
        {
            "content": "Comedy,Comedy, comedy. Just awesome.",
            "review_date": "2019-10-25",
            "source": "rt"
        }
    ]
}