{
    "rating": 8.7,
    "release_date": "2019-02-22",
    "num_reviews": 530,
    "genres": [
        "Kids&family",
        "Fantasy",
        "Adventure",
        "Comedy",
        "Animation"
    ],
    "summary": "When the sudden appearance of a female Light Fury coincides with the darkest threat their village has ever faced, Hiccup and Toothless must journey to a hidden world thought only to exist in myth. The two friends will soon discover their true destinies as dragon and rider fight together to protect everything they've grown to treasure.",
    "reviews": [
        {
            "content": "A heartwarming conclusion that we all need to see",
            "review_date": "2023-04-24",
            "source": "rt"
        },
        {
            "content": "First it was a perfect movie, then it was a perfect sequel, and now it's a perfect ending. I love this franchise.",
            "review_date": "2023-04-18",
            "source": "rt"
        },
        {
            "content": "The greatest 01 hour: and 44 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2023-04-12",
            "source": "rt"
        },
        {
            "content": "Maybe the not as good as the last 2 but still good",
            "review_date": "2023-03-31",
            "source": "rt"
        },
        {
            "content": "Great movie to everyone especially all ages!",
            "review_date": "2023-03-28",
            "source": "rt"
        },
        {
            "content": "How to train your dragon the hidden world is an incredible movie that is able to land the plane with this franchise but is also able to hit all the emotions that people who are attched to this franchise will feel, its also one of the very few trilogys that is perfect.",
            "review_date": "2023-03-16",
            "source": "rt"
        },
        {
            "content": "It was honestly the best ending to the series we could have asked for, the best part is that the romance was written really well, this movie could have been perfect but the side character Snotlout, Tuffnut ect.",
            "review_date": "2023-02-20",
            "source": "rt"
        },
        {
            "content": "This films and the tv series are part of our family, we watched all of them together, both my children LOVE the whole world of How to train your dragon, easy to watch with your family and love all the characters.",
            "review_date": "2023-02-20",
            "source": "rt"
        },
        {
            "content": "The whole movie goes against the whole meaning of the show. The last villain was way worse than this one, and all they do is be a bunch of chickens and run away from their problems instead of facing them.",
            "review_date": "2023-02-07",
            "source": "rt"
        },
        {
            "content": "The beautiful animation and gorgeous dragons were overshadowed sadly by a lackluster and rushed plot. But, although the film did failed to reach the level of its predecessors, it still had moments of greatness. All in all, 'How to Train Your Dragon: The Hidden World' was the decent conclusion of a legendary animated trilogy.",
            "review_date": "2023-01-24",
            "source": "rt"
        },
        {
            "content": "a very, very, very good cartoon! I grew up watching this saga since I was a kid. The film tells a very interesting story, where it shows that the night fury finally finds a partner. The soundtrack, the special effects are inexplicable!! I've honestly never felt so moved by a movie.",
            "review_date": "2023-01-15",
            "source": "rt"
        },
        {
            "content": "How To Train Your Dragon: The Hidden World is a film that will leave you with a heart wrenched feeling and tears dropping down your cheeks. At first you might feel sour but it reveals its-self that this is the best closing to the HTTYD trilogy that we were going to get from DreamWorks.",
            "review_date": "2022-12-21",
            "source": "rt"
        },
        {
            "content": "Best of Movies/TV Series Collection",
            "review_date": "2022-12-19",
            "source": "rt"
        },
        {
            "content": "Such a good ending to a perfect trilogy. The music, animation, the story of all 3 movies were done so good",
            "review_date": "2022-12-11",
            "source": "rt"
        },
        {
            "content": "An amazing movie to end this stunning trilogy!",
            "review_date": "2022-11-22",
            "source": "rt"
        },
        {
            "content": " It rushes to end the story but it still is a pretty entertaining movie.",
            "review_date": "2022-11-21",
            "source": "rt"
        },
        {
            "content": "About the same as the second one but I do think it did better. Such a great ending to a beautiful story.",
            "review_date": "2022-11-20",
            "source": "rt"
        },
        {
            "content": "a beatiful end to the httyd series im glad dreamworks didn't milk the series until it became a simpsons sydrome hiccup and and toothless realise that as long as humans like grimel are still alive even if grimel himself is dead people will still threaen the dragon so they have to say goodbye but at the same time remain apart of eachothers lives",
            "review_date": "2022-11-19",
            "source": "rt"
        },
        {
            "content": "Amazing. Recommend watching.",
            "review_date": "2022-11-11",
            "source": "rt"
        },
        {
            "content": "ok so, Spoiler Alert, if you've not seen it yet, click off of this!\n\n\n\n\n\n\n\n\n\n\n\nI LOVED THE WAY IT ENDED OMGGGGGG!! I thought at first, the dragons were going to the Hidden world and they'd never see them again, I was so SAD!! But then when they see eachother again, years later and they both have kids, YAYYY!!! Was just awesome!! The whole movie was GREATTTT!! I love ALL 3 of them and all the series and everything about this!! My son and I read the books together when he was a kid and we were just chuffedddddd when they movies came out!!",
            "review_date": "2022-10-26",
            "source": "rt"
        },
        {
            "content": "A satisfying end to a fantastic franchise. Dreamworks definitely hit their peak with the CG animation they have, and the story felt emotional and adventurous enough for the whole family to enjoy.",
            "review_date": "2022-09-12",
            "source": "rt"
        },
        {
            "content": "A poignant final chapter in a near flawless animated trilogy, How to Train Your Dragon: The Hidden World contains a successful recipe of emotion, action, and jaw-dropping animation that delivers exactly what the filmmakers intended.",
            "review_date": "2022-09-08",
            "source": "rt"
        },
        {
            "content": "magical, lots of fun, and cute dragons~!",
            "review_date": "2022-08-06",
            "source": "rt"
        },
        {
            "content": "A satisfying end to the trilogy.",
            "review_date": "2022-07-28",
            "source": "rt"
        },
        {
            "content": "emotional ending A MUST WATCH FILM SERIES FOR ALL AGES ITS AMAZING JUST MINDBLOWING !!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-07-16",
            "source": "rt"
        },
        {
            "content": "The perfect closing of the trilogy, the 3 films seem PERFECT to me",
            "review_date": "2022-07-12",
            "source": "rt"
        },
        {
            "content": "I love when someone has the ability to end their movie series at the best, not like Shrek or Madagascar. Whole dragon story was so original, interesting, funny, thrilling and heartwarming.",
            "review_date": "2022-06-24",
            "source": "rt"
        },
        {
            "content": "All ages admitted!!!!!!!!!! LOL, the funniest 1.75 hours ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-06-13",
            "source": "rt"
        },
        {
            "content": "simplesmente perfeito!",
            "review_date": "2022-06-08",
            "source": "rt"
        },
        {
            "content": "Great ending. I kinda hope they come back with this franchise",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "Funny and original, all ages!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! LOL!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-04-12",
            "source": "rt"
        },
        {
            "content": "Absolutely illogical actions of the characters, poor editing and sometimes too fast pace of the story do not allow the finale of the trilogy to be even close to the level of the first movie",
            "review_date": "2022-03-31",
            "source": "rt"
        },
        {
            "content": "Finally the dragon finds a mate, what a perfect ending for an incredible series.  I give this film a *4* stars for being awesome but not great!!!!",
            "review_date": "2022-03-28",
            "source": "rt"
        },
        {
            "content": "Great ending, amazing movie, but its the worst out of the series. That being said its still a great movie",
            "review_date": "2022-03-16",
            "source": "rt"
        },
        {
            "content": "A story told through 3 movies and a well written one I think it was a amazing movie one I can watch over and over \n\nA decent movie is one you watch once and never again this one is different and will be relevant for generation's because of the story and character building is the main draw not a child movie but a movie for all ages",
            "review_date": "2022-03-16",
            "source": "rt"
        },
        {
            "content": "The end was very emotional. Loved the ending credits. What a great song to end off this franchise.",
            "review_date": "2022-02-14",
            "source": "rt"
        },
        {
            "content": "How could you not love this movie!",
            "review_date": "2022-02-05",
            "source": "rt"
        },
        {
            "content": "Beautiful end of trilogy.",
            "review_date": "2022-01-09",
            "source": "rt"
        },
        {
            "content": "Amazing, i'm going to cry. The ending is so good :)",
            "review_date": "2022-01-08",
            "source": "rt"
        },
        {
            "content": "if you're a fan of other flims",
            "review_date": "2022-01-07",
            "source": "rt"
        },
        {
            "content": "This movie gives a fairly riveting and emotional finale to an amazing trilogy, despite it not being as strong as its predecessors.",
            "review_date": "2021-12-23",
            "source": "rt"
        },
        {
            "content": "still can't believe its done. There was no better way to end it though",
            "review_date": "2021-12-17",
            "source": "rt"
        },
        {
            "content": "Love it as always! The music the flying, and they really pulled a longbottom with hiccup like damn.",
            "review_date": "2021-12-02",
            "source": "rt"
        },
        {
            "content": "How to Train Your Dragon is now 2019, I like the original so this one is definite a good find too for here.",
            "review_date": "2021-11-23",
            "source": "rt"
        },
        {
            "content": "I'm not a fan of how they decided to end out the trilogy. I think it was really just not necessary and movie 2 already went down a sad and dark path. \n\nNone the less, this movie had good moments and it was nice to know that toothless was not the last of his kind...generally speaking.\n\nAt least it ended up a bit of an upbeat note...and it had a lot of good moments in it. You can't really watch the first 2 and not see it close out.",
            "review_date": "2021-09-15",
            "source": "rt"
        },
        {
            "content": "3 and a half out of 5. The final installment if this kind of did not feel like much and I felt bored with it. I may have to watch it again but it is a very pretty film with a fun opening and other cool sequences. It's scale is not like 1 but it has decent adventure and in one scene I think they used real water mixed with animation which was amazing. So all together may have to watch it again and it was an alright film to quite eye capturing at other times.",
            "review_date": "2021-08-22",
            "source": "rt"
        },
        {
            "content": "How Toy Story 4 won the Oscar over this I will never know. This film is amazing",
            "review_date": "2021-08-06",
            "source": "rt"
        },
        {
            "content": "Weakest of the trilogy, but I can imagine that only dedicated fans really had a problem with it. \n\nAn enjoyable movie with great animation and a lovely soundtrack that falls apart if you understand the context and implications of the characters actions. For any fan, I'd recommend watching it halfway and then pausing and imagining your own ending, because whatever it is it will no doubt be more in line with the characters and the values they've demonstrated over the past two movies than the ending we actually got.",
            "review_date": "2021-07-23",
            "source": "rt"
        },
        {
            "content": "The weakest of the trilogy and it felt it could have pushed the bar a little higher in a few areas. But it still manages to be a great film with a bittersweet conclusion.",
            "review_date": "2021-07-18",
            "source": "rt"
        },
        {
            "content": "I haven't been to a theater in 20 years and my kids first time. Best experience I ever had. The seats were amazing and so was the popcorn! Can't wait until next week.",
            "review_date": "2021-06-30",
            "source": "rt"
        },
        {
            "content": "I don't care if this is the final chapter in the trilogy. I want to be and a fourth film and a series which sets after the third and the homecoming.",
            "review_date": "2021-06-23",
            "source": "rt"
        },
        {
            "content": "I don't think I've ever cried as much as I did in that ending scene. It's such a great conclusion to this story, I'm just sad that it reached that conclusion and won't carry on.",
            "review_date": "2021-05-22",
            "source": "rt"
        },
        {
            "content": "great show to watch with the family. loved it!",
            "review_date": "2021-05-22",
            "source": "rt"
        },
        {
            "content": "It's good, I'd recommend it",
            "review_date": "2021-05-17",
            "source": "rt"
        },
        {
            "content": "I hated how the franchise took a childish turn. Like all animated sequels.",
            "review_date": "2021-05-14",
            "source": "rt"
        },
        {
            "content": "A disappointing end to one of the best movie franchises. It felt empty, with the characters changing completely. Would have been fine as a standalone, but as the ending to the httyd franchise it just doesn't work.",
            "review_date": "2021-05-03",
            "source": "rt"
        },
        {
            "content": "I don't have any emotion attachment for this unlike the second one. Disappointed.",
            "review_date": "2021-04-27",
            "source": "rt"
        },
        {
            "content": "We have this movie at home but still love seeing it on the big screen!",
            "review_date": "2021-04-23",
            "source": "rt"
        },
        {
            "content": "It's a lot of fun, stunning to look at, does great service to its main leads, and introduces the most thought-provoking story of the trilogy that ends things at a very appropriate and touching note.\n\nFULL REVIEW: https://letterboxd.com/blujayfilms/film/how-to-train-your-dragon-the-hidden-world/",
            "review_date": "2021-04-23",
            "source": "rt"
        },
        {
            "content": "Gotta Say HTTYD 3 is a cool movie but could have been longer also I Love Light furies 🤍🤍🤍🤍🤍🤍🤍🤍🤍🤍🤍🤍🤍🤍🤍🤍🤍🤍",
            "review_date": "2021-04-17",
            "source": "rt"
        },
        {
            "content": "i LOVED ALL OF THEM!!!!!!!!!",
            "review_date": "2021-04-03",
            "source": "rt"
        },
        {
            "content": "It was such a disappointment. The story betrays the rest of the franchise's themes of fighting injustice and standing in unity to protect those we love. It made me sad because I felt the pain of betrayal and the sad disappointment that this was all the series would ever be. A story about giving up and hiding away.",
            "review_date": "2021-03-29",
            "source": "rt"
        },
        {
            "content": "what an ending. i could not have asked for a better finally to the series.\nto uphold the expectations left behind with the two previous films, is purely remarkable. another excellent performance shown through the animating team, Dean DeBlois and John Powell.\nSuch a memorable score. i'm possibly in love with this score, its so thought out and well crafted.\ndefinitely one of my favourite films, watch it!",
            "review_date": "2021-03-23",
            "source": "rt"
        },
        {
            "content": "Definitely the BEST Ending to an animated movie franchise",
            "review_date": "2021-03-18",
            "source": "rt"
        },
        {
            "content": "Definitely the weakest of the trilogy",
            "review_date": "2021-03-16",
            "source": "rt"
        },
        {
            "content": "This review contains spoilers.\nHow to Train Your Dragon 3 was a huge disappointment. I will be unpopular, but let me explain in detail why I didn't like it.\nThe first 2 films are absolute masterpieces. The characters, the story, the animations ... Everything was just perfect. For the third, therefore, I had enormous expectations. Then, at the end of the film, I was pretty angry about how they developed this story arc. I mean, in short, the ending is wonderful, for sure. it is also very moving. But the beauty ends here. Everything else is just one stretch after another to get to the good ending. it's as if they already knew how the trilogy was going to end, but didn't have the slightest idea how to get there consistently. The villain, Grimmel, is one-dimensional and left me nothing. The animations, of course, are spectacular and are very colorful. But this is not just a movie. It's not just a nice ending. I know I shouldn't make comparisons, but for example Toy Story 3 (which after there is 4 is another matter) not only has a beautiful ending that will have moved everyone, even non-fans, but also a good villain, a articulated and well-structured story, a great evolution of the characters but above all great emotions. Here all this is only in the beautiful ending, but not in the rest of the film, too flat and made to stretch the broth. How to train your dragon 3 had great potential, but unfortunately it did not succeed in its intent.",
            "review_date": "2021-03-14",
            "source": "rt"
        },
        {
            "content": "I loved this movie, from the epic soundtrack to the beautiful ending...gorgeous animation...and Dragons...YES",
            "review_date": "2021-03-11",
            "source": "rt"
        },
        {
            "content": "its good but very sexist undertones, whether its the light fury not being regarded as the queen of all dragons (despite the same abilities as a night fury) to the end showing Hiccup and his son on a boat, showing him the world and then handing him off to his wife. Also theres a daughter who doesnt even so much as get her hand held at the end- it is mainly regarding his son.  I feel like this movie could have been improved by not making the 4 main females either a side kick (ruffnut, light fury of toothless, astrid) or as merely the mother with no significant role. The mother was the best representation of women empowerment, showing just that women can do shit too lmfao. Also, this is a world of vikings yes. But it is also fictional with dragons. Women were considered empowered in the land of vikings- they were tough. They're tough too yes but only in their relation to how they can serve a man. Just kind of made the movie leave me with a bad taste in my mouth. But, women were considered property until the 1920's and not permitted to open bank accounts until the 1970s so I guess i'm asking too much. Decent plot overall, not a lot of character development. Toothless was the most 3d character with many layers because they had femininely represented him in the earlier movies and now had to make him the guy in his relationship with the light fury (who isnt even given a nickname)- they couldve done a lot more considering they're dragons and their only point of reference is how to write for humans ig. Good show either way but kind of disappointed me. At least hold your daughters hand at the end and show her the world like you're showing your son. Did you just have her to replace Astrid? Idk, just kind of backwards when you consider the main demographic is incredibly impressionable young boys and girls haha. 3 1/2 stars pretty good",
            "review_date": "2021-03-06",
            "source": "rt"
        },
        {
            "content": "2019-6-7 Somehow it  was a bit touching in the end. Maybe   I could go watch the 1st and 2nd one.",
            "review_date": "2021-03-02",
            "source": "rt"
        },
        {
            "content": "The only thing good about this movie is the animation, other than that it's literally just the second movie but with different character models. Definitely better films worth watching.",
            "review_date": "2021-02-26",
            "source": "rt"
        },
        {
            "content": "A good ending to the trilogy. The film is good at building on the established world. The plot is not as appealing as in the last film, but very well executed. The movie has a nice more mature message than past iterations.",
            "review_date": "2021-02-24",
            "source": "rt"
        },
        {
            "content": "Took my grandson to see this movie. Don’t know who enjoyed it more him or I. This is really a great movie, especially if seen all of them as we have. We are both hoping that they will make another one.",
            "review_date": "2021-02-23",
            "source": "rt"
        },
        {
            "content": "The 2019 film: How to Train your Dragon Hidden World was astonishingly heartwarming and felt like a true masterpiece, However The general story line felt similar to the previous movie: How to train your dragon 2 that was released in June of 2014. \n\nThe Film is about the Viking leader, Hiccup and his rare Night Fury dragon, Toothless on a Quest to find another Night Fury dragon, and to explore the world to discover new dragons. They discover another Dragon like Toothless however in their search they attract the attention of the powerful and fearsome enemy Grimmel the Grisly. A ruthless dragon hunter who wants to wipe out all dragons. Hiccup and toothless must find the hidden world of Caldera to hide their dragons and keep them safe from Grimmel's wrath. \n\nThe relationships between the characters in the movie were strong and full of emotion. And the acting was fantastic, you could really feel the bond between all the characters. The movie had plenty of funny and dramatic moments over the course of the story. I personally enjoy the animations and the atmospheric environments in the film. And the music in the film was very well composed and added to the mood of film perfectly \n\nMany Scenes in the movie brought me Joy or sadness. It was full of great moments that made me laugh or smile, as well as some parts that brought a tear to the eye. Although the plot felt kind of similar to the previous movie with them dealing with an enemy who wanted to destroy/control all dragons it was still unique. The ending was both sad and happy which can be a difficult effect to produce in films. \n\nI highly recommend you watch How to Train you Dragon Hidden World because it was a wonderful experience, and I could watch It repeatedly. It is well worth your time and money. Just be sure to watch the two previous Movies first so you do not spoil anything.",
            "review_date": "2021-02-11",
            "source": "rt"
        },
        {
            "content": "for one of the best trilogies ever existed, it contains some of the best animated villains, gorgeous CGI, one of my fav all-time scores and is has one of the best endings to the trilogy that will make you smile and cry.",
            "review_date": "2021-02-10",
            "source": "rt"
        },
        {
            "content": "I love this movie, I was expecting for years and is amazing.",
            "review_date": "2021-01-29",
            "source": "rt"
        },
        {
            "content": "Beautiful ending and extremely satisfying seeing Toothless act as a mirror to Hiccup in all the ways he needed to improve and grow",
            "review_date": "2021-01-29",
            "source": "rt"
        },
        {
            "content": "I've always been in love with the trilogy because of the wholesomeness between the characters (especially the dragons) and with the light fury being introduced in this film, I wonder what they all get up to nowadays",
            "review_date": "2021-01-02",
            "source": "rt"
        },
        {
            "content": "Watched again today, having only seen it once or twice before. Undeniably, a great creation from the studio, the series of movies have always served to delight. This does the same, but does feel like it could be 30mins shorter, to its benefit",
            "review_date": "2021-01-02",
            "source": "rt"
        },
        {
            "content": "One of the greatest conclusions to a franchise that ever existed",
            "review_date": "2020-12-24",
            "source": "rt"
        },
        {
            "content": "Amazing. Deals with problems within the film with great realism, representing what a real person would do. Events are flowing satisfactorily and it's a lot of fun.",
            "review_date": "2020-12-17",
            "source": "rt"
        },
        {
            "content": "I just love it, i know it´s probably the weakest of the 3 but that doesn´t  mean it´s a bad movie. I think the problem is that the previous ones were too good because of the music, story and action sequences but this movie doesn´t focus in the battles or the villain, it focuses in toothless. \nNarratively it´s better than the second one but i think the music and the villain aren´t so good as the previous ones. However i really recommend this movie.",
            "review_date": "2020-12-07",
            "source": "rt"
        },
        {
            "content": "What an epic, touching and satisfying conclusion to the dragon riding saga. I'll admit my eyes watered a bit at the end.",
            "review_date": "2020-11-27",
            "source": "rt"
        },
        {
            "content": "This movie rocks and i love the funny and joy it brings me plus it's fantastic also it's rewatchable.😄 it's awesome!",
            "review_date": "2020-11-26",
            "source": "rt"
        },
        {
            "content": "The animation was amazing, they really brought color and life into this movie. It was such a roller coaster of emotions, and this movie has so many life lessons that people can really learn from. It was a sad, but really, the only way to end the series off. Thank you Dreamworks.",
            "review_date": "2020-11-26",
            "source": "rt"
        },
        {
            "content": "I enjoyed the second one more. Animation and music is nice though.",
            "review_date": "2020-11-17",
            "source": "rt"
        },
        {
            "content": "All good things must come to an end. Very good film great ending and great movie!!!",
            "review_date": "2020-11-02",
            "source": "rt"
        },
        {
            "content": "Encerrou umas das maiores sagas e amizades das animações de uma forma perfeita, fofa, emocionante e divertida. E deixou o fãs felizes e tristes ao mesmo tempo. É um filme perfeito.",
            "review_date": "2020-10-03",
            "source": "rt"
        },
        {
            "content": "A great final chapter of the series!  Sweet & uplifting...",
            "review_date": "2020-10-03",
            "source": "rt"
        },
        {
            "content": "I enjoyed this 3rd installment of the series as it further develops the characters and the story which we've grown to love. I hope this is not the end.",
            "review_date": "2020-09-23",
            "source": "rt"
        },
        {
            "content": "I watched this movie quite a while ago, but I found it really boring. For the majority of the movie nothing actually interesting happens. Only at the end part something interesting occurs. The ending was good.",
            "review_date": "2020-09-18",
            "source": "rt"
        },
        {
            "content": "Oh how I love this trilogy. Sad to say goodbye to it but they ended it perfectly. The baby night furys? PRECIOUS.",
            "review_date": "2020-09-11",
            "source": "rt"
        },
        {
            "content": "A satisfying end to an amazing trilogy, with the characters we all know and love, a truly intimidating and smart villain, and new romance plots between not only Hiccup and Astrid, but a new dragon that catches Toothless' eye. The visuals and animation are stunning, John Powell once again composes a moving score, and the ending scene is sure to leave longtime fans of the series bawling.",
            "review_date": "2020-09-10",
            "source": "rt"
        },
        {
            "content": "La película está muy bien hecha para ser la última parte de esta trilogía. Termina muy bien. Alguien dijo que la película debería llamarse \"cómo terminar tu trilogía\", tiene razón.",
            "review_date": "2020-09-05",
            "source": "rt"
        },
        {
            "content": "While it is the weakest out of the three, How To Train Your Dragon: The Hidden World still offers a great story, and visually dazzling animation, and brings this saga to a satisfying (and very emotional) conclusion.",
            "review_date": "2020-09-05",
            "source": "rt"
        },
        {
            "content": "I'm a long time fan of the series/movies. I watched all the shows and shorts, watched the second one at the release. The second one was okay, I just liked to see my favorite characters again and meet Valka, but this movie really pushed me over the limit. I can't remember the plot or the villain, as the main appeal for the movie was Toothless getting a girlfriend. I was down for that, but (spoilers) when all the dragons leave and Hiccup says goodbye to his best friend so they can just spend their lives with their wives. God. It felt like a slap in the face after watching all those episodes of Hiccup and Toothless being best friends and growing  inseperable. I was so saddened that the \"happy ending\" this movie got was the dragons just straight up leaving forever. And to damper that sadness just slap some kids in there for some fan service. It's an okay movie, but it was devastating that they just ripped apart these two species because living together was impossible I guess, which is just not true.",
            "review_date": "2020-08-31",
            "source": "rt"
        },
        {
            "content": "Boring very forgettable third installment in this franchise and I'm so happy it's over and very disappointed. I enjoyed the previous two movies but this man, has so many cliches and I just don't care for the characters in this movie that I previously cared for. I almost legit fell asleep during this movie in theaters but didn't because I'm in public so duh but if I was watching this at home then yes, I would've definitely have fallen asleep. This movie is super predictable and for me ruins the movie, I'm very surprised by how high the rotten tomatoes score was because this movie doesn't deserve a 91 percent critic score. Based off the trailers they spoil the entire movie for me and just made the movie experience horrible for me. Couple of positive things I have to say like the animation and budget for this movie, it seems like universal went on the cheaper end and you can tell in a sense but it works for the movie because the animation is phenomenal hands down and the detail on each individual hair in this movie is great. The writing is very lazy at times and the villian doesn't get to shine at all during this movie, he's just sitting their in the background and the relationship between the light fury and night fury, I wasn't invested at all and is just pure cringe. Kids probably enjoyed this movie but not the ones in the theater I was in, man, they just buried this movie to the ground just like how I did in this review.",
            "review_date": "2020-08-30",
            "source": "rt"
        },
        {
            "content": "The first time in my life I felt sad for days after watching this. the thought of the cute characters, and their permanent leave was extremely hard to bear. My number one animated triology, thank you for the marvelous ride!",
            "review_date": "2020-08-17",
            "source": "rt"
        },
        {
            "content": "This whole series is amazing!! This last film really hit home. Of you've seen the whole series of movies you will completely fall in love with, not only the characters but mainly with the relationship between Toothless and Hiccup. If you're like me this movie will make you cry like a child!! An absolute must-watch. 10/10",
            "review_date": "2020-07-19",
            "source": "rt"
        },
        {
            "content": "The how to train your dragon movies are masterpieces. DreamWorks has truly produced masterpieces in terms of character development, animation and writing. You see Hiccup develop from a skinny little teenager,who only wanted to make his village proud by killing a dragon to a great, wise and compassionate chief who loves and respects dragons. Hiccups and toothless' bond is nothing I have ever seen. The end of this movie left me in tears. If you haven't watched these movies you have too watch these absolute masterpieces.",
            "review_date": "2020-07-18",
            "source": "rt"
        },
        {
            "content": "This is the best How to Train Your Dragon movie. It's funny, action-packed and heartwarming. This is probably as good as family movies get.",
            "review_date": "2020-07-14",
            "source": "rt"
        },
        {
            "content": "This is an incredibly satisfying film the first time you watch it and when you get the chance to view it heaps more times it will only get better! The characters are amazing, the themes are utilized really well with the main plot and the villain is pretty good as well. The finale is perfect. However, there are a few smaller things that could have made this one even better. I think that the film would have benefited from an extra 20-25mins of runtime just so the villain Grimmel could be fleshed out more and for Hiccup to have more of a reason to move away from the island of Berk to a new place. It seemed very rushed from when he learns of Grimmel, to leaving Berk. Also some of the soundtrack choices could've been a little more connected to the other films. For example, during both of the other films Hiccup and the gang come into the final battle and surprise everyone but in this one when they are flying towards Grimmel and the Armada, they play some new and unknown theme which was really strange but it still was a cool moment. Also, there's a neat reference to the name of the final soundtrack piece from the first film  called \"Coming back around\" and in this film when Hiccup is falling with Grimmel and then the lighfury saves him, the main theme starts playing in the same way it did during the \"Coming back around\" track and he also says \"See? I knew you'd come around\" Thats another thing they nail. The references to the other films are really cool. \nTheres also a really cool parallel between Hiccup and Grimmel. When Grimmel was a boy he discovered a night fury and killed it where it slept but obviously Hiccup didn't do that in the first film so that was something they could've explored more with an extended runtime but yeah. \n\nOverall the movie is really solid and an emotionally satisfying close the HTTYD series, even if it isn't as good as the other two.",
            "review_date": "2020-07-08",
            "source": "rt"
        },
        {
            "content": "Amazing conclusion of the franchise, it's great to see DreamWorks work on something better than what they made before, even though Captain Underpants: The First Epic Movie is slightly better than anything made recently.",
            "review_date": "2020-07-05",
            "source": "rt"
        },
        {
            "content": "I already loved How to Train Your Dragon. Then they came out with the second one and I loved it even more! And then they came out with the third and last movie!! I was already so invested in the magic of the story and my heart was not ready for this ending! I held back tears of sadness and joy! This trilogy is definitely in my top 3 favorites!!",
            "review_date": "2020-07-01",
            "source": "rt"
        },
        {
            "content": "good but worse than part 2",
            "review_date": "2020-06-28",
            "source": "rt"
        },
        {
            "content": "Let me say I'm not a fan of the production of this series in general: I'm not sold on the human designs, I don't particularly like the selection of voice actors (for these roles), and there are WAY too many (would be) types of dragons for me: my OCD tendencies want to insist that some are wyvern and that there is too wide a biological inconsistency and there would be massive infighting, all the time....\n\nHowever the scenery and flying experience is produced magnificently. The nightfury model is adorable, and the writing is actually pretty solid.\n\nUnlike the first couple of movies, where the premise is fairly natural and obvious, they spend time to example the dilemma and establish scenes without wasting our time.\n\nWhile I expected the villain to be boring, he certainly wasn't, even if he's predictable to an extent.\n\nReally good movie, will watch again.",
            "review_date": "2020-06-28",
            "source": "rt"
        },
        {
            "content": "Was an okay send off for the franchise.",
            "review_date": "2020-06-15",
            "source": "rt"
        },
        {
            "content": "#HowToTrainYourDragon (The Hidden World) #MovieReview: 9/10\n\nPros:White heavy check mark\n\n•Sensational direction\n\n•Epic concluding chapter\n\n•The most emotional film of the series\n\n•Perfect animation\n\n•Exciting action\n\n•Engaging story and villain\n\nCons:Cross mark\n\n•Some characters are kinda useless",
            "review_date": "2020-06-11",
            "source": "rt"
        },
        {
            "content": "Un final satisfactorio para una trilogía que será recordada siempre.",
            "review_date": "2020-06-04",
            "source": "rt"
        },
        {
            "content": "I think most of it is good, but if you watch the tv series not all dragons fly and cannot get into the safety place so that is a big plot hole in my opinion that no one mentions",
            "review_date": "2020-05-30",
            "source": "rt"
        },
        {
            "content": "Whilst both of the previous films in this animated franchise managed to tell interesting stories that added something new and different each time, ‘HTTYD: The Hidden World' feels like it's a repeat of what we've already seen. There's nothing particularly unique or engaging about it this time around, and both the story and new characters (especially the villain) are pretty weak. \n\nThat being said, the animation is as nice as ever and it does have a few moments where it soars (particularly towards the end), but for the most part, it feels like a bit of a disappointing send-off.",
            "review_date": "2020-05-24",
            "source": "rt"
        },
        {
            "content": "I find the plot just ok, but the characters, design and action were good.",
            "review_date": "2020-05-22",
            "source": "rt"
        },
        {
            "content": "Though its overall plot is not as strong as its predecessors, The Hidden World still manages to bring in an emotional conclusion to not only a successful, but also extremely heartfelt, trilogy.",
            "review_date": "2020-05-20",
            "source": "rt"
        },
        {
            "content": "If it is to close cycles this is a real close. Touching and well made like its predecessors.",
            "review_date": "2020-05-17",
            "source": "rt"
        },
        {
            "content": "Images are great, story is so so.",
            "review_date": "2020-05-17",
            "source": "rt"
        },
        {
            "content": "Beautiful sweet Visually stunning and emotionally Masterpiece!satisfying end to the greatest epic beautiful animated trilogy ever!music,story,screenplay everything was A-1.the visuals specially in the hidden world it was the most amazing thing experienced the whole ending was literally epic and the reunion scene was satisfyingly emotional and Great.Overall a Masterpiece and a Great end to the most amazing,beautiful and Epic trilogy ever!",
            "review_date": "2020-05-13",
            "source": "rt"
        },
        {
            "content": "Its pacing is a little too fast to keep it at the same level as the other two, but it makes up for it via stunning animation and thrilling storytelling that, just like the others, changes your views on animation as a whole.",
            "review_date": "2020-05-04",
            "source": "rt"
        },
        {
            "content": "Hiccup (voiced by Jay Baruchel) is a slight and scrawny Viking who lives in Berk, a mountainside village where his fierce, machismo father, Stoick (Gerard Butler), is a tribal leader. The boy is apprenticed to Gobber (Craig Ferguson) whose main task is to keep him out of trouble. It's obvious that Stoick doesn't think his son has the stuff to be a real Viking warrior.\n\nThe village has been dealing with a \"dragon problem\" for a long time. These huge fire-breathing beasts periodically descend upon the village to snatch up all the livestock and destroy the crops. The Vikings only have clubs, swords, and spears to fight them off. The village teens go to a special training camp to learn how to kill dragons.\n\nDuring one dragon attack, Hiccup sneaks out and uses his own specially built weapon against a dragon. He thinks he might have hit it but isn't sure until the next day when he is wandering in the nearby forest and comes upon a young black dragon with green eyes. Hiccup realizes he is injured and can't fly away. What's more, the dragon is scared, just as he is. Hiccup brings some food and much to his surprise, the boy and the beast bond. Hiccup discovers another way of seeing the world through the dragon's eyes. Now his challenge is to convince the other kids in his dragon-fighting class, especially Astrid (America Ferrera), and his father that everything they thought about the dragons is wrong.\n\nFilm review by VEENIT",
            "review_date": "2020-04-27",
            "source": "rt"
        },
        {
            "content": "great end to the trilogy, satisfying the whole way trough",
            "review_date": "2020-04-23",
            "source": "rt"
        },
        {
            "content": "It's been one hell of a ride the movie knows how to end it in the best way. The 1st movie started from nothing and everything has evolve to the point that it ends right at the place where it's suppose to. Absolutely love it",
            "review_date": "2020-04-23",
            "source": "rt"
        },
        {
            "content": "I'm a die hard fan and I really liked that this secuel did not go on forever. It's different from the books, like the whole secuel and even different from the other 2 movies. But is needed to be different. It's needed to end an unforgettable trilogy. I really enjoyed the film, It was a great ending to the trilogy. As a trilogy this was 10/10 but alone this film was 8.75/10 for me. There is a lot of gap that's need to be filled. I'm still looking forward to a series between the 2. and the 3. HTTYD. The audience want it!!!",
            "review_date": "2020-04-17",
            "source": "rt"
        },
        {
            "content": "Beautiful and bittersweet, \"How To Train Your Dragon: The Hidden World\" is a worthwhile finale that doesn't entirely stick its landing.",
            "review_date": "2020-04-15",
            "source": "rt"
        },
        {
            "content": "8/10 finally, excellent!",
            "review_date": "2020-04-12",
            "source": "rt"
        },
        {
            "content": "Very good.. I was shakinf in my boots. Eragon wants what how to train your dragon has.",
            "review_date": "2020-04-11",
            "source": "rt"
        },
        {
            "content": "I absolutely love this movie with every part of me. I of course recommend for everyone to watch it and if anyone is a an of the previous movies from the Franchise this will not disappoint. I have watched this movie so many times and cried more than onv=ce each time. this movie is so sad but there are so many amazing moments that will make you forget that problems even exist. the animation for this movie is the best animation I have ever seen and it is so beautifully put together and has so many amazing visuals. I can't say enough about this movie, this franchise has brought me and it's many other fans on a journey and I never want it to end, but sadly all things end eventually. So that's why we are lucky to be able to re watch things!",
            "review_date": "2020-04-04",
            "source": "rt"
        },
        {
            "content": "It's good entertainment. The animation is fantastic",
            "review_date": "2020-03-31",
            "source": "rt"
        },
        {
            "content": "A simple third act for a simple and almost forgotten franchise but of really great animation and heart.",
            "review_date": "2020-03-30",
            "source": "rt"
        },
        {
            "content": "8.4/10 would toothless farewell again",
            "review_date": "2020-03-22",
            "source": "rt"
        },
        {
            "content": "A nice end to a great trilogy. If you liked the first two, you'll like this one.",
            "review_date": "2020-03-17",
            "source": "rt"
        },
        {
            "content": "What a terribly pointless film. The whole time it felt like a studio cashgrab plotline that didn't feel genuine or serving any purpose beyond pretty desktop wallpapers. There was never a point where i felt the danger of the threat or that they were in any peril. I would say while it's very well animated and beautiful to look at, it is unbearable in it's story and convenient coincidences. Just watch the first one, where the little bit of magic really was.",
            "review_date": "2020-03-17",
            "source": "rt"
        },
        {
            "content": "To be honest, I've already forgotten the storyline. LOVED the first two so much. And am totally behind the idea of making sequels of course. But this site is about commenting on movies and this particular one just didn't stick in my memory, sorry.",
            "review_date": "2020-03-02",
            "source": "rt"
        },
        {
            "content": "The third and final how to train your Dragon movie end the trilogy nicely. The animation is excellent as well as the voice acting. A nice ending to the trilogy. If you’ve seen the other two movies though this one feels mighty similar though. There’s really nothing groundbreaking about it and the story wasn’t all that engaging. Still if you’re a fan of the series you’ll enjoy it but I would say it’s the weakest out of the three films.",
            "review_date": "2020-02-29",
            "source": "rt"
        },
        {
            "content": "The third and final how to train your Dragon movie end the trilogy nicely. The animation is excellent as well as the voice acting. A nice ending to the trilogy. If you’ve seen the other two movies though this one feels mighty similar though. There’s really nothing groundbreaking about it and the story wasn’t all that engaging. Still if you’re a fan of the series you’ll enjoy it but I would say it’s the weakest out of the three films.",
            "review_date": "2020-02-29",
            "source": "rt"
        },
        {
            "content": "Probably the weakest out of the trilogy but that does not mean it is a bad film at all. It actually still is an amazing conclusion to the beloved franchise. The animation shows how much it has developed over the years in dreamworks giving audiences a movie which is truly pleasing to the eye. Most of the characters are still enjoyable. The main issue in this one, is the villain, who does not quite manage to reach the level of drago in the previous installment. However the amazing score from John Powell and the loved characters offer an emotional ending to the best animated trilogy to ever exist. When talking about \"how to train your dragon\" We should look at it as a trilogy, where one movie completes the other and fixes the issue one may have.",
            "review_date": "2020-02-23",
            "source": "rt"
        },
        {
            "content": "Ending in such an emotional way you will feel conflicted but overall you will be satisfied Is absolutely amazing. What's dragons Grow up and change the worldSeeing Hiccup and his friends",
            "review_date": "2020-02-21",
            "source": "rt"
        },
        {
            "content": "A brilliant and beautifully animated final chapter, combined with the direction, screenplay, animation, vocal performances, visual style, action sequences and score, How To Train Your Dragon: The Hidden World is a brilliant conclusion to this first class animated saga!!!",
            "review_date": "2020-02-21",
            "source": "rt"
        },
        {
            "content": "This film is by far the best from a technological perspective out of the three but it is truly missing something. Something that could have made it the better than any movie Dreamworks has ever made. A villain that lasted longer. Grimmel was looking like he'd be one of the best villains to grace the animated screen. However, he went out in such a horrible way. It felt like he deserved so much more. Someone who had every move calculated gets defeated so quickly and that pretty much sums up the ending to the movie. It takes it's time to built this story and then it's gone with flash. However, the final snippet at the end was a perfect close to a wonderful trilogy. Here's to hoping they don't make a 4th. Don't ruin something that's near perfect with a cash grab.",
            "review_date": "2020-02-19",
            "source": "rt"
        },
        {
            "content": "Simply a masterpiece :)",
            "review_date": "2020-02-17",
            "source": "rt"
        },
        {
            "content": "I thought the movie was amazing. It had great music and quality scenes with good action. It also had deeper and thoughtful meanings. While the movie was not without flaws, and may not be quite as perfect as its predecessors, It still wrapped up and gave a bitter/sweet ending to this epic series.",
            "review_date": "2020-02-17",
            "source": "rt"
        },
        {
            "content": "An amazing movie. A great way to end such a fantastic series. This movie really showed the growth of both dragon and its rider. The ending was bittersweet, yet felt really wholesome.",
            "review_date": "2020-02-16",
            "source": "rt"
        },
        {
            "content": "Endings are always bittersweet. But this one, the grand fight scene is even more meh than the previous ones. It was disappointing since it's the last.",
            "review_date": "2020-02-16",
            "source": "rt"
        },
        {
            "content": "Despite feeling fairly typical at times The Hidden World does manage to subvert a few expectations and deliver a visually stunning and superbly animated film with a sumptuous score, tremendous character animation and some lovely moments of heartwarming silent movie charm. There are moments with sand or paint or light where the movie really looks like a leap forwards instead of a cash grab which is a nice inspiring feeling to go alongside all its whiz bang. Sometimes unpredictable, sometimes ordinary, sometimes spectacular.",
            "review_date": "2020-02-07",
            "source": "rt"
        },
        {
            "content": "The Httyd series is one of my favorites and I'm so glad it got an amazing ending. There is so much heart and effort put into these films. And the anamation is just stunning, specifically the part with the sand. 9.5/10",
            "review_date": "2020-02-04",
            "source": "rt"
        },
        {
            "content": "O Melhor da Trilogia e uns dos melhores da DreamWorks Muito emocionante e bem feito Minha Nota : 8",
            "review_date": "2020-02-02",
            "source": "rt"
        },
        {
            "content": "‘How to Train Your Dragon: The Hidden World’ Beautifully animated and bittersweet. This movie had me smiling the entire time, all the way until the emotional ending that it deserved. 7.23/10",
            "review_date": "2020-01-31",
            "source": "rt"
        },
        {
            "content": "My daughter & I both love this movie.",
            "review_date": "2020-01-28",
            "source": "rt"
        },
        {
            "content": "This film really disappointed me. As a person who liked the first film and is a die-hard fan of the sequel, this film leaves out a lot of the action and emotion of the first two in favor of bland jokes and REALLY slow pacing. Of course, there are plenty of good qualities. The visuals are as good as ever, the villain is very entertaining, 1 or 2 jokes were pretty funny, and the ending is absolutely perfect. Sadly, the characters are very uninteresting. Hiccup's friends are given 3 running jokes that never get a laugh. In fact, Hiccup himself gets very little screen time. While Toothless and his partner have decent chemistry, it's not enough to save the really slow relationship they share that feels rushed and boring at the same time. Overall, I think this ended the franchise well, but the lack of emotion and entertainment throughout makes this by far the worst entry in the franchise.",
            "review_date": "2020-01-28",
            "source": "rt"
        },
        {
            "content": "A fenominal and emotional ending this series deserves.",
            "review_date": "2020-01-27",
            "source": "rt"
        },
        {
            "content": "Es increíble , me encantó como concluyó la saga , la recomiendo",
            "review_date": "2020-01-23",
            "source": "rt"
        },
        {
            "content": "I honestly didn't really care for this movie. I felt like the characters didn't really enough development and the story was dry. I didn't really feel like there was much going on besides killing a guy who is killing dragons and Toothless's romance. It was good for the first half hour, and then it just go kind of boring and repetitive. It was alright, but I wouldn't watch it again.",
            "review_date": "2020-01-19",
            "source": "rt"
        },
        {
            "content": "Not my favorite in the trilogy. I was hoping to feel more watching this and felt a bit let down. Still great, but Part 2 is far superior.",
            "review_date": "2020-01-15",
            "source": "rt"
        },
        {
            "content": "Filme tristeeeeee3, lindoooooo, fofoooooo",
            "review_date": "2020-01-14",
            "source": "rt"
        },
        {
            "content": "How can anyone get enough of Toothless? I was expecting a cartoonish fairytale ending but the filmmakers decide to go with a more realistic conclusion to the series, which, while bittersweet, makes for a satisfying and memorable ending.",
            "review_date": "2020-01-14",
            "source": "rt"
        },
        {
            "content": "Esta historia siempre sorprende. A la altura de las primeras. En historias animadas de las mejores.",
            "review_date": "2020-01-13",
            "source": "rt"
        },
        {
            "content": "How to Train Your Dragon: The Hidden World is another hit, with a lot of humor and an impressive story, spectacularly ending this wonderful of Dreamworks trilogy!",
            "review_date": "2020-01-12",
            "source": "rt"
        },
        {
            "content": "Its good.... but not as good as the first two films!",
            "review_date": "2020-01-09",
            "source": "rt"
        },
        {
            "content": "Esse filme é incrível, merece conserteza o oscar por essa magnifica e bela inserraçao",
            "review_date": "2020-01-05",
            "source": "rt"
        },
        {
            "content": "A great end to a trilogy what doesn't get the respect it deserves. Lives up to its predecessors by keeping its story simple but still having the comedy and emotion we have expected from the franchise. A must watch to any fan of animated films.",
            "review_date": "2020-01-02",
            "source": "rt"
        },
        {
            "content": "I don't like this part.",
            "review_date": "2020-01-02",
            "source": "rt"
        },
        {
            "content": "The Dragons threequel is the greatest way to conclude the whole franchise.",
            "review_date": "2020-01-02",
            "source": "rt"
        },
        {
            "content": "A cutely original and therefore approved addition to the much beloved How to Train Your Dragon franchise.",
            "review_date": "2019-12-31",
            "source": "rt"
        },
        {
            "content": "Solid story of letting go of your loved ones but to be honest I could not get over the voices and how obnoxious and un-Nordic they sounded.",
            "review_date": "2019-12-28",
            "source": "rt"
        },
        {
            "content": "A great, if not very emotional, ending to a great trilogy and one of the greatest friendships we've seen in film",
            "review_date": "2019-12-26",
            "source": "rt"
        },
        {
            "content": "HTTYD 3 ends the trilogy perfectly. It wraps up the characters storylines so well. There are some unneeded moments, But those moments are overshadowed by the fantastic emotional ones. The  ending is very emotional and satisfying.",
            "review_date": "2019-12-21",
            "source": "rt"
        },
        {
            "content": "What an amazing close to one of the best trilogies of all time. It will hit you in the feels over and over and it's worth every minute.",
            "review_date": "2019-12-20",
            "source": "rt"
        },
        {
            "content": "Very cool and awesome and romantic aka the coolest animated movie of all time good job DreamWorks.",
            "review_date": "2019-12-18",
            "source": "rt"
        },
        {
            "content": "THIS IS BERK! A befitting end to a trilogy of dragon love, and drama that we all cared about. The bond between Hiccup and Toothless was one to be cherished for.",
            "review_date": "2019-12-16",
            "source": "rt"
        },
        {
            "content": "The finale of the epic How to Train your Dragon series seemed to have some of their plot from past Pixar films. It was good, but it was never as memorable when Hiccup first met Toothless.",
            "review_date": "2019-12-16",
            "source": "rt"
        },
        {
            "content": "This is amazing! All of the scenes with Toothless were priceless, and the ending would surely make you cry!",
            "review_date": "2019-12-16",
            "source": "rt"
        },
        {
            "content": "It is time to let go. It is just sad thinking that we would have to see the movie trilogy went to an end, but the movie wrapped it up so good that we were at least satisfied with what the outcome has become.",
            "review_date": "2019-12-16",
            "source": "rt"
        },
        {
            "content": "I couldn't get enough of Toothless and Light Fury's cuteness! But this duo just balanced out each other's character. Nice ship right there.",
            "review_date": "2019-12-16",
            "source": "rt"
        },
        {
            "content": "That was a tough decision for the main character to do! But no matter how hard it was to let go, it was the right choice indeed. Freedom is also love.",
            "review_date": "2019-12-15",
            "source": "rt"
        },
        {
            "content": "It was wonderful to see Hiccup as the one who was helping Toothless. A friendship that was not selfish, but rather, giving.",
            "review_date": "2019-12-15",
            "source": "rt"
        },
        {
            "content": "FIERY! Toothless' newfound ability was awesome. It gave justice to the \"Night Fury\" classification.",
            "review_date": "2019-12-15",
            "source": "rt"
        },
        {
            "content": "Until the very end of the movie, everything was beautifully created. It was truly amazing to see all the characters grow.",
            "review_date": "2019-12-15",
            "source": "rt"
        },
        {
            "content": "I thought they would ruin this amazing franchise with this last installment, and they did.",
            "review_date": "2019-12-12",
            "source": "rt"
        },
        {
            "content": "The worst in the franchise but still good and the ending is perfection.",
            "review_date": "2019-12-11",
            "source": "rt"
        },
        {
            "content": "Toothless Gets Laid: The Movie.",
            "review_date": "2019-12-09",
            "source": "rt"
        },
        {
            "content": "A Nice continueance to the saga. I like the fact that time goes on, that it hasn't stood still since the last movie..",
            "review_date": "2019-12-08",
            "source": "rt"
        },
        {
            "content": "A great ending to a great franchise",
            "review_date": "2019-12-07",
            "source": "rt"
        },
        {
            "content": "Decent, but not great.",
            "review_date": "2019-12-06",
            "source": "rt"
        },
        {
            "content": "Great film to end the trillogy.",
            "review_date": "2019-12-06",
            "source": "rt"
        },
        {
            "content": "not as great as the two previous ones, but still made me cry hard, and I still loved it so so much. Reccomend it so hard People",
            "review_date": "2019-12-04",
            "source": "rt"
        },
        {
            "content": "Dreamworksʻs High Flying Animated trilogy bows out with its final installment of How To Train Your Dragon Trilogy with the Hidden World. Taking place one year after the events of the last movie Hiccup and Toothless take on their greatest foe yet and the two have to find the hidden world to not only save each other but all of dragon kind as well. And the movie does its best to push that angle for the film but sadly it does not succeed most of the time. Leaving behind a well-meaning movie that while it does hit some its story really well, it does not live up to be the finale or the movie that it needed to be.\n\tFirst off the visuals for the movie were absolutely beautiful, it is not as detailed as the second movie but the 3D models in this movie put a bit more emphasis slicker and smoother designs than detailed. That is not to say that the animation at times does not seem life-like, it just goes a slightly different route, and there is nothing wrong with that. Shots like landscape are done beautifully and of course, the dragons in the film look stupendous. Then, of course, there is the flying scenes, scenes of Toothless and Hiccup flying through the clouds are a staple for the series with each movie always topping the other. This one is no different as the ones that are in this movie are superior to the one that has been in any of the other movies, especially between Toothless and the light furry as that one was a work of art. That is another thing that the movie does well, toothless. Our fun little night furry friend is more alive and expressive in this film than he has been in any of the other. He has almost become human, but with all of the cat/dog characteristics that we have come to love over the past 9 years and it is fair to say that all of the best moment in the film are the ones where he is the focus for both the comedic scene and the dramatic ones.\n\tUnfortunately, the narrative took a hit for this installment, because up until the last ten minutes of the movie, you would not know that this movie is supposed to be a finale it also doesnʻt help that the film has some pacing problems from the get-go. And because of this, It is completely void of all tension. The villain of the story while entertaining, did not do enough to help the film with that problem and on top of that the movie forcefully tries to paint him as some dark version of Hiccup, which on its own is a very neat concept, but didnʻt spend enough time on that notion to truly sell it. Then, of course, there are the other villains that really donʻt matter because they are truly one of the most forgettable and useless characters in the entire franchise. Then there are the supporting cast, in past couple of movies the side characters while interesting are always pushed to the back in order to make room for Hiccup and toothless, here they get a little more time to shine but it is not always for the best, looking at you Snotlout who makes almost every scene he is in very uncomfortable. Then, of course, there is the ending of the film, the scene itself is not bad in fact it is one of the best scenes in the trilogy, but the journey on how it got there and the decisions that characters make are unbelievable and come off as incredibly forced ruining a possibly oscar-winning scene that comes out of nowhere.\nBy no means is the Hidden World a horrible movie, but it falls flat as a grand finale that was promised. The villain was watered down and the characters make some question discussions. But the dragons in the film breathe life into this movie and give it enough energy to make it enjoyable if barely.",
            "review_date": "2019-12-04",
            "source": "rt"
        },
        {
            "content": "The Hidden World has the best final fight sequence of the trilogy in my opinion. Combined with the emotional finale, it makes for a strong final act and fantastic conclusion to the series. I think the first half was a bit too slow and predictable for my taste, but the end definitely made up for it. How to Train Your Dragon 2 is probably still my favorite of the three, but The Hidden World comes extremely close.",
            "review_date": "2019-12-03",
            "source": "rt"
        },
        {
            "content": "It's ok I guess just nothing new. I would argue that this is the worst film in the trilogy. Everybody has grown up, there are some new dragons, a new world, a new villain, people wear dragon scales as amour, but it isn't a great film. Most things have been done before in the previous films and it feels like an unnecessary film to me. However, the ending was decent enough.",
            "review_date": "2019-12-02",
            "source": "rt"
        },
        {
            "content": "The movie was amazingly finished the trilogy with a big conclusion that is all most satisfying one problem is that Rios no explanation in the gap between httyd 2 & 3 it feels like the series should not have ended",
            "review_date": "2019-11-30",
            "source": "rt"
        },
        {
            "content": "Great movie (👍👍) for sure I watched it with my neice it has action humor romance good movie all around",
            "review_date": "2019-11-30",
            "source": "rt"
        },
        {
            "content": "Beautiful cinematography and story line.",
            "review_date": "2019-11-29",
            "source": "rt"
        },
        {
            "content": "This franchise is one of DreamWorks' best aces to boot. Although the third movie did not excite as much as the first two, it still makes for a good franchise-closure. Kudos to the entire team behind HTTYD!",
            "review_date": "2019-11-28",
            "source": "rt"
        },
        {
            "content": "Toothless being jack-clueless on impressing a girl is too relatable. However, on a more serious note, the animation upped a notch. The fire and blast effects were gorgeous and eye-catching.",
            "review_date": "2019-11-28",
            "source": "rt"
        },
        {
            "content": "The first two movies felt like learning to ride and fly with a newfound friend while searching for the self. This third movie felt like doing a smooth landing after impressing with a spark blast and several loops. Great movie!",
            "review_date": "2019-11-28",
            "source": "rt"
        },
        {
            "content": "Berk is the people, not the place. This last movie closes in the franchise nice and good that it'll have you leaving the movie house with a satisfied disposition.",
            "review_date": "2019-11-28",
            "source": "rt"
        },
        {
            "content": "I still can't help but see Stitch every time I look at Toothless, Chris Sanders really did right by both characters. I'd say Toothless' dance was the highlight of this movie along with the epic fight scenes and the fire-saber sword. Overall, I'd give it two thumbs up!",
            "review_date": "2019-11-28",
            "source": "rt"
        },
        {
            "content": "It might not have brought the same hype as the first two movies did for me but it made up with all those cool costume upgrades. The theme of friendship and family was still there and that made it a must-watch in my book.",
            "review_date": "2019-11-28",
            "source": "rt"
        },
        {
            "content": "The relationships of the dragons and their riders also grew and it was both heartwarming and awe-mazing to watch that development on screen. I look forward to the next movie the team that gave us The Hidden World would come up with.",
            "review_date": "2019-11-28",
            "source": "rt"
        },
        {
            "content": "I loved the upgraded armors of the riders of Berk plus, the thrill of the scenes were as dauntless as ever. Exactly what I loved about this franchise: costume design--check, risky adventures in 3D--check, adorable dragons--CHECK!",
            "review_date": "2019-11-27",
            "source": "rt"
        },
        {
            "content": "THE DRAGONS OF BERK ARE BACK WITH A NEW MOVIE! I've been following the TV series while waiting for this one and it did not disappoint. Also, Hiccup did well on puberty.",
            "review_date": "2019-11-27",
            "source": "rt"
        },
        {
            "content": "The new villain added for another whole level of spice to the franchise. The development of the characters we followed since the first movie has nicely culminated in this third installment. I hope they'd continue to make a follow-up show/series.",
            "review_date": "2019-11-27",
            "source": "rt"
        },
        {
            "content": "As we were expecting How to train your dragon the hidden world was very nice and so amusing and what a magnificent scene to end a trilogy",
            "review_date": "2019-11-25",
            "source": "rt"
        },
        {
            "content": "The first one was great, the second was meh, but this 3rd installment didn't even tried to do something new, it was like a remake of the second one, nothing new, just the \"ending\" of the trilogy",
            "review_date": "2019-11-24",
            "source": "rt"
        },
        {
            "content": "Очень красивый и живой мультфильм",
            "review_date": "2019-11-21",
            "source": "rt"
        },
        {
            "content": "A beautiful story had to end? Sad",
            "review_date": "2019-11-20",
            "source": "rt"
        },
        {
            "content": "This was excellent, not sure if it's my favourite one of the three but it's certainly a close call. I love the look of the hidden world, I love that the side characters get more screen time but obviously they keep the focus on Hiccup and Toothless and rightly so. I highly recommend this film and if you haven't seen the other two I would highly recommend giving them a watch too.",
            "review_date": "2019-11-19",
            "source": "rt"
        },
        {
            "content": "Love  all dragons cool lol",
            "review_date": "2019-11-17",
            "source": "rt"
        },
        {
            "content": "While being the inferior piece of the trilogy, it's still a beautiful conclusion.",
            "review_date": "2019-11-16",
            "source": "rt"
        },
        {
            "content": "A beautiful story, and a happy ending. In this year of Endgames, How to Train Your Dragon delivered an ending so emotional that shows just how much this franchise has grown. Dreamworks will never have a franchise as perfectly fantastic as this.",
            "review_date": "2019-11-16",
            "source": "rt"
        },
        {
            "content": "The best trilogy  ever",
            "review_date": "2019-11-12",
            "source": "rt"
        },
        {
            "content": "With gorgeous animation, stellar voice-acting, and a story that will have fans of this franchise crying their hearts out, How to Train Your Dragon: Hidden World was a satisfying and emotionally cathartic conclusion to one of my favorite film series.",
            "review_date": "2019-11-11",
            "source": "rt"
        },
        {
            "content": "Another great addition to the series. Great fun for the whole family.",
            "review_date": "2019-11-11",
            "source": "rt"
        },
        {
            "content": "If anyone has talked to me for more than 10 minutes than they probably know I have a fascination for Animated movies. I am so interested in each studio such as: Pixar, Dreamworks, Disney Animation, Illumination, Warner Animation Group etc…and I am invested in the quality of movie each studio is putting out. Pixar has long been known as the cream of the crop as far as animation.\n\nBut Dreamworks has been slowly but surely coming along and is looking to be a true threat in the animation wars. They have assembled their own stable of great work that is close to rivaling Pixar.\n\nHow To Train Your Dragon 3 was the conclusion of a trilogy 9 years in the making. I am extremely impressed Dean DeBlois directed all three and did not seem to compromise on anything as these sequels held up in quality to the original. I am going to do a grades rundown like this for most animated movies I review, so I hope you enjoy.\n\nAnimation: A – This series has some of the best animation across any studio. The original changed the game as far as animation quality and this movie does no different. All the new dragons, and battle scenes look absolutely spectacular.\n\nVoice Cast: A – Jay Baruchel, America Ferrera, Kit Harrington, Cate Blanchett, Craig Ferguson, Jonah Hill all returned for this of course. They added the villain in F. Murray Abraham, he was very menacing throughout the whole film. Kristen Wiig was awesome as usual, but her partner throughout these was TJ Miller, however his voice was noticeably absent due to some \"not so great allegations.\" Overall though the voices are phenomenal and they really bring so much life to this movie.\n\nStory: B – This movie is about two things, how love can come in the most unexpected ways, and what it means to be a king. At the end of the day though, this is a movie made for children so adults cannot expect too sophisticated of a story. I enjoyed everything with the Dragons and the Hidden World, I was not too keen on the abduction story lines though. Every time the two Fury Dragons were together though it was great.\n\nWithout spoiling this, the ending was phenomenal and really gave the viewer so much closure and happiness that it made up for some of the flaws in the middle.\n\nIn conclusion, I never thought we would get a third How to Train Your Dragon movie, and I for sure never thought it would be this good. Simply put this is one of the best animated series of all time, and they finished it off about as good as they possibly could have. Oh and the Light Fury was absolutely dope!\n\nJuice Rating:\n87/100",
            "review_date": "2019-11-08",
            "source": "rt"
        },
        {
            "content": "I love it, the scenes are well made and it  gives the audience some emotional scenes. Definitely worth the watch",
            "review_date": "2019-11-06",
            "source": "rt"
        },
        {
            "content": "Just as sweet as all the other ones",
            "review_date": "2019-11-06",
            "source": "rt"
        },
        {
            "content": "From growing up watching and loving these movies this one was hard to get over. It was the ending to the series that I dreaded and left me in thought for awhile. From binge watching the tv show and watching the movies as soon as possible I didn't know what to do when the series ended. Over time this series has become my all time favorite and I highly recommend watching all the movies and shows. A warning though, if you are a true fan get ready to become emotional.",
            "review_date": "2019-11-01",
            "source": "rt"
        },
        {
            "content": "What an awesome trilogy",
            "review_date": "2019-10-28",
            "source": "rt"
        },
        {
            "content": "Dragons are so cool; my kids love the balance of fantasy and animation. ",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "This is the third movie of the \"Dragon\" trilogy, and the first one I've reviewed… but my rating here can be extrapolated to cover the two previous films as well. This is a really great family-film series for all ages, and I highly recommend all three (a word to the wise: this one might be a tad too scary for small kids). You don't have to have seen the first two films to enjoy this movie, but it does help give the story context – the movie does not waste time trying to catch you up with what happened in the first two. The prior films follow our hero Hiccup (first as a little kid and second as a teenager) and his efforts to change his Viking culture from one that kills/enslaves dragons to a collaborative culture that embraces them. In this installment, Hiccup and his faithful dragon Toothless are all grown up… and love is in the air. While Hiccup flirts with his badass (and totally hot) sidekick Astrid, Toothless finds an elusive female Nightfury dragon and is helpless against her feminine wiles. The way their courtship is rendered is just adorable, it's the best part of the film…it's so sweet and funny, it just brought joy to my heart. You know it's good animation when every thought and feeling is clearly expressed without a single word uttered. I was also impressed with the villain in this film, voiced to skeevy perfection by F. Murray Abraham. He is so threatening and malicious I just wanted him to DIE DIE DIE… and it's not often that a film will inspire such a passionate hatred towards its villain. The themes of these films have matured as the characters have, and this is by far the most serious of the three… and also the most heartfelt. This film really yanks on your heartstrings but is never manipulative, it's just a really pure story that will resonate with just about anyone (especially pet lovers!). Be warned, the ending is bittersweet and REALLY emotional, I was a total weepy mess. Kudos to the writers for bookending these films with a definitive and satisfying ending that provides full closure to the story. It's clear there will be no more sequels, and I'm glad of that - they have told the full story and they told it well, what more can you ask? This is a worthy finale to a worthy trilogy. ",
            "review_date": "2019-10-24",
            "source": "rt"
        },
        {
            "content": "I honestly don't know how they could have made it better. Slightly predictable but it was always going to be. A fantastic ending to the trilogy, probably the best animated trilogy there is.",
            "review_date": "2019-10-22",
            "source": "rt"
        },
        {
            "content": "So cute I enjoyed it",
            "review_date": "2019-10-19",
            "source": "rt"
        },
        {
            "content": "Don't let it end this is a perfectly good movie just do it in the present time no one will complain if they're still alive they will probably be happy if there's another movie and keep it to where they were when hidden world ended",
            "review_date": "2019-10-11",
            "source": "rt"
        },
        {
            "content": "Entertaining conclusion to a colourful andoving tale. ",
            "review_date": "2019-10-10",
            "source": "rt"
        },
        {
            "content": "One of the best animated movies of all times. A fantastic conclusion to the trilogy. Especially for the music, very heart pounding. Well done John Powell. \nThe storyline looks a bit flat, but it requires a lot of higher level thinkings to really understand what each characters are doing and saying. Well done Dean DeBlois. \nThe graphic even shows the vessels on Hiccup's hand during the wedding, not something you see a lot in animated movies, and the scene in the hidden world when all the dragons are flying at the same time requires a lot of hard work. \nThank you Dreamworks for bringing such an amazing movie.",
            "review_date": "2019-10-06",
            "source": "rt"
        },
        {
            "content": "While I still enjoyed the movie it is the weakest of the trilogy in my opinion. 6/10",
            "review_date": "2019-10-05",
            "source": "rt"
        },
        {
            "content": "The story is a bit hard to follow, but there's nothing particularly wrong with the 3rd installment of the How to Train Your Dragon trilogy, but the wow factor just isn't there.  It was a fun ride and the final (for now) version comes with some heavy themes though all ages should have a good time and a few (not as many as the 1st two films) laughs.  Final Score: 7.9/10",
            "review_date": "2019-10-02",
            "source": "rt"
        },
        {
            "content": "Had no buisinesz being that good. Im not even big into the serious but the movie was wonderful and fulfilling. In total. Some bumps in story with the antagonists but still great. I dont get this kind of feeling normally unless you watch 400 episode of a show. Impactful.",
            "review_date": "2019-09-27",
            "source": "rt"
        },
        {
            "content": "I loved this movie. It tied up the story line in a satisfying and beautiful way",
            "review_date": "2019-09-24",
            "source": "rt"
        },
        {
            "content": "For much of the movie, it feels like a rehash of the plot of the second movie.  However, the emotional beats it hits along the way feels fresh and brings the franchise to a satisfying, surprisingly mature conclusion.",
            "review_date": "2019-09-22",
            "source": "rt"
        },
        {
            "content": "Visually amazing, fun, and epic, How to Train Your Dragon: The Hidden World ends the trilogy on an emotionally satisfying note.",
            "review_date": "2019-09-22",
            "source": "rt"
        },
        {
            "content": "I feel like thees movies keep getting made over fandom..😂 Still really enjoyed this one!",
            "review_date": "2019-09-21",
            "source": "rt"
        },
        {
            "content": "The Hidden World is a suitable ending for the How to Train Your Dragon franchise. It features an intimidating villain and engaging animation. I've never been enamored with these movies, but I still find them to be an enjoyable way to pass the time. If you've been on board the whole time with this series, this film should satisfy your tastes.",
            "review_date": "2019-09-16",
            "source": "rt"
        },
        {
            "content": "It's a long-overdue finale that, even though doesn't quite fly to heights the previous installments have, still possess a compelling tale and emotional conclusion to a near-decade-worth of dragon-storytelling. The Hidden World is a beautiful send-off of the \"How to Train Your Dragon\" trilogy; an underrated franchise that can easily compete against its other DreamWorks-animated-projects despite its minimal notoriety. 4.3/5",
            "review_date": "2019-09-16",
            "source": "rt"
        },
        {
            "content": "I'm a huge fan of the How To Train Your Dragon movies. I've seen all three movies in the theatre and I really enjoy the characters, universe, and animation! It's not very often when you get a semi-serious and dramatic animated fantasy film series, and I really appreciate the series for that. As for my thoughts on the third film, I really enjoyed it! I did think the story was a little too similar to the second movie, but aside from that this was a really great movie and the perfect ending for the series. This movie puts a lot more focus on Toothless the dragon than the other films did. There are several long scenes with no dialogue, which was really cool. The animation was stunning as always and the character and creature design is as strong as ever! Overall, this is a must-see for How To Train Your Dragon fans, but if you haven't seen the others I'd say wait until you have before you watch this one.",
            "review_date": "2019-09-16",
            "source": "rt"
        },
        {
            "content": "The perfect ending to a perfect child film series that just keeps getting better and better with every installment",
            "review_date": "2019-09-13",
            "source": "rt"
        },
        {
            "content": "A beautifully done ending to one of the best structured trilogies to ever be made. ",
            "review_date": "2019-09-10",
            "source": "rt"
        },
        {
            "content": "A bit underwhelming for a trilogy finale, but still very enjoyable!",
            "review_date": "2019-09-09",
            "source": "rt"
        },
        {
            "content": "Mais qui impressionante",
            "review_date": "2019-09-06",
            "source": "rt"
        },
        {
            "content": "Great movie, sad because is the last one, but great development.",
            "review_date": "2019-09-02",
            "source": "rt"
        },
        {
            "content": "Being a huge httyd (how to train your dragon) fan I was looking forward for this movie. I love this movie so much. The animation is exquisite. The ending was the perfect way to end the franchise and it got what it deserves , and this story will always be in my heart. Thought it made me cry",
            "review_date": "2019-08-30",
            "source": "rt"
        },
        {
            "content": "This movie was boring at best and bad at worst. Nothing interesting happened for a majority of the movie and what did happen felt rushed and bunnied along just so they could finish their story. A lot of deus ex machina, and a plot- finding the Hidden World- that was resolved in a few days rather than a longer time like weeks, months, or even years it should have taken. This movie would have done better as a series like Race to the Edge, not the campy mess it ended up as.\nThe villain was lame and underwhelming. He had no sense of presence, didn't look or act intimidating- not nearly as scary as the previous film's antagonist with the Bewilderbeast.\nI'm a big fan of this series. The dragon designs were great, I even liked the light fury a lot more than much of the fandom does. But no emotion or love was put into this movie beyond the visuals, which are stunning as always.\nI would recommend skipping this if you expect it to be a masterpiece like the films preceding it.",
            "review_date": "2019-08-28",
            "source": "rt"
        },
        {
            "content": "Lives up to its name!",
            "review_date": "2019-08-27",
            "source": "rt"
        },
        {
            "content": "Grimmel is an interesting Enemie and the Movie is so good! Best Ending for this franchise!",
            "review_date": "2019-08-25",
            "source": "rt"
        },
        {
            "content": "There was a trilogy when I was a young man...",
            "review_date": "2019-08-24",
            "source": "rt"
        },
        {
            "content": "Enjoyable movie for the entire family!",
            "review_date": "2019-08-23",
            "source": "rt"
        },
        {
            "content": "I loved this movie!!! Saw it 3 times. Made me cry and laugh every time. Defiantly going to buy it.",
            "review_date": "2019-08-23",
            "source": "rt"
        },
        {
            "content": "The perfect end of a perfect trilogy.",
            "review_date": "2019-08-19",
            "source": "rt"
        },
        {
            "content": "I love the friendship between Hiccup and Toothless. The third chapter of the franchise did indeed provide a closure to the story. Also love the sweetness and romance between Astrid and Hiccup; their relationship is based on real-life couples. Romance aside, I love this villain! He's cunning and knows when he sees a threat. Overall, I love this franchise because of the plotline and the closure DreamWorks gave its audience. Fabulous job! ",
            "review_date": "2019-08-19",
            "source": "rt"
        },
        {
            "content": "Credit where it's due: The animation is aces! But the story is so @#$! bad that you may want your money back.\n\nSure, you will find some generic heartwarming scenes but sitting through such a terrible plot will anger anyone who loved the first two films as much as I did!\n\nThe villain is so lame, and the areal acrobatics are even more unbelievable.\n\nThe first two movies established a bit of a mechanical/magical framework to the world. This story just broke that framework, in really stupid ways that just suck.\n\nAnd with the hint of a 'mini' spoiler:::::::::::\n\nIf you have hundreds of Dragons at your disposal, there's NO need to be afraid of any enemy in WOODEN SHIPS!!!\n\nI could go on, but what's the point ~ Skip this one if you are older than 10!",
            "review_date": "2019-08-18",
            "source": "rt"
        },
        {
            "content": "This is the second movie, just with weaker subplots and a sad ending. ",
            "review_date": "2019-08-18",
            "source": "rt"
        },
        {
            "content": "A beautifully made, heartwarming visual MASTERPIECE!!! I have no words except flawless and masterpiece...",
            "review_date": "2019-08-17",
            "source": "rt"
        },
        {
            "content": "Outstanding! Nice way to end the trilogy! ",
            "review_date": "2019-08-16",
            "source": "rt"
        },
        {
            "content": "If you've seen the HTTYD Netflix series, you've seen this movie. With a generic \"Oh no, a creepy looking dude has come to kill our innocent creatures!\" story, a juvenile sense of humor, and a disconnected plot that leaves you feeling confused and unsatisfied; this movie fails to live up to it's predecessors and makes for an underwhelming and disappointing final installment to a beloved franchise.",
            "review_date": "2019-08-16",
            "source": "rt"
        },
        {
            "content": "A very good end for a great saga.",
            "review_date": "2019-08-15",
            "source": "rt"
        },
        {
            "content": "The best animated movie i have watched!!!",
            "review_date": "2019-08-14",
            "source": "rt"
        },
        {
            "content": "This is one of the best trilogies of all time. That statement is not hyperbole, the animation continues to get better and the attention to detail is simply terrific. While the villain is far from an overarching presence, he gets the job done. He also gives the protagonists enough motivation to come to grips with the underlying question in the movie; what is the future of humans and dragons? The series has always had heart and it continues to shine in this installment. Absolutely recommend a watch for all ages. ",
            "review_date": "2019-08-14",
            "source": "rt"
        },
        {
            "content": "Awesome end to the trilogy!",
            "review_date": "2019-08-14",
            "source": "rt"
        },
        {
            "content": "Great series with a good message of love and support. Really enjoyed it. ",
            "review_date": "2019-08-12",
            "source": "rt"
        },
        {
            "content": "Delightful third sequel. I have really enjoyed the characters in this series and the premise of dragons as pets. ",
            "review_date": "2019-08-10",
            "source": "rt"
        },
        {
            "content": "I loved it! Such a heartwarming and beautiful end to a truly magical and revolutionary franchise. Although it has its fair share of faults with things like pacing and unnecessary jokes it more then makes up for it in its deep exploration of its theme. \"love\". One could say it is an overused theme, but this films paves new ground in terms of it. The movie feels like a journey, with ups and downs and WOW the emotional pay off will leave you sobbing like a baby.\nIs an absolute must see!",
            "review_date": "2019-08-09",
            "source": "rt"
        },
        {
            "content": "This film proves that How to Train Your Dragon was a successful franchise!",
            "review_date": "2019-08-09",
            "source": "rt"
        },
        {
            "content": "It is a beautiful ending to the series that shows that friendship can continue after one leaves. It is a deeply heartfelt and emotional ending that was crafted with great writing and imagery.  ",
            "review_date": "2019-08-08",
            "source": "rt"
        },
        {
            "content": "Coolest movie I have ever seen! A must see!",
            "review_date": "2019-08-07",
            "source": "rt"
        },
        {
            "content": "There are a few great moments between Toothless and the new dragon with some legitimately beautiful cinematography, but the story overall is only mostly passable. The main supporting characters are so aggressively obnoxious that even if someone else were watching this movie I would only stick around for the scenes with Toothless. The movie is going for irritating humor, and if you enjoy that then you will probably get more mileage out of it than I did. \n\nClosest Comparison: The same thing is happening to this franchise as happened to Shrek.\n\nSetting: Fantasy\nPlot: Adventure\nTone: Comedy",
            "review_date": "2019-08-07",
            "source": "rt"
        },
        {
            "content": "Great action! I was thoroughly entertained all the way through and I was sad when it was over. Great ending for an amazing trilogy!",
            "review_date": "2019-08-06",
            "source": "rt"
        },
        {
            "content": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️🤮🤮❤️😇😇😇😇😇😇😇😇😇😇😇🤢🤢🤢🤢🤢🤢🤢💰💰🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤮🤮🤮🤮🤮🤮💰💰💰💰💰💰💰💰💰💰😞💰💸💸💸💸😩😢😭😂😇😘💰💰💰💸💵💴💴💸💸💸💵💴💵💸💸💵💴💸💸💰",
            "review_date": "2019-08-06",
            "source": "rt"
        },
        {
            "content": "Extremely dumb humor (opposite of the likes of Paddington), a nonsensical plot and lots of visually dark scenes made this movie a total bore to sit through.  And that's coming from someone who really liked the first two installments.",
            "review_date": "2019-08-05",
            "source": "rt"
        },
        {
            "content": "Are you going to make another movie Of this A sequel",
            "review_date": "2019-08-05",
            "source": "rt"
        },
        {
            "content": "a perfect ending to this beloved franchise. how to train your dragon 3 has all the heart emotion humour and magic as the first two films had. the voice acting is incredible the animation is stunning on every level and the character growth is outstanding throughout these three films we have watched these characters transform from childhood to adulthood and it feels so authentic and real. the final act of this movie is truly perfection and made me cry. I did find some parts of the movie slightly slow and boring but overall the this movie is amazing and you need to watch it if you haven't already.",
            "review_date": "2019-08-02",
            "source": "rt"
        },
        {
            "content": "A kinda disappointing ending to the trilogy. The movie offered nothing new in terms of narrative or character and I felt the ending was a bit of a cheat.",
            "review_date": "2019-07-28",
            "source": "rt"
        },
        {
            "content": "While it is the weakest in the trilogy, it is still a very good movie. The animation is great, the voice cast nails their roles, and it's a fun adventure. It just suffers from a weak villain and supporting characters who don't get much to do. ",
            "review_date": "2019-07-25",
            "source": "rt"
        },
        {
            "content": "Great movie with powerful massage in it ",
            "review_date": "2019-07-23",
            "source": "rt"
        },
        {
            "content": "It didn't leave an impact on me like I was hoping the final chapter of this trilogy would and most of the comedy didn't always work with me, but How to Train Your Dragon: The Hidden World is still an enjoyable movie with great animation, some exciting action scenes, and an emotional ending.",
            "review_date": "2019-07-23",
            "source": "rt"
        },
        {
            "content": " As an absolutely obsessed fan of Httyd  I can confirm that you absolutely cannot pass up this movie!!! I must say I love how all the characters aged and developed. Though I wish it had ended differently  i'm not going to spoil it, but you have to see this movie!!!!",
            "review_date": "2019-07-23",
            "source": "rt"
        },
        {
            "content": "I avoided seeing this in the theater since I was less than impressed with the trailers(a romantic subplot with Toothless? Blegh...) and I have to say I chose well by waiting for this on Netflix. Not a horrible end to the trilogy, just a very predictable one. Maybe slightly generous with the rating here.",
            "review_date": "2019-07-22",
            "source": "rt"
        },
        {
            "content": "Awesome movie! It should be one of the Oscar nominees for Best Animated Film.",
            "review_date": "2019-07-21",
            "source": "rt"
        },
        {
            "content": "Beautiful love story very entertaining and some how I’m expecting the sequel I really like every single movie of the series ",
            "review_date": "2019-07-21",
            "source": "rt"
        },
        {
            "content": "I didn’t think I would like it, but I LOVED it!! Cute movie for all ages ",
            "review_date": "2019-07-21",
            "source": "rt"
        },
        {
            "content": "How to Train Your Dragon concludes on such a heartfelt note. Sure, the plot is not so different and innovative as the last two entries. But we still continue to get the heart, charm, and adventure of the saga. Visually, and emotionally an incredible finale. Loved it. 4.5/5 ",
            "review_date": "2019-07-20",
            "source": "rt"
        },
        {
            "content": "This was a great send off for our dragon friends. Seeing all the characters come into their own was wonderful to watch. I visuals were brilliant, the storyline well constructed, and the emotional tension was palpable, if you have been with Hiccup since he first encountered toothless, this is a must watch. ",
            "review_date": "2019-07-19",
            "source": "rt"
        },
        {
            "content": "ist's awesome movie in all direction it so awesome \n",
            "review_date": "2019-07-18",
            "source": "rt"
        },
        {
            "content": "Absolutely wonderful! A great resolution to the story! Excellent!",
            "review_date": "2019-07-18",
            "source": "rt"
        },
        {
            "content": "you'll love it if you're really a fan, other wise pass",
            "review_date": "2019-07-17",
            "source": "rt"
        },
        {
            "content": "Enjoyable movie. Just shy of the extreme fun and lovable quirkiness of the first movie, but a far superior product from the second. Overall, great fun! ",
            "review_date": "2019-07-16",
            "source": "rt"
        },
        {
            "content": "Great movie. Didn’t feel like I was missing a lot because I haven’t seen the whole catalog (saw first film) Sweet. Smart. ",
            "review_date": "2019-07-15",
            "source": "rt"
        },
        {
            "content": "Nice ending for these movies.  Glad they decides not to drag it on forever like some movies do. Enjoyed the 1st 2 as well",
            "review_date": "2019-07-15",
            "source": "rt"
        },
        {
            "content": "my 6 year old loved it. ",
            "review_date": "2019-07-15",
            "source": "rt"
        },
        {
            "content": "Definitely a solid conclusion to a great trilogy. It’s was cute, had a good message, and the animation was stellar. My only complaint it that it gets a bit slow and, for me, was the least gripping of the three films. ",
            "review_date": "2019-07-14",
            "source": "rt"
        },
        {
            "content": "Awesome conclusion in How To Train Your Dragon series and it's one of my favorite Universal Pictures films in 2019.",
            "review_date": "2019-07-14",
            "source": "rt"
        },
        {
            "content": "A good ending to the series, but nothing too spectacular.",
            "review_date": "2019-07-13",
            "source": "rt"
        },
        {
            "content": "they waited years for this lazy, poorly executed film, that offers nothing in the way the other two films delivered humour and compelling story telling. just awful ",
            "review_date": "2019-07-11",
            "source": "rt"
        },
        {
            "content": "A pleasing, satisfying final chapter to an awesome franchise.",
            "review_date": "2019-07-10",
            "source": "rt"
        },
        {
            "content": "great storyline and graphics, but some cheesy writing",
            "review_date": "2019-07-10",
            "source": "rt"
        },
        {
            "content": "Perfect ending for both world. Though we don't want Toothless leave us,it's still the best way to end the story.",
            "review_date": "2019-07-10",
            "source": "rt"
        },
        {
            "content": "How To Train Your Dragon: The Hidden World is a well-rounded finale to Dreamworks's best trilogy, How To Train Your Dragon.  A spectacular spectacle of a film topped with realistic writing & superb animation.  Truly the crowning jewel of the trilogy.  \n",
            "review_date": "2019-07-08",
            "source": "rt"
        },
        {
            "content": "Bye Bye Butterfree Fus RoH Daaah edition plus hiccup gets the naruto ending lol",
            "review_date": "2019-07-08",
            "source": "rt"
        },
        {
            "content": "as a long time lover of the HTTYD-movie series i would say that this movie is a perfect ending to the series. Besides a plot with few flaws, the movie delivers outstanding visuals and amazing character developments. The ending is absolutely perfect and will make every HTTYD-fan, shed a tear or two.\nWould 100% recommend.",
            "review_date": "2019-07-06",
            "source": "rt"
        },
        {
            "content": "Great ending to a great trilogy.",
            "review_date": "2019-07-06",
            "source": "rt"
        },
        {
            "content": "I didn't like the ending",
            "review_date": "2019-07-05",
            "source": "rt"
        },
        {
            "content": "It is good but lacking something. It is not as funny, emotional or deep as the previous two.",
            "review_date": "2019-07-04",
            "source": "rt"
        },
        {
            "content": "pretty good for the most part. ",
            "review_date": "2019-07-03",
            "source": "rt"
        },
        {
            "content": "A good third movie, but a little bit predictable after the previous two movies with similar themes and story lines. Surprised to see my 13 year old daughter and my wife like it more than either myself or my 10 year old son. The strong romantic vibe had a positive impact on the ladies.",
            "review_date": "2019-07-03",
            "source": "rt"
        },
        {
            "content": "Personally I didn’t want to see this movie but boy am I glad I did! Such a beautiful love story and it had a lot of humor throughout! Definitely a must see for families",
            "review_date": "2019-07-03",
            "source": "rt"
        },
        {
            "content": "This is an alright ending to the HTTYD saga. It's the worst movie in all the HTTYD movies and it doesn't live up to the story. The villain I feel like was just thrown in there. The first movie's villain was essential and the second movie's villain was great, but as I said before, this movie's villain was just thrown in there. It is good to see Toothless with the Lightfury and Hiccup with Astrid at the end with their children. I just wish the villain wasn't thrown into it.",
            "review_date": "2019-07-02",
            "source": "rt"
        },
        {
            "content": "it was absolutely incredible it had me laughing and crying.  It was such a beautiful way to end the How To Train Your Dragon trilogy.   I saw it in the theater the day it came out and I just got the DVD recently and have watched it at least fifteen times.   I love the dragon world more then I can express and I love this movie.",
            "review_date": "2019-07-01",
            "source": "rt"
        },
        {
            "content": "Brilliantly crafted. Well ended. Excellent close to the series.",
            "review_date": "2019-06-30",
            "source": "rt"
        },
        {
            "content": "Beautiful and emotionally satisfying. Nothing really groundbreaking here, but I'm glad DreamWorks was able to put a nice bow onto this franchise as it deserves a solid conclusion. ",
            "review_date": "2019-06-29",
            "source": "rt"
        },
        {
            "content": "Actually, I have liked pretty much all of these movies, and this one was no different. There were a lot of corny scenes in this movie, but overall a good edition to this family-based franchise. ",
            "review_date": "2019-06-29",
            "source": "rt"
        },
        {
            "content": "My favorite movie, although I wish it was more like the books, but still the best!",
            "review_date": "2019-06-28",
            "source": "rt"
        },
        {
            "content": "Capitolo deludente, anche se non pessimo. Molto divertenti gli stacchi su Toothless, carino il finale, ma il modo in cui ci si e' arrivati mi suona forzato a causa di alcune goffaggini di scrittura. Villain insopportabile. ",
            "review_date": "2019-06-28",
            "source": "rt"
        },
        {
            "content": "The third installment of How To Train Your Dragon re-emphasizes the bond between Hiccup and Toothless while they both fight towards their ultimate goal(s) and \"destiny\", with Hiccup leading his people, and Toothless, as the alpha dragon, leading the his.\n\nDreamWorks' isn't as polished and refined as Pixar usually is, but The Hidden World, and in fact, the entire How To Train Your Dragon (now) Trilogy has been nothing short of amazing work by the studio that brought us Shrek.\n\nThe Hidden World does have its bad parts, the unnecessary forced jokes, awkward subplots, and characters that serve no purpose other than to prolong the movie (and sometimes to an annoying degree), but what it does good, it does really really really good, near perfect.\n\nThe emotional roller-coaster that is felt not only by Hiccup, but also by Toothless, is effectively transferred to the audience and you cannot help but feel for these two warriors. The plot does borrow a lot from the previous two installments, but as they say, if it ain't broke, don't fix it - and again, the emotional element made the Hidden World what it is, a perfect bittersweet end to the unbreakable bond between boy and dragon.\n\nThat truly is the gist of the whole series - and it again tugs at the heart strings of viewers, in all it's glorious animation.",
            "review_date": "2019-06-28",
            "source": "rt"
        },
        {
            "content": "I've seen this before, but it had a good message.",
            "review_date": "2019-06-27",
            "source": "rt"
        },
        {
            "content": "GREAT MOVIE! the hidden dragon world should have been explored more otherwise fantastic.",
            "review_date": "2019-06-27",
            "source": "rt"
        },
        {
            "content": "The stakes are considerably lower than last time and the title is left unsatisfied, yet the saga of Hiccup and Toothless is satisfyingly concluded because of how The Hidden World hits those crucial emotional notes.",
            "review_date": "2019-06-27",
            "source": "rt"
        },
        {
            "content": "Best picture of 2019",
            "review_date": "2019-06-27",
            "source": "rt"
        },
        {
            "content": "I've been a fan of this series for a long time. I felt like there was just enough of all the characters I loved as this was the last time I'd get to see them in a movie. The ending is beautifully done and I feel like this story shows just how loving and respectful best friends can and should be when their needs are different. The visuals are AMAZING, I saw it multiple times in theaters and still can't get over what I got to see, I wish I could see it the same again. It's too bad we can't relive first viewings of movies.",
            "review_date": "2019-06-27",
            "source": "rt"
        },
        {
            "content": "Like it's predecessors, 'How to Train Your Dragon 3' hits the ground running and never loses its grip on your heart. It's not as effortlessly exhilarating or cohesive as the second one but it maintains the series' signature balance of humanity, laughs and thrills with great characters and really stunning animation. The nefarious and cunning Grimmel is easily the best villain of the series; making up for his somewhat lack of \"clear\" motivation with his strong personality and menace. While the signature juggling of the supporting cast is mostly good with a few terrific standouts, I couldn't help but wish they gave some of them abit more to do (the running gag with Snotlot this time around was abit too weird even if it was humorous). Despite that, it all culminates into a thrillingly satisfying climax; bringing a beautiful end to an absolutely gorgeous animated trilogy! -  9/10 ",
            "review_date": "2019-06-26",
            "source": "rt"
        },
        {
            "content": "It had a fun feel that was consistent with the other movies and the TV show.  ",
            "review_date": "2019-06-25",
            "source": "rt"
        },
        {
            "content": "Great conclusion to the series. For someone who has seen all of the movies it was a special movie.",
            "review_date": "2019-06-25",
            "source": "rt"
        },
        {
            "content": "Perfect ending to an amazing trilogy!",
            "review_date": "2019-06-25",
            "source": "rt"
        },
        {
            "content": "I feel veeeeery much that we've done this dance before now. I definitely didn't hate The Hidden World, the animation's pretty speccy, Toothless is eternally adorable, some of the creature design is pretty cool (especially the new bad guy's beasties) and I appreciate ending a franchise on your own terms. But to me, this is still definitely the low point of the trilogy. Not crap, for sure, but hit on a lot of things I genuinely don't care for.",
            "review_date": "2019-06-24",
            "source": "rt"
        },
        {
            "content": "Toothless is so cute!!!!",
            "review_date": "2019-06-23",
            "source": "rt"
        },
        {
            "content": "Httyd 1 & 2: Totally Amazing \nHttyd 3: So predictable...",
            "review_date": "2019-06-23",
            "source": "rt"
        },
        {
            "content": "I felt very uninterested in some aspects of the movie- namely its writers having to figure out what to do with side characters like Fishlegs, Snotlout, and the twins, as well as with the villain, who I found stereotypical and boring. But I was charmed by its romantic moments, and I was blown away by a potent ending that I would never have predicted.",
            "review_date": "2019-06-23",
            "source": "rt"
        },
        {
            "content": "Not as charming as their predecessor.",
            "review_date": "2019-06-23",
            "source": "rt"
        },
        {
            "content": "one of the best movies i've ever seen",
            "review_date": "2019-06-23",
            "source": "rt"
        },
        {
            "content": "Esta película es bastante entretenida tiene una animación muy buena y una trama muy interesante, buena película para disfrutar con toda la familia ",
            "review_date": "2019-06-21",
            "source": "rt"
        },
        {
            "content": "I cry everytime. Why you gotta do my like that dream works? \nI love how many elements of the books this one uses",
            "review_date": "2019-06-21",
            "source": "rt"
        },
        {
            "content": "After the great writing of 1 and 2 this felt very lazy. ",
            "review_date": "2019-06-19",
            "source": "rt"
        },
        {
            "content": "This movie has Big Problems. When I saw the movie. It was Not emotional. It's just like Ice Age Collision Course.",
            "review_date": "2019-06-19",
            "source": "rt"
        },
        {
            "content": "A well conclusion to this beloved trilogy. This Film is a excellent film to this trilogy making this trilogy one of best trilogies of this decade.",
            "review_date": "2019-06-19",
            "source": "rt"
        },
        {
            "content": "Watched the first one almost as soon as it was in theaters loved how they ended it but it didn't tie up all the loose ends of the franchise such as where was the light fury hiding for so long or why didn't any of the dragons return after leaving did they not care about seeing the humans who fed them? And other questions such as how did they get up and down the massive island cliffs each time or what did they do after the dragons left to rebuild burk it looked like they had nest like houses even though no dragons were there ",
            "review_date": "2019-06-19",
            "source": "rt"
        },
        {
            "content": "The best movie ever period. ",
            "review_date": "2019-06-19",
            "source": "rt"
        },
        {
            "content": "How to Train Your Dragon 3: The Hidden World, the final sequel to this chapter was one AWESOME THRILLER that everyone should see.  This movie had it all, the emotions and thrillers one could ask for especially for an animated movie.  This movie is a total MUST SEE!  It is an ADVENTURE of a LIFETIME you CAN'T miss!",
            "review_date": "2019-06-19",
            "source": "rt"
        },
        {
            "content": "No doubt, best movie of 2019! ",
            "review_date": "2019-06-18",
            "source": "rt"
        },
        {
            "content": "Good ending for Toothless and Hiccup alike. Independence and freedom are what all sentient beings wish for. I like the message and the sacrifice. The babies are super cute too!",
            "review_date": "2019-06-18",
            "source": "rt"
        },
        {
            "content": "Fantastic movie. Older audiences can see the plot from a mile away, but still entertaining. ",
            "review_date": "2019-06-17",
            "source": "rt"
        },
        {
            "content": "Perfect ! Doesn't have any mistakes!",
            "review_date": "2019-06-17",
            "source": "rt"
        },
        {
            "content": "Omg this was a great follow up to the last installment. Loved the ending as well. Would watch it  again",
            "review_date": "2019-06-16",
            "source": "rt"
        },
        {
            "content": "Been a fan of this but the it is kinda predictable, classic plot",
            "review_date": "2019-06-16",
            "source": "rt"
        },
        {
            "content": "The final iteration of the How To Train Your Dragon saga does not disappoint. We have followed Hiccup, Astrid, and the other occupants of Berk throughout their lives as they have aged and learned, and now we see what it means to grow up. A story of love and what love means, The Hidden World ends the saga the way it began: with tears of happiness and heartbreak and with knowledge of the world as it really is. ",
            "review_date": "2019-06-15",
            "source": "rt"
        },
        {
            "content": "It was dissapointing to see the series discard the messages of the last two movies as well as the TV series just to end it the same way as the books that the movies have split from storywise from the start. It it still beautiful but the heart just isn't there anymore. Niether Hickup or Toothless act like themselves.",
            "review_date": "2019-06-15",
            "source": "rt"
        },
        {
            "content": "Perhaps the weakest film in the trilogy. The villain is forgettable, the White Fury plot line did not interest me, the pacing was off. Only good thing I can say about this movie is the animation was spectacular, that's it.",
            "review_date": "2019-06-13",
            "source": "rt"
        },
        {
            "content": "Loved it almost as much as the first few. Fun, funny, loveable, entertaining.",
            "review_date": "2019-06-12",
            "source": "rt"
        },
        {
            "content": "Perfect ending to a beloved trilogy. ",
            "review_date": "2019-06-12",
            "source": "rt"
        },
        {
            "content": "For me, this series really lost its charm after the first one. Didn't they already find a hidden world of dragons in the second one? And they had to find another hidden world for this one? And I also compared the last movie to Lord of the Rings, and I have the same comment for this one as well. The ending was just like the third Lord of the Rings-- it had multiple endings. It just kept going. I experienced a climax, a resolution, and then multiple denouements. I am adding points because the climax made me smile. I'm adding more points for the beautiful iridescent renderings. And I'm deducting points for predictable plot points.",
            "review_date": "2019-06-11",
            "source": "rt"
        },
        {
            "content": "Very good for children and adults alike.",
            "review_date": "2019-06-11",
            "source": "rt"
        },
        {
            "content": "Entertaining, but not as good as the first one.",
            "review_date": "2019-06-11",
            "source": "rt"
        },
        {
            "content": "My 5yo daughter LOVED IT! The love story and subplots were touching, funny and heartfelt. We liked the introduction of new characters, as well!",
            "review_date": "2019-06-10",
            "source": "rt"
        },
        {
            "content": "Even tertiairy characters are fleshed out well enough to create a plot with true reason. The rendering for the entire movie was gracious and pleasing for everyones eye! I loved everything about the film. ",
            "review_date": "2019-06-09",
            "source": "rt"
        },
        {
            "content": "Awful. Loved the first two but this was a disjointed mess. The writing was terrible and there was absolutely no joy in this train wreck.",
            "review_date": "2019-06-09",
            "source": "rt"
        },
        {
            "content": "A great way to end the trilogy. An emotional rollercoaster.",
            "review_date": "2019-06-09",
            "source": "rt"
        },
        {
            "content": "An amazing, emotional conclusion to a series that seriously deserved more recognition.",
            "review_date": "2019-06-09",
            "source": "rt"
        },
        {
            "content": "Must have next movie",
            "review_date": "2019-06-08",
            "source": "rt"
        },
        {
            "content": "Pretty good ending to the trilogy",
            "review_date": "2019-06-08",
            "source": "rt"
        },
        {
            "content": "Fun close to the trilogy. The animation looks great. I liked the story and the protagonist. Something felt missing though and to be honest I can’t put my finger on what it is.",
            "review_date": "2019-06-08",
            "source": "rt"
        },
        {
            "content": "enjoyable. not a ton of conflict. just kind of a feel good.",
            "review_date": "2019-06-08",
            "source": "rt"
        },
        {
            "content": "Great way to wrap up the trilogy",
            "review_date": "2019-06-07",
            "source": "rt"
        },
        {
            "content": "Beautiful, bittersweet and masterfully constructed. How to Train Your Dragon: The Hidden World pulls off an amazing ending to an equally amazing franchise...",
            "review_date": "2019-06-07",
            "source": "rt"
        },
        {
            "content": "The heartwarming conclusion to an original and innovative trilogy. It's a story of love, friendship, and sacrifice, and ends with a strong message.",
            "review_date": "2019-06-07",
            "source": "rt"
        },
        {
            "content": "Just as adorable as possible. Lovely little romantic dragons 😘",
            "review_date": "2019-06-06",
            "source": "rt"
        },
        {
            "content": "Such a cute, family movie 🥰 My 5 & 2 yr olds, loved it!!!! ❤️",
            "review_date": "2019-06-06",
            "source": "rt"
        },
        {
            "content": "For me, (my favourite film is httyd), this film marked a perfect ending to the franchise. Endings are hard, but all good things must come to an end, which many other franchises don't seem to grasp,",
            "review_date": "2019-06-05",
            "source": "rt"
        },
        {
            "content": "great ending to a trilogy that I know my kids and there kids can enjoy time again.",
            "review_date": "2019-06-05",
            "source": "rt"
        },
        {
            "content": "piece of trash. villain should win and dragons all die. this is a better ending to your garbage saga",
            "review_date": "2019-06-05",
            "source": "rt"
        },
        {
            "content": "Ótimo filme,não chega a ser mais emocionante que o 1 ,mas fecha a saga em grande estilo!",
            "review_date": "2019-06-05",
            "source": "rt"
        },
        {
            "content": "This was a great ending to this series if it is. I loved the animation and acting, and I have enjoyed this series. It has had its time and was amazing. A",
            "review_date": "2019-06-04",
            "source": "rt"
        },
        {
            "content": "There is so much to see in every frame. I watched it with many rewinds, then replayed the entire movie. Gorgeous animation.",
            "review_date": "2019-06-04",
            "source": "rt"
        },
        {
            "content": "great ending of a trilogy of this movie, amazing🙏",
            "review_date": "2019-06-04",
            "source": "rt"
        },
        {
            "content": "Our family really enjoyed this movie.  Great family film and ending to this series.",
            "review_date": "2019-06-03",
            "source": "rt"
        },
        {
            "content": "Absolutely brilliant end to the trilogy!",
            "review_date": "2019-06-03",
            "source": "rt"
        },
        {
            "content": "This is filled with such Love and classic story telling. ",
            "review_date": "2019-06-03",
            "source": "rt"
        },
        {
            "content": "A beautiful ending to a magnificent film, we see Hiccup and Toothless grow as we say goodbye to characters we fell in love with over 3 films, and a cartoon series",
            "review_date": "2019-06-03",
            "source": "rt"
        },
        {
            "content": "Amazing ending to a great Pixar trilogy!! Made me have all of the feels to end this great saga.",
            "review_date": "2019-06-03",
            "source": "rt"
        },
        {
            "content": "It's unfortunate that the final entry in the How to Train Your Dragon trilogy is the most underwhelming. Regardless, it brings the story full circle in emotionally satisfying, albeit rather uninteresting ways.",
            "review_date": "2019-06-02",
            "source": "rt"
        },
        {
            "content": "What a great way to end the trilogy! I even loved the epilogue.",
            "review_date": "2019-06-02",
            "source": "rt"
        },
        {
            "content": "Great Trilogy movie.  They completely made this entertaining and enjoyable even as an adult.",
            "review_date": "2019-06-02",
            "source": "rt"
        },
        {
            "content": "I so wanted to love this movie! The first was so good! This one just couldn't do it for me...",
            "review_date": "2019-06-02",
            "source": "rt"
        },
        {
            "content": "Never watch it. It's a complete waste of your day. It's an unsuccessful, mediocre and idiotic franchise. I've never liked any of there movies",
            "review_date": "2019-06-02",
            "source": "rt"
        },
        {
            "content": "How to Train Your Dragon: The Hidden World is a suitably poignant ending for the How to Train Your Dragon Trilogy, though it doesn't quite meet the expectations created by the previous two.",
            "review_date": "2019-06-02",
            "source": "rt"
        },
        {
            "content": "This movie is awesome. It has stunning visuals and epic storytelling. You NEED to get this movie on Blu-Ray.",
            "review_date": "2019-06-01",
            "source": "rt"
        },
        {
            "content": "Love this movie! My 7 yr old daughter and I love Part 1 and 2 and we love all the series. This is just a great ending to it all. If only it never ends",
            "review_date": "2019-06-01",
            "source": "rt"
        },
        {
            "content": "Awesome ending to this trilogy.",
            "review_date": "2019-06-01",
            "source": "rt"
        },
        {
            "content": "This movie was overrated. Boring",
            "review_date": "2019-05-31",
            "source": "rt"
        },
        {
            "content": "Loved this adorable movie. ",
            "review_date": "2019-05-31",
            "source": "rt"
        },
        {
            "content": "Fun show. A bit predictable. Beautiful scenes and top notch animation. I enjoyed it but was not thrilled by it. ",
            "review_date": "2019-05-31",
            "source": "rt"
        },
        {
            "content": "I love this series. so very sad that it's ending. Great way to end it.",
            "review_date": "2019-05-31",
            "source": "rt"
        },
        {
            "content": "A satisfying and heartfelt end to the franchise that has good humour and visuals. The main characters never seem to be in real danger but that's expected from a movie more geared towards younger audiences. If the movie didn't get to your heart during the final scene it certainly did during the credits. ",
            "review_date": "2019-05-31",
            "source": "rt"
        },
        {
            "content": "A stunning CGI quality and epic theme that they keep it on run",
            "review_date": "2019-05-31",
            "source": "rt"
        },
        {
            "content": "As good as an animated movie can get",
            "review_date": "2019-05-30",
            "source": "rt"
        },
        {
            "content": "Nice end to a trilogy that kept up its quality the whole way through. ",
            "review_date": "2019-05-28",
            "source": "rt"
        },
        {
            "content": "It was really hard to watch. They should have stopped on the first one",
            "review_date": "2019-05-28",
            "source": "rt"
        },
        {
            "content": "I loved httyd it is sad to see it end already.",
            "review_date": "2019-05-28",
            "source": "rt"
        },
        {
            "content": " If I could change anything about this movie I would change Hiccup's voice to a real man's voice, add more humor, change the villin's lame motive, and shorten the time by 15 minutes. I hate Hiccup's voice because even though he is a full grown man he still sounds like a prepubescent teen. The humor at best was dry on most counts except Ruffnut's (whom of which will probably become your favorite character by the end of the movie). The villin's motive was really lame (when you watch it you'll know what I am talking about).",
            "review_date": "2019-05-28",
            "source": "rt"
        },
        {
            "content": "Solid final chapter. Everyone grows up, gets married and has kids.",
            "review_date": "2019-05-27",
            "source": "rt"
        },
        {
            "content": "great ending to a great series of movie. ",
            "review_date": "2019-05-27",
            "source": "rt"
        },
        {
            "content": "An incredibly disappointing and weak ending to the overall very strong movie franchise. I wouldn't say it's a bad movie, but I'm not hesitant to call it a very unsatisfactory conclusion.",
            "review_date": "2019-05-27",
            "source": "rt"
        },
        {
            "content": "Made me cry tears of happiness at the end, I just love all three of these movies!!!",
            "review_date": "2019-05-27",
            "source": "rt"
        },
        {
            "content": "its good, could have been waaaay better.",
            "review_date": "2019-05-27",
            "source": "rt"
        },
        {
            "content": "I LOVED it!!!!!!!!!!!!!!!!!!",
            "review_date": "2019-05-27",
            "source": "rt"
        },
        {
            "content": "Cute, heart warming story!",
            "review_date": "2019-05-27",
            "source": "rt"
        },
        {
            "content": "Felt it didn't offer anything new and was not needed, the humor was not so great, the plot and the adventure seemed between lame and lazy. ",
            "review_date": "2019-05-27",
            "source": "rt"
        },
        {
            "content": "this movie was a horrible way to end the series don't listen to any of the other opinions this was an absolute piece of garbage  ",
            "review_date": "2019-05-27",
            "source": "rt"
        },
        {
            "content": "This movie was very enjoyable and a pleasure to be watching until that ending happened. HATED that ending ",
            "review_date": "2019-05-27",
            "source": "rt"
        },
        {
            "content": "A satisfying end to an amazing trilogy filled with fun and touching moments.",
            "review_date": "2019-05-27",
            "source": "rt"
        },
        {
            "content": "The score, the story, the animation, the characters. Wow. It’s been a while since an animated movie actually brought me to tears. See this one if you can. ",
            "review_date": "2019-05-26",
            "source": "rt"
        },
        {
            "content": "Inovating, added more cute dragons, worth your time in the movies. ",
            "review_date": "2019-05-26",
            "source": "rt"
        },
        {
            "content": "I thoroughly enjoyed this film. I am anticipating for the next film, but what I am concerned about is that if there is a next film, I believe, 100% that any film afterwards would take away from the value and the integrity of the film, and be another franchise Hogwarts. ",
            "review_date": "2019-05-26",
            "source": "rt"
        },
        {
            "content": "This shit made me cry real actual man tears. I have watched that boy grow up through movies and shows and art and i have only loved it all the more for everything these movies will always continue to give me.",
            "review_date": "2019-05-26",
            "source": "rt"
        },
        {
            "content": "Beautiful and emotionally satisfying. Nothing really groundbreaking here, but I'm glad DreamWorks was able to put a nice bow onto this franchise as it deserves a solid conclusion. ",
            "review_date": "2019-05-26",
            "source": "rt"
        },
        {
            "content": "great ending for the trilogy!",
            "review_date": "2019-05-26",
            "source": "rt"
        },
        {
            "content": "Epic conclusion to the HTTYD saga. Graphics are better then ever and great storyline. No spoilers but I was not expecting the ending!",
            "review_date": "2019-05-26",
            "source": "rt"
        },
        {
            "content": "Took my kids to see this movie in 3D. It was a great movie. My kids loved it and so did I.",
            "review_date": "2019-05-25",
            "source": "rt"
        },
        {
            "content": "Awesome family movie. Would watch again.",
            "review_date": "2019-05-25",
            "source": "rt"
        },
        {
            "content": "Exciting as always with a new story to unravel and a great end to this series, im just pretty sure they did the animation differently, only thing I would've changed is to go back to the original animation style but obviously remastered in a way.",
            "review_date": "2019-05-25",
            "source": "rt"
        },
        {
            "content": "Hmm.. As a movie itself is good. But as a conclusion of a trilogy, it could be better... Too much continuity errors..",
            "review_date": "2019-05-25",
            "source": "rt"
        },
        {
            "content": "Spoiler: WARNING!\nGonna be real honest. I understand why they did what they did, but the ending really made me angry. I think I might have even cried.",
            "review_date": "2019-05-25",
            "source": "rt"
        },
        {
            "content": "A nice to conclusion to the series",
            "review_date": "2019-05-25",
            "source": "rt"
        },
        {
            "content": "It was an amazing ending to an amazing trilogy. The whole family was in tears. ",
            "review_date": "2019-05-25",
            "source": "rt"
        },
        {
            "content": "Il degno finale di una bellissima trilogia!",
            "review_date": "2019-05-25",
            "source": "rt"
        },
        {
            "content": "It's formulaic but it works.",
            "review_date": "2019-05-25",
            "source": "rt"
        },
        {
            "content": "Another fun adventure in this world. Wraps everything up in a satisfying way. Really good villain.",
            "review_date": "2019-05-25",
            "source": "rt"
        },
        {
            "content": "THEY HAVE TO MAKE A 4!!!",
            "review_date": "2019-05-24",
            "source": "rt"
        },
        {
            "content": "It is a good movie, but it is not the epic end, I was waiting. I think this movie is the \"worst\" of HOW TO TRAIN YOUR DRAGON, but is a great movie. Unfortunately, the vilan is verry bad. He is good like the vilan of the second movie, or like the dragon threat of the first. But the charaters still good, and the story is acceptable.",
            "review_date": "2019-05-24",
            "source": "rt"
        },
        {
            "content": "I love this movie... my favorite from all three How To Train Your Dragon movies. I highly recommend it. Perfect friend movie, perfect date movie and perfect family movie. ",
            "review_date": "2019-05-24",
            "source": "rt"
        },
        {
            "content": "An epic finale to a epic film trilogy.",
            "review_date": "2019-05-24",
            "source": "rt"
        },
        {
            "content": "a little dispoointed, no story short movie nothing to it just another movie add it to franchise",
            "review_date": "2019-05-24",
            "source": "rt"
        },
        {
            "content": "Exceptional!  inspirational Great family fun",
            "review_date": "2019-05-24",
            "source": "rt"
        },
        {
            "content": "very good movie, I cried at the end",
            "review_date": "2019-05-24",
            "source": "rt"
        },
        {
            "content": "I am disappointed at how average this movie is. Don't get me wrong - it's still a good movie, but it pales in comparison with the first and the second part.",
            "review_date": "2019-05-23",
            "source": "rt"
        },
        {
            "content": "Great movie. Amazing way to wrap up the story.",
            "review_date": "2019-05-23",
            "source": "rt"
        },
        {
            "content": "\nUsually Dreamworks has bad track records when it comes to sequels, and an even worse one when it comes to trilogies. The 2nd one is usually ok, with the occasion of it being better, but then somehow, the 3rd one has to ruin it. This is happily, not the case here. The \"Dragons\" franchise seems to be the magic one for Dreamworks, with all of them being just as good or better than the first one. This has just as much heart and drama as the first 2, and was surprisingly mature. (I don't mean \"inappropriate\", it's still a kids' film, but there are themes of letting things go, and growing up, about the same level as \"Toy Story 3\".) The film's target audience is definitely those of us who were kids when the first one came out, and are now adults. (It's hard to believe that it's been almost 10 years since the first movie!) This film speaks to the ones who are entering adulthood (somewhere in their early to mid 20s). Like I said, kids can still see it, but the ones who will get the most emotional punch from it are the 20s crowd. (Much like Toy Story 3. I'm seeing a pattern here). Don't go in expecting too many funny moments like the typical Dreamworks fare. It still has some, but they are few and far between. This film's main goal is to make you cry bittersweet tears of both happiness and sadness at the same time, and it succeeds tremendously. This is one of the most heartfelt movies Dreamworks has ever done. If this isn't nominated for \"Best Animated Film\" at the 2020 Oscars, I will be very disappointed. ",
            "review_date": "2019-05-23",
            "source": "rt"
        },
        {
            "content": "Oh man, i can't believe this trilogy actually ended. This movie had me in tears! What a way to go.",
            "review_date": "2019-05-23",
            "source": "rt"
        },
        {
            "content": "The best movie of the franchise. The animation is an out of this world and the story is more that we were waiting for. ",
            "review_date": "2019-05-23",
            "source": "rt"
        },
        {
            "content": "I loved 1st one in the trilogy",
            "review_date": "2019-05-23",
            "source": "rt"
        },
        {
            "content": "There's something that doesn't perfectly fit with the others movies, but it's an amazing ending.",
            "review_date": "2019-05-23",
            "source": "rt"
        },
        {
            "content": "Good movie but nowere as good as tye 1st. Hioe they dont make anymore",
            "review_date": "2019-05-22",
            "source": "rt"
        },
        {
            "content": "They did an awesome job on this one, if you enjoyed the other Dragon movies this won't dissappoint",
            "review_date": "2019-05-22",
            "source": "rt"
        },
        {
            "content": "The best out of the three. Seals the franchise with a satisfying ending. The movie strikes a perfect balance of social commentary, a mythical story and well timed comedy.",
            "review_date": "2019-05-22",
            "source": "rt"
        },
        {
            "content": "As a fan of the other films this was a satisfying end to the trilogy.",
            "review_date": "2019-05-21",
            "source": "rt"
        },
        {
            "content": "it was a fairly good film, but the end parts went way, way too fast. like it was like, bing, bam, boom, it's over now.  the second one felt like a better film. it was more well paced.",
            "review_date": "2019-05-21",
            "source": "rt"
        },
        {
            "content": "Entediante, Ã (C) bonito de se ver a arte e design dos personagens e o carisma impregnado, contudo, o desenrolar da histÃ³ria Ã (C) previsÃ­vel de forma que nÃ£o tem nada que impressione ou se mostre minimamente interessante, um verdeiro filme de sessÃ£o da tarde para assistir e passar o tempo quando nÃ£o se tem nada pra fazer.",
            "review_date": "2019-05-21",
            "source": "rt"
        },
        {
            "content": "Awesome movie with great story and good graphics.",
            "review_date": "2019-05-20",
            "source": "rt"
        },
        {
            "content": "Tied up the franchise perfectly. One of the few franchises to have three really good movies. I got everything out of it I wanted. A definite must see.",
            "review_date": "2019-05-20",
            "source": "rt"
        },
        {
            "content": "Same movie again but good",
            "review_date": "2019-05-19",
            "source": "rt"
        },
        {
            "content": "Hidden World is a perfect finale to the trilogy. Engaging throughout, it is emotionally powerful, while on the visual side, it stuns. It looks like it's time to say goodbye, but we want a fourth.",
            "review_date": "2019-05-19",
            "source": "rt"
        },
        {
            "content": "A great ending to the whole series. Better than the other ones",
            "review_date": "2019-05-17",
            "source": "rt"
        },
        {
            "content": "Welldone Hiccup, you did your trilogy without the actual hiccup....pun intended.",
            "review_date": "2019-05-17",
            "source": "rt"
        },
        {
            "content": "\"How To Train Your Dragon\" has always felt like this sophisticated story that has so much soul and a story to share. This last story in the trilogy sure has all the elements the first two movies share, but it lacks the soul. \"The Hidden World\" is a visual masterpiece, and a really good movie. It is action-packed and is fast-paced, it tells a really satisfying story and plays as a good farewell to the franchise, but it never hits all the cords that the previous movies managed to hit. It feels like they sacrificed some of its soul for action but they never overdid it. \"The Hidden World\" is still a good movie, a beautiful movie, but for me it never reached the greatness of the first one.",
            "review_date": "2019-05-13",
            "source": "rt"
        },
        {
            "content": "A satisfying conclusion to my most beloved series. Although the story was not as compelling as its predecessors.",
            "review_date": "2019-05-12",
            "source": "rt"
        },
        {
            "content": "I'm ashamed to admit I'm of the same species as the ones who like this piece of garbage. I loved the other two films and I never thought I would wish this hard for a movie to end until I saw this one. I literally wish this movie was never made.",
            "review_date": "2019-05-12",
            "source": "rt"
        },
        {
            "content": "Chorei no final. Emocionante.",
            "review_date": "2019-05-11",
            "source": "rt"
        },
        {
            "content": "Pretty good. Seemed to have a lot of fuller!",
            "review_date": "2019-05-10",
            "source": "rt"
        },
        {
            "content": "A very fitting end to a great animated trilogy, \"The Hidden World\" stays true to everything that made the first two films such a success. With great animation and clever humor, the film soars high, delivering a wonderful message about overcoming adversity and believing in yourself. By the end, you'll be cheering for a world dragons and people where no one is named Targaryen.",
            "review_date": "2019-05-10",
            "source": "rt"
        },
        {
            "content": "Amazing movie to end the series.",
            "review_date": "2019-05-10",
            "source": "rt"
        },
        {
            "content": "How to train your dragon: The hidden world is the best movie I have seen since 2014 (how to train your dragon 2) . From its intricate detail in the wind, the hidden world, the characters and the personalities. The incredible new world from Valka's dragon sanctuary to this bioluminesent under water dragon kingdom. Every detail has been accounted for. The amazing work done by Dean Deblois and the dreamworks team is amazing not to mention an incredible proformance done by original cast such as Jay Baruchel, America Ferrera, Jonah Hill, Kristen Wiig, Craig Fergurson, Gerard Butler, Kit Harington and Cate Blanchett to new and amazing cast such as F. Murrey Abraham and Justin Rupple. Such an amazing movie that nobody of any ages should miss out on!!!",
            "review_date": "2019-05-10",
            "source": "rt"
        },
        {
            "content": "This film is completely boring and loses sight of what it originally was. This film focuses on the boy's relationship with the night hawk. I don't go to the movies to see human relationships with fictional animals and how those dynamics play out. I go to see movies to see events that I have not seen before and are beyond my imagination. Relationships are very...meh and I couldn't care less, That is not a big enough draw to bring me to a movie. There has to be action, there has to be high stakes. There basically is no eventful action on screen with any kind of stakes on the line. This is completely pathetic and boring. Why could the other 2 Dragon movies achieve both action and excitement and pay service to human emotion and relationships? This one completely fails at the action and excitement.",
            "review_date": "2019-05-09",
            "source": "rt"
        },
        {
            "content": "Aunque no tan buena como las dos anteriores entregas, tanto a nivel tÃ (C)cnico como emocional el final de la trilogia es satisfactorio.",
            "review_date": "2019-05-08",
            "source": "rt"
        },
        {
            "content": "the film was very good and I hope they make more TV episodes and at the end it was very sad them to meeting up again",
            "review_date": "2019-05-07",
            "source": "rt"
        },
        {
            "content": "I love these movies sad their over.... you'll love it trust me ",
            "review_date": "2019-05-07",
            "source": "rt"
        },
        {
            "content": "The third installment of the dragon riders series is another step forward in animation, creating amazing images, especially of landscapes and flocks of flying creatures. As for the story, it doesn't exactly reinvent the wheel. The first two films felt fresher, more surprising. It's still nice to revisit these characters and follow them around a little more. The super sweet ending is probably the strongest part of the film.",
            "review_date": "2019-05-07",
            "source": "rt"
        },
        {
            "content": "nice movie sad but enjoyable",
            "review_date": "2019-05-06",
            "source": "rt"
        },
        {
            "content": "Ah ,well. How to train your dragon 3 is quite an interesting way to finish things up. I think. Eventhough it had a cute plot line that many teens would get dragged into especially the female kind...there's also alot of action and drama going on to entice the entire audience as a whole. It is only at the very end that you feel sad. And most of that sadness is because you realize that even you are getting older just as the characters are. Overall a good movie.",
            "review_date": "2019-05-05",
            "source": "rt"
        },
        {
            "content": "what a great movie to end a TRILOGY ",
            "review_date": "2019-05-04",
            "source": "rt"
        },
        {
            "content": "This movie did not disappoint!  The same humor we have come to love but also packed with some very touching moments. They even managed to stay very family friendly unlike most \"children's movies\" today.",
            "review_date": "2019-05-04",
            "source": "rt"
        },
        {
            "content": "Way over-rated. This feels like it should have gone straight to DVD, or just been on Disney. While most Pixar is able to make films that both adults and kids can enjoy, Dreamworks just can't. If you're over the age of 12, you may want to bring an insulin shot, its just pure sugar. Bleh.",
            "review_date": "2019-05-04",
            "source": "rt"
        },
        {
            "content": "Absolutly breath-taking. The ending was very different than I thought the movie was going to turn out. Very sad ending, but a happy one. Glad toothless got to fly freely again, but when the dragons all left I almost cried.  I can feel their pain, I know what it's like when you love something, the best thing to do, is set it free.",
            "review_date": "2019-05-03",
            "source": "rt"
        },
        {
            "content": "good movie. some of it could have been thought out a little better. was too samey as two. still good movie though. much better than most dream works.",
            "review_date": "2019-05-02",
            "source": "rt"
        },
        {
            "content": "this film was a great follow up and a final movie in the trilogy! sad to see it end! my wife and I cried knowing we took our oldest kids when they were little and now have so little time with them. seriously this film is fantastic! ",
            "review_date": "2019-05-01",
            "source": "rt"
        },
        {
            "content": "I always remember this movie the rest of my life and can't wait to  looking forward to the near future. Please dreamworld please create another how to train your dragon.",
            "review_date": "2019-04-30",
            "source": "rt"
        },
        {
            "content": "Sad to say that, as a fan from the beginning, this was definitely the weakest in the franchise. However, I thoroughly enjoyed it nonetheless",
            "review_date": "2019-04-30",
            "source": "rt"
        },
        {
            "content": "Nice animation, and great ending",
            "review_date": "2019-04-29",
            "source": "rt"
        },
        {
            "content": "A decent finale to the franchise and an emotional movie at times. Again the visuals are great and there is some enjoyment to be had here. However, the quantity of unnecessary side characters with annoying contributions added little in the way of humour or entertainment to the film. The film also fails to offer anything fresh to the trilogy, other than a terrific villain, voiced by the wonderful F. Murray Abraham. It will be enough to pacify the fans of the series but for me, the high standards of animated movies were not met in this one and I think it will most likely be forgotten in a year that has brought us some serious hard hitters and will yet bring us Toy Story 4.",
            "review_date": "2019-04-29",
            "source": "rt"
        },
        {
            "content": "Our family loves DreamWorks and fell in love with the story about a boy and a dragon. This third installment had us in both tears of joy and sadness. Beautiful ending and would like to thank DreamWorks for making a movie for the Family to enjoy and not push some agenda.",
            "review_date": "2019-04-28",
            "source": "rt"
        },
        {
            "content": "The first movie of this series was AMAZING! But the sequels never lived up to it. ",
            "review_date": "2019-04-28",
            "source": "rt"
        },
        {
            "content": "Left the cinema with a warm and fuzzy feeling. An engaging and satisfying conclusion (I assume) to a funny and imaginative story.",
            "review_date": "2019-04-28",
            "source": "rt"
        },
        {
            "content": "Not as good as the first but much better than the 2nd. Really enjoyed it. ",
            "review_date": "2019-04-27",
            "source": "rt"
        },
        {
            "content": "Great movie. better than the second one",
            "review_date": "2019-04-27",
            "source": "rt"
        },
        {
            "content": "Absolutely love this trilogy and this one did not disappoint! Amazing :) ",
            "review_date": "2019-04-27",
            "source": "rt"
        },
        {
            "content": "So sad! But so funny ",
            "review_date": "2019-04-26",
            "source": "rt"
        },
        {
            "content": "With a fast-paced and fun story line, The Hidden World was a great way to wrap up the trilogy that has tons of heart.",
            "review_date": "2019-04-25",
            "source": "rt"
        },
        {
            "content": "Amazing Movie! Made me cry even the second time I watched it",
            "review_date": "2019-04-25",
            "source": "rt"
        },
        {
            "content": "HOW TO TRAIN YOUR DRAGON: THE HIDDEN WORLD stumbles with its third entry of this franchise even though it had a strong message to deliver. The plot feels too simple with not enough emotional weight, resulting in a film that is enjoyable but weak.",
            "review_date": "2019-04-25",
            "source": "rt"
        },
        {
            "content": "This is a fantastic movie that is a part of a fantastic trilogy. The animation is spectacular, it's funny, it has exciting action sequences, a brilliant musical score and a talented voice cast that bring great light to the characters. I will say, i do consider this the weakest of the three. But, like what chris stuckmann said in his review of HTTYD3, its the same case as Return of the Jedi, which is a fantastic movie but is the weakest of the original star wars trilogy. This is that same case. So, just because its not as good as the first two films isnt a disservice to the film. Its an amazing movie that, at the bare minimum, deserves a nomination for Best Animated Feature ",
            "review_date": "2019-04-24",
            "source": "rt"
        },
        {
            "content": "I give full stars. AMAZING movie and a bitter sweet ending but very satisfying. Leaves you hopeful for more movies but all good thoughts in ending!",
            "review_date": "2019-04-24",
            "source": "rt"
        },
        {
            "content": "A wonderful way to end an awsome trilogy. Indeed this movie has tempo and emotions in it. Since the very first beginning of this trilogy both sides want to live in peace and now they are live in peace. Without seperating from each other.",
            "review_date": "2019-04-24",
            "source": "rt"
        },
        {
            "content": "Didn’t like it at all ... Boring!",
            "review_date": "2019-04-23",
            "source": "rt"
        },
        {
            "content": "A nice end to a great trilogy ",
            "review_date": "2019-04-22",
            "source": "rt"
        },
        {
            "content": "It's the best movie ever",
            "review_date": "2019-04-22",
            "source": "rt"
        },
        {
            "content": "Universal DreamWorks",
            "review_date": "2019-04-21",
            "source": "rt"
        },
        {
            "content": "This is one of those rare series that really worked from the first movie to the last, These movies are underrated and should have gotten much more notice.\n\nThe animation is excellent, I just finished watching the first movie and the difference is night and day.\n\nGreat story line and voice active, The villian felt like a place holder though, This movie was much more about the friendship between Toothless and Hiccup.",
            "review_date": "2019-04-21",
            "source": "rt"
        },
        {
            "content": "Great family movie, fun, awesome graphics.",
            "review_date": "2019-04-21",
            "source": "rt"
        },
        {
            "content": "DreamWorks' How To Train Your Dragon: Hidden World is the best movie of 2019, so far. This movie has something for all ages. It's filled with lots of action, surprises and humor. This full length animation, co-written and directed by Dean DeBlois, is a definite must see! \n\nFollowing the format of any great adventure, screenwriters DeBlois and Cressida Cowell, include everything needed to keep the continuity flowing from the first installment of How to Train Your Dragon to this one. In what is supposed to be the last movie of this trilogy, we see Hiccup, now as the spirited ruler of Berk, protector of the dragons and boyfriend of his longtime friend, Astrid. Hiccup discovers that Toothless, his best bud, is not the only Night Fury alive. He learns that danger is coming and that the only option of surviving is to seek out the Dragon Utopia that his late father once spoke of before a hired tyrant named Grimmel finds it first. There's lots of fire, fighting, roaring, funny bits and mushy stuff too, but you have to watch it to find out who gets the best of who. \n\nCinematographer, Gil Zimmerman, is terrific at laying out the scenes, which help the viewers understand the story. We get to see how the Vikings really feel about their dragons and what happens when Hiccup finally meets his match. Every moment feeds off the first and excitement is built off of reflections from the first two movies. The production designers and art directors help keep viewers connected to the characters by giving us realistic scenes and sets that capture you with bright lights and strong graphic details. When darkness comes, critical moments become more authentic. When there's action, you can't help but stay focused. Toothless' upgrades and the new, much larger dragons are epic!\n\nJay Baruchel is super cool as Hiccup, my favorite character. He's grown, has the best dragon ever, is Chief of the Vikings and everyone loves him, except the Night Fury Slayer and those dragon captors. He has crazy friends like Tuffnut & Ruffnut, who keep you laughing throughout the movie. Hidden World is a screen adaptation of the book series by children's author, Cressida Cowell. It sends you on a fun journey with some curious characters with strange outlooks on life. These anthropomorphic characters make you forget that you are actually watching an animation.\n\nLessons to take with you after seeing this flick are to make good choices and to allow others to do the same thing, even it doesn't benefit you. I give DreamWorks' How to Train Your Dragon: Hidden World 5 out of 5 stars and recommend it for ages 3 to 18, as well as adults. It's one film for everybody! Grab your friends and parents and get to your local theater for the premiere, February 22, 2019. Remember to like and subscribe to our channel. Until next time, I'm Brandon for KIDS FIRST! Film Critics. That's a wrap. Peace out!    \n",
            "review_date": "2019-04-20",
            "source": "rt"
        },
        {
            "content": "The 2nd movie is better, but that was a pretty high bar. The 3rd one is still amazing. An emotional ending to an amazing franchise. Sure the ending is a bit sad, but sometimes goodbyes are hard. That is life. This trilogy is by far the best thing Dreamworks has ever put out. Goodbye old friends, thanks for the great addition to my childhood!",
            "review_date": "2019-04-19",
            "source": "rt"
        },
        {
            "content": "Tear jerking to say the least. A beautiful film with the bitter sweet message of letting go. A sad but necessary conclusion to a phenomenal trilogy about friendship and the hardships of life.",
            "review_date": "2019-04-19",
            "source": "rt"
        },
        {
            "content": "Love this film so much! Great job dreamworks 😊😊",
            "review_date": "2019-04-19",
            "source": "rt"
        },
        {
            "content": "I love this trilogy! This film was thoughtful and made me cry, beautiful story from first and second film to this one. ",
            "review_date": "2019-04-19",
            "source": "rt"
        },
        {
            "content": "I love this movie so much!!! it was so sad and amazing KEEP GOING HTTYD ;-;",
            "review_date": "2019-04-18",
            "source": "rt"
        },
        {
            "content": "animation how to train your dragon is the best animation",
            "review_date": "2019-04-18",
            "source": "rt"
        },
        {
            "content": "felt like this pails in comparison to the others ",
            "review_date": "2019-04-17",
            "source": "rt"
        },
        {
            "content": "There's a dragon killer on the loose, professional, relentless, indefatigable, out to kill all the dragons he can. Can the team stop him before he succeeds? With loads of shots of dragons gracefully gliding through white and puffy clouds,, this screen goodbye to the series, and to the fans who love it, is rife with nods to friendship together with self-determinism. The experience is not Toy Story 3, but still is enjoyable.",
            "review_date": "2019-04-17",
            "source": "rt"
        },
        {
            "content": "This is by far the best How to Train Your Dragon movie. So cute and beautiful. The ending is so sad though and I wish it was different but still, super super beautiful and amazing.",
            "review_date": "2019-04-17",
            "source": "rt"
        },
        {
            "content": "The movie in general kinda copied the 2nd movie, but the ended so beautifully. What made me cry was the fact that this was the end of a story that started when I was 3 years old. I hope that they made a live action version of the trilogy in the future.",
            "review_date": "2019-04-17",
            "source": "rt"
        },
        {
            "content": "I dont like to think about the vast empty sea that is space. the thought that we may be alone in endless black nothingness with only planets in between scares me. Haven't seen the movie btw",
            "review_date": "2019-04-17",
            "source": "rt"
        },
        {
            "content": "Best animation film of 2019 so far gonna be hard to beat it   ten out of ten amazing film great for kids or adults alike",
            "review_date": "2019-04-16",
            "source": "rt"
        },
        {
            "content": "This amazing sequel was a highly anticipated movie and I think it ended perfectly. The music scores really helped get the emotions out during scenes specially when hiccup and toothless were saying goodbye to each other. The dragon den was also amazing and I like how the dragons from the past movies showed up in there too! ï¿ 1/2ts an overall an excellent watch to go with the family",
            "review_date": "2019-04-16",
            "source": "rt"
        },
        {
            "content": "A good ending to the trilogy of the movies. May be just not as memorable as the first movie..anyways fans will definitely rejoice the coming of toothless again on screen.",
            "review_date": "2019-04-16",
            "source": "rt"
        },
        {
            "content": "Great conclusion to a great trilogy ",
            "review_date": "2019-04-15",
            "source": "rt"
        },
        {
            "content": "So very poor. With repetative and nonsensical storylines. Rampant dragonphilia. Toothless gets another upgrade pulled out of thin air. They continued with that alpha, dragon-king nonsense, despite toothless not having hypnotic powers. They add to its ridiculousness with some magic mind-control venom.\nThey find a hidden undergorund world where magically there's sunligh. And lots of dragons. And apparently they feed on nothing at all. Of course toothless instantly becomes king and the other dragons bow... Even the Alpha from the second movie. Of course all dragons need to hide there, for some reason...\nSuch a steep downhill from the first movie to the third. It was painful to watch. It has no sense or palatable story. Only cheaply constructed sentimentalism (dragons good, humans bad), beast love, and equally cheap human romance.\nAt the end they apparently stayed at a remote unfamiliar island, instead of going home for no reason...\nToothless apparently learnt to fix its mechanical tail on its own BTW.\n\nGood graphics though.",
            "review_date": "2019-04-15",
            "source": "rt"
        },
        {
            "content": "The animation is ok, but i think the ending was a bit too overwhelming for some people",
            "review_date": "2019-04-15",
            "source": "rt"
        },
        {
            "content": "Great family movie, and perfect ending to the saga.",
            "review_date": "2019-04-15",
            "source": "rt"
        },
        {
            "content": "this was literally the best movie of the year, I'm sad that the series is over, but great movie ",
            "review_date": "2019-04-15",
            "source": "rt"
        },
        {
            "content": "One of the best animation trilogy I've seen. Very satisfying emotional end. Cute creatures, matured emotions. Both kids and adults can enjoy. Good watch on a depressing weekend. Whenever you need a mood boost.",
            "review_date": "2019-04-14",
            "source": "rt"
        },
        {
            "content": "one of the best movies of the year in my opinion currently ",
            "review_date": "2019-04-14",
            "source": "rt"
        },
        {
            "content": "nice movie and all those good effects on the screen was awesome but I was spect a better than other movies.. ",
            "review_date": "2019-04-14",
            "source": "rt"
        },
        {
            "content": "I think this sequel is time to give this storyline a good end.",
            "review_date": "2019-04-14",
            "source": "rt"
        },
        {
            "content": "Cute Movie for the whole family to see",
            "review_date": "2019-04-14",
            "source": "rt"
        },
        {
            "content": "I have been looking forward to seeing \"How To Train Your Dragon: The Hidden World\" for some time now. I love anything to do with dragons and this animated feature series has been an absolute delight. I get completely lost in the golden, green eyes of the Night Fury dragon named \"Toothless\", and I love how playful he is. The second film, \"How To Train Your Dragon 2\", is not only one of the best sequels ever made but easily one of the best computer animated movies ever made, too. The viking characters and dragons inhabit such a rich and complicated world and it's easy to get lost in it, but from the first scene of \"The Hidden World\" it's plain to see that director Dean DeBlois is trying too hard. The opening's foggy setting quickly becomes too complicated for its own good, and too cheeky. It immediately reminded me of the dull opening sequence to \"Avengers: Age of Ultron\"â\" another one of those \"hey we got everyone together again so let's be silly in a crazy situation\"! It's as though it's too comfortable with itself. It's as if the filmmakers think they no longer have to work hard to make us care. Wrong!\n\nOne of the strongest aspects of the second \"Dragon\" film is that it took an appropriate amount of time between key scenes to let the characters simply converse and tell their story. Most computer animated films sprint really fast from one punch line or cute pratfall to the next, and clock in at around 85 minutes. \"Dragon 2\" was smarter because it's pacing was more realistic, and extra time was given to Hiccup (voiced by Jay Baruchel), his father Stoick (Gerard Butler), and all of his friends so they could assess their situation and form a plan of action. This singular aspect could also be why it was so expensive at the time, tooâ¦! But \"The Hidden World\" doesn't follow suit and sacrifices the awe and wonder (and color) that I have come to expect from this series for abrupt exposition. I wonder if it could have been something more, or something elseâ¦.!\n\nNot once did I laugh out loud during \"How To Train Your Dragon: The Hidden World\". The previous films had me busting a gut, because they struck a perfect balance between levity and drama to make everything more thrilling. While \"The Hidden World\" completes a larger story not enough time is given throughout its run time to allow additional character development. Hiccup's girlfriend, Astrid (America Ferrara), and he are no further along in their relationship, which is awkward; and Fishlegs (Christopher Mintz-Plasse) has a creepy crush on Hiccup's mother (Cate Blanchett). Eww! The villain named Grimmel (F. Murray Abraham) is a tired rehash of Drago from the second movie only this time he controls his dragon army with potions instead of hypnotism. My real problem with him is that he fails to embody any real threat. He promises to kill Toothless through the entire film (and has at least five clear chances to do so) but instead just tranquilizes him. Not that I wanted him to kill the coolest dragon of them all but what good is a villain to a story if he's not going to follow through on any threat? Drago was truly dark and malevolent but not once did I think anyone was in peril from the sneering Grimmel. \n\nI think Dreamworks animated films are among the best, especially the \"Kung Fu Panda\" series, and \"The Croods\". \"The Hidden World\" ends on a high enough note to bring things to a proper close but we only get a fleeting glimpse of the titular hidden world, which looks a lot like Pandora from \"Avatar\". There should have been a LOT more of it instead of one scene because it's jaw-droppingly beautiful. The epilogue sequences are the best scenes in the picture and while they campaign hard for tears they also feel tacked on at the last minute. I know many will disagree with my observations and that's fine. \"How to Train Your Dragon\" fans should not miss this final chapter, but I found it already running out of gas from the opening moments. I love this series very much and didn't know what was left to reveal about its rich, frozen world of vikings and dragons but \"The Hidden World\" felt more like \"A Missed Opportunity\".",
            "review_date": "2019-04-14",
            "source": "rt"
        },
        {
            "content": "This movie was awesome!",
            "review_date": "2019-04-14",
            "source": "rt"
        },
        {
            "content": "While the movie has turned formulaic, there are still moments which makes you root for the main characters - Hiccup and Toothless.\n\nThe main issue with the movie is that the Villian lacks charisma and movie is still harping on the Self-Doubt that Hiccup has, even after 2 movies :)",
            "review_date": "2019-04-14",
            "source": "rt"
        },
        {
            "content": "I really really really loved this movie. Honestly, I really really really loved all three movies. This one truly, once again, lived up to all my expectations. It looked beautiful, it was funny ( I cried of laughter at one point), I loved seeing all the characters again. It was just great. In the end, it got quite emotional for me personally. I tried very hard to hold back my tears but I let one slip, so I was happy my 3D glasses helped me cover up my tear filled eyes. I will miss these movies very much and be sure to watch them all again very soon.\n\nJust realized that I pretty much only talked about my emotions but I also want to say something about the storyline. I think this movie had one of the best storylines of all three. I witnessed a growth in multiple characters, which is something I really enjoyed. I hated the bad guy, which hasn't happen in this trilogy yet, so that's pretty great. Loving all these emotions, to be honest.\n\nSo, if you haven't noticed by now, I loved How to Train Your Dragon (all of them) and HIGHLY recommend you watch them all :-)",
            "review_date": "2019-04-13",
            "source": "rt"
        },
        {
            "content": "Solid 3 stars. I loved the other two movies and I feel like this one fell flat. I did leave the theatre pretty disappointed. 🤷‍♀️ It wasn’t the worst movie, but it didn’t live up to the previous two. I felt sad and bored throughout the film.",
            "review_date": "2019-04-13",
            "source": "rt"
        },
        {
            "content": "Great movie.  If you like the first two you will like this one.",
            "review_date": "2019-04-13",
            "source": "rt"
        },
        {
            "content": "4/13/2019\nThis third installation was equally good and touching as the first two.",
            "review_date": "2019-04-12",
            "source": "rt"
        },
        {
            "content": "Visually stunning, but the story comes off poorly. It is one deus ex machina after another, driving the plot in an attempt to wrap up the trilogy loose ends, but even that doesn't work that well. The result is a rushed mess at times. A lot of questions about the world that these characters live in never got answered, or were written off with a couple of cheap lines. I can appreciate what Dean Deblois was trying to do, aiming for that bittersweet ending, but it came at the sacrifice of a lot of character development, as well as doing a complete 180 on the entire franchise foundations of \"the forever friendship\" by pitting one form of love against another.\n\nWe don't even get to see another Night Fury, which was one of the biggest teases of the franchise. Instead we get a Light Fury, which is NOT a female Night Fury (per the director). It's a different subspecies. That means toothless species is effectively extinct, Night Furies are gone from the world which creates an unnecessary depressing twist.\n\nEven the separation reasons are low effort. We barely are given a reason as to why the Berkians couldn't live in the hidden world. Yes, the dragons there are hostile to humans, but the Berkians don't even try to prove themselves to the dragons. On top of all that, of all the humans in the world, Berkians are the most deserving for having housed, fed, and even had abandoned their way of life and everything they knew, all for their dragons. They even encouraged them to go free, and yet not one of the dragons decide they should take the humans with them to the hidden world. Not even Toothless thinks to try to bring the Berkians; the very character whom the franchise always tried to show as having close to human intelligence.\n\nHiccup, shining once again as that supportive friend for his best bud, makes the automatic tailfin a second time (first time in Gift of the Night Fury;  Astrid even throws a reference to that animated short by reminding Hiccup that he tried once before and Toothless didn't want it). Toothless can now fly on his own and thus wins the interest of the Light Fury.\n\nHiccup even saves BOTH Toothless and the Light Fury by having resolved to give up his life for theirs in the last action sequence (and is saved at the last second). Toothless has always been that character to support Hiccup through thick and thin, and it just seems weird that, given everything they've done for each other, he doesn't insist on trying to bring the Berkians, or even come to visit in that 10 year gap. the whole call of the wild is used as an excuse for his character choices and actions, which is a really pitiful disservice to such an incredible character who has always been portrayed as something more than just a beast in the rest of the franchise.\n\nEven further, Toothless is an Alpha who apparently even has the ability to order other dragons to surrender themselves to capture in one of the sequences, it's not a stretch to believe he would have the ability to mediate between humans and dragons in the hidden world. \n\nEffectively, this ends up leading to a very manufactured ending of drama instead of providing truely convincing, logical reasons for the necessity of their separation. The writing is loaded with a lot of low hanging cliche fruit that makes the movie feel like it is designed around emotional bait instead of a well written finale.",
            "review_date": "2019-04-12",
            "source": "rt"
        },
        {
            "content": "Narratively the weakest of the three films, but the best in terms of visual effects. It’s absolutely visually stunning!!",
            "review_date": "2019-04-12",
            "source": "rt"
        },
        {
            "content": "If you liked the other ones, you'll probably like this one. It didn't disappoint my wife & I, but we like the other movies in the franchise as well.",
            "review_date": "2019-04-11",
            "source": "rt"
        },
        {
            "content": "Three words: I love this",
            "review_date": "2019-04-11",
            "source": "rt"
        },
        {
            "content": "I thought 'How to train your dragon 2' was very impressive and they couldn't top it. I was wrong. The hidden world is one of the best animated movie I've watched in a really long time. Almost cried at the end.",
            "review_date": "2019-04-11",
            "source": "rt"
        },
        {
            "content": "Light hearted and fun, great for kids.",
            "review_date": "2019-04-11",
            "source": "rt"
        },
        {
            "content": "A great finale for this trilogy. Exploring the romance and the meaning of love and freedom were the center of this last story. The story was well written and the imagery was dazzling, except for the colorful carnaval-like dragons. Hope they stay with this closing and not mess with this excellent trilogy. A-",
            "review_date": "2019-04-11",
            "source": "rt"
        },
        {
            "content": "Overhyped mediocre stuff, weakest movie from the series.",
            "review_date": "2019-04-10",
            "source": "rt"
        },
        {
            "content": "Loved it. Will miss this series. Great end to a great storyline, ",
            "review_date": "2019-04-10",
            "source": "rt"
        }
    ]
}