{
    "rating": 9.4,
    "release_date": "2019-11-08",
    "num_reviews": 430,
    "genres": [
        "Comedy",
        "Drama"
    ],
    "summary": "Jojo is a lonely German boy who discovers that his single mother is hiding a Jewish girl in their attic. Aided only by his imaginary friend -- Adolf Hitler -- Jojo must confront his blind nationalism as World War II continues to rage on.",
    "reviews": [
        {
            "content": "I love this movie so much, I actually makes me cry no matter how much I watch it, his mom and captain k are an example of even during nazi germany good people still existed.",
            "review_date": "2023-04-14",
            "source": "rt"
        },
        {
            "content": "Should have won best picture over Parasite",
            "review_date": "2023-04-14",
            "source": "rt"
        },
        {
            "content": "funny and yet brilliant",
            "review_date": "2023-04-04",
            "source": "rt"
        },
        {
            "content": "Nazi story in world war II, it was a fantastic childhood, full of fun, love and tears .",
            "review_date": "2023-04-04",
            "source": "rt"
        },
        {
            "content": "A great film that leads people to reflect.",
            "review_date": "2023-04-04",
            "source": "rt"
        },
        {
            "content": "This movie is a treasure. So ridiculously funny and well written. The acting is superb on every account. It's like the best possible hybrid of \"The Death of Stalin\" and \"Moonlight Kingdom\".",
            "review_date": "2023-04-02",
            "source": "rt"
        },
        {
            "content": "Its nazi but in a funny way ..great movie....love it",
            "review_date": "2023-03-25",
            "source": "rt"
        },
        {
            "content": "Wow... I hadn't heard anything about this movie going in, and I am so glad.  This movie is a strange little gem of a film that deserves it's high rating.  I am still amazed how good the acting was; none of the parts were easy types of characters to play but they all pulled it off perfectly.  The story unique, and \"threads the needle\" when it comes to being silly but not to silly, serious but not to serious, touching sensitive issues but not in a way that offends.",
            "review_date": "2023-03-20",
            "source": "rt"
        },
        {
            "content": "couple decent jokes but underwhelming for what I was told about it",
            "review_date": "2023-03-18",
            "source": "rt"
        },
        {
            "content": "The girly and the lil boy is a great depiction of me and my bestie. War is cringe though!",
            "review_date": "2023-03-12",
            "source": "rt"
        },
        {
            "content": "Quicky became one of my all-time favourites. I could watch this film over and over.",
            "review_date": "2023-03-12",
            "source": "rt"
        },
        {
            "content": "The perfect blend of comedy and heartache highlighting the sheer absurdity of war.",
            "review_date": "2023-03-09",
            "source": "rt"
        },
        {
            "content": "Funny and detailed in equal measure, Taika Waititi's Jojo Rabbit is heartwarming and somber at the same time, while providing more evidence that Waititi's inseparable bond with child actors is not diminishing.",
            "review_date": "2023-03-02",
            "source": "rt"
        },
        {
            "content": "Favorite Movie, watched it more than once, something I keep coming back to watch :)",
            "review_date": "2023-02-18",
            "source": "rt"
        },
        {
            "content": "Brilliant! It made me laugh, it made me cry,  in equal measure.  Love beats hate.  How it should be. Always.",
            "review_date": "2023-02-18",
            "source": "rt"
        },
        {
            "content": "Jojo Rabbit ist eine Kriegs-Tragikomödie von Taika Waititi. Nach dem Roman von Christine Leunens Caging Skies. Eine Anti-Kriegs-Satire mit schwarzem Humor gemischt, Taika Waititi erzählt sie uns mit Witz und Sarkasmus, sogleich aber auch mit Feingefühl und Respekt… Die Filmmusik und der Soundtrack sind außerordentlich in ihrem Assortiment… Auch die schauspielerische Leistung der Darsteller ist sensationell… Jojo Rabbit hat mich zum Lachen gebracht und auch zum Nachdenken angeregt, im allem ist er ein perfekt inszenierter Film… Jojo Rabbit ist absolut sehenswert!",
            "review_date": "2023-02-15",
            "source": "rt"
        },
        {
            "content": "I thoroughly enjoyed this movie. A great cast, all perfect for the rolls they play. Cleverly written, funny, and heartwarming.",
            "review_date": "2023-02-12",
            "source": "rt"
        },
        {
            "content": "To make a Nazi satire is daring. To make a Nazi satire centered around a child is even more so. And to give that same child an imaginary version of Hitler as a best friend is just wild. To call Jojo Rabbit \"offbeat\" would be an understatement. It's a hilarious foray into the final chapter of WWII that doesn't shy away from the heavier things throughout. The performances are enchanting, whether it's the titular star played by Roman Griffin Davis, or his Jewish-sympathizing mother played by the always excellent Scarlett Johansson. There's also noteworthy turns as a Nazi officers by both Sam Rockwell and Rebel Wilson. It is, however, relative newcomer Archie Yates that steals every scene that he's in as the hilarious Yorki, another Hitler Youth member. Yorki serves as the audience's morality, always asking or stating the obviously absurd to ensure that he's heard the nonsense correctly. The characters are certainly what sell this whacky story that gets more and more serious as the movie plays out. Johansson's son discovers that his mother is hiding a Jewish girl in a crawl space in their home and is faced with having to decide between his mother's judgement and the Führer's. As the film progresses it reminds us that it's not a straight-comedy and does, impressively, own up to its serious subject matter amid the relative silliness. Taika Waititi continues to prove that he's the go-to name in oddball comedy, while also showing that he can deftly tell a serious story so long as it's wrapped in his signature absurdity.",
            "review_date": "2023-02-10",
            "source": "rt"
        },
        {
            "content": "Initially, this movie made me feel uncomfortable. I thought the only way it would be acceptable is if the director, Taika Waititi, was Jewish because a non-Jewish director would have no business making a comedy about the Holocaust. After a quick Google search, I discovered that TW actually is Jewish. Sigh of relief. It's now safe to laugh at Funny Hitler. Such a brilliant movie. So bizarre, so hilarious, so incredibly smart.",
            "review_date": "2023-02-08",
            "source": "rt"
        },
        {
            "content": "The courage it takes to kick, for the 100th time, the dead body of an enemy vanquished almost a century ago. And the audacity it takes to think that it somehow makes you original, funny or transgressive. And the boomerish boredom of it all.",
            "review_date": "2023-02-08",
            "source": "rt"
        },
        {
            "content": "Yes, most of us know that Nazis are bad. But having seen one movie too many banging on about it with oh-so-serious aplomb has become pretty tedious. Enter Jojo Rabbit, which takes an entirely different approach from the perspective of a young boy being indoctrinated into the Nazi Youth, who gradually comes to realise the errors of his ways, though repeatedly challenged by his imaginary (and, to begin with, hilarious) pal Adolph Hitler. The satire, the pathos and the terror are spot on in their own way. Not since The Producers has Hitler looked so ridiculous. I laughed out loud, I was saddened by the reality of war portrayed, and I even welled up a little at the end (and it takes a lot for a movie to do that to me). And excellent performances throughout. Highly recommended.",
            "review_date": "2023-02-04",
            "source": "rt"
        },
        {
            "content": "monarkão não gostou do final",
            "review_date": "2023-02-04",
            "source": "rt"
        },
        {
            "content": "A young boy in Hitler's army (whose has the Fuhrer as his imaginary friend) finds out his mother is hiding a Jewish girl in their home…. Who would have thought that a lampoon of Nazi ideology could be so thought provoking? The experience of \"Jojo Rabbit\" represents a roller coaster of emotions. It is funny, heart-warming, heartbreaking and quirky. It's unique, not just due to its controversial subject matter and approach but is so much more than that in the way it takes you from hilarity to heartbreak. And the cast is fantastic in taking you along for the ride, especially Archie Yates as Yorkie, Jojos boyhood best friend.",
            "review_date": "2023-01-26",
            "source": "rt"
        },
        {
            "content": "WW2 comedy, is that even appropriate? I don’t know, but I can’t think of another movie that depicts the absurdity of racism better than JoJo.",
            "review_date": "2023-01-24",
            "source": "rt"
        },
        {
            "content": "Beautiful movie about breaking stereotypes and prejudices, about friendship and love, and that even in the most difficult times there is hope.",
            "review_date": "2023-01-20",
            "source": "rt"
        },
        {
            "content": "Top 3 movies to come out in the last 3 years.",
            "review_date": "2023-01-08",
            "source": "rt"
        },
        {
            "content": "Taika Waititi plays Hitler like a tall tale character in \"Jojo Rabbit\", a film that satirizes a coming of age story during the Nazi regime in World War II. Laugh-out-loud funny, endearing, and heartbreaking, Waititi (director of the great vampire parody \"What We Do in the Shadows\" and the first episode of \"The Mandalorian\") has directed the feel good movie of the year, a shattering morality tale, a hilarious well-written spoof, and a powerful tale of innocence and tolerance. Roman Griffin Davis gives a gripping debut and one of the best child performances as Jojo and Scarlett Johansson is tender and rousing in an Oscar-worthy performance as his mother Rosie. At times the film might feel like it's trying to explore too many ideas, but this is a rare movie that manages to effectively create a comedy about Nazisms and the blindness of following mislead conformity.",
            "review_date": "2023-01-06",
            "source": "rt"
        },
        {
            "content": "absolutely charming movie that perfectly balances goofiness with the horrors of the time. The way Taika tears apart the nazi party so you see how fucking dumb it is in the first place is masterful filmmaking.",
            "review_date": "2023-01-04",
            "source": "rt"
        },
        {
            "content": "Quite possibly the worst movie I've ever seen",
            "review_date": "2023-01-03",
            "source": "rt"
        },
        {
            "content": "Fresh, original, loving.",
            "review_date": "2022-12-25",
            "source": "rt"
        },
        {
            "content": "Es una película muy buena en mi opinión,divertida y con buenas actuaciones,hace bien las escenas de comedia y las de drama",
            "review_date": "2022-12-18",
            "source": "rt"
        },
        {
            "content": "Good fun emotional all at ht esime and still giving a good story with some comedy, not as good as the lif eis beutifull but yet one of the best",
            "review_date": "2022-12-14",
            "source": "rt"
        },
        {
            "content": "A wonderful meal! Loved it!",
            "review_date": "2022-12-11",
            "source": "rt"
        },
        {
            "content": "Perfection. 💫\nThe way Taika goes in and out of a serious and scary to a light hearted and even to borderline four wall at times is fantastic. Masterpiece.",
            "review_date": "2022-12-07",
            "source": "rt"
        },
        {
            "content": "The best acting performance from Roman Griffin Davis!",
            "review_date": "2022-11-27",
            "source": "rt"
        },
        {
            "content": "As unlikely as it sounds, Taika Waititi's Jojo Rabbit is a comedy about Nazism, fanaticism, the horrors of war, tyranny, compassion, acceptance and a 10-year-old boy with an imaginary friend by the name of Adolf Hitler.  In the movie, young Jojo (Roman Griffin Davis) and his mother (Scarlett Johansson), a resistance fighter, try to survive in war-torn Germany towards the end of WW2, all while illegally harboring a Jewish girl (Thomasin McKenzie) behind the walls of their home.  It is a film filled with gentle humor and pathos, a bold satire that skewers everything that gets in its path.  The cast is excellent, the story is original, the characters are interesting and the writing is incredibly clever.  Jojo Rabbit is one of those rare movies that can make an audience laugh and cry at the same time.",
            "review_date": "2022-11-25",
            "source": "rt"
        },
        {
            "content": "pretty funny and heart warming",
            "review_date": "2022-11-21",
            "source": "rt"
        },
        {
            "content": "9.5/10. So clever and touching.",
            "review_date": "2022-11-18",
            "source": "rt"
        },
        {
            "content": "It has been so long since I walked out of a film and said \"I wouldn't have changed a thing.\" 10/10, I loved every moment. Astounding performances. So original. And deeply life-affirming.",
            "review_date": "2022-11-18",
            "source": "rt"
        },
        {
            "content": "i love loved this movie!! its sooo goooood",
            "review_date": "2022-11-11",
            "source": "rt"
        },
        {
            "content": "I don't have one complaint about this movie. Beautiful all the way through.",
            "review_date": "2022-11-11",
            "source": "rt"
        },
        {
            "content": "A wonderful mix of lightness and profundity. I cried three times, and two times it was of joy.",
            "review_date": "2022-11-08",
            "source": "rt"
        },
        {
            "content": "A equally moving, funny, and informative flick, Jojo Rabbit showcases the ridiculousness of the radicalization of children in nazi Germany, and how any child could see through the lies fed to them.",
            "review_date": "2022-11-02",
            "source": "rt"
        },
        {
            "content": "If someone asks me to describe this movie with one word, I would say it is unexpected. This movie has something unique that distinguishes it from other movies of this genre, and that thing is the number of emotions that it makes you feel. Despite the fact that the Holocaust was a tragic and devastating moment in history, Jojo Rabbit is capable of making it fun and heartwarming. Besides the acting and cinematography, Jojo's story is captivating since he has to confront the two sides of the war, and eventually, he finds out that all the Nazi propaganda, beliefs, and even the purpose of the war are wrong.",
            "review_date": "2022-11-01",
            "source": "rt"
        },
        {
            "content": "Fantastic, funny, and amazingly well-written and acted. Do not expect it to be light-hearted, however. It is a rollercoaster of emotions that will both make you laugh and cry, over and over again.",
            "review_date": "2022-10-29",
            "source": "rt"
        },
        {
            "content": "Watching this in 2022, with all the things that have been done by totalitarian states over the last couple of years makes watching this movie even more surreal.\nThis movie walks the razor tightrope that, if you fall off it, takes you into the realm of actually condoning hate, yet it successfully makes it to the other end, with the viewer being left in no doubt about its intent, and how hatred is such an absurd condition. Stunning performances by all.\nBlown away.\nMany of the comments are about \"it wasn't funny\", which tells me that the point of this movie has gone over a lot of people's heads. Another stated that it was complacent that the notions that fuelled the Nazis are dead and gone. A viewing in 2022 suggests to me that the film is curiously prescient of things to come, perhaps unintentionally. But the absurdities propagated by the Nazis in this film are not so different to the absurdities we have seen coming out of the Kremlin this last year.",
            "review_date": "2022-10-18",
            "source": "rt"
        },
        {
            "content": "Not my type of humour",
            "review_date": "2022-10-09",
            "source": "rt"
        },
        {
            "content": "While I didn't find it very comedic or funny, I thought the overall message at the end was good, to learn to love those around us regardless of race or what we think we know about them. Didn't care much for the Nazi approach, but it did help to get the point across while is was set during the 2nd World War in Nazi Germany.",
            "review_date": "2022-10-01",
            "source": "rt"
        },
        {
            "content": "Loved it! One of the best \"WW2\" films out there. Super emotional almost made me cry. I highly recommend this.",
            "review_date": "2022-09-30",
            "source": "rt"
        },
        {
            "content": "Very entertaining I like the point of view not only from the child but what happened to ordinary people in Germany.",
            "review_date": "2022-09-25",
            "source": "rt"
        },
        {
            "content": "I quickly got caught up in this quirky story and fell in love with the actors and their roles. It is not a light-hearted tale, but also not dreary or sentimental. It reminded me of why I hate war. H8 War!",
            "review_date": "2022-09-19",
            "source": "rt"
        },
        {
            "content": "I don't understand why it got such good user ratings. The script is terrible and the jokes even worse. I didn't laugh or even crack a smile once.",
            "review_date": "2022-09-16",
            "source": "rt"
        },
        {
            "content": "I can only compare this movie to CATS, horrible!!!",
            "review_date": "2022-09-14",
            "source": "rt"
        },
        {
            "content": "As good as any movie you will ever see",
            "review_date": "2022-09-04",
            "source": "rt"
        },
        {
            "content": "I had absolutely no idea what to expect of this film, but from the first frame, I was both repulsed by the Nazi imagery yet utterly captivated by and drawn-into the constant and obvious ironies.  I was drawn into \"Pulp Fiction\" in a very similar way, and I do recommend this incredibly clever and thought provoking film to anyone who was mature enough to absorb the many layers of the onion that were laid bare.  I'll watch it more than once, that's for sure.",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "This is very much a quirky watch, which has a strong comic book type feel to it, in that there's quite strong colours and settings, with somewhat exaggerated characters (in terms of their gestures and behaviour). Its obviously a very serious subject, the 2nd World War and I wouldn't want to downplay that at all but there is a certain, very dark comedy element to this film I suppose. Of course there's a fair argument to say that this may make some people think that you can have a laugh at what was a mass scale tragedy, genocide of the Jews etc. and I'm also very much aware of the rise in antisemitism in recent months and years.\n\nI think the humour comes from the way it clearly shows just how obsessive the Nazi's were and the clear megalomania that was present. Its very much satirical and features some interesting cast members as supporting characters, like Rebel Wilson and Stephen Merchant. The fact that the film focusses on such a young child (a 10 year old) and how he tries to get his head around what is happening around him and why, that's quite good in that it perhaps could be seen as a bit insightful into how the native children may have processed things. Its very much tongue in cheek and I can understand why it would annoy or upset some but I do feel there's something interesting about it. I'm glad it has the 12 rating in the UK, as I wouldn't be keen for pretty young kids to watch it, with the obvious themes, even though there is relatively little in the way of violence, or graphic violence certainly.\n\nIt is somewhat outrageous in tone at times, mainly with the scenes featuring Jojo's imaginary friend, Hitler himself (played by Taika Waititi), who gestures and behaves in a very childish way. Its a bit strange but I quite liked it in a way, though I can understand those who don't feel that way. I couldn't quite understand how it was anti-nationalism until quite late on in the film but it did feel fairly effective by the very end.\n\nPersonally, I'd recommend it as long as you know what its about and the type of film it is (a quirky darkly comic/satire drama).",
            "review_date": "2022-09-01",
            "source": "rt"
        },
        {
            "content": "2 years ago- 2 years ago Biting satire that is consistently hilarious around a sensitive topic; the film is only elevated by the performances of the adults, the children, and the director as history's most infamous dictator.",
            "review_date": "2022-08-27",
            "source": "rt"
        },
        {
            "content": "The whole time I was watching it I wanted to be watching Die Blechtrommel instead. That said it was okay, beautifully filmed and acted, the story was just rather normal fodder. With a few tweaks it could have been better even profound. See Die Blechtrommel for a good period piece.",
            "review_date": "2022-08-17",
            "source": "rt"
        },
        {
            "content": "Very cute movie about how a child would've seen WWII. The director did a good job though it's a bit silly but not too bad. Definitely a refreshing view on the Nazi era",
            "review_date": "2022-08-14",
            "source": "rt"
        },
        {
            "content": "Beuatiful fun woderfull. Takles serius problems and there are no 2 dimensional characters",
            "review_date": "2022-08-11",
            "source": "rt"
        },
        {
            "content": "Gracias Taika Waititi por esta gran película",
            "review_date": "2022-08-04",
            "source": "rt"
        },
        {
            "content": "Great comedy drama! Absolutely great job! A couple of small flaws drown in the genius of the script, staging and acting!",
            "review_date": "2022-08-03",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies. It makes you laugh and cry a lot, full of heart and with great performances. It's a must watch.",
            "review_date": "2022-07-25",
            "source": "rt"
        },
        {
            "content": "It's very wholesome story and for me the boy was very relatable. The only thing I found was weird was the woke part with the gay nazi leader. Didn't need that.\n\nHonestly overall very good!",
            "review_date": "2022-07-20",
            "source": "rt"
        },
        {
            "content": "This may well be one of my all time favourite movies, being able to jump from irreverent humour to soul crushing sadness while still never losing its way.\nI saw this at the cinema and I've NEVER heard an audience act like one before, all laughing then immodestly silent.",
            "review_date": "2022-07-19",
            "source": "rt"
        },
        {
            "content": "Irreverent and great. It is a story that embraces delicate situations and sensitive issues and exposes its characters to new horizons of thought. Not to mention that, the film has an outstanding cast. Unfortunately, it has comedy sequences that feels forced, but still sending a good message.",
            "review_date": "2022-07-16",
            "source": "rt"
        },
        {
            "content": "Um dos melhores, se não o melhor filme situado na segunda guerra mundial já feito.",
            "review_date": "2022-07-09",
            "source": "rt"
        },
        {
            "content": "Que buena película, una sátira muy bien elaborada con un final conmovedor.",
            "review_date": "2022-06-24",
            "source": "rt"
        },
        {
            "content": "Jojo Rabbit is quite an interesting, witty movie and a satire of the Second World War, making an effective and clear critique of the German thought of the time. The script allows the situations that arise to be interesting and intriguing, allowing its stars to shine, where the wonderful performance of Scarlett Johansson stands out. Taiki Waititi presents a very strong and entertaining product that is highly endearing and critical, which makes it satisfying for the viewer.",
            "review_date": "2022-06-24",
            "source": "rt"
        },
        {
            "content": "It's oddly comic, and pretty audacious",
            "review_date": "2022-06-23",
            "source": "rt"
        },
        {
            "content": "I was very disappointed in this movie.\n\nTLDR: for such a unique plot it was often generic and felt very unrealistic. If you're not sure you want to see it, don't. \n\nIt felt like it was made for 8 year olds, even though the material and humor would obviously tell you it's not. \n\nThe movie felt like it was grounded in no reality. Felt historically inaccurate, which I understand it's a comedy, but the interactions between people also felt unrealistic too. \n\nThe tone of the movie just didn't feel right, it was just all upbeat comedy which left out a lot of nuance, and even tho the German renditions of songs were funny, often the background music was just generic bubbly music. \n\nI was disappointed in this movie, for such a unique plot it was made extremely generic. I found some redeeming scenes and qualities in the movie, which almost convinced me it was good because I wanted to like the movie so much. \n\nBut, in the end, it was really a pretty poorly executed version of a good idea. I wish it was better.",
            "review_date": "2022-06-16",
            "source": "rt"
        },
        {
            "content": "This movie is why I love cinema. It's using the Life is Beautiful story structure adding some modern touches and originality. The casting is amazing, its like you are watching real people, not actors. The cinematography is gorgeous, almost every frame being a painting and the soundtrack is pure gold.",
            "review_date": "2022-06-14",
            "source": "rt"
        },
        {
            "content": "A beautiful addition to Taika Waititi's kitty of films that focuses on a point of time in history dominated by war and terror but takes a light and emotional approach towards the premise and focuses on the story of the lead character 'Jojo'.",
            "review_date": "2022-06-10",
            "source": "rt"
        },
        {
            "content": "One of the best (dark) comedy films you'll ever watch and fill you up with emotions.",
            "review_date": "2022-06-02",
            "source": "rt"
        },
        {
            "content": "I absolutely loved this! Jojos imaginary friend is hilarious, the writing is spectacular, and the casting is great!",
            "review_date": "2022-05-29",
            "source": "rt"
        },
        {
            "content": "An absolutely brilliant movie. Can't think of another one so eccentric and goofy yet so heavy and heartbreaking (maybe Three Billboards Outside Ebbing, Missouri). A metaphor for how things / people you don't immediately accept can shape you the most.",
            "review_date": "2022-05-26",
            "source": "rt"
        },
        {
            "content": "Taika Waititi is the goat. Funny Hitler movie",
            "review_date": "2022-05-22",
            "source": "rt"
        },
        {
            "content": "I passed on this for a while because I didn't think I'd appreciate the humor considering the context. I finally gave it a chance and I am so glad I did. It is definitely humorous--and it is sad that such ridiculous ideas made fun of by this film were used to do so much evil. But, I'm all about using satire to push a point. This film does that well. Do yourself a favor and watch this.",
            "review_date": "2022-05-16",
            "source": "rt"
        },
        {
            "content": "Funny,sad, moving and more. A great watch.",
            "review_date": "2022-05-16",
            "source": "rt"
        },
        {
            "content": "Absolutely hilarious and yet they still managed to keep the great severity of war.",
            "review_date": "2022-05-11",
            "source": "rt"
        },
        {
            "content": "A must watch. Heartwarming than ever.",
            "review_date": "2022-05-09",
            "source": "rt"
        },
        {
            "content": "Sonic lord king lord lord evil lord king evil",
            "review_date": "2022-04-29",
            "source": "rt"
        },
        {
            "content": "A Very Well-Done Satire Movie! Taika Waititi, you are an absolute genius! If the movie pisses you off, then it serves its purpose to be satire. A beautifully well-done dark comedy!",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "This will go down as one of my favorite films of my lifetime. A beautiful yet heartbreaking dark comedy.",
            "review_date": "2022-04-19",
            "source": "rt"
        },
        {
            "content": "Good plot. Funny. Memeing on Hitler is always great. I liked the fat kid who's name i can't remember. Maybe my favorite child actor ever actually. Still the movie has some flaws like being uninteresting at times and having sad scenes which i personally do not appreciate. Of course it must be educational aswell while talking about nazis. But meh. I'd say it's a little overrated though.",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "I am lost for words. Some of the best cinema I have seen in a long time.",
            "review_date": "2022-04-12",
            "source": "rt"
        },
        {
            "content": "Jojo Rabbit is a fun movie that has strong characters driving the whole story. Takia Watiti, Scarlett Johnson were stellar in their roles. Sam Rockwell the underdog of the movie, less appreciated but absolutely worth watching. The kids really brought the vibrancy in the scenes, both Archie Yates & Roman Griffin were amazing. Thomasin had her own moments to shine. The movie had every shade of emotion and how a family might react to a war. Beautiful concept, even better execution. Everyone should watch this movie with their family and share the moments of laughter and tears together.",
            "review_date": "2022-04-11",
            "source": "rt"
        },
        {
            "content": "A very good movie about the end of the War and Hitler as seen from the eyes of a boy around 7 who has Adolf Hitler as a hero (in his mind) but as the movie continues he grows up mentally thanks to a girl who's Jewish and teaches him that Hitler is not cool because he gases Jewish people sent to internment in Death Camps.  The boy is a very good actor which is why I am rating this as a *4* star movie!!!!",
            "review_date": "2022-04-04",
            "source": "rt"
        },
        {
            "content": "a movie that leads you down a alley way and robs you off comedy i have rarely seen a movie that swaps genres before its well done tale  and a beautiful peice of art",
            "review_date": "2022-04-02",
            "source": "rt"
        },
        {
            "content": "excellent movie tackling tough subject matter of children in Nazi Germany. great performances by 3 child actors and a supporting cast.",
            "review_date": "2022-04-02",
            "source": "rt"
        },
        {
            "content": "Surprisingly hilarious!",
            "review_date": "2022-04-01",
            "source": "rt"
        },
        {
            "content": "The best movie ever.",
            "review_date": "2022-03-11",
            "source": "rt"
        },
        {
            "content": "Amazing black comedy. Toes the line between funny/relatable and completely heartbreaking and horrifying in its bluntness. Must watch! Sam Rockwell is fantastic, as well as Taika and Roman! Loved Yorkie (played by Archie Yates) too.",
            "review_date": "2022-03-10",
            "source": "rt"
        },
        {
            "content": "Incredibly funny and also powerful. Excellent comic performances, obviously very sensitive material, but respectful and illustrative of the ludicrousness of racism/xenophobia/war.\n\nPS: Usually rate critic Peter Bradshaw, but his review was needless off putting (ie: I am watching this years after it came out because if it), will be taking his extremely  negative reviews with a pinch of salt going forward.",
            "review_date": "2022-03-08",
            "source": "rt"
        },
        {
            "content": "This movie is an absolute treasure.",
            "review_date": "2022-03-07",
            "source": "rt"
        },
        {
            "content": "Very insensitive. I do believe that one can make funny movies with dark Humor over topics like that but there wasn't one original joke in this movie! And for such serious topic I had wished a little bit more quality content ….",
            "review_date": "2022-02-25",
            "source": "rt"
        },
        {
            "content": "\"You are the best little Nazi I've ever met!\" ... (movie quote) I watched three times in a week to get all its beauty! The irreverent humor and the originality of the screenplay make this movie a little jewel in the whole motion picture industry. Poignant and serious subjects are portrayed and described through the vision of the innocence of children. I highly appreciated the perfect balance between black humor, comedy, and drama. Cast performances are simply amazing! My rating: 9,5/10",
            "review_date": "2022-02-24",
            "source": "rt"
        },
        {
            "content": "JoJo Rabbit is a very interesting war film, using comedy to convey the majority of their story. And as much as it is a war film, and they do have many examples of historically accurate moments, such as the Hitler youth at the start of the movie, the Gestapo who come to search JoJo's house, the propaganda campaigns that JoJo pastes around their town, and even the public hangings, that's not really the main focus of the film. What they are really trying to convey is less about the events and the war, more about what it brings out in us as people when we go through hardships. It sends a message of love and connection, and acceptance of everyone, despite the differences of race and looks. It also sends a message of how easily we can be brainwashed and manipulated by people with power. The character development throughout the film also shows us a story of growing up, and leaving the innocence of childhood behind us, this idea is presented in the scene where JoJo chases after the blue butterfly, showing he is still a young kid, innocent and childish. They use that in an interesting way, and instead of keeping with the beauty and freeness throughout the scene, use it as more of a juxtaposition, showing JoJo, chasing the butterfly through the square, only to look up and find his mother hung, dead. Another interesting thing in that scene is the camera angle they use as JoJo clutches onto his mother's feet, and they have a rather despairing yet symbolic moment as he tries to tie up her shoelaces. At the start of the movie, everything is quite happy and bright, the image being highly saturated to bring out the colour, however as the movie wears on we get darker and gloomier scenes, with less and less saturation and colour. Overall it is a great film, with a heartfelt message and likeable yet complex characters that I really enjoyed.",
            "review_date": "2022-02-23",
            "source": "rt"
        },
        {
            "content": "Jojo Rabbit is honestly an excellent movie. Within it, there is a huge range of emotions for the audience to experience as they watch. It's a lovely, light-hearted movie surrounding a brainwashed young boy living in Nazi Germany and truly captures a glimpse of what it might have been like in Germany by the end of the war. \nIt does have plenty of historically accurate references within it such as the Hitler Youth, the Gestapo, public hangings and plenty of others. And such a nice film about such a horrible subject can't come without some serious/emotional moments.\nI feel the overall message of the film was to show what can happen when those in power spread their opinions to thousands of followers, how easily people can be discriminated against and targeted because of it and how a person can finally see another side to a second's story.\nA sweet, heartwarming film, I would recommend.\n\n\n*I am writing this review for a school project",
            "review_date": "2022-02-23",
            "source": "rt"
        },
        {
            "content": "I don't have a joke watch movie very good",
            "review_date": "2022-02-22",
            "source": "rt"
        },
        {
            "content": "While taking risks, and having moments I disagreed with, it nevertheless made the audience ask questions and learn to love.",
            "review_date": "2022-02-18",
            "source": "rt"
        },
        {
            "content": "He took the nazi topics and he blended with satirical humor, who else but Taika Waititi. 2/10",
            "review_date": "2022-02-08",
            "source": "rt"
        },
        {
            "content": "Insightful way to take on a heavy subject and insert laughter and youthfulness. Love this movie. All emotions come through in this movie.",
            "review_date": "2022-02-02",
            "source": "rt"
        },
        {
            "content": "An absolutely amazing watch from start to finish",
            "review_date": "2022-01-31",
            "source": "rt"
        },
        {
            "content": "Emocionante, divertida, creativa, sentimental e inocente. Un niño que quiere ser nazi y su amigo imaginario es Hitler interpretado Waititi, Que increible película.",
            "review_date": "2022-01-31",
            "source": "rt"
        },
        {
            "content": "Charming, hilarious and heartbreaking. I loved this movie.",
            "review_date": "2022-01-28",
            "source": "rt"
        },
        {
            "content": "A satire that is hilarious but also has emotion.",
            "review_date": "2022-01-23",
            "source": "rt"
        },
        {
            "content": "Hilarious, charming. well presented.",
            "review_date": "2022-01-22",
            "source": "rt"
        },
        {
            "content": "I think it's safe to say that this film isn't a subtle and brilliant piece. The acting was often sub-par, with some questionable German accents in there. The themes and perspectives were highly simplistic and over-explained. On top of all this, there were parts that felt dull and unnecessary, and a few moments of pure cringe. The dragging out of the beginning and end, limiting the film's effect, is a perfect example of this. However, despite it's obvious flaws, Jojo Rabbit provided a fresh and clever critique of the flawed ideologies that underpinned Nazi Germany. It was charming, funny, and all-in-all, a movie that I thoroughly enjoyed.",
            "review_date": "2022-01-22",
            "source": "rt"
        },
        {
            "content": "Hard to describe this movie.  Part farce, but underneath a compelling message.",
            "review_date": "2022-01-18",
            "source": "rt"
        },
        {
            "content": "Quite a remarkable feat from director Taika Waititi to be able to take WWII and the Holocaust make it into a satire comedy. You'll laugh and smile at all the quirky jokes, but then you realize the underlying dark truth of what those jokes really meant. Balances so well the humour and drama.",
            "review_date": "2022-01-09",
            "source": "rt"
        },
        {
            "content": "A must see movie, I loved the story",
            "review_date": "2022-01-04",
            "source": "rt"
        },
        {
            "content": "Much of the criticism surrounding this film's farcical nature can be best understood as \"refusing to get the joke.\" Albeit, while it succeeds at \"how to make the Nazi Regime a joke\" Jojo Rabbit ends up being a little more forgettable than most Waititi joints.",
            "review_date": "2022-01-01",
            "source": "rt"
        },
        {
            "content": "This movie was a roller coaster of emotions: it's the fairytale every child should listen to and it's the story every adult should tell. In less then two hours, it makes you think and cry, relax and laugh. Yes, because even if we can't laugh about war and deaths, we can certainly laugh about Hitler and everything he stood for. We can laugh about his mustache and his supporters, because Hitler was a little man (in everything!) and he was ridiculous. The writing was genius, actors' performances were impeccable and costumes were absolutely stunning. Please, watch it, it's a must",
            "review_date": "2021-12-31",
            "source": "rt"
        },
        {
            "content": "Excellent, funny, irreverent in just the right way. Importantly, this story bring the darkness along with the humour.",
            "review_date": "2021-12-29",
            "source": "rt"
        },
        {
            "content": "Failed attempt to deal with the holocaust and the fall of Berlin to the allies through the eyes of a child committed to National Socialism but then coming to realise human values. It was a bold idea although one we have seen before, better executed. This time it does not work as the comedy is not generally funny (occasionally it is), the caricatures are old hat and repetitive and the redemption is trite. It does not quite  hit the right note, but that is very hard to do. In the end it just becomes a bore.",
            "review_date": "2021-12-25",
            "source": "rt"
        },
        {
            "content": "Dark comedy at its finest. Genuinely funny and heartwarming.",
            "review_date": "2021-12-24",
            "source": "rt"
        },
        {
            "content": "The comedy was perfect, cried at the hanging shoe scene and when that one eyed general sacrificed himself. He was a pretty chill guy. It was really good.",
            "review_date": "2021-12-24",
            "source": "rt"
        },
        {
            "content": "Intelligent and human",
            "review_date": "2021-12-19",
            "source": "rt"
        },
        {
            "content": "Funny comedy. I'm a historian and my area is ww2. Not alot of history here... just good laughs and true emotion. Truly an emotional film. Loved Sam Rockwell in this btw. Always one of my favourites. The kids were really good. It truly moved me. Even if the history was off. But that's not what the film is about so I'll give it a pass on that stuff. I'd recommend it. \n\n\"Fuck off Hitler.\"- JoJo",
            "review_date": "2021-12-10",
            "source": "rt"
        },
        {
            "content": "Great cast, comedy and message make it a fantastic watch.",
            "review_date": "2021-12-08",
            "source": "rt"
        },
        {
            "content": "Portraying Hitler as a buffoon diminishes the reality of the kind of a monster he really was, so a comedy starring him had better be really funny. The jokes in this movie were not very funny.",
            "review_date": "2021-12-08",
            "source": "rt"
        },
        {
            "content": "A young Nazi, whose imaginary friend is Adolf Hitler himself discovers his mother is hiding a young Jewish girl in their house. \nSounds pretty dark with that synopsis but it's far from it, it's often hilarious and delightfully self mocking.  Directed by Taika Waititi who also plays Hitler.  Scarlet Johanssen plays the boys mother.  Sam Rockwell is excellent as always in his role as a German captain. \nReally great film",
            "review_date": "2021-11-24",
            "source": "rt"
        },
        {
            "content": "Loved it. The innocence is organic. The overarching sentiment is that of optimism in the midst of all the gloom. Dont go looking for character depth and story flow. This flick is all about keeping those smiles intact even as the world around you blows itself to smithereens.",
            "review_date": "2021-11-22",
            "source": "rt"
        },
        {
            "content": "Awesome and unique movie.",
            "review_date": "2021-11-20",
            "source": "rt"
        },
        {
            "content": "This movie was a stitch. I loved it. I even went to see it twice in Cinemas when it was out. That's how fun it was. Taika Waititi and Roman Griffin Davis had such great chemistry. The bits where Sam Rockwell and Stephen Merchant appeared were always hilarious to watch. All in all, I Highly Suggest you take a look at this one. 4.5 Stars.",
            "review_date": "2021-11-20",
            "source": "rt"
        },
        {
            "content": "An absolutely perfect film that easily fits in with all the other masterpieces from the mind of Taika Waititi.",
            "review_date": "2021-11-15",
            "source": "rt"
        },
        {
            "content": "Taika Watiti continues to show the world his genius through this movie. This movie makes you go through every emotion possible, and the comedy hits just as well as the tragedy.",
            "review_date": "2021-11-11",
            "source": "rt"
        },
        {
            "content": "Most beautiful movie you could see",
            "review_date": "2021-11-11",
            "source": "rt"
        },
        {
            "content": "a masterpiece in all aspects. compelling story and screenplay, amazing comedic timing, clearly a 10/10",
            "review_date": "2021-11-06",
            "source": "rt"
        },
        {
            "content": "It is such a great movie, One of my favorite movies. This movie can attract the audience to interest the show. None of the scenes I missed in this movie. It provides lives during ww2 in Germany and how the children are brainwashed.",
            "review_date": "2021-11-05",
            "source": "rt"
        },
        {
            "content": "Yes! I finally got to see it! This film is very heartwarming, The ‘follow your heart' arc Jojo goes through is simple, but it works well. I love all the characters, they're just so lovable in their own way, even though some of them are awful people, and I hate to say it, but Hitler had me cracking up man. Every word that came outta him was gold. Given the subject matter, the film has some dark scenes that clash with the childlike tone of the rest. That's one of the things that make it great, because when it gets real, it gets real. 10/10 I could definitely see myself watching this again!",
            "review_date": "2021-11-01",
            "source": "rt"
        },
        {
            "content": "Masterpiece. Made me cry at the end.",
            "review_date": "2021-10-29",
            "source": "rt"
        },
        {
            "content": "Absolutely gorgeous film. Hilarious, deeply moving, stylistically beautiful, brilliantly performed and very, very clever. On the list as one of my favourite films.",
            "review_date": "2021-10-24",
            "source": "rt"
        },
        {
            "content": "This is a perfect film that hits on many levels.",
            "review_date": "2021-10-24",
            "source": "rt"
        },
        {
            "content": "The best nazi SATIRE ever!! Pure art.",
            "review_date": "2021-10-22",
            "source": "rt"
        },
        {
            "content": "I loved this movie! I can't say enough it was so good! Cast was great, writing, director all of it sooo good. You will laugh you will cry and in the  will find yourself dancing in the street with happiness. Jojo for Prez!",
            "review_date": "2021-10-16",
            "source": "rt"
        },
        {
            "content": "An odd film.  Somewhat entertaining.",
            "review_date": "2021-10-08",
            "source": "rt"
        },
        {
            "content": "So mixed on this one. The beginning was rocky, but slowly picked up, and then it was sort of bumpy from there. The comedy is for the most part ridiculous and not funny, with some exceptions. At its core the story does have a good message and some memorable parts. All in all though it could have been done better on the comedy side.",
            "review_date": "2021-09-17",
            "source": "rt"
        },
        {
            "content": "So original and touching with surprisingly gaffawing hilarity intensified but it's awkward topic, with a touch of arthouse coolness. Top film for me for years and years.",
            "review_date": "2021-09-16",
            "source": "rt"
        },
        {
            "content": "Esta película es excelente los efectos y en general están perfectamente elaborados con cada personaje que desde jojo hasta Yorkie.\nSe las recomiendo al 100%",
            "review_date": "2021-09-06",
            "source": "rt"
        },
        {
            "content": "Interesting idea and storyline. It felt weird to watch this even though the movie is great.",
            "review_date": "2021-09-05",
            "source": "rt"
        },
        {
            "content": "Another prime example of cinema at its finest and another reason 2019 continues to be one of the best years for films. Jojo rabbit is a blend of humor and heart. Comedic satire that has one dying of laughter and a story that pulls on your heart, makes one cry a river, and captivates the meaning and message of the film. Taika Waititi knew how to tackle such a heavy and tragic event in our history. The plot development, the storyline, and its screenplay were executed well. Standout performances from main characters Roman Griffin Davis, Thomasin Mackenzie, and Taika himself to minor roles such as Rockwell, Wilson, and Allen. Completely unforgettable with an optimistic ending scene that hits the spot.",
            "review_date": "2021-08-30",
            "source": "rt"
        },
        {
            "content": "I give this an unusual 5 stars for creativity and heart.  Great direction and acting.  Slow-moving - yet very moving at the end.",
            "review_date": "2021-08-29",
            "source": "rt"
        },
        {
            "content": "A truly beautiful and heartfelt story. Jojo rabbit perfectly balances telling a realistic and tragic story about world war 2 whilst still managing to deliver on some wholesome comedy and managing to get its message across all while doing so. The dynamic between imaginary Adolf Hitler and Jojo is at first a lot of fun but the further along the movie gets, the more we start to see the serious and dramatic repercussions of what indoctrinations can do to young children. It's these kinds of things that make this movie amazing. The brother sister dynamic between Jojo and Elsa is phenomenal. Both of them have lost everything but over the course of the movie, they find friendship in each other and perhaps more, perhaps even family. And if a certain death scene isn't touching, only Taika Waititi could tug at out heart strings like that. The pure raw emotion shown in a few seconds is just magical. I could keep going on about why this movie is such a masterpiece, its beautiful way of telling an informative story about history whilst still having respect for the original events, its enlightening themes or even the cinematography and costume design. It all comes together like a beautiful tapestry. Another perfect example of how genius of a filmmaker Taika Waititi truly is.",
            "review_date": "2021-08-25",
            "source": "rt"
        },
        {
            "content": "Taika Waititi strikes again! An brilliant satire filled with laughs and heart. Amazing acting all around, including the child actors. A very important film in today's political and social climate that will fling you from crying from laughter to just crying with it's emotional moments.",
            "review_date": "2021-08-24",
            "source": "rt"
        },
        {
            "content": "This, in my opinion, is one of the most touching, funny, satirical and utterly captivating war films I have ever seen. Cast brilliantly, what I took away from this was the war through the eyes of a child. The ridiculousness of how the way the war plays out in front of Jojo was just pure brilliance, with Jojo encountering sobering (and some heartbreaking) departures from that periodically through the film. I experienced every emotion I am biologically designed to feel, and rightly so. The paid critics who slagged this film off are the dads and mothers who will stick a knife in your football if it accidentally went into their garden. \n\nI don't even think 100% is a score that does this film justice, but that's where I have to pitch my score. It's genius. The end scene (incl. score) had me almost bawling uncontrolably. \n\nWhatever you do, watch this film, and fuck Nomadland off. It's shite.\n\nMight I just add: I've never seen Sam Rockwell be anything other than brilliant in anything I've seen him in. Phenomenal actor.",
            "review_date": "2021-08-22",
            "source": "rt"
        },
        {
            "content": "In the first few minutes, I felt like Im about to leave the cinema. Felt too satire and disrespectful. But this movie grows on you SO MUCH in it whole. The cinematography and the acting is amazing. Ive seen it like 3 times in a year and Im definitely gonna watch it again soon.",
            "review_date": "2021-08-14",
            "source": "rt"
        },
        {
            "content": "Touching story yet still funny. Jojo Rabit is a well performed and well told story about a boy who learns to form his own oppinions.",
            "review_date": "2021-08-14",
            "source": "rt"
        },
        {
            "content": "Film-making brilliance to the core. What starts off as edgy, hilarious satire slowly becomes more self-aware as the protagonist becomes more self-aware, leading us to one of the greatest war movies of all time. You can't change my mind. This is Taika Waititi and his cast at their best. Wes Anderson may have competition. 10/10",
            "review_date": "2021-08-10",
            "source": "rt"
        },
        {
            "content": "An absolutely phenomenal piece of cinema! I might never have been touched in those many emotions in any film I've ever watched, and yes, this was one memorable experience!\nJojo finds that his mother is hiding a Jewish girl in the house, and his life takes a twist. He realizes true human nature, and the consequences of hate.\nWhile being a strong \"Hate-Satire\", this film works extremely well as a comedy it was supposed to be. There are so many interesting elements which set the base for some good laughs, for example Jojo's imaginary friend Hitler. He is absolutely delightful to be on screen, and almost the entire time he is, its fun time!\nThe acting by all the characters is amazing, and the leads use their talent and the strongly written script to absolutely hit the wow mark.\nThe story is simple enough, but what makes this film special is the focus on the theme. It is wonderful to have films like these which target teens and adults alike, and deliver the respective message to those who can process it. Very clever indeed.\nNow, talking about the emotion, the film is funny, romantic, sad, depressing, chilling, makes you have a sense of realization, and more. It clearly shows the mindset and passion of a child and how dedicated he is to hos cause, but it all changes once he sees it in real life, and makes him question the reason why that thing is even happening. He learns for himself what is right and what is wrong. Don't let people make you judge something. You will have to see for yourself.\nOverall, a beautiful, finely paced film that will make you cherish every moment, or at least it did for me!",
            "review_date": "2021-08-01",
            "source": "rt"
        },
        {
            "content": "https://youtu.be/oITyNZcBk1k",
            "review_date": "2021-07-30",
            "source": "rt"
        },
        {
            "content": "O filme é fantástico, cada pedaço é importante e impressionante, não imagino o quão horrível deve ter sido a infância de crianças nazistas, que logo cedo foram impostas a ideologias cruéis, e crianças judias que foram mortas por apenas serem. O humor crítico, misturado com o drama horrendo de toda a história, cria uma montanha russa de emoções. Impossível não se emocionar. Todos neste mundo deveriam ser livres pra dançar ou ao menos pensar, mas pessoas que pensam assim, tem o mesmo destino de Rose.",
            "review_date": "2021-07-29",
            "source": "rt"
        },
        {
            "content": "A brilliant balance of heart drama and humour. A film that manages to be so entertaining and emotionally devastating simultaneously featuring some great direction from Taika Waititi",
            "review_date": "2021-07-28",
            "source": "rt"
        },
        {
            "content": "Absolute must watch!",
            "review_date": "2021-07-27",
            "source": "rt"
        },
        {
            "content": "An amazing film with its constant humour and dark ideas that make you laugh and cry as the film plays out. The acting is great with a splendid cast and the way the emotional grasp builds on you is phenomenal. It's a dark story about a Nazi boy hidden in a humorous and heartfilled story.",
            "review_date": "2021-07-26",
            "source": "rt"
        },
        {
            "content": "The first movie in years that moved me.",
            "review_date": "2021-07-24",
            "source": "rt"
        },
        {
            "content": "An odd take on World War 2, but an odd take. ",
            "review_date": "2021-07-23",
            "source": "rt"
        },
        {
            "content": "One of the best satires of the decade! It's crazy, funny, devastating and heart warming.",
            "review_date": "2021-07-18",
            "source": "rt"
        },
        {
            "content": "Witty, original and daring production with some excellent young actors. Hard not to enjoy this dark comedy which is coupled with some sweetness and a good soundtrack.",
            "review_date": "2021-07-16",
            "source": "rt"
        },
        {
            "content": "(SPOILERS AHEAD)I like how all the critics are talking about how this isn’t showing the real side of what happened, and some ether not realizing or not caring that that was the entire point of the movie. It was made to show the perspective of Jojo, of someone who doesn’t even understand the horrors that are happening around him. When I was watching the movie there were a couple kids that I guess were about 7 or 8 and when there was a dark joke they would be the only people to laugh at it, not understanding what was wrong with what they were seeing. This shows that the movie was doing exactly what it was made to do, to those kids the movie seemed completely normal, just like Jojo though everything was ok, until the death of his mother just like Jojo the kids stopped laughing and the jokes. I don’t know why there parents brought them, I guess they didn’t think it would be as dark as it was. Jojo was a masterpiece, I don’t think I have ever experienced such polar opposite emotions while watching a movie. The movie showed how in a way the German people were lead to fight for such a horrible cause and how even the best of heart can be destroyed.",
            "review_date": "2021-07-10",
            "source": "rt"
        },
        {
            "content": "One of the best movies I've seen in a while. The script is fun, touching and emotional, the story is told so, so well and the use of humor helps cement the emotional connection with the characters during one of the most difficult times in history. Well done Taika.",
            "review_date": "2021-07-04",
            "source": "rt"
        },
        {
            "content": "I did not find any of the comedy distasteful, and it did an excellent job of helping to normalize the changing of political opinions in our time as well as the past. Do not be afraid to overcome propaganda.",
            "review_date": "2021-06-30",
            "source": "rt"
        },
        {
            "content": "Pure genius. Comedy and feelings perfectly intertwined.",
            "review_date": "2021-06-19",
            "source": "rt"
        },
        {
            "content": "This film perfectly balances comedy and drama",
            "review_date": "2021-06-11",
            "source": "rt"
        },
        {
            "content": "This movie shines because an absolutely sensitive subject is addressed with careful weird humor. The well thought-out story shows the problem of many children in Germany at that time. The film criticizes without getting morally instructive and judgmental.",
            "review_date": "2021-06-08",
            "source": "rt"
        },
        {
            "content": "FRICKIN' LOVE THIS MOVIE!!! It starts of as a funny story but through out the movie it's getting deep and emotional",
            "review_date": "2021-06-06",
            "source": "rt"
        },
        {
            "content": "If you ever had a nazi phase as a naive little kid you most definitely can relate to this movie. Well in the unlikely case you didn't watching imaginary Hitler behave like an 8 year old funny as hell. The way they make fun about Nazi Germany as a whole doesn't strip away the seriousness of the subject matter. Which isn't that easy to pull off. And the end makes you cry as it should. So good job!",
            "review_date": "2021-06-04",
            "source": "rt"
        },
        {
            "content": "A beautiful and moving film.",
            "review_date": "2021-05-31",
            "source": "rt"
        },
        {
            "content": "Entertaining comedy-drama following a 10 year old boy’s life in Nazi Germany.",
            "review_date": "2021-05-30",
            "source": "rt"
        },
        {
            "content": "99/100. An emotional movie movie that portrays the indoctrination of Nazi Germany's youth during WWII in a satirical yet serious way. Taika Waititi did an excellent job of telling a story that can often be very difficult to tell. The acting performances were outstanding, especially from Roman Griffin Davis and Scarlett Johansson, making you really feel the dynamic between a loving mother and her son. I did not know what to expect going into this movie as I was hesitant to turn it on given the source material, but I am very glad I went with Jojo Rabbit.",
            "review_date": "2021-05-28",
            "source": "rt"
        },
        {
            "content": "Eccentric strategy when approaching Nazism from the perspective of a ten-year-old boy, who believes he is a Nazi, but when he meets the Jewess that his mother hid in a place in the house, he learns to think for himself and to question everything he has. trained. The whole approach of the film is delicate, but firm. The humor present in the film does not overlap with the essential drama that the story carries. The film tells us: \"More love and less hate\". And after I finished watching, I felt for those who couldn't have a happy ending.",
            "review_date": "2021-05-19",
            "source": "rt"
        },
        {
            "content": "Jojo Rabbit - 8.5/10. Jojo Rabbit is a film that needs to be seen in its entirety to understand its overall moral and theme. If you decide to leave halfway or at the beginning of the film due to it's comedic content, well you're missing out. Jojo Rabbit is a film that deals with a heavy subject in a light manner for the first half of the film. There's the absurdity of Taika Waititi's performance, and some of the jokes happen to walk the thin line of funny and \"oh my god.\" Roman Griffin Davis who plays the lead character does a great job of delivering a characterization of a young boy who is unaware of the horrors that are being committed by the very group he wants to join. His eventual friendship with the young woman that his mother (played delightfully by Scarlett Johansson) helps change his viewpoint on what the war is really about. The film takes a more serious tone as the plot goes on, and it takes some interesting turns for a comedy. Comedy helps us deal with certain subjects which are sometimes impossible to deal or listen to. Taika does a fine job of showing how this world would be viewed by a young child, and also does an amazing job of showing how that child grows out of hate by choosing to follow love. Go watch the film! It's definitely a deep comedy film, and probably will divide some people in terms of the way they take the satire. But in my opinion, its a story that needed to be told.",
            "review_date": "2021-05-18",
            "source": "rt"
        },
        {
            "content": "Funny, creative, and emotionally intelligent. Really enjoyed this film!",
            "review_date": "2021-05-17",
            "source": "rt"
        },
        {
            "content": "Tackled sensitive history while being funny.\n\n\n\n\n\n\n\n\nImpressive",
            "review_date": "2021-05-14",
            "source": "rt"
        },
        {
            "content": "It takes the the horrific setting of World War Two, to tell a fresh heartwarming tale of change and love. Probably the most emotional \"comedies\" I've ever seen. Highly recommend!",
            "review_date": "2021-05-13",
            "source": "rt"
        },
        {
            "content": "This masterpiece of a film is the embodiment of a roller coaster of emotions. Crying and laughing at the same time is common throughout the entire movie. It displays a unique perspective you don't normally think of when you think Nazi Germany. While the movie is comical at times, it definitely does make you think of the horrors that were the past.",
            "review_date": "2021-05-12",
            "source": "rt"
        },
        {
            "content": "Taking a comedy sense on this topic and still making a good movie.",
            "review_date": "2021-05-07",
            "source": "rt"
        },
        {
            "content": "7.75/10. Taika Waititi's eccentric brand of melding heart and humor is on full display in 'JoJo Rabbit.' He writes, directs, and stars in this picture - I wouldn't discourage someone who hasn't been a fan of his work from watching, but it has his fingerprints all over it, so you know what to expect. It is filled with youthful spirit and sweetness, derived from the performances of its young leads; Roman Griffin Davis is JoJo, a scrappy runt determined to climb the ranks of the Hitler Youth who is surprised to find a mysterious young jewish girl named Elsa, played by Thomasin McKenzie, living in his walls. Though he does his best to be a model, hateful Nazi, JoJo can't overcome his curiosity as he begins learning about Elsa (though he justifies his getting to know her as reconnaissance). He is a boy in search of identity, and though he started finding one in the Hitler Youth movement, it had not been fully baked into his being – Elsa, and his interactions with his friends and leaders of the Hitler Youth, often leave him in a place of contradicting feelings and beliefs as he attempts to reconcile the hate he has learned with the gentle kindness he feels in his heart. Davis and McKenzie sell this journey of self-discovery with ranging performances that brim with sincerity, humor, fear, and hope. They are supported by some great performances from the adults in the cast, particularly Scarlett Johannsen as JoJo's secretly-Nazi-hating mother, Sam Rockwell who portrays the Nazi offer that leads the Hitler Youth, and Waititi as JoJo's imaginary friend, Hitler. It is a bit problematic, especially in our current cultural context, that Nazis are portrayed in such humorous manner, but it's worth noting the undercurrent of devastation and fear that lies hardly beneath the surface, especially whenever we see Elsa come out of the wall, or in some later anxiety-fueling scenes where Nazis come to JoJo's house to find Elsa. Waititi may make rib on some prominent Nazi figures and the absurd cruelty of their ideology, but he never makes light of the horrors that their victims endured. It is that constant shadow of atrocity that grounds this comedy, and what makes JoJo's quest for identity all the more satisfying by film's end. It certainly has Waititi's (arguably, and I'd argue against this characterization) over-the-top stamp on it, but it also has a likeable cast, a good heart, and a message that is in these times certainly worth hearing.",
            "review_date": "2021-05-05",
            "source": "rt"
        },
        {
            "content": "You should give it another try.",
            "review_date": "2021-05-02",
            "source": "rt"
        },
        {
            "content": "Watch it!!!!! So different! See for yourself. Well-acted. It may be a problem for the Jewish community but Hitler is an idiot in this movie, as he was in real life.",
            "review_date": "2021-05-01",
            "source": "rt"
        },
        {
            "content": "Who said we couldn't laugh at Hittler? Taika Waititi definitely did not and he proved it to us.",
            "review_date": "2021-04-20",
            "source": "rt"
        },
        {
            "content": "Nearly a perfect movie. Smart, funny, witty, heartbreaking, and everything all at once",
            "review_date": "2021-04-17",
            "source": "rt"
        },
        {
            "content": "Movie does a great job balancing humor and the intense emotional drama",
            "review_date": "2021-04-17",
            "source": "rt"
        },
        {
            "content": "A great movie. Talks about serious topics in a funny way, without ever being disrespectful.",
            "review_date": "2021-04-14",
            "source": "rt"
        },
        {
            "content": "commovente e divertente insieme, bella storia, ottimo cast",
            "review_date": "2021-04-10",
            "source": "rt"
        },
        {
            "content": "Definitivamente es una gran cinta, esta llena de distintos momentos, hay momentos comicos, serios, tristes, de alegría , te hace sentir empatía por los personajes..Claro , no es perfecta, pero si te mentalizas que es una sátira de esos momentos, encontraras una gran película , mirala por lo que es y no por lo que esperas que sea ..100% recomendada... Y grandes mensajes de vida que te deja",
            "review_date": "2021-04-08",
            "source": "rt"
        },
        {
            "content": "Jojo Rabbit fits no categories. This can at times make for a difficult watch even outside of its terrifying subject material which is tactfully guised behind a vail of comedy when it so chooses. What is so good about Jojo Rabbit is not only its ability to weave in and out of being hilarious and deadly serious, but also its knack for doing both at the same time.",
            "review_date": "2021-04-06",
            "source": "rt"
        },
        {
            "content": "It was surprisingly good, like really good. I teared up at times and then I laughed a lot as well.",
            "review_date": "2021-04-04",
            "source": "rt"
        },
        {
            "content": "This movie was an outstanding comedy movie that really stood out and told a great story, while also having lots of heart-wrenching moments that really get you feeling sad when you were just laughing. Great movie.",
            "review_date": "2021-04-03",
            "source": "rt"
        },
        {
            "content": "A bold and daring satire with some brilliant dark humor and endearing characters. Not everyone's cup of tea but definitely a fun ride.",
            "review_date": "2021-04-02",
            "source": "rt"
        },
        {
            "content": "Taika Waititi boldly satirizes cracks onto both symmetrical \"Moonrise Kingdom\" and subtlety referencing \"Life is Beautiful\" into the harshest propagandic scenery with perfect parody consisting funny jokes well-mimicked by a nice cast, especially the young lead Roman Griffin Davis examining the combatted anti-hate message like a humble coming-of-age rite. (B)",
            "review_date": "2021-03-29",
            "source": "rt"
        },
        {
            "content": "Love the sense of humour and wit Taika Waititi injects into all his  projects and interviews alike.   This movie is both funny and witty, but I wouldn't term it an outright comedy as it does deal with weighty issues.\n\nThe main character Jojo is a 10 year old and the product of the time he was living in.  His hero and biggest influence being Hitler and Nazism during WW2, making him enthusiastic to join the Hitler youth, typical of the kids of his country at the time.\n\nThis movie is very clever at taking us along with the innocent child who has no reason to disagree with the indoctrination by his government.  At first seeing how he gets along joining these people and the humour of the situations and characters he meets.\n\nWoven through though is a subtle unease that grows as his eyes are opened more and more, challenging his indoctrination and shading the movies tone incrementally darker to the end.\n\nAs an adult knowing all the facts about the time, I began to feel a type of claustrophobia for the characters due to the danger  faced by opposing or being seen to oppose any part of the doctrine.  \n\nThe movie is light enough at the start for anyone to watch, (not being put off by a documentary style war film).   It does not suffer from stereotypical invading Nazi hordes obviously as this is their country.  It is more subtle, showing the propaganda the ordinary person had to live with whether they bought in to it or not.  These are people who must have lived ordinary lives before extremists took power, then began a war, inflicting horrific consequences for those not upholding their ridiculous beliefs.  \n\nThe reality of what kids had to go through in war hit home gently with the dawning of Jojo. We are not hit over the head with tragedy and sombre tones and colours. The weight of the subject matter is beautifully shaded in over the length of the movie, keeping in perfect tone and in my view making it a very enjoyable movie.\n\n My daughter, who was roughly the same age as Jojo at time of first viewing, was introduced to the harrowing issues of WW2 in the most accessible way that made her ask questions and want to know more.",
            "review_date": "2021-03-29",
            "source": "rt"
        },
        {
            "content": "Funny and heartwarming.",
            "review_date": "2021-03-29",
            "source": "rt"
        },
        {
            "content": "JoJo rabbit's notable charm and quirk excite yet it falls short of director Taika Waititi's previous efforts.",
            "review_date": "2021-03-25",
            "source": "rt"
        },
        {
            "content": "Taika Waititi's WWII satire is a funny and sad movie - anchored by great performances from the whole cast that, alongside Taika's charming direction makes Jojo Rabbit a powerful movie.",
            "review_date": "2021-03-23",
            "source": "rt"
        },
        {
            "content": "An incredible film! I can say without doubts that this is my favourite film",
            "review_date": "2021-03-21",
            "source": "rt"
        },
        {
            "content": "Some great moments, but the blend of comedy and drama doesn't work for me. It isn't that it's impossible to make a comedy set in Nazi Germany, but some of the plot felt random and I found a few of the performances (Johansson for instance) overrated.",
            "review_date": "2021-03-16",
            "source": "rt"
        },
        {
            "content": "It was brilliantly done. Waititi is genius. It takes real skill to combine one of the most tragic times in history of humankind with comedy without offending anyone. \nAll the performances were above par, especially Roman's. That kid will be an Oscar winner should he stay in the business.",
            "review_date": "2021-03-14",
            "source": "rt"
        },
        {
            "content": "JoJo Rabbit is another well-rounded master piece from Taika Waititi. I laughed out loud, and bawled my eyes out intermittently. Which is a lot, because i normally feel nothing.\n5/5 would recommend.",
            "review_date": "2021-03-13",
            "source": "rt"
        },
        {
            "content": "Taiki Waititi does a masterful job presenting the horrors of World War II and the Holocaust as seen through the innocent naive eyes of a young boy growing up in Nazi Germany. It will take you on an emotional journey from laughing to crying to feeling good again. JoJo Rabit was my pick for the best movie of 2020 and that is saying something because it had stiff competition; Joker, 1917, Ford vs Ferrari, Parasite (winner) were also worthy in my opinion.",
            "review_date": "2021-03-12",
            "source": "rt"
        },
        {
            "content": "The best movie I've seen in ages. Quirky thoughtfulness throughout a film Taika Waititi's brilliance permeates. Roman Griffin Davis is a joy.",
            "review_date": "2021-03-12",
            "source": "rt"
        },
        {
            "content": "Quem não conseguiu gostar desse filme realmente só pode ter assistido errado! O filme é perfeito!!!",
            "review_date": "2021-03-12",
            "source": "rt"
        },
        {
            "content": "There were very few parts that I found funny. I appreciated the interesting cinematography and unique concept, but I found it quite unsettling as the perspective seems to cause confusion about whom to root for, especially because the audience already knows the historical outcome. Also, some of their accents were difficult to understand.",
            "review_date": "2021-03-11",
            "source": "rt"
        },
        {
            "content": "Great movie! Very well written, actors were spot on.",
            "review_date": "2021-03-09",
            "source": "rt"
        },
        {
            "content": "A truly beautiful movie with so much heart, about one of the worst events in the history of humanity. Despite it's comedic tone. throughout majority of the movie, the movie still takes it's subject matter very seriously and doesn't shy away from extreme drama and emotion.\nThe performances are all incredible with the stand outs being Scarlet Johansson and Roman Griffin Davis.\nIt's absolutely hilarious, depressing, hopeful and optimistic, dark and somber, and inspiring, It has everything a great story needs.",
            "review_date": "2021-03-06",
            "source": "rt"
        },
        {
            "content": "It is fresher than Joe",
            "review_date": "2021-03-01",
            "source": "rt"
        },
        {
            "content": "There are notable issues with its admittedly ambitious tonal juggling act, which sometimes come across as jarring and distracting. However, that is not enough to offset the entire film, which from start to finish is a gorgeously shot, beautifully designed, sharply written, wryly funny, and emotionally engaging satire. It plays as both a subversive ode to over-the-top wartime propaganda and as a thoughtful and mature exploration of the absurdity of war and the euphoria of freedom and liberation.\n\nRoman Griffin Davis gives one of the best child performances of the decade as the titular Jojo, delivering charm, heart, and charisma. Thomasina McKenzie continues to solidify her image as someone to continue looking out for. Scarlett Johannson deserves props for trying something new, and making it work. Taika Waititi does well as a mockery of Adolf Hitler, though his work behind the camera is definitely more impressive and commendable. A standout performance would be Sam Rockwell, whose role in the film was unexpectedly important but ultimately turned out to be heartfelt and enjoyable.\n\nThe cinematography and production design was just amazing to look at. The costume work was also very well-crafted.\n\nOverall, Jojo Rabbit hits way more often than it misses, of which there are few and far in between. Strong performances, palpable emotion, a lovely visual aesthetic, and a challenging exploration of touchy themes help make it one of the more interesting releases of 2019.",
            "review_date": "2021-02-26",
            "source": "rt"
        },
        {
            "content": "Heart, humor and tragedy are all executed at a very high level. Good performances, good concept. Shows Nazi Germany with nuance that ultimately never excuses it.",
            "review_date": "2021-02-25",
            "source": "rt"
        },
        {
            "content": "Bravely putting a coming of age story in a taboo theme limits completely pays off for Waititi. The film delicately touches the topics of love, compassion, role of family and friendship so important for a growing boy. At the same time Waititi manages to tackle the complex theme of nazism using an unexpected power against it – the humour.\nThe film is beautifully shot (that scene with the houses watching!) and the music is just perfectly fit.",
            "review_date": "2021-02-24",
            "source": "rt"
        },
        {
            "content": "This is was actually very funny and serious at the same time. It is a very enjoyable movie. The kid does an amazing job.",
            "review_date": "2021-02-24",
            "source": "rt"
        },
        {
            "content": "I do not understand the good reviews and awards this movie received. I was already bored after the first 20 minutes, but still sat out the movie, hoping that it would become better. It didn't. Not funny, mediocre acting, not exiting, not compelling. What I did like: the cinematography, costumes, art direction and set decoration.",
            "review_date": "2021-02-22",
            "source": "rt"
        },
        {
            "content": "A beautiful blend of humor with creative story twists ",
            "review_date": "2021-02-21",
            "source": "rt"
        },
        {
            "content": "A touchingly suites film about a little boy who grew up in Nazi Germany. It’s whimsical at first but the nature of Germany in the 1940s slowly shows its left. ",
            "review_date": "2021-02-19",
            "source": "rt"
        },
        {
            "content": "The script, characters, humour, its 10/10\nHuman creativity and talent to its fullest.",
            "review_date": "2021-02-18",
            "source": "rt"
        },
        {
            "content": "This film is very dense. It reminded me of a 90s film if that makes any sense. Meaning that it takes its time when it needs to, it is very layered and yet the characters are very \"movie-like\". It just feels like an old-fashioned movie and I really appreciated that. It allows you to invest and explore it as it unfolds. I was very moved by Sam Rockwell's performance and character arc. The most impactful scenes of the movie came from him as we learn about his character. Overall, it's a strangely fun, yet heartfelt movie that people especially need to see in today's world... It's not preachy though.",
            "review_date": "2021-02-17",
            "source": "rt"
        },
        {
            "content": "surprisingly good movie, sharp and wise.",
            "review_date": "2021-02-15",
            "source": "rt"
        },
        {
            "content": "A great film that is comedy, drama and different in a good way.",
            "review_date": "2021-02-13",
            "source": "rt"
        },
        {
            "content": "Really phony. The final scene is gag inducing, as are the final words on the screen before the end credits, which did not come soon enough.",
            "review_date": "2021-02-09",
            "source": "rt"
        },
        {
            "content": "A very good story, paring with some very good humor.",
            "review_date": "2021-02-08",
            "source": "rt"
        },
        {
            "content": "Jojo Rabbit shows Taika Waititi  is a star in the making. Furthermore, Roman Griffin Davies shines as a star in the making. Scarlett Johansson, in my opinion, steals the film with her excellent supporting performance as Jojo's mother. A must see!",
            "review_date": "2021-02-07",
            "source": "rt"
        },
        {
            "content": "A fantastic film. Smartly written, quirky, heartfelt. I loved it.",
            "review_date": "2021-02-05",
            "source": "rt"
        },
        {
            "content": "I love how they make fun of how ridiculous the whole \"Heil Hitler\" thing was. The way you had to say it all the time to everyone that came in and out of your sight. An obvious satire that highlights how ridiculous and demented some of the Nazi's practices were. And how easily everyone was brainwashed. I love how they touched on the topic of how the Nazi's were the actual weak race and everyone else whom the Nazi's killed, were the stronger ones. It's funny how Adolf has the mindset of a 10 year old since it's Jojo's personification of him. \n\nThe little blonde kid did a fantastic job playing Jojo. The little subtleties in his mannerisms and his comedic timing were great. I love how much this movie makes fun of and pokes fun of Nazi's. Man that tall German gestapo guy was menacing as hell. Perfect casting for that character. Reminds me of the guy in Raiders of the Last Ark. \n\nWow, holy shit I was not expecting that moment the camera pans up from the butterfly and shoes his mother's shoes dangling in mid air. Wow, that hit hard. I was hoping that it was just a bad dream that he was having, but it wasn't. I guess it had to happen for him to wake up and realize that this whole Nazi thing is bullshit, but also as a means of growing up and becoming a man. \n\nI swear when the little blonde kid and his black haired friend are together, it's the best thing. The little black-haired kid is so funny. I can really appreciate that message Taika got across about our children going off to fight in a war. We don't want our children to go out and fight in a war that they have no idea about or why we're fighting in the first place. I love what Sam's character did for Jojo at the end there, pretty much saved him from getting shot. \n\nThis movie's almost too campy but it ended up being really sweet and cute. Taika used some pretty good camera effects and techniques. He's pretty clever and hilarious, he really gets comedy. The aesthetic reminded me a little bit of Wes Anderson. Sam, as always, was fantastic; I mean… fantastish! Quite the beautiful movie in both its message and story. I absolutely loved this movie!",
            "review_date": "2021-02-04",
            "source": "rt"
        },
        {
            "content": "pure brilliance by taika waititi",
            "review_date": "2021-02-01",
            "source": "rt"
        },
        {
            "content": "The story has comic and dramatic moments that fit into is perfectly, every actor does a good job, great movie, Taika Waititi is a great director",
            "review_date": "2021-01-31",
            "source": "rt"
        },
        {
            "content": "A fantastic film! You come for the goofball comedy with a silly version of Hitler and stay engrossed in the real drama on presentation. Is it deep and game-changing? No, it has its fair share of WWII tropes. It isn't trying to reinvent the wheel by any means. But that's the inherent appeal. It's modern and fresh, and not burdened by how WWII films should be presented. Evil nazis? They're literally buffoonish comedy characters. Hitler youth? It's like a goofy summer camp for kids. And yet, despite this comedic reframing, the film doesn't try to color over or dodge the true awfulness of the war, in all its context. By the end you wouldn't be remiss if you forgot you were watching a comedy. And that's the key to new views of old, \"traditional\" subject matter for films to cover; the reframing itself is the entertainment, and without restriction, you can explore the topic in any way you choose.",
            "review_date": "2021-01-30",
            "source": "rt"
        },
        {
            "content": "Incrivelmente cativante! A comédia é muito boa, apesar de que não cheguei a rir em nnenhum momento, e o desenvolvimento do protagonista é formidável. A direção também tem ótimas sacadas e a atuação, principalmente do Jojo, ficou excelente.",
            "review_date": "2021-01-29",
            "source": "rt"
        },
        {
            "content": "Fantastically original, if a little underwhelming.",
            "review_date": "2021-01-26",
            "source": "rt"
        },
        {
            "content": "I loved it. Only watch if you have a sense of humor. \nIf you are the type of person that thinks that everything has to be handled with respect this might not be for you.",
            "review_date": "2021-01-22",
            "source": "rt"
        },
        {
            "content": "Jojo Rabbit is both a hilarious and touching movie  and succeeds greatly at both. This movie clearly intends to show the absurdity of Hitler's dogmatic worldview through comedy. But it also the real impact of such views and the harm they can cause. It is touching, refreshing, self-aware, shocking, and hilarious.",
            "review_date": "2021-01-21",
            "source": "rt"
        },
        {
            "content": "Jojo Rabbit dares to compete with Robert Benigni's Life Is Beautiful (1997) and comes away looking very accomplished.  \n\nAs reviewers have noted, JoJo commits more to Monty Python than it commits to being a dedicated dramatic-comedy.  Life Is Beautiful is a rare 10/10 in this category (updating Chaplin creatively and effectively).  \n\nJoJo has a wealth of assets:  the lead child actor, the wonderful visual framing of many shots, vibrant colors and wardrobe, Scarlet Johanson, Sam Rockwell and Rebel Wilson all contributing significantly, plus several twists and turns keeping  audiences from settling into tropes, cliches, and/or sentimentality.  \nIt's pretty great.  FYI two online articles comparing Jojo Rabbit with Life Is Beautiful:\n\"Jojo begs us to re-examine the role of humor in addressing the Holocaust\" at \nplus61j.net.au/\n\"Jojo Rabbit and Life Is Beautiful use the same contrasting narrative tools — Nazi Germany and a child's perspective\"  at firstpost.com",
            "review_date": "2021-01-21",
            "source": "rt"
        },
        {
            "content": "Jojo Rabbit is about a ten year German boy in Hitler's army training to be a soldier during the final years of WWII. Roman Griffin Davis plays the little boy who finds out that his mother played by Scarlett Johansson was hiding a Jewish girl in their home. Director Taika Waititi brought a creatively sad and humorous storyline to life and he acted as the protagonist Adolf in Jojo's mind. During a time of tragedy and horror, humanity shows love always prevails even during time of war. Sam Rockwell, Rebel Wilson, Alfie Allen, and Stephen Merchant round up the supporting German cast. The movie was nominated for multiple Oscar and it won the award for Best Adopted Screenplay. The storyline will make you laugh, cry, and make you mad but overall it was a great movie with a great script and wonder actors.  Definitely add this to your list.",
            "review_date": "2021-01-17",
            "source": "rt"
        },
        {
            "content": "Review: Jojo Rabbit is an absolute must-see, due to its eccentric tone, hilarious but not in your face jokes, stellar performances (Scarlett Johansson got an Oscar) and surprisingly dark and heart-breaking moments. The way Takia Watiti blends callbacks and metaphors into the script - the butterflies, shoes, stare an lion in the eye, etc. - is genius, making rewatches worth it, and the saitre is there, but not in front of character or story. The first 10 minutes are funny but disjointed, but from there it's a roller-coaster of laughs and emotions, with Roman Griffin-Davis and Thomasin McKenzie putting in incredible, emotionally powerful performances, while Waitit himself as Hitler, along with AA perfect supporting cast, make it a beautiful satire that could become a classic. | Grade: A",
            "review_date": "2021-01-15",
            "source": "rt"
        },
        {
            "content": "World War II is a tired, well-trodden landscape, but this film felt wholly original. Near-farcical comedy involving Hitler and Nazis could easily become uncomfortable or inappropriate with sloppy writing, but the film puts out a thick, constant stream of satire immediately, leaving no room for ambiguity with the viewer. Fun, funny and poignant.",
            "review_date": "2021-01-12",
            "source": "rt"
        },
        {
            "content": "An astonishing mix of comic, emotional, and dramatic moments",
            "review_date": "2021-01-10",
            "source": "rt"
        },
        {
            "content": "This is a fantastic film, the focus is Jojo the 10 year old boy and all that a 10 year wants to fit in and has to do to try to make sense of the world. The WWII and Nazi setting is really in the end incidental, its the very challenging backdrop to examine these themes, just the vehicle for examining that. This is especially obvious when you consider this in the context of Taika Waititi's brilliant other films about boys facing the same confusions - Boy; The Hunt for the Wilderpeople... A totally brilliant watch. \n\nThe critics that take offense are looking at the film with far too black and white lenses and thinking that its primarily a film about Hitler and the Nazis. Its really not, they miss the point entirely.",
            "review_date": "2021-01-09",
            "source": "rt"
        },
        {
            "content": "Never ever stop making movies Watiti. I was pretty skeptical going into this movie as the concept of comedic Nazis in the eyes of a 10 year old boy during WW2 seemed really odd and tonally inappropriate and the trailers did not help but damn this movie is amazing! The jokes are so funny and placed appropriately so it does not ruin the tensions of scenes, every actor gives 10/10 Oscar worthy performances and they all have great dynamics and chemistry and this movie is always entertaining with perfect pacing and it's a great great story about Jojo overcoming Nazi beliefs through this Jewish girl that progresses realisticslly. This movie also has so much heart and despite being so funny, it's so emotional as well. If this movie was longer and we spent more time seeing Jojo interact with the other characters as well as learning what happened to his father and sister in more detail, I would give it a 5/5 but regardless, go see this movie. You'll not be disappointed despite the silly premise",
            "review_date": "2021-01-09",
            "source": "rt"
        },
        {
            "content": "Rather than a laugh a minute comedy that the trailer presents, Jo Jo Rabbit doesn't shy away from some of the complexities that is raised, and instead meets them head on with grace and sophistication that perhaps lesser writers and directors would of simply papered over or chosen to ignore. A brilliant cast with heart warming moments, like all good films it leaves you wanting more.",
            "review_date": "2021-01-08",
            "source": "rt"
        },
        {
            "content": "\"Jojo Rabbit\" is an amazing story about a German boy who finds out his mother is hiding a Jewish girl in their house that is both hilariously funny and very emotional. It rightfully won the Oscar for Best Adapted Screenplay and deserved to win more. Scarlett Johansson, Taika Waititi, Sam Rockwell, Roman Griffin Davis, and Thomasin McKenzie all have phenomenal performances. The cinematography is visually stunning, the colors are vibrant, and the symbolism of shoes used in this movie is truly remarkable. Overall, this is a fantastic movie and one of the best of 2019. For that, I give \"Jojo Rabbit\"... 5 stars.",
            "review_date": "2021-01-08",
            "source": "rt"
        },
        {
            "content": "Amazing. It's an emotional film with humor and sadness. \nIts a film that only really makes sense from the perspective of a 10 year old boy. If you take it that way then it's truly a brilliant film.",
            "review_date": "2021-01-06",
            "source": "rt"
        },
        {
            "content": "One of my favourites from recent years. Waititi, who really can't do a German accent, plays Hitler. But it's a very superficial Hitler. You can't quite dislike Hitler like you should or understand why a 10-yr-old would idolize him so. Nevertheless, a fun part. There are many enjoyable actors, starting with the three youths, and Johanssen, Rockwell and Wilson. Lots of great dialogue. I really liked the relationship between Jojo and Elsa and how it develops from ignorance to love.",
            "review_date": "2021-01-05",
            "source": "rt"
        },
        {
            "content": "What a beautiful movie... it will make you laugh, it will make you cry... a perfect blend of emotion, comedy and political message without feeling forced... BEAUTIFUL!!!!!",
            "review_date": "2021-01-05",
            "source": "rt"
        },
        {
            "content": "Very sweet and kind comedy of a young Nazi boy who befriends a Jewish girl. Some of the jokes stick whilst others fall flat.",
            "review_date": "2021-01-05",
            "source": "rt"
        },
        {
            "content": "WWII is not a laughing matter. The jokes are disturbing, not funny.",
            "review_date": "2021-01-04",
            "source": "rt"
        },
        {
            "content": "Emotional roller-coaster",
            "review_date": "2021-01-02",
            "source": "rt"
        },
        {
            "content": "FANTASTIC! One of the best films I have ever seen. The story, the acting and the cinematography are breathtaking for a satyrical dark comedy.",
            "review_date": "2021-01-02",
            "source": "rt"
        },
        {
            "content": "Beautifully shot, great narrative, exceptionally witty and tender in all the right places.",
            "review_date": "2021-01-01",
            "source": "rt"
        },
        {
            "content": "This film is absolutely amazing! The characters are splendid and seeing the relationships between them grow throughout the movie was truly heartwarming. 10/10 recommend!",
            "review_date": "2021-01-01",
            "source": "rt"
        },
        {
            "content": "Wonderful actors, direction and tone. It's hard to fault the brilliance of this movie, but it may not be for everyone due to complex humour.",
            "review_date": "2020-12-30",
            "source": "rt"
        },
        {
            "content": "A rather polarizing film about a young boy named Jojo living in nazi Germany. The boy is recruited by Hitler's army to aid in the fight in the dying days of World War II. We learn that JoJo's mother Rosie, is in cahoots with the resistance and he learns that his mother has been hiding a Jewish girl from harm in a false wall in their home. Jojo now faced with an internal struggle between what he truly believes is right in his heart and what the fascist regime has led him to believe his entire life. With the help of his boisterous imaginary friend, the one and only Hitler. \n\nWhat a wild concept never have we seen a film with such commixture to seamlessly show the harsh realities and horror of the time period and light satirical humor that blends quite beautifully, bravo Taika Waititi.  This is a very audacious film however and may be out of taste to many. Lest us forget this is film and acting, the only place where such subject matter should be able to be touched at this point without scrutiny.",
            "review_date": "2020-12-28",
            "source": "rt"
        },
        {
            "content": "It was quite funny and serious at the same time. Some heart breaking scenes. A good movie with all the ingredients of comedy and tragedy.",
            "review_date": "2020-12-27",
            "source": "rt"
        },
        {
            "content": "I do wish it was less twee in some regards but I am impressed that the movie seems to have managed avoiding the satire paradox.",
            "review_date": "2020-12-27",
            "source": "rt"
        },
        {
            "content": "A fantastic laughter filled comedy, with a tragic but meaningful plot",
            "review_date": "2020-12-27",
            "source": "rt"
        },
        {
            "content": "This movie is hilarious and deep at the same time and executed in just the right way to make an OUTSTANDING film.",
            "review_date": "2020-12-26",
            "source": "rt"
        },
        {
            "content": "this film has no business being so frickin' charming & fun with it's very controversial story framework",
            "review_date": "2020-12-26",
            "source": "rt"
        },
        {
            "content": "It's delightful, joyous and has wallpaper to die for.",
            "review_date": "2020-12-26",
            "source": "rt"
        },
        {
            "content": "What a fun movie! It isn't too grim and dark, but it has enough comedy to make this a great movie.",
            "review_date": "2020-12-25",
            "source": "rt"
        },
        {
            "content": "Jojo Rabbit is a controversial comedy that takes place during World War 2 in Germany. Although it didn't have a big controversy I thought people would find this offensive.  Jojo Rabbit is amazing! Scar Jo is an awesome supporting character. Also the entire cast is amazing, I can't list all the performances that had me in tears.\n\n\nOSCAR WORTHY!",
            "review_date": "2020-12-22",
            "source": "rt"
        },
        {
            "content": "I couldn't bring myself to watch this slapstick garbage. The first 15 minutes were filled with racist, sexist deprecation of children. Seeing Rebel Wilson (whom obviously couldn't follow the instructions of her voice coach and drop her westie bogan accent) cast was the final straw for me. Waste 2 hours on something more worthwhile.",
            "review_date": "2020-12-21",
            "source": "rt"
        },
        {
            "content": "Surreal view through the eyes of a 10 year old boy of the end of WWII Germany. Scarjo best actor in it.",
            "review_date": "2020-12-20",
            "source": "rt"
        },
        {
            "content": "I know the event this takes place during is one of the darkest in human history and as such should be expected to take things more seriously. Waititi doesn't do that. Instead he makes this another one of his films, one that fits into his canon. I got so lost in what I loved about the film I stopped caring about how serious it was. Thomasin Mckenzie and Roman Griffin Davis steal the movie. ",
            "review_date": "2020-12-19",
            "source": "rt"
        },
        {
            "content": "Its fun and entertaining",
            "review_date": "2020-12-13",
            "source": "rt"
        },
        {
            "content": "JOJO RABBIT is a funny, heartbreaking, and realistic psychological study of a young boy in World War II, and another worthy installment from the great Taika Waititi.",
            "review_date": "2020-12-08",
            "source": "rt"
        },
        {
            "content": "Really enjoyed this farce through 2nd world war horror. Everything was really charming and a joy to undertake. Both moving and poignant in respectable turn. Loved it.",
            "review_date": "2020-12-06",
            "source": "rt"
        },
        {
            "content": "An emotional roller-coaster -- in a good way! Utterly touching and heartfelt. See it!!",
            "review_date": "2020-12-05",
            "source": "rt"
        },
        {
            "content": "iloved the history thru a unique view",
            "review_date": "2020-12-04",
            "source": "rt"
        },
        {
            "content": "This movie is good. Really good. The movie knows how to address serious and sad emotions and topics without being too dark. It balances the dark with the comedy, which is a weird genre for a movie about the second world war. The jokes work, the acting is incredible, the writing is actually impressive and the movie addresses everything. When i say everything, i mean everything. Comedy, Drama, Serious scenes. It is all mentioned and addressed in the most mature way possible. It is heartbreaking and heartfelt at the same time. The only reason why i don't think is perfect, is that it has to much comedy. It doesn't ruin the movie, but it is simply too much for me to give it 5 stars. If you don't really care about that, then you will love it.",
            "review_date": "2020-12-04",
            "source": "rt"
        },
        {
            "content": "Hitler was a rock star and the opening of JoJo Rabbit, with the fuhrer exiting planes and waving to adoring fans all set to The Beatles' \"Komm, gib mir deine Hand\" (\"I Want to Hold Your Hand\") was funny and terrifying all at once. In fact, Hitler was such a star that he captured the imaginations of German youth to the point where Johannes \"JoJo\" (Roman Griffin Davis) conjures him as an imaginary friend (Taika Waititi) — that's where this adventure begins. It's funny, but dark, as JoJo is thrust into the dilemma of supporting his beloved Germany — in the indoctrinated, Hitler Youth kind of love — and reporting the Jewish girl (Thomasin McKenzie) stowed away in his sister's old room to the authorities, or keeping his mouth shut, as doing so will protect his mother's (Scarlett Johansson) and hers. Elsa's \"Lessons on the Jew,\" again, toe the line between hilarious and frightening, as JoJo takes the outlandish statements — from the well-known \"Jews have horns,\" to the lesser-known \"Jews live underground\" — as absolute fact. Let's talk about Hitler. Waititi's performance as the silly side-kick of JoJo's imagination is commendable, and I especially enjoyed the gag of him constantly offering his young friend a cigarette. The scene where Hitler is lying in JoJo's bed, as \"friend's keep their friend's beds warm\" was probably the best line. Hitler does take a back seat the second half of the film, which I think was a smart move as it let the seriousness set in and silliness subside. Sam Rockwell as Captain Klenzendorf, the alcoholic Nazi officer and youth camp director has the single funniest moment as he finally gets to showcase his Elton John-like battle uniforms as the Allies come closin' in. His second-in-command and secret gay-lover, Finkle (Alfie Allen (Theon from GoT)) did seem like a waste, as he barely had a single line. Of course, the film is far from just a satire with childish Nazis and touches on the very real, very futile resistance movement ordinary German people took up against the Third Reich with JoJo's mother, Elsa — if you're interested in the topic, I recently read Han Fallada's excellent novel, Every Man Dies Alone. When you see those red shoes again… it's a gut-punch, if I've ever felt one. JoJo Rabbit takes dark point in history — and an actual book on hitlerjugend \"Caging Skies\" — adds an original spin, and somehow makes it fun without losing the importance of the message.",
            "review_date": "2020-11-30",
            "source": "rt"
        },
        {
            "content": "It was an OK film. The plot wasn't as well developed as it could have been. A little bit of a disappointment as I expected a lot more from the trailer.",
            "review_date": "2020-11-30",
            "source": "rt"
        },
        {
            "content": "A nice commedy, with some serious messages.",
            "review_date": "2020-11-29",
            "source": "rt"
        },
        {
            "content": "Nowhere near as sharp as it needs to be, or as clever as it thinks it is.",
            "review_date": "2020-11-28",
            "source": "rt"
        },
        {
            "content": "It's probably one of my favourite films of all time. The comedic parts are great and life your spirits and the lows so you the fragility of life. 100% recommend!",
            "review_date": "2020-11-23",
            "source": "rt"
        },
        {
            "content": "Brilliant on so many levels will make you laugh and cry.",
            "review_date": "2020-11-21",
            "source": "rt"
        },
        {
            "content": "This movie manages to push the boundaries by making a movie addressing the issues of hate speech and prejudice disguised as a comedy about Nazis. That takes some boldness, and Taika Waititi pulls it off in a way that many people can relate. Give this a watch if you have the chance.",
            "review_date": "2020-11-20",
            "source": "rt"
        },
        {
            "content": "I loved this quirky film.  It clearly ridiculed any belief in blind hatred.  Great visuals.",
            "review_date": "2020-11-20",
            "source": "rt"
        },
        {
            "content": "I did not enjoy watching it \nIt seemed :/ \nAnd a bit too much",
            "review_date": "2020-11-20",
            "source": "rt"
        },
        {
            "content": "Jojo Rabbit is a decent film. It is about a young boy in Hitler's army who finds out his mother is hiding a Jewish girl in their home. Roman Griffin Davis and Scarlett Johansson give good performances. The screenplay is a little slow in places. Taika Waititi did an alright job directing this movie. I liked this motion picture because of the humor and drama.",
            "review_date": "2020-11-18",
            "source": "rt"
        },
        {
            "content": "A surprise, but a welcome one at that! Watiti delivered a film I wasn't expecting of him, full of themes and an emotional narrative. While still having element of humor (which was ok), this film focus was that of a genuinely beautiful film. I",
            "review_date": "2020-11-16",
            "source": "rt"
        },
        {
            "content": "the film seems to be bad at first impression but he and the counterpart, well, his characters have great performances, script he has a strong charisma, well, watch this film.",
            "review_date": "2020-11-15",
            "source": "rt"
        },
        {
            "content": "Seriously misjudged.  Not funny, badly written and dangerous.  Should never have been made",
            "review_date": "2020-11-15",
            "source": "rt"
        },
        {
            "content": "All I can say is.... Wow. What a powerful and beautiful movie, with such an incredible fusion of comedy and drama. What an incredible performance by all the actors in this movie also, along with the writing for it was so perfect put together",
            "review_date": "2020-11-14",
            "source": "rt"
        },
        {
            "content": "What?... How did this rate so highly, barely got 20 minutes through before I had to turn it off, no as good as the ratings suggest",
            "review_date": "2020-11-14",
            "source": "rt"
        },
        {
            "content": "Taika Waititi manages to successfully balance comedy and heavy subject matter in this World War II satire. Jojo Rabbit is one of those films that will run you through the mill of emotions. It will make you laugh and it may even make you cry. One thing that this film benefits from is its charm. The relationship between both Roman Griffin Davis and Scarlett Johansson's character is really charming. All the performances in this film are strong; Sam Rockwell is great and Taika Waititi plays a satirical version of Hitler and pulls it off nicely. There are many sudden tonal shifts but Waititi manages to pull that off too. I don't have many issues with Jojo Rabbit; sometimes the pacing felt a little off but other than that this is a very well executed film that I would definitely recommend, especially if you are a fan of satires and/or comedy-dramas.",
            "review_date": "2020-11-11",
            "source": "rt"
        },
        {
            "content": "funny.excentric.not a new theme, but gets a succesful way to promove it, jojo rabbit is a movie about how naive german kids could get on second war, and how innocent they are when it comes to political decisions, the movie shows a aryan doing the one thing they most feared at those times: talking with a jewish person. loved the dark humor at a point i didn't felt guilty to laugh at it.",
            "review_date": "2020-11-09",
            "source": "rt"
        },
        {
            "content": "One of 2019's biggest films and something as strange as a Nazi themed film with kids in the biggest roles - also labled as a comedy. Johannes is trying to be the perfect Nazi. He attends school and learn all the Nazi things. When he discover a Jewish girl living and hiding in his house the plot is really settled. A fine film by funman Taika Waititi that also plays an imaginative Hitler within Johannes mind. The funniest thing by far here.\n\nNot really that funny, but some characters and scenes work well. Dramatic at times but I agree with the comedy mark. In total a bit of a let down.\n\n7 out of 10 shoe laces.",
            "review_date": "2020-11-08",
            "source": "rt"
        },
        {
            "content": "Flat out amazing. Was very entertaining and endearing.",
            "review_date": "2020-11-08",
            "source": "rt"
        },
        {
            "content": "A fantastic movie that is a roller coaster of emotions to get across a clear message. An albsolute must see!",
            "review_date": "2020-11-07",
            "source": "rt"
        },
        {
            "content": "Jojo Rabbit delivers a very unique and refreshing brand of satire that turns into an enjoyable film, only dragged down by the platonic love plot.",
            "review_date": "2020-11-03",
            "source": "rt"
        },
        {
            "content": "this should have won best picture",
            "review_date": "2020-10-27",
            "source": "rt"
        },
        {
            "content": "It was going to be tough, making a film about the Nazi youth where the young protagonist's imaginary friend is Hitler himself. Adding that it is to be a comedy satire must have felt like a pretty daunting task. \n\nWhat Taika Waititi has done with Jojo Rabbit is nothing short of spectacular. The comedy moments are handled exceptionally as Jojo, a young boy in theHitler youth begins an unlikely  friendship with Elsa, the young Jewish girl who his mother is hiding within the walls of their house.\n\nThe young cast of Roman Griffin Davis as Jojo, Archie Yates as Yorki, Jojo's loveable friend, and absolute star in the making Thomasin Mckenzie as Elsa are all fantastic in what is a movie that will make up feel every emotion throughout. Sam Rockwell is excellent, Scarlett Johansson's performance as Jojo's mother deserved just as much recognition her outing in Marriage Story.\n\nYou can tell Waititi put everything into this movie and handled the subject matter with respect and has brought all of us a perfectly crafted story of Heartbreak, Growth, Love and Hope.\n\nIt is a must-watch.",
            "review_date": "2020-10-27",
            "source": "rt"
        },
        {
            "content": "An unique fun movie that became a sad movie and ended lighthearted and really enjoyed it.",
            "review_date": "2020-10-25",
            "source": "rt"
        },
        {
            "content": "It was interesting and a new take on Nazi Germany but personally I don't like watching a kid look to Hitler as his role model. I get what they were trying to do and I think it was a creative film but not for me personally. Some might really enjoy it and some might not. It's right in the middle for me. I'm not sure if it was deserving of an academy award nomination for best picture but definitely a creative movie.",
            "review_date": "2020-10-25",
            "source": "rt"
        },
        {
            "content": "Truly didn't know what it was about so I thought it was different but very good.",
            "review_date": "2020-10-25",
            "source": "rt"
        },
        {
            "content": "I was skeptical of this movie before I saw it. I went into it looking for something to be offended by. But as I got into it, it was easy to see why it has been called one of the best movies of 2019. The comedy and satire are there, but they are not what the film is built upon. This movie is hilarious, tragic, cute, and inspiring all rolled into one.",
            "review_date": "2020-10-25",
            "source": "rt"
        },
        {
            "content": "PG-13 Pan's Labyrinth. This is a compliment.",
            "review_date": "2020-10-21",
            "source": "rt"
        },
        {
            "content": "Regardless of the WWII background, this film is ultimately a heartwarming story about a boy's journey against conformity and towards self-discovery and self-redemption.  Very unique setting, witting dialogues, and amazing acting by the young protagonists.  Absolutely must see.",
            "review_date": "2020-10-19",
            "source": "rt"
        },
        {
            "content": "A very good movie with a funny premise.",
            "review_date": "2020-10-17",
            "source": "rt"
        },
        {
            "content": "Jojo Rabbit tries and fails to be a Wes Anderson film. There's a lot of cutesiness and sickly whimsy that doesn't work at all. It's off-putting, like an adult dressed as a toddler trying to be adorable.",
            "review_date": "2020-10-15",
            "source": "rt"
        },
        {
            "content": "The best movie ever!!!!",
            "review_date": "2020-10-12",
            "source": "rt"
        },
        {
            "content": "Really a perfect movie in my opinion.  The juxtaposition of the terroristic nazi forces clashing with adolescent innocence and wonder. When a movie can make me laugh, feel sadness, root for a character and hate another; it finds a special place in my heart.  Beautiful use of colors as well.  Just became one of my all-time favorites.",
            "review_date": "2020-10-12",
            "source": "rt"
        },
        {
            "content": "A charming and funny film about a touchy subject with stand out performances right across the board.",
            "review_date": "2020-10-10",
            "source": "rt"
        },
        {
            "content": "Brilliantly acted and hilarious. Roman Griffin Davis gives such an amazing performance it's impossible to believe he was 11-12 when filming it. Written and directed by Taika Waititi (who also hilariously and convincingly portrays imaginary Hitler), this film deserved more accolades than it received as it's heartbreakingly witty and refreshingly funny.",
            "review_date": "2020-10-07",
            "source": "rt"
        },
        {
            "content": "Blending the drama and tragedy of Nazi Germany with the wit and humor of director Taika Waititi, Jojo Rabbit turns out to be one of the most unique and hilarious comedies of the century. While it may have a lighter tone to something so dark and serious, the movie still manages to be very careful and in a way that is truly inspiring.",
            "review_date": "2020-10-07",
            "source": "rt"
        },
        {
            "content": "How critics didn’t universally love this movie is mind blowing ",
            "review_date": "2020-10-05",
            "source": "rt"
        },
        {
            "content": "Too complex for a kid story,\nToo silly for adult to embrace.",
            "review_date": "2020-10-04",
            "source": "rt"
        },
        {
            "content": "A black satire always will have some audience alienation. JoJo Rabbit is funny and ridiculous, but also tender-hearted. Greatly acted by its cast, with MacKenzie and Rockwell standing out to me in particular.",
            "review_date": "2020-10-04",
            "source": "rt"
        },
        {
            "content": "A nice surprise! good humor, touching movie.",
            "review_date": "2020-10-03",
            "source": "rt"
        },
        {
            "content": "Such great acting, and script writing.  Incredibly funny, but also tragic.  This is a wonderful story brought together by an amazing child actor.  This is one heartfelt movie, and it has made it in my top 10 movies.",
            "review_date": "2020-10-03",
            "source": "rt"
        },
        {
            "content": "Jojo is the a character that thinks being racist is good, but he's also really innocent. He thinks Hitler is his hero, and hates jewish people. Until he finds Elsa hidden in his house, and he eventually becomes friends with her. Later on in the story, he falls in love with her, and realizes that being jewish is not a bad thing. This film displays that no one should be treated different because of their race, beliefs or sexual orientation.",
            "review_date": "2020-09-28",
            "source": "rt"
        },
        {
            "content": "To be honest I didn't know what to think of this movie before watching it.  It did not go the way I thought it would and though not as funny as I hoped it would be the story is solid and compelling.  I ended up really enjoying it.  Worth the watch.",
            "review_date": "2020-09-28",
            "source": "rt"
        },
        {
            "content": "Distinctly strange film, somewhat slapstick and somewhat dark, and all good. I can't help wondering how this pitch was made... \"it's a coming of sort of thing with an imaginary Hitler, Fumbling nazi trainers, a beautiful mom, a hiding Jew, and the fall of the Third Reich. It's got something for everyone!\" Don't miss this very odd movie. Great entertainment.",
            "review_date": "2020-09-28",
            "source": "rt"
        },
        {
            "content": "I absolutely loved the blend of History with humor and emotion....getting to see through the eyes of a child and seeing the progression.  Well done an kept me very engaged.... If you loved Schindler's list, you will be emersed in this story!",
            "review_date": "2020-09-27",
            "source": "rt"
        },
        {
            "content": "This movie is really good!  It makes you laugh and cry.  The supporting cast led by Sam Rockwell and Scarlett Johansson is GREAT!  The real scene stealer is Yorki (played by Archie Yates), this character is hilarious.  I will probably be rewatching this movie very soon.  It does such a good job showing how a young boy could be influenced by something so wrong.",
            "review_date": "2020-09-27",
            "source": "rt"
        },
        {
            "content": "Trovare un film originale nel 2019 parlando di seconda guerra mondiale è un'impresa.\nJojo Rabbit si piazza in una nicchia mai esplorata, e lo fa in maniera spiazzante, passando dalla commedia irriverente al dramma puro.\nScarlett Johansson è splendida interprete e Sam Rockwell è totalmente a suo agio.\nLa sceneggiatura è semplicemente un capolavoro, Oscar meritatissimo.",
            "review_date": "2020-09-27",
            "source": "rt"
        },
        {
            "content": "Awesome cast and great storytelling.",
            "review_date": "2020-09-27",
            "source": "rt"
        },
        {
            "content": "An uneven hodgepodge of Monty Python Nazis with The Diary of Anne Frank\nIn my opinion, this was totally undeserving of all the Oscar nominations it received. 70% silly, 30% serious; and barely anything original happens besides an imaginary Hitler hook that's presented in a mannerism that's too juvenile to hold in high regard.",
            "review_date": "2020-09-26",
            "source": "rt"
        },
        {
            "content": "This was absolutely one of my favorite films of 2019. It has plenty of humor but also hits your heartstrings. The acting is great, the visuals are colorful and stimulating, and the film stays with you a while after you watch it. Certainly recommended.",
            "review_date": "2020-09-24",
            "source": "rt"
        },
        {
            "content": "JoJo Rabbit is a delight from start to finish. A touch of Wes Anderson and the sleight of a deranged sense of humor. This movie stays within the confines of a small village, geographically and thematically, which is its saving grace from delving into weightier subjects that abound in WW2 stories.  A young boy stuck between his love for his mother, the need for a father figure, and the impending perimeters of first love. This not much to dislike here.",
            "review_date": "2020-09-22",
            "source": "rt"
        },
        {
            "content": "I think it's amazing how this film manages to tell a story about events that generate at least repudiation, while mixing satire and good moments of humor while treating serious subjects with delicacy, Jojo Rabbit is one of those films that must be remembered for reaching surprising milestones that take good humor and social criticism with them",
            "review_date": "2020-09-21",
            "source": "rt"
        },
        {
            "content": "92%. Watched it a second time and it was even funnier. Great movie. It's really a comedy during a dramatic time period with the end of WW2. Jojo is funny and just great overall. He absolutely kills it. His fat friend is awesome also. ScarJo is great in it as well. Along with Rebel Wilson. Definitely worth the rewatch",
            "review_date": "2020-09-20",
            "source": "rt"
        },
        {
            "content": "At some point during the movie, I remember thinking to myself that this is one of the best movies I have ever seen. I did not expect it to be so amazing.  Everyone needs to see it",
            "review_date": "2020-09-20",
            "source": "rt"
        },
        {
            "content": "An amazing satire of the Nazi's which is welcomed in this day and age. Waititi does an amazing job directing as well as playing the imaginary Hitler, with Rockwell proving to be the standout in the film",
            "review_date": "2020-09-19",
            "source": "rt"
        },
        {
            "content": "This is a wonderful film.",
            "review_date": "2020-09-19",
            "source": "rt"
        },
        {
            "content": "Incredible how you can laugh and cry in just one movie. The best movie I have seen in years!",
            "review_date": "2020-09-19",
            "source": "rt"
        },
        {
            "content": "Brilliant. I haven't enjoyed a movie like this in a long time.",
            "review_date": "2020-09-19",
            "source": "rt"
        },
        {
            "content": "Jojo Rabbit has incredible humor and very heartfelt moments. It touches such an important subject in a very unique way like no other movie. The performances are great and really get you involved into the movie.",
            "review_date": "2020-09-18",
            "source": "rt"
        },
        {
            "content": "Phenomenal. Delicious. Scrumptious. Taika Waititi has gone above and beyond. It was very tasteful and visually beautiful. It was not offensive at all, but still handled important and traditionally offensive topics with class. The symbolism and attention to the shoes was jarring when it was revealed why there had been focus on the shoes. It was good how it was from the perspective of a child - hence the bright colours.",
            "review_date": "2020-09-16",
            "source": "rt"
        },
        {
            "content": "The entire premise is itself laughable and I love that Waititi played Hitlar himself because no other actor would.\n\nThe kid was great, very great duo with the other 'fat' friend, they go so well together~Yorki's humor is so charming. The girl does her job, great dialogue written of 'Jew worser than Ghost'. Scarlet steals the scenes she is in, deserved that double Oscar norm. Sam Rockwell was written great, person born in the wrong time of history on the wrong country.\n\nThe first half explored the obsurdity of Nazism on Kids, 'Hail Hitlar' to every person is really funny.\n\nThe applause the tonal shift, hit me hard with the shoe lace. Rewatching it I got some more foreshadowing.",
            "review_date": "2020-09-12",
            "source": "rt"
        },
        {
            "content": "Excellent. I kept waiting for Bill Murray to show up thinking I was watching a Wes Anderson movie. But this was even better. Original and great storytelling without a wasted scene. Visually pleasant, and a rare movie that can pull off music that came from a later time period than when the movie was set.",
            "review_date": "2020-09-11",
            "source": "rt"
        },
        {
            "content": "I JUST FINISHED WATCHING THIS MOVIE. \nI DOWNLOADED IT MONTHS BEFORE AND I KIND OF JUST FORGET ABOUT IT, I HEARD OF IT BEING A GOOD MOVIE, THAT'S WHY I DOWNLOADED IT.  \nBUT IT'S A MOVIE ABOUT WAR AND KID, WHICH I HATE BOTH. \n\nAS I STARTED WATCHING, I COULD NOT STOP. I COULD NOT HOLD BACK MY TEARS WHEN JO JO FELT BUTTERFLIES FLYING IN HIS STOMACH FOR THE FIRST TIME HE REALIZE WHAT LOVE IS.  \n\nWE COULD NOT CHANGE THE WAY WE VE BEEN EDUCATED AND THE CULTURE BACKGROUND WE HAD, BUT UNDER NO CIRCUMSTANCES SHOULD WE FORGET THAT WE ARE LOVED AND WE HAVE THE ABILITY TO LOVE. LOVE OPENS UP A WINDOW, THROUGH IT WE COULD HAVE A CHANCE TO SEE THE WORLD IN OUR OWN EYES. AND LEARN IT IN OUR OWN WAYS.\n\nI FEEL LIKE THAT'S THE MESSAGE I RECEIVED.\n\nIN ORDER TO SEND THIS MESSAGE, THE MOVIE PRESENTS THE WHOLE STORY THROUGH JOJO, A TEN YEARS OLD BOY'S EYES, SO WE CAN FEEL RELATED, AND UNDERSTAND JOJO'S (PEOPLE'S ) FANTASY ABOUT BEING IN NAZI'S ARMY, AND WE CAN ALSO KNOW ABOUT, IN THE MEANWHILE, PEOPLE LIKE JOJO'S MOM WERE WILLING TO RISK THEIR LIFVES TO HELP PEOPLE AND STICK TO THEIR BELIEFS UNDER THAT DIFFICULT CIRCUMSTANCES. \n\nI APPRECIATE HOW SHE WAS STILL PROTECTING HER SON'S WORLD, EDUCATE HIM IN A GENTLE WAY WITH HUMOR WHENEVER HIS IDEA COME INTO CONFLICT WITH HERS, SHE NEVER JUST SAY: YOU ARE WRONG, I AM RIGHT, YOU SHOULD LISTEN TO ME. SHE GAVE THE SPACE AND TIME TO HIM, LISTEN TO HIM, RESPECT HIM, DESPITE HE IS A LITTLE BOY.\n\nAND ALSO THE DIRECTOR MADE A GREAT BALANCE IN THE CRUEL WORLD OF WAR AND THE INNOCENT WORLD OF A CHILD, HE DIDN'T JUST HIDES THE CRUELNESS, THERE ARE BOMBS AND DEAD SOLIDERS EVERYWHERE, BUT HE CAPTURED JOJO MOM'S DEATH IN A WAY THAT WE COULD FEEL THE HEARTBREAK --- JOJO HOLDING HIS MOMS FEET IN HIS ARMS, WE KNOW THAT SHE HAD BEEN HANGED, BUT WE NEVER SEE IT ENTIRELY IN MOVIE, JUST BY THESE PAIR OF SHOSE, WE COULD BE FEELING THE PAIN OF JOJO LOOSEING HIS MOM. AND DURING JOJO'S CONVERSATIONS WITH THE JEWISH GIRL ELSA AND HIS FRIEND YORKI, WE COULD ALWAYS SEE HOPE DESPITE HATE AND MADENESS IN THE WORLD. \n\nTHE MOVIE COULD GO TO THE EXTREME TO DESTROY IT ALL, BUT IT LEFT HOPE FOR US AUDIENCE, MAYBE THERE IS A BETTER WAY TO ALWAYS MEMORIZE THE HISTOTY WITHOUT FILL OUR HEARTS WITH HATE.\n\nJUST LIKE THE END OF THE MOVIE SAID:\nLET EVERY THING HAPPEN TO YOU\nBEAUTY AND TERROR\nJUST KEEP GOING\nNO FEELING IS FINAL",
            "review_date": "2020-09-10",
            "source": "rt"
        },
        {
            "content": "Emotional gears swifted too fast",
            "review_date": "2020-09-09",
            "source": "rt"
        },
        {
            "content": "I absolutely loved it!",
            "review_date": "2020-09-07",
            "source": "rt"
        },
        {
            "content": "Very enjoyable movie.",
            "review_date": "2020-09-06",
            "source": "rt"
        },
        {
            "content": "I always find it funny when the audience review significantly supersedes the 'critic review'. Honestly this movie is beautiful, it's funny and silly, and at points ridiculous, but also moving and beautiful. Taika Waititi has a way of creating movies that retrospectively are purely entertaining...and when you look back on them there are so many laughable moments that you reflect on it as a comedy, but when you watch it again (which you'll always want to do with anything he's written); Suddenly you're moved..! Moved deeply!! This was another one, the performances were amazing, the pace was perfect and the script was incredibly moving. I loved this movie!! It is beautiful but vulnerable, its shows the strength of humanity, but also our vulnerability to manipulation. If you haven't watch this movie yet, please do. You'll be a different person afterwards!! It shows our humanity and how easily we are moved to despise those different to us. In this day and age it's more relevant than ever, please watch this movie!!",
            "review_date": "2020-09-02",
            "source": "rt"
        },
        {
            "content": "From the very start we got a fun and exciting introduction to the life of jojo, a young german who believes in himself as a true nazi who is willing to fight for the supiriority of the nazi party and the aryan race along with a imaginary friend of his; fuhér hitler himself. But along the way with the nuture of his mother and a new friend upstairs his house he eventually realises that war will only create problems and not solve it. Its a fun and not too graphic scenes of war that present the situations as they were. With the help of captain K, a distractive german officer who later turns out to be a good soul saves our young jojo's life by sacrificing his own. It is without a doubt an amazing movie to watch with friends, family and any history fanatic who has keen interests in world war 2 and the fall of nazi germany. A top priority on any movie lovers watch list.",
            "review_date": "2020-09-01",
            "source": "rt"
        },
        {
            "content": "Ok mediocre kinda cringe movie directed by taika watiti. Starring Hollywood elites this movie lacks heart and soul. Other of taikas movies have heart like the hunt for the wilder people or Thor. But this is just pure Oscar propaganda. I was going to show my friend this but after watching it , not anymore.",
            "review_date": "2020-08-31",
            "source": "rt"
        },
        {
            "content": "Jojo Rabbit is an acquired taste - especially those who find Taika Waititi's humor off. But those that do love it will find there is a message that hit's surprisingly hard by the time credits roll.",
            "review_date": "2020-08-31",
            "source": "rt"
        },
        {
            "content": "Excellent! One of the most refreshing films I have seen in a long time. Waititi is absolutely brilliant with his storytelling. I'd give this film six stars if I could.",
            "review_date": "2020-08-31",
            "source": "rt"
        },
        {
            "content": "What did I think of JoJo Rabbit? Check out my full review below:\nhttps://open.spotify.com/episode/6wkgIM4i1MdSwCaJSdDH4a?si=pFM65TXKSlSVnciBUNRNxA",
            "review_date": "2020-08-30",
            "source": "rt"
        },
        {
            "content": "Jojo Rabbit is not for everyone taste, it contain a good comedy, a good drama.\n If we talk about the story so,  it was a simple story but , sometimes a movie is fully depend on acting, makeup, setup, and Jojo Rabbit was very rich in it. Roman Griffin Davis, Scarlett Johansson, Taika Waititi, Sam Rockwell, Alfie Allen and all other cast had ability to support this kind of movie.",
            "review_date": "2020-08-30",
            "source": "rt"
        },
        {
            "content": "Hitler spoofs are more popular than you might think.  I enjoyed Preachers version better. This one was ok. Not really worth your time but if you download and skip scenes that bore you, it helps.",
            "review_date": "2020-08-28",
            "source": "rt"
        },
        {
            "content": "Amazing!  Amazing characters, amazing cinematography, engaging film, meshes a heavy topic with consistent levity and an impressive tone.  Enough laughs, enough drama, enough smiles... just an overall low-key great movie.",
            "review_date": "2020-08-28",
            "source": "rt"
        },
        {
            "content": "Loved Scarlett Johansson in this",
            "review_date": "2020-08-27",
            "source": "rt"
        },
        {
            "content": "忙完之后定了半个小时之后的票，赶在下映之前在影院看完了。但看完之后有些失望，昨天被1917重燃的观影热情今天又被打击了。太轻了。太轻了。感觉很多重量都被导演的手法化解了，妈妈的死、K上尉的死、乔乔眼中的战争，很沉重的一分钟之后总会跟点儿什么消解。开场让我有韦斯安德森的错觉，但完全不及布达佩斯带给我的感觉。除了艾莎之外其他角色给我的感觉很「拧巴」，没有找到让他们转变的点——K上尉帮助他们掩盖的时候、乔乔决定让艾莎离开的时候，我都没有找到；反而是约克那种傻傻的、随波逐流的劲儿从一而终，但也是他破坏了K上尉之死的一点点冲击。妈妈的亮点是一段一段的，但我串联不起来。乔乔的决定放手亦是如此。坐在影院最后想起了超能陆战队，于我而言二者是同一类影片。P.S.听说导演前部作品是复联4和雷神3，顿时恍然大悟。",
            "review_date": "2020-08-26",
            "source": "rt"
        },
        {
            "content": "Great movie! I cried a lot!",
            "review_date": "2020-08-24",
            "source": "rt"
        },
        {
            "content": "It was a fresh take for any kind of movie. It subverted expectations and the humor was dark and quirky. It's tone does change at times but every time it does, it has a deeper meaning behind it, adding the the multiple layers that make this movie a must-see!",
            "review_date": "2020-08-24",
            "source": "rt"
        },
        {
            "content": "7.5. Jojo Rabbit uses a satirical outlook on the grim story of WWII. Though it's told in the perspective of a young boy, the true circumstances of the war are prevalent throughout the movie. And while the it's comedic approach can clash with its intense scenes at times, Jojo Rabbit is successful in its attempt to make an original story out of WWII.",
            "review_date": "2020-08-24",
            "source": "rt"
        },
        {
            "content": "Fantastic and original, it's hard to find flaws with Jojo Rabbit... unless you're a Jew or a Nazi.",
            "review_date": "2020-08-23",
            "source": "rt"
        },
        {
            "content": "an entertaining satire with a darkly comedic edge, this film deserved its oscar nominations and is a must-watch, but be warned: insensitive content is a problem.",
            "review_date": "2020-08-22",
            "source": "rt"
        },
        {
            "content": "I was pleasantly surprised with this movie. I thought the blend of humor and serious subjects was done fantastically. The acting was superb and I enjoyed every minute of Jojo Rabbit. This was one of the better movies of the year!",
            "review_date": "2020-08-21",
            "source": "rt"
        },
        {
            "content": "Started off silly, but surprisingly heartwarming and meaningful. Two thumbs up.",
            "review_date": "2020-08-21",
            "source": "rt"
        },
        {
            "content": "A roller coaster of emotions. Very well put together. Not easy to make a film with Hitler as the comic relief but they did a good job.",
            "review_date": "2020-08-20",
            "source": "rt"
        },
        {
            "content": "A roller coaster of emotions but very well put together and quite enjoyable. Not easy to make a good film with Hitler as comic relief but it was very well done.",
            "review_date": "2020-08-20",
            "source": "rt"
        },
        {
            "content": "Funny, honest, and cute. An integer coming-of-age movie told through the eyes of a young boy, growing up during World War 2, serving the Hitler-Jugend. An absurdist Hitler, a loveable Scarlett Johanson as the boy's mother and an intense performance by Thomasin McKenzie - the Jewish girl -  turns the dramatic parts of the movie into emotional pinches. In general, it's not the director's intention to throw you overboard and drown you in a sea of tears, but the story touches the unbearable moments and conflicts of those times. Long enough to care, short enough to care about the storyline about hope and change.",
            "review_date": "2020-08-19",
            "source": "rt"
        },
        {
            "content": "Daring and quirky, Cute and sad. Surprisingly heart-breaking. Perfect.",
            "review_date": "2020-08-19",
            "source": "rt"
        },
        {
            "content": "Not funny at all! What a horrible premise.",
            "review_date": "2020-08-18",
            "source": "rt"
        },
        {
            "content": "This is a terrible adaptation. It claims to be Jojo's Bizarre Adventure, but is instead a completely different film. In the timeline, since it would be at either phantom blood or Battle Tendency, it is way to early to introduce stands, and yet they do it, and advertise it as the main feature. What's worse is that all of the characters are replaced with fan characters, which have barely any muscles, if any at all. Overall, this movie was a false hope for us Jojo fans. We need to make our own adaptation if studios keep pushing out terrible ripoffs like this movie.",
            "review_date": "2020-08-17",
            "source": "rt"
        },
        {
            "content": "This is a great little offbeat comedy about a little German boy, growing up in the 1940s, who is obsessed by his hero, Adolf Hitler. This strange premise for a comedy really works and is a brilliant, tongue-in-cheek study into the ludicrous nature of hero worship. \nLittle Jojo has a wonderfully innocent approach to his life and has imaginary conversations with Hitler who is brilliantly and comply realised by Taika Waititi who also wrote and directed the movie. Life is turned upside down for Jojo when he discovers that his glamorous, Nazi mother (Scarlett Johansson) is hiding a little Jewish girl in the attic room.\nTouching, moving and very funny, the movie is carried by the brilliant performance of Roman Griffin Davis as Jojo but I also loved Archie Yates as Yorki, his little friend who is equally naive and unsuited to the Hitler Youth movement and a brilliant supporting performance by Rebel Wilson as a youth camp leader who is sadistic and awful. \nThis is a true gem of a movie and very worth seeking out.",
            "review_date": "2020-08-17",
            "source": "rt"
        },
        {
            "content": "This Nazi satire film walks a very tight rope about a German boy at a Nazi Youth Camp who imagines being Hitler's best friend, but at the same time, befriends a Jewish girl who is in hiding. As the boy discovers who really is the monster, director Taika Waititi never really seems to deliver a meaningful conclusion. Just think, this \"Hitler Comedy\" would have never been funded if it weren't for \"Thor: Ragnarok.\" Weird, right?",
            "review_date": "2020-08-16",
            "source": "rt"
        },
        {
            "content": "Story about a young boy during WWII who has an imaginary friend named Hitler. I'm not sure how to feel about this movie. I didn't like the Hitler character that much. But I enjoyed the mother and young girl storyline a lot. So its mostly good.",
            "review_date": "2020-08-16",
            "source": "rt"
        },
        {
            "content": "This was a good movie! Worth watching on a rainy day.",
            "review_date": "2020-08-16",
            "source": "rt"
        },
        {
            "content": "Funny at times, but also true and definitely makes you think about the use of children in war and propaganda ",
            "review_date": "2020-08-16",
            "source": "rt"
        },
        {
            "content": "Cute, funny, and extremely sad.  We see WWII German life from the view of a young boy.  It is absurdly funny until it isn't.  This poignant film reminds us there were many times in history that were far worse than our current time.  My only nit to pick with this movie is that the young boys' British accents are distracting while all the other German-ish accents work well.",
            "review_date": "2020-08-16",
            "source": "rt"
        },
        {
            "content": "I was hyped to see this movie. As a WW2 fanatic and learns and reads about it everyday it was fun to watch. For me i couldn't stop laughing as every joke landed (in my opinion). As we hav always heard the nazi's ar bad but it is nice too see them be normal and Sam Rockwell was amazing in this film and for should have been at least nominated for an ward for that. The story was really enjoyable to watch play, And the chemistry between Jojo and his mom was great to watch cause it looked like they really loved each other. For me 100% 5 stars",
            "review_date": "2020-08-15",
            "source": "rt"
        },
        {
            "content": "A fine exercise in mockery and cute yet emotional drama for parents and (accompanied) children, with eye-popping sets and delightly colourful costumes, outstanding performances and a well-balanced mix between tearful and hilarious sequences, \"Jojo Rabbit\" is, perhaps, one of the most enjoyable, accessible and thought-provoking anti-hate satires ever.",
            "review_date": "2020-08-15",
            "source": "rt"
        },
        {
            "content": "a feel good movie. a simple story that was happening in world war2 time.",
            "review_date": "2020-08-15",
            "source": "rt"
        },
        {
            "content": "Amazing, funny, disturbing, horrific, hilarious film.",
            "review_date": "2020-08-15",
            "source": "rt"
        },
        {
            "content": "A few laugh out loud lines, especially from \"hitler\".",
            "review_date": "2020-08-15",
            "source": "rt"
        },
        {
            "content": "I love WWI movies. But there are soooo many to watch! And most of them are serious; this is the exception. I saw it and laughed till i couldn't. It does get slightly disturbing, but still funny.",
            "review_date": "2020-08-13",
            "source": "rt"
        },
        {
            "content": "Ignora si face dragute lucruri groaznice dar e foarte bine jucat si construit",
            "review_date": "2020-08-12",
            "source": "rt"
        },
        {
            "content": "Wonderful and genius",
            "review_date": "2020-08-12",
            "source": "rt"
        },
        {
            "content": "Beneath the superficial comedic aspects is a level of depth worth experiencing.",
            "review_date": "2020-08-12",
            "source": "rt"
        },
        {
            "content": "This is a movie that is not only for pure entertainment but an invitation to think. Great great concept behind it.",
            "review_date": "2020-08-11",
            "source": "rt"
        },
        {
            "content": "Good sountrack, Good Actors, Good Movie",
            "review_date": "2020-08-11",
            "source": "rt"
        },
        {
            "content": "There are no weak Jews. I am descended from those who wrestle angels and kill giants. We were chosen by God. You were chosen by a fat man with greasy hair and half a moustache.",
            "review_date": "2020-08-11",
            "source": "rt"
        },
        {
            "content": "Loved it. So much character and originality.",
            "review_date": "2020-08-11",
            "source": "rt"
        },
        {
            "content": "Brilliant mix between comedy and seriousness.",
            "review_date": "2020-08-10",
            "source": "rt"
        },
        {
            "content": "I enjoyed the movie, the second half more than the first half.",
            "review_date": "2020-08-10",
            "source": "rt"
        },
        {
            "content": "It is a must see, the satirical approach for such a sensitive topic is just genius.\nLoved it",
            "review_date": "2020-08-10",
            "source": "rt"
        },
        {
            "content": "The story more about race rule to accept",
            "review_date": "2020-08-10",
            "source": "rt"
        },
        {
            "content": "Remarkably well done.  When I first saw the trailer for this, I thought 'hard pass' - another brave Hollywood movie taking shots at Nazis - what courage!  But the film has almost nothing to do with Nazis.  Sure, it is set in WWII Germany, but Hitler and Nazism is just a frame of reference to tell a story about fitting in and coming of age.  Perhaps the writer even thought of it as a parable and warning to future generations.  Even now, some 75 years later, everyone in the audience gets the Hitler jokes - it is a shared frame of reference.  What would you do if you so desperately wanted to belong, you would do things that seemed unimaginable to you and your loved ones?  Would you proceed?  Or would your sense of humanity pull you back from the brink?  The Hitler shtick is there to show us the correct answer, but \"the line separating good and evil passes not through states, nor between classes, nor between political parties either, but right through every human heart\" - Solzhenitsyn (I had to look that up).  This movie is almost wildly optimistic, I fear, as we may ourselves face something like this in our future.  And odds are, we would go along with the herd, even though we felt in our heart it was wrong.",
            "review_date": "2020-08-10",
            "source": "rt"
        },
        {
            "content": "There were few winners but plenty of losers in WW2 as there are in Jojo Rabbit.  This movie is full of 'losers' and not only the ones that make bad choices and stuff up their's and everyone's lives but also those who experience real loss perpetuated by the biggest 'losers' of all time, Nazis.  Seeing this movie through a 10 years olds eyes drives home the pointlessness of this war.  It left me with an increased sense of frustration as to how something like this (WW2)  can happen in the first place.  Young Jojo highlights this in a way that only child like innocence can.  I have always held onto a sense reverence when discussing WW2 and this movie undoubtedly challenged this mindset.  In the end I was a bit lost not sure whether I enjoyed the movie or not but the sign of many good movies is that you are left thinking about them long after the credits are done.  The acting and visuals are superb.",
            "review_date": "2020-08-10",
            "source": "rt"
        },
        {
            "content": "Cute, poignant, visually beautiful and often very funny. But tonally it's very conflicted. It's not a comedy but it's too silly to work as a coming of age drama. Taika Waititi's Hitler is hilarious but as there's never any real conflict between them he doesn't really work as an expression of Jojo's cognitive dissonance about Jews.",
            "review_date": "2020-08-09",
            "source": "rt"
        },
        {
            "content": "Taika Watiti follows up Thor: Ragnarok with satire about the Hitler Youth in Nazi Germany. I have got to admit I really enjoyed the movie. I thought Taika tone has just the right amount of silliness without being disrespectful of the Holocaust. My only complaint is that the film cloud have done a slightly better job of fleshing out some of the side characters a bit more. A decent movie.",
            "review_date": "2020-08-09",
            "source": "rt"
        },
        {
            "content": "Terrific!  I put it right up there with. \"A beautiful life\".",
            "review_date": "2020-08-09",
            "source": "rt"
        },
        {
            "content": "Brings comedy to a very serious issue. I laughed, cried and then laughed a little more. Recommended.",
            "review_date": "2020-08-09",
            "source": "rt"
        },
        {
            "content": "Critics can no longer evaluate/appreciate satire.  This movie is modern day Voltaire.",
            "review_date": "2020-08-09",
            "source": "rt"
        },
        {
            "content": "This film takes huge risks with the humor, but it is a fantastic, hilarious, and emotional WWII satire.\n\nFinal Grade: A-",
            "review_date": "2020-08-09",
            "source": "rt"
        },
        {
            "content": "Oh My God! What a great film! Perfect cast! Perfect in their roles! Taika Waititi is incredible! This film delivers the perfect slap! It slaps u silly! U will roar! It slaps u awake! This is based on fact n it is horrible, n ugly, n scary! Then it bitch slaps u 2 jump up n dance 2 the amazing David Bower's Heros in German!, strangely sexy! Just like the cast! Taika is hot! Sam Rockwell! Steven Merchant! Purrrfect! Hot! Sexy! The ladies 2 n those sweet little boys! Great film!",
            "review_date": "2020-08-08",
            "source": "rt"
        },
        {
            "content": "Jojo Rabbit is a delightfully tender telling of a young boy's WW2 experience. It manages to take a fresh perspective on a piece of history that has been examined many times through film. In addition to the creative script and plot, the film successfully manages to work humour into the narrative in a tactful way.",
            "review_date": "2020-08-08",
            "source": "rt"
        },
        {
            "content": "Funny, interesting, heartbreaking, and hopeful. This movie is a must watch!! Sam Rockwell stole the show!",
            "review_date": "2020-08-08",
            "source": "rt"
        },
        {
            "content": "One of best movies I have seen in the past 10 years.",
            "review_date": "2020-08-08",
            "source": "rt"
        },
        {
            "content": "Just awesome and original!  Great characters.  If felt like a Wes Anderson movie (which I really enjoy), but with a bit more on-the-nose humor.",
            "review_date": "2020-08-08",
            "source": "rt"
        },
        {
            "content": "The movie crosses all kind of genres; comedy, drama bellic. It's sometimes funny and sometimes sad, in a very equilibrated way. The story tells us perfectly how a kid's vision abot the war changes after he notices all the damage that it can cause.",
            "review_date": "2020-08-08",
            "source": "rt"
        },
        {
            "content": "Jojo is such a little shit, he blows right by the antihero and crashes into hated villain at full speed. There is nothing cute about him, he is dumb beyond his young age and just cruel to the girl hiding in his house. You cannot enjoy a movie when you just want to put the lead character over your knee and spank him raw.",
            "review_date": "2020-08-07",
            "source": "rt"
        },
        {
            "content": "Fantastic!! Great cast, even better acting!!!",
            "review_date": "2020-08-07",
            "source": "rt"
        },
        {
            "content": "One would never guess that a movie in which a young boy's imaginary friend is a goofball Adolf Hitler could actually be rather bland. It stays afloat thanks to it's performances and a few memorable moments but ultimately Jojo is a disappointment.",
            "review_date": "2020-08-06",
            "source": "rt"
        },
        {
            "content": "No bags. Popcorn connections? The MCU of course-Taika I can't spell his last name directed Thor 3 (the best Thor of them all), Scarlett was/is Black Widow, and Sam Rockwell was in Iron Man 2 with S.J. as Justin Hammer. Anyway, this movie doesn't treat the subject with the kind of humor that Mel Brooks succeeded with in \"The Producers.\" Also, if you've seen a few movies, you'll be able to predict very quickly (SPOILERS, WHO CARES) that Scarlet ain't gonna make it through this one. It just wasn't funny, and because it's predictable, it didn't hit me on an emotional level. Sorry Taika you're a funny guy but you're more of a hired hand by Disney/Marvel than a true original auteur like Lynch or Bong.",
            "review_date": "2020-08-06",
            "source": "rt"
        },
        {
            "content": "Another great movie by Taika! The story and the juxtaposition between the dark themes and the humor is wonderful!",
            "review_date": "2020-08-05",
            "source": "rt"
        },
        {
            "content": "I have seen this movie twice, once in theater- as all movies should be properly seen and once streaming on TV.  The second time did not disappoint.  I can't imagine this film getting less than 5 stars.  I think what some professional critics missed, is that the entire film is told through the eyes of a 10 year old boy.  Would a 10 year old know of the intricate atrocities that the Nazi's were executing?  No.  This  fantastic coming of age story also works because of the child actor who plays Jojo, Roman Griffin Davis.  My only criticism is with the character of Elsa. She is a bit too subdued, a bit too generic. It doesn't ruin the movie, and perhaps she needed to be that way to play off the bigger characters.  This was my favorite film of 2019.  I am the child of two holocaust survivors, and I think this film is a must see.  If you do not laugh and cry, you are not human.  Cheers.",
            "review_date": "2020-08-04",
            "source": "rt"
        },
        {
            "content": "I had no interest in seeing this movie but my daughter and granddaughter wanted to see it and I have to say I really liked it. Glad I watched it",
            "review_date": "2020-08-04",
            "source": "rt"
        },
        {
            "content": "It is a very entertaining film, with an incredible performance by the children's cast and with a humor that worked so well that it never bores you.",
            "review_date": "2020-08-04",
            "source": "rt"
        },
        {
            "content": "It's so perfect film from all side. Humor, incredibly moving scenes, scene color and unsurpassed acting. It's best work of Taika Waititi.",
            "review_date": "2020-08-02",
            "source": "rt"
        },
        {
            "content": "Originally I wasn't interested in seeing the movie; something felt wrong about satirizing Adolf Hitler. The best performance, undoubtably, was by Scarlett J. -- particularly the scene as she portrays Jojo's father. Nothing of absolute excellence, but a wonderful movie nonetheless.",
            "review_date": "2020-08-02",
            "source": "rt"
        },
        {
            "content": "It's a split decision for hubby and wife date night.  Hubby:  I respect the work of Taika Waititi, but this overall didn't work for me.  I didn't laugh and despite a finish that left me satisfied and the chemistry of Roman Griffin Davis (who is fantastic as a child nazi) and Archie Yates (his best friend) there wasn't enough here.  I just didn't laugh and was flat out bored for good parts of the first hour.  It recovers, but not enough to tell anyone to watch.  Wife:  Clearly hubby has a humorectomy.  This is adorable and cute and if you don't take it serious you'll enjoy it.  If you have a hang up on satires stay away.  It's amazing this got made, but it tell a story of hope and joy while there can also be horror.  Finally, what a wonderful score. Hubby: 5.8 Wife: 7.4 Average: 6.6/10",
            "review_date": "2020-08-02",
            "source": "rt"
        },
        {
            "content": "A visual & emotional delight, full of LOL moments & deep humanity, that relishes in both the heartbreak & hilarious absurdity of bigotry. It reminds us that even the worst atrocities in history were committed by everyday people, & that the ultimate enemy is rarely the individual. When we realize this, coloring all racism as mustache-twirling villainy isn't so easy; we must search for our own self-justified prejudices. May we all murder the invisible Hitlers who burrow their way into our minds.",
            "review_date": "2020-08-01",
            "source": "rt"
        },
        {
            "content": "While it does not contain amazing computer generation or a super well known trillion dollar cast, Jojo Rabbit manages to tell an important and amazing storyline in a very blunt way while still retaining excellent acting And even Humour.\n\nA must see film.",
            "review_date": "2020-07-31",
            "source": "rt"
        },
        {
            "content": "It was a funny and entertaining movie in the same time a sad one.",
            "review_date": "2020-07-30",
            "source": "rt"
        },
        {
            "content": "A funny and well written movie about how a boy who has learnt to hate, finally learns that love is far stronger.",
            "review_date": "2020-07-30",
            "source": "rt"
        },
        {
            "content": "This is a brilliant movie, which is needed in 2020 more now than ever.",
            "review_date": "2020-07-30",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies ever. Awesome cinematography, great acting, spectacular cast, and an amazing storyline",
            "review_date": "2020-07-29",
            "source": "rt"
        },
        {
            "content": "Cut from the same unsavory mismatched tonality as LIFE IS BEAUTIFUL, JOJO RABBIT is a wholly misguided fusion of an exceptional movie and an atrocious one. There’s something to be said for the adage “mock the Devil and he will flee from thee”, but even someone as jocular as me has to concede that some things demand to be treated as sacred, and the slaughter of millions of Jewish people under the Nazi regime surely has to be chief among them. When JOJO RABBIT approaches its mission objective with the gravitas it warrants, it typically resonates (even with an over-reliance on cutesy Hollywood moments), but even more abysmally and offensively than his derailment of the THOR franchise into silly sitcom yucks, director Taika Waititi indulges in dozens of moments of whimsical, flippant and grossly inappropriate comedy (this film surely must possess the most schizophrenic tonal shifts of any I’ve ever seen) that are made even worse by the fact that, unlike THOR: RAGNAROK, almost none of the jokes land. Perhaps if the comedy served as some kind of method to elevate or enrich the material, it could be forgiven, but I see no richer layer of commentary in any of its cartoonish excess. There’s a lovely message at the heart of JOJO RABBIT, but it’s buried under such a cruel disrespect of the very history it chooses to honor that the whole thing ends up feeling rather shameful and somewhat sickening, with its heart in the right place, but its head anywhere but.",
            "review_date": "2020-07-27",
            "source": "rt"
        },
        {
            "content": "A heartbreaking, beautifully directed, and heartwarming film, JoJo Rabbit will have you sobbing in some scenes, and crying with laughter at others.",
            "review_date": "2020-07-26",
            "source": "rt"
        },
        {
            "content": "Forgetting about the worst technical slap I've seen in cinema industry, this movie is so reinvigorating that felt like a breath of fresh air after so many similar movies about the 2nd World War. It has funny moments provided by its younger cast, but it has also some depressing heartbreaking scenes that will make the most vulnerable ones loose their tears.",
            "review_date": "2020-07-24",
            "source": "rt"
        },
        {
            "content": "Perfect blend of satire, emotion, sensitivity and humour.",
            "review_date": "2020-07-23",
            "source": "rt"
        },
        {
            "content": "I thought it was an amazing movie. Funny but also a emotional and serious topic but they do it respectfully. Best movie of 2019 in my opinion. Must watch",
            "review_date": "2020-07-22",
            "source": "rt"
        },
        {
            "content": "Incredible performance by Roman Griffin Davis. A must watch!",
            "review_date": "2020-07-20",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies to date. Such a fresh and new look at the war that isn't very offensive and got laughs out of me. I was sad when it ended, and will enjoy rewatching this movie in the future.",
            "review_date": "2020-07-17",
            "source": "rt"
        },
        {
            "content": "Hackneyed and grossly overrated. There doesn't seem to be a limit to how many times film makers can milk the same Nazi themed cow...you'll get more laughs and save a lot of time by watching two minutes of Sacha Baron Cohen.",
            "review_date": "2020-07-17",
            "source": "rt"
        },
        {
            "content": "Yorki is great in this amazing movie 🚫🧢",
            "review_date": "2020-07-15",
            "source": "rt"
        },
        {
            "content": "Engaging, original, thought-provoking. We need more movies like this.",
            "review_date": "2020-07-13",
            "source": "rt"
        },
        {
            "content": "One of the funniest most endearing films of the past year. The cast and story are amazing. It’s excellently directed and the jokes are grim and hilarious. 2019 was a good year for black comedies.",
            "review_date": "2020-07-07",
            "source": "rt"
        },
        {
            "content": "WWII in the eyes of a child. Brilliantly written and executed.",
            "review_date": "2020-07-06",
            "source": "rt"
        },
        {
            "content": "One of the best movies to come out in the last few years. I cried, laughed, empathized, and even learned new things (did you know \"paper uniforms\" were a real thing?!)... what more could you want from a film? All the actors play their parts with passion; I couldn't think of a better cast. Absolutely brilliant, the cinematography is beautiful, and the soundtrack was perfectly designed as well!",
            "review_date": "2020-07-06",
            "source": "rt"
        },
        {
            "content": "As the saying goes \"to soon.\" Wanted to like this but found it indulgent and stupid.",
            "review_date": "2020-07-05",
            "source": "rt"
        },
        {
            "content": "7.75/10. Taika Waititi's eccentric brand of mixing heart and humor is on full display in 'JoJo Rabbit.' He writes, directs, and stars in this picture - I wouldn't discourage someone who hasn't been a fan of his work from watching, but it has his fingerprints all over it, so you know what to expect. It is filled with youthful spirit and sweetness, derived from the performances of its young leads; Roman Griffin Davis is JoJo, a scrappy runt determined to climb the ranks of the Hitler Youth who is surprised to find a mysterious young jewish girl named Elsa, played by Thomasin McKenzie, living in his walls. Though he does his best to be a model, hateful Nazi, JoJo can't overcome his curiosity as he begins learning about Elsa (though he justifies his getting to know her as reconnaissance). He is a boy in search of identity, and though he started finding one in the Hitler Youth movement, it had not been fully baked into his being – Elsa, and his interactions with his friends and leaders of the Hitler Youth, often leave him in a place of contradicting feelings and beliefs as he attempts to reconcile the hate he has learned with the gentle kindness he feels in his heart. Davis and McKenzie sell this journey of self-discovery with ranging performances that brim with sincerity, humor, fear, and hope. They are supported by some great performances from the adults in the cast, particularly Scarlett Johannsen as JoJo's secretly-Nazi-hating mother, Sam Rockwell who portrays the Nazi offer that leads the Hitler Youth, and Waititi as JoJo's imaginary friend, Hitler. It is a bit problematic, especially in our current cultural context, that Nazis are portrayed in such humorous manner, but it's worth noting the undercurrent of devastation and fear that lies hardly beneath the surface, especially whenever we see Elsa come out of the wall, or in some later anxiety-fueling scenes where Nazis come to JoJo's house to find Elsa. Waititi may make rib on some prominent Nazi figures and the absurd cruelty of their ideology, but he never makes light of the horrors that their victims endured. It is that constant shadow of atrocity that grounds this comedy, and what makes JoJo's quest for identity all the more satisfying by film's end. It certainly has Waititi's (arguably, and I'd argue against this characterization) over-the-top stamp on it, but it also has a likeable cast, a good heart, and a message that is in these times certainly worth hearing.",
            "review_date": "2020-07-04",
            "source": "rt"
        },
        {
            "content": "the only thing I knew about Jojo Rabbit prior to watching it was that it had been Oscar-nominated for best picture.\n\nhere's my review:\n\nJojo Rabbit is a fresh, creative take on the WW2 film genre. it conveys a message of love overcoming hate + challenging perspectives, with a clever & darkly funny screenplay that highlights the absurdity + devastation of the Nazi ideology/propaganda/war.\n\nJojo's charming naïveté and lighthearted moments were a juxtaposition to the heaviness of the subject matter. yet this contrast worked and was full of intentionality,  making the film's message even more impactful. \n\nvibrant and whimsically-coloured backdrops were a refreshing, visually appealing step away from the dreary colour palette of other WW2 films. the Hitler youth training camp scene in particular reminded me of Wes Anderson's Moonrise Kingdom.\n\nfinally, first-time actor Roman Griffin Davis did a wonderful job anchoring the story — his performance successfully managed to make a 10-year-old Nazi boy endearing! Scarlett Johansson and the rest of the cast were great too and they all nailed their German accents (with the exception of Rebel Wilson — but as always, she was cast to provide comedic relief (and she delivered), so she's forgiven). Taika Waititi, the director who also doubled as Hitler, was, dare I say it, fun. \n\nattempting to make a comedic film about the tragedy of WW2 could have gone wrong in many ways, but Taika defied expectations, presenting us with a stirring blend of sweetness, satire, sobriety & sadness. \n\nto conclude: I think this is officially one of my favourite films and it's certified fresh 🍅 by me. 😋",
            "review_date": "2020-07-03",
            "source": "rt"
        },
        {
            "content": "Great movie, lots of laughs, no one ever did such a good job criticizing the Nazis like Taika Waiting, best movie of the year!",
            "review_date": "2020-07-02",
            "source": "rt"
        },
        {
            "content": "Say what you want about this movie but Jojo Rabbit is a unique take of a kid who wants to be part of the Nazi Youth. Despite not getting there, he still has his imaginary friend Adolf. But once he meet a Jewish girl in the basement, Jojo struggles with his ideology and his friendship with the girl. I love this movie because of the acting, directing and writing. Overall, Jojo Rabbit is the kind of movie we needed in 2019.",
            "review_date": "2020-07-01",
            "source": "rt"
        },
        {
            "content": "The sound and camera really situate you in a childs eyes. Shot mostly from the boys height. Full of foreshadowing. Impactful use of selective quiet. I can understand some people hating this film because its a certain taste, but I loved it.",
            "review_date": "2020-07-01",
            "source": "rt"
        }
    ]
}