{
    "rating": 9.6,
    "release_date": "2019-11-08",
    "num_reviews": 50,
    "genres": [
        "Kids&family",
        "Holiday",
        "Comedy",
        "Adventure",
        "Animation"
    ],
    "summary": "A desperate postman accidentally brings about the genesis of Santa Claus.",
    "reviews": [
        {
            "content": "An excellent movie to watch in Christmas. I loved that movie.",
            "review_date": "2023-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is honestly one of the most emotional movie I've ever seen this is the only movie that brought tears to my eyes this movie did deserve a award great movie I love it",
            "review_date": "2023-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A story well told and in the most heartwarming way! The characters are captivating and even though the santa story has been told about a million times, this one is unique and allows us to take a rather in-depth  look at the beloved old man in red.",
            "review_date": "2023-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought it was a phenomenal, humorous, and warm new spin on the Santa Claus story. The animation is fun, the voice cast terrific. The story is heartwarming. This movie should be considered a new Holiday Classic.",
            "review_date": "2023-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, dark, a little wicked which made it more fun, a lot of heart would definitely recommend and would watch it again.",
            "review_date": "2023-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Animation is very good and the voice acting is solid. Its a unique and original orgin story for santa. Took a while for the movie to get to a Christmas feel but not in a bad way. Just means the movie can really be watched anytime of the year and still be just as good as if you watched during Christmas. Plenty of funny moments as well.",
            "review_date": "2023-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is now my favourite Christmas movie to exist. Such an original story. I'll be honest, the first 15-20 minutes I thought maybe it was overrated, but it definitely proved me wrong. The art style is lovely and a real joy to see. The story is fantastic, touching and leaves you with that warm fuzzy feeling - perfect for Christmas! I only have one gripe: I wish that the voice acting of the lead role was a bit better. That's my only issue with this film. It's otherwise near perfect.",
            "review_date": "2023-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was cute and original in its take on Santa Klaus.  Sadly, it doesn't quite make the snuff for me in capturing the holiday spirit by completely deconstructing it with its own views that run contrary to my traditions and beliefs (yes, I still believe).  It was on Netflix.",
            "review_date": "2023-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "83%. Cute film about how Santa got started.",
            "review_date": "2023-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible film great animation and story telling",
            "review_date": "2022-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I genuinely loved this movie. The characters were heartwarming, the themes were great, and the animation was absolutely beautiful.",
            "review_date": "2022-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true holiday movie classic that both children and adults alike will enjoy. Give yourself and your family the pleasure of enjoying this gem during the christmas.",
            "review_date": "2022-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super awesome, it's not a typical history of Santa and that is what makes it beautiful",
            "review_date": "2022-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A genius Santa origin story that removes some of the fantasy without sacrificing any of the magic. Klaus is touching with beautiful hand-drawn animations. The spirit of Christmas is perfectly captured by the concept of one good deed spreading throughout a community. A modern Christmas classic, the titular character proves to be surprisingly mortal, shying away from the Saint Nicholas origins in Santa. With Sami representation and a setting inspired by the real-life Scandinavian village of Smeerenberg, Klaus is refreshingly creative and inclusive.",
            "review_date": "2022-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I cannot stop thinking about this movie. Well, that's not the whole truth, but as soon as it shows up on my dash in December it consumes me until I've watched it. Easily my top favorite Christmas movie of all time. Beautiful story, hilarious moments, and great voice acting all wrapped up with an amazing fresh animation style and an absolutely adorable spin on the a classic Christmas tale. Would watch so many times. Then again. Then another for good measure, because if you haven't seen this, you need to before you continue as a human in life.",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Christmas movie there is!",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best Christmas movies ever!!",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would say the best christmas movie of all time",
            "review_date": "2022-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is not only the best Christmas movie, but one of the best movies i have ever seen. I cant find anything wrong with this movie, its funny, hart warming in so many places, funny really funny and don't get me started on the art every scene is a masterpiece. You HAVE to watch this movie your life will be complete.",
            "review_date": "2022-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful artful animation and I was constantly blown away. I cried 5 times the first watch through and not because it's sad but because it touched my soul. It is delightful and original.",
            "review_date": "2022-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not only is a spectacular Christmas film, it is also a spectacular film. The animation and art style is mind meltingly good, it's become an annual watch every year, and each time, it leaves me with a massive smile on face. Looking forward to see what the future holds for this production company, hopefully someone picks up 'Embers' because the talent they possess, is truly incredible. A rare marvel in today's cinema",
            "review_date": "2022-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is heartwarming! It portrays the perfect meaning of friendship, love and Christmas. I loved it so much! \nIt actually made my bottom lip quiver.",
            "review_date": "2022-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a great Christmas movie for the family.  Everything about was fantastic.  Music, casting and animation.  Story line was pretty cool.",
            "review_date": "2022-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great family movie, really refreshing after so many bad ones, has good humour and is fun.",
            "review_date": "2022-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful animation and art direction, genuinely funnier than I was expecting for a \"Christmas cartoon\". Made with love and it shows.",
            "review_date": "2022-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Late seeing this for the first time but it is an excellent Christmas movie. It's an original origin story for Santa that is both heart warming and heart felt. The animation is unique and well done. The voice acting is fantastic. If you're looking for a solid animated family Christmas film, I highly suggest this one. There is a reason it is highly rated.",
            "review_date": "2022-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "9.5/10. Really captures the spirit.",
            "review_date": "2022-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the graphics refreshing and the story is very cool. Voices great choices.",
            "review_date": "2022-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unique Xmas movie. Entertaining and touching story for kids and adults.",
            "review_date": "2022-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful. Eerily good animation. Original story with new approaches to a lot of things. Emotion-inducing and overall just as good as an animated movie can be. Really feel motivated and inspired after watching it. Well done!",
            "review_date": "2022-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a fantastic animation! The storyline it's heartwarming, and visually the movie is very beautiful",
            "review_date": "2022-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most feel good-est of movies. Great story. a very refreshingly new take of Santa. BEAUTIFUL.",
            "review_date": "2022-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly fantastic kids movie. Fabulous story line that both parents and kids can enjoy. Keeps your attention from beginning to end.",
            "review_date": "2022-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So so breathtakingly beautiful and heartwarming. It's become my own little holiday tradition to rewatch it every year, would highly recommend to anyone, whether you celebrate christmas or not",
            "review_date": "2022-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Movie. Makes me cry every time I watch it.",
            "review_date": "2022-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"| Ratings Categories |\n{Characters (9.5/10) ; Cinematography (10/10) ; Plot (9.5/10) ; Acting (10/10) ; Pacing (9.5/10) = 97%}\"",
            "review_date": "2022-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic movie! A must watch for everyone of all ages, I watch it every year with my family and it's a big hit in my neighborhood. Animation is very unique, and the movie provides lots of laughs, interesting dialog and beautiful scenery. \n\nLove the story and characters, definitely in my top 5 Christmas movies of all time!",
            "review_date": "2022-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film has good elements but there was a scene that portrayed self-harm.  Klaus and Jesper were in the forest. Klaus had a noose and gestured it towards Jesper for a few seconds- the inference here is self-harm. You could see the visible distress on Jesper's face.  Then  the scene switches to him attaching bird feeders. I find this highly disturbing and problematic as this is a family film yet it portrays suicide ideations. Just rotten",
            "review_date": "2022-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily a new Christmas classic. One of the best holiday movies ever and definitely in the last few decades. Thoughtful writing and some of the most beautiful animation ever seen.",
            "review_date": "2022-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just love it, a beautiful History. More for adults than kids but it have good moments",
            "review_date": "2022-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like many a Christmas film, Klaus stumbles through the final act, ending it by saying that Santa is a ghost who (cherfully) haunts houses at Christmas. This plot twist at the end is neither earned, nor necessary, leaving this realistic approach to Santa on the creepy side.",
            "review_date": "2022-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie gave me feelings. See it!",
            "review_date": "2022-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "New favorite animated Christmas movie!",
            "review_date": "2022-12-02",
            "source": "rt",
            "lang": "en"
        }
    ]
}