{
    "rating": 9.2,
    "release_date": "2019-12-25",
    "num_reviews": 70,
    "genres": [
        "Drama"
    ],
    "summary": "In the years after the Civil War, Jo March lives in New York and makes her living as a writer, while her sister Amy studies painting in Paris. Amy has a chance encounter with Theodore, a childhood crush who proposed to Jo but was ultimately rejected. Their oldest sibling, Meg, is married to a schoolteacher, while shy sister Beth develops a devastating illness that brings the family back together.",
    "reviews": [
        {
            "content": "Terrible story, based on a badly written and boring book.",
            "review_date": "2023-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This beautiful journey weaves together multiple subplots to create an emotional and well-executed film. While the movie initially jumps around, by the second half it settles into a rhythm that is emphasised by the talented casting choices.\n\nDespite the grace and elegance that the film exudes, it occasionally misses the mark. Frequent cuts between angles and scenes detract slightly from the emotional impact of some of the cinematic moments, which would have been better served by longer tracking shots.\n\nFurthermore, a consistent theme throughout the movie is lust and hurt, which the film score could have explored more to enhance the story's impact. The film missed an opportunity to elevate itself in the same way that La La Land and Marriage Story did. \n\nOverall, this film is a well-crafted, fantastically acted emotional journey that is much worth the watch.",
            "review_date": "2023-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This re-adaptation captured the subtleties of the novel almost flawlessly. Though some parts of the movie felt too polished off, Gerwig was able to highlight all the complexities of emotions of each of the characters. Coupled with the fact that the actors were all superb in their performances, this movie surpassed my expectations and was my favorite depiction of the classic novel.",
            "review_date": "2023-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it is a little long, this newest adaptation of Louisa May Alcott's classic novel, \"Little Women,\" may be the best version yet. In this version the story of the four March sisters (Amy, Jo, Meg and Beth) in the 1860s is told through flashback from their later lives, which at times seems a little confusing and unnecessary. Still, the Jo and Laurie storyline is as heartbreaking as ever in that Anne of Green Gables and Gilbert sort of way. The cast in superb with the March girls really inhabiting their characters. Saoirse Ronan is wonderful as the feisty and energetic Jo, determined to find her own truth in the world and Florence Pugh makes me dislike Meg that little bit less than usual.",
            "review_date": "2023-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the story is fresh, telling the meaning of life and how people get to interact with others.",
            "review_date": "2023-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most beautiful thing I have ever seen ",
            "review_date": "2023-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saoirse Ronan is just another example of casting very pretty conventionally attractive women in roles that are not meant to be filled by a traditionally pretty woman. Jo is made to look much prettier than she should be, a fault of both the casting and costuming, and makeup departments. My two biggest issues with the movie are the time jumps which make it hard to understand the movie and how that affects how we see the characters grow and become better people. The movie does not live up to Louisa May Alcott's original vision and message of sisterhood and familial love as the cast has very little chemistry with each other. Even worse is Timothy Chalamets portrayal of Laurie. It's not a bad movie. Its a mostly enjoyable watch. But overall it has many flaws that just don't make it the Little Women we all know and love.",
            "review_date": "2023-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even better after a second viewing. This movie is just a master class in filmmaking by Greta Gerwig and her whole crew. The color correction is gorgeous, the colors feel alive, you feel like you are in that time, but when we switch back to reality from the past, the colors are darker, they are more cold and I love it. The camerawork in this movie is incredible, the acting of everyone is so good, with Saoirse Ronan of course as the lead performance and probably the best performance. The production design is just gorgeous, heads off. This movie is so emotional and I am pretty young still, but I watched the movie with my mom and I hit her really hard, I love this movie.",
            "review_date": "2023-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overall liked this take on little women as someone who has seen both older versions. Emma Watson is a terrible actress but saorise and Florence are great",
            "review_date": "2023-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excuse my lack of words to properly review this movie.  I'll keep it short and sweet.  It's difficult to not view this through the lens of the 1994 Gillian Armstrong version.  This is a very good movie, but by comparison I find it too quickly paced, lacking in character development, and just without the heart of the 1994 version.  In particular it's difficult to swallow the decision cast the parts in such a way that they normalize all age differentiations.  I haven't read the book, so I can't say if this choice makes it less faithful but I'm guessing it does.  Obviously the sensibilities of modern times make some of the relationships in the 1994 film cringe worthy, but it is more faithful to the times.  Making everyone seem almost the same age sort of erases the motivations for the characters to be who they are.  For me there's just no substitute for the 1994 version.  I'll cry every time when Claire Danes gives her big speech, but that's because the character was developed without the need for hurry.  This sounds like a terrible review but I'm still giving it 4 stars on its own merits.  Compared to the 94 version it would be 2 stars, but that's a tough movie to be compared to.",
            "review_date": "2023-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best casts i have ever seen!\nGreta Gerwig perfectly captures what womanhood feels like in both the movies she has directed, she is such a breath of fresh air.Saoirse Ronan's and Timothee CHalamet's chemistry is amazing as well.Only thing that bothered me a bit is the few moments were Saoirse's accent slipped and you could tell she is not american",
            "review_date": "2022-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wonderfully adapted and acted. compelling rendition of a classic.",
            "review_date": "2022-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "gut wrenching, humorous, well directed and well acted",
            "review_date": "2022-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The score, acting, costumes. Everything works so well together. I laughed and cried while watching this movie.",
            "review_date": "2022-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Coming of age drama and great production design.",
            "review_date": "2022-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"| Ratings Categories |\n{Characters (10/10) ; Cinematography (9.5/10) ; Plot (9.5/10) ; Acting (9.5/10) ; Pacing (9.5/10) = 96%}\"",
            "review_date": "2022-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie screenplay ever adapted! With the best movie costumes ever designed!",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the few must see period dramas.",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie Little Women have 3 versions, as in 1949 was the first. What impressed me the most is the latest re-make of it, released in 2019 and directed by Greta Gerwig. There are not much of difference to the plot from the original book - \"Little Women\" written by Louise May Alcott. This American coming-of-age period drama film really knocked me sideways was despite of the flow of the movie was soothe, the intentions for describing feminisms, women rights, and their role in the society was fully drawn. Personally, I find a scene of Meg, which myself find it was a stroke of exquisite, was when Jo persuaded Meg cancel her marriage to become an actress, though Meg said: \"Just because my dreams are different than yours, doesn't mean they're unimportant. I want a home and a family and I'm willing to work and struggle, but I want to do it with John\". To my mind, feminism nowadays only focus on how women have to have the abilities and positions like men, therefore, housewives are old-fashioned, a waste for future. The character Meg played by Emma Watsons is a brilliant example to clarify the actual - modern definition of Feminisms. In a nutshell, my experience with the 2019 film was satisfy, and I highly recommended this movie.",
            "review_date": "2022-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Do not watch a film that distorted the history!",
            "review_date": "2022-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saoirse Ronan was amazing (as usual) and Florence Pugh killed it! The cast was fantastic, and the music was amazing.",
            "review_date": "2022-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked some aspects of this film - I liked that it is, in effect, a story within a story and I'm a fan of Saoirse Ronan - I thought she did well as Jo March. The cast is pretty decent overall, with Emma Watson, Florence Pugh, Meryl Streep, James Norton and Timothee Chalamet also present. I like that the story has at least an element of female empowerment about it, particularly at the very end. I did cringe at the really 'girly girl' aspects of it and indeed, of course, if your not keen on 'twee' period dramas with giggling female siblings and the like then this may well not appeal to you but even so, I felt this was a well made film and it has enough going for it for the rating I gave it. It won't be for everyone, so I wouldn't outright recommend it to all but if it sounds of interest, if you liked the book perhaps or your keen on the cast, a fan of period dramas and curious about this, then yes, it probably is worth seeing but otherwise, maybe not so much. I hope this review is helpful.",
            "review_date": "2022-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "2 yeas ago- Flawlessly directed and brilliantly acted, I felt briefly confused after not having been familiar with the source material but the film quickly eased me into it's world for a dramatic film experience.",
            "review_date": "2022-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very enjoyable to watch, full of life and intense emotion. The story also has themes of creativity, passion, friendship and jealousy.",
            "review_date": "2022-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Needless to say, It's Great!",
            "review_date": "2022-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this movie so much! Very heartwarming and wholesome! Amazing adaptation!",
            "review_date": "2022-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An unexpectedly fresh adaptation of a literary classic.",
            "review_date": "2022-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a nice remake, however I like the 1933-version the best!",
            "review_date": "2022-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very emotional and I (personally) found lots of it frustrating, but its non the less one of my favorite movies of all time. The acting and messages hit me to the core!",
            "review_date": "2022-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting was brilliant and the costumes exquisite, but it really didn't live up to my expectations. It didn't capture me as I hoped it would, it took me 3-4 days to watch it.",
            "review_date": "2022-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stellar cast, great performances, but the story was hard to follow/ implausible.",
            "review_date": "2022-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn’t want to like it… because I loved the previous one. It took some getting used to a few things, but I thought it was great—-very well done!",
            "review_date": "2022-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What is the secret to taking a beloved classic story that practically everyone knows, a tale that has previously been turned into a motion picture five times and that has been adapted for television at least ten more times, and telling it in a way that is fresh and innovative?  The answer is a simple one… you let Greta Gerwig write an updated screenplay and then let her direct a feature film of her screenplay!\n\nLittle Women was written by Louisa May Alcott and first published in 1868.  It tells the story of the March sisters (Jo, Meg, Amy, and Beth) as they transition from childhood to womanhood.  They reside in their childhood home in Massachusetts during the timeframe of the American Civil War.  Their father is away serving as a chaplain in the Union Army.  As the story opens, the four sisters are living in their childhood home with their mother, Marmee.  When word arrives that their father has contracted pneumonia, Marmee heads off to Washington DC to nurse him back to health.   The four little women are now left to their own devices to take care of each other while also determining their fates and futures.  \n\nIn Gerwig's 2019 film, the sisters are portrayed by Saoirse Ronan(Jo), Emma Watson (Meg), Florence Pugh (Amy), and Eliza Scanlen (Beth).  Each actress is absolutely wonderful, and the relationships between the sisters are complex and fully fleshed out.  Mother Marmee is portrayed by Laura Dern, and the girl's crusty and wealthy Aunt March is portrayed by Meryl Streep.  The film captures the era perfectly and the period costumes are simply divine (Best Costume Design would be the film's one Oscar win).  \n\nHuge praise is due to Gerwig for her ability to update the story in ways that resonate with a modern audience.  She deftly cut the story into a non-linear one, bouncing back and forth between time periods.  And her clever twist on the film's conclusion was both interesting and satisfying.  No spoilers!  This movie was a wonderful example of great storytelling, superb acting and topnotch directing.  Despite my familiarity with the story and having seen other versions on-screen, this film was a class act and well worth the viewing.",
            "review_date": "2022-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A delightful movie. I’ve seen at least two different adaptations and this was lovely",
            "review_date": "2022-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Little women (2019)\n\nThe movie «Little women» is based on the book by Louisa May Alcott. It stars Emma Watson, Saoirse Ronan, Florence Pugh, Eliza Scanlen, Timothee Chalamet. The movie won an Oscar in 2020 and six nominations.\n\nThe movie is set in USA. It was filmed on location in Massachusetts, Boston.\n\nIt is about four girls, who have different hobbies and goals in life. Jo is a writer, Elizabeth adores playing the piano, Amy is an artist and Meg likes to play performances. Unfortunately, not all of them could find love and achieve a dream. But I don't like the end because Lory and Jo aren't a couple, although they had a close relationship.\n\nI strongly recommend «Little women». It has romantic, drama and unforgettable moments.I am positive that you will like and enjoy it.",
            "review_date": "2022-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked this movie a lot and definitely think you should watch it if you like historical dramas.  The time jumps make the plot very interesting.  I enjoyed seeing the characters develop over time.  The plot is very character driven and the characters themselves are very entertaining.  The movie speaks a lot on the issues women faced and it was great to see that represented.  Little Women is one of my favorites because of the relationship between the sisters.  This movie does that justice and displays familial aspects of the plot accurately.  Overall, I loved watching this movie and I recommend it.",
            "review_date": "2022-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well well well. It was honestly really good. Out of all of the Little Woman adaptations throughout the years, this is one of my favorites. I absolutely love the cast including the iconic Emma Watson, Meryl Streep, and Timothee Chalamet.  The thing with this movie however is that I think you would be a little confusing if you haven't read the book, or weren't familiar with the story. The movie was set up to go back and forth between the years as Jo March, one of the main characters, writes her book. One thing I noticed about this film and actually liked, was how they kept the main actors in to play the young versions of the characters when going back in time. It showed how talented the cast was and the range in which they can act. Overall I think it is worth the watch if you are a fan of this heartfelt story. 4/5 stars.",
            "review_date": "2022-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I cried, I laughed. It made me feel sad and anxious. I feel everything.",
            "review_date": "2022-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are several layers to this story that the film delves into wonderfully.\nMost of them focus on 18th-century women, their attitude towards them, and their choices at the time, raising questions and discussing complex issues, such as female independence, and who thought of that? The world of women came down to having children or is there more to it? Rebellion at that time was it heavenly mourning or liberation? And more ...\n\n In short, this is a film about the status of women in the mirror of history, and the execution in it is great, whether in the opinion, ambition, and skills that are expressed here in its good script, or in the excellent photography, the amazing acting, and the excellent costume design.\nThe transition between times through flashbacks adds emotion and longing and to my taste was well done.\nNow, in my opinion, this is not an amazing film, but it is on the borderline of very good and amazing, and that is because I think it would not hurt to shorten the script and film by a few minutes.",
            "review_date": "2022-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"My little women.\"\n\nThe ultimate comfort movie when things are getting out of hand in your life.",
            "review_date": "2022-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Little woman 2019, is a drama movie directed by Greta Gerwig, the movie is one of the seven adaptations of the Louisa May Alcott novel of the same name. The main characters are the Four sisters Meg, Jo, Beth, Amy and their friend Laurie. They are played by, keeping the same order: Emma Watson, Saoirse Ronan, Eliza Scanlen, Florence Pugh and Timothée Chalamet. \nThe film tells the lovely story of the March sisters, it takes place in Massachusett during the 19th century. The story tells how they grow up and change, but it also tells very interesting and deep lessons of life with the help of little scenes from the sisters' lives. Some people can find the plot boring but I don't, because the way in which the timeline of the film was shot is different from the one in the book. In the book, the first half follows the March sisters when they are young girls, and the second half consists of their adulthood. In the movie, we have two separate timelines that start in 1861(past) and 1868(present). I must admit that it's a good idea because it helps to get into the film immediately. The plot is a little bit predictable but that doesn't change anything because even if we expect it, it doesn't make the film less moving. \nI think the acting was perfect, all the actors fit in their characters. The scenes were well done and very real thanks to the acting. All the actors managed to give life to their role in this movie, they made them sentimental, sad, angry, all that very well. \nThe shooting techniques are really wonderful, a result of the fact that the film is relatively new. My favorite shots are the ones where you can see the landscape that seems unreal in the background or the ones where you see the four sisters together. All the soundtrack has been realized by Alexendre Desplat. The soundtrack helps a lot to enter into the wonderful atmosphere of the movie. Somes of the music is happy and some are not, it depends on the scene but all the music is adapted with the movie. In my opinion costumes are really important, they can tell a lot about a character. We can see the ones who are negligent, like Jo or the ones who take care of how they look, like Meg and Amy. We also can see the characters who have a relationship with another, like the fact that Jo and Laurie are sometimes wearing the same clothes, it shows that they are close friends. It's also important to be able to find your way in the history and to realize that the film takes place in the 19th century. \nThe film has a lot of messages, each character has something to learn in the movie, for example, the message of Jo's story is that life can be hard especially for a woman and you can't always get what you want but that's not why you should give up. I really like the message of Meg's story, I find it touching, the message is that you don't need to be rich and in high society to be happy, you need to be surrounded by the people you love. \nGenerally, I really think this film is fabulous, maybe one of my favorites. I recommend this film to anyone who loves old drama movies. For the ones who read the book, the film is very similar so if you liked the book go watch the movie. If you haven't seen it yet, you now know what you're missing.",
            "review_date": "2022-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the character development from each siblings, mostly florence pugh'character. Perfectly balance movie with a balance emotions.",
            "review_date": "2022-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LOVED the vibe of this movie. The overall vibe was superfood and the switches between the past and the future made the movie extra engaging. I really enjoyed the Amy and Laurie story-;line and how it contrasted with their relationship with when they were younger. I also liked the widely different personalities of the four daughters and how this caused for clashes in between them, but also love among them.",
            "review_date": "2022-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Emotive and wonderfully shot. Great cast and I felt like the characters they played were so well brought to life. Florence Pugh as Amy was a delight.",
            "review_date": "2022-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Little Women is a film that I passed on seeing many times, whether it be with friends or with my family, I always chose to not watch it as I figured I wouldn't enjoy it. But boy was I wrong. I watched this film in 2 parts because I was too tired to finish it, but it was the only thing on my mind until I started it again the next morning. That's how you know you're enjoying it.\n\nThe first thing to be noticed is the costuming. Wow. Jacqueline Durann is known for her ability to create period piece costumes, and she was the perfect choice for Little Women. The costumes are seriously gorgeous. Alongside costuming, the set design is beautiful. Greta Gerwig did a great job on picking what this film would look like visually, as every room and landscape is gorgeous and seems to actually be in the right time period.\n\nThe acting in this is phenomenal. Every single character is acted to perfection. The chemistry between each and every actor/actress adds so much to the film and makes it seem so real. And a lot of these are A-list actors and that's very evident because across the board the line delivery and choreography is astounding. Kudos to this entire cast!\n\nThe style of filming is stunning, with scene transitions and offset cameras and long exposure, it's a marvel. With a cinematographer who has not done many big films, he showed off his style in this. I really love how light the scenery and honestly everything is in this entire film, it brings joy and makes for a really fun watch. The camerawork is great too and reminds me of a Wes Anderson movie, very symmetrical and very careful camera movements. \n\nThe last twenty minutes of this film have to be the most magical moments in any film I've seen recently. It's so joyful and so heartfelt and it's hard not to feel so emotional while watching. I could rewatch the ending over and over and over again and never get bored of it. The score and the acting work so perfectly that it's impossible to not want to cry. I'm a sucker for endings that make me cry so here we are. \n\nThere's not much more to be said about Little Women aside from how good this story is and how well it was produced, you just need to see it for yourself. I thoroughly enjoyed watching this and I plan on rewatching it soon!",
            "review_date": "2022-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm so in love with this movie. All the character does make me feel like they are human to me. We can understand Laurie's why he is so devasted and falls so hard for Jo. The relationship between Jo, Amy, and Laurie is so touching my heart that I want to feel that again and make me order the little women's book. Emma as meg and Eliza as beth is also a fantastic performance for them. It was a really weird experience for me because all the way watching this movie. I can't tell what is the main conflict of this story. It is just about a family with 4 sisters trying to pursue their dream. But what makes this movie so beautiful for me is the journey and how the movie takes us there to the conclusion of each character. It is charming, funny, happy, angry, and sad. Amy is the character that can become annoying in the movie, but her annoyance is just pure childish and heartfelt. It doesn't make me mad but instead smiles as another sister also smiles because of the stupid and funny thing she did and said. Any other bad decision that Amy makes and causes pain to another character also becomes something that we can understand why she did it. All I can say is that this movie makes me smile the whole damn movie. And the casting for me in this version is better than the old one with Kristen Dunst as Amy. (maybe it is because I watch the 2019 version first too) Anyway, this movie makes me smile the whole damn movie. So yes it become one of the top 10 films that I love personally.",
            "review_date": "2022-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You burn the only copy of my manuscript, you're going in the ground — I don't care if we're family. Josephine \"Jo\" March (Saoirse Ronan) showed immense restraint throughout the film, not only by refraining from murdering her younger sister, Amy (Florence Pugh) after she commits the cardinal sin mentioned above, but also by pursuing her dream of becoming a self-sufficient writer during a time when she was expected to marry young (and hopefully rich) and have children. Little Women has been remade six(!) times now. Had it not been for the stellar cast and excellent director (Greta Gerwig), I likely would've never thrown it on. The setting doesn't hurt the film at all. In fact, I enjoyed the outfits, whether they were for fancy balls or something to throw on to go ice-skating, and it made me want to get into vests… I also found the dialogue to be enjoyable and shots of rural Massachusetts, New York City, and Paris appealing. I like Chalamet in everything, even if the film itself isn't great. I found Pugh to have the most noteworthy performance, however, as the petulant Amy. In a smaller, but not insignificant role, I really enjoyed Tracey Letts as Mr. Dashwood, the publisher. I'd actually like to take the time to give a shout-out to Letts: the guy always delivers and he doesn't seem to get enough recognition. Watching how Jo's book was made is craft porn. I empathized with her when she held it in her hands for the first time — number one will always have a special place in a writer's heart. My biggest gripe with the film is the timeline, which seems to be a common complaint. It's disjointed and sometimes disorienting, but not even coming close to approaching Tenet levels. Took me a while to get to it, but I highly recommend Little Women whether you think this is your cup o' tea or not.",
            "review_date": "2022-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was a bit slow paced and long, but the story was well told and ultimately inspiring. I saw this with a couple friends in the theater, and it was a fun Ladies' Night movie.",
            "review_date": "2022-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wholesome, elegant, cozy, free-spirited, empowering. Truly a masterpiece.",
            "review_date": "2022-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well done, well acted, on the long side, but nice story telling",
            "review_date": "2022-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a beautiful and guilty pleasure movie! The dialogues, the performances....everything here is so refreshing! \nGreta is really an amazing director!",
            "review_date": "2022-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hats off to Greta Gerwig for her rendition of Alcott's classic story of the daughters in Civil War New Hampshire.  Cooper as a character actor shines as usual.  I caught Watson in a Brit accent a few times, I have Brit family and I have the ear for it.",
            "review_date": "2022-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Greta Gerwig directs this version of the Louisa May Alcott classic about the sisters March and their relationships with each other growing up and with others.  Florence Pugh, Saoirse Ronan, Emma Watson, Eliza Scanlon, Laura Dern and Timothee Chalamet make up the main cast. With Meryl Streep and Bob Odenkirk supporting.   Excellent cast and great chemistry between them all make this a pretty delightful viewing experience.",
            "review_date": "2022-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great on every level—the writing, the directing, the acting; it all comes together to turn a book I would've found boring in high school into one of the finest films of the year, of the decade, of all time.",
            "review_date": "2022-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was bored by the movie version of this story that came out about 20 years ago and I was even more bored by this one. I also found the soundtrack totally annoying along with some of the acting, which was stilted and unnatural. These characters are just not interesting to me and the story is too bland to be cinematic. Chalamet is creepy in this and his acting is never very good in anything and was no better here. Most of the actor's looked \"acty\", especially Meryl Streep who was standout terrible. I agree with what others have said about the editing. It was unbelievably botched! I didn't make it through to the end of this one. I highly doubt anything remarkable could happen at the end since nothing the least bit interesting was set up in the first half.",
            "review_date": "2022-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely fantastic! It is very inspiring and the characters are all intriguing. It is hard not to fall in love with the cast as they portray these old fashioned souls. The pace is slow but certainly not in a dull way, you get so enthralled by the beauty of it that it doesn't need to be full of action and events. A movie about the simpler days depicting: romance, grief, identity and much more. \nI even surprised myself by loving this movie as much as I do - for I am not the biggest fan of romantic films such as this. \nI recommend you give it a watch. \n- Miss M",
            "review_date": "2022-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Normally I am not a fan of fictional historical films, but Little Women completely changed my view of them. The characters were portrayed very well.",
            "review_date": "2022-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is one of many adaptations of the fictional book little women by  Louisa May Alcott. We get to see great performances by the whole cast, but the acting of the main cast, Saoirse Ronan, Emma Watson, Florence Pugh, Eliza Scanlen and Timothée Chalamet elevates this even further. The story feels vibrant, engaging and colourful.  The Set-Desing, the costumes, the Lighting and the soundtrack are so well done they make this story feel truly alive. The story makes use of it's setting in it's entirety. The struggle with ones aspirations and dreams, with societies  expectations and constrictions, familial and romantic relationships interfering  with friendship makes this story into the work of art it is. \nI recomment this story if you like romance or drama movies in general, stories about emancipation or just the setting during the 19. century.",
            "review_date": "2022-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a little long and there are a few scenes where the feminism seemed unnecessarily in your face, but for the most part, ‘Little Women' is a triumph and delivers a fantastic, slightly more modern re-telling/re-jigging of a classic story that's still ends up being engaging and moving. That is mostly Greta Gerwig's doing, she is superb behind the camera and makes some fantastic directing and editing decisions that greatly improve on previous efforts. It also has to be said that great performances from the entire cast are a big part of why it works so well -- Timothée Chalamet is particularly memorable -- but it's undoubtedly Saoirse Ronan and Florence Pugh that are the hearts and souls of this adaptation, their very different characters each bursting off the screen in their own, unique ways.",
            "review_date": "2022-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant film, really loved the last 20 minutes or so which really made the film worth watching for me.",
            "review_date": "2022-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Little Women is cinematic splendor masterfully brought to life by the brilliant Greta Gerwig. If Hayao Miyazaki made a live action film, it would be a similar rainbow of colors and emotions... like watching a living painting. If such a thing exists, it's a perfect film.",
            "review_date": "2021-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched on Christmas day in what we thought would be a treat for my mum (she wasn't fussed in the end either), though I found it both dull and confusing timelinewise in some places, and some of the characters/actors irritating, I thought it improved towards the end.",
            "review_date": "2021-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This classic film is just charming enough to get away with the out-of-order scenes. By the end, you get the whole story but it's very confusing at first. The actresses are so enduring and effortlessly brilliant that you get emersed into the 1860s with them. Following their lives feels like a long emotional journey with a satisfying ending. It's worth the two our watch.",
            "review_date": "2021-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I did not read the novel or watched the original movie but I enjoyed it. The chemistry between the girls is so genuine. Saoirse Ronan performance is as good as always. But i’m sorry but I truly HATE the ending. It dosen’t feel right. My least favorite character getting everything. I would give it a 4 start but the ending makes me so mad so a 3 stars is the best I can do. ",
            "review_date": "2021-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredibly well-planned--well-directed and well-written. Sometimes the scene orchestration is too on-the-nose. It is the most uniquely structured adaptation yet, with the implementation of scenes of the true story that inspired the fictional story, which interestingly makes it less appealing (though more intelligent) than previous adaptations.",
            "review_date": "2021-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1994 movie is better in every way.",
            "review_date": "2021-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although Little Women's cast is formidable it is not overly boastful about itself. Gerwig is able to maintain a light, childish air and yet stress upon the importance of each of the character's lives. One of the greatest movies of 2019.",
            "review_date": "2021-12-18",
            "source": "rt",
            "lang": "en"
        }
    ]
}