{
    "rating": 7.0,
    "release_date": "2019-07-26",
    "num_reviews": 590,
    "genres": [
        "Comedy",
        "Drama"
    ],
    "summary": "Actor Rick Dalton gained fame and fortune by starring in a 1950s television Western, but is now struggling to find meaningful work in a Hollywood that he doesn't recognize anymore. He spends most of his time drinking and palling around with Cliff Booth, his easygoing best friend and longtime stunt double. Rick also happens to live next door to Roman Polanski and Sharon Tate -- the filmmaker and budding actress whose futures will forever be altered by members of the Manson Family.",
    "reviews": [
        {
            "content": "A terribly disappointing film 👎🏻",
            "review_date": "2023-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino manages to make a fantastic film out of a pretty obscure idea. Fantastic acting, great dialogue, authentic characters, funny.",
            "review_date": "2023-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply marvelous! Tarantino's another great hit for sure. Love it every minute of it.",
            "review_date": "2023-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great interesting characters, terrible story and movie overall.",
            "review_date": "2023-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino says this is his best movie, I disagree. That's one of his worst.",
            "review_date": "2023-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A real amazing movie which brings you the old skool classic vibes of Hollywood land. The movie from start to end is really amazing. It's not a thriller or anything, but an atmospheric movie which you can watch at home on holidays or like that. Still the climax scene was really thrilling which was outstanding. The acting performance of the star cast like Leo, Brad and Margot and all was as expected was really outstanding as well. Anyway a really amazing movie which is a must watch one I say💯",
            "review_date": "2023-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a classic.well written and acted. Worth your time. Watch it!",
            "review_date": "2023-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved parts of the movie. But Tarantino focuses too much on the old time Western television shows, which I found dull. I enjoyed the Charlie Manson parts a lot more. Overall it's an average film.",
            "review_date": "2023-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely mediocre.  No real enthusiasm from the actors or the script.  The pool scene towards the end seems to get a lot of attention, but to built up for hours just for that seems like a waste of a lot of talent both on and off screen.",
            "review_date": "2023-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great fun from beginning to end--Everything portrayed as it might have been. I discovered a new admiration for Quentin Tarrentino.",
            "review_date": "2023-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this was a pleasant surprise. I expected a lot from Tarantino since he made two of my favorite movies, and I got a pretty decent movie. Yes, it's kind of confusing and all, but it had that Tarantino's spark I missed so much. Violence, comedy, drama, it had it all, I loved it. The story is really nice, and the acting was inpecable, especially from Leonardo DiCaprio, man, he nailed it, a very underrated performance. Brad Pitt was good too and also the rest of the cast. Pretty good, I liked it.",
            "review_date": "2023-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has all of the great things that make Tarantino's movies so great. The acting, dialogue, and story is really interesting. I am not going to spoil anything when I address a common complaint: What is the point? It is alternative history and how something as small as what happens can change historical narrative and history forever. It is a fascinating and great concept that just may be above the general watcher. The ending sequence is so amazingly coordinated and hilarious that you have to watch. I have re-watched this movie twice in a matter of weeks because I loved it so much. It becomes so engrossing that you forget how long the movie is, I was sad that it ended when it did because I absolutely wanted more.",
            "review_date": "2023-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watch this film if you care about 1960's Hollywood. Watch if you want to view the dynamics concerning 1960's television actors and their stunt doubles. Watch if you know who Sharon Tate is. If you answered all three in the affirmative, than you're in the minority.\nMovie bad",
            "review_date": "2023-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was quite good. The ending was pure madness. de Caprio and Brad Pitt's chemistry was sooooo good. The movie was really a trip down to hollywood of 1960's and 1970's",
            "review_date": "2023-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No real story arc, extended scenes could have been removed. Excellent cinematography.",
            "review_date": "2023-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This really ran the gambit of Tarantino.\nthe Hyper intelligent 8-year-old was the breaking QT moment that bummed me out and of course the foot fetish-ness was rampant.\nalso, ASMR is ridiculously bad, the mix is trash. \nI bet Q wanted it be that way. \nbut it does nothing to the film.\n\nLooked good, Brad did great.\nbut not a good or great movie, by any stretch.",
            "review_date": "2023-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once upon in Hollywood is an enjoyable if not slightly confusing watch. The lack of a real storyline both makes the film feel both feel spontaneous and random, yet almost documentary like, as if you are discovering what will happen next at the same time as the characters. Tate, played by Margot Robbie is a seemingly small and unexplored character within the film, yet her contrast with Di Caprio's character and their differing experiences of Hollywood make her an interesting asset to the movie none the less.  The ending scenes provide the most storyline the film is willing to give, but don't quite tie together the randomness of the preceeding hour of so of film. I don't believe this is necessarily a negative, as the characters, set and dialogue are compelling enough that the lack of a story never slips into the realms of being boring. In fact, the scenes of driving through 60s Los Angeles, along with Cliff Booth's undeniable cool factor and slick lines, make the film exciting and enjoyable even before the typical Tarrentino action ensues.",
            "review_date": "2023-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incohesive and boring. Easily Tarantino's worst film in my opinion.",
            "review_date": "2023-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unfortunately, the film has no \"plot\", but this is quickly made up for by the great acting of Brad Pitt and Leonardo Di Caprio and, of course, Margot Robbie. Almost more exciting than the plot of the film is the backstory of the film, the thoughts Quentin Tarantino had.",
            "review_date": "2023-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite Tarantino film of all time. And I really love all his stuff, esp Jackie Brown.\nI've seen it 7 times now, and each time I pick up new things. It just gets better! Pitt and Leo are phenomenal playing off each other",
            "review_date": "2023-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When Tarantino puts out a movie… it's an event that I am happy to lineup for. And I'm happy to say this one did not disappoint. When I say, which is my favorite Tarantino movie, it usually happens to be the one that I'm watching currently but after many viewings, (and I know this is an unpopular opinion) this might be my favorite Tarantino film. This one certainly had probably the most laughs I've had at a Tarantino film and it's stuck with me more each time that I watched it…when you go to the movies you want to be entertained and when you watch a Tarantino film, you know his primary goal is to take you into his movie world and give you an experience. The acting is phenomenal down to every single character. The dialogue is witty and smart, and the direction and photography along with the set design is sublime. And the best part is this really is a buddy film (  and you can feel the love between these two friends, Rick Dalton, and Cliff Booth.) Leo and Brad play them to perfection. Kudos that the Academy recognized Brad Pitt for his performance, but Leo was phenomenal as well and the direction and movie as a whole was just a blast. And it brought attention to an actress I really didn't know much about other than the Manson murders.  Margot Robbie was terrific as well in her portrayal of Sharon Tate . I certainly hope Tarantino is going to give us at least one more masterpiece before he hangs up his directors chair.",
            "review_date": "2023-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a cracking film. Great dialogue, great acting. Tarantino on top form. Hugely enjoyable throughout. BUT. Give the back story of Charles Manson that runs through the entirety of the film there is a palpable sense that things are just not going to work out well. You feel uneasy. And then...\nNo seriously, watch this film.",
            "review_date": "2023-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed it but not much happened until the very end. I even fast forwarded towards the end around the 2 hr mark. If there were no stars it would have bombed",
            "review_date": "2023-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good looking film. Boring as sin until the last 10mins.",
            "review_date": "2023-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very mediocre. Such a long buildup just for a very average fight scene that leaves you confused because you were expecting way more than that.",
            "review_date": "2023-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly, the movie had me confused, but sign me up for any Brad Pitt/Leo combo that exists. I've been sitting here for 15 minutes trying to understand the point of a lot of the last 2.5 hours, but it had me entertained and that's all I'm looking for.",
            "review_date": "2023-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good movie as usual, cinematography is amazing but looses my attention sometimes, thus not as good as much of his filmography. But still a great piece of film!",
            "review_date": "2023-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome cinema. It had all the aspects you expect from Q. Because of its  suggested historical value it made film even more spectacular...exactly what I was waiting for.",
            "review_date": "2023-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino delivers again with this wild ride through an alternate reality. DiCaprio and Pitt are on the top of their game.",
            "review_date": "2023-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie transported me into the life of a 1960s actor & his stunt man. The entire movie was unpredictable in a way that is extremely refreshing. I don't know how this only has an 85%. There probably were not enough buzz words for the elites. Great work",
            "review_date": "2023-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that takes itself so seriously that the viewer will as well. It'll stick with you long after viewing.",
            "review_date": "2023-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another absolute Gem of a movie by Quentin Tarantino, engaging, funny, suspenseful, coupled with just the perfect amount of historical fiction Quentin Tarantino uses for some of his movies, and you have an immediate gem, the only reason this isn't a 5 star rating, is because the driving scenes were a little too long",
            "review_date": "2023-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I found it a little boring until the last 1/2 hour where It was 5 star.",
            "review_date": "2023-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a trippity-trip down the golden age of Hollywood. This film might not exactly have the same gravitas Blade Runner or Parasite has, but it sure is an entertaining watch. Comedy is on point and brilliantly delivered, great performances by an all-star cast, and boy oh boy... Now THAT climax is one for the ages!",
            "review_date": "2023-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best! Hilarious and captivating! Maybe Tarantino's best, and that's saying a lot. Capturing 60s TV as if transporting me back in a time machine, with all the hijinks of actors and their agents,  is phenomenal. I laughed my ass off! That whole Pacino schtick -- \"Who's gonna kick your ass this week? Mannix? The Man from Uncle? [chuckle] The Girl from Uncle?...\" Just a superb quote that will live forever!",
            "review_date": "2023-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why the good reviews? 20 boring minutes then I switched it off. Tarantino was awesome when starting out but this is as flaccid as any of the later Star Wars films.",
            "review_date": "2023-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably QT's worst. Margot Robbie is an awful actress",
            "review_date": "2023-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its a movie . A really good movie . Its not a platform for social bizarrness , political stupidity , brain-washing or toxic extremeness . It's what we used to call a \"movie\" . Fabulous escapism . Clever intermingling of story lines . Beautiful performance . Actors doing what they are supposed to do instead of preaching at how wrong we all are . And the best thing is there is no Harry or that rancid Meghan Markle in sight . Quite superb .",
            "review_date": "2023-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a wonderful ode to the cinema in the 60's !!",
            "review_date": "2023-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It´s a strange thing to me how a movie with great directing, superb music, great visuals and fantastic aciting somehow feels rather boring. I know what it is based on...but still...there is no real story just some random things happening to a bunch of people. I wasn´t invested to any of this. Even when the movie reaches its climax with the sudden outburst of violence I was like \"yeah, I hope it´s over now\". And it was. Don´t think I will ever watch it again.",
            "review_date": "2023-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yet another overrated film in 2019.  I found almost nothing entertaining about this movie except watching Margot Robbie play Sharon Tate, watching herself on the big screen at the movies.",
            "review_date": "2022-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like being dropped right in the middle of 60's Hollywood. Pitt got all the attention but DiCaprio is genius playing an insecure falling star.",
            "review_date": "2022-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie. Creative as always from Tarantino. Would have liked him to expand or focus a little more on the Mansons to give a little better picture but I can see why he didn’t since it wasn’t mainly about them. The acting is phenomenal and some of DiCaprio’s best work. The ending isn’t what I expected and left the movie feeling slightly empty because of it, but everything up to that point was well done. I wouldn’t consider it one of Tarantino’s best, but definitely not his worst. Good all around and entertaining movie. ",
            "review_date": "2022-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked the mood of it. It has some very cool well acted moments. There is not really a objective and solid conclusion to the film.",
            "review_date": "2022-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious, Outstanding, Amazing, Dark, Great. 9.5/10",
            "review_date": "2022-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best acting performance from Brad Pitt! With the best movie title sequence ever made!",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whilst Quentin Tarantino's \"Once Upon a Time in Hollywood\" does have a decent cast and performances from Leonardo DiCaprio and Brad Pitt, it is a real shame that Margot Robbie's (known for her fame as Harley Quinn) role did not have any opportunity to shine in addition to the long run-time and a rather mediocre story that is filled with poorly dated tropes and representations.",
            "review_date": "2022-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some characters fall flat and it can be a bit weakly paced at times, but as usual Tarantinoism- there is a very unconventionally told narrative filled with sick moments, beautifully shot scenes, immaculate screenplay and two outstanding performances from its two famed leads. It's also visually sharp and quite funny.",
            "review_date": "2022-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": " Quite entertaining despite Tarantino making up that Bruce Lee was a jerk.",
            "review_date": "2022-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Smartly crafted and well done, this shows that Tarantino has grown as a director, but it still has the same violent but yet funny moments that makes him great.",
            "review_date": "2022-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really ... Just really???  You pack it with stars, and you made this???  Charity donations for tax deductions are all I can think of...",
            "review_date": "2022-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has special meaning to me as I grew up about three miles from Spahns Ranch while this was all going on.",
            "review_date": "2022-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably Tarantino’s most boring movie. I usually like his movies.",
            "review_date": "2022-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this is one of the worst movies I've ever seen. It doesn't go anywhere for like half the movie and the last half hour was just people screaming. The whole movie just had this really off vibe. The one good thing about it in my opinion is the acting which is why I didn't give it zero stars. I honestly do not recommend watching this movie but maybe watch it and you'll have a different opinion",
            "review_date": "2022-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring. Useless screens, full of fan service.",
            "review_date": "2022-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my second favorite Tarantino movie. I absolutely loved this movie. Brad Pitt and Leonardo DiCaprio are amazing in it.",
            "review_date": "2022-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie, well acted with DiCaprio's portrayal of Hollywood star dealing with a faltering career, and his friend (and also struggling) stuntman played by Pitt.  Tarantino brings the Hollywood of the late 60s to life with depth, humanity and the sort of excellent dialogue we expect from him.  Margot Robbie's Sharon Tate brings a much-needed portrayal of the actress as a person rather than a victim.  The violent climax is over the top, sucking some of the energy out of a near-perfect movie, though it can't derail an ending that hits all the right notes beautifully.",
            "review_date": "2022-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"| Ratings Categories |\n{Characters (8/10) ; Cinematography (9.5/10) ; Plot (7.5/10) ; Acting (8.5/10) ; Pacing (6.5/10) = 80%}\"",
            "review_date": "2022-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its a good movie when you grew up in 60s you will love it but for me its just another quentin movie but thats not bad i liked the 60s atmosphere music acting scrip just another great quentin movie",
            "review_date": "2022-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I never understood the hype for this movie. I watched it, and didn't enjoy any except the last maybe 10 minutes. People were raving about it, so I watched again a few months later to see if I was overlooking something...nothing. I wouldn't recommend it to anyone. I gave it a half star because Margot Robbie was in it.",
            "review_date": "2022-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "New and Yet Classic. Quintin has done it again!",
            "review_date": "2022-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love Tarantino movies! And this one in my opinion is Great and i love it! One of my favorite and in many ways its step forward if compared to Pulp Fiction. Never understand why so many people so underrated this movie. Masterpiece",
            "review_date": "2022-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ONe of the best Tarantino since Inglorious Bastards! Brad Pitt seems to be his secret weapon.",
            "review_date": "2022-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched it; I didn't hate. Do I ever feel a need to watch it again? No. Did the film touch me emotionally or leave any lasting impression on me? No. Like I said I didn't hate it but can't seem to care that I don't recall much about it. Forgettable is the descriptive term that best sums up my feelings about this film.",
            "review_date": "2022-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "awsome, great quentin tarantino film, i think brad bitt is amazing",
            "review_date": "2022-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino is great (as always). Loved everything about this movie. It's also one of the last movies I saw on the big screen. I'm not sure there any more good movies made lately.",
            "review_date": "2022-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent Movie! Captures the look and feel of late 60s Hollywood The relationship between the two lead characters is well written and expertly performed by the two leads. Went in with reservations knowing the actual outcome of the real story of Sharon Tale and was surprised and relived at a poignant ending",
            "review_date": "2022-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story is just a collection of things that happens to happen and stretched far too long. Sharon Tate is the most pointless character coz she doesn't have any effect on the story one bit. Everything feels random. Rick shoots some Western, Cliff gave a hippy a ride and got some altercation with other hippies, Rick got lucky and shoots some Spaghetti Western, the hippies intend to kill some celebrity but got killed instead coz they happen to arrive at Rick's home. Screenplay isn't as engaging as some of Tarantino's best work, and that ending is done only because they need something crazy to end it.",
            "review_date": "2022-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A long boring movie. It went nowhere, just hours of disjointed bits one after the other, a sprinkle of   gratuitous violence and of course a heavy dose of cigarette free advertising - which maybe wasn't free. Jeez Americans are fucked up if this is what they call entertainment.",
            "review_date": "2022-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino at his most subdued and masterful, helmed by a trio of pitch perfect acting performances. All of the Tarantino trademarks are there, even if it takes some time for the plot to get going.",
            "review_date": "2022-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excessive use of the F-word and far more than would have been heard in the 1960s. There were some big-name actors in the movie, which was a plus. They delivered as we expect they would. The film itself as entertainment value was disappointing. Much of the first half was about an insecure actor filming western movies and they focused a lot of time on that filming. Then in comes the Manson clan. At about 1 hour 45 minutes in, I finally started to perk up as it tended to focus more on the real lives of the people it was about. At one point before that I was about to turn it off. The last 1-1/2 hours saved it from becoming a 1-star movie. I think it would have been a better movie to leave out all the sad-actor western filming and just stick with one theme, one life story. . . Sharon Tate.",
            "review_date": "2022-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a movie I am positive will age like a fine wine.  I too was confused upon my first watch, and even my second.  However come 3rd watch I realized this is a masterpiece.  Leo is the best actor of our generation playing a mediocre and insecure actor who within the movie must play his characters with different acting prowess at different points. The story unfolds within 2 or 3 days but the characters are laid bare within what might be consider simple exchanges.  I personally think this is the Tarantino at the height of his powers.  Most will choose Pulp Fiction, I think this is his seminal work.",
            "review_date": "2022-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not even close to Tarantino’s best work, but it kept me invested enough.",
            "review_date": "2022-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino and Pitt are highlights in this modern classic.  Once Upon a Time In Hollywood is strong in all aspects of film. Quentin brings heart to this one...",
            "review_date": "2022-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too long and boring, Brad Pitt proves he can't act out of a paper bag. Who under age 50 cares about 1960's Hollywood? Seems like Tarantino only made this film for people his age and up and everyone else can go walk off a cliff. \nHowever, I did care about the Manson family their dealings. That's what I was waiting for the whole movie, so why give us this junk about a fictionalized actor in westerns and his stunt double no one came to the theatre to see? I want to see more of the Mansons. However, I will say the ending where the Manson followers get killed by Brad is awesome. \nTarantino should make a revenge film that everyone can relate to, not just someone whose 65 years old. Everyone knows about the Nazis, and about black slavery in America. Not everyone knows about 1960's Hollywood or who Sharon Tate or Manson was. Try a little harder to appeal to the masses Tarantino.",
            "review_date": "2022-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Does Tarantino go out of his way to ruin the endings of his movies?",
            "review_date": "2022-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot is not boring. my pals & me can watch over and over while everyone will be amazed every time.",
            "review_date": "2022-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rated R: for revisionist history fever dreams. Not suitable for IQ's over 100.\nI seriously think Quinton has some deep psychological issue to keep writing this kind of revisionist crap. Does it make him feel better? It's just really, really weird. You usually don't see this kind of detachment from reality outside of a cartoon or superhero movie. For me it just doesn't work because I have a brain. I didn't cheer when the good guys killed the Nazis in Inglorious Bastards. I just found it completely stupid. Same with this horrible ending. Unless you are doing major world building then rewriting major historical events in isolation is just, really, really stupid and more then a little bit weird.\nOutside of that there is pretty much zero plot here. Just following around a has been actor and his tough guy lap dog until the final fever dream at the end. \nIt's DiCaprios worst performance in a while. The accent is just awful. \nPitt does more with a single look than 100 lines from DiCaprio. But then Pitts sycophantic, tough guy character is not very believable. To be believable he would have had to punch DiCaprio's character right in the face several times because no self respecting person would endure DiCaprios constant sniveling.\nMargot Robbie is in it but has so little screen time you'll forget all about her. Just seemed like a total waste of talent.\nAt least he resisted going to Spahn ranch and killing Charlie with a flame thrower in the end.",
            "review_date": "2022-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked it for its unpredictability. I never knew where the story was heading next.",
            "review_date": "2022-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can see Tarantinos handwriting in every scene of the movie. A masterpiece",
            "review_date": "2022-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Smell it...mhh smell nice. Finger in ...lick it, taste nice. So I drink the lot, oh this is peach syrup, what a drink",
            "review_date": "2022-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An entertaining movie filled with fantastic performances and gripping dialogue. Although, this movie is slightly directionless as I was 2/3rds of the way through the movie and had no idea where it was trying to take me. Despite that fact, I still was engaged and had a great time watching. The third act is so off the walls and crazy that it makes the entire slow burn of the film worth every second.\n\nScore: 88%\nVerdict: Excellent",
            "review_date": "2022-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Long uninteresting unfocussed movie.",
            "review_date": "2022-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow however interesting",
            "review_date": "2022-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Blobbo not see. Too too long.  \nTarantino look like combo of Bob Hope and Grandpa Munster.",
            "review_date": "2022-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am a huge QT fan.  It's his first truly unwatchable film.  It's so very long and boring.  Ultimately the story is too big to ignore.  The whole \"it never happened\" thing while sweet, feels forced.   Like Bobby's \"it was all a dream\" Dallas cliffhanger resolution, it robs the viewer of the authenticity of the previous hours of tension running through a seasoned and dedicated fan.  An artist experiments.  Occasionally, they are wrong.  It is what it is.  And it is a drag.",
            "review_date": "2022-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino' style of storytelling but not the typical action packed thriller but old hollywood nostalgia thriller that has different twist which audiences would appreciate (as we all know what really happened). Great acting as expected from leading ACTORS- yes that is including Margot Robbie as per \"Flower Girl\" character.",
            "review_date": "2022-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing, the performances, the plot, the historical context",
            "review_date": "2022-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What needs to be said",
            "review_date": "2022-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I dont get it, this movie was amazing! hilarious in parts and very captivating in others. Casting was SPOT ON",
            "review_date": "2022-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoy a nostalgic setting and seeing how life was not that long ago. If you expect frenetic edits and multiple explosions per frame you will be disappointed. If you know what REALLY happened, you will instantly recognize the tension from the horror that is to come. It is enough to hold the viewer in anticipation -- they will wait patiently to see how Cliff Booth is going to tear apart the Manson thugs. My only beef with any QT film is that he stays in that revenge zone a bit too long. It feels good to repay evil with suffering. The questions is: how much can a good person punish evil, without himself becoming evil? One effective head bash is sufficient in most cases, but doing it over and over just makes the protagonist look like a fiend. Perhaps QT has been holding up that mirror to teach that fact. I feel good when I should feel shame.",
            "review_date": "2022-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can't say I'm a fan of any of the actors but the spin on the Sharon Tate spin was nicely done, must admit. Watch it and enjoy just as a movie - it's nothing more than that.",
            "review_date": "2022-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "QT puts together a beautiful film.",
            "review_date": "2022-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clear out all the filler parts like overly long scenes of driving and walking etc.. and it's quite a good movie. I hear some people saying Margot Robbie was underutilized in this but that was the role and she played it. No big deal. It seems a little lost until it all pulls together at the end. I like that. I don't always have to know exactly what people are doing. I like to see how it's all laid out when the movie's over. All in all pretty good when there's actual acting and dialogue. Would be 3.5 but too much wasted time on \"filler\" scenes.",
            "review_date": "2022-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once of the worst movies ever made.  The whole movie seems so pointless.   This is revisionist history just did not work.  Margot Robbie was wasted in this film... she does NOTHING!",
            "review_date": "2022-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot is a little hard to follow at the beginning but then when u get used you follow.\nThe role of Leo and Pit great as always.",
            "review_date": "2022-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really wanted to see this film!\nBut this was like a very bad date: \nAfter 15 minutes I wondered \"where is this going?\"\nAfter 1 hour \"is this going anywhere?\"\nThe answer: \"No, it stays crap! Good cast, great love to detail, but a very thin story. Just a waste of time!\"\nBut lots of hype & marketing can sell \"this\" as gold. It's not!",
            "review_date": "2022-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In general, Quentin Tarantino is overrated, and in this fashion he now got ahead of himself. Being in a better position than ever to cast who ever superstar he wants, he obviously does it, again, but only to smear them out on a too long and effectively tedious carouse through diverse Hollywood elements.  It's all like he's opening a number of luxury tin can food flavours to say: - Look what I can eat, and no surprise, it always ends in his signature, an orgy of violence. This is just not necessarily very impressing, if it ever was. Since Pulp Fiction, his great exception and perhaps best film is Inglourious Basterds, because there's actually a good intentional point behind it all.",
            "review_date": "2022-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once Upon a Time…In Hollywood dishes out the best and worst of what Quentin Tarantino has to offer.  Centered around the relationship between fading actor Rick Dalton (Leonardo DiCaprio) and his stuntman Cliff Booth, the film is a nostalgic look at Hollywood culture during the summer of 1969.  On the positive side, the characters are relentlessly interesting, the story is original, the acting is great, the dialogue is fantastic, the soundtrack is spot on, and Tarantino's visual style (lots of effective tracking shots, crane shots, etc) is evident at all times.  The primary negative issue is the bloated 159 minute running time, thanks to Tarantino's inclusion of scenes that are either too long or totally unnecessary and the ridiculous number of cutaway shots of the cultural detritus of the time, giving the impression that he is more interested in entertaining himself than he is in entertaining the audience.  It's good, but it should have been great.",
            "review_date": "2022-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The characters / acting and numerous odes to the Golden Age of Hollywood keep this movie engaging. And just as you wonder where it's going, everything comes together and concludes in classic Tarantino style.",
            "review_date": "2022-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you've got three very long hours to carve out, \"Once Upon a Time...in Hollywood\" is a fun wallow through Tarantino's alt-history of the Manson murders, together with a nostalgic look at 60s Tinsletown. Tarantino's most accessible flick, it's a must-see for history buffs and cinephiles, but watch it on video to pause for yawns and a ninth inning stretch.",
            "review_date": "2022-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing movie. Many stories inside other stories. The ending is what should have happened in real life, but didn't.",
            "review_date": "2022-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3 hours of pure enjoyment.",
            "review_date": "2022-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Quentin classic.",
            "review_date": "2022-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hated every moment. x",
            "review_date": "2022-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest bromance movie of all time",
            "review_date": "2022-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I rewatch this movie frequently and the 3 hours zooms by. One of my all time favorites. ",
            "review_date": "2022-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun movie, far from Tarantino's best.",
            "review_date": "2022-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sonic and I have to a",
            "review_date": "2022-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"I am the devil, I'm here to do the devil's business\"\n\nGreat fucking movie. It is a slow burn, but the character's shenanigans are great to watch.",
            "review_date": "2022-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One compelling scene after another",
            "review_date": "2022-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I dont like it.\nStory was boring , nothing interesting.\nThe ends fight scene was good but that's it I don't like anything else.",
            "review_date": "2022-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Tarantino magic is truly unique; like nothing else in the film industry. It takes a deep journey into the lives of two men looking for their place of fame in Hollywood; all masterfully complimented with outstanding filming, talented acting, and a mind-blowing production set that deserves in full the awards it has received due to its time period accuracy. Being set in the late 1960s, there is no 21st century vibe throughout the whole film which fully impresses me. A lot goes on during the film and requires full attention and concentration. Multiple viewings is also advised. Quentin Tarantino applies a genius twist to a true story, thus resulting in this thrilling masterpiece.",
            "review_date": "2022-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best movies of 2019\nit was so satisfying",
            "review_date": "2022-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great chill film you can enjoy but is not one of tarantinos best and if you hold it up to his other films it is not as good and has its problems but is still a great film compared to most out there.",
            "review_date": "2022-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not much happened really. Parts of the story I enjoyed but mediocre ending with no real takeaway or disclosure I assumed was coming.",
            "review_date": "2022-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Arguably Tarantino's most restrained picture may also be his most tedious, at least as far as wide audience appeal is concerned. Not only is this is a fairly slow paced movie, it is a film where one certainly feels its legnth. The majority of the film is split between Leo DiCaprio's pitiable Rick Dalton, a former movie and tv cowboy star, now washed up and looking for a second wind; and his best friend/stuntman/chauffeur Cliff Booth, played by the always charismatic Brad Pitt. Together they go about their day-to-day lives in 1969 Hollywood, and really thats about it. The film masterfully plays with audiences expectations, especially those familiar with certain tragic events set to take place one fateful night in August involving Rick's neighbor, Sharon Tate, endearingly played by Margot Robbie. In Tarantino's Hollywood there is an ever-looming threat one cannot escape from, and not just from the hippies. One never truly feels safe, as though the ball could drop at any given moment, and Tarantino knows that we have come to expect this. So instead he builds up tension for 2 hours before pulling the figurative trigger and delivering exactly what we want.",
            "review_date": "2022-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed this. It was a Tarantino film filled with his typical dialog and characters. But, when it was over, I must admit that I felt no need to see it again. It was entertaining, but not compelling.",
            "review_date": "2022-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the good: great acting (Leonardo DiCaprio is excellent), great directing, and the whole feel of the film is very pleasant and fresh which is not a surprise from the director.\nthe not so good: its very long and the underlying story feels weak, too weak for the length of the film.\nsummary - it was kind of \"meh\".",
            "review_date": "2022-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As was done in Inglourious Basterds, this film used the formula of taking a historical event and bringing in new characters that bring another direction to the story. DiCaprio and Brad Pitt brought very funny characters, who did actions that changed outcomes and the history of cinema and TV.",
            "review_date": "2022-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is so good, the best are those last 30 minutes, their're so brutal and so funny",
            "review_date": "2022-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really like what they did with this story. Worth watching.",
            "review_date": "2022-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This what would happen if a 13-year-old kid was given a lot of money and told to make a Tarantino movie. Not much story or characterization and a ridiculously over-the-top violent ending. QT's worst.",
            "review_date": "2022-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Best movie in 2019.",
            "review_date": "2022-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Once Upon a Time in Hollywood' sounded like it would be a great film from the get go. Although Quentin Tarantino's films have been spotty in recent years, his best work such as 'Reservoir Dogs' and especially 'Pulp Fiction' are masterpieces. The cast consists of many immensely talented actors. It looked great from the advertising and who cannot help resist that title. That it was one of the year's most positively received films further added to the interest.\n\nAlthough it is not quite perfect, 'Once Upon a Time in Hollywood' to me was as great as hoped. One of Tarantino's best in direction, writing and as a film as an overall whole in recent years, towards the better end of his filmography and one of 2019's best films, its positive reception richly deserved. It is unmistakable Tarantino in a good way and a great representation of the cast, with many giving some of their best work in recent years.\n\nWill start with the very, very few things that didn't quite come off for my tastes. Some of the pace, especially for a film as long as it was, could have tightened and not every scene felt necessary. Actually would have trimmed some or all of Sharon Tate in the cinema, regardless of how beguiling the production values and Margot Robbie's (that smile is a beauty) acting were.\n\nDid think too that the Bruce Lee caricature and encounter were quite tasteless and anybody who was offended can't be blamed.\n\nThat sounds like a film worth a 7 or 8 out of 10. The good things though were so amazing and the film was in a different league to a lot of films released this year that to me awarding 'Once Upon a Time in Hollywood' either of those scores felt too low. It looks wonderful, dazzlingly shot with shots filled to the brim with atmosphere, stylishly edited with a lovingly recreated period. Tarantino directs with great confidence and his distinctive style is all over it. The music is used sparingly, but the music choices are very effective when used. Particularly so the quite sinister use of \"Twelve Thirty\" in a scene that already makes one feel unnerved.\n\nScript has the hard-boiled edge necessary and has entertainment and intensity. A word of warning, there is a lot of profanity (am mentioning this because this is something that bothers people) but to me it didn't feel as gratuitous as feared. Some pacing issues aside, the story is often absorbing and is quite nostalgic and daring with expert melding of fact and fiction. A few great scenes are everything to do with the making of the western with Rick and the girl (fans of classic-era westerns will enjoy it, likewise anybody with super fond memories of episodic television), Cliff's truly chilling encounter at the Spahn Movie Ranch and the splendidly over the top (and extremely violent just to warn you) finale in true Tarantino style.\n\nFound the characters to be interesting, with Rick and Cliff being quite meaty roles. The acting is exemplary, Leonardo DiCaprio is charisma and intensity personified and Brad Pitt, here the epitome of cool, has not been this good in years. Margot Robbie is absolutely radiant with a smile that lights up the screen. Bruce Dern, Damian Lewis and Al Pacino provide delicious support in small roles.\n\nIn conclusion, the odd pacing issue and one tasteless scene aside this was a great film. 9/10",
            "review_date": "2022-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a younger person coming in with only a bit of prior knowledge and background on this film and real life events. It had a certain magical taste at the end. Very good watch all round.",
            "review_date": "2022-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its entertaining but to provide an alternative ending to the Sharon Tate killings is in bad taste. Does the Director get away with this because her husband Polanski is a fugitive from justice and hate figure in the USA? Tarantino also has a dig at Bruce Lee also deceased and unable to react. Easy targets.",
            "review_date": "2022-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is such a terrible movie. Perhaps it is about time we use our brains and freedom of speech to say what we all know by now: Tarantino is a tired and overrated product of its time, the result of the collision of a traditional egomaniac and his fetishes with the turn of the century's pop culture. His formulaic characters, repetitive storytelling, disconcerting misogyny and limited stylistic choices have no place in the cultural entertainment landscape moving forwards.",
            "review_date": "2022-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Acting was alright but a lot of pointless scenes which serve no purpose to the rather weak storyline. Not really sure what Tarantino was trying to achieve with this slow 161 minute drag.",
            "review_date": "2022-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino is at his best. He keeps getting better and better. An all-star cast. Beautifully shot, great soundtrack. Some people didn't like it because it wasn't as bloody or violent as most of Tarantino's movies, but it doesn't have to be. ",
            "review_date": "2022-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too overrated when it was released, I didn't like it at all",
            "review_date": "2022-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great look back into not such a distant past. Great actors, great camera work and lighting,  very nice atmospheric directing",
            "review_date": "2022-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Typical Tarentino movie all over the place but it's fun and engaging. Need to watch it again to catch everything. ",
            "review_date": "2022-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very entertaining. It's a pleasure to watch Leonardo DiCaprio and Brad Pitt acting together.",
            "review_date": "2022-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most of the movie is pretty boring. With lead characters you really don't care about. The end is an absolute f-ing disgraceful insult to the real life Manson family murder victims.",
            "review_date": "2022-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great concept of what could have been. Pitt is brilliant and the film keeps you interested and guessing. Margot is one of the only beautiful women who could have ever pulled off Sharon Tate.",
            "review_date": "2022-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie felt like a daydream. funny things happened. somehow relatable and especially to the time that it was referring to. and then the ending. classic Tarantino. Leo and Brad were awesome it was fun to see them together. a lot more lighthearted in the other Tarantino films. Great respect to a classic time frame of movies and an ode to a time period when we loved movies at their best!",
            "review_date": "2022-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like most of his work, Once Upon A Time In Hollywood is another Tarantino masterpiece. It is a great story with a good amount of Tarantino humor and brutality. When I saw the movie I didn't see Leonardo Di Caprio and Brad Pitt but Rick Dalton and Cliff Booth. I really wouldn't mind seeing a 14 Fists Of McCluskey or a Bounty Law series spinoff.\nAlso I love the pop culture references throughout the movie. \nThis was an excellent movie from start to finish, and one you should check out if you haven't seen it yet.",
            "review_date": "2022-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't like it. I don't really like Tarantino's movies.",
            "review_date": "2022-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am a Tarantino fan and I would rate this as one of his classics. The alternate reality thing worked for me and shows how a tiny detail differing can potentially change history. I think Brad Pitt stole this movie.",
            "review_date": "2022-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "O.K., I get it Mr.Tarantino- you would win the 1960s Movies and Television Trivial Pursuit game every time... who else would know that Robert Conrad was famous for wearing tight pants? Like the director's other movies, this is a superficial exercise in mimicry; only noteworthy if it is examined for it's excess.",
            "review_date": "2022-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "julia butters was captivating. wish i couldve seen more scenes w her",
            "review_date": "2022-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't mind an alternate reality historical fiction movie. Wonderfully put together. Well written.  Acting performances from these professionals as expected. Fun if a little disturbing. Basically it's what I call the Forrest Gump genre with the Quentin twist. It was Quentin, right?",
            "review_date": "2022-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is decent, but expected a bit more. The build up is way too slow or the end way too fast. A lot of sides stories going on that had no real addition for the movie in my opinion. But with that said, Quentin Tarantino movies are always worth the watch, so give it a go.",
            "review_date": "2022-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun to look back at Hollywood during a different time.",
            "review_date": "2022-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had great expectations of the movie, but it was unfortunately a bit of a boring watch and lacked any real decent plot.",
            "review_date": "2022-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really beautiful film with wonderful actors and with a very high level of acting. The plot is very beautiful and however it is clearly divided into two parts: one a little obvious at the beginning and then going crazy at the end becoming very unexpected",
            "review_date": "2022-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For those who did not like this movie that much...you really should take some time off watching movies in general and reevaluate your movie watching ability.  Maybe you were just on your phone not paying attention!  From start to finish, during its long running time, this movie does not disappoint at any regard or at any level.  Brilliant performances by Pitt and DiCaprio and Robbie!  Wonderfully directed by Tarantino!  Cinematography top notch too and this movie just has that wow factor in interest level right to the grand ending!  9.5 out of 10!",
            "review_date": "2022-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie. Great performance from the actors. It's a little too long for my taste 😋",
            "review_date": "2022-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that feels so unnecessary, that lacks any of the inspiration and drive of earlier Tarantino films. Sure, it feels complete, but Once Upon a Time... leaves us asking a lot of questions about old school Hollywood and the Manson murders that really didn't need revisiting at this point, let alone with such a weirdly fetishistic lens and disdain towards women.",
            "review_date": "2022-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Quentin's worst. I felt like switching off numerous times. The ending is ok but mostly this felt laboured and pointless.",
            "review_date": "2021-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting twist made over a true story. Nice casting. A classic Tarantino's plot.",
            "review_date": "2021-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Where do you start? Amazing cast, killer soundtrack, snappy dialogue, stunning cinematography all set against the backdrop that is LA in the late sixties. A cultural smorgasboard that snaps and pops its way across the big screen with stunning mise-en-scene in each frame. A MUST SEE on the BIG SCREEN!",
            "review_date": "2021-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, this movie blew me away. I loved every minute of it and Leo and Brad stole the show for me. I LOVE this movie!",
            "review_date": "2021-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It all comes down to *that* last scene. The previous 2 and a half hour of filming is just Tarantino giving us one more piece of exceptional cinema. But these last shots are more powerful than any other thing Tarantino has created in his whole career: in cinema, she can live on.",
            "review_date": "2021-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredibly re-watchable. very funny, incredible action. Soundtrack sets the scene perfectly. Incredibly fun watch.",
            "review_date": "2021-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Leonardo DiCaprio is so good in this... and just the overall craft of the film.. it's such a neat idea. Such an interesting screenplay, too. 7.05/10",
            "review_date": "2021-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brad Pitt made the movie! Just watching his scenes and interactions with the Manson family made me love this movie!",
            "review_date": "2021-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved it. I have compared it to the other longer comedy movies like Boogie Nights and Wolf of Wall Street and this is my favorite. Definitely top 3 movies of all time to me. It makes we want to live in the 60s in Hollywood.",
            "review_date": "2021-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alot of fun. just wish it had more plot .....",
            "review_date": "2021-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had heard a lot of good things about this movie so I gave it a try, even though I'm not a Tarantino fan.  I found the first hour and three quarters extremely slow moving.  It was hard to engage with any of the characters because there was so little development.  DiCaprio's character was such a sad sack that I didn't really want to watch most of his parts.  It was just depressing.  Pitt's character was more interesting and was at least fun to watch when there was something happening and it wasn't just a long scene of him driving in the car.  I like Margot Robbie, but they didn't give her anything to do.  Not much of a story here, especially not to justify a 2 hour and 40 minute run time.  The ending was the only part that engaged my attention.  I thought they would at least use original music of the period.  I'm not sure why they used mostly bland covers.  I view 1969 as the golden age.  This did not evoke any nostalgic feelings.   Tarantino's appeal is lost on me.",
            "review_date": "2021-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a fairytale after all so why shouldn't it be a romanticised version of Hollywood with the time period been seen through rose tinted glasses? That is until reality creeps in and the tension rises. Tarantino is a Film Schools' director and this was well crafted love letter to Hollywood. All the way down to the overblown run time.",
            "review_date": "2021-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No story. No decent dialogues. That sums it up, Call me boomer. Something about... what is it?",
            "review_date": "2021-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brad Pitt takes the spotlight in this fictional story with real elements, events, and people from 1969 Hollywood. DiCaprio delivers not that much of a memorable performance, shining all the focus onto Pitt, although the acting remains rather mediocre at best. Nonetheless, as a stand-alone film, it does a great job recapturing the atmosphere and feeling of the 60s while tieing in factual elements to its plot. The twist ending is quite surprising to any familiar with the tragedy that had taken place, and it may cause some mixed emotions depending on how you feel about it. The story and plot are well-written and thought out thoroughly. The characters are decent. Tarantino has another great flick under his belt. -Fennett",
            "review_date": "2021-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie from Tarantino since PF. I actually prefer this over Pulp Fiction simply because the time , place and scenario it's set in. Also Margot Robbie is the hottest woman on planet Earth atm… those superficial points put the slightly inferior depth over PF",
            "review_date": "2021-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A unique genre should be created for Tarantino's movies. This madman is a genius!\n\nThis film has a very well put together script, remarkable editing and performances and a climax as only you can see in the Quentin Tarantino's filmography.\n\nThe only thing that prevented me from seeing this movie was the length, but the last scenes are worth waiting for.\n\nIt is a MUST SEE movie.\n\nPS: MCU, this is how you do a post-credits scene.",
            "review_date": "2021-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring and dumb. Complete waste of time.",
            "review_date": "2021-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm a big fan of Quentin Tarantino i love this film. I learn how the golden age of Hollywood looks like back in the day. I love this film. I love the cast and crew in this film. Masterpiece...",
            "review_date": "2021-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, well done and generally very solid",
            "review_date": "2021-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another fun QT ride! Pitt is excellent in this movie.",
            "review_date": "2021-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie about alternate history",
            "review_date": "2021-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not Tarantino's best, but not his worst.",
            "review_date": "2021-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was amazed at how much I liked this. I was convinced that I couldn't enjoy a Tarantino movie because I didn't like nearly all of the ones I'd seen. Then I see this and was blown away.",
            "review_date": "2021-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An extremely fun journey with Tarantino's usual blend of dark humour, crazy characters and enjoyable action scenes.",
            "review_date": "2021-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why go to all the trouble of recreating a famous event so closely and just changing the ending? Especially puzzling when the fictional ending isn't nearly as interesting as the real ending? Maybe Tarantino will do another movie about D-Day in which the Germans surrender on the eve of the invasion.",
            "review_date": "2021-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the typical Tarantino movie and if you go in expecting a Kill Bill or Django you will be disappointed. However if you are open to the director trying new avenues, it is an absolute classic. Many scenes and songs are haunting and linger on long after you have watched the movie.",
            "review_date": "2021-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just a long meandering waste of time with almost no storyline.",
            "review_date": "2021-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A little disturbing, a little sad and absolutely worth watching. Classic Tarantino thing as if he came back to the style of his best films (Jackie Brown, Reservoir Dogs). Film atmosphere is decent and it's stylised great. Actors performance is great. Absolutely enjoyed it!",
            "review_date": "2021-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story entangles itself on the edges with the Manson 'families' murders of Sharon Tate etal.  It's one of Quentin Tarentino's least violent films (though there is some violence, it is isolated to where you'd expect it).  I've always appreciates Tarentino's craft, and this is another good example of it.",
            "review_date": "2021-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino's magnus opus. Best movie from anywhere in quite some time.",
            "review_date": "2021-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Quentin Tarantino's lighter movies, the more character-driven Once Upon a Time in Hollywood has great dialogue, well-defined characters performed masterfully well be they real or fictitious, a memorably unsettling sequence at what is known as the Manson Ranch, amsuing sense of humour, wonderfully realised, immersive production values and one heck of an ending (if admittedly derivative of a past non-Western Tarantino period piece). It's not for everybody and the nearly-three-hour runtime will test the patience of viewers who aren't into Leonardo DiCaprio chatting with a precocious 8-year-old girl (well-written scene by the way) but, after the disappointment that was The Hateful Eight, what might be Quentin Tarantino's penultimate directorial effort proves, as far as people who still like his work are concerned, that the man's still got it.",
            "review_date": "2021-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not Tarantino's best, but found it a thoroughly entertaining film.",
            "review_date": "2021-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though advertised as an accurate biographical account of the Manson Murders in 1960s Hollywood, this film is actually more fictional, less about these murders and more a love letter to the actors of that time. The story is centred around director Roman Polanski and wife Sharon Tate's fictional neighbour, actor Rick Dalton and his stunt man Cliff Booth (based screen legends Steve McQueen and Burt Reynolds and the latter's stunt-double Hal Needham). The film explores how the two are struggling to adapt to the ever-changing Hollywood, paralleling with the growth of the Manson family who are interested with the Tate/Polanski household. Though a long film, it does quite well at showcasing the struggles of actors in Hollywood, the indulgence of the rich and the rise of a fanatic cult.",
            "review_date": "2021-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Instant classic. I loved it from start to finish",
            "review_date": "2021-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sorted by efforts on screen in this disrespect for the victims of the Charles Manson murders in the 1960s: Brad Pitt, Leonardo Di Caprio, Dakota Fanning, Margot Robbie and in last place TARANTINO!!. 2/10",
            "review_date": "2021-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a title like Once Upon A Time... In Hollywood, knowing of Tarantino's great passion for cinema, my expectations were high. For its three hours of running time, what we got is a sleepy bedtime story glued together with a bunch of mediocre sketches of dead celebrities not saying or revealing anything compelling. If you're still awake, you will be treated to another of Tarantino's over the top signature finales. You know...The total destruction of the bad guys. Dog mauling, flame thrower and all.",
            "review_date": "2021-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a strange one, as sometimes it feels like it doesn't have a point, and yet it's still interesting. Probably my favorite Tarantino movie. I don't like his stranger stuff.",
            "review_date": "2021-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fantastic film do not get me wrong but compared to Tarantinos other works it feels weak. There are great scenes here and there but often times just not much is going on.",
            "review_date": "2021-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What could've been another masterpiece in Tarantino's line up ends up suffering from some of the worst pacing I've ever seen and a lack of engaging storytelling. Once Upon a Time in Hollywood has one banger cast and two lovable leads, Leonardo DiCaprio, Brad Pitt, Margot Robbie, they all give it their all and it's one of this movie's redeeming qualities that saves it from being completely abysmal. The setting of 60's Hollywood is quite clever and allows our stars to pull off some wacky scenes. However, quirky characters and excellent chemistry can only get you so far, as the pacing is truly god awful, the first 3 quarters of this movie are slow as molasses with barely any plot development, and then once we actually get to the final act, it switches into its highest gear and blazes through it at the speed of light. Still, the final act of the movie is the best as it finally feels like something important is happening with even more funny interactions. Once Upon a Time in Hollywood has everything in place to deliver an exciting look-back on old school Hollywood, but would improve tenfold with a bit of an overhaul such as a new cut that trims down this slog of a movie.",
            "review_date": "2021-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun character study movie, but the plot and the end in particular felt like wishful thinking.\n\nIt strikes me as not the kind of movie a confident director would make, and Tarantino's own insecurities show through as a denial rather than a confession.",
            "review_date": "2021-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A darkly funny and entertaining picture, and surprising return to form for Tarantino. This is surely his best directed feature since Pulp Fiction. The performance from Leonardo DiCaprio is simply outstanding, particularly when he convincingly pulls off playing a man acting badly. The film is also directed with great class, with an excellent script that expertly blends real and fictitious history, with a great homage to the late Sharon Tate. Once Upon a Time in Hollywood manages to successfully recreate the Los Angeles landscape in a late 1960s setting, and do so in a way very pleasing to the eye.",
            "review_date": "2021-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That Tarantino uses unconventional narrative methods to tell unexpected stories is established. Hollywood is no exception as nothing much happens for the first four fifths of the movie. It is very watchable and enjoyable, with lovely performances by DiCaprio and Pitt. The central characters are revealed to the audience via a series of engaging vignettes. The last fifth is a fictionalized alternative version of the Manson family murders, with a far more satisfying conclusion than reality.",
            "review_date": "2021-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's self-indulgence and there's gluttony. With some films you feel that they're perhaps 10 minutes too long. Here, there's a whole hour that could have been cut without losing anything. After all, there isn't much to lose when the entire film is made up of sub plots. Pretty much the whole of Dicaprio's role is pointless. Pitt, though, has fun and holds the film together with a casual swagger that suggests that something may come of the film. It doesn't, but while he's on screen, you don't mind so much",
            "review_date": "2021-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There was no plot really, It was just a very basic movie with a great cast of actors. 6/10",
            "review_date": "2021-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The performances individually made this movie bearable. The plot was thinly stitched together and the violence felt (yes even for QT) gratuitous. It felt like he lost his touch and we literally spoke over the last hour wondering when would it finish.",
            "review_date": "2021-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ah, the magic of Tarantino. When audiences received the first teaser trailer of this film, it was introduced with one word: hype. It is a legendary director with veteran actors but it lived up to the hype. (I also want to personally thank my dad for constantly putting on Kill Bill when I was little and even though I got annoyed by the film and didn't appreciate cinema at that age, he exposed me to one of the greatest in the industry). Powerhouse performances and an ode to classical Hollywood that contains Brad Pitt driving around iconic landmarks from Arclight Cinemas to Chili Johns. The last 20 minutes of the film pays tribute to the store that's classic Tarantino (if you know, you know) and ones the credits role, one cannot help but say, \"ah, the magic of Tarantino,\" once again.",
            "review_date": "2021-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not by any means one of Tarantino's best, but still a pretty good film and very charming. I liked it a lot even though I feel the story was a little bit long and pointless. There's a bit of a bait and switch with the Manson murders that makes me wonder in retrospect why Margot Robbie's Sharon Tate got the screen time she did since she's not vital to the story in any way. I mean, it works in the sense that the switch at the end is genuinely surprising. The movie's about twenty minutes too long and I really started to feel it by the end. Also, while I genuinely liked watching it once, I'm not sure I'd enjoy watching it again.",
            "review_date": "2021-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lacking the cleverness of Tarantino's best films, this movie is too long, badly in need of an objective editor.",
            "review_date": "2021-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "another lame high cost/highly paid  list of actors with a tedious story from Q T",
            "review_date": "2021-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the films that never speaked to  me. Don't get the high rankings, I found it boring as hell.",
            "review_date": "2021-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino did not disappoint with this instant classic.",
            "review_date": "2021-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I Think The Ultimate Kicker For This Is The Art Imitating Life Imitating Art Vibe Threading All The Way Through It. The Over-Blown Violent Outbursts Are A Usual Inclusion Calling Card For Tarantino. The Soundtrack Is Full To The Brim Too. It Is Not His Best Work, But The Actors Involved Are Definitely Not Let Down Here Either By Any Disappointing Script Or Storyline.",
            "review_date": "2021-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is Tarantino doing his thing - for better or worse. which is mostly what i like; i just think the pacing was flawed where I had no idea where the story was going for most of it.",
            "review_date": "2021-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once Upon a Time In Hollywood is strong in all aspects of film. Quentin brings heart to this one...",
            "review_date": "2021-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Would definitely watch this movie you will not regret it",
            "review_date": "2021-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has a decent amount entertaining dialogue, and at times, entertaining story elements. However, the distance between the interesting and entertaining parts is vast. A nearly 3 hour film which takes far too long to really truly introduce the antagonists, and then what also feels too long before they begin... antagonizing, ultimately culminates in Tarantino's classic and excellent action for about 5 minutes to quickly wrap everything up.\n\nOverall, it just takes too much time to give you a sense of where it's going. You get the \"oh my god my career is on its way out\" storyline, which doesn't need to take 2.5 hours, only to end up not mattering at the end.",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was awesome... I really loved the cast and the story was written brilliantly ! And the ending was such a big surprise because you think you know what going to happen and then BAM !!!! surprise... this was just fucking amazing",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quentin Tarantino's love letter to the golden age of cinema. Wonderful!",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It didnt work for me. Acting was fine (Leo and Brad were great), but the story and all is just meh. Also the over excessive violence didnt work for me this time like it did for example in Django.",
            "review_date": "2021-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "83/100 this one was.... different and really good",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the grand scheme of Tarantino Movies, this one doesn't float my boat as well as the rest. Sure, there is a maturity to this film that shows growth, and there's no doubting that this is a movie that is probably more personal to QT than his other endeavours, but it's a difficult one to compare to the rest of his back catalogue.\n\nIt's certainly not gritty like Resevoir Dogs, or as cult as Pulp Fiction. It's not as comedic as Jackie Brown. Overall, it doesn't enthrall like these movies.\n\nThere are times when the film becomes too long in the tooth. Scenes showing the acting on set of Rick Dalton at times feel needless and add little to the storyline. It also feels TOO restrained at times and really only nods to QTs more gloriously over-dramatic style towards the last 20 minutes.\n\nWhat is done well though is Quentin's ability to lead your thought process one way and then turn it around - or drop the idea dead. There are times when you think \"yeah, this will lead to ...\" Only to have there be no lead there at all.\n\nAlso done well is the usage of an all-star cast in bit parts without the appearances feeling like little Camo performances to bring a big name to a film. Again, truly a nod to the greatness of Tarantino in that he can bring in massive names for small parts and leave the audience fulfilled.\n\nYou have to watch this if you like to watch movies by Quentin Tarantino, but equally if you're a fan of any of the lead stars too. And if you're not, it's still a good film to watch.\n\nBut if you're looking for classic Tarantino with a lot of action and a storyline that makes you think hard - you're in for a bit of a shock.",
            "review_date": "2021-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun, enjoyable, and thrilling and satisfying ending",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's just a fun movie. A film dedicated to a timeline that never was, and that revels in the violence against the lunatics who in reality caused so much cruelty. It's escapism at its finest, and the path toward the films incredible ending is littered with a hundred fantastic moments.",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quentin Tarantino delivers this fantastic nostalgic trip down memory lane with once upon a time in Hollywood. The writing in the dialogue as well as the soundtrack within the film teleport you to 1969 Hollywood. As a kid, I would go to California every summer and the scenery in the film brought back so many memories. The set design of downtown Hollywood is so impressive you feel like you are really there. Not to mention, the fantastically brutal fight scene in the climax of the film.",
            "review_date": "2021-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film adopts a nostalgic profile that is VERY well constructed, with maximum excellence. The crisis of identity and the way cinema works is the maximum point of Tarantino's personal touch in the film and certainly the best part of it.",
            "review_date": "2021-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very cool movie. Tarantino is definitely one of the best.",
            "review_date": "2021-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I Loved it... Very great... funny at times... however very emotional as this is a fairy tell Universe of 1960-70 Hollywood... I would rate it a 5 star but it had a bit of a pacing issue but when you stick with it, it is a real great!!!!",
            "review_date": "2021-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The right attitude towards hippies",
            "review_date": "2021-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quentin Tarantino most pure nostalgia-hued Golden Age-Hollywood. Definitely Tarantino Love Letter to Hollywood. It has everything you want from Tarantino Amazing Soundtrack, Dialogue, Violence, etc. If you want to",
            "review_date": "2021-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie QT has been building to his entire career, it's a brilliant, wildly thrilling, completely original, and deeply resonant piece of storytelling that only a great pop artist can create after their voice has evolved over the course of 25 years. It's the best movie of the past decade, one of the best of this century, so far, and a sterling reminder of just how great, resonant, inspiring and unforgettable movies can be when the corporations just get out of the way and let a gifted artist do his thing when he's truly in tune with and channeling the desires and impulses that fuel his creativity. The cast is also perfect. The character of Cliff Booth is one of the best creations of recent memory. It's also the best use of Brad Pitt in a movie ever.",
            "review_date": "2021-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it.  Brad Pitt alone but that finale scene…wow.  I put off watching it initially too due to runtime.  Honestly so worth it.",
            "review_date": "2021-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As of now, this is QT's weakest film. It is not cohesive enough nor does it tell a good enough story for most to become invested. The setting and costumes are highlights of the film.",
            "review_date": "2021-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While I have great respect for him, I can't watch all Tarantino movies due to the gore.  So this was do-able, and I found the flame-thrower pool scene near the end particularly gratifying.  \nThis boy's got Southern roots, and it comes out in his pacing, his humor, and his economy of words.  I'm good with all of that.  So much of what he does isn't even all that good, it's just weird - with great soundtracks and kitsch and casts and budgets.  And that's enough of a contrast to what we usually get, so I'm also good with that.  \nIt's a funny movie that I thoroughly enjoyed.  I was also a bit horrified at how well, and frequently, DiCaprio hocks loogies, and the dexterity with which he handles cigarettes, lighters, and the way he can hold and spew smoke on command almost like it's a dialogue unto itself.  It's literally physical comedy, loogies aside - that boy prob has a habit he doesn't need.  But gracious, he's good at it.  \nThere's almost a juvenile aspect to most Tarantino movies, that when added to big boy resources, just works.  I can enjoy some caricature.  And I don't understand why everyone else is derivative but him…..  I mean, I think everything at this point is largely derivative, I don't consider that a problem, just don't understand all the discrepancies in application.  \nMaybe this is Tarantino for the masses, I dunno, but I thought it was delightful and got a lot of laughs and enjoyment from it.  Think you just need to kinda know what you're getting.  With proper expectations, this is funny as heck.",
            "review_date": "2021-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sometimes tasteless, long and boring retelling of the Manson murders as a sort of comedy (with not many laughs) and of course with a radically different outcome. The amusing bits are the pastiches of old TV shows and films. The rest seems pointless - it is not particularly funny, insightful or anything else. Perhaps the worst product so far from this director who is hugely over-rated anyway. The sets, props and character appearances are of course momentarily diverting.",
            "review_date": "2021-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never thought Tarantino was boring until now",
            "review_date": "2021-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing! Quentin Tarantino is a genius. Justice at last.",
            "review_date": "2021-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The ending makes this movie a must see and what a spectacular ride leading up to it.",
            "review_date": "2021-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Am I missing something? I feel like I want to sue for the 3 hours of my life i just wasted. It took me 2 days to watch and I really had to force my self to watch the last 30 minutes",
            "review_date": "2021-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring. 2 hours of pointless, non-enthralling story line. 20 minutes some almost slap-stick action.",
            "review_date": "2021-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some movies are so good they rate a re-watch, and if you're lucky, that re-watch reveals new layers & details you hadn't appreciated the first time around.  So I find it with \"Once Upon a Time...\".  First is the immaculately detailed and richly nostalgic look, sound, & feel of the late 60's; a decade that began with so much hope & promise, but which was starting to turn \"bad\" by 1969, even if a callow young college student like myself didn't recognize the shift happening at the time.  Next is the level of thought & creativity Tarantino put into the story line of the fictitious Western TV series \"Bounty Law\", that prefaces the decline of Rick Dalton's Hollywood career.  The movie puts enough \"hooks\" into this that I actually hope Tarantino does indulge his clearly well-thought out fantasy to make a real film or a pilot around \"Bounty Law\".  I for one would watch it!  Lastly, thanks Quentin for NOT running us through the real ending to the Sharon Tate story one more time.  I wish you could have written the \"endings\" for the whole damn decade.  We'd live in a much better world today if you could have!",
            "review_date": "2021-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More Tarantino garbage. Inane script and mind-numbingly boring scenes designed to force his love of '60s soundtrack on the audience. Bruce Lee scenes were farcical and disrespectful.\n\nHe's a poor man's Scorsese with a hard-on for gratuitous violence. Sometimes you wonder if he's actually got a screw loose or maybe he's just completely creatively bankrupt. A one-trick pony whose best days are long gone - shame he never matured as a director.",
            "review_date": "2021-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No scenes of tension. No question marks, no arc. Just filmed beautifully, without heart, soul or script. Humour not there. Ending was whacky.... Indulgent film making sucks",
            "review_date": "2021-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More like a collage of sketches than an actual film. And I know, this isn't always bad but this time it's not that good.",
            "review_date": "2021-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Tarantino, end of the movie is epic though I would've enjoyed higher pace earlier in the movie.",
            "review_date": "2021-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very pretty film that offers a pointless homage, impotent, insistent and finally nonsensical parody of the old Hollywood mythology. Nostalgia isn't what is used to be.",
            "review_date": "2021-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic QT: bombastic, retro-tacky hollywood kitsch with horrible dialogue. The aimless, yammering script is completely devoid of depth, subtlety or nuance. Brad and Leo were the perfect choice for this dumpster fire though. The vapid artificiality and preening self satisfaction of these two hollywood idiots was both awkward and amusing. At least its appropriately titled, Hollywood is the place where taste, class and artistic integrity go to die.",
            "review_date": "2021-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Straight garbage !! Saw it in the theatre first week it came out and then watched it again online a year or so later and my original review has not changed. Tarantino wanted to make some film that was a homage to a bygone era in Hollywood but he knew that would not sell so he included the Manson angle to suck people in. Didn't matter. The whole film was stupid and boring especially the middle hour. He disrespected a legend like Bruce Lee with a fictitious character and did his recent move which is to create some alternate history for an actual event. The Labiancas & Tate et al are still dead regardless of how talented  & clever the director thinks he is.",
            "review_date": "2021-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It'd definitely one of Tarantinos weakest efforts because while there's a lot here not much of it actually has any meaningful input to the overall plot. For example pretty much the entirety of Margot Robbies characters story has absolutely nothing to do with the main plot and only serves to add to the runtime, you could pretty much remove her from the movie and you'd have a faster and more focused story but that's not to say she's bad in the movie because she's actually fantastic, it's just a shame she's completely wasted here though. Overall it is an enjoyable movie that's definitely worth watching.",
            "review_date": "2021-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite overrated. It's definitely not the masterpiece everyone keeps saying it is. But it is definitely far better than The Hateful Eight, and it's got some really fantastic scenes in it. The problem is there's too much unnecessary fill, and the movie is much longer than it needs to be. Brad Pitt is very well cast in this, and he probably deserved the awards he won for the performance. Overall, it's not Quentin's worst effort but very far from his best.",
            "review_date": "2021-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just lost 3 hours of my life... what a complete, utter waste of time. How in the world this film is highly  regarded is a mystery, The  \"acting\" is good, the visuals are pretty, but there is zero plot, and not much interesting in terms of stand alone scenes except for a few minutes,\n\nDon't waste your time on this fake \"art film\".",
            "review_date": "2021-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I honestly had no idea what to expect from this film. I just downloaded it at random. However, after watching, it perfectly describes the beauty of cinema.\nIt's nostalgic because it's like a love letter from Hollywood's past. It also feels like a fairytale because Tarantino changed the ending to a happy ending. Without a doubt, Quentin Tarantino is an exceptional writer and director.",
            "review_date": "2021-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outstanding movie. Yet another great Tarantino film. This one may not be as focused and tight as previous works, but it all comes together at the end. The final 30 mins might be his best work yet. Totally didn't see it going down like that. Would not be surprised to see him retire after this one.",
            "review_date": "2021-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good movie about friendship that could probably be 45 minutes shorter and not have that slapstick-gore final scenes.",
            "review_date": "2021-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. Just wow. I just saw \"Once Upon a Time in Hollywood\" on Netflix. I was skeptical because I'm not a huge Quentin Tarantino fan.\n\nBut it was eerily good. Easily the best film I saw over the last few years. \nI can't believe it didn't win best picture. Especially compared with \"Parasite,\" which I thought was mediocre at best.\n\nIt should have won best picture, best director, and best screenplay. The only major award seems to have been Brad Pitt for best supporting actor.\n\nIt's really an entrancing movie. And no spoilers, but the ending...",
            "review_date": "2021-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great characters, but story isn't appealing at all",
            "review_date": "2021-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's just OK, much slower and longer and more boring than his other films, not that funny either for a comedy. Jackie Brown and Inglorious Basterds... much better Tarantino films. It does have a really good final 20 minutes. That doesn't make up having to watch the other 2 1/2 hours",
            "review_date": "2021-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worse films I have ever seen. And that was the biggest insult to Bruce Lee ever.",
            "review_date": "2021-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Tarantino yet and hopefully not the last.",
            "review_date": "2021-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The chemistry between Pitt and DiCaprio is really nice, and Pitt's character is particularly compelling without necessarily being redeemable. The politics of the movie feel troubling ... particularly, advancing the narrative in which the Manson family stands in for hippiedom, and there is some kind of a culture war between hippies and, well, old-school Hollywood cowboy white guys who stand in for the norm. Having forgotten about the history, I found the class stuff at the end more remarkable than Tate. (Pitt goes to the hospital; DiCaprio goes to a party.) The movie gave me more I wanted to keep thinking about than I realized at the time.",
            "review_date": "2021-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino's inversion of the historical account offers a glimpse into the fairy tale universe where the \"real\" Hollywood tough guys get to make the leap into \"new Hollywood\". Sharon Tate's Kung fu is a sham but here in this dream world, the rough men intercept the psycho cultists and put the world right with nothing but a can of dog food and a flamethrower. A sweet dream of the spirit transformed from the \"real\" Hollywood circa 1969, described by Joan Didion in her famous book The White Album, a world of darkness, of bands \"too cool\" like the Doors, a world where no one was surprised when Manson crashed the party with his massacre, this world of \"new Hollywood\" gets a makeover. Manson is described as the flipside of charismatic cult leader, a loser who shows up at the Polanski residence looking for Terry Melcher (a fact according to at least one witness) but this is all you get from this cosmic nobody. This fairy tale rings true and I think it's Tarantino's best picture, better than Pulp Fiction by a mile, a love letter to a world that never was.",
            "review_date": "2021-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie has No story .Characters are introduced for no reason. what was the reason for having margot robbie or the hippie plot ?. The whole movie is dumb and pointless.",
            "review_date": "2021-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino clearly doesn't respect viewers' time with this self-indulgent plotless monstrosity. On top of that, the final scene really sours the mood with its too sadistic and graphic violence.",
            "review_date": "2021-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Refreshing.... that is the word that I use the describe this film... especially compared to most of the marketing driven trash that Hollywood has been putting out lately. I would have done without the violence at the end (I had to turn my head away) or would have found a way to make it less graphic but nonetheless.... I still loved it.",
            "review_date": "2021-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched the first half and had to turn it off, nothing was happening. Disappointing considering the director, and main leads in this film.",
            "review_date": "2021-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty cool movie but a bit long as usual for Tarantino.  Brad and Leo are great in this.",
            "review_date": "2021-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most boring movie i have ever watched. Oh my god!",
            "review_date": "2021-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quentin Tarantino makes a good compelling and interesting movie that keeps you entertained to the very end.",
            "review_date": "2021-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When I googled latest top 10 movies in 2019 it came up with information on https://swingmeup.com and I step forward to know about more this movie and after researching on IMDB it has a lot of review from the people, who have seen this movie, and I decided to go with this flow and I saw it was really fantastic movie you should watch at least one.",
            "review_date": "2021-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is 3 hours long for no reason. It's all over the place and none of the story lines really make sense. There is no climax, no building, the movie is very one note for the first 175 minutes. Then the end is a killing scene. Overall a waste of film.",
            "review_date": "2021-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino Greatest Film!!!! Simple as that",
            "review_date": "2021-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So bad, it was a complete waste of time",
            "review_date": "2021-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie SUCKED! Total waste of time. Nothing happens until the last 5 minutes. No plot or point to this crapfest.",
            "review_date": "2021-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So GD sweetly nuanced. Certainly the greatest film about a place called \"the 60's\"",
            "review_date": "2021-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best QT film ever. Some won't get it. I don't want to know those people.",
            "review_date": "2021-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once Upon A Time...In Hollywood - 9/10. It's definitely not for a film for everyone. The film takes its time in terms of moulding the story and tempo, but it delivers a cool nostalgic trip to the year 1969. Quentin Tarantino has crafted a film with much detail and superb performances! Leo and Brad deliver some solid and hilarious performances, with a shining Margot Robbie giving a subtle and bright performance as Sharon Tate. The rest of the ensemble cast deliver some great performances in their limited screen time, with Austin Butler and Margaret Qualley delivering standout performances within the ensemble cast. And, surprisingly, the film is probably his least violent film. I consider it as one of his best works, and definitely his most funniest film. A definite must watch!",
            "review_date": "2021-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fantastic period piece from Tarantino.  Toned down shock and quirkiness making for a more enjoyable overall experience.  Memorable performances from Pacino and Pitt - probably my all-time favorite by Pitt.  Tarantino has found yet another film to blend the western theme with a contemporary subject.  And yes, Nazis get fragged in this film as well.",
            "review_date": "2021-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Tarantino-esq. look at the Manson murder of Sharon Tate.  Also a look at the changing dynamic in entertainment and American culture from the traditional norms of the 50's-60's into the hippie era of the 70's.    There are a lot of layers here.  The dialogue is always crisp.   The acting is superb.    DiCaprio and Pitt are great in the dynamics of their relationships.   Margot Robbie is unappreciated in her mesmerizing performance as Sharon Tate.   The entire supporting case from Margaret Qualley, Bruce Dern, Al Pacino, and the rest are phenomenal.   Mike Moh is funny and exciting as \"Bruce Lee\".   Forget all the controversy from people that can accept an altered version of history that has Hitler burned alive but can't accept an over the top Bruce Lee- this was memorable.  The movie soundtrack is worth the whole thing even if you aren't a fan of the actual film.  You do not need to know the real version of events to watch this but you will smile if you do.",
            "review_date": "2021-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once Upon Upon a Time In Hollywood – Even The Name is another ‘Borrowing' \nQT's latest indulgence is all about his one-way fixation with the ‘60s. At 160+ mins it's a long trudge but the script probably only had few pages if compared with other movies of this length, why?... So many scenes are made up of shots of bods getting into cars, then long internal shot from back seat (lifted from the far better  Gun Crazy' 50s) then bods get out of car, long shots of feet walking, more bods get into cars, more long internal driving shot, bods again get out of car, more feet walking. This format is repeated from beginning to end –pages of same--  The 60s heralded in a new low for movie making – features like; ‘Beach Blanket Bingo', ‘How to Stuff a Wild Bikini ', ‘Sergeant Deadhead' were playing as main features across the land, el-cheapo's had become the new norm. What would usually have been a ‘B' picture were now being sold as an ‘A'. Yes. it may have helped a jaded Hollywood at that time but what about other mainstream audiences?\n\nSo, what might have influenced TQs fixation with this downturn in the social morays of movies? Tarantino grew up in the swinging ‘60s/mod ‘70s working in a porn cinema (this perhaps explains his addiction to perversity) including a video store - while also watching the endless re-runs of TV shows, along with an overflowing barrage of low budget, Spaghetti westerns that had flooded the market - thank goodness some audiences grew up (well, some did) and demanded better.  These endless ‘homage's to days offering little more than cheap TV-style quickies -- now being released to the big screen --- with product that was generally catering for a guideless, acid tripping youth (such as the Manson crew, etc) wanting endless simple-minded partying. Hollywood producers loved it – now, for half the normal budgets, they were getting the same financial returns as quality features. \n\nQT has simply revived those days and a new ‘comic book hero' generation have picked it up. Only this time round, the budgets are BIGGER while the contents remain juvenile, if not ridiculous. Trouble is, too many of today's producers and art critics also grew up in this overly comfortable, ‘anything goes' era, so they wrap on about the glorious emptiness that's making them all rich. Some rave about the cinematography and design - with that much money being thrown about it's simple to ‘copy' the work of previous Masters. But, no matter how expensively dressed-up and stylishly packaged rubbish maybe, it's still rubbish (but, GOOD-LOOKING rubbish). Too much you might be saying? Take a look back, revisit many of those poorly scripted, badly acted, TV shows and movies of the 50s-60s – the ones Q.T. tends to dote over...you may be surprised how your memory may have failed you as just how poor most were.  \n\nOnce U.A.T.I.H. looks like several proposed projects that never got off the ground all edited into one, and doesn't do justice to any of them. One or two characters and situations looked as if they may have been leading to something but simply fizzled out. How long might it take before more look back and ask, how were we so fooled?  Or is it just that LESS has now become the new MORE?\nSo, if this is Q.Ts 9th may there be only one left to go. Please.",
            "review_date": "2021-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing movie experience, specially because Tarantino takes his time. Although Margot screentime got all the attention, you have to highlight DeCaprio's performance, which is AMAZING. But Pitt is not far behind. Great, great movie.",
            "review_date": "2021-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was the best film of 2019 by far!",
            "review_date": "2021-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A look into the childhood of Tarantino and the 60's with amazing soundtrack, dialogue and outstanding acting by Leonardo Dicaprio and Brad Pitt.",
            "review_date": "2021-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I agree that the movie provides a raw truth about Hollywood and that there are some quite clever and funny moments. But I believe that there was no reason to take 3 hours from my time for this result.",
            "review_date": "2021-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "what if you were my stunt double and we did everything together for 9 years and were slightly in love with each other all along and we're both boys...\n\nanyway. i am delighted by and in love with this movie",
            "review_date": "2021-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As someone who has liked, disliked and loved some of Tarantino's previous work, and someone who's an avid consumer of quality cinema, I went in with some hype, some skepticism and mixed expectations. I had a slight idea what the movie was about, but I never bothered to dig deep into it before actually watching it. And since I believe I could've enjoyed it much more had I looked up the whole story prior, I highly recommend you do. It won't spoil the fun for you, it'll add up to it.\n\nSo I sat there, doing my best to just enjoy the movie instead of being too critical of it and looking too far into the scenes than I probably should, which certainly made for a better, more relaxed experience. The movie is long, and it being somewhat slow paced and patience demanding (which we're not always used to from Tarantino) could make it feel even longer, but if you're into that like I am, you know that's where the fun is at.\n\nI smiled effortlessly at most of the scenes (because they were just THAT good) and even laughed with some of them, but one thing is sure, in classic Tarantino fashion, the writing and dialogue were absolutely ON POINT.\n\nThe casting could not have been better, each actor portrayed their character to mere perfection and they felt more like actual people than in any other movie I've seen.\n\nThen comes the storyline, And I can't help but be a little biased here, seeing as my favorite movies are those that do nothing more than just tell you a story, the ones that make no effort to keep your attention. There's some events going on that you just have to follow, even if they feel like they're not leading to any peak or climax. This movie is a PRIME example of that. Perfect for people who like to get invested in a film rather than have it reward or gratify them.\n\nAnd then it ended, leaving me, and everyone there I'm sure, STUNNED by what we had just seen, by how brilliant it all was and wishing we could watch the whole thing over again, there and then. It was a truly surreal experience.",
            "review_date": "2021-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's nostalgic and the fights are composed very well. I heard about the California hippie culture back in the day but this movie gives the experience of how bad it was.",
            "review_date": "2021-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It doesn't work as breezy or mindless fun because of how bored I was, and it doesn't work as a compelling narrative or character study because it's clearly not trying to be. https://letterboxd.com/josephtomastik/film/once-upon-a-time-in-hollywood/",
            "review_date": "2021-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You don't hit \"play\" on a Tarantino picture with conventional expectations. I was perhaps surprised at how considered and thoughtful the script is, pacing slowly (but consistently) through a blend of real people and absolute fiction smoothly. It felt like it was building towards making a big point, but instead descends into hugely rewarding carnage - which isn't a criticism. In fact, the payoff for your patience and calmness is for jarringly brilliant (and potentially gratuitous) violence. If this is Quentin's last film, he's going out on a high.",
            "review_date": "2021-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino did a good bait-and-switch on me with this one, although the movie title should've tipped me off.\n\nI watched this knowing next to nothing about it, and I know only the bare minimum about the real-world events, but when Sharon Tate and Polanski showed up, I felt pretty sure about the direction this was going (which is exactly what Tarantino wanted I guess).\n\nWhen *that* night approached, with the the time-and-date overlays, I was convinced this was a story based on true events with a few fictional characters thrown in the mix. Needless to say, I was oh-so-wrong. After the slow and deliberate build-up, in the last chapter of the movie you get treated to a very abrupt and jarring transition into Tarantino territory. And then when the credits roll, the next surprise to me was that the movie almost has a feel-good happy end.\n\nPerformances are top-notch, and without knowing much about the setting, the meticulous attention to detail is obvious. I enjoyed this plunge into the late sixties immensely, and the cathartic burst of violence at the end was the cherry on top.",
            "review_date": "2021-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm a huge fan of Tarantino's, but this was a complete bore to me.  Indulgent and a love letter to himself and Hollywood.  Conciseness would've helped as the film was, in my opinion, about 45 minutes to an hour too lengthy.  \n\nAlso, there were a few scenes, particularly with the young actress Julia Butter's character, which were cringe worthy for their over sexualization.\n\nHard pass for me here.",
            "review_date": "2021-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its alright, give it a watch but don't expect it to be a mind blowingly good movie like some people say",
            "review_date": "2021-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most mature and grounded film of Tarantino's incredible career. His supposedly penultimate film is also one of his best as a director. Outrageously funny and self-aware, he delivers everything you expect off him just differently. All the lead actors, Pitt in particular, nail their roles.",
            "review_date": "2021-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't really know where the movie wanted to go, there is lots of useless material in it, it isn't even exiting until the third act. A disappointment came from Tarantino. the fact that it was nominated for best original screenplay alongside the masterpiece Knives Out, is insulting. The movie is fine, nice camerawork, directing and acting, but it does not have a point to go.",
            "review_date": "2021-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some characters fall flat and it can be a bit weakly paced at times, but as usual Tarantinoism- there is a very unconventionally told narrative filled with sick moments, beautifully shot scenes, immaculate screenplay and two outstanding performances from its two famed leads. It's also visually sharp and quite funny.",
            "review_date": "2021-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is a super slow pace and boring movie. Leonardo DiCaprio's acting is fantastic, but unfortunately the worst Tarantino Movie so far. To be honest, the best part of the movie was the last 10 minutes of the climax.",
            "review_date": "2021-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One Upon a Time... In Hollywood is a funny and thrilling film, with a perfect ending, that exhales DiCaprio and Pitt's charisma - fitting all that's necessary to be a good Tarantino movie.",
            "review_date": "2021-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Great actor. This movies transport you in Hollywood in that era with crazy story, plot, dialogue. Bravo",
            "review_date": "2021-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sony Pictures, Columbia Pictures, and Quentin Tarantino's Once Upon a Time... In Hollywood is a very amazing film!!!",
            "review_date": "2021-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie with the kind of ending you expect from Tarantino.",
            "review_date": "2021-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only Tarantino could have made this good. Nothing really happens until the final half hour in a 160 minute picture, but do we care? This man could write the daily routine of an undertake and create a superb feature film. The dialogue is up there with some of the best that I have ever experienced. The visuals are amazing. It's clear that Tarantino put his all into this project, and it completely shows. Career-defining stuff from Pitt and DiCaprio, who sizzle together and excel apart. Robbie doesn't have much to do of interest in comparison and her moments in the spotlight are certainly a change of pace, but still emanate the same amount of fun. The rest of the cast also shines at so many various point that they escape description. The film would have been good with these baseline ingredients, but the ending is one of my favourites from any of Tarantino's. The glorious climax of brilliant humour and over-the-top violence will remain one of the greatest cinematic moments of the 21st century, and all of the film's self-indulgences pay off.",
            "review_date": "2021-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have watched this movie over and over!!  One of my favorites! Everything about it is amazing.  If you are a true Tarantino fan then you will not be disappointed. See for yourself!",
            "review_date": "2021-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While not the most action-packed Tarantino film of his 9-film franchise so far and slow/boring in many parts, still of course awesome acting from Leonardo DiCaprio, Bruce Dern, and Brad Pitt. And to top it off narration from Kurt Russell of all people! Bruce Lee's portrayal was also sub-par at best.",
            "review_date": "2021-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My most eagerly anticipated movie of the year and I was a little disappointed with it. Not Tarantino's best but far from his worse either. The soundtrack wasn't as catchy overall (still had some gems but from top-to-bottom his soundtracks are usually top notch). Leo absolutely stole the show and continues to show why he's one of the finest actors working today. Brad did an excellent job complimenting him as well and their screen time together at times made the movie. Margot was a delicate flower throughout and was glad Tarantino humanized her. Unfortunately, due to the nature of her death she's viewed as a victim whereas this role gave her life. A very beautiful love letter by Quentin to the Hollywood of yesteryear. I'll check it out in theaters again!",
            "review_date": "2021-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very well done.  Very entertaining.  Awesome storyline.",
            "review_date": "2021-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only reason I give this a star is because the Bruce lee scene is hysterical.  The \nAST two minutes is alright but the rest of the movie is extremely boring and I mean almost unbearably boring.  Recommend either watching in a form you can fast forward or not watching.",
            "review_date": "2021-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is the first Tarantino film I've ever seen so it's quite different. I still really like it with DiCaprio and Pitt giving extraordinary performances.",
            "review_date": "2021-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow!!! The first time I watched this film, I laughed all the way through. The dialogue is hilarious, the situations are hysterical. The great fantastic phenomenal movie starring Leonardo DiCaprio, Brad Pitt, and Margot Robbie. Sometimes you may feel that the movie is too long. But as you keep watching, the feeling of the movie is faster than you can imagine. Some scenes, I won't say which ones but they get brutal and kind like suspenseful and how the music sounds. Feel like you're in a horror movie which is weird but then you also feel like you're in a comedy then go to a drama. It's has everything feeling and has lots of fantastic scene. This movie has a ton of great actors that give a performance of a lifetime especially Brad Pitt. He's so enjoyable and also entertaining. In my opinion, he is better than Leonardo DiCaprio in this movie although Leo is in the movie more. But Brad Pitt's moments stand out more and more memorable. Margot Robbie to me felt like she having a role that is less attractive in the movie. I thought the movie would tie the three main characters together but they never did disappointing for me. (Spoiler alert!) The ending of the movie made me a little confused but Quentin Tarantino knows what he's doing and it's supposed to mean something so I'm intrigued. Overall, the movie is really good, it's fun, and there are a lot of feelings that make it perfect. This is definitely a great film and it is my second favorite Brad Pitt film of all time.",
            "review_date": "2021-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing actually even happened in this movie. It's weird. And is Sharon Tate supposed to be pregnant here or what?",
            "review_date": "2021-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A story about an actor and his stunt-double that slowly unwinds into something much more sinister.",
            "review_date": "2021-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A relaxed Brad Pitt is akin to a cinematic massage. I liked Leo's scene with the child actor and Margot Robbie's scene in the theater. But overall, I felt quite bored with the two leads, whose time has passed both in their world and in mine. I just don't need stories about culturally expiring white men like this anymore, particularly when QT adds nothing new beyond his cinematic and physical fetishes (both also more fun in better movies).",
            "review_date": "2021-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some great ideas and very good acting. The film is a bit chaotic while still being very entertaining. The nonlinear plot is not only a disadvantage. Tarantino manages to make the best out of the absurd. Margot Robbie's character is kind of a waste of time. Brad Pitt is a standout, especially when it comes to humor.",
            "review_date": "2021-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfectly enjoyable but not the best Tarantino has done. Some really good performances, 70s nostalgia, great music, pop culture references. All the usual refinements but something's missing. Nonetheless, I'd recommend it to any Tarantino fa s.",
            "review_date": "2021-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In love with this movie ! Brad Pit in his role actually perfect.",
            "review_date": "2021-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is one of Quentin Tarantino's better works.  The fictionalized story of two Hollywood actors in the late 60's.  Great storytelling.  At no time was I  sure where the film was going.  Excellent camera work.  More importantly, Tarantino got the most out of his actors.  All performances were either good, very good, or excellent.  Leonardo DiCaprio made it into the 'excellent' category.  This movie may be worth watching twice.  It is nice to know Tarantino can still make a great movie, even though he is kind of an a**hole.",
            "review_date": "2021-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino, the Undisputed King of Happy Endings. I wondered where he'd go as he got older, this contains almost as much of his genius as the 1994 Magnum Opus.  Its not as good, but its just as warm. All the performances you'd expect aswell.  Lahvly.",
            "review_date": "2021-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Art imitating life or life imitating art is not an original idea, but it's one that is executed in a highly entertaining way in Once Upon a Time in Hollywood. The story loosely revolves  around the fictional lives of down and out actor Rick Dalton and his stuntman Cliff. Characters ride from one destination to the next in a sunny and vibrant 1960s wonderland accompanied by catchy songs and there are no clues as to what the audience can expect next story wise.  The fact that the movie doesn't try and bind the characters and narrative together allows it to blend fantasy and reality together in a highly organic way and the fluid transition between movie sets and real life locations and fictional movie scenes in a fictional movie are some of the obvious examples. The movie is funny and dramatic and wacky and touching and captivating and the take-away is that life is a story and we don't know what's around the corner and in those rare cases where we do get the satisfaction of knowing where a story is headed we're actually unlucky, because we'll never be surprised by it.",
            "review_date": "2021-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing but the best from Tarantino in this mature apologist tribute to the Golden Age of Hollywood.",
            "review_date": "2021-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was maybe the most boring movie I have ever seen. I don't care about the \"bigger picture\" and Sharon Tate, movie that long need something happening during it. There was nothing, and if there was something it was so irrelevant. You could probably watch last 10 minutes and miss nothing.",
            "review_date": "2021-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If some other guy had made this movie, everyone would be honest and say it is crap.",
            "review_date": "2021-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once Upon A Time In Hollywood is a good movie from Quentin Tarantino. I love the acting from Leo and Brad, the alternative history storyline, the direction and production design. I do feel that the Bruce Lee segment was a bit tough to watch but hey it's Tarantino right. Overall, this movie really made my day into the 1960s.",
            "review_date": "2021-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "QT is past his prime and his schtick is outdated and passe. This movie highlights this to a tee. Not only do we get drowned in his boyhood fetishes of bare footed, long legged young women/girls in jean shorts, but the explicit and implicit sexualisation of underage girls - and light weight racism cloaked in a \"But That's How It Was In The 70s\" disguise - wore me down. Is there still a palate for the ongoing portrayal of teenage girls as hot and horny bombshells seducing old crusty men? Is he trying to be edgy in this post-Weinstein era? Is he excusing pedophilia because \"she came onto me\"? Maybe. It's all bad taste, and not in a good way.",
            "review_date": "2021-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic movie. I was shocked to see all the undeserved bad press it's got.",
            "review_date": "2021-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In true Tarantino style, it was gory and sensational. Unfortunately, that's all it had to offer.",
            "review_date": "2021-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Familiarizing the way how industry works and how things are set in pace, the ride is not always smooth and steady for an actor, and how things are meant to be. The direction is unimaginable and something only the likes of Sir Tarantino could have done. There is sense of flow to the movie even though you're not in it following every step with steep grounding, the movie makes way for the love of the industry in the second half. The frames of the movie are absolutely magnificent and follows the pace inch perfectly. The reflection of Kill Bill and Pulp Fiction followed with the pace being just attractive enough to keep the viewer's attention, but grows as each minute passes by. Writing is what made this movie beautiful and the most precious things about movies like these are that the writer was also the director, so the imagination is not compromised and is set in stone. The thought while writing is put into direction the same way and keeps the authenticity the way it is meant to be. Dialougue's are very, very well-written with epitome level of acting to compliment it. Yet another masterclass from Sir Tarantino, following his reputation quite joyfully with his work being one of the finest ever seen in the industry. Brad and Leo were impeccable throughout, I didn't just see Margot's character being put to test but she was flawless too.\n\nFollow us on Instagram: @flixxflyy",
            "review_date": "2021-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is no storyline to this film. What a waste of two hours and forty minutes.",
            "review_date": "2021-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good storytelling and enjoyable, but the film seems lazy in a way, and the absence of any diversity sticks out like a soar thumb. overated.",
            "review_date": "2021-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it was a little to long and sometimes lackluster, once upon a time in hollywood is a good film from both my favorite actors and director, its entertaining and funny, however sometimes lackluster. Many are sure to miss the overall meaning of the movie which i will not spoil. The film does a good job of capturing \"the golden age of hollywood\" as it does really put you in Rick Daltons footsteps. This whole movie was like the Eminem song \"Darkness\" most of it has a double meaning im sure most viewers wont pick up. Having picked up some, I will say that it is a solid film that is well directed and acted.",
            "review_date": "2021-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Woof, what a waste of good acting talent. Seems like it was written in one night with a lot of cocaine and no clear vision: all over the place. Profoundly disappointing.",
            "review_date": "2021-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought it was maybe a little boring... so why can’t I wait to see it again?? It’s Tarantino. ",
            "review_date": "2021-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie moved at a snail's pace and was too long. The story did not advance the plot much, was filled with so many unnecessary scenes and took forever for action to finally start. I like Tarantino movies, but this one missed the mark big time.",
            "review_date": "2021-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When a man's partner is killed, he's supposed to do something about it.\nIt doesn't make any difference what you thought about him.\nHe was your partner and you're supposed to do something about it.\n--Sam Spade, The Maltese Falcon\n\nhttps://posthip.tripod.com/OnceUponATimeInHollywood.html",
            "review_date": "2021-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not his best film by a long way, sorry Tarentino fans",
            "review_date": "2021-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "l liked it ..ıt was good to see the best actors",
            "review_date": "2021-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I won't philosophize about this film or it's cultural markers and homage to milestones. But rather, I will surmise as such: this was Tarantino's best film since Pulp Fiction. It's unique, visually stunning, and engrossing. It renewed my attribution of value to cinema going and reinvigorated my enthusiasm for film. It is a masterpiece fairy tale made within our lifetime.",
            "review_date": "2021-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The ending made the entire movie for me!",
            "review_date": "2021-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, Amazing characters and actors, great cinematography, great soundtrack, and great directing. What more could you ask for?",
            "review_date": "2021-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a horrible film. It's like fifteen hours too long. Quentin Tarantula's obsession with feet is on gross display here, and I feel pretty convinced this movie does not pass the Bechdel test. I liked the way they made old Hollywood come alive visually, and there are some decent performances by famous people, but everything else was hot stinking garbage. Plus it takes way too long to get to the murders. The best way to watch is with a heavy hand on the fast forward button, let me tell you!",
            "review_date": "2021-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the one of the most great films of 2019.. great supporting by Brad and also for me an underrated performance by Leo.",
            "review_date": "2021-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Repeatedly stubbing your toe at the foot of your bed is a better way to pass the time than watching this movie.",
            "review_date": "2021-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Might be my favorite Tarantino film ever. I was a young child in 1969, but there is so much here that brings me back to those days. Love this movie.",
            "review_date": "2021-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just when you think Quentin Tarantino has hit his peak he blows you away with a new surprise, This film is funny, witty, violent, captivating, and smart -- all the elements of a dude film (without the sex) but the ladies will like it too.",
            "review_date": "2021-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my favorite movie ever made",
            "review_date": "2021-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't want it to end, especially after the thrilling ending, watching Brad Pitt and Leo decaprios on screen chemistry was like a fresh pop of welcomed mature movie viewers delight.Tarantinos movies  just keep getting better and better",
            "review_date": "2021-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Serious question...Is Brad Pitt in any good movies? Or has he ever done a good job acting in any movie?....Leo is amazing in this. Unfortunately the movie is boring as shit and is about nothing, The ending is hilarious and saves this movie from being a 1 star.",
            "review_date": "2021-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino brought back the magic of why we love movies so much and Brad Pitt's performance as absolutely a God.",
            "review_date": "2021-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "again and again, we see a new movie for Tarantino and his vision for modern history and accidents, a light spot on the other side of Hollyowood. \n great role for Brad Pitt and Dicaprio.",
            "review_date": "2020-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There’s a lot about this movie that I just loved: Leo’s and Brad’s performances, the exquisite period detail, the inside look at making entertainment in the late 60s, the “revisionist history,” the dialogue, the sudden pops of extreme violence, the seamless shifts in tone from comedic to tense. It’s long, but does not feel long. ",
            "review_date": "2020-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an experience. Great third act.",
            "review_date": "2020-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So, while I WAS interested in the story that Quentin Tarantino was going to present for us, and it feels like we were treated to more of a 60's time capsule. As a millennial, I'll admit that I am somewhat drawn to the historical aesthetic in this film, but unlike Quentin's masterpieces, Once Upon a Time in Hollywood is more aesthetic than it is rich story. I understand the tragedy that this is based on, and I think the film is a good time stamp, but that is all.",
            "review_date": "2020-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dont waste your time for this movie. All actors are great. But the movie is about nothing. Very boring.",
            "review_date": "2020-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino does a good job of establishing an aesthetic in this movie. In fact, it may be his best movie in that regard. However, the story falls short, leaving the viewer wanting something more fulfilling.",
            "review_date": "2020-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was alright... I found it slow and boring. Nothing really happens until the last 15 minutes of the film. The rest is just useless to be honest. Brad Pitt and Leo are great though! But definitely not the strongest Tarantino film.",
            "review_date": "2020-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino always weaves a wack storyline - and this one mixes so many things together that it's hard to catch it all the first time around.  Pitt, DiCaprio and Robbie are, of course, great.  And the last gruesome scene is so weirdly rewarding.",
            "review_date": "2020-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RATING: A+   Director: Quentin Tarantino \nOnce upon a Time in Hollywood could've been 4 Hours long I still would've Considered it a Masterpiece. I mean just the Amazing Details in the Production Design are totally great. And the Direction and Screenwriting from Quentin Tarantino are just what should I say... Tarantino Level. And I really don't have to start with the Cast.",
            "review_date": "2020-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What I really liked about this movie is the entire middle of it. When its kind of rolling along at its own pace. In fact, these moments are so good that they warrant me to grant this picture a full five stars. Although there are what one might call flaws, taken altogether and tasted that away, the picture taste's like it was cooked by a master chef, no doubt about it. Movie people love the taste. They relish it. They relish this movie. \nThe weakest link in this movie is without a doubt the entire Charlie Manson storyline. Not to mention the Bruce Lee arc which is also underdeveloped...unfortunately. The lack of development in some of these key areas feels like it was due to time constraints. But that is ironic because a picture like this one should not be constrained at all. That is indeed what we have come to expect from this genre. What genre you ask? The slice of life genre, I'd reply. Where setting takes top spot in terms of the overall story. Characters interact in interesting ways within the setting. And there really isn't much of a plot, certainly not like we would get from say a thriller or something. Not to mention there's not much special effects or action. In this movie the only action is from clips that are stitched in from movies that Rick Dalton starred in. Indeed, a movie like Inglorious Basterds seems like a giant successful production from the hollywood illustrated so finely in this movie. And that is the way that Tarantino does 'meta'. Back to the problematic Charlie Manson and his  cult of interesting hippie chicks and odd dog dudes. The movie ultimately ends with a climax that stems from this underdeveloped storyline- oddly missing the man himself, whose absence is not at all explained. Perhaps I might now wonder in Tarantino's what happens to Mr. Manson? But the audience probably wont wonder this because there is no hint, not even a subtle one, to wonder so. Indeed, what we come to realize is that there is a somewhat large bite size scene or two missing from this movie.",
            "review_date": "2020-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its a good Tarantino flick.Not in the Pulp fiction or IB league but still very entertaining.",
            "review_date": "2020-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful non-fictional tale on a fictional story. Quentin solidifies his mastery in story-telling yet again.",
            "review_date": "2020-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it. Amazing acting and the story was super captivating. Badass movie",
            "review_date": "2020-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So, the first time I watched this film, I laughed all the way through.  The dialogue is hilarious, the situations are hysterical, and the big name actors are perfect in their portrayals.  The late 60's - early 70's is trademark Tarantino in any and every film he has ever done.  Exploitation-style Film & Television everywhere.   It's clear he is in love with both the Hollywood of his youth, and the last Hollywood of fantasy the USA ever knew.  By the 1980's, we were able to \"peak behind the curtain\", and all the mystique/PR/Bullshit was gone.\n\nThe second viewing, however, opened my eyes to enough nuance that I felt outright stupid in my initial reaction.  This film is an outright tragedy.  All the characters depicted are suffering and beyond salvation.  Everyone see DiCaprio at the end of his career.  Easy.  Everybody sees Pitt as tied to DiCaprio for whatever success he EVER had, include his present as a driver and \"gopher\".  What I missed the first time is Robbie's suffering; this woman goes to a movie theater ... staffed by people who do nothing except see movies ... and struggles to get their recognition.  Almost begs them to know who she is, naming film after film, role after role, and they never really know who she is.  Even though she is in the very film they are showing RIGHT NOW, they don't really know who she is.  When the booth girl ask for a photograph, she asks her to stand next to the poster so people will know who she is.\n\nThere is a massive subtext regarding the suffering and ultimate rejection by the vert people all of entertainment (Hollywood) are inextricably drawn toward; the fans.  On some level, the 21st century exploitation filmmaker of note created a fil.m that reveals how the real people the public claims to \"love\" are ultimately betrayed and abandoned by the very people they are trying to please, trying to gratify, trying so hard to win the acceptance and love of.  Us. The cussing-shooting-did-that-just-happen sensationalistic director actually gives an unflattering mirror reflection to the audience, exactly as Rick Dalton faces himself in his trailer, but there is no redemption for us.  Nothing like he finds by recommitting his-self to the role he has been cast in.\n\nThe central protagonist (Dalton) is cast in the role of the audience; An Evil Hamlet.",
            "review_date": "2020-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most of the movie wastes time with them driving. Margot Robbie's character did not really play a big role or make an impact on the story. Overall, still a good movie, but did not need to be 3 hours.",
            "review_date": "2020-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A whole lot of cameos over a very weak storyline.",
            "review_date": "2020-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The production of the movie is fantastic as with the chemistry between Brad Pitt and Leonardo",
            "review_date": "2020-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Other than a flashback to the 1970's there is nothing there. No plot, no character development. A huge waste of time.",
            "review_date": "2020-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the problems that great directors run into as they start to acquire fame is that they become so popular that everyone around them becomes a “yes man” and won’t refine the director’s vision, edit them, and restrain some of their obsessive tendencies. Once Upon a Time...in Hollywood is Quentin Tarantino unrestrained. There’s excess all over this thing, from the unnecessarily long run-time to the constant bare feet shoved in front of the screen. This doesn’t mean that he is so unhinged that the movie as a whole is a disaster. On the contrary, there are still some great elements in this film, despite its tendency to ramble on to a nearly exhausting degree. First and foremost, the acting is stellar. Brad Piitt is his usual charming self, and makes this stunt double into someone every guy would love to have as a friend. Leonardo DiCaprio is perfect as the actor struggling with the inevitable shift in his career from leading man/hero to supporting role/villain. As for how this movie handles the whole Manson family thing, I thought that was fine. It might have been more impactful to me if I was more knowledgeable about the history related to them, but I knew enough to appreciate this film and how it handled the historic tragedy. I genuinely loved the big climactic scene, and it’s not just because this was the most interesting part of the film (since something of note was happening.) It has this cathartic wish-fulfillment quality that you don’t see many other film-makers attempt. I only wish it felt more like the satisfying conclusion to a story, but there was so little structure to Once Upon a Time...in Hollywood. The entire thing felt like a series of small vignettes featuring a number of loosely-connected people, and then they all come together in the end for a big finish. It’s one of those movies where I simply felt like things were happening rather than a story was being told, which is a pet peeve of mine. Once Upon a Time...in Hollywood is definitely lower-tier Tarantino for me, even though it will be a favorite to others.",
            "review_date": "2020-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can't go wrong with Tarantino... Always a Masterpiece... Love it.",
            "review_date": "2020-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film assumes you know about Charles Manson and the Tate-LaBianca murders. If you don't have that knowledge, the film has zero tension and is merely yet another 'movie about making movies', a tiresome genre inflicted on us by Hollywood.",
            "review_date": "2020-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely loved it. Among its other charms, it is such a radical departure from most depictions of the late '60s. There was a seedy pathetic cloying grubby element to the hippies of the late 1960s, and this nailed it. And how \"All-American\" and square a lot of the United States was. People forget that, but it was not all day-glo peace and love in the '60s--by a long shot--and Once Upon a Time captures that diametric culture clash. All in all the film is quite absorbing. Fantastic acting. I'd gotten pretty tired of Tarantino in recent years but this was an inventive, well-made, smart, enjoyable film.",
            "review_date": "2020-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At almost 3 hours, this film is a slow burn, but with such an intimate and romantic portrayal of old Hollywood, you almost don't want it to end.  The leads each do what they do best; DiCaprio flawlessly portraying an aging star fraught with self-doubt, and Pitt defaulting to a gruff but vaguely wholesome stunt man.  With a mix of pure fiction and history, Tarantino builds tension by showing you the lives of the real life stars doomed to get caught up in Manson-family murders.  Sharon Tate is portrayed in uncanny fashion by Margot Robbie, whose talent and charm is ultimately under-utilized by Tarantino's script.  The film shows a commitment to long-winded and over-indulgent sequences that serve as love-letters to late 60s LA.  There are a few of these scenes that go bust, but most of them are fantastically entertaining.",
            "review_date": "2020-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Over rated and a bit simple. But Brad and Leo pull it off enough to enjoy the 9th film from Tarantino.",
            "review_date": "2020-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino at his best. A letter of love to the cinema. Great to see in 2020 movies like this one. Thank you Tarantino, keep the good work. ♥",
            "review_date": "2020-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In absolute modern classic great characters great storytelling",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once again Quentin Tarantino absorbs us into his visually stunning world where three hours pass in a flash and we barely notice the time has passed. Star power in spades isn't the only thing that lodges this entry of his into one of the greatest he has made. This stands easily next to Pulp Fiction and Reservoir Dogs. The attention to detail in the cars, marquees, locations, costumes, even props like beer cans and cigarettes is beyond impressive. The performances were stellar (Brad Pitt's Oscar was well deserved and I hope to see him and Leo work together again) and the story was engrossing. I loved his twist ending on one of Hollywood's most tragic and bloody stories. Even fictionalized, seeing Sharon Tate's killers meet a gruesome (and hilariously over-the-top) violent end was gratifying in ways cinema doesn't often deliver.",
            "review_date": "2020-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst Tarantino film I've seen. Had high hopes for this one but got soooo disappointed. One of the most boring films I've seen in the recent years.",
            "review_date": "2020-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Couldn't even finish it. I made it halfway through....to the five hour mark before turning it off.",
            "review_date": "2020-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was an amazing cast with amazing acting from Leonardo DiCaprio, Brad Pitt, The storyline just wasn't there though. I want to say I loved it so bad but it just felt so flat to me. The ending was the most enjoyable part without a doubt. Brad Pitt's dog was awesome. but there is something missing or I missed.",
            "review_date": "2020-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Tarantino film since Reservoir Dogs and Pulp Fiction.  This film is a beautiful hommage to those 1960s films that I spent hundred of hours watching on early TBS weekends.  Q.T. has spent years trying to create those films on his own (Kill Bills, etc), but here just creates an atmosphere of how those films were made. Anyone who can enjoy a Clint Eastwood spaghetti western can enjoy this epic buildup to a quite memorable \"shoot out\"",
            "review_date": "2020-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a nice outing for director Quentin Tarantino, he has a nack for taking real life events and adding dramatic flare to change the events history.\nAll the players of this movie were well casted and acted, Quentin Tarantino's pension for dialogue delivers well however there was a slight disconnect for me in the initial beginning as there seemed to be just random elements thrown together. \nHowever all becomes clear after the first 25-30mins.\n\nI enjoyed this recent instalment and would highly recommend this movie to anyone looking for real life event turned upside down.",
            "review_date": "2020-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As far as Tarantino's filmography goes, this one ranks towards the bottom for me. A bit overlong and once again using the distortion of actual events as he did with Inglorious Basterds, Once... has great dialogue, keeps you consistently entertained and contains a couple great performances by Leo and Brad. But certain aspects and characters feel miscast, forced and unnecessary (Zoe Bell, Lena Dunham, Mike Moh, Margot Robie's overacting). Tarantino's films speak for themselves, flawed and even after everyone else's opinion. So sit down on a weekend and just dive in.",
            "review_date": "2020-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One would expect a five-star jewel from Quentin Tarantino's Oscar Titan, but this was considerably boring. It takes about two hours of drawn out character development to get things where you want them to be. Superstar celebrities grandstand their truculent conversation skills, but it all comes without the intoxicating suspense and shock that defines a Quentin Tarantino movie. His signature shock-narrative style ameliorates itself in the finale, but it's hardly enough of a spectacle to warrant its 428 acclamations.",
            "review_date": "2020-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I’m a big QT fan. This movie is hot garbage. Don’t bother wasting your time. Worst movie I’ve seen in a long time. ",
            "review_date": "2020-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was a surefire win for Quentin. I don't know what it is about it, but I thoroughly enjoyed it. It's not dark or edgy like some earlier films. But it's not slow or long winded as others. This sort of skates right on the line of it being comedic. Every joke I felt landed, The keen sense of what Hollywood is like right when they become a new decade was surefire. Even the intense scenes you felt on edge but it didn't overload it. The cast were good in their roles. I thoroughly give it props.",
            "review_date": "2020-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the absolute dumbest movie I've ever seen.",
            "review_date": "2020-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is boring\nGreat casting nearly every hollywood star was in here but meh story.",
            "review_date": "2020-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Indulgent. Humorous. Layers of social commentary, satire, reality... I'm not articulate enough to describe it. Perfect for fall season 2020. If you have a negative reaction, assess that. Very interesting. Movies that polarise opinions can be a platform for deconstructing and observing diversity of thought and temperament.",
            "review_date": "2020-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once Upon A Time... In Hollywood is a \"what if\" historical fictional movie staring Brad a Pitt and Leonardo DiCaprio who are struggling actor and stuntman in 1960's Hollywood. At the beginning of the movie we learn Leo's neighbor is Roman Polanski and Sharon Tate played by Margot Robbie. The script takes us thru Leo's life and times on sets of cowboy movies with plenty of cameos such as Steve McQueen played by Damien Lewis and Bruce Lee played by Mike Moh. It was funny to see Brad kick Lee's ass which never happened; another what if event.  Al Pacino was Leo's agent who finds him roles in Italy where Leo gets married and has four movie roles all about westerns except for one bond-like flick.  Kurt Russell played an on-set supervisor and narrator of the fictional movie.  The latter half of the flick was more entertaining where the whole storyline could have been cut shorter and get to the point faster.   The true story of Manson family murder finds pregnant Sharon Tate hung by a rope along with three other individuals but in this what-if scene finds the Manson family entering Leo's house to find drugged up Brad to face the evil doings. Brad definitely deserved the Oscar win for Best Supporting Actor role.  Overall great direction, good script, great cinematography, and great actors but it was a bit confusing, it was good to watch once.",
            "review_date": "2020-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't always love Tarantino, but I do love metacinema, and it is done right in this film. Leonardo DiCaprio gives a brilliant performance. Margot Robbie is as talented as ever. Quick side-note: like with many things, as a general rule when it comes to feet in the shot, less is more.",
            "review_date": "2020-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pointless movie that went nowhere.\n\nI normally like Tarantino films a lot, but this was horrendous. The only thing it had going for it was good cinematography and production value. The writing, story, and scenes were mostly boring.",
            "review_date": "2020-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Di Caprio is good as his usual but it's Brad Pitt who really steals the show in this one",
            "review_date": "2020-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ugh!  Turned it off.  It rambled on and on and on with no plot.  Big stars dotting the screen...for no purpose that I could tell.  It tried to be funny in the saddest kind of way.  To be fair, I made it just past half-way.  Thought about finishing it using the \"sunk cost\" theory...but would rather drink bourbon in a quiet room.",
            "review_date": "2020-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is art!  Just finished watching it for the 4th time.\n\nI could go on forever, as everything is simply breathtaking, from the acting, the storyline, the cinematography, but you would get bored of reading all that.\n\nThis film is simply astounding",
            "review_date": "2020-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For me the characters lacked any real soul--the whole movie felt camp and contrived and dismissive and disrespecting of the real tragedy",
            "review_date": "2020-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As the plot doesn't really go anywhere, the story is fun and the actors are amazing.",
            "review_date": "2020-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino shines his light on 1960s Hollywood and pens one of his finest scripts to date. Casting arguably the two greatest actors of their time helped the execution quite a bit as well.",
            "review_date": "2020-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LISTEN UP Audience Review people!! Will you please stop spoiling the plot of films? Use the reviews of actual critics as an example if you’re not sure how to do it. But the point is, knock it off!! Now, this film definitely gets 5 stars from me. It’s truly well-crafted, and it’s novel approach to being a love letter to the industry and the time period is endearing. ",
            "review_date": "2020-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great fantastic phenomenal movie starring Leonardo DiCaprio, Brad Pitt, and Margot Robbie. Man this movie is long and sometimes you can feel the movie getting a little long but when it doesn't feel long it sprints faster than you could ever imagine. Some scenes, I won't say which ones but they get brutal and kinda suspenseful and how the music sounds you feel like you're in a horror movie which is weird but then you also feel like you're in a comedy then a drama. It's has everything, lots of gore in a particularly fantastic scene that I'll never forget and this movie has a ton of great actors that give a performance of a lifetime especially Brad Pitt, he's so entertaining and in my opinion is better than Leonardo DiCaprio in this movie even though Leo is in the movie more the Brad Pitt moments stand out more and are more memorable. Margot Robbie to me felt like she was kinda useless in the movie and I thought the movie would tie the three main characters together but spoiler alert they never did which is a little disappointing and the ending too is also I little disappointing but Quentin Tarantino knows what he's doing and it's supposed to mean something so I'm intrigued. If it was any other random director I would be furious but with Tarantino it's acceptable. I can't wait to see this movie again in the future and see what Quentin Tarantino does next.",
            "review_date": "2020-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What did I think of Once Upon a Time in Hollywood? Check out my review below:\nhttps://open.spotify.com/episode/4j8QTVB4FIcjSxRJmys7nP?si=TNY1hbeARx6I8euvz3atdw",
            "review_date": "2020-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was great fairytale from the 60's Hollywood. Alternative timeline what could have happened, but sadly it didn't.",
            "review_date": "2020-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my second favorite film of 2019 (First being \"Avengers: Endgame\"). The acting in this film was fantastic, the story was incredible, and it's cool how this film takes place in the 1960's. This is definitely a great film, and is my second favorite Brad Pitt film of all time (First being \"Fight Club\").",
            "review_date": "2020-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quentin Tarantino is a great writer. He’s also a great director and storyteller. He really brings it all together in this film. In my opinion this is second only to Pulp Fiction among all his movies. I highly recommend. ",
            "review_date": "2020-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You gotta be the kind of person that finds other periods of time interesting. If you do, then this movie will suck you into a twilight zone of sorts. By the time you are through with it though, you will be....ehhh. Its good but its artsy in a way. It trys to be a blend of a few styles . Fiction, campy, period drama. I could have done without a few of the purposefully campy scenes. Much of the movie was also boring. It has zero replay value. The actors and director carried the movie. The storyline was boring.",
            "review_date": "2020-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too bad the alternative ending wasn't reality?  The movie didn't drag one iota and as usual Tarrantino plenty of over the top action.  It brought back a lot of memories of my very early childhood as was only 7/8 at the time.  Still cannot see Vic Damone and Connie Francis smoking a joint at the Playboy Mansion along with MaMa Cass moving her ass.",
            "review_date": "2020-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is Tarantino best summer film with really amazing cast from Brad and Leonardo and the rest of the cast and really breathtaking 35mm camera work and really amazing production designers.",
            "review_date": "2020-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Vapid script with no discernible point or impression. the only thing that brings it above one star is Pitt's performance. If you want to grasp the era and the events fictionalized, read Didion.",
            "review_date": "2020-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good script and great acting from the duo of Pitt and Leo. If you love a good script, this film is dialog driven. It might seem long winded at first but has a giant Tarantino payoff! Replay value is high. So saddle up with a glass of scotch and enjoy this alternate history movie",
            "review_date": "2020-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Where do I start,this movie a journey to the streets of L.A , a peek into the lives of a actor and his stuntman told in the most fascinating way in the time of Sharon Tate's murder time with a pinch of cool western clips.The great performances by Leo ( does this man ever gave a bad performance) and the ultimate cool Brad Pitt ( His best work to date) the innocent and brilliant Margot Robbie ( wish she had a bit more screen time ) and whole lot of unbelievable performances ( in particular by Al Pacino,Julia Butters,Timothy Olyphant,Margaret Qualley,Dakota Fanning and Bruce Dern).The writing by Tarantino is such a class even with almost 3 - hour runtime not a second is boring,you can't even change or alter one shot.The Cliff and Bruce scene,Rick's outburst and come back scene,the Spahn Ranch scene,Trudi's advise to Rick,Sharon watching her own movie,and of course the classic Tarantino climax and a lot more brilliant scenes.This movie is a bundle of joy with a lot of stand-out moments.The best work by Tarantino till date ( yes it is better than pulp fiction,at least for me).It's a MASTERPIECE.  96%",
            "review_date": "2020-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Quentin Tarantino self-indulgent vanity project with a jumbled, slow-moving plot that lacks a story line. The fact that this was nominated for best picture of the year is an indictment of Hollywood. I want the 2 1/2 hours of my life back that was wasted watching this \"movie\".",
            "review_date": "2020-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The whole movie i'ts great! some really good scenes and obviously the best it's for last. Leonardo was great! So as Brad and Margot",
            "review_date": "2020-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was one of the worst movies I've ever seen. I considered leaving early, but kept thinking it HAS to get better. It didn't. It only got worse. What a waste of time and money.",
            "review_date": "2020-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed the movie! Very entertaining! Great acting, snappy dialog, good casting. Nice costumes and sets. Kept my interest, although it's not really much of a story. After watching it, I'm not really sure what the story was. But it was so good I would watch it again, and I don't say that often! Nice job!  I particularly liked the Brad Pitt fight scenes. Particularly, the Bruce lee fight, and the last stoned hippie fight. Both had a little twist. Leo DiCaprio had so many roles, it was fun to watch! I recommend you watch this movie!",
            "review_date": "2020-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has no plot  - I just kept waiting for something to happen.  I thought it was boring.",
            "review_date": "2020-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was not the Tarantino movie one was expecting. I was not clear as to what the central theme of the movie actually was. Would not recommend watching it.",
            "review_date": "2020-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "‪Hope you like lots of character drama and little action, because that’s what you get with this otherwise well done Tarantino movie, with lots of personality.‬",
            "review_date": "2020-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A largely plotless sequence of events, but what it lacks in story it more than makes up for in sixties flair and effortlessly entertaining scenes.",
            "review_date": "2020-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great production and performances, my only problem it's that you need to know a lot about the history of Hollywood to really enjoy the film.",
            "review_date": "2020-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's already another pure classic",
            "review_date": "2020-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "was this a black comedy? seemed like it to me. thoroughly enjoyable for every second; loved the bruce lee/stuntman fight, but it didn't compare to the bloody finale. QT scores again with a pure delight to watch.",
            "review_date": "2020-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not awful but not his best IMO. I hope we finally get Kill Bill 3 now. ",
            "review_date": "2020-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too long with many unneeded scenes that should have been cut out.",
            "review_date": "2020-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just plain bad. Turned it off half way through. Unless you have 2 hours and 40 minutes of your life to throw away on a bad movie, just pass on this one.",
            "review_date": "2020-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved the aesthetic of the film and as well as having a great plot I also loved the duo of Rick Dalton and Cliff Booth.",
            "review_date": "2020-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To long and some good jokes it's just not interesting",
            "review_date": "2020-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a very good movie.\nOnce Upon A Time In Hollywood isn't the best Tarantino movie, but it's a great movie with excellent moments. Think this is the most mature Tarantino ever made. And god, the final fight? Is one of the best climax ever! 8.5/10",
            "review_date": "2020-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie to put as a background moving picture during a party or something.  Great photography and time piece (and acting) but a total yawn fest.  There are intersting bits and pieces but overall it doesn't add up to anything.",
            "review_date": "2020-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once again Tarantino manages to bring a masterpiece, one of the best films of that year, I do not understand how there are people who did not like the film, perhaps because they are ignorant !!!",
            "review_date": "2020-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It took me two nights to get through this movie.  What was good about it?  The idiocy in which they portrayed Bruce Lee?  The nonsense of DiCapprio's character?  It was entirely too long.  The last 7 minutes of the movie were fun and what every Tarantino movie has.  How did this movie get nominated for an Oscar???  Oh yeah, because it is a movie directed by a white male and stars two white males.  This movie was awful.  My wife and friends couldn't make it through the first hour.  It was TERRIBLE!!! oh wait, it was ROTTEN!!!",
            "review_date": "2020-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In Tarantino's own words this is his love letter to the industry of cinema. In my opinion Tarantino's way of non linear storylines are just superb and the fact he can make you feel unapologetic to feeling a genuine emotion in a minute is extraordinarily odd, his movies aren't the typical ones you see in Hollywood everyday. Once upon a time in... Hollywood is the perfect mix of reality and fantasy, if this is the first Tarantino film you see you'll probably find it weird but as i said his work isn't your typical run in the mail movies. Leonardo DiCaprio and Brad Pitts interpretations are immaculate, and the rest of the cast is great, the story itself is beautifully crafted, the constant movie and pop culture reference are exquisite",
            "review_date": "2020-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm a lifelong Tarantino fan. While this was not completely terrible, this is his first movie that I don't need to see again.",
            "review_date": "2020-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ultimately your enjoyment of Once upon a Time.. in Hollywood will depend on the value you place on the scenes that do little to further the plot or build character. Personally I think there is a 100 miunte edit worth 5 stars buried inside the 2 1/2 hours, if the time jump could be removed.",
            "review_date": "2020-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I’m not entirely sure what I just watched.... I’m not even sure if I liked or didn’t like? ",
            "review_date": "2020-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films of the last year. Everything in the film is great. Not one weak link. The acting, direction, soundtrack, action, suspense, cinematography, production design, costume design, writing, and finale are all incredible. Watch it!!!",
            "review_date": "2020-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Man I love this film. Day in a life type of movie with such bad ass people. I have seen this film 4 times and every time it gets better and better. TARANTINOOOOOOO",
            "review_date": "2020-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable to watch, but not Tarantino's best. I found the first 15 minutes to be incredibly dull, but it eventually picks up a bit. Gorgeous to look at and very good performances, but the plot is nowhere near as satisfying as his works like Basterds, Django, or Hateful 8. I realize that it's meant to be a bit more whimsical than his other movies, but I just wasn't as invested... I WILL say that the scenes on Charles Manson's ranch are thrilling. Tarantino is an expert in building suspense, and that whole sequence proves just that. I just wish there was more of that throughout the rest of the film.",
            "review_date": "2020-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too long and too much flamer. I think you must know hollywood history to really appreciate the movie and its references, wich is not my case.",
            "review_date": "2020-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though this film is linear, it feels like it isn't, something I understand since it's a Tarantino film. It is about Hollywood history, myths and celebrity culture which is why it generated so much criticism, but man what a boring way to represent those topics. It was long for no reason and doesn't truly grab your attention until the very end, It was a waste of amazing actors.",
            "review_date": "2020-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I must say, it was alright.",
            "review_date": "2020-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stuffed with superfluous scenes such as Margot Robbie watching herself in a movie, this one snoozes for hours before the strong climax.",
            "review_date": "2020-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not Tarantino's best, but it's right up there in the top four -- and that's a pretty good group of pictures.\n\nIn Rick Dalton and Cliff Booth, played by Leonardo DiCaprio and Brad Pitt, respectively, Tarantino crafts great fictional characters.\nThey are fabulously flawed heroes. They are perfect for this year-long dream sequence of a movie.",
            "review_date": "2020-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie and not giving away spoilers but it supported being prepared and safe for a home invasion scenario while giving an \"alternate ending\" to the Manson Family murders. High reco. Leonardo DiCaprio and Brad Pitt were fantastic and I will be watching this again. A Terentino movie can't be enjoyed just once. So much more is found in subsequent viewings.",
            "review_date": "2020-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once Upon a Time in Hollywood is one of the most fun Tarantino movies he has ever made. The story is perfectly crafted to set up for one of the greatest endings I have ever seen. Some might describe this movie as slow but after rewatching it multiple times I can promise you that it is worth the watch. Both Brad Pitt and Leonardo Dicaprio crush their performances. Tarantino masterfully recreates LA in the 60s while delivering possibly the funniest movie of his career.",
            "review_date": "2020-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie never seemed to do it for me. Slow start out of the gate with really well done nostalgia and fantastic acting performances by Leo and Pitt. Not much to go for it other than that. ",
            "review_date": "2020-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While a little stretched out, Once upon a Time In Hollywood is filled with good performances and (and I hate this) 60's vibes.",
            "review_date": "2020-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The majority of the film contained nothing entertaining or valuable, and I'm not even sure the end did.",
            "review_date": "2020-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie set in Los Angeles, what a twist this movie had without Sharon Tate even dying like in real life.",
            "review_date": "2020-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting and direction was quite good, but I'm struggling to find the point of the story. Seems like more Hollywood circle jerking. And I can not for the life of me understand why they idolized Polanski after the news on what he did. The only worthwhile scene was the one in the end with the burglars.",
            "review_date": "2020-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing film, one of my personal favourite Tarantino films.",
            "review_date": "2020-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quentin's best movie in my opinion. Really great performances.",
            "review_date": "2020-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like Tarantino films generally. This film, besides being problematic, is just so flat and drawn out.\n\nI personally think any 5 star review for this film are fan boys of Tarantino. \n\nThere's no story in this entire film.\nThey could have done so much with Manson becoming more and more crazy and the family. \n\nThe characters weren't interesting and there wasn't a plot. \n\nTarantino makes some really good films, but this one is a dud. Critics must look past their bias in reviewing a film and many did not.\n\nActing was great, cinematography was great and set design was superb. Actors had nothing to go off of and it's a slow burn until the last 20 minutes",
            "review_date": "2020-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I dId not understand how this movie was even made,the plot and dialouge is odd.",
            "review_date": "2020-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have to say, I read many reviews and heard a lot of views regarding this film. It's not something I do very often because I choose to watch the film first and then see what others felt. But ‘Once Upon a Time in Hollywood' certainly divided opinion among critics and audiences alike, but for me I absolutely loved this film.\n\nEssentially, there isn't much of a plot and I won't go into detail for anyone how hasn't seen it yet, but what I took away from this was that it seems to be Tarantino's film on the Film industry. To be more specific the ‘Golden Age' of Hollywood. That is what everyone has been saying and I couldn't agree more, because throughout the 2hrs 40 minutes of this, I wasn't bored at any point. Which many found themselves like when they watched it. The 3rd act possibly drags slightly but still enough to hold my attention. Brad Pitt and Leo DiCaprio's performances as stuntman Cliff Booth and Actor Rick Dalton received the acclaim they deserved, they were both phenomenal. Pitts supporting actor Oscar win was very much deserved in my opinion after seeing this. I can't really offer more than what people have already said. Margot Robbie's performance as Sharon Tate was acceptable, in a good way. I wouldn't say the inclusion of that character made the film what I thought it was, but it was a fine role that expanded the films narrative and it became relevant to the story. \n\nFinally, something that entertained me from start to finish and it has definitely become a positive through many of Tarantino's work is the soundtracks, and wow is this particular track a memorable one. Tracks such as ‘California Dreamin', ‘Hush' and ‘Brothers Love Traveling Salvation Show' were the ones that made fall in love with the film even more, and for me how good or bad the soundtrack compliments the film, ultimately can make or break how the film is received and this was a truly brilliant score.\n\nSo overall, I loved ‘Once Upon a Time in Hollywood' because it depicts the film industry in a fine era for cinema. And Tarantino shows just how much that era meant to him too. A very different Tarantino film, he shows his versatility here in abundance and for me, I would happily watch this over and over again. \n\nQuote - Hey! You're Rick fucking Dalton. Don't you forget it.\n\n9/10",
            "review_date": "2020-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great movie by Quentin Tarantino. Leo and Brad should do more movies together.",
            "review_date": "2020-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun for the most part",
            "review_date": "2020-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If it wasn't a \"Tarantino film\" it wouldn't have even made it to the small screen. I liked the concept but hated the way it was drrrrrrraaaaaaaaagggggggeeeeeddddddddddd out. This is one film that absolutely doesn't deserve the high praise it's getting. Only gave stars to the actors that had to hold this mess together. Really isn't the ‘magnum opus' everyone is pretending it to be.",
            "review_date": "2020-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ONE OF THE WORST MOVIES OF THE DECADE. THE ONLY GOOD THING WAS THE MOOD OF THOSE YEARS. LITERALLY, THE PRODUCERS MUST HAVE GIVEN AWAY EVERY SINGLE PENNY IN ORDER TO GET MORE STARS FROM THE CRITICS. IT DIDN'T HAVE A PLOT. IT HAD SOME FAMOUS ACTORS AND JUST FOR THAT SHIT, IT GOT SO MANY STARS. DO NOT DELETE THIS CRITIC BECAUSE IT-IS-NOT-TROLL. I GAVE 6 EUROS TO WATCH SUCH A SHITTY MOVIE... SIX MONTHS AND I AM STILL ANGRY...",
            "review_date": "2020-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "2 funny scenes. That's it. 2 plus hours of my life that I will never get back.",
            "review_date": "2020-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally got to watch the latest Tarantino, ONCE UPON A TIME IN HOLLYWOOD, and I have to say that I was a bit unimpressed. While I can't deny the obvious love for film that Quentin has, and especially for that time period, which was a true shift in the industry from a more care-free style of film, to a grittier, angrier, more inventive approach brought upon by the disillusion associated with Vietnam, the hippie movement and the Manson murders. The film portrays that end of innocence pretty well by following a popular actor on the decline, Rick Dalton (played with full-blown anguish by Leonardo DiCaprio) and his long-time partner, friend and stuntman, Cliff Booth (performed with perfect tough guy cockiness by Bad Pitt), a friendship that reminds one of the rapport between Burt Reynolds and stuntman Hal Needham. Their paths crosses the grimy ones set by the Manson family and Sharon Tate.\n\nSpeaking of Tate, I can't say that I cared much for her portrayal by Margot Robbie. Through no fault of her own, but hindered by her role being badly scripted as a vacuous flower child. If the intent was to make her the symbol of the innocence that is in danger of being destroyed, it's a bit too much on the nose.\n\nWhile there is the basis of a potentially fascinating story, Tarantino wallows in a bit too much of his self-indulgence, lingering too long o certain shots, and making sure he throws our way as many movie references as he can. Don't get me wrong; I'm a sucker for movies about movies, and I could have gone for more onset Hijinks by Booth and Dalton, especially the interlude in Italy hat could have been a movie by itself.\n\nThe Manson family moments could have brought a certain amount of tension to the film, but the whole flippancy expressed through every frame by Tarantino sabotages the stress we could have felt in those scenes.\n\nHe also goes back to his statement that a story beats History, and that the world is saved by art, by rewriting History like he did in INGLORIOUS BASTERDS and DJANGO UNCHAINED. While it was refreshing and unexpected in BASTERDS, it has lost a bit of its impact by now.\n\nI know that I am going against the grain of many reviewers who are claiming it's a marvelous film, and I'll admit that I did fall in love with Brad Pitt's character enough that I would love to see other stories about him.\n\nI feel this one wasn't the best one to tell.",
            "review_date": "2020-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The ultimate fairytale, absolutely loved this movie and the performances exceptional, all around!!",
            "review_date": "2020-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I expected a bit of a weird plot, which was true, and I was pleasantly surprised with the toned down gore.  Leonardo DiCaprio is a gem of an actor, proven once again in this film.  I was amazed by the acting of the little girl in the Western movie scenes.  Also, how is Brad Pitt still so attractive?  He's the best.",
            "review_date": "2020-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great story that doesn't disappoint. It may take a little while for things to really build up and get to the real payoff, but the journey well worth the wait. The payoff is almost too good that it makes the build up seem less eventful in retrospect.",
            "review_date": "2020-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this movie! So well made. BravO Quentin!",
            "review_date": "2020-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bizarre turn for the worse halfway through. Unnecessary characters and storyline that didn't add to the plot.",
            "review_date": "2020-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily Quinton Tarantino worst movie an I love him but this was just awful. Acting was good tho!",
            "review_date": "2020-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a Tarantino movie - slightly disappointing.\nGreat dialogue, even better cinematography.\nProblem is, the entire movie feels like an introduction, only to lead to nothing. No climax, no nothing.",
            "review_date": "2020-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I feel unless you know a lot about Hollywood in the 60s you will not understand many of the references made throughout the film. I struggled to gain interest in the film and it remained that way until the very last scene.",
            "review_date": "2020-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once Upon a Time in Hollywood Review: 9.5/10\n\nPros:\n\nLeo and Brad Pitt have awesome chemistry\n\nHilarious\n\nSurprisingly deep character moments\n\nOne of the best endings in recent memory\n\nCons:\n\nCan be a little long to watch (around 160min) if you don't appreciate film-making",
            "review_date": "2020-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant movie just as good as Jackie Brown.",
            "review_date": "2020-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everything you expect from Tarantino.",
            "review_date": "2020-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once was enough. I'm a big fan of Leo, but even he couldn't bail this one out of the doldrums. Watched it once, never again.",
            "review_date": "2020-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie brings you into the world of what is a Tarantino movie. It has perfectly selected cast for each character, the music is nostalgic, and the scenery/filming technic keeps you submerged in this very interesting world. It's a must see👍🏻😊",
            "review_date": "2020-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A questionable film. Not a terrible watch, but really not great either. Just very.. nothingy. Plus Tarantino's idea of wanting to change Tate's legacy felt a little distasteful to me. Her talent and life can be appreciated while still acknowledging the fact she did die the way she did.",
            "review_date": "2020-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino does it again! In my opinion, this was one of Brad Pitt's best roles. The Oscar he won for his role was much deserved.",
            "review_date": "2020-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The way of storytelling is certainly different. Leo and Pitt were spot on and you could feel the buddy chemistry. Acts like a slow burn but not sure that the payoff of a slow burn is there. Still worth the watch. ",
            "review_date": "2020-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my 2nd favorite film of 2019 (First being \"Avengers: Endgame\"). The acting in this film was fantastic, the story was incredible, and it's cool how this film takes place in the 1960's. This is definitely a great film, and is my 2nd favorite Brad Pitt film (First being \"Fight Club\").",
            "review_date": "2020-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fantastic film from start to finish and is truly Brad Pitt's greatest role yet.",
            "review_date": "2020-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I feel like most people rate this film highly just because it is a Tarantino film. It was incredibly boring and nothing actually happened until the final act, and that was only good if you knew the story of Sharon Tate. Its only redeeming features are the performances from the DeCaprio, Pitt and Robbie, the Easter eggs to other, way better films by Tarantino, the final act (if we had a whole film of that one week rather than a boring mess of Bruce Lee cameos and 60s nostalgia), and the natural flare that Tarantino's films have. Sadly, those were not enough to save the film from being terrible.",
            "review_date": "2020-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, among all the  crap out there!!! I love the different take on what happens. Great acting.",
            "review_date": "2020-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm really getting tired of the critics and fans giving movies high praise based solely on the director/writer.  Quentin Tarantino has been going downhill for the last several films and this was absolutely his worst.  This story dragged on, going nowhere.  Having to rely on narration to get the moviegoer to understand what is going on is not the type of movie he makes, but he couldn't get away from it.  In my opinion some of the best parts of his films are dialogs, intertwining story lines and bringing focus to the characters.  This film had none of that.  We are dragged through bits and pieces of forced character development, fragmented story lines, and a whole lot of going nowhere.  I'm sorry but if this film was made by an unknown filmmaker, I don't think anyone would be giving it good reviews (not even \"OK\" reviews).  Honestly this is like getting a really bad plate of food from a world famous chef, and reviewing that it was great based solely on the fact that it should have been great because of who made it.  Several of my top favorite films are Tarantino films, and I continue to watch them over and over again and introduce them to others for their enjoyment.  I cannot in good conscious do that with this film.  You can do so much better Quentin.  Please do better.",
            "review_date": "2020-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There isn't any real through line with the story, it feels more like a set of scenes that are loosely connected with the same few characters. It is extremely funny at times though, Robbie, Pitt, and DiCaprio all coast on their chemistry and charisma.  Most of the movie is surprisingly low key without that signature Tarantino ultra violence. But the last fifteen minutes make up for this and had me dying of laughter. It will be especially interesting to anyone who comes in with prior knowledge/interest in the Manson family and Tate Murders. Brad Pitt is the stand out performer here, and has many lines that generate deep belly laughs",
            "review_date": "2020-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino knows how to waste star power talen.",
            "review_date": "2020-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually, this is Quentin Tarantino at his most vibrant, most detailed, and his most stylish. The director does a brilliant job of recreating the 1960s pop culture iconography. His wide shots of busy main streets are visually stunning in the detail from billboards and movie posters, as vintage cars drive down the strip drenched in fluorescent neon lights against the dusk sky. Whereas vintage radio commercials for Heaven Sent perfume play in the background amongst the soundtrack ladled with supersonic sounds of the 60s. The director captures the period's sights and sounds so vividly, that the 60s Los Angeles backdrop feels incredibly lived in.\n\nLeonardo DiCaprio (The Beach) delivers a fantastic performance as Rick Dalton, an insecure star who is on the decline. However, the feature belongs to Brad Pitt (12 Monkeys). As Cliff Booth, he's charming and incredibly fun to watch. Pitt brings a certain energy to each scene that keeps your eyes glued to the screen, waiting for his next move. Especially during the incredibly tense scene at Spahn Ranch. Margot Robbie (Harley Quinn: Birds Of Prey) is almost magical playing the actress Sharon Tate. Many critics bemoaned Robbie's dialogue-light portrayal of Tate. However, one could argue Once Upon A Time In Hollywood captures Tate's wholesomeness. Instead of being associated with death and macabre, Tate's life should be celebrated for the beautiful soul she was.\n\nUpon release Once Upon A Time In Hollywood was billed as Tarantino's tale about the harrowing Manson-family murders. A home invasion nightmare that brought an end to the \"Summer of Love\" on August 9th 1969. Knowing this, there's a state of tension that lingers throughout. However, like Inglorious Basterds (2009), the historical record is used as a mere springboard for the directors fevered Imagineering. Tarantino takes the same route here inverting history, with Rick and Cliff turning the tables on the Manson family killers. The prolonged \"What if?\" violent finale is brutal and unapologetically satisfying. \n\nOverall, Once Upon A Time In Hollywood is a solid addition to Quentin Tarantino's filmography and serves as an ode to the golden age of Hollywood. The combination of fictional characters and real-life figures weave a revisionist tale around the event that arguably signalled the end of the \"Summer of Love\". It's more tender than the director's previous entry The Hateful Eight (2015), but still possesses most of the director's trademark shocking touches.",
            "review_date": "2020-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another one of Tarantino's overhyped and alternative reality movies that really has little to say about today's times. In this film, Tarantino wraps himself in the allure of 1969 Los Angeles pretending that he has something to say about aging actors or random cult violence. But he really doesn't. If you break down the movie - the Tate story is only there to provide a 3rd act climax where villains that can be shot, mauled, bashed and burned alive. Otherwise, it really serves no purpose other than adding atmosphere and context to a somewhat drab main plot. The Rick Dalton main plot is just another rehash of stories we've seen before about a bad aging actor who's being pushed out of the business. Yeah it's Leo and Brad Pitt. So what? As Shania would say, \"that don't impress me much.\"\nAs always, it's interesting to see how Tarantino breaks convention - like having a flashback inside a flashback - but if you're not a film nerd, this film may not be to your liking.  Overall, it's somewhat entertaining. But not the masterpiece that the lemming critics would have you believe. If you got nothing better to do for 3 hours, then go for it. But if you want and insightful look at the past and stardom, I highly recommend Almost Famous.",
            "review_date": "2020-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I want to enjoy movies and this one is extraordinary good.  It's a throwback to an era in history, even with all it's faults, there still remains an innocence in American culture that has long since past.  Thank you for still making movies for people who love them.",
            "review_date": "2020-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect sendoff to old Hollywood. Fantastic performances, great story, and amazing dark humor. As someone fascinated with the Manson murders this was a real treat.",
            "review_date": "2020-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the most of the proportion is quite..... pale. But the most signature part is the last half hour. Its serious go back to Q style.",
            "review_date": "2020-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've always been on the fence with Tarantino...they say genius and crazy is a fine line and I agree...where does this 1 sit...somewhere in the middle for me...The hollywood heavyweights of DiCaprio Pitt and Al Pacino carry the film for me...emphasis on Pitt...The story? Didn't quite get it or what it was about in all honesty but the 60s nostalgia was in overdrive and a great soundtrack to boot keep your eyes and ears from wandering for too long...and there are certain parts of the film that will test you...but in my experience all of Tarantino's films do that at times...That been said some clever scenes and found myself laughing at times as well so the comedy is there...the ending was unforeseen and really quite funny...the verdict watch this film when you want to appreciate good acting and clever script writing...when you want to be impressed by the clever minds that put stories together...if your feeling tired and dont feel like concentrating on the screen...I'd save it for another day",
            "review_date": "2020-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was far too long and boring. Many moments seem wildly unrealistic even by Quentin Tarantino standards. Another narcissistic Hollywood portraying Hollywood film that landed this movie a good score from the critics. Probably Tarantino’s worst film yet.",
            "review_date": "2020-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In his 9th film, Tarentino crafts some of his most likeable characters yet, and sets up possibly his best finale.",
            "review_date": "2020-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are a lot of creative liberties, so don't look for historical accuracy –this film is above and beyond that. It is a nostalgic tribute to the Hollywood of old. The production design and cinematography are memorable, The camera follows all the action and accentuates every little detail of the characters and their emotions.",
            "review_date": "2020-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quentin Tarantino likes happy endings. He likes them so much, in his imagination, he goes back in time and preemptively obliterates people responsible for history's nightmares, like the Holocaust, and the Manson Family murders which, for Quentin at least, did irreparable harm to the innocent chilled-out mood of Hollywood in 1969. \n\nIn Tarantino's repaired world (called \"Once Upon a Time in Hollywood\") Clint Eastwood (or someone much like him) never became a bitter old curmudgeon arguing with a chair. Instead, he got cast in Roman Polanski movies mid-career and got to go to more parties and keep his chauffeur and personal stunt double. And the cool mood in Hollywood never got overrun by dirty hippies with no cars and their awful political correctness. \n\nOh, people still get murdered in Quintin's world, but this time it's the right people: the political people, the radicals, the Nazis and people who will become Nazis, the people who will start killing if they haven't already. And this time the good guys win with every imaginable act of violence. The dirty hippies get mauled by dogs, smashed to a bloody pulp and charred by flames - just the sort of happy ending to make us all laugh and cheer. \n\nWhen I saw \"Inglourious Basterds\" I was struck by the irony of a scene within a scene: me sitting in a theater of people laughing at a revenge fantasy where Hitler is burned up with a bunch of Nazis as they sit in a theater laughing at a violent propaganda film about a German sniper endlessly shooting Allied soldiers from a clock tower until dead bodies are piled up. As flames envelope the screen I thought to myself \"this is moral hell and Tarantino is holding up a mirror and showing his audience how they are like the Nazis delighting in righteous violence on the movie screen.\"\n\nAt the time I thought that this irony was intentional and Tarantino's \"Basterds\" movie was a clever morality play about the dangers of \"preemptive war.\" I'm not so sure now. Perhaps Tarantino likes the idea of killing the bad people before they get a chance to kill us. And maybe he knows who should be allowed to pick the bad people: filmmakers (the old fashioned Hollywood kind), and actors who are childlike and innocent, and their no-foolishness stunt doubles who don't care about politics or activism. Or maybe the audience should decide what's fair in Movies and War. \n\nThe only characters in \"Once Upon a Time in Hollywood\" (set in 1969) who say anything about the Vietnam War or inequality or politics are the criminally insane Charles Manson family members. Everybody else could care less about poverty or inequality - as they float in their pools and dance at the Playboy mansion - because they are the beautiful and harmless people who create the escapism of movies! Tarantino seems to be saying that Hollywood got ruined by politics and undue attention to the private lives of its creative flower children.\n\nIt's hard not to see \"Once Upon a Time in Hollywood\" as a subtle jab at the Me Too movement. Brad Pitt plays a likable guy who, it is said, \"killed his wife and got away with it.\" But when an underage girl tries to seduce him he dutifully turns her down. Evidently Hollywood has a young girl problem. Roman Polanski is glamorized as the jet setting genius who made \"Rosemary's Baby.\" Al Pacino plays a movie producer and kindly old-world father figure named Marvin Schwarzs (in contrast to Harvey Weinstein who produced most of Tarantino's movies). Sharon Tate, played by Margot Robbie, is the only sweet and likable woman in the movie. She's almost angelic. All the others are either nagging wives, Feminazis or underage jail-bate. The near exception is one 8 year old actress (she prefers to be called an \"actor\"). Yet even she takes issue when Leo Dicaprio's character calls her \"pumpkin puss.\"\n\nFor all it's mystifying detail, \"Once Upon a Time in Hollywood\" is still a feast for the senses and a charming piece of nostalgia. Watching DiCaprio's insecure TV star character, Rick Dalton, melt down alone in his trailer after botching a scene is priceless. It may be Tarantino's most self-assured and well crafted movie to date. The violent finale plays like Three Stooges slapstick, and again, I found myself laughing at a woman getting her head smashed in, and another woman being burned up by a tool-shed flame thrower (left over from a previous movie). Remember, in the context of this movie, the Manson Family hasn't killed anyone, yet somehow Hollywood's grooviest times were rescued by the opportune violent killing of some hippies in place of Sharon Tate.\n\nOne has to wonder does Quentin Tarantino want us to reflect on these details or to just lighten up and laugh them off? I can't tell.",
            "review_date": "2020-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This review is really going to be very biased as the movies 🎥 of Quentin Tarantino is what got me into filmmaking. Pulp Fiction has been and always will be one of my favorite movies scenes I was way too young to see it. The stars ⭐️ Rick Dolten (Played by Leonardo DiCaprio) and his stunt double Cliff Booth (Played by Brad Pitt) with Sharon Tate (played by Margot Robbie) and their agent Marvin Schwarz (Played by Al Pacino) everyone does an amazing job in their respective roles ( especially Leo in his trailer which I bet Quentin told him I'm gonna leave the camera 📸 on for ten minutes here are some guidelines go nuts 🥜). Do I even need to explain why the cinematography was great it's Tarantino forte to shoot compelling dialogue scenes even if they're talking about something that doesn't relate to the overall plot? Speaking of which the writing ✍️ and directing is great 👍 but I will admit that some scenes do drag on a bit too long and the film really picks up in the end but that's just a nitpick. The end while not giving anything away Tarantino has doubled down and ones again made violence a cartoon and the whole audience and I couldn't stop laughing 😝 😆 😂 all the way through. Overall I think 🤔 this will rankings this out of all of Quentin's filmography I would rank it at number 5 behind Django Unchained, Inglorious Basterds, Kill Bill vol1, Jackie Brown, and Pulp Fiction but definitely ahead of Reservoir Dogs, The Hateful Eight, Kill Bill vol2, and Death Proof 💀Hey just gave you all a top 9 list, I'll give out my full top ten when he's 10th and the final film comes out and I give it a 9/10.",
            "review_date": "2020-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Halfway through I was still waiting for them to get to the point or at least give me a reason to keep watching other than the beautiful setting.  After all, this movie was nominated for best picture alongside Parasite, Joker, Marriage Story, etc.\n\nThree quarters in I realized they weren't going to stitch any kind of story together, but I decided to see it through.  Now i wish i had those 40 minutes back.  There was no narrative, no reason to care about any of the characters, and a flaccid showdown at the end.  Woohoo.  Imagine watching a Guy Ritchie film, but it's not funny or entertaining and none of the characters or storylines intersect.  What's the point?  I have to imagine whoever approved this at Columbia pictures was demoted.\n\nIt feels as if I spent nearly 3 hours inside Tarantino's head as he performed auto-fellatio while fantasizing about the hollywood of yore.  I really do appreciate period pieces and that this was meant to be some kind of nostalgic \"ode to old hollywood\" as it transitioned into the 70s, but good lord this was awful.  I truly hope Tarantino gets his mojo back or borrows someone else's for his next film.",
            "review_date": "2020-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely one of my favorite movies. The more you watch it, the better it gets.",
            "review_date": "2020-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favourites from Quentin Tarantino now",
            "review_date": "2020-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What can I say about this movie that hasnt already been said? One of my personal favourites from Tarantino and an absolute must see if you're a fan of old hollywood",
            "review_date": "2020-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A finely crafted ode to the hustle and bustle of life in Hollywood in the Los Angeles of the 1960s.",
            "review_date": "2020-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just loved every thing about this movie and i think qt should make his 10th continuing this one,there is a lot that we don't know. Pitt just killed it he portraits cliff as an icon well done 👏🏻",
            "review_date": "2020-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the most interesting script. Doesn't really tell a complete story.",
            "review_date": "2020-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's really good movie with great actors.Love Quentin Tarantino so much.",
            "review_date": "2020-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice picture, but movie is too long and not much happens 2h30m and then booom 10m action and the end",
            "review_date": "2020-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favourite movie ever. This is perfect to the ones that love cinema and Hollywood. The performances are amazing and the plot is terrific. Love it!!!",
            "review_date": "2020-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Real Rating: 77.5/100\nCritics love Tarantino because he loves cinema and they can associate with that, and they get all of his references, which can be lost on your average viewer. It is the same reason movies set in LA often get a few noms or wins during Oscar season that many would call questionable. This is not to detract from Tarantino's talent. The man is a great writer, though as of late he has become a blowhard. Scripts are long and drawn out, and then they all crash into an ending that seems tacked on rather than built to which begs the question does he even know where he is going with his films anymore. It is not visionary, it is repetitive and showing very little sign of growth. He is a craftsman who carves an excellent movie each time, but they are more or less the same.\n\nDE: Tarantino runs a decent ship, and Hollywood is no different. Everything seems to be on point. Every department is hitting its marks, and we are building a tale in his distinct (if that is the right word) style. In terms of editing, the loss of Sally Menke can be felt in every one of his films since she passed. She somehow was able to contain him and give a better structure. Though from seeing her works outside of the Tarantino verse, you can see he had an equal part in elevating her. Together they were able to take his longwinded approach and make it come off with a steady pace and allow decent investment from the audience, but now however that is slipping away at a fast pace with each subsequent film.\n\nW: Tarantino is one of the great writers, he is not on Miyazaki's or Anderson's level, but he is undoubtedly on the same level as the Coen brothers or Bong Joon-ho. Which is not a level to sniff at, but the problem with Tarantino's writing is that he may have switched genres, but he has not adapted to it. More that he has made another Tarantino movie with a new shell on it. Which is great, but if I wanted to see the same thing as before I might as well watch the classics. It is sort of like a band doing a new tour 20 years later trying to flog the new stuff that sounds far too similar to the old stuff, and the fans would much rather prefer to hear the hits.\n\nC: Have you seen a Tarantino, Scorsese or Oliver Stone movie? Then guess what you have seen Robert Richardson's work and along with it some iconic shots that have littered avatars and uni students bedrooms for decades. His outing this time is impressive, though it might not match a level that he created. That said the lens seems to tell more of a story here than Tarantino's writing, which tells you everything you need to know.\n\nA: Acting is stereotypically cartoonish, but that has become a standard for Tarantino. Though Pitt's depiction of the more sane character throughout this 2D world of actors stands out. Sadly given the cast, we are working with, and the sheer level of talent coupled with the extent in which we examine these characters lives it feels underwhelming, and each one is more an allegory than a persona in their own right.\n\nS: As strange as it seems the sound department is usually one of the reasons I watch a Tarantino film. Since Inglourious Basterds someone in the sound department is getting an Oscar nom, whether it is music, mixing or editing. Without fail Hollywood continues this trend. Just excellent.\n\nPD: This film is not pretending to be the 1960s, it is the 1960s. I know you have seen many a period piece, and they all do a decent job, but it is the subtle nuances and the dirt that make the difference. This is not a glossy veneer trying to rewrite a section of history, this is just trying to capture an era for better or worse. This may be down to the fact that Tarantino is obsessed with the period and only a slight glance at his oeuvre would back this notion up.\n\nBA: The costume design, while simple is also great, it catches the style of the era without feeling like it is overexaggerating the form or the zeitgeist of the time. The visual effects in the latter portion of the film while jarring are quite well done and stand out.\n\nEVO: It is not one of Tarantino's \"funner\" films, which is odd given that it is a bright nostalgia backed film told from the perspective of mostly positive souls. If you are a Tarantino completest, you are going to want to see it, but for many, the question of why did I sit through that for 3 hours will ring true on the lips, and while the film is crafted brilliantly I cannot help but finding myself siding with them.",
            "review_date": "2020-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprising out of nowhere finish!",
            "review_date": "2020-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once upon a Time in Hollywood is hard to describe. The movie at times I felt that it was loosing its main idea and I was trying to understand where the story line was going. At the beginning the movie it was slow and picked up speed near the end. I wish the writers and the director chose to have the hippies directly try to find the Cliff instead of having it being a coincidence that they were there. I honestly would have preferred if the movie was focused more around the crazy hippies.",
            "review_date": "2020-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exciting, fun, complex, different and truly beautiful to look at. Classic meta Tarantino. Loved the beginning, middle, and END.",
            "review_date": "2020-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A terrific movie, definitely in my top ten. The only thing that I ever would complain about this movie is that you can tell the Quentin Tarantino is really showing off his foot fetish in this one, then again when is he not?",
            "review_date": "2020-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There were 3 storylines - none that were essential to the others.. you could have easily cut at least 1h out of the movie + just have Margot Robbie appear in the last 15min of the movie as her role was utterly useless up until the very last moment.. Happy for Brad, he did a good job, but the movie itself.. soooo long, and soooo boring.",
            "review_date": "2020-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a what if and you can hate it all you want but I love this movie. Brad Pitt and Leonardo DiCaprio need to make more movies together.",
            "review_date": "2020-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It’s good idea to look up the history beforehand of this era. Movie is of excellent quality, but some beforehand information might be necessary. ",
            "review_date": "2020-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching Leo and Brad together is like watching peanut butter get made. Smooth, baby.",
            "review_date": "2020-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was boring until the end. Then, it got suddenly hectic and distateful. I enjoyed this last 15 minutes, but am not sure this is a healthy, intelligent and morally justified kind of fun. At least the real life murderers got punished...",
            "review_date": "2020-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "QT's best work since Pulp Fiction.  Absolutely worth all of the £10 I spent on it.  Rare for QT, but there's no N-words.",
            "review_date": "2020-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is more of a series of vignettes (Tarantino style) rather than a movie that is sewn together by character sketches of former cowboy actor, Rick Dalton (DeCaprio), and his sidekick former stunt man (Brad Pitt).  The tie binding the mishmash of shots together is the Charlie Manson inspired murders of Sharon Tate et al, that Tarantino gives an altogether different, ultra-violent fairy tale ending.   DeCaprio and Pitt are unsurprisingly fantastic.",
            "review_date": "2020-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Way too long. Often scattered and wasteful. Almost feels like someone with multiple personalities directed it. But most of the movie is incoherent and pointless. You could skip to the last 20 minutes and not miss much.",
            "review_date": "2020-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring, slow, and not what you would expect out of Quentin Tarantino. The acting was good, but it was a slow drawn out storyline. It feels like this movie received awards because it was about nostalgic Hollywood and all of Hollywood loves themselves.",
            "review_date": "2020-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked the nostalgia, the music, and the larger story about the changing times depicted.  QT's best movie IMO.  But it is not for everyone...The sheep mostly want marvel movies that just go \"Boom\" for 2 hours and plot twist more than a wet pretzel...  This is dialogue heavy, leans on nostalgia, and is kind of a bro film for LEO/Brad...The twist and the nostalgic look back make this one of my favorites...",
            "review_date": "2020-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Both DiCaprio and Pitt were superb, and so was Tarantino. He toyed with my head, making me think that it would all boil down to what really happened in 1969. His deflective tactic of bringing all these bits and stories together and creating something entirely new really was something I should have expected, but clearly didn't. He never fails to bring in a lot of pop culture references along with long dialogue sequences, which brings me to my next comment. I don't think you'll need 2h and 41m to capture all the essence, and Robbie's role as Sharon Tate could have had more lines and substance apart from looking pretty.",
            "review_date": "2020-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am putting 3 stars because I know it's a quality movie, and it's easy to hang out with Pitt & DeCaprio for 2+ hours.... but, I fear I am getting too simple to enjoy Tarantino movies.  2 hours and 40 minutes... slow pace, mild dialogue, a plot that only exists for character development... I honestly don't know what the movie was about... or what I'll remember in a week.  And a gory finish as has become his trademark.  Sadly, I may need quick jokes, explosions, or superheroes. ;-P",
            "review_date": "2020-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With it's fun characters and great performances,Quentin Tarantino's 9th film is fun and thrillingly satisfying with big plot twists and great character development; that concludes with a fairytale ending to one of Hollywood's tragic moments.",
            "review_date": "2020-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino has become iconic and actors salivate to play a role in his films, however he has not transcended beyond the guttural, gratuitous violence and shock factor that put him on the cinematic map. 'Once upon a time in hollywood' is a snooze fest wrapped as a love story to glory days. The payoff in the last 20 mins was anti-climatic. None of the characters were memorable, rather washouts and full of self doubt. The biggest proof that this was a weak installment is the fact that not a single meme has entered popular culture from this film, unlike Tarantino's other works. Similar to 'The Last Jedi', the critics are falling over themselves to praise his snooze fest, out of FOMO than anything else. If Tarantino intends to end at film 10, he better knock it out of the park, otherwise unlike Michael Jordan, he will leave too late.",
            "review_date": "2020-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent cast - Was a bit slow at some parts  - Great ending that tied everything together - Overall good film",
            "review_date": "2020-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you enjoy the subtle humor and slow burn story telling of filmmakers like the Coen Brothers and (of course) Quentin Tarantino, you might just love Once Upon a Time in Hollywood. The performances, especially from Pitt and DiCaprio are superb, the cinematography is basically flawless. Every shot could be a still picture with perfect composition. Every scene is basically a vignette short story that could stand on its own, and if there is any flaw in the movie, that's probably it. It's less about plot, and more about interesting and likable characters put in situations that range from mundane to utterly ridiculous. It's possible that the average movie goer will overlook  some of the little bits of ubiquitous humor and nostalgia, and if so, the movie could feel slow, and perhaps even boring. But if you enjoy all the little things that make a Tarantino film a Tarantino film, this is for me, his most lighthearted (with the exception of a couple scenes) and his most \"watchable\" movie to date. I will be re-watching this in the same way I have re-watched movies like Fight Club, or the Big Lebowski. The characters are magnetic and there are lots of little things to notice and enjoy if you're looking for them.",
            "review_date": "2020-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I prepared myself to watch the gruesome murders that ruined the '60's, and was once again, (again!) fooled and vindicated by the Master Movie Maker of my generation. For some of us, it feel so, so good to see L.A. the way it was then. \nI can't tell you what seeing a white, short jean jacket and matching white jeans on a man again does to me, it would be unseemly to say. I really don't see movies when they first come out, I never did. I was going to save this one for a while yet, but...the preview had Brad Pitt doing his western tang drawl and...it rained here, so...damn I'm glad I bought this movie today. It was so worth it, and it was like a good read. You put it on the shelf and pull it out when you really need it. Also, okay, never mind, nobody spoiled this one for me, no one gave me a clue, so I'm not going to do it to you by explaining what, exactly, it has in common with \"Inglorious Basterds,\" and don't mean Brad Pitt doing the drawl which reminds me of my Missouri relations. How can I say it and keep from ruining the story for those that haven't read it yet?  Look. Mr. Tarantino will occasionally present a revisionistic take on a historical subject that gives those who suffered vicariously, a relief valve that I, for one, never knew I needed until I got it.",
            "review_date": "2020-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am going to say that this is my favourite Quentin film.  There is not one thing that is not to like in this piece of beautiful cinema.\n\nThe actors, the characters, the music and the rewriting of history is all amazing.",
            "review_date": "2020-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "has nothing special. no plot no twist, no story. i don't know why it was nominated",
            "review_date": "2020-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Typical, boring, over-hyped drivel from one of Hollyweirds most over-rated directors.\nUninteresting characters. Lame story. Two hours of boring fluff before the 2 minutes of disgusting, violent, bloody nonsense (woman suffering after her face smashed in by a high-velocity can of dog food then thrashed by a massive pit bull, then burned to death by a blowtorch). Lovely. NOT.",
            "review_date": "2020-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For me the best film of all time, everything was perfect, from the period detail to the script, pop culture references to the casting of Nicholas Hammond, Tarantino making the movie the way he wanted it without pampering any group was a bonus, absolutely love it.",
            "review_date": "2020-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "7/10 hollywood showing hollywood again... but with tarantino..ok bit nice",
            "review_date": "2020-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great example of how Tarantino has matured as a filmmaker, an affectionate tribute to old school cinema with plenty of pop culture references, witty dialogue, endearing characters, and thrilling action and violence as we can expect.",
            "review_date": "2020-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I lived as a child in L.A. near the time of the murders.   I wasn't allowed to know about the events and, even as a teen later, didn't take interest.    Now I know and I'm so thankful my path never crossed the freakish cultists portrayed in the movie.  Like any other good period piece, this movie completely suspended my disbelief and made me feel like I was a kid again in old L.A.    Well done Mr. Tarantino.",
            "review_date": "2020-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching this movie was painful. If you were born anytime 1975, you likely will have no idea what is happening in the movie until the very end. In the meantime, you watch plodding sequence of seemingly unrelated scenes about average Hollywood personnel living their average Hollywood lives. Don't get me wrong, the performances of Brad Pitt, Leo, and company are tremendous, as is the style and settings. I believe they captured the time period in amazing fashion and detail, even down to a soundtrack which doesn't include the stereotypical songs. For these reasons, you can get to 2 stars, but as a movie, it was terrible except for the last 10 minutes and a few scenes here or there. If you have to go outside the movie to get the plot, then you have failed as a storyteller, and assuming that the entire viewing audience is intimately familiar with the happenings of the Manson Murders is a glaring mistake from the get go.",
            "review_date": "2020-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tarantino's yet another success with DiCaprio and Pitt as the leading roles in this timeless Hollywood story set in the denouement of Hollywood's Golden era. Regardless of the limited screen time for Margot Robbie, this is still another brilliantly crafted story along with star acting.",
            "review_date": "2020-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great acting and a great final scene. I also thought the production design and set decoration were fantastic. It was a bit long and slow in parts, though.",
            "review_date": "2020-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unless you are familiar with Hollywood Cinema in the 1960's you will have no idea about the any of the references that make this movie liked by the film critics. The storyline went completely over my head. On a positive note, the acting was verY good indeed from both Leonardo DiCaprio and Brad Pitt. Sorry, just not for me.",
            "review_date": "2020-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I kept waiting for it to get going or get interesting - alas, it didn't. The ending was a nice twist, but the \"pay off\" wasn't worth the dull majority of the film. The actors, sets and costumes were all excellent but it's not a film I ever plan on watching again,",
            "review_date": "2020-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pointless. Just chucking a load of top actors into a film doesn't make it good and this film isn't worth your time, especially at 2 hours and 40 minutes. \nHonestly, there are so many parts of the film where you look back on and just have no idea why it was put in there. \nNOT A SPOILER\nI mean there was a part where we are watching Di Caprio playing a part in a film. No need for it. Jackie Chan.... what was the point in all of that scene. \nI'll tell you.... no point. \n\nQT lost it after Django",
            "review_date": "2020-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You gotta know the real-life history to appreciate the brilliant twist at the end.",
            "review_date": "2020-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't see the need to mock Bruce Lee. He was a good man in addition to being a remarkable artist. It would have been a blessing to save Sharon Tate, her baby and friends but it was not to be. The ridiculous murder scene of the Mason murderers was not a tribute but superficial comic relief. Pitts' scenes at the Mason 'ranch' were better and had me sigh, if only, these sick SOBs had been arrested before the murders...but they weren't. In memory...much love to Sharon, no doubt an angel up above. God Bless.",
            "review_date": "2020-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another film that wins awards just by ticking boxes and blowing smoke up hollywoods own backside. Dull, boring, not particularly interesting settings, plot free, drivel. Sort of like attending a bad dinner party conference inhouse joke by a series of bad impressionists, you know the ones where if youre an outsider looking in you just want to go to the kitchen and raid the beer with the wsiters and other folk who actuslly have charisma. Bin worthy tripe. ",
            "review_date": "2020-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tedious, dull and sometimes boring film",
            "review_date": "2020-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't expect to like this flick, since I'm not usually a fan of Tarentino, but this flick had a playful quality about it that I really liked, especially the ending.",
            "review_date": "2020-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though it was stretched out at times, the film told a great story about a fictional Hollywood in the 60s. Leonardo Dicaprio, Brad Pitt, and Margot Robbie were great in their roles and I thought the ending of it was great and fun.",
            "review_date": "2020-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wish Fulfilment\n\nTarantino's scrupulously reconstructs 1969 Hollywood to create an alternative end to the 1960's, but to what end? Once again, he has made an enjoyable, overlong and seemingly pointless re-imagining (think Inglorious Bastards, Hateful 8, etc) that pervades his private fantasies, instead of an original narrative.\n\nOf course, 1969 featured Woodstock and Altamont, but the Manson killings was the quintessential, bleak end of that exciting decade. And here, Tarantino imagines a clear clash between early 1960's macho culture confronting a debased late 1960's hippie disaster, with the macho culture coming out on top. With both Pitt and DiCaprio on top form as a tough stunt man (think Clint Eastwood) and fading, insecure Western star (no obvious parallel I know of), most of the film seems to be wallowing in their relationship. But the real story is the scheduled murder of next store neighbour Sharon Tate by the Manson crazies in August. We are waiting for it - how will Tarantino deal with it? It will be gruesome that's for sure. But what do these macho neighbours have to do with it?\n\nWell, that's the real tale. What if the Manson family made a slightly different turn and missed Terry Melcher's old house and invaded Leo and Brad's pad? Quite a different outcome from the real story. The blood bath was on the other foot, with the macho boys dispensing ruthless frontier justice on the home invaders.\n\nDespite the length, I found it captivating, weird, beautiful and disgusting all at the same time. The message was clear - if drug crazed hippies are out to kill you, a couple of tough guys with a pit bull and a flame thrower will save you from a fate worse than Covid-19.\n\nNot a perfect film, but a wildly enjoyable romp.",
            "review_date": "2020-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didnt make it passed half way.  Self indulgent, self gratification.",
            "review_date": "2020-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie!! Another Homerun for Tarantino!!",
            "review_date": "2020-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent Movie I have watched it 3 times already",
            "review_date": "2020-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a load of rubbish, spent three hours waiting for something to happen and I'm still waiting!",
            "review_date": "2020-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So, so, so, so, long. And boring. And pointless. And no fun. Or entertaining. Pulp Fiction to this. Oh dear.",
            "review_date": "2020-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quentin Tarantino always great and once upon a time in hollywood so great ,I enjoyed the film as Tarantino says a\"Hangout film\" , His latest picture from that kind of films ,People hanging out there is no specific story,Leonardo dicaprio and Brad Pitt are amazing, Margot robbie has a small role but she's wonderful playing a significant character in that time of America, Everything is beautiful in this film except one thing! The  scene of (Brad Pitt and a girl ) near the end of the film ,This is what i dislike in this film .\n\nThe ending is unique and that what Tarantino always grear at (Changing an outcome of a historic event) .",
            "review_date": "2020-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The contrasting storyline told by three main protagonists blends together to make a feel-good ending.",
            "review_date": "2020-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a solid movie. Good acting from Brad Pitt and Leonardo help this somewhat confusing film strive. It was at least 45 minutes to long but the ending payed up for 145 of somewhat nonsense",
            "review_date": "2020-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really liked how the atmosphere of the 60s is shown. great music, good acting. it is a pity that in reality everything ended much more tragically",
            "review_date": "2020-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An hour too long, and despite the all star cast, the dog was the best actor",
            "review_date": "2020-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As always quentin Tarantino make another masterpiece...and another film to add into the legacy of this great director...leo and Brad a WOW acting especially Leonardo dicaprio  i mean imagine you need to act that you are acting...so thanks Mr Tarantino for this masterpiece",
            "review_date": "2020-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a pathetic movie.  I haven't seen something that poorly directed in ages.  The plot moved at a glacial pace just going nowhere with nothing really interesting happening.  An hour in we were asking what the point was.  An hour forty minutes in I realized it is a 2:30 movie.  Maybe if this fiasco had been cut by an hour it might have been tolerable.  Then the end has some gratuitous violence completely out of character from the rest of the movie.  Anyone who liked this movie must have been high or drunk.  Watching this sober was like watching paint dry.",
            "review_date": "2020-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very unnatural and forced, violevce was completely offbeat, and the whole plot was just bad",
            "review_date": "2020-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My Netflix review, repurposed: I like Tarantino. I like this film. It's not boring or over long as some reviewers think. It's not inaccessible to people who didn't live through the '60's as written in some media reviews, because if that were true, all of the films I've watched & enjoyed that were set in the Stone Age (Quest For Fire), the Roman Empire (I Claudius), the Middle Ages (Marketa Lazarova) the 16th, 17th, 18th (Jane Austin's \"Emma\" or \"Pride and Prejudice\") 19th (\"Wuthering Heights\") centuries & the complete 20th century (everything), wouldn't have been relatable to or understood by me. I wasn't bored by THOSE films because I'm a reader. I had a good public education. I strived for the best grades I could get in K through 12, I didn't drop out or ignore my teachers during class and I did my homework. I went to college by working from age 14, saved every penny, got huge loans that took me 30 years to pay off, & I received a good education that required me to read, read, read, & learn from my instructors & professors how to interpret those books, whether text books or novels or non-fiction writings. It expanded my brain so that I am able to do the same thing with movies, so I'm not bored by them. I can enjoy movies that are really well crafted like this one. This film is the work of an evolving director, who didn't \"make up a stupid boring long thing with too much talking about something that didn't even happen that way\" (I'm not quoting anyone. I'm combining all of the negatives I've read/heard everywhere into one paraphrase). He gave us a \"what if\", & nice \"if only\". It's not boring. Tons of funny things happen in short bursts throughout the film & are cleverly brought back together in that final blast that is the ultimate Tarantinoed \"what if\" that pays homage to Sharon Tate & the others who were tortured & killed by the Manson Family. It might disappoint a Tarantino fan who has not yet matured at the same rate. It might be better later, with more accrued observation/thinking skills.",
            "review_date": "2020-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this movie with a friend who showed up a little late and missed the first 10 minutes or so. At the end of the movie, he said something along the lines of \"I'm not sure I completely understood what was happening because I missed the first 10 minutes.\" I replied, \"I'm pretty sure you could have not watched the entire movie and still not missed anything.\" That's the best explanation I can give. This film is fairly pointless and spends a lot of time saying a lot of things that no one really cares about. The only saving grace here is the phenomenal acting by all of the main cast.",
            "review_date": "2020-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've been a big fan of Tarantino's since Reservoir Dogs and have emencly enjoyed his films for years. The always unique director and writer always seems to surprise with his completely unpredictable films. Now that that's been said, I finally got through Once Upon a time in Hollywood. I tried watching this film five times and always turned it off. I finally got through it, even fast forwarding thru sections of the film, to finally finish it was pretty unbearable. Tarantino's worst film to date! My first thoughts after finishing the film were ''what a piece of shit''. I habe never said this about any of his films and it is a shame. This unimaginative version of real life events skewed to Tarantino's will, was boring, overly long (by about an hour) and just muddled story of a falling Hollywood star and his decent from stardom leave much to be desired. This may have been a decent film on it's own prwemise but the added mix of the Tate/Manson murders just doesn't work. Expected better from a giant. The only decent parts of the movie are Brad Pitt and sadly, the best part of the film was the dog.",
            "review_date": "2020-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Between 2.5 and 3 stars. Most of the time, the movie is boring, just to be on TV without taking much attention, and as a representation of an era. However, the end will secretly satisfy to almost everyone.",
            "review_date": "2020-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was bummed I missed it in theatres; paid a dollar on VOD; LOVE Brad Pitt AND Leo D; and Quentin?!  Of course another incredible movie, right?  Not at all.  If it's experimental for Tarantino then it has a bit more respect from this guy, otherwise not only is it really very slow, boring, & a bit confusing why it's being watched at first (and for a long while), it doesn't make up for it later.  I want to respect these truly amazing actors/director/artists by telling my honest critical opinions.  I know the Charles Manson family story; ***SPOILER ALERT*** Like Inglourious Basterds, I LOVE how the ending was changed for the better... however the Sadie character - I think it was - would Never flail like that and for so long WHILE holding a gun after merely being struck in the face by a can of dogfood (though I effing loved that part hahah - my man Brad Pitt!).  You're ALL better than that and I'll be paying to watch your next works.  But this movie - it's super & unnecessarily long too! - was bad. \nKyle",
            "review_date": "2020-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you set aside all of the added artistic and subliminal crap, we watch movies to be entertained. This movie is not entertaining.",
            "review_date": "2020-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I agree it's meandering and underwhelming. But it is a coolly acted, beautifully produced movie which reminds us of a shift in Hollywood in the 70s and how it mirrors Hollywood today, which is changing ever more rapidly. If Tarantino had utilized the premise's potential more, it would make a strong contender.",
            "review_date": "2020-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the late 60s, the actor Rick Dalton tries to adapt to the new times. His double and best friend, Cliff Booth, has problems to find a job because people think he killed his wife. Also, Cliff has to move Rick around by car because Dalton's driver's license has been suspended due to drive drunk. At the same time, a relationship is born between Rick and actress Sharon Tate, who was a victim of the Manson family in the 1969 massacre.\n\nJaime - 3º AR",
            "review_date": "2020-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is excellent in every way.",
            "review_date": "2020-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honest to God ... I simply cannot understand why everyone likes this movie so much.\nI like Tarantino, the acting is great , cinematography is awesome, lighting ...atmosphere ...everything is there, except for a compelling story.\n\nThis is basically the movie summarized.\nYou have this fading actor who tries to stay relevant , but is quickly fading.\nHis more down to earth stunt double who has a shitty life and killed his wife follows him everywhere like a loyal dog.\nIn the end the entire movie revolves around one thing... the fading actor meeting his new generation actor friends who live next door and hooking up with them in order to survive and he lets his stunt double friend ride to the hospital alone even though he saved his life ... showing that in order to make it in Hollywood you have to leave friends behind ... all other things in this movie are random filler and never really matter ... even the manson thing is just a vehicle to deliver that message.\n\nTo me it is just a mediocre, fringing on bad B movie ... not worthy to even stand in the shadow of all other \"Once upon a time ...\" type movies",
            "review_date": "2020-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story was bizarre and nonsensical, rewriting a fictionalized account of what might have happened if the people who actually killed Sharon Tate in real life had accidentally ran into the two main characters of the movie and tried to kill them instead. Brutal story. I didn't see any redeeming value in hearing the story and it didn't make the world a better place and wasn't very entertaining either... sad turbulent main character who had a good life by all appearances but was discontent anyway, drank too much, etc. I didn't get it. Also fairly slow to move along, a little like watching paint dry just to see how much of a color change occurs, not a big payoff. Don't waste your time.",
            "review_date": "2020-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If anyone but Tarantino had directed this movie, people would've said it's just a big pile of meandering garbage.",
            "review_date": "2020-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not the best of Tarantino, excelent Dicpario and Brad but its carachter in not well defined at my eye.",
            "review_date": "2020-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Damn, the set is possibly the most amazing I've ever seen. Totally immersive in the 1960's. Completely different story line, so original. Amazing cast. Probably my favorite Brad Pitt performance ever.",
            "review_date": "2020-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie reeked like smell of roadkill. Fast forward until about 20 min left and that is really all that you need to know",
            "review_date": "2020-04-18",
            "source": "rt",
            "lang": "en"
        }
    ]
}