{
    "rating": 4.9,
    "release_date": "2019-01-04",
    "num_reviews": 112,
    "genres": [
        "Mystery&thriller"
    ],
    "summary": "Three lighthouse keepers arrive on an isolated island off the Scottish coast and find an object that becomes the catalyst to a struggle for survival as they are overcome by greed and paranoia.",
    "reviews": [
        {
            "content": "Another half baked drama that started good and fell apart towards the end.  I kept wondering what I could have done to fix the plot and how things progressed could have been been more positive or interesting.  It was sad.  Saw it on Netflix.",
            "review_date": "2023-04-04",
            "source": "rt"
        },
        {
            "content": "The Lighthouse for people who couldn't stand watching The Lighthouse. Atmospheric, slow, and with a focus on character, but very little to unpack a very straightforward script.",
            "review_date": "2023-04-01",
            "source": "rt"
        },
        {
            "content": "This is a good movie. The only problem I have with it is the \"inspired by true events\" part. In reality, the only true events are the tiniest part of the movie: that 3 lighthouse keepers disappeared. That's it. The rest is just wild hyperbole, conjecture and pure fiction. That said, it's good and enjoyable fiction. I just think it's kind of misleading to imply that this is what really happened since nobody could corroborate any of the events in the movie, except for the disappearance of 3 lighthouse keepers- period. Bearing that in mind, I liked this well-acted and dark movie. I especially thought Gerard Butler's performance was good.",
            "review_date": "2023-03-10",
            "source": "rt"
        },
        {
            "content": "The only part of this \"based on a true story\" plot was that 3 men disappeared from the lighthouse island.  I found it to be cliche with not enough backstory to understand the 3 main characters.",
            "review_date": "2023-03-03",
            "source": "rt"
        },
        {
            "content": "Oh so much better than the Willem Dafoe / Robert Pattison attempt (& I usually love Dafoe - mind you the COVID shutdown undermined that premise handily).  Shout out to my favourite Icelander Olaf Olaffson who flexes his spooky muscles - subtitles list him as speaking Norwegian but I bet it's Islenska.  Spoiler, tho: like The Perfect Storm, all but the first few minutes are sheer invention.  Compelling & character-driven nonetheless.  Star Trek references: zero.",
            "review_date": "2023-02-07",
            "source": "rt"
        },
        {
            "content": "This was an excellent film with wonderfully powerful acting. Some said it was slow but some people need explosions every two seconds to keep their razor thin attention spans active. The epitome of a slow burn but worth the wait. ",
            "review_date": "2023-01-03",
            "source": "rt"
        },
        {
            "content": "I'm not sure why there's such a large discrepancy between the critics and audience but this is a fantastic drama. Many twists and turns, fantastic acting. This movie takes you for a ride.",
            "review_date": "2022-12-10",
            "source": "rt"
        },
        {
            "content": "Great acting and scenic, but not very uplifting!",
            "review_date": "2022-11-29",
            "source": "rt"
        },
        {
            "content": "The Vanishing tells a gripping and realistic account of what might have happened.  Reminds me of Alien in some ways in terms of horror and suspense.",
            "review_date": "2022-11-29",
            "source": "rt"
        },
        {
            "content": "Fantastic acting, suspense, scenery, plot. ...I just wish I had seen at the theater.",
            "review_date": "2022-11-26",
            "source": "rt"
        },
        {
            "content": "Had no idea where this movie was headed. Lots of atmosphere, suspense, and fine acting from the three leads. Not much of a woman's movie, but the story kept me going and not predictable in any way.  Gerard Butler was almost unrecognizable and by the end of the film he gives an absolutely heartbreaking performance. A physical and internal transformation. I wish he would do more independent films and period pieces like this. I want to like the other stuff he does,  but not much he can work with from an acting standpoint. Stay with this one as it pays off, but most disturbing and violent. The older lighthouse keeper also gives quite a performance, but I'm not as familiar with his work.  It would be lovely if Mr. Butler could get back to his acting roots as this performance is extraordinary and we can clearly see that he has it in him with the right material, actors, and direction.",
            "review_date": "2022-10-29",
            "source": "rt"
        },
        {
            "content": "What a waste of real potential.  I found it semi-boring (slow-moving) , with periodic suspenseful and entertaining parts, only to be confused by the end and very let down.  It could have been great.  If these 3 'vanished', then we don't know what happened, and can't really write a movie about...what happened?!  Boo.",
            "review_date": "2022-10-27",
            "source": "rt"
        },
        {
            "content": "Truth be said, either it was too late, or I was too tired, but Cleide & I slept through parts of the movie, she more than I. It looked a good movie & had strong actors, but was certainly a bit slow & without a woman protagonist possibly lost a touch of \"spice\".  It can't have been too bad, since critics liked it. I wonder, though, why audiences didn't like it as much as the critics... There's no reason given on Wikipedia for why it changed its name.",
            "review_date": "2022-09-17",
            "source": "rt"
        },
        {
            "content": "Says it was based on a true story but there is no way to corroborate most, if any, of it.  Dragged on a bit too long.  A movie like this should make one want to be a lighthouse keeper or to fear being one, or maybe a little of both, this did neither.",
            "review_date": "2022-08-23",
            "source": "rt"
        },
        {
            "content": "Wonderful acting, great script and breath-taking settings. I'm not sure how the audience score is at 49%. The critics got this one right. Amazing movie!",
            "review_date": "2022-07-24",
            "source": "rt"
        },
        {
            "content": "Hmmm... it's just long winding drama about greed",
            "review_date": "2022-04-06",
            "source": "rt"
        },
        {
            "content": "There was one great movie came out in 2019 about lighthouse keepers and madness. It wasn't this overlong drivel. It was called The Lighthouse. There was one great movie called The Vanishing, it wasn't this drivel. It's Dutch and came out in 1988. Peter Mullen has become the same slightly insane character in every one of his performances.",
            "review_date": "2022-01-18",
            "source": "rt"
        },
        {
            "content": "The finale that occurs between these three Irish guys is a bit anticlimactic to say the least but the journey to that said finale is irresistible and remarkably tense.",
            "review_date": "2022-01-02",
            "source": "rt"
        },
        {
            "content": "If you want a nice slow burning, tense thriller with a good script and interesting characters then  this will be right up your street… if you want something more dramatic, vacuous and fast paced… watch a Vin Diesel movie.",
            "review_date": "2021-11-01",
            "source": "rt"
        },
        {
            "content": "Good drama and acting",
            "review_date": "2021-09-18",
            "source": "rt"
        },
        {
            "content": "The film has good intentions for certain themes and concepts. But the ultimate outcome is very dry and borderline directionless. The main three actors gave excellent performances especially Gerald Butler. It had some decent cinematography. In the end, The Vanishing or KEEPERS was just ok.",
            "review_date": "2021-07-23",
            "source": "rt"
        },
        {
            "content": "I found it touching, well-written and with great dialogues between characters. The three main actors were amazing in their roles and the footage of the island few landscapes was effective. The twisted gruesome plot was successfully constructed. I would have invested a little more on the soundtrack and the movie would have been even better, but it is a small not essential detail.",
            "review_date": "2021-06-30",
            "source": "rt"
        },
        {
            "content": "Watched it on a whim with a friend and was not disappointed. An amazing and shocking film, that explores psychological trauma within a situation.\nHonestly, fell in love with the film as a whole, with the characters and the plot. May seem cliché but still manages to hit the right notes.",
            "review_date": "2021-06-27",
            "source": "rt"
        },
        {
            "content": "The movie is based on an unsolved mystery and wow do they ever do an excellent job of creating a plausible cohesive story that makes for an excellent movie.  The script is excellent, the acting is amazing and the details woven into the plot are believable-loved it!",
            "review_date": "2021-05-17",
            "source": "rt"
        },
        {
            "content": "Set in the early 1900's, lighthouse keepers off the coast of Scotland discover a smashed lifeboat, a dead guy, and a sea chest.  Some suspense building elements were a little contrived.  The acting (and dialogue provided to the actors) could have been better.  The acting and screenplay were just barely good enough to make this thing work.  Not a bad movie overall.",
            "review_date": "2021-04-10",
            "source": "rt"
        },
        {
            "content": "Solid film and suspenseful story. Acting was. Top notch.",
            "review_date": "2021-03-01",
            "source": "rt"
        },
        {
            "content": "The Lighthouse for people who couldn't stand watching The Lighthouse.\nAtmospheric, slow, and with a focus on character, but very little to unpack a very straightforward script.",
            "review_date": "2021-02-02",
            "source": "rt"
        },
        {
            "content": "Three lighthouse keepers make a startling discovery near the water which changes the course of their lives forever.   Gerard Butler and Peter Mullan are the main two stars and Mullan in particular puts on a fantastic performance.  \nI really liked this film, very atmospheric and intense. \nSeems like lighthouse movies are slowly becoming their own sub-genre at this point.",
            "review_date": "2021-02-01",
            "source": "rt"
        },
        {
            "content": "Jolting and Shockingly Violent! I was on the edge of my seat wishing for a piece of the pie! Ruthless and straight to the point, this film takes having blood on your hands to the next level. The journey started out slow, but I had faith that it would pick up. Needless to say, all of my worst fears appeared instead of vanishing.",
            "review_date": "2021-01-14",
            "source": "rt"
        },
        {
            "content": "Acting was amazing but the storylines went nowhere, So much content there that could have gone somewhere and been truly interesting...ending was dreadful. Sigh. Very disappointing.",
            "review_date": "2020-11-20",
            "source": "rt"
        },
        {
            "content": " I love me some Gérard Butler, but sometimes I watch a movie and feel like it just needs a little something extra to bring the story together. That's how you feel after watching this one. ",
            "review_date": "2020-09-12",
            "source": "rt"
        },
        {
            "content": "Kristoffer Nyholm brings that very particular Scandinavian vibe to ‘The Vanishing' which means you can expect a certain bleakness to pervade the film, and it does just that. The story certainly has a lot of potential and I like the idea of focusing on how the characters deal, both mentally and physically, with the decisions they make, but whilst it's clear what direction the film-makers wanted to take it, there's no getting around the fact that the script just isn't well-written enough to convey what they wanted. The characters and their struggles aren't sufficiently fleshed out, and the pacing is also off which means there are times when it feels slow and like little of importance is happening.\n\nThat's not to say that it doesn't have its moments because it does, and Gerard Butler and Peter Mullan seem to be doing their best to keep things interesting, but overall, there's a feeling that its reach exceeds its grasp.",
            "review_date": "2020-08-17",
            "source": "rt"
        },
        {
            "content": "Gritty & shows the hardship of lighthousemen.",
            "review_date": "2020-07-24",
            "source": "rt"
        },
        {
            "content": "Brilliant suspenseful drama with some great acting to boot!",
            "review_date": "2020-07-16",
            "source": "rt"
        },
        {
            "content": "Truly horrible! I like a tragedy, but this was nihilistic (ranks up there with Godfather III on the nihilism scale). The backgrounds of Thomas and Donald really had no relevance to the plot. \n Really bad ending - movie purports to be a story about what really happened to the 3 men, but it doesn't even resolve that.\n\nDelta between critic reviews and audience reviews reveals again that you should trust the audience, not the critics!",
            "review_date": "2020-06-07",
            "source": "rt"
        },
        {
            "content": "I went into this movie completely blind and I actually ended up thinking it was pretty damn good. This is something I would say is kinda like The Lighthouse (2019), but for people that don't want all the artsy and strangeness from that film. Is that a good thing or bad thing? It really depends on what kind of movies you like, but I enjoyed this one. The Vanishing follows three lighthouse keepers in 1900 the two veterans Thomas (Peter Mullan) and James (Gerard Butler) are joined by the young Donald (Connor Swindells). The three men get along, but one night after a crazy storm they find a crashed life boat with someone laying nearby with a chest. Thomas and James lower Donald down to get to it and the man comes back alive attacking Donald. Donald in self defense kills the man and brings the chest back up. The three men soon find that the chest includes bars of gold. They come up with a plan to bring it back, but of course then mysterious man that was guarding it originally has friends and they soon come to the island looking for their friend. The movie has a pretty good pacing. It's a bit slow, but it works. They're lighthouse workers. How exciting is that really right? The movie does a great job of building tension and eventually by the end of the film the gold changes one of the men for the worse and I think that that's a highlight of the film. It's not as smart as The Lighthouse, but it's not trying to be. This one was a good slow burn with a great payoff and one that I think some people may enjoy. Go into it blind and enjoy it (especially if you have Prime Video it's currently streaming on there).",
            "review_date": "2020-05-20",
            "source": "rt"
        },
        {
            "content": "If tomatometer is higher than 80 with below 50 audience score means it is not a best movie to watch. Frankly It is dead slow. I saw some reviews and they said that this is slow burn. But they forgot to mention that this is dead slow and boring. Ending really sucks. Do not waste ur time.",
            "review_date": "2020-04-16",
            "source": "rt"
        },
        {
            "content": "Butler is flat, there's little tension, the story has some interesting moments",
            "review_date": "2020-03-20",
            "source": "rt"
        },
        {
            "content": "Film piacevole dove l'azione si racchiude in una piccola parte; il resto è uno sviluppo della psiche dei personaggi.\nIl finale già noto all'inizio del film rende forse un pochino meno imprevedibile la trama",
            "review_date": "2020-03-19",
            "source": "rt"
        },
        {
            "content": "I love a sea-faring jumper and a rugged face. And this film is full of them. High seas, a rather handsome lighthouse and some genuinely scary moments. Peter Mullan is always good and he doesn't disappoint. I didn't recognise Gerard Butler which means he was great too. And the actor playing the young keeper also deserves praise. \nIt all looks ravishing and was gripping. I'm not sure how deep it was - definitely not as deep as the raging body-consuming sea. But a good yarn with quite brutal violence.",
            "review_date": "2020-01-14",
            "source": "rt"
        },
        {
            "content": "Not quite a Nordic Noir but pretty bleak anyway.",
            "review_date": "2020-01-09",
            "source": "rt"
        },
        {
            "content": "Movies drags at times, but had enough to keep you wondering until the end.",
            "review_date": "2019-10-23",
            "source": "rt"
        },
        {
            "content": "This movie is so dramatic, it cured my homosexuality \n\nBut I loved it",
            "review_date": "2019-10-22",
            "source": "rt"
        },
        {
            "content": "The director of \"Taboo\", a very intriguing premise, good mix of genres, pretty high metascore & Gerrard Butler - of course I had to watch this! Was I disappointed? Certainly. Mild spoilers ahead.\n\nIt's an interesting story, one of those spooky historic little mysteries, that's behind the plot of this movie - it helds a hell of a lot more potential that this movie brought to the screen. The script is one the biggest flaws here, the pacing's next. There's a lot of long scenes centered around pieces of boring dialogues with little substance, but at the same time it feels like the filmmakers are extremely proud of their character writing, which they definitely shouldn't be. The story is interesting for about half of the movie, until the point when draggy pacing & unimpactful plot points just start to frustrate You. So those are the flaws, the biggest, anyways. Acting seems to be mostly on level, but, even though I feel like I can never rightly critisize actors performances, I have to say that Gerrard Butlers portrayal of a lighthouse keeper gone mad was pretty damn stale. Cinematography feels kinda shy, the beautiful setting is not used that much, for budgetary reasons, I imagine. \"The vanishing\" could've used a bit more violence as well, but there is a single pretty good little action scene. While the filmmakers seemingly tried really hard to create the grim, bleak atmosphere that's supposed to be there, they succeeded maybe halfway. It just doesn't get there really.\n\nOverall I would call this an underwhelming experience that leaves the viewer slightly angry because he knows it could've been better. My rating: 5/10.",
            "review_date": "2019-10-12",
            "source": "rt"
        },
        {
            "content": "Slow paced but intelligent, with good acting, powerfull images, with a dostoievskian feel.",
            "review_date": "2019-10-06",
            "source": "rt"
        },
        {
            "content": "A pale but suspenseful adventure. ",
            "review_date": "2019-09-20",
            "source": "rt"
        },
        {
            "content": "Great film - great acting and cinematography\nJust one thing I don't understand....\nWhy did james kill Donald? aka why did the guy who went mad murder the new guy? there doesnt seem to be any reasoning to it???? explanations?",
            "review_date": "2019-09-14",
            "source": "rt"
        },
        {
            "content": "An achingly tragic hypothesis to the Flannan Isles Lighthouse mystery.",
            "review_date": "2019-09-11",
            "source": "rt"
        },
        {
            "content": "Wow, that was genuinely depressing",
            "review_date": "2019-09-11",
            "source": "rt"
        },
        {
            "content": "First of all; \"what mystery?\" I don't want to give away the ending of the movie, but it did not indicate where Thomas was going.\nI am a bit familiar with the incident in which this movie claims to be inspired by, and the only inspiration seems to be it's about a lighthouse on a remote island. None of the factors that make the actual incident such a mystery were addressed in the movie. \nOK, the acting was great and the filming was well done. The characters weren't consistent though. I do not believe the three main characters, as they were set up to be, would have behaved the way they did by the end of the movie. Very messy way to speculate what \"may\" have occurred to explain the real life mystery.",
            "review_date": "2019-09-01",
            "source": "rt"
        },
        {
            "content": "It's a bit tame for a psychological thriller but the fact that it's based on true events makes the events and story impactful.  The plot is very simple and concise.  The acting is really good.  But I had issues with the pacing as it seemed to drag on at times, feeling more like a drama than a thriller.  Overall I would still rec this movie for fans of tame of dramas/thrillers.",
            "review_date": "2019-07-23",
            "source": "rt"
        },
        {
            "content": "This story has been inspired by a true story surrounding the disappearance of 3 lighthouse keepers on a remote Scottish Island. The 3 leads find Peter Mullan (back in grizzly, cranky form as a seasoned veteran of this life), Gerard Butler (in subdued, troubled mode) and Connor Swindells in a kind of apprentice role, hoping to learn from the 2 seasoned professionals.  While going about their daily chores, a life raft is discovered on the shore along with a body and a crate full of gold.  Much debating occurs as to what to do with the find before 2 sinister types turn up played by Søren Malling who manages to convey such a strong sense of menace without even saying anything that even my TV felt uncomfortable and tried to turn itself off at one point, and the silent but deadly Ólafur Darri Ólafsson.   \nI really liked this, especially when Søren was on screen, the guy just exudes menace so brilliantly.  It was a tense film that changes direction several times so you're never sure who is going to come out on top, if anyone....  ",
            "review_date": "2019-07-19",
            "source": "rt"
        },
        {
            "content": "Great cast, beautiful cinematography, but a WTF nothing burger of a story.  Don't waste your time",
            "review_date": "2019-07-14",
            "source": "rt"
        },
        {
            "content": "I think there is a finite amount of intrigue and drama that can be extracted from the subject matter in this story. The 1st and 2nd acts of this movie are very good however the 3rd act is quite boring and erases all that. This movie does a stellar job of extracting all that it can from the subject matter however it is spent after the first 2 acts. One of the men descends into madness in the 3rd act and it is not an interesting part of the story to watch. ",
            "review_date": "2019-07-10",
            "source": "rt"
        },
        {
            "content": "At first, the setting and genuinely eeriness sets a classic, Hitchcockey mystery mood full of juicy opportunities, but the script ends up trying to turn the characters into what the vaguest sense of insanity and paranoia is, that none of it feels naturally motivated, even if this is probably the most subtle I've seen Gerard Butler act in a movie. ",
            "review_date": "2019-07-07",
            "source": "rt"
        },
        {
            "content": "All this movie did was made me wish I had gotten 2 hours of sleep instead.  Completely useless, boring, unnecessary story.  EW.  ",
            "review_date": "2019-06-24",
            "source": "rt"
        },
        {
            "content": "Boring, bland, illogical. Absolutely no \"psychological thrills\" ... the only \"mystery\" is why they released the film in the first place. \n\nUnsurprising that Butler's character would spring up to save the day.\n\n\nLike the ending of the film, the whole plot is dead in the water. Glad it was never released in Australian cinemas.",
            "review_date": "2019-06-12",
            "source": "rt"
        },
        {
            "content": "Great, haunting film. Just short of being a masterpiece.  Saw it on Amazon Prime and rewatched it again.  The dialogue is sparse and crisp, very little music, many close-ups - all letting the actors performances shine.  I'm surprised by the mixed reviews.  Perhaps because it is a dark, gritty film that highlights a world of isolation and soul-searching.  Extremely well-made.",
            "review_date": "2019-06-11",
            "source": "rt"
        },
        {
            "content": "Based on true events, however, with all the characters missing, I'm not sure how any part of the story could have been factually written. This was an interesting story and would probably have been better if I could have understood much more of the dialog which was very heavy with English/Scottish/Irish accent much of it was unintelligible.",
            "review_date": "2019-06-10",
            "source": "rt"
        },
        {
            "content": "The title, I suppose, must refer to the viewer's vanishing interest in what starts off as the promise of a SIERRA MADRE-esque exploration of paranoia and greed, but all too quickly descends not into isolation-imposed madness but a mere thriller about brain damage and invading pirates.\n",
            "review_date": "2019-06-09",
            "source": "rt"
        },
        {
            "content": "A great movie! Wonderful cast with great performances, you can feel the tension in the movie and the mystery behind it. The cinematography is fabulous makes you feel how isolated they are in that island and how anything can happen there. The whole movie changes as soon as they find the gold. A surprising ending .",
            "review_date": "2019-06-07",
            "source": "rt"
        },
        {
            "content": "Brilliant movie with the outstanding performance of Gerard Butler. Thriller and horror with blood. ",
            "review_date": "2019-05-21",
            "source": "rt"
        },
        {
            "content": "4/5.  Suspenseful and intense with excellent performance, The Vanishing's 3rd act is a step back, but this is still a very solid film.",
            "review_date": "2019-04-23",
            "source": "rt"
        },
        {
            "content": "It a slow paced film so you must have patience, but it is well acted and has an interesting plot.",
            "review_date": "2019-04-20",
            "source": "rt"
        },
        {
            "content": "Haunting with a great cast that makes this creep story really shine, but I wonder what happened to the dog? I do think that they could have made the end a little happier, as the whole film is very dark.",
            "review_date": "2019-04-17",
            "source": "rt"
        },
        {
            "content": "The Vanishing (originally titled The Keepers) is based on the Flannan Isle disappearances in 1900, where three lighthouse keepers went missing. This movie comes up with a sordid, suspenseful tale of what happened to them. I found this to be a competently made movie, but nothing stands out.\n\nWhen the violent or eery stuff happens, it does stand out; a few good ideas in this. The last shot is a little haunting. There are some nice shots of the island, a place that manages to be both picturesque and foreboding. All actors are decent, including Gerard Butler, Peter Mullan, and Connor Swindells as the lighthouse keepers.\n\nOn the other hand, the moments between can be weak and the exposition forced. The plot is predictable as it is a basic people-torn-apart-by-a-dark-secret-and/or-greed-story that doesn't do anything to set it apart from its predecessors, such as The Treasure of Sierra Madre and Shallow Grave. Of the three main actors, Mullan is the only one given the chance to shine. Filming was apparently on a budget and isn't lit the best. It doesn't help that this was filmed on cloudy days.\n\nThere's nothing really bad or great about this. It's just okay. If you want to see Butler in something other than action films, or you're just a fan of Mullan, then you may want to check this out.",
            "review_date": "2019-04-14",
            "source": "rt"
        },
        {
            "content": "Powerful and intriguing.",
            "review_date": "2019-04-03",
            "source": "rt"
        },
        {
            "content": "This movie makes no sense. Why would they be so emotional over acting in selfdefense?",
            "review_date": "2019-03-29",
            "source": "rt"
        },
        {
            "content": "I thought this movie was hauntingly beautiful. Gerard Butler gives an amazing performance and really shows the full gamut of emotion.Â \n\nI didnâ(TM)t know what to expect from this film but I certainly didn't expect to feel the way I feel now. To address what others have said, it does have its slow moments, but when the movie has its pace going, it is absolutely riveting. I will say that it's heavy, like 75 pound blanket on your chest heavy, but if you can appreciate the performances of each of these actors you can see the true beauty in this film. I thought it was a tour De force in how to show true emotional range in acting. Which I NEVER thought I would say about a Gerard Butler film.Â \n\nI'm honestly upset that more people are ranking it semi-poorly, everyone is entitled to their opinion, but I feel very strongly that this was a great piece of work. Shot absolutely beautifully, the story was written extremely well, and the acting is superb. Are there a few things I would have changed? Yeah probably, but that's not enough for me to take away from this film.\n\nI would absolutely watch this film again and I will recommend it to my friends.",
            "review_date": "2019-03-23",
            "source": "rt"
        },
        {
            "content": "The Vanishing (1.5 out of 5 stars). The Vanishing is a dull, boring, and pointless psychological thriller film about three men following their shift at a lighthouse. Based on real events about the mysterious disappearance of the lighthouse keepers in the 1900s. The plot follows Donald (Connor Swindells) a young adult and learning to be a keeper, James (Gerard Butler) who left his family behind on the main land, and Thomas (Peter Mullan) an older gentlemen who is struggling loss from his family. When they come across another stranger that washes up ashore with a chest. These three men try to debate on what they should do with the chest, if they should keep it a secret when they return to the main land or get rid of it. While being isolated, they begin to question their own insanity. I love the three cast members Gerard Butler, Connor Swindells, and Peter Mullan. But their performances are dull and boring. When they come across a few strangers and they get attacked. It just gets worse from there with their performances. The story was dull. The psychological part of these guys either trying to stay sane or their own personal greed can get in the way. There was not really much to the story. These characters were boring. The script was lacking in development even though it does set it up well with these three characters. The film does lack thrills and a sharp direction. It just feels like one long chore of sitting through the film. Overall, The Vanishing is a terrible film. The cast was boring with the characters. The plot was a waste for a psychological thriller. It lacked thrills or suspense to make this worthwhile to watch.",
            "review_date": "2019-03-18",
            "source": "rt"
        },
        {
            "content": "Plot seemed dramatic for no reason. Motivations of characters were illogical. It tried but this movie was a snoozer.",
            "review_date": "2019-03-15",
            "source": "rt"
        },
        {
            "content": "The ending killed the entire movie. It sucked ass. I want my 2 hours back.",
            "review_date": "2019-03-12",
            "source": "rt"
        },
        {
            "content": "Horrible. The worst ending I’ve seen in a long long time. One of the most boring 2 hours I’ve ever sat through. Don’t waste your time or your money!",
            "review_date": "2019-03-10",
            "source": "rt"
        },
        {
            "content": "With Butler and Mullan and inspired by a mysterious true story, I was really looking forward to this film. Sorry to say, although it started out well it just seemed to deteriorate into an icily paced depressive slog. A major disappointment for me.",
            "review_date": "2019-03-09",
            "source": "rt"
        },
        {
            "content": "Like the cast as always, but have to watch it again, looking for treasure to see if it works for me, will return to update rating after future viewings",
            "review_date": "2019-03-09",
            "source": "rt"
        },
        {
            "content": "A good theory for a famous 1900 mystery.",
            "review_date": "2019-03-07",
            "source": "rt"
        },
        {
            "content": "One of the best movies I have seen in many years. Original, and not a remake of some stupid comic book hero. Great screenplay.  Great acting and worth watching several times.",
            "review_date": "2019-03-07",
            "source": "rt"
        },
        {
            "content": "What starts out as an intriguing mystery slowly loses its thrill and ends in disappointment. The Vanishing, while beautifully shot and well acted, lacks some good action to keep the momentum going. It sets the right mood adding plenty of suspense to its already eerie setting, but this slow burner has narrative problems that result in a confusing and unsatisfactory conclusion.",
            "review_date": "2019-03-05",
            "source": "rt"
        },
        {
            "content": "Creating gloomy, livid and claustrophobic atmospheres with the slowness and less than a handful of characters is called rhetoric, no one remembers it anymore? Are the cornerstones of aesthetics became optional?\n(Mauro Lanari)",
            "review_date": "2019-03-05",
            "source": "rt"
        },
        {
            "content": "Suspenseful and emotional. Gripping drama that explores psychological ptsd of events beyond your control and the choices that follow.  Surprising emotional character acting by my favorite heart throbb Gerard Butler! Plot a little slow at times, but definitely worth seeing it to the end.",
            "review_date": "2019-03-04",
            "source": "rt"
        },
        {
            "content": "So painful to watch.",
            "review_date": "2019-03-04",
            "source": "rt"
        },
        {
            "content": "'The Vanishing' is an effective psychological drama-thriller which despite being a slow burn manages to be mostly effective.",
            "review_date": "2019-02-23",
            "source": "rt"
        },
        {
            "content": "COLD PYSCHO-DRAMA WITH THRILLER TENSION!\n\nThe latest film by director Kristoffer Nyholm is inspired by a true story and is known as \"The Flannan Isle Mistery\".\n\nThomas (Peter Mullan), James (Gerard Butler) and Donald (Connor Swindells) are lighthouse keepers on the island of Flannan. Who would have thought if an isolated remote island could present a horror they had never expected before. Some oddities began to occur along with the problems that continued to approach these three people. Until it reaches a point where all must go and disappear, along with the moral burden they carry!\n\nStunning acting from seasoned actors Tom Mullan and Gerard Butler also adds the power of the film which has this charming cinematography. Whacking emotion through a touch of cold psycho-drama, as well as spurring adrenaline with high tension in some scenes (typical thriller films), The Vanishing is an emotional play by combining uneasy feelings of anxiety and fear!",
            "review_date": "2019-02-17",
            "source": "rt"
        },
        {
            "content": "I like it, but I don't feel so good after waching this film. Butler is very good actor.",
            "review_date": "2019-02-08",
            "source": "rt"
        },
        {
            "content": "Intense and wonderfully acted.",
            "review_date": "2019-02-02",
            "source": "rt"
        },
        {
            "content": "Fabulously crafted movie, with high quality cast, writing and cinematography. \nA testament to what can be done with talent and hard work without big budgets",
            "review_date": "2019-01-29",
            "source": "rt"
        },
        {
            "content": "Cannot wait to see this!",
            "review_date": "2019-01-29",
            "source": "rt"
        },
        {
            "content": "Exceptional independent film - go see it!",
            "review_date": "2019-01-28",
            "source": "rt"
        },
        {
            "content": "A brilliantly acted, written and directed film. \nWell worth a trip to see it in the big screen. \nLiterally jumped out of my chair.",
            "review_date": "2019-01-28",
            "source": "rt"
        },
        {
            "content": "Hate movies where the accent is so thick you cant understand what the actors are saying....as gerald butler has been in many movies without  a thick accent.....waste of 106 minutes of my life",
            "review_date": "2019-01-28",
            "source": "rt"
        },
        {
            "content": "Interesting this is actually based on a true story, along with the fact the film depicts a good plot with an intriguing character conflict at an isolated setting that leaves room for mystery and deceit.  Ultimately, decent film at best.",
            "review_date": "2019-01-26",
            "source": "rt"
        },
        {
            "content": "Wanted more from this true story of greed stranded on a lighthouse island.  But, the thick accents and slow plot didn't quite deliver.  Had some decent moments...",
            "review_date": "2019-01-25",
            "source": "rt"
        },
        {
            "content": "The Vanishing occasionally loses steam through its cold narrative and thin script, but the brooding authenticity of the setting, its traumatic exploration of violence, and the performances are enough to keep it at bay",
            "review_date": "2019-01-16",
            "source": "rt"
        },
        {
            "content": "An imagined script based on an unsolved mystery? Poorly conceived with no rational explanation and an unresolved ending, waste of time.",
            "review_date": "2019-01-16",
            "source": "rt"
        },
        {
            "content": "Decent acting and slow predictable plot. Only thing that vanished was 2 hours of my life and the six bucks I spent on this movie rental.",
            "review_date": "2019-01-13",
            "source": "rt"
        },
        {
            "content": "As anyone knows who has had to work with people one doesn't particularly like or respect in confined spaces, it's difficult under good circumstances and it's going to get hairy when bodies start piling up. Just when our team was starting to bond, circumstances push each to their moral limit. It's refreshing to see characters each, in turn, grapple with their own capacity to kill. Sure, this movie has holes in it, but overall I warmed to these characters and I love a lighthouse in the middle of nowhere.",
            "review_date": "2019-01-12",
            "source": "rt"
        },
        {
            "content": "The Vanishing is surprisingly good, it tells a sad twisted story with a great deal of mastery, the plot is straightforward but it's actualized with breathtaking performances by everyone in the film, it has this deep eerie and dark feeling to it that adds this gripping factor as we watch dramatic events unfold in front of us, granted, that it has some structural problems with its narrative but the end product is so captivating you just can't take your eyes off it.\nThe slow burn storytelling adds a great deal of suspense as we ourselves examine and analyze what could happen, what I also loved is that through the film itself is dealing with a moral problem as its characters struggle to cope with their new situations, it is really beautiful to watch.\nThe Vanishing does its story justice as we're offered a chilling narrative that doesn't disappoint at all, an all around great effort.",
            "review_date": "2019-01-12",
            "source": "rt"
        },
        {
            "content": "I do like Mullan and I do like lighthouses, but dispite this I did not like this movie too much. The reason is a sterile direction and a non convincing story. Although it is inspired by true events the script did not much sense in more than one occasion, and even if you are not bothered about that, it is not satisfying enough. It is a shame because I liked the eerie atmosphere and at the beginning I was hooked... just until I was not.",
            "review_date": "2019-01-11",
            "source": "rt"
        },
        {
            "content": "A very fanciful hypothesis on what may have happened on the islet, but quite riveting nonetheless. I find it strange that Butler puts in a stellar performance in his own production, but canâ(TM)t repeat that ability in the mainstream stuff ?",
            "review_date": "2019-01-11",
            "source": "rt"
        },
        {
            "content": "Terrible movie, terrible plot, terrible storyline, complete fiction, DO NOT WASTE YOUR TIME",
            "review_date": "2019-01-11",
            "source": "rt"
        },
        {
            "content": "If those 3 men disappeared as stated at the beginning of the movie, then this story was totally made up ?",
            "review_date": "2019-01-10",
            "source": "rt"
        },
        {
            "content": "Extremely slow and boring. Silly story. ",
            "review_date": "2019-01-08",
            "source": "rt"
        },
        {
            "content": "It was a very intense thriller/drama with amazing acting. The eerie atmosphere helps with the mystery they want to create. A good example of human greed and brutality if needed.",
            "review_date": "2019-01-07",
            "source": "rt"
        },
        {
            "content": "What a really great way to kick off 2019! I know this was only an IDEA of what may have happened all those years ago in the Flannen Isle Mystery, but let's just say, if this is anything close to the real deal, then DAMN. I applaud all three of the main actors in their roles, but the stand-out performance for me would have to be Gerard Butler as James.  His character arc was quite sad, but incredible to witness. I know it's probably WAY too early to say this, but get this man some awards for this movie (which he also happened to produce)! He's sure come a long way since I first saw him, which I proudly admit was in The Phantom of the Opera (2004). The soundtrack was so eerie and unique, which really fit with the mysterious and haunting vibe of the movie's setting. There was some fantastic cinematography with the beautiful Scottish setting and great lingering shots as well! Now I will say the movie's introductory paragraph about how the three keepers (James, Thomas, & Donald) disappeared without a trace, DID take away from the shock factor of the ending for me, which also felt to be a tad abrupt in my eyes. I don't know if anyone else felt this way while watching the movie so right now I'll say that was just me. But in the end it was a fantastic movie! I def. recommend it for anyone looking for a good slow-burn thriller with memorable performances and an overall unpredictable storyline!",
            "review_date": "2019-01-07",
            "source": "rt"
        },
        {
            "content": "Honestly I will give Gerald Butler some credit. I like the role he plays as in my opinion is more of a supportive actor. I have often compared Butler to Nicolas Cage in the face they just do real poor movies now. I liked the Hunter killer movie that came out as it was entertaining and I found this to be the same. Not a great movie but if you want to kill some time and have seen everything else then check it out. ",
            "review_date": "2019-01-07",
            "source": "rt"
        },
        {
            "content": "Fairly slow. Good story line however. But at times it fails to keep your attention. Some very intense scenes followed periods of dullness.",
            "review_date": "2019-01-06",
            "source": "rt"
        },
        {
            "content": "nonsensical boring and all around rough.",
            "review_date": "2019-01-06",
            "source": "rt"
        },
        {
            "content": "1/31/2019\nMan's greed and insecurity spirals out of control in an isolated island off the Scotland coast. It had its edge-of-your-seat but mostly it was a flatliner.",
            "review_date": "2019-01-06",
            "source": "rt"
        },
        {
            "content": "This the kind of movie Gerard Butler should be making. Well wriiten, well acted , it draws you in to tthe characters...though predictable in parts. All three leads live and breathe their parts... especially how each dealt with the ramifications of thier actions and the inevitable finale.",
            "review_date": "2019-01-05",
            "source": "rt"
        },
        {
            "content": "I think this drama/thriller definitely delivers on intriguing storytelling, excellent cinematography, and brilliant performances (particularly Peter Mullan and Gerard Butler). Whenever it does suffer a bit from pacing, the performances of the three leads always bring me right back into their dark and dangerous situation. \n\nIt was also able to intrigue me so much, that I started looking up and reading about the real Flannen Isles mystery. Lastly, for those wondering, this is definitely one of the best, if not, the best performance from Gerard Butler, a roll which i'm pretty sure he wanted very badly (as he also Produced it). Please give this sadly under promoted and under seen film a chance.",
            "review_date": "2019-01-05",
            "source": "rt"
        },
        {
            "content": "My husband and I liked it. And we don’t often agree so it says a lot. I liked the tone of the movie. Artfully somber and suspenseful with action sprinkled throughout. ",
            "review_date": "2019-01-05",
            "source": "rt"
        },
        {
            "content": "Absolutely loved this movie and Gerard Butler was superb!!! Excellent cast and script was gripping!!! Must see movie!",
            "review_date": "2018-12-04",
            "source": "rt"
        }
    ]
}