{
    "rating": 2.9,
    "release_date": "2019-10-25",
    "num_reviews": 36,
    "genres": [
        "Horror",
        "Mystery&thriller"
    ],
    "summary": "An acting student encounters a malevolent spirit after participating in a viral challenge.",
    "reviews": [
        {
            "content": "this is one of the worst horror movies I've ever seen in my entire life and is one of those movies I never want to see again for as long as I live",
            "review_date": "2022-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Act ll of The Gallows is a bit undderated in my opinion. It delivers a scare of a story with other good scares and drama. The ending is better then the ending of the 1st movie. The acting may be alittle poor and the film seems alittle poor itself but also it is a decent enough sequel. Will have to give it a 3 out of 5.",
            "review_date": "2021-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ema Hovarth gives it her glorious all to bring a multi-dimensional performance to her role, touching upon a teen's insistence to matter within a digitally social context, which was handled rather naturally instead of as a gimmick and should've been the movie's focus, yet instead of fighting hangmen demons as the plot suggests, she's haunted by tired cliches, an obviously stretched out runtime, with slow creeping and jump scares galore (okay, one of which was rather nifty), only to survive to the above-meh surface as the final girl this movie desperately needed, despite the story's inevitable outcome.",
            "review_date": "2021-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one was bad. I kinda knew & accepted that it was going to be bad going into it, but even in that frame of mind, this one was still pretty bad. The acting wasn't the worst, but far from the best. I feel like the writing was done by 3 or 4 different people who never talked to each other. The effects were decent, not great, but passable. The world-building was garbage. But the biggest problem is it starts out as one movie and ends up another kind of movie. If you watch it you'll get what I'm talking about, but I'm not recommending that, so ... screw it, I'll just tell you ... the movie starts out as a supernatural thriller/horror movie and ends up a totally non-supernatural psychological thriller. It's that old chestnut, \"You thought it was ghosts, but it was just people, you idiots\"! Now to be clear that's a workable premise. It's been done before and been entertaining. However they failed to maintain the rules of the world they built. Like in the first half of the movie there's some very clear supernatural stuff that happens that cannot have a natural explanation for the way it was presented on-screen, and with the information they provided us. Then they end the movie with *SURPRISE* that was all just BS! It's like a \"gotcha moment\" stretched out into a crappy movie, and it just doesn't pay off in any satisfying way, and frankly insults the audience's intelligence. In order for everything to happen the way that it was presented on-screen would require more than just \"dumb luck\", there needs to be like a genie or a monkey's paw involved to get all those dominos to fall in place. There's \"suspension of disbelief\" and there's whatever the heck this nonsense is. Glad I didn't pay actual money to see this one.",
            "review_date": "2021-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the worst movies I have ever seen!",
            "review_date": "2020-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought it was better than the 1st one; largely due to it's drop in the found footage bs. Its more like a CreepyPasta. Its not like it's a classic, but it was ok for a horror. Some things that don't make sense at the end though. The ending was interesting but the movie maker's  get a bit too ambitious and abandon the concept of  \"how to have a story that makes sense\" ,  in exchange for completely wild twists that aren't well thought out  . In turn we get some noticeable plot holes.",
            "review_date": "2020-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jesus christ this is bad",
            "review_date": "2020-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It a waste of everything seen scarier cartoons",
            "review_date": "2020-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Logistical holes aplenty",
            "review_date": "2020-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is honestly one of the worst movies I have ever seen.",
            "review_date": "2020-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Gallows Act 2 is definitely an unstated horror film that isn't marketed well with its tired found footage trailer.  In reality, its executed quite well as the found footage vibe of the 1st film transitions to a new story shot in the usual film manner, which was great.  Anna, the main character, get caught up in the mystique of the old theater play The Gallows and the ghostly happenings that go with it.  The film is eerie throughout with good performances and an unexpected ending.  I actually thought it was a vast improvement on the original.   Everything created by Blumhouse is awesome!",
            "review_date": "2020-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kind of hard to follow. Wasn't anything related to the first Gallows.",
            "review_date": "2020-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely fabulous. A must see for any horror fan of Blumhouse.",
            "review_date": "2020-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "About on par with the first Gallows but the movie dragged a bit and only a couple decent scares",
            "review_date": "2020-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It Was Better Than Ever The Acting Was Good and There was No Mistakes. 10/10 Highly Recommend This To Someone",
            "review_date": "2020-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sick ass movie. When the first guy got hung I busted so fast. Definitely had my balls on edge",
            "review_date": "2020-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Acting was horrible but the jump scares got me a few times.",
            "review_date": "2020-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was really bad. This is a direct sequel to The Gallows (2015) a film that I actually was entertained by and for the most part enjoyed. This one really drops the ball. We follow a high schooler named Auna Rue (Ema Horvath) who is the new kid at school. She joins the drama class and absolutely does terrible her first day. Auna finds the play for 'The Gallows' in the school library and becomes enthralled with it. She finds a monologue in it which she performs almost as if she's always known the words her whole life. Meanwhile Auna then finds out there's an internet challenge involving the play where strange occurrences happen when you read from the book in the dark (ooo spooky). Auna has a bit of a following on Youtube, but man this is making my head hurt typing this up. Auna starts to see the ghost of the kid that died originally during the making of 'The Gallows' play named Charlie. Spooky stuff happens and jump scares happen. Anyways, don't watch this one. It's terrible. The acting is as if everyone was just reading off queue cards and the film has a somewhat twist at the end that doesn't make any sense. Avoid this one!",
            "review_date": "2020-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like it better than the 1st one",
            "review_date": "2020-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my biggest complaints about the original The Gallows movie is its half-assed commitment to the \"Found Footage\" style, taking something that's already not very good, and then doing it badly. So when I started up Act II (or I guess, more accurately, at about the five or ten-minute mark) and I realised that they abandoned the format, I assumed that at the very least it would have to be better than the first one. Turns out, that even though Act II dropped my biggest problem with the first movie, it was still somehow worse.",
            "review_date": "2019-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "God, please stop letting people make these ridiculous films.",
            "review_date": "2019-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They tried...and failed. The first movie wasn't terrible; I'd actually recommend it. This one was cheap and forced.",
            "review_date": "2019-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was so good! I got scared so many times, I laughed, I cried. It is a must see!",
            "review_date": "2019-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not a fan of horror movies, and this one had me jumping with every scare. My son even shared a few laughs with me about me looking out for any potential scares throughout.",
            "review_date": "2019-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great suspense / horror movie.  Great effects and kinda scary ( I jumped a couple of times).",
            "review_date": "2019-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie!  Kept us in suspense, and a great plot twist at the end!",
            "review_date": "2019-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very suspenseful! Kept me guessing til the end! Definitely recommend",
            "review_date": "2019-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an absolutely atrocious film.",
            "review_date": "2019-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Gallows 2 is dark twisted tale, with plenty of tense moments and jump scare. Gallows Act 2 stands up against wide released horror movie by doing what horror should do and makes us turn the mirror on ourselves and see what our world has become. At moments some of the effects are lacking but the movie finds it's spirit and proves to be haunting and subliminal.",
            "review_date": "2019-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It startled me and left me in goosebumps and chills! There’s also a shock, twist ending that you won’t expect. A perfect Halloween movie and definitely recommended.",
            "review_date": "2019-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I Enjoyed the film.. some good jump scares.. the film score is really good. Solid scary film. ",
            "review_date": "2019-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Way Better Than The First One(4/10 on that one) Very well placed scares, interesting storyline. Must See",
            "review_date": "2019-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely better than the first one. Great scares. Great twist ending. And an interesting look into how social media interacts with teens and our daily lives. ",
            "review_date": "2019-10-26",
            "source": "rt",
            "lang": "en"
        }
    ]
}