{
    "rating": 0.0,
    "release_date": "2019-10-18",
    "num_reviews": 153,
    "genres": [
        "Horror",
        "Mystery&thriller"
    ],
    "summary": "Disturbing and mysterious things begin to happen to a bartender in New Orleans after he brings home a cellphone that was left at his bar.",
    "reviews": [
        {
            "content": "This was one of those movies that was a complete waste of an hour and a half of my life I'll never get back LOL. One of the worst movies I've seen in a while. TOTALLY pointless. As many other reviewers have pointed out, nothing in the plotline or movie make any sense at all -- and not in an intentional, \"this is complex and hidden clues and you have to figure it out\" way, but in a completely disjointed, throw a bunch of unrelated creepy stuff in with absolutely no story that ties it together way.\n\nSoooo many questions that apparently no one involved, from the writers to producers to directors to cast, thought to ask or answer. What did the college kids at the beginning have to do with anything? What's the deal with the tunnel and the eye? What is the entire reason/story behind the happenings?\n\nTo top it off, the main character is intensely dislikable with apparently no redeeming qualities at all. I spent the entire movie just WISHING whatever the evil presence was would just end his ass already.\n\nAnd Dakota Johnson....sigh. How did she get to be cast in ANYTHING as an actress? Her performance/role in this film is just as it has been in every other film I've seen with her in it - a bland cutout cardboard person with one expression who adds nothing to the movie at all. \n\nDo yourself a big favor and avoid this movie like the plague. Wish I'd read a few reviews before mindlessly selecting it ha ha.",
            "review_date": "2023-04-24",
            "source": "rt"
        },
        {
            "content": "Okay movie feels incredibly incomplete with little to no explanation about anything",
            "review_date": "2023-04-22",
            "source": "rt"
        },
        {
            "content": "This movie started off interesting but there's no focus, no plot. The ending was horrible and to top it off, the last thing you see is what appears to be Armie Hammer eating his friend's face off .. homage to the cannibal rumors I assume; a way for Hammer to have the last laugh on those rumors. If there had been other writers perhaps this could've been good but I don't recommend watching it. It's not Dakota Johnson's best work either, she's horrible in this.",
            "review_date": "2023-04-08",
            "source": "rt"
        },
        {
            "content": "The main character was thoroughly unlikable and the plot thoroughly incoherent. Nothing made sense or was explained in the slightest. The ending seemed so much like a scrambled conclusion scrawled out by a desperate high schooler trying to make their essay's page count 2 minutes before it was due that I became genuinely frustrated, which rarely happens. I find it hard to believe that anyone involved in the making of this film cared at all except for whoever animated all those cockroaches. (Seriously, so many cockroaches. Why?)",
            "review_date": "2023-04-03",
            "source": "rt"
        },
        {
            "content": "Very pointless and a horribe storyline plus .\nending. Some bad horror movies can be comical to watch but this one is just bad.",
            "review_date": "2023-02-19",
            "source": "rt"
        },
        {
            "content": "This started off promising but ended flatly. There were too many loose ends, and no real idea at the what the roaches were all about!",
            "review_date": "2023-01-02",
            "source": "rt"
        },
        {
            "content": "I love New Orleans and I love horror movies, so  I figured I'd give this film a shot.\n\nThis is hands down one of the worst movies I've ever seen. I watched the entire thing hoping at some point it would come together and make a modicum of sense, but I was disappointed.  The gratuitous amounts of giant cockroaches did NOT make this movie better, especially for someone like me, who has a phobia of roaches, rather at some point there were so many roaches it became surreal.\n\nI'm not worried about spoilers; there are none. There was point to anything in this movie except to show off some entry level special effects.\n\nThe only reason I gave it half a star is because I couldn't give it any less.\n\nThe director and screenwriter should be ashamed of themselves for sabotaging actors' careers.\n\nThis movie makes anything by Ewe Boll look good in comparison.",
            "review_date": "2022-09-25",
            "source": "rt"
        },
        {
            "content": "Terrible movie. Left me with so many questions and it never really goes into detail on exactly what's going on. The ending was absolutely terrible.",
            "review_date": "2022-09-06",
            "source": "rt"
        },
        {
            "content": "all the characters are really interesting, but the horror part is so stupid it's funny",
            "review_date": "2022-08-30",
            "source": "rt"
        },
        {
            "content": "cast and director give their best but the story itself is just more miss than hit .",
            "review_date": "2022-08-07",
            "source": "rt"
        },
        {
            "content": "Wounds is a movie that could not be bothered to figure out why the film is happening in the first place. It is as if it's stuck on rising action and never climaxes. I believe the concept has much potential, but the execution fell flat. I can't call it open-ended because the entire movie barely makes sense. It was boring--that's why it has so many jumpscares, to wake you up.",
            "review_date": "2022-06-21",
            "source": "rt"
        },
        {
            "content": "Absolute waste of time, the plot was so underdeveloped you'd be better off watching baby shark on repeat for 10 hours….. lacks context to the entire construction of what it could have been",
            "review_date": "2022-04-22",
            "source": "rt"
        },
        {
            "content": "Nossa, nunca tinha visto algo tão ruim em toda a minha carreira de assistir filmes.",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "So many things that make no sense were cleared to the final cut which brings me to believe this is hardly anybody's passion project. Overall, it was very poorly written right from the beginning to the end.",
            "review_date": "2022-01-11",
            "source": "rt"
        },
        {
            "content": "Well, I don't know what I just watched. Overall, I was disappointed. Even the very talented cast could not save this film. Too bad... :l",
            "review_date": "2022-01-06",
            "source": "rt"
        },
        {
            "content": "One word: stupid. Another movie classified as a horror which comes know where near. More s snooze fest than a fright fest.",
            "review_date": "2021-10-28",
            "source": "rt"
        },
        {
            "content": "At first, I thought the roaches were scarabs and this would develop into some ancient Egyptian thing. Instead, we get 1/3 of a movie. The abrupt \"ending\" wasn't smart. at all. Seems like they ran out of film and just said \"f*ck it\".",
            "review_date": "2021-10-24",
            "source": "rt"
        },
        {
            "content": "Terrible.  Nonsense.  Not worth watching even once.",
            "review_date": "2021-10-24",
            "source": "rt"
        },
        {
            "content": "Why didn't the film have an ending? Wasnt left on a cliff hanger, sequel wanting finish, don't answer any questions or close any story lines. Not even disappointing, just really crap. \n\nNot even Zazie Beets could save this car crash.\n\nWas left with the worst feeling that you could be left with at end of a movie,  just so empty.",
            "review_date": "2021-10-21",
            "source": "rt"
        },
        {
            "content": "Wow, Armie Hammer really thought he was going to be famous.",
            "review_date": "2021-09-25",
            "source": "rt"
        },
        {
            "content": "O filme é péssimo. Não faz sentido nenhum mesmo depois de você ler críticas sobre ele. Não indicaria nem para o meu pior inimigo.",
            "review_date": "2021-08-26",
            "source": "rt"
        },
        {
            "content": "Simplemente no, \"Heridas\" es algo que trata de dar terror, sin conseguirlo. \"Heridas\" trata de perturbarte, y hacerte pensar que hay algo más ahí, pero no, no lo hay. \"Heridas\" quiere ser única, pero no lo consigue, y por eso mismo termina siendo pésima. \n\nConfié en esta película, enserio, pensé que tenia algo más que ofrecer que solo ser otra película basura que trata de ser única, arruinándolo todo con incoherencias, horribles efectos especiales, y un mensaje que transmitir, que se cae a pedazos.\n\n1.2/10 (Opinión corta)",
            "review_date": "2021-06-20",
            "source": "rt"
        },
        {
            "content": "It's so boring it feels like standing in an elevator. But they said, \"Let's fill the elevator with cockroaches and irritating people.\" Like what exactly was I supposed to enjoy about this movie..........",
            "review_date": "2021-04-19",
            "source": "rt"
        },
        {
            "content": "Nothing made sense, it wasn't scary for a moment, overall a really bad movie.",
            "review_date": "2021-03-26",
            "source": "rt"
        },
        {
            "content": "a whole lot of boring mess, with a few tricks up in its mind that just can't hit the mark",
            "review_date": "2021-03-06",
            "source": "rt"
        },
        {
            "content": "I will give it one cockroach. What a waste of time",
            "review_date": "2021-01-23",
            "source": "rt"
        },
        {
            "content": "huh. literally felt like this movie didn't have an ending... there was a big build up and then... nothing. don't recommend.",
            "review_date": "2021-01-19",
            "source": "rt"
        },
        {
            "content": "Not enough wounds, too many bugs.",
            "review_date": "2020-12-09",
            "source": "rt"
        },
        {
            "content": "The events that occur in this movie can often be completely random. For instance, what's up with the woman in the tub or the bugs? I really enjoy Babak Anvari's movies like Under the Shadow, but in Wounds, I think Anvari is trying to hard to make us jump while watching this movie. That's a 2 out of 5 from me.",
            "review_date": "2020-12-04",
            "source": "rt"
        },
        {
            "content": "The movie started very promisingly, very atmospheric with plenty of questions to be answered as the film progressed. Unfortunately the questions never got answered and I was left trying to figure out what the plot of the film actually involved. I'm all for art-house, think for yourself type films but this film just did not deliver.",
            "review_date": "2020-11-26",
            "source": "rt"
        },
        {
            "content": "Literally makes no sense at all, the worse ending to a film I have ever seen.",
            "review_date": "2020-09-13",
            "source": "rt"
        },
        {
            "content": "What the hell did I just watch? Probably a psychological thriller but it didn't make much sense or I'm quite dumb. The performances were good though but they couldn't carry the whole movie.",
            "review_date": "2020-09-06",
            "source": "rt"
        },
        {
            "content": "Bad!!! Initially I turned it off because of how bad it was, but then I realized it was only 15 minutes left. So I watched it through. Like most bad movies, it ended in the middle of nowhere and made absolutely no sense",
            "review_date": "2020-08-05",
            "source": "rt"
        },
        {
            "content": "Hammer e foarte bine dar nu prea are directie",
            "review_date": "2020-08-02",
            "source": "rt"
        },
        {
            "content": "I don't know whether to laugh or cry. Wounds clearly emphasises a drinking problem that may or may not contribute to the whole thing? There were constant underlying agendas with the found phone and the 'translation of wounds?' but none of this ever takes us anywhere.  Babak Anvari intends the film to be an incredibly over psychological horror flick, instead of focusing on the tools he already had to make this into a better movie altogether. The majority of the film is solely based off of relationship issues between all the characters. There were also added cult references that were ridiculous and overall had no effect, making it a pointless idea to begin with. All to try and add a little pinch of flavor but instead took away from the vaguely strong parts. There was a good cast involved: Armie Hammer and Dakota Johnson, unfortunately their efforts went to waste as they were dished crappy material from the get go.",
            "review_date": "2020-07-29",
            "source": "rt"
        },
        {
            "content": "15 minutes more to tie up the many loose ends could change this from a 1-star rating to 5-stars. Starts off well enough and introduces the general premise. After the first 20 minutes, there are already 4 stories to follow. Each storyline escalates and builds and just when they're about to come to a head- END. The ending they gave each storyline seemed rushed and instead of coming together to one harmonious conclusion, I was left wondering \"what was the point.\"",
            "review_date": "2020-07-08",
            "source": "rt"
        },
        {
            "content": "As with many horror films, the plot is fairly basic. However, it was decently scary and is worth a watch.",
            "review_date": "2020-07-05",
            "source": "rt"
        },
        {
            "content": "‪Wounds starts well but never reaches its potential, turning into a muddled mess. It is a film of two halves, attempting to step into too many genres. Hammer and Beetz chemistry was the highlight. We're wounded as we wanted more from it. ‬",
            "review_date": "2020-07-05",
            "source": "rt"
        },
        {
            "content": "Bad watch, not watching again, and can't recommend.\n\nThe only reason to watch this is if your a big horror fan and want to see the elements they used.\n\nI like Dakota Johnson and Brad William Henke well enough, but most of the performance in this was trash, and to be fair they were all probably just doing a good job of what the script and director said.\n\nThis one has entitle producer written all over it where everyone is just trying to get through it and get their paycheck.\n\nThat said, they did a real good job for a premise, building that horror vibe, and displaying the intensity (warranted or not). The premise is so good I honestly want a better movie about that than this weird forced love story thing.\n\nNo commitment to any idea in this movie, every idea is abandoned (sometimes literally) like a reverse Checkov's Gun: if we show you something, then it doesn't mean anything.\n\nThe movie literally just ends. You won't see it if you're not looking for it.",
            "review_date": "2020-06-26",
            "source": "rt"
        },
        {
            "content": "An erratic, poorly paced, poorly plotted movie that randomly throws jump scares, out-of-shot thriller elements, ick-factor, mystery, techno-terror and muddled arcane mumbo-jumbo at the audience with no unifying motive. Apparent allusions to TS Eliot in content, theme and structure do not hold together with sufficient conviction to make it a homage, nor an exploration of modernist alienation and angst transported to the early 21st century. Beyond some isolated thrills, some good lighting and the occasional moody shot, this hodgepodge of horror tropes succeeds neither intellectually nor viscerally. It is difficult to comment on the acting, since the script gives the actors almost no scope or depth, and without the effect of convincingly echoing the key 'Hollow Men' theme of the film.",
            "review_date": "2020-06-16",
            "source": "rt"
        },
        {
            "content": "It did not make sense. From beginning to end, I'm not sure what it was even about.",
            "review_date": "2020-06-12",
            "source": "rt"
        },
        {
            "content": "Absolutely nothing happens. Save yourself time.",
            "review_date": "2020-06-02",
            "source": "rt"
        },
        {
            "content": "This movie was a mess.  As it went on, it made less and less sense. And then it ended abruptly for no good reason.",
            "review_date": "2020-05-29",
            "source": "rt"
        },
        {
            "content": "This movie was BAD. Just one of those super weird horror films where you barely understand what’s happening the entire movie, and then it ends and you’re like “wait that was it?” And are given zero answers. Even the super hot and talented actors can’t save this plot. ",
            "review_date": "2020-05-22",
            "source": "rt"
        },
        {
            "content": "Why? You've got decent actors, an interesting and horrifying premise, a talented team behind the cameras - why not take all of that, use the end scene as maybe the second scene in the film, and then take it somewhere? Add depth, story, interest, pace. It felt like a waste of potential and was overall slow and boring.",
            "review_date": "2020-05-17",
            "source": "rt"
        },
        {
            "content": "A wonderful waste of time.... I been going to various sites to try to get understanding of the movie",
            "review_date": "2020-05-10",
            "source": "rt"
        },
        {
            "content": "A creepy enough ride that just doesn't gestate into it's full form.  Part prime-time languishing setup juxtapositions with glimmers of Cronenberg's eXistenZ, but we don't get the real meat until the closing scene.  If you've filtered through the higher rated horror film's  on tap then this is a good way to pass some time.  Now, if Anvari could have developed the protagonists relationships with more tact, and just duplicated the gravity of the closing scene throughout we might have a real winner here.",
            "review_date": "2020-05-03",
            "source": "rt"
        },
        {
            "content": "Don't waste your time with this film. Ends abruptly without any real plot, some quality time I'll never be able to get back. Fuck this film.",
            "review_date": "2020-05-01",
            "source": "rt"
        },
        {
            "content": "Waste of time. Literally, such a waste of time.",
            "review_date": "2020-04-18",
            "source": "rt"
        },
        {
            "content": "It had a good story and a decent plot. The film started strong with a bartender just living his life... what ruined it for me was the last 20 minutes of it. The person completely changed over the span of 5 seconds and overall the ending gave no closure to any of the plot elements.",
            "review_date": "2020-04-15",
            "source": "rt"
        },
        {
            "content": "Babak Anvari nos trae una obra más que interesante, que a pesar de tener algunos problemillas, es sin duda realmente interesante.\n\nLa historia y mitología de la cinta está contada de forma excelente, desvelando solo pequeños datos aquí y allá y dejando cierto espacio para nuestra que nuestra imaginación rellene los huecos o saquemos nuestras propias conclusiones, pero sin lugar a duda se siente fresca y cautivadora, al mismo tiempo que muy tenebrosa.\n\nPor otro lado a nivel técnico si es verdad que la realización no es nada impactante, aunque se hace el trabajo con solvencia y dejando a los actores principales llevar el peso de la historia por si solos, y vayan si lo hacen, sobretodo Armie Hammer, que está fantástico.\n\nQuizás la pega es que el final, aunque satisfactorio, se siente muy abrupto y acelerado en contraposición al desarrollo más metódico y lento del resto de la cinta.\n\nAnvari, tengo puesto los ojos en tí.",
            "review_date": "2020-04-13",
            "source": "rt"
        },
        {
            "content": "A creepy crawly mess....stay far away from this turkey.",
            "review_date": "2020-04-11",
            "source": "rt"
        },
        {
            "content": "This movie doesn't even rate half a star. No discernable plot. Man with creepy cell phone and bugs. A lot of bugs.",
            "review_date": "2020-04-08",
            "source": "rt"
        },
        {
            "content": "I can give this movie credit for being thrilling but unfortunately that's about it. It's a complete contradiction. The initial quote and references throughout regarding Gnosticism don't make sense. If humans are in control of their own destiny then there's no point to creating a portal for higher beings to fix them. \nAlso, the characters don't have enough depth to make a psychological epiphany believable.\n\nIt started with an interesting rhythm that really could've been good if they'd wrapped it up in several directions, but they just leave you hanging on nonsensical baloney.",
            "review_date": "2020-03-22",
            "source": "rt"
        },
        {
            "content": "I have been a horror fan my entire life, and I watch an average of ten horror movies a week. Some are awful, some are good, but what really keeps me going is when I unearth the rare gem that truly unsettles and fascinates me. Wounds was one of those. I didn't want it to end, I wanted to learn more about the lore, I absolutely loved it.",
            "review_date": "2020-03-04",
            "source": "rt"
        },
        {
            "content": "Overall, Wounds is an awful horror film.  Considering the film's cast, I was left feeling shocked at the end results. This is a horror film which has a plot that makes no sense, feels incomplete and characters who are truly silly at every point.  Movie lovers will feel a \"Wound\" in their hearts trying to understand anything and everything.  Awful and disgusting.  1.0/10 - Walkden Entertainment",
            "review_date": "2020-03-02",
            "source": "rt"
        },
        {
            "content": "Just a pointless movie. Doesn't get deep into a plot. Doesn't have a real story line. Nothing gets wrapped up or explained. Completely pointless!",
            "review_date": "2020-03-01",
            "source": "rt"
        },
        {
            "content": "The worst of the worse",
            "review_date": "2020-02-07",
            "source": "rt"
        },
        {
            "content": "I give this film 2/5 just for the actors because it really is not worth more!! I was seduced by the teaser which made you want to Watch the movie but what a disappointment.\nThe casting is good the actors play very well. It is a series of scenes  without reasons and without goals . The film has no end. \nI think the director is totally lost in a script that does not have meaning . Too bad because it had all the ingredients to make a good movie.",
            "review_date": "2020-02-04",
            "source": "rt"
        },
        {
            "content": "I feel the film ended halfway. Nothing remotely scary in this film. No dynamics between the characters. Nothing makes this film worth your time",
            "review_date": "2020-01-24",
            "source": "rt"
        },
        {
            "content": "Una mierda, no se entiende el camino que quiere agarrar ni lo \"sobrenatural\", sólo de destaca la actuación del personaje principal y las buenas tomas.",
            "review_date": "2020-01-21",
            "source": "rt"
        },
        {
            "content": "Watched on Netflix and this is not a good movie , the acting is fine but the story is just not good",
            "review_date": "2020-01-19",
            "source": "rt"
        },
        {
            "content": "Wounds has an interesting horror and thriller story added with stellar casts' performances then this a good movie to watch. The music background is appropriate to theme and the twist was enough to appeal the viewers. But the problem with Wounds is its story also and its execution in the film. I felt something lacking in the flow of the story as some points were not explained until the end. I also feel that is not complete and too much unexplained mysteries in it. Nevertheless, it is worth to take a one-time chance to watch it.",
            "review_date": "2020-01-14",
            "source": "rt"
        },
        {
            "content": "That was so bad......and slow......career suicide",
            "review_date": "2020-01-01",
            "source": "rt"
        },
        {
            "content": "I slept... Fell asleep",
            "review_date": "2019-12-29",
            "source": "rt"
        },
        {
            "content": "Millenial Armie Hammer, calls a group of Gen Z-ers, \"Fucking Millenials\".\n\nI was really disappointed with Wounds. Not about the above, just like... In general.",
            "review_date": "2019-12-28",
            "source": "rt"
        },
        {
            "content": "The whole story of the movie doesn't get anywhere, they present mysteries that are never well developed.",
            "review_date": "2019-12-24",
            "source": "rt"
        },
        {
            "content": "Wasn't scary at all. Wasn't a clear story. Ending was absolutely terrible.",
            "review_date": "2019-12-23",
            "source": "rt"
        },
        {
            "content": "It all goes crazy after Archie picks up the phone left at his bar.  But WHAT is really happening...couldn't say.  Just lots of roaches.",
            "review_date": "2019-12-22",
            "source": "rt"
        },
        {
            "content": "Just crazy movie. Lots of turns in it . ",
            "review_date": "2019-12-19",
            "source": "rt"
        },
        {
            "content": "This movie tried really hard to gross you out and at that it most definitely succeeds. It has its moments where it builds up suspense and horror poetically. The performances from Dakota Johnson and Armie Hammer are good but a special mention has to go to Zazie Beats who provides the most entertaining moments of the film.\n \nIt has plenty of problems too though. It tries to do too much which leads to it failing to follow a storyline and instead focus on story moments. This underdeveloped story is almost rescued by a very good ending but there's just not enough of a through line for me to recommend watching this film.",
            "review_date": "2019-12-18",
            "source": "rt"
        },
        {
            "content": "A humid New Orelans day garbage fire",
            "review_date": "2019-12-12",
            "source": "rt"
        },
        {
            "content": "Loved it - not for everyone, but if you let this movie take you down the path it wants to, and you keep an open mind, you can have a very fun time with it. Dialogue is an F+, but it disarms you for the very well done cosmic horror. If this was an AP Podcast of someone playing Cthulhu Daybreak, people would be eating it up.",
            "review_date": "2019-12-12",
            "source": "rt"
        },
        {
            "content": "I watched the whole movie waiting for the plot to kick it up... the end felt like that one moment, but... it was the end. So nope.",
            "review_date": "2019-12-09",
            "source": "rt"
        },
        {
            "content": "I think the movie had a great concept. A great concept that was totally ruined by a pompous director. The end of the movie, considered a \"conversation starter\" by the director was given so little explanation that a conversation couldn't possibly come of it. If that wasn't annoying enough the rest of the movie leading up to that point made just as little sense. This \"horror\" movie was about as scary as watching Peppa Pig, the director should stop making movies, retire, maybe even apologize for what he did, I don't know, it was bad.",
            "review_date": "2019-12-09",
            "source": "rt"
        },
        {
            "content": "Pacing was weird/slow, literally no payoff or solid plot. Duologue was boring. Don't watch this movie.",
            "review_date": "2019-12-08",
            "source": "rt"
        },
        {
            "content": "Waste of time. Kept watching in the hope it would get better. It didn't. Sucked right till the end",
            "review_date": "2019-12-07",
            "source": "rt"
        },
        {
            "content": "creeepy movie. started nicely but then got just weird.",
            "review_date": "2019-12-07",
            "source": "rt"
        },
        {
            "content": "You sucks wounds steaming pile of garbage",
            "review_date": "2019-12-03",
            "source": "rt"
        },
        {
            "content": "The worst movie of 2019 for me. What final was that?",
            "review_date": "2019-12-02",
            "source": "rt"
        },
        {
            "content": "The cast is lovely, with Hammer and Beetz putting on a hell of a show together. There are also plenty of great ideas for a good horror film. But the plot doesn't seem to ever get as interesting as it needs to and comes across as a disappointment.",
            "review_date": "2019-11-27",
            "source": "rt"
        },
        {
            "content": "Wow! That's 1:34 I'll never get back! So bad! I'm at a loss on how this got released. Plot was all over the place, performance's were phoned in, what did everyone have a weekend off, so let's make a movie?! Ugh .... next.",
            "review_date": "2019-11-22",
            "source": "rt"
        },
        {
            "content": "This movie is awesomely bad! What in hell is happening here? Why would ANYONE go to that bar? Why is he wearing that awful shirt? Why is he such a shitty bartender? No 2 scenes go together.\nNo answers\n\nI love hating this movie 5 Stars",
            "review_date": "2019-11-17",
            "source": "rt"
        },
        {
            "content": "no explanation at all, didn't get the goal of the movie",
            "review_date": "2019-11-17",
            "source": "rt"
        },
        {
            "content": "nice buildup ends with total wtf'ness. and not in a good cronenberg or lynch way.",
            "review_date": "2019-11-12",
            "source": "rt"
        },
        {
            "content": "All the money went to the casting instead of good screenwritters.",
            "review_date": "2019-11-10",
            "source": "rt"
        },
        {
            "content": "Don't  waste your time. Utter rubbish. No storyline and who the hell knows what's going on",
            "review_date": "2019-11-07",
            "source": "rt"
        },
        {
            "content": "Asquerosa mente mala",
            "review_date": "2019-11-04",
            "source": "rt"
        },
        {
            "content": "This movie is bad. I wish I could get my time back. It's not even so-bad-it's-funny, it's just plain bad. Don't waste your time.",
            "review_date": "2019-11-03",
            "source": "rt"
        },
        {
            "content": "It's a crazy, what the hell is happening,  Psychological thriller with  an uncanny way of making you say \"What the eff is going on?!\" Yet maintains you at the edge of your seat.",
            "review_date": "2019-10-31",
            "source": "rt"
        },
        {
            "content": "Muchas intrigas sin explicación.\n\nUna película larga para un final trunco y pobre.",
            "review_date": "2019-10-31",
            "source": "rt"
        },
        {
            "content": "This movie has a lot of lead up to an abrupt confusing ending. Hated it.",
            "review_date": "2019-10-31",
            "source": "rt"
        },
        {
            "content": "Wounds (1 out of 5 stars). Wounds is a psychological horror film that is a complete waste of time. The only horror thing about the movie is the complete boredom. The performances are tedious. The direction and script is stupid and dull. The film lacks scares and thrills. It feels like a terrible version of The Ring movie. The plot is boring. It follows a bartender played by Armie Hammer. After a random fight happens in his bar. Some teenager left their phone which he picks up. He looks at the pictures which has a disturbing dead person. From there on, his life is spiraling down when a strange car has been following him. His obsession over his friend played by Zazie Beetz. While his girlfriend played by Dakota Johnson is distant. And everywhere he goes there seems to be more cockroaches running around. The plot plays around with the concept which it barely explains in the movie about a teenager opening up a portal. Where wounds is the opening to another world. Nothing more is explained besides that. You spend the rest of the movie watching Armie Hammer's character going insane with his drinking problem. Mood swings. And obsession with his friend. The direction is boring. The characters make stupid decision. Such as right when the character brings home another persons phone. Which he sees a red flag text message. It takes him forever to get it to the police station. By the time he does, he loses the phone. Armie Hammer, Zazie Beetz, and Dakota Johnson are all great. But there roles and characters in this film are a waste. The characters are flat and dull. The film lacks in scares and thrills. Besides a disturbing ending which leaves you asking what did you just watch. Kind of a reaction. Overall, Wounds is one of the worst films of this year. It is boring. It is stupid. The direction and story is so tedious. It makes it hard trying to sit through it.",
            "review_date": "2019-10-30",
            "source": "rt"
        },
        {
            "content": "A horrifying feature with everything done right except the disappointing ending.  Still, a great watch",
            "review_date": "2019-10-30",
            "source": "rt"
        },
        {
            "content": "Dumbass movie. I'm only writing this to fulfill minimum characters. Skip this dumbass movie.",
            "review_date": "2019-10-30",
            "source": "rt"
        },
        {
            "content": "Movie made no sense and the ending like ...WHAT!  ...",
            "review_date": "2019-10-28",
            "source": "rt"
        },
        {
            "content": "Do not waste your time watching this movie.  Utter nonsense. ",
            "review_date": "2019-10-27",
            "source": "rt"
        },
        {
            "content": "not your average horror film -\ncinematography and blocking are above par",
            "review_date": "2019-10-27",
            "source": "rt"
        },
        {
            "content": "Just a boring bad movie",
            "review_date": "2019-10-27",
            "source": "rt"
        },
        {
            "content": "I sat for more than an hour waiting to see if it got better. The only thing good in this movie was seeing Armie Hammer but the ending did not follow through with my expectations. I could not believe that it ended the way it did.",
            "review_date": "2019-10-27",
            "source": "rt"
        },
        {
            "content": "This had such good actors in it, but such a bad storyline. Both cancel each other out.",
            "review_date": "2019-10-27",
            "source": "rt"
        },
        {
            "content": "With diabolical performances by Armie Hammer & Dakota Johnson, Wounds will explore mythology at a more terrifying and explosive level that will trauma you from start to finish. It's the most disturbing movie I've seen, with ultra-extreme and violent scenes, and the climax of the movie will make you never see it again.\nCONCLUSION: Wounds is a very difficult movie to watch, but if you manage to endure so much violence it will be entertaining..",
            "review_date": "2019-10-27",
            "source": "rt"
        },
        {
            "content": "Pretentious drivel, badly acted. This has no plot. Don't bother. ",
            "review_date": "2019-10-27",
            "source": "rt"
        },
        {
            "content": "Dumbest movie I‘ve ever watched. Absolutely useless. Just wasted one and a half hours of my life.",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "Honestly one of the least scary movies I've ever seen. The plot was slow, confusing and just generally poorly thought out. Anyone who enjoyed this movie must have never seen a decent horror movie in their life. ",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "Booooo! 👎\nWhere do i get a refund for the hour and a half i wasted on this dumpster fire. ",
            "review_date": "2019-10-25",
            "source": "rt"
        },
        {
            "content": "Absolutely terrible. Made absolutely no sense and the ending was horrendous. Wouldn't recommend and I love horror movies...",
            "review_date": "2019-10-24",
            "source": "rt"
        },
        {
            "content": "So iv specifically signed up to TR just to review this film.\n\nI personally found it awesome! long have i been searching for films that are chilling and mysterious as this film is. It reminds me of the PT demo. lots of creepy questions asked leaving you wanting answers.\n\nI understand this is not for everyone and i agree it would have been better ether as a longer film or as a series but only because i want more.\n\nA solid 4/5 stars from me and would love to see more films like this and hopefully a sequel. ",
            "review_date": "2019-10-24",
            "source": "rt"
        },
        {
            "content": "This movie was great for 10 minutes, the worst storyline worst ending, a movie that makes absolutely no sense that was just as dull I have no clue what this thing was about it was not hard to follow there was just an empty shell of nothing . I would like to see this cast in the real movie, great actors comet just completely false by calling it a movie",
            "review_date": "2019-10-24",
            "source": "rt"
        },
        {
            "content": "Thumbs down. The only thing I will give this film credit for is its ability to hold your attention all throughout the movie that keeps you guessing at what it will lead to, but eventually as the credits roll you realize that it in fact led to nowhere. \n\nI had to go and read stuff online about what the fakk did I just watch, but even then it doesn't leave you satisfied. Some promise, but unfortunately wasted and unfulfilled. ",
            "review_date": "2019-10-24",
            "source": "rt"
        },
        {
            "content": "Terrible ending and terrible movie!",
            "review_date": "2019-10-24",
            "source": "rt"
        },
        {
            "content": "This movie looks more like a Pilot of a tv show than a real movie. The Third act itself is the worse. A good cast in a shitty script with a lazy direction.",
            "review_date": "2019-10-24",
            "source": "rt"
        },
        {
            "content": "Starts out fast paced and entertaining but just drags halfway through the film and in the end doesn't really make any sense.",
            "review_date": "2019-10-23",
            "source": "rt"
        },
        {
            "content": "Stupid Movie about insects and they call it horror.",
            "review_date": "2019-10-23",
            "source": "rt"
        },
        {
            "content": "Started off promising and then went everywhere and nowhere at the same time. So many different things happening throughout the film and then absolutely no resolution to anything with such an abrupt ending. The entire thing was just disappointing.",
            "review_date": "2019-10-23",
            "source": "rt"
        },
        {
            "content": "Suspenseful with no real payoff. Dumb movie. Waste of a great actor Arnie Hammer ",
            "review_date": "2019-10-22",
            "source": "rt"
        },
        {
            "content": "Hammer seems rather adept at getting parts in duds like this ? Lone Ranger, Man From Uncle.\nStarted with a great premise and just meanders on for 90 minutes. Do the studios think the viewing public have short memories ? All this has been done innumerable times, more than I care to remember.",
            "review_date": "2019-10-22",
            "source": "rt"
        },
        {
            "content": "incomprehensibly morbid and dull. Wounds never captivates the audience, it infuriates them with its inconsistent narrative and non scares. ",
            "review_date": "2019-10-21",
            "source": "rt"
        },
        {
            "content": "Good thriller movie to watch for and also good acting. ",
            "review_date": "2019-10-21",
            "source": "rt"
        },
        {
            "content": "Awful awful awful....there is no story...all major incidents are disjointed.  I still don't understand da f*** happened and what da f*** did I watch. Was getting irritated quarter way thru movie and that guy's acting if not over the top then moments of pervey staring urgh!!!",
            "review_date": "2019-10-21",
            "source": "rt"
        },
        {
            "content": "Trash, I still don't know what it's actually trying to say ",
            "review_date": "2019-10-21",
            "source": "rt"
        },
        {
            "content": "Barely any horror in this horror movie. Poorly written dialogue and pacing. ",
            "review_date": "2019-10-21",
            "source": "rt"
        },
        {
            "content": "I never gets to the climax part. You wait and wait for something to happen and then... It ends",
            "review_date": "2019-10-21",
            "source": "rt"
        },
        {
            "content": "Terrible film. An absolutely plot less series of events that doesn't lead up to anything. It makes no sense.",
            "review_date": "2019-10-21",
            "source": "rt"
        },
        {
            "content": "Crappy, slow build up to dissapointing, equally crappy ending.",
            "review_date": "2019-10-21",
            "source": "rt"
        },
        {
            "content": "This is what happens when filmmakers are more fascinated by imagery and concept but don't know how to couch them in a story. Armie Hammer is Will, a bartender in a New Orleans bar who witnesses a fight break out one night while some college kids are in the bar (seemingly unrelated). The kids leave behind one of their phones, which contains disturbing images. All the while, his girlfriend Carrie, played by Dakota Johnson, seems to be studying occult Gnosticism, which seems to be related to what the college kids are involved in. If you're looking for any kind of payoff in this film, you're going to be sorely disappointed. Literally, this film has no payoff. It’s more just a bunch of stuff that happens and then, BAM!, end credits. There are times that it seems like it’s going somewhere. In fact, it felt like there should have been much more interrelated stuff between different parts of the movie, such as Claire’s professor, Steve, being more developed. In fact, I definitely get the impression that this was supposed to be the case, but that it either ended up on the cutting room floor or remained concept-only. It’s possible that this happens in “The Visible Filth,” the short novel on which this movie is based, but since I haven’t read it I can’t comment on it. The film we get is not a good film, either. The acting alternates between melodramatic and completely emotionless with no inbetween. Seriously, Brad William Henke is so over-the-top, he makes Jeremy Irons look like he was on Xanax during the “Dungeons & Dragons” movie. Dakota Johnson just sleepwalks through her entire role. Armie Hammer feels like he tries a little too hard to be the everyman. The only actor that seemed believable with genuine subtlety in their role is Zazie Beetz, but her character is pretty much superfluous to the proceedings. Her character could have been cut with little to no change to the plot. What’s so terrible about this film, though, is the sheer frustration factor. It’s a great idea. I would have loved to see more and have the movie cleaned up to be more cohesive and have an actual payoff. But we’re denied all of this. I love the concept of basing a film around occult Gnosticism. However, it’s set in such a poor movie that by the end, I found myself wringing my hands less out of fear or feelings of bugs crawling on you (which you might get) and more out of frustration for failure to realize its potential and seeing very easily how it could have been saved. When you’re doing the filmmakers work for them, they’ve got a problem.",
            "review_date": "2019-10-21",
            "source": "rt"
        },
        {
            "content": "This is a waste of my time, a waste of acting and directing.\nJust something I want to forget. ",
            "review_date": "2019-10-21",
            "source": "rt"
        },
        {
            "content": "Another horror film in which the characters seem not to matter as much as the scary stuff. WHY is this film set in New Orleans? WHY does this happen to these people and not just anyone? WHY didn't they turn the phone in to the police? There are answers, but they're lame. This is mostly gore porn.",
            "review_date": "2019-10-21",
            "source": "rt"
        },
        {
            "content": "To save time, watch the first 20 minutes and the last 15 minutes of the movie. Everything in-between are unnecessary scenes. ",
            "review_date": "2019-10-21",
            "source": "rt"
        },
        {
            "content": "Absolute garbage. How they managed to get great,talanted actors like Armie Hammer, Dakota Johnson and Zazie Beetz to star in this trash is beyond me. Don't watch this terrible film. It's an hour and a half of your life you'll never get back.",
            "review_date": "2019-10-21",
            "source": "rt"
        },
        {
            "content": "This movie was slow to start, but once it got going it brought an uncomfortable ambiance to the audience, and definitly upped its squick factor, it had all the build up and making of a good horror movie, but in the end fell flat with no real ending to what had happened, or a definitive explanation. This may be one of these movies where you have to go off your own theories, but honestly it seems poorly constructed, jumpy, and a little incomplete. 3 stars for giving it some good moments, and definitly some creep factor and having you reaching to cover your eyes at some uncomfy spots but... overall just didn't bring it after building it all up. Like a huge swell, with a heavy drop at the end, the drop being the disappointment of the unfinished vibe of this movie.  ",
            "review_date": "2019-10-21",
            "source": "rt"
        },
        {
            "content": "Why do these directors produce such terrible movies? It had promise from the start and just got worse as it went on! No imagination at all it was lifeless and boring! ",
            "review_date": "2019-10-20",
            "source": "rt"
        },
        {
            "content": "Quoting Chandler Bing: This was one of the worst things ever. And not Just on TV.",
            "review_date": "2019-10-20",
            "source": "rt"
        },
        {
            "content": "A slow  and wandering story. It approaches being suspenseful, but doesn't make enough sense to get there.  A waste of  time. ",
            "review_date": "2019-10-20",
            "source": "rt"
        },
        {
            "content": "Absolute joke of a movie, ZERO STORY or plot. I only finished it to see what would happen and it completely wasted 1 hour and a half of my life. Would highly NOT recommend. ",
            "review_date": "2019-10-20",
            "source": "rt"
        },
        {
            "content": "soooo boooooriiiing  ",
            "review_date": "2019-10-20",
            "source": "rt"
        },
        {
            "content": "Boring film, waste of time",
            "review_date": "2019-10-20",
            "source": "rt"
        },
        {
            "content": "There was no plot! This flick felt like 3 short films written by middle schoolers tenuously stitched together. Save your time and watch something else. Anything else...like grass grow or paint dry. ",
            "review_date": "2019-10-20",
            "source": "rt"
        },
        {
            "content": "Watch it on Neftlix really complex movie, the end was beautiful ",
            "review_date": "2019-10-20",
            "source": "rt"
        },
        {
            "content": "Not only is it set in New Orleans, it is crammed full of New Orleans. (Not just stuff and locations either. I feel like it gets a certain type of bar just about 100% correct.) BUT the real reason to watch is that it has some really good creepy moments, maybe even a scary moment, and it certainly made me uncomfortable quite a lot, and not just because of the amount of palmetto bugs involved, though they did bother me. The ending may not satisfy everyone, but I think the ride is worth it.",
            "review_date": "2019-10-20",
            "source": "rt"
        },
        {
            "content": "Wasted my night... Didn't make any sense, although when it starded i thought it was going to be a good movie. Very unpleasant, it kept going as if it was going to end somewhere but that never happened... ",
            "review_date": "2019-10-19",
            "source": "rt"
        },
        {
            "content": "Terrible plot line, not a very good character ark for main protagonists and was a sloppy ending. ",
            "review_date": "2019-10-19",
            "source": "rt"
        },
        {
            "content": "The fuck, the worst movie ever,  they have good actor in this movie and the beginning also is quiet nice. However, it's really bullshit till the end.  There is no proper ending and also do not understand the problem and the fuck there is no proper storyline",
            "review_date": "2019-10-19",
            "source": "rt"
        },
        {
            "content": "Promising start but flatlined until the Finishing moments with a shock ending that would have been served better as the overall plot of the movie. Wouldnt recommend to anyone to watch unless you're looking to waste your time.",
            "review_date": "2019-10-19",
            "source": "rt"
        },
        {
            "content": "It was good but kind of went in circles and didn't seem to have a core story. It felt like it was everywhere. And was supposed to shake up the audience, had it moments but for me it was a good try since not many can bring a movie to life. ",
            "review_date": "2019-10-19",
            "source": "rt"
        },
        {
            "content": "WTF DID THEY RUN OUT OF MONEY? WHY DOES IT JUST END OUT OF NOWHERE?\n\n(SPOILERS) WOUNDS IS JUST ABOUT COLLEGE KIDS FINDING OUT THAT WOUNDS CAN HELP CONNECT YOU WITH GODS. AND THEN THIS BARTENDER IS DEALING WITH IT? I GUESS? EVEN THOUGH THE COLLEGE KIDS ARE ONLY IN 2 MINUTES OF THE MOVIE?",
            "review_date": "2019-10-19",
            "source": "rt"
        },
        {
            "content": "The movie ends just as the plot seems to begin",
            "review_date": "2019-10-19",
            "source": "rt"
        },
        {
            "content": "Good premise, no payoff.  Zzzzzzzzz",
            "review_date": "2019-10-19",
            "source": "rt"
        },
        {
            "content": "If shit was a movie, then this is it. ",
            "review_date": "2019-10-19",
            "source": "rt"
        },
        {
            "content": "Words fail me how bad this movie was.  Cant believe i wasted my time even leaving a review but that is alcohol for you.",
            "review_date": "2019-10-18",
            "source": "rt"
        },
        {
            "content": "This is a perfect creepy late night movie for Halloween. Creepy ever-present cockroaches, bloody pictures on a strangers phone, with an overall looming feeling of being watched. It’s existential themes of toxic masculinity and sense of purpose and self are interesting, and I wish would have coalesced. But Hammer and Johnson are fantastic as a casual couple on the decline, fantastic chemistry. ",
            "review_date": "2019-10-18",
            "source": "rt"
        },
        {
            "content": "Just finished watching. What was the movie about? Looks like someone just learned how to make very fake cockroaches with cgi. Also Hulu forgot to play the ending..,",
            "review_date": "2019-10-18",
            "source": "rt"
        },
        {
            "content": "If I could give this movie no stars I would.  Half of it made no sense and there was actual laughter at the end as the audience looked around and wondered what we just watched.",
            "review_date": "2019-04-05",
            "source": "rt"
        }
    ]
}