{
    "rating": 0.0,
    "release_date": "1990-03-30",
    "num_reviews": 119,
    "genres": [
        "Biography",
        "Drama"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "A remarkable film and performances by Day-Lewis and Fricker",
            "content": "Let me state at the outset that I have Cerebral Palsy and I went into this film expecting to have to make allowances for the lead performance.  I left the theater half-convinced that they'd cast an actor who had Cerebral Palsy in the role, even though I knew that was not the case.  The performances were generally excellent, with a special nod to Brenda Fricker and to Hugh O'Conner (I believe that's his name) as the young Christy Brown.  Christy is talented, brash, arrogant, at times vulgar and petulant-in other words, human.  This film, along with Gaby: A True Story and the documentary King Gimp, are excellent portrayals of life with CP.  By no means a complete portrait, but fine examples of the disabled as human beings.  Most highly recommended.",
            "review_date": "2001-12-30",
            "lang": "en"
        },
        {
            "review_title": "Despite a disingenuous ending, a film you really should see.",
            "content": "This film is about the life of Christy Brown--a man who, despite being almost completely disabled, was able to make something of himself and prove that every life is of value. When he was born in 1932, doctors recommended to his parents that Christy be placed in a home for the disabled--in other words, a 'warehouse' where he would have been dumped. However, despite his severe cerebral palsy, his parents brought him home and raised him despite the odds--a real oddity for that period of time. The story follows Christy from his birth until has later years when he eventually gained fame for his art as well as his autobiography, \"My Left Foot\"--named that because it was his only usable limb.When you watch the film, you will marvel at the acting. While Daniel Day-Lewis received the Oscar for his great and very realistic portrayal of Brown, I am not sure why the child who played Brown as a child didn't get some sort of recognition--as he was great also. And, I especially appreciated it because too often child actors are, to put it bluntly, terrible. Yet, Hugh O'Conor was every bit as wonderful as Day-Lewis.On the other hand, once again, the history teacher in me strikes again. As I watched this biopic about the Irish author/painter Christy Brown, I couldn't help but feel a bit annoyed that the ending painted a completely false picture of the man's final years. In this Hollywood-like ending, Brown apparently has a very happy final years. However, this was NOT at all true---and his final years were quite pathetic--filled with alcoholism and an an early death. I really don't think the film needed the happy ending and knocked a point off for this.Still, overall an exceptional film--one well worth your time.",
            "review_date": "2013-07-13",
            "lang": "en"
        },
        {
            "review_title": "Daniel Day-Lewis Is The Greatest Actor Ever!",
            "content": "After watching The Left Foot, I have came to the conclusion that Daniel-Day Lewis the greatest actor alive and perhaps the greatest actor ever! But for the film itself, it's a powerful film that's well directed, well-acted, masterfully written, and provokes a good amount of emotion. But most of all, it spreads awareness about this handicap. Cerebral Palsy is something people should know about this and while not a propaganda piece, this film does a good job on giving the audience information about this disorder.Jim Sheridan's film tells the biography of a man named Christy Brown. Born with cerebral palsy, the story goes from his tough childhood to his even tougher adulthood where he becomes an expert writer and painter despite the fact he only has mobility with his left foot.Now on to Daniel Day-Lewis. I think people would agree with me on where I stand with him as an actor. He puts every ounce of effort into his roles and he acts as if he is actually the character he is portraying. After his roles in \"In the Name of the Father\", \"Lincoln\", \"Gangs of New York\", and \"There Will Be Blood,\" I can honestly say he is the best actor ever. Also, I must single out Brenda Fricker in this role as Christy's mother because she does such an amazing job.Overall, My Left Foot is a wonderful film that tells a story of a condition that many people must suffer through. I am glad there is a film that brings proper awareness to the condition and hence, much emotion is provoked. On technical terms, this film not the best since I felt it could use just a little better editing. But story-wise, yes it is perfect. I rate this film 9/10.",
            "review_date": "2014-03-25",
            "lang": "en"
        },
        {
            "review_title": "One of the greatest screen performances:",
            "content": "Daniel Day Lewis is one of the best actors of our time and one of my favorites. It is amazing how much he throws himself in each of the characters he plays making them real.I remember, many years ago, we had a party in our house - the friends came over, we were sitting around the table, eating, drinking the wine, talking, laughing - having a good time. The TV was on - there was a movie which we did not pay much attention to. Then, suddenly, all of us stopped talking and laughing. The glasses did not clink, the forks did not move, the food was getting cold on the plates. We could not take our eyes off the screen where the young crippled man whose entire body was against him and who only had a control over his left foot, picked up a piece of chalk with his foot and for what seemed the eternity tried to write just one word on the floor. When he finished writing that one word, we all knew that we had witnessed not one but three triumphs - the triumph of a human will and spirit, the triumph of the cinema which was able to capture the moment like this on the film, and the triumph of an actor who did not act but who became his character.Jim Sheridan's \"My Left Foot\" is an riveting, unsentimental bio-drama about Christy Brown, the man who was born with cerebral palsy in a Dublin slum; who became an artist and a writer and who found a love of his life.I like every one of Day Lewis's performances (I have mixed feelings about his performance in GONY) but I believe that his greatest role was Christy Brown in \"My Left Foot\"",
            "review_date": "2007-02-27",
            "lang": "en"
        },
        {
            "review_title": "You can't deny that Daniel Day-Lewis is the world's most devoted actor.",
            "content": "Even if you know absolutely nothing about Ireland, you have to love \"My Left Foot\" (and especially Daniel Day-Lewis' performance in it). He plays cerebral palsy-afflicted Christy Brown. Due to this, he has spent most of his life ostracized. Even when trying to warn people about something, they just laugh at him. The light in the darkness for him is that he has control over one body part: his left foot. He uses that appendage to paint and write poetry, bringing him to prominence.Daniel Day-Lewis and director Jim Sheridan did very well on this collaboration, and also on a later collaboration: \"In the Name of the Father\" (but \"The Boxer\" was unnecessary). \"My Left Foot\" can make you feel many ways: sad, hopeful, or something else. But in any case, Daniel Day-Lewis gave the performance of a lifetime here. A great movie in every sense.",
            "review_date": "2005-08-15",
            "lang": "en"
        },
        {
            "review_title": "It's the Daniel Day-Lewis show!!",
            "content": "'My Left Foot' is the remarkable story of Christy Brown, born into a working-class Irish family with cerebral palsy. Growing up in a life full of poverty and extreme prejudice, Christy defied everyone's expectations. Using his left foot, the only part of his body he had proper control over, the young man learned to write and paint.I could spend this review talking about the film's excellent portrayal of working class Ireland, and the working class Irish family specifically. I could talk about how the film does a good job of showing how the attitudes towards Christy Brown changed as Ireland's own political landscape changed. I could probably also talk about the role of women in Christy's life, from his mother and sisters, to the loves in his life. All of these things are worthy of mention.However, when talking about 'My Left Foot', there is one thing that stands out above everything else; that being Daniel Day-Lewis. Day-Lewis had already proved his acting chops in the excellent 'My Beautiful Laundrette, but it was this movie that put him on the map globally. And rightly so: he is absolutely fantastic as Christy Brown.Acting is difficult at the best of times, when you're playing a fully-functioning human being. What Day-Lewis achieves, therefore, is even more admirable. It is an extremely effective and realistic portrayal of someone suffering from cerebral palsy, and the actor goes gung-ho with both the physicality expressiveness required for the role. It is a joy to watch.An honourable mention also needs to go to Hugh O'Conor, who plays the younger Brown. I can only assume that it is even harder for a child to go through the rigours that the role requires, but O'Conor is brilliant. What makes the character difficult to play is that, in trying to make it look real physically, the emotion required can be lost. Both actors avoid that problem with what seems like relative ease: at no point does the efficacy or emotion of the moments falter.All the other stuff mentioned above are worthy of talking about, if I intended to write a longer review. But for this small thing, I think it is more than enough to say that 'My Left Foot' deserves to be seen just for this landmark Daniel Day-Lewis performance. Whatever you may think of the film as a whole, or whether you care about the story of Christy Brown or not, it is secondary to the simple appreciation for an actor at the top of his game.",
            "review_date": "2013-12-11",
            "lang": "en"
        },
        {
            "review_title": "A Profoundly Rich & Moving Experience",
            "content": "Notable for marking the commencement of Daniel Day-Lewis' personal version of method acting, My Left Foot presents the widely acclaimed actor pushing himself to the extreme in what is undoubtedly one of the proudest works of his acting career. And even though the film doesn't have anything else to offer, the performances are strong enough to keep the viewers engaged.Based on the autobiography of the same name, My Left Foot tells the story of Christy Brown; an Irishman who was born with cerebral palsy but despite his handicap went on to become an artist & writer, all with the help of the only thing he could fully control: his left foot. The film covers his upbringing in a poor family, his daily struggles, discovery of new passions & also his stint with love.Wonderfully directed by Jim Sheridan, the film is heartwarming & heartbreaking at the same time, and is an inspiring insight into the life of Christy Brown that makes the viewers go through various emotions, but pity isn't one of them. The technical aspects are finely executed & have nothing special going on but it's in the performances where the film manages to make the most lasting impression.There are three key performances that are worth noting here. First is Daniel Day-Lewis who delves into his character like never before & plays him from inside-out. Next is Brenda Fricker who strongly chips in as Christy's mother. And last we have Hugh O'Connor who is as good as Day-Lewis for his portrayal of young Christy Brown sets up a perfect stage for Day-Lewis to take over.On an overall scale, My Left Foot is a touching tale about the indomitable will of the human spirit to triumph against all odds, and succeeds mainly because of the unforgettable performances from its highly committed cast. But even if the film is entirely dependent on its acting strength, it still makes up for a rich cinematic experience that comes as a must for Daniel Day-Lewis' admirers as well as critics.",
            "review_date": "2013-10-11",
            "lang": "en"
        },
        {
            "review_title": "A remarkable performance by Day-Lewis.",
            "content": "For some reason I never got around to seeing this movie when it came out, but finally had the opportunity, thanks to my public library and its DVD collection. Day-Lewis is crippled author and painter Christy Brown, and he won the Oscar for best actor. It is easy to see why. In addition, Brenda Fricker as his mother, Mrs. Brown, won best supporting actress. The DVD extras include some 1960s footage of both Christy and his mother, and it reinforces how well done this movie is. The story is simple -- Christy was born with cerebral palsy, a brain disorder which didn't allow normal motor controls of arms, legs, mouth, etc so that he had much difficulty moving and speaking. The only unaffected part of him was his left leg. He could kick pretty well (as demonstrated twice, in playing street ball and in a pub brawl) and eventually learned to write, paint, and type with his left foot. Thus the name of the movie. He became a successful painter and author, in spite of his severe physical disadvantages.The movie shows us both the young Christy and how he grew up as a fairly normal member of his very large but poor Dublin family, as well as the mature Christy. It shows his determination, and it shows his temper tantrums, usually borne of frustration at not being able to be \"normal\". His main loss as an adult seemed to be the inability to find someone who could love him, in a committed sense. As his biography tells us, in 1972 at the age of 40 he married a nurse, Mary. The movie also contains a depiction of how they met and went on to begin their romance. Christy Brown died at the relatively young age of 49, in 1981, but his life is a great example of what can be accomplished if you don't let obstacles shackle you. A superb movie, and a superb portrayal by Day-Lewis.",
            "review_date": "2006-04-26",
            "lang": "en"
        },
        {
            "review_title": "Don't feel sorry for this character!",
            "content": "Daniel Day-Lewis' almost impossible performance as a man with cerebral palsy earned him a well-deserved Oscar in 1989 for Best Actor over the heavily favoured Tom Cruise in 'Born on the Fourth of July' and Morgan Freeman in 'Driving Miss Daisy'.  The Academy was still riding the wave of awarding Dustin Hoffman a second Best Actor prize a year earlier for his performance as a mentally challenged individual in 'Rain Man' and since Day-Lewis' performance was superior to Hoffman's, the Academy had to recognize him. Day-Lewis probably would have won anyway as his performance was hard to ignore and he had never received any acting nominations from the Academy before this film despite turning in great work in such films as 'The Unbearable Lightness of Being' and 'My Beautiful Laundrette.'As Christy Brown, Daniel Day-Lewis makes his character unsympathetic as he doesn't want you to feel sorry for him.  He achieved the great success of being an accomplished writer and artist.  Director Jim Sheridan directs the film like a series of home movies that millions want to see.Brenda Fricker won the Oscar as Best Supporting Actress as Brown's mother and she is the real moral centre of the film and this film proves that Hollywood is capable of choosing small, lesser known films for Oscar consideration and 'My Left Foot' is a film that is uplifting without being sentimental.",
            "review_date": "1999-03-04",
            "lang": "en"
        },
        {
            "review_title": "In one word: inspirational",
            "content": "As someone who has lived with cerebral palsey for over forty years, I find this movie to be inspirational.  If someone with such a severe case of CP as Christie Brown has can do so much, then there's no reason that I couldn't achieve my own dreams.  Daniel Day-Lewis and Brenda Fricker both give awesome performances.",
            "review_date": "1999-05-08",
            "lang": "en"
        },
        {
            "review_title": "One of the best performances by an actor in the last decade.",
            "content": "I am in awe of Daniel Day-Lewis' acting in this movie.  I can't think of anyone else who could have portrayed the real-life writer Christy Brown as well as he does.  He doesn't just portray the ravages of cerebral palsy of his character but the intelligence, humour, courage and love of the man. The character also is not deemed a saint but allowed to have humanity - the foul mouth and love of booze and women.  If a movie can be called inspiring than this has to be it.Lewis and Brenda Fricker as his mother both won Oscars and Ray McAnally as his father also deserved one.  The movie is well directed by Jim Sheridan with whom Lewis again worked with in the excellent In The Name Of The Father as well as The Boxer.",
            "review_date": "1999-11-09",
            "lang": "en"
        },
        {
            "review_title": "Terrific Daniel Day-Lewis performance",
            "content": "Christy Brown is born with cerebral palsy. His father (Ray McAnally) refuses to give him up and he learns to live with controlling only his left foot. His loving mother (Brenda Fricker) tirelessly raise him. As a child (Hugh O'Conor), everybody assumed that he's a simpleton until he wrote MOTHER with chalk. As a young man (Daniel Day-Lewis), he is rejected by the pretty girl. His father loses his job and becomes abusive. He falls for Dr. Cole (Fiona Shaw) treating his cerebral palsy but she's engaged. As an older man, he falls for his nurse Sheila (Alison Whelan).It's a tough way to act for Daniel Day-Lewis. It's not just the physicality but he has to make sense despite his speech pattern. He has to be understandable without speaking understandable English. It's his anger and his unlikeability that brings out his humanity. He's not playing a saint or a caricature. It's a real person. It's an all-around performance.",
            "review_date": "2014-09-02",
            "lang": "en"
        },
        {
            "review_title": "Daniel Day-Lewis deserved all of his acting awards...",
            "content": "DANIEL DAY-LEWIS does a remarkable job of playing Christy Brown, the artist who grew up with cerebral palsy but managed to have a productive life, dealing successfully with his handicap and becoming a respected artist and writer.The film, however, is a very difficult one to review--or even watch. Fortunately, I had the caption feature on to catch every spoken word which would have been impossible if I saw the film in a theater. While I respect it as a brave piece of work dealing with difficult subject matter, I can't say it's the sort of film I'd want to view more than once.Nevertheless, my attention was held by the story-telling device, a flashback framed by the present, in which we see Christy being honored for his achievements before we see the flashback to his youth and his struggles to communicate with those around him, who certainly gave him loving care.DANIEL DAY-LEWIS certainly is remarkable as the troubled man who falls in love with a therapist (FIONA SHAW), much to his mother's fear that when the love is not reciprocated his heart will be broken. There's a painfully long scene in a restaurant where he confesses his love to her before others and then goes into a frenzied rage after drinking too much.BRENDA FRICKER does a brilliant job as the mother taking care of him, his father and a brood of siblings while struggling to keep a roof over their heads until Day-Lewis begins to have success with his work. She complements Day-Lewis' performance as the warm-hearted mother and shares many poignant moments with him.Richly detailed story of a family that stayed together under the most unusual of circumstances with attention to period detail in every frame of the film. Both Fricker and Day-Lewis won Oscars, but HUGH O'CONOR and RAY McANALLY are also excellent. O'Conor is Christy as a boy and McAnally is the father who spends too much time at the local pub but loves the boy.Summing up: Elmer Bernstein's music is an added plus factor. Well worthwhile, but definitely not a film for everyone.",
            "review_date": "2007-05-24",
            "lang": "en"
        },
        {
            "review_title": "\"A broken body's nothin' to a broken heart.\"",
            "content": "No doubt inspirational, \"My Left Foot\" is an unflinching look at the life of Christy Brown, born with cerebral palsy and who, with great determination, taught himself to paint with his only usable limb. The character of Christy is portrayed by two remarkable actors, Hugh O'Connor as the young boy, and Daniel Day-Lewis as the adult Christy. The film is not shy about revealing all of the frustration and anger that motivates the man, and in some respects, one will stand in shock at his behavior when things in life do not go his way. His behavior at the dinner party when his language teacher, Dr. Eileen Cole (Fiona Shaw) announced her engagement to Peter (Adrian Dunbar) was one example. His utter rage at an insult against the family, resulting in a barroom brawl was another, so the person was not entirely sympathetic. There were aspects of the picture that didn't ring true to me, and not having read Christy Brown's autobiography, I have no way of knowing if my observations have merit. But for one, there is not one single example of anyone bullying or making fun of the young Christy as a boy. This seemed rather unbelievable to me, as knowing how cruel kids can be, even when not meaning to, that there were no examples of that kind of behavior. Nor was there any reference to how the parents (Ray McAnally, Brenda Fricker) dealt with their son's bodily functions. This may sound gross or unsympathetic, but someone in the family had to attend to those necessities and it wasn't addressed in any sort of way. The behavior and attitude of Christy's many siblings was also a model of decorum throughout, and one marvels at the idea that there were never any squabbles among them growing up.As with many of these biopics, I'm always leery about the Hollywood treatment of making a film with the greatest universal appeal, so that also led me to doing a quick search on the real Christy Brown. I was startled to learn that his relationship with Mary Carr (Ruth McCabe) began while he was having an affair with a married American woman who he intended to wed upon her divorce. The marriage to Mary was fraught with it's own set of problems, as she was accused of being an abusive alcoholic and habitually unfaithful. So the movie's feel good ending was not entirely accurate in the way it was portrayed. Be that as it may, Daniel Day-Lewis is astounding as the adult Christy Brown, having earned a Best Actor Oscar for his efforts. I would almost call it the best performance ever by an actor of a disabled person, but have to qualify that now after having seen Eddie Redmayne's portrayal of Stephen Hawking in 2014's \"The Theory of Everything\". I'm still puzzled though over Brown's cryptic written words after coming to terms with Eileen Cole's engagement - \"All is nothing. Therefore nothing must end.\" In trying to parse the phrase, anything I come up with doesn't make sense.",
            "review_date": "2018-05-16",
            "lang": "en"
        },
        {
            "review_title": "Truly inspirational and phenomenal",
            "content": "The story is inspirational, and the acting is phenomenal. It touches my heart deeply.",
            "review_date": "2020-06-13",
            "lang": "en"
        },
        {
            "review_title": "You can't feel sorry for yourself after seeing this movie",
            "content": "Christy Brown was born in Dublin to a very large, poor family. He had severe cerebral palsy and could only control his left foot. Without formal schooling, he became an acclaimed painter, writer, and poet.This movie is absolutely wonderful. I'd put off watching it because I expected it be maudlin and manipulative, but it's not; it's earthy and defiant and hopeful, just like Christy. Daniel Day-Lewis earned the Best Actor Oscar for his stunning performance which manages to convey his horrible frustration and longings without being overly-sentimental. He's really outstanding. Brenda Fricker won Best Supporting Actress; she's immediately likable and admirable. The entire cast is perfect and the story is truly inspiring.Heartily recommended.",
            "review_date": "2013-11-26",
            "lang": "en"
        },
        {
            "review_title": "A Great Performance from Day-Lewis",
            "content": "A noted cinematic phenomenon of the late eighties and early nineties was the number of Oscars which went to actors playing characters who were either physically or mentally handicapped. The first was Marlee Matlin's award for \"Children of a Lesser God\" in 1986, and the next ten years were to see another \"Best Actress\" award (Holly Hunter for \"The Piano\" in 1994) and no fewer than five \"Best Actor\" awards (Dustin Hoffman in 1988 for \"Rain Man\", Daniel Day-Lewis in 1989 for \"My Left Foot\", Al Pacino in 1992 for \"Scent of a Woman\", Tom Hanks in 1994 for \"Forrest Gump\" and Geoffrey Rush in 1996 for \"Shine\") for portrayals of the disabled. Matlin, who played a deaf woman, is herself deaf, but all the others are able-bodied. This phenomenon aroused some adverse comment at the time, with suggestions being made that these awards were given more for political correctness than for the quality of the acting. When Jodie Foster failed to win \"Best Actress\" for \"Nell\" in 1994 some people saw this as evidence of a backlash against this sort of portrayal. My view, however, is that the majority of these awards were well deserved. I thought the 1992 award should have gone to either Clint Eastwood or Robert Downey rather than Pacino, but apart from that the only one with which I disagreed would have been Hanks', and that was because I preferred Nigel Hawthorne's performance in \"The Madness of King George\". In that film, of course, Hawthorne played a character who was mentally ill. \"My Left Foot\" was based upon the autobiography of the Irish writer and painter Christy Brown. Brown was born in 1931, one of the thirteen children of a working-class Dublin family. He was born with cerebral palsy and was at first wrongly thought to be mentally handicapped as well. He was for a long time incapable of deliberate movement or speech, but eventually discovered that he could control the movements of one part of his body, his left foot (hence the title). He learned to write and draw by holding a piece of chalk between his toes, and went on to become a painter and a published novelist and poet. Life in working-class Dublin in the thirties and forties could be hard, and the city Jim Sheridan (himself a Dubliner) shows us here is in many ways a grim, grey, cheerless place, very different from our normal idea of the \"Emerald Isle\". (Sheridan and Day-Lewis were later to collaborate on another film with an Irish theme, \"In the Name of the Father\"). Against this, however, must be set the cheerfulness and spirit of its people, especially the Brown family. Much of Christy's success was due to the support he received from his parents, who refused to allow him to be institutionalised and always believed in the intelligence hidden beneath a crippled exterior, and from his siblings. We see how his brothers used to wheel him round in a specially-made cart and how they helped their bricklayer father to build Christy a room of his own in their back yard. The film could easily have slid into sentimentality and ended up as just another heart-warming \"triumph over adversity\" movie. That it does not is due to a number of factors, principally the magnificent acting. In the course of his career, Day-Lewis has given a number of fine performances, but this, together with the recent \"There Will Be Blood\", is his best. He is never less than 100% convincing as Christie; his tortured, jerky movements and strained attempts at speech persuade us that we really are watching a disabled person, even though, intellectually, we are well aware that Day-Lewis is able-bodied. The other performances which stand out are from Fiona Shaw as his mentor Dr Eileen Cole, from Hugh O'Conor as the young Christy and from Brenda Fricker as Christy's mother (which won her the \"Best Supporting Actress\" award). The other reason why the film escapes sentimentality is that it does not try to sentimentalise its main character. Christy Brown had a difficult life, but he could also be difficult to live with, and the film gives us a \"warts and all\" portrait. He was a heavy drinker, given to foul language and prone to outbursts of rage. He could also be selfish and manipulative of those around him, and the film shows us all these aspects of his character. Of course, it also shows us the positive aspects- his courage, his determination and his wicked sense of humour. Day-Lewis's acting is not just physically convincing, in that it persuades us to believe in his character's disability, but also emotionally and intellectually convincing, in that it brings out all these different facets of Christy's character. His Oscar was won in the teeth of some very strong opposition from the likes of Robin Williams and Kenneth Branagh, but it was well deserved. 8/10",
            "review_date": "2008-04-07",
            "lang": "en"
        },
        {
            "review_title": "An amazing debut",
            "content": "I can still remember the fuss that was made when this movie was first  released. Everybody was applauding it. 14 years down the line the film  is very dated, but still very enjoyable but more importantly very  powerful.  The story centers around Poet, artist and author to be Christy Brown.  He suffers from Celerbal Paulsy (I hope that is spelled right) which  means to be all three of the above occupations is some feat that should  not go unnoticed. He lives in a large family (13 children, not all who  suffered) in a small terraced house in Dublin's City Center. The movie  begins with his birth and the late great Ray Mc Nally being told by a  nurse that there were complications during the birth. We move forward a  couple years to where we see a young Christy (played by Hugh O'Connor)  being helped around by his mother. It is a sad sight to see him  underneath the stairs of his family home watching his brothers and  sisters (all Abled bodied) living a normal lifestyle (despite being  poor) and knowing that he is just as well able to communicate. The  finest scene in this early stage of his life is when Christy writes for  the first time. In front of his family. His father is sceptical at  first however his opinion is reversed when Christy finally proves that  he is not the idiot that everybody thinks him to be.  We then move to Christy's later teenage years where he meets a nurse  with whose help he begins to learn how articulate his words. However  Christy becomes infatuated with this lady. His mother is delighted that  her son is happy however his father is once again the sceptic but this  time he has good cause to as Christy's heart is broken when this woman  announces that she is engaged to an Art dealer.   This film is brilliant and I have a massive amount of praise for Daniel  Day-Lewis who portrays Christy as an angry young man who is coming to  terms with everything in his life. He is disturbed by womens reluctance  to accept him and his condition, He is fed up of his fathers treatment  of his mother and his siblings. Day-Lewis is totally immersed in his  character and it is one of his finest roles. I have seen old interviews  with the real Christy Brown and I can safely say that it is hard at  times to distinguish is it Christy Brown or Daniel Day-Lewis on the  screen.   However the show is stolen from him by the finer performances of young  Hugh O'Connor and Ray Mc Nally. Both of whom should have got Oscars as  Best Supporting Actor (O'Connor) and Best Actor (Ray Mc Nally).  O'Connor definitely proves himself in the role because he portrays the  same qualities that Day-Lewis does as a frustrated youngster. Mc Nally  defines the typical Irish Father role that would be made humorous by  Colm Meaney in a number of films. It is such a great pity that he died  shortly after this film. Brenda Fricker must also be mentioned as the  doting mother who does everything that she can to help Christy reach  his full potential. Again she is life like to Christy Browns real life  mother however I think there were more deserving people for that Best  Supporting Actress Oscar.   This film is an amazing piece of independent film making and it really  does so the potential of Jim Sheridan as a director and actor. He would  further develop the themes of family, Irish society, loyalty in his  other films.  9 out of 10.",
            "review_date": "2004-06-21",
            "lang": "en"
        },
        {
            "review_title": "Can there be a better group of actors in one low-budget film?",
            "content": "Seriously, can you imagine such a spread of talent in one film without a huge budget: Daniel Day-Lewis, Ray McAnally, Brenda Fricker, Hugh O'Conor AND Fiona Shaw? There's no doubting that Fricker and Day-Lewis deserved their awards: but it would have been entirely justifiable to have seen O'Conor (as Young Christie) and McAnally awarded: the cliché is true here: they don't perform the roles, they inhabit them. Day-Lewis' performance is a tour de force - such a transformation that it is awe-inducing, but it was truly a mark of the Academy's intelligence that alongside this performance, they also honoured Brenda Fricker's beautifully restrained, still and heart-wrenching work as Christie's mother. By the way, if you haven't seen this magnificent actress in \"Swann\", that's another film well worth checking out for her contribution (and the sublime Miranda Richardson).",
            "review_date": "2006-08-16",
            "lang": "en"
        },
        {
            "review_title": "Brilliant performance",
            "content": "The most important thing about this movie is the brilliant performance by Daniel Day-Lewis and Hugh O'Conor as Christy Brown, guineas artist and fighter who despite of her physical condition overcame all the odds. As a person who did work with patients with cerebral palsy, I can assure you that their performance were shockingly convincing. The enormous support that Christy got form his family, low-income, working class Dubliners, encouraged him to do the impossible and this picture depicted this support brilliantly have not read the book, but the dialogs were written wisely to capture Christy Brown's witty arrogant personality. I do recommend this movie to everyone, especially to classic movie-lovers.",
            "review_date": "2006-07-04",
            "lang": "en"
        },
        {
            "review_title": "A true inspiration, a true artist, but more than anything, a true Irishman....",
            "content": "Christy Brown (1932-1981) was a famous Irish painter and writer born in a family of 22 children. The fact that he was one of the 13 survivors is pretty ironic considering the severe condition he was born with: cerebral palsy. Christy couldn't control his body as if he was in a perpetual battle between his muscles and his will, but destiny, in all mercifulness, left him one avenue to communicate: his left foot. Would you think it was thin consolation? For Christy, it was enough: he could grab objects, hit the doors and eventually write and paint, express his thoughts, and his torments, for cerebral palsy never affected his capacity to learn, to understand, even to surpass the others' intelligence and sensitivity. \"My Left Foot\" is the inspirational story of Christy Brown.Christy's struggle starts within his own family where everyone is convinced that he would never be able to get an education, although he's loved and treated like a Brown, he's the cripple of the Family, not to say the retarded. One of the hardest to watch scenes of the film occurs when the father (Ray McAnnaly in his last performance) helps his boy to do his homework and has to find out what a quarter of 25% is. For him, it doesn't make sense since 25% is already a quarter but poor Christy Brown gets the answer and desperately tries to write 1/16 with a piece of chalk between his toes, nobody understands. The scene was frustrating and heartbreaking enough to create a totally opposite feeling when Christy writes M-O-T-H- E-R on the floor, the kids cheer, the father is proud and goes buy a drink, Mrs. Brown is overwhelmed, but not that surprised. Hugh O'Connor delivers a magnificent performance, which I'm sure if it was longer, would have earned him more awards.But behind the obligatory cheers, there are more insightful and more thought-provoking lessons to be learned. Mr. Brown refused to put him in an institution, because it would be a disgrace. At that time, they probably didn't expect him to survive or maybe it would cost money but it's on the basis of this decision that the parents allowed Christy to grow up in a normal background, and not have his inspiration being suffocated by medical assistance. Had Christy been born in a rich family, he wouldn't have become this talented artist, and it's even clearer considering the life he had. Brown was treated equally to his brothers, he was toughened by the street, he played soccer, he drank at pubs, he hit and got hit, he was an Irishman in flesh and blood, and it shows all through the film. The genius of Daniel Day-Lewis' performance is to never let the feeling of a one-note personality but on the contrary, convey through his body language, his facial expressions and his burning eyes, a tormenting passion and a ferocious desire to live like everybody and to be loved, he can love but it's all about being loved. The 'love' side is plainly occupied by the other powerful performance of the film, Brenda Fricker (who won the Oscar). She's not just the typical Irish mother, who was pregnant during 16 years (I admit, I counted), she incarnates the capability of a mother to understand her boy. Respect and love are important, but understanding someone is sometimes more valuable. She knows what he feels and even foresees the deceptions. In one movingly intelligent scene, she disapproves Christy's growing affection toward the beautiful doctor Eileen Cole (Fiona Shaw). Something isn't right in Christy's voice, too hopeful. Her motherly instinct doesn't fool her because the hope in Christy is quickly destroyed when Eileen reveals that she's going to be married. Daniel Day-Lewis is so powerful that you could literally see his heart being blown into pieces, and the way the situation becomes more and more out of control, reveals a dark, almost creepy, side in his personality, a dependence to alcohol and an almost childish incapability to accept his condition, his heart suffers much more than the body, but who could blame him?The power of \"My Left Foot\" is to rather take an ordinary look of low-budgeted TV family drama rather than a grandiose Hollywood- type biopic, which fits the tone of the film. But it's definitely the three-dimensional, vibrating and passionate Oscar-winning performance of Daniel Day-Lewis that reminds you it's not a TV film. However, the movie is not without a few flaws that don't ruin the overall feeling though. At one scene, the father discovers that his wife was saving money for a wheelchair, we wait for his reaction but then it cuts abruptly to him playing with his kid, tickling him. The mother announces that their daughter is going to marry someone because she's pregnant. Mr. Brown's outburst of rage causes Christy to go into a sort of angry trance, trembling and drooling like a rabid dog, he's eager to kill his father. I thought Christy's reaction was disproportionate regarding an attitude than any father would have, much more in that time. It seemed to me that he was supposed to be a hateful character while he was not. The 'porridge' scene was also confusing because it tried to turn Mr. Brown into a real douche-bag while there were more scenes showing pride than animosity between him and Christy, and nothing to show a sort of complicity between Christy and his sister.Apart from these little details, \"My Left Foot\" tells a great story, about a great character, it's not perfect, but what the heck: humanity is full of remarkable examples of persons whose talent and hard work allow them to overcame their handicap and to communicate with the rest of the world and if it was not for Jim Sheridan's adaptation of the biographic book \"My Left Foot\" and for Daniel Day-Lewis' extraordinary performance, many of us wouldn't have heard of Christy Brown.",
            "review_date": "2012-10-31",
            "lang": "en"
        },
        {
            "review_title": "Amazing story",
            "content": "Daniel Day-Lewis is Christy Brown, a victim of cerebral palsy who uses \"My Left Foot\" to write and paint in this incredible 1989 film. The movie also stars Brenda Fricker as Christy's mother, Ray McAnally, Fiona Shaw and Hugh O'Conor. Their brilliant performances, great script and wonderful direction by Jim Sheridan help to paint a vivid portrait of Christy Brown, an artist and writer who died in 1981 at the age of 49.Brown was born into a lower middle-class Catholic family where his mother was constantly pregnant (22 children in total, 13 of whom survived). His father considered Christy mentally retarded as well as physically handicapped, but he would not permit his son to go into a home. The children in the family would bid goodbye to him each day as they went off to school, and then his mother would feed him and talk to him.In the movie, Fricker conveys the sense of a woman who, despite being surrounded by a huge family, needs someone to talk to. Christy doesn't talk back. Eventually a cart is found for him to ride in, and the neighborhood kids, all of whom have known him since he was a baby, include him in all of their activities. The only part of his body that works really well is his left foot, and when the kids find out how well he kicks, they put him into soccer games for just that purpose. One of the nicest parts of the film is the relaxed way the in which the other children treat him.There are many powerful scenes, but none as powerful as Christy writing \"Mother\" on the floor holding a piece of chalk between his toes. \"He's a true Brown,\" his father declares, hoisting him on his shoulders and carrying him to the pub. Walking into the pub, he announces, \"My son's a genius.\" Things change when Christy grows older because he has a young boy's desires and emotions. He develops crushes, is rejected and goes more into himself, turning to painting. Eventually he goes into therapy in a nearby clinic and works with a therapist, Eileen (Fiona Shaw) at home. He falls in love with her. When he finds out she's engaged, he nearly goes crazy. But he survives to live, to paint, to write (three books in total) and to love again.Because it's a film, by necessity certain things had to be left out and characters combined. Brown wasn't actually diagnosed with cerebral palsy for some time, which was left out of the movie. The therapist Eileen is actually a combination of three important therapeutic figures in Christy's life, and though we know that his mother believed he had a good mind, in truth, she worked very hard with Christy when he was a child teaching him the alphabet, etc. Also, before Mary, Christy had a 12-year relationship with the woman to whom he dedicated \"My Left Foot.\" And the typical Hollywood ending, 9 years before his death where neglect by his wife may have been a factor, doesn't finish the story.Despite all of that, Christy Brown's biopic is incredibly powerful, all the more so because of two performances: Hugh O'Conor as young Christy and Daniel Day-Lewis as the adult Christy. O'Conor's facial expression and the way he drags his warped body is gut-wrenching. One is exhausted for him and heartbroken at the same time.And what can be said about Daniel Day-Lewis, one of the greatest actors in the world - he brings Christy totally to life, a fully fleshed out, intelligent human being capable of swearing, becoming angry, bitter, drunk, pushy, lecherous, funny and loving. A well-deserved Oscar won in the same year that Tom Cruise was nominated for \"Born on the Fourth of July.\" I remember someone writing a letter to the editor somewhere that Cruise was so sensational, what was wrong with the Academy? Uh, nothing for a change. Nothing at all.Brenda Fricker is amazing as Christy's mother, who never stops believing in him and what he can do and who holds her family and husband together during the hard times. The wonderful thing about Fricker's performance is that the support, love and work ethic seem to come naturally to the mother. The character would never consider herself a heroine or as someone doing something out of the ordinary. Fricker shows us a religious but not fanatic woman who believes her duties on earth are to be a good wife and mother. And no matter what, even when her husband is out of work, throws their daughter out of the house for being pregnant, whatever, she manages. She saves money for Christy's wheelchair, she receives photos of her daughter and the baby, she starts building a room for Christy in the back of the house. All part of a day's work. A performance worthy of the Oscar she received.Brown's life was more complicated than this inspiring film, but this is an amazing achievement by all involved and a must-see.",
            "review_date": "2008-08-31",
            "lang": "en"
        },
        {
            "review_title": "To carry thy cross",
            "content": "My Left Foot is a great movie. I am not an expert myself, but I've liked the acting performances very much. Especially of Day-Lewis (Christy Brown), Brenda Fricker (Mrs. Brown) and Ray McAnally as Mr. Brown.The movie is touching, it really reminds us to be compassionate but still not demean those less fortunate in any way. Not only is the movie great but the true story behind it. No one should give up on life or mourn over his misfortune, rather accept his problems and carry them to the best of his abilities.",
            "review_date": "2018-10-21",
            "lang": "en"
        },
        {
            "review_title": "Not the Epic Movie I Thought it Would Be,but Daniel Day-Lewis is an Incredible Actor,",
            "content": "My Left Foot: The Story of Christy Brown is a great movie with a very well developed storyline and a very impressive cast.I thought this movie would be incredible but in wasn't nearly as good as I expected.I found it very boring at times,but Daniel Day-Lewis really made this movie what it is,his acting is incredible and inspired and he deserved the Academy Award for his performance,but I don't think Brenda Fricker did,I didn't find her performance that impressive.The movie did tell us the story of Christy Brown perfectly and put us in his position all the way through,but I am Irish,and I thought this movie would make me feel very proud of my country,other than Daniel Day-Lewis,it didn't really.If you enjoy dramatic biography movies and Daniel Day-Lewis,this movie certainly is a must see,but I just didn't enjoy it as much as I thought it would.Adaption of Christy Brown's autobiography of how he overcame cerebral palsy to become an artist and author.",
            "review_date": "2013-07-17",
            "lang": "en"
        },
        {
            "review_title": "A very good film with an amazing performance",
            "content": "I have many favorite actors and many favorite performances that cannot really be compared to each other, however, if someone where to point a gun at my head and tell me to name the greatest performance I've ever seen, it might very well be Daniel Day-Lewis in this very fine film about the life story of Christy Brown, a man who suffered from extreme cerebral palsy and who became a famous painter and writer using the only extremity he had control over and that was, of course, his left foot. When I saw this in the theaters, I took a handicapped friend with me who had a mild case of palsy along with scoliosis. Back then, Day-Lewis was far from a household name and he had never heard of him, enjoyed the movie and the performance. At dinner, I was quite surprised to find out that he thought the lead actor, who he had never heard of, actually had palsy and he was literally stunned to find out that it was entirely a performance. I cannot think of a higher compliment. And what an amazing and astonishing feat of acting it is. There are few to compare with it. Simply extraordinary work.",
            "review_date": "2023-01-30",
            "lang": "en"
        },
        {
            "review_title": "Astonishing Performance!",
            "content": "I don't know much about Christy Brown. This film is about a man who overcame incredible odds and produced some incredibly impressive work. This is about recreating a personality and it is done with painful realism. The two actors that portray Brown, Daniel Day-Lewis and his young counterpart, bring him to life with incredible believability. One can only imagine weighing this great burden the body has placed on this man and for him to also have faced the taunting of his peers and his family. To have been considered retarded and somewhat worthless. It is again a mother's love and great bearing that keeps the ship afloat. She is not blind and realizes what a difficult road there is, but she is there always. I forgot I was viewing actors and forgot about it being a movie. I felt I was in the room with Christy Brown. This is another one of those films I had heard about for many years. I finally got to see it. It is worth every second, just for the indomitable spirit it portrays.",
            "review_date": "2010-10-11",
            "lang": "en"
        },
        {
            "review_title": "A hard film to pull off the shelf, but an even harder film to shut off.",
            "content": "It's taken me over 30 years to get to this Academy Award winning film that won Oscars for two of the most brilliant performances of modern times. Real life artist Christy Brown is the subject of this heartwarming drama, a man who suffered from cerebral palsy yet went on to become very successful through the support of his mother Brenda Fricker and doctor Fiona Shaw. Daniel Day-Lewis is probably the most deserving actor to win the Oscar in the past 40 years, and this performance is not only one of the most poignant but one of the most wondrous to imagine how he got into this character and stayed in it. It was a physical challenge as well as an acting one, and he pulls it off brilliantly.Credit should also be given to young Hugh O'Conor who plays Christy as a child, only on screen for a limited time but very convincing as Lewis was in making the character consistent throughout the film. Fricker as his mother is love personified, risking her health for every effort she does to take care of him, and Shaw, as the first woman that Christy falls in love with, is as exquisite as ever. Had it not been for Fricker's presents in this film, it might be her taking home the gold. Ray McAnally, as his father, is also very good as the embittered working class man who seems to find it hard and dealing with his son's physical issues.This is indeed a very difficult film to get into because of the fear of how depressing it could be, but it never delves into that emotion. Christy's issues are strictly physical, only becoming mental as he faces rejections when he offers women his love. But there's a triumphant twist to all that, and it's a great study of how when someone is determined they can get past any obstacle. It's very spiritual as well with Christy as an Irish Catholic dealing with some resentment that he's been put in the state he is. The humor is slight and never overwhelming, and the script never attempts to manipulate the viewer to feel sorry for him. The human spirit is a fragile one, but here, it is filled with heart and a passion for life that is both joyous and slightly envious at the same time.",
            "review_date": "2022-04-06",
            "lang": "en"
        },
        {
            "review_title": "The Ultimate Triumph of the Spirit",
            "content": "If ever there were an inspiring story that could move anyone, disabled or not, to persevere despite the odds and make it (even when \"make it\" as an expression, proper, can have a wide berth which is an ultimately personal truth), MY LEFT FOOT is it. It's a hard film to watch at times: seeing the less placid aspects of Christy Brown's personality emerge in two key scenes -- one when his sister declares she is pregnant and about to get married while his father has a bad reaction, and at a dinner table when the woman who's reached out to him, made him able to communicate effectively, now has announced at a key moment (the inauguration of Brown's art) she is about to marry another man -- is tough. Very, very tough. More so because this is a man who cannot react accordingly to these events and can only express himself in the only way he knows how: via screams, shrieks, and profanities aimed at hurting himself. However, this is not a story of heartache and family dysfunction even when there is quite a bit of it furnishing the autobiographical account, but that of a man overcoming his severe disability, becoming a functioning human being and a force of be reckoned with in the art world. Daniel Day Lewis won an Oscar for his powerful, unforgettable performance as the flawed but tenacious Christy Brown, and Brenda Fricker did so as well for her supporting role as Brown's solid mother.",
            "review_date": "2007-06-03",
            "lang": "en"
        },
        {
            "review_title": "Amazing!",
            "content": "This movie is amazing and the biggest reason why is the actor. This is maybe the single best performance by an actor in any movie that I have ever seen.I'm not sure why but I have to write ten whole lines for this review to count and be posted but I'm not sure what else to say so I guess I will just keep typing? This is really pointless, if we just have something short to say why should we have to write a bunch of extra mumbo jumbo too?Anyway if you like great performances then check this movie out, he is awesome!",
            "review_date": "2014-03-23",
            "lang": "en"
        },
        {
            "review_title": "Danny Rocks",
            "content": "The story of Christy Brown (Daniel Day-Lewis), who was born with cerebral palsy. He learned to paint and write with his only controllable limb -- his left foot.I have been a fan of Daniel Day-Lewis since seeing \"Gangs of New York\" and then began to realize how great he had been for a long time. This film is a case in point. In fact, it may be the ultimate case. He is quite excellent here, both verbally and physically. He is the consummate actor, perhaps only rivaled by Gary Oldman in our contemporary world.That praise aside, it is a generally good film with plenty of emotion and more than a fair amount of humor. Not humor that makes fun of a handicap, but the absurdity of the situation. We feel for Christy from day one (and the actor who plays him as a kid should be praised as much as Day-Lewis). It is such a predicament to be a prisoner in one's own body.",
            "review_date": "2012-08-02",
            "lang": "en"
        },
        {
            "review_title": "A Chinese opinion",
            "content": "Hard to imagine this film is based on a true story, and how Christy managed to accomplish the miracle is so heart-stirring. Daniel Day-Lewis is a chameleon, really hard to imagine how much effort he had done to create this disabled character. Watching him on screen is a shocking and breathtaking experience.The movie is not so pessimistic as I thought before, the story is kinda bright and intriguing. Christy is not despised by the normals, his life is also colorful and delightful, although we can be aware of the loneliness and the painful fetter through his eyes.One important factor of Christy's success is his mother's support which seems to be more touching, and the unknown actress Brenda Fricker also deserves her Oscar award for this role, this fat little middle-aged woman uses her all to make Christy's dream come true. So lucky for Christy!And Hugh O'Conor is also excellent as young Christy, what a performance for a child! The love story of Christy is very well-done, trustful. Christy wants love and nothing can derive him of the right to love, his crush on the beautiful Dr. Eileen Cole (surprisingly played by Fiona Shaw, I am deeply impressed with her role in Harry Potter series, the loathsome Aunt Petunia, so her appearance in this role is really beyond my mind, but anyway, any woman has her own youth...) is paranoiac and offensive, I do have sympathy for him, love is a two-edged sword, happiness and agony are just next to each other.Btw, Jim Sheridan's works are all good (IN America, THE BOXER etc.) except GET RICH OR DIE Trying', god knows why he chose to direct that crap! Really a career taint for him, what a pity!",
            "review_date": "2007-03-13",
            "lang": "en"
        },
        {
            "review_title": "Powerful, moving true story",
            "content": "Powerful, moving true story. An inspiring tale of overcoming disability and adversity.A movie made by Daniel Day-Lewis' performance, which saw him get his first Oscar. Truly amazing acting. Good support from mostly unknowns. Brenda Flicker received a Best Supporting Actress Oscar for her performance.",
            "review_date": "2020-03-31",
            "lang": "en"
        },
        {
            "review_title": "Day-Lewis is phenomenal but the film shows it's age",
            "content": "Daniel Day-Lewis deserved all the praise he got for this and i was glad to see Brenda Fricker get the accolades too for her outstanding performance. The script and style are of the time and it didnt feel emotionally engaged enough to feel the real frustrations of the characters on screen which made this a very good movie but not in my eyes an exceptional one.",
            "review_date": "2020-04-06",
            "lang": "en"
        },
        {
            "review_title": "an epic tale of defiance,an excellent powerful film",
            "content": "My left foot is an epic outstanding film explaining the life and times of Christy Brown,who had cerebral palsy,a severe disability and had only the use of his left foot,but he was defiant,he managed to become an artist and writer against all the oddsI have seen this film a lot of times and each time I see it,I find it equally brilliant each time.I wonder how did this amazing film not win an Oscer for best picture,It is a shambles by the academy awards. Jim Shirdan is to me one of the greatest directors in the world.the screenplay,the music and anything else is excellent in this film. As the film goes on,you would nearly feel your in the brown household as everything occurs.Ray MacAnally and Brenda Fricker are amazing as Cristies parents and Fiona Shaw is equally brilliant as d.r Eileen Cole,who helps Christy on his battle of defiance.The Irish film industry had noting much to its name before my left foot.My left foot was the start of a wonderful period in Irish film. films so powerful and brilliant such as the field,the crying game,in the name of the father and Michael Collins followed my left foot.these Irish films were regarded so highly around the world and were nominated for multiple Oscers and won some,A wonderful period for Irish film.My left foot is a powerful outstanding film.Daniel day-lewis plays the crippled Christy Brown so well and so brilliantly and the same goes for Hugh o Conner who plays young Christy.To me those two performances are two of the best ever film performances,especially Daniel day-Lewis's performance which I would regard as high as Antony Hopkins in the silence of the lambs. Daniel day-lewis has proved in his career that he is an great actor.this is an excellent masterpiece in film,see it!",
            "review_date": "2006-12-10",
            "lang": "en"
        },
        {
            "review_title": "Film Review And That",
            "content": "Now, My Left Foot is a film about a bloke named Daniel Day Lewis, who's all mental except for his left foot, right? And he has arguments. I can't remember, he had an argument with his Dad or summat, I wasn't watching it properly. But even though he's mental apart from the foot, he does stuff that we could do all over, and he uses that to his best, I think he might write a book or summat or paint. And the moral of this story is, even if you've, you know, only got one foot you can still win prizes because it won the Oscar.",
            "review_date": "2018-10-09",
            "lang": "en"
        },
        {
            "review_title": "Outstanding, Powerful and Realistically human drama",
            "content": "I have seen this film three times now, and each time I see it, it becomes more personal and more emotional to watch.The acting is amazing, which is not hard to believe since it is Daniel Day Lewis, who is an amazing actor. Brenda Fricker is the surprise wonder in it, though. She captures your heart as the mother of a physically disabled boy, who is not able to walk, or speak until he is in his late teens.I can't say enough good things about the movie, but I will stop here. I recommend it to anyone who enjoys movies that are based on actual events, or just enjoy good dramas in general.",
            "review_date": "2005-12-22",
            "lang": "en"
        },
        {
            "review_title": "Daniel Day-Lewis Is Why This Movie's Remembered",
            "content": "At the time, \"My Left Foot\" was the little movie that could. It was hugely popular, and everyone applauded the fact that such a small, independent film could make it all the way to the Oscars.Since then, movies like \"My Left Foot\" are a dime a dozen, so it might be hard in retrospect to understand what all the fuss was about. It's certainly a well made and competent film, but it's clear that the bulk of its success rests on the shoulders of Daniel Day-Lewis, who immerses himself in the role of Cristy Brown, a man living with cerebral palsy. Day-Lewis pulls off the same bit of stunt acting that had won Dustin Hoffman an Oscar the year before for playing a man with autism in \"Rain Man,\" and the Academy followed suit by giving Day-Lewis the same honor.The only thing really separating this film from a big budget Hollywood production is just that -- its budget. In every other way it's just as formulaic as any standard product. That's not to say it isn't a good movie, but it's not a masterpiece.Grade: A-",
            "review_date": "2008-09-04",
            "lang": "en"
        },
        {
            "review_title": "Great biopic about one of the world's most talented authors and painters!",
            "content": "MY LEFT FOOT, in my opinion, is a great biopic about one of the world's most talented authors and painters. The performances were smashing, the soundtrack was great, and the casting was perfect. I thought that Christy (Daniel Day-Lewis) was a very talented man, although I couldn't understand what he was saying most of the time. In addition, when he threw a tantrum, I got a little scared. Also, it's just so sad that he suffered from cerebral palsy. In conclusion, if you are a die-hard fan of Daniel Day-Lewis or like biopics, I highly recommend this great biopic about one of the world's most talented authors and painters. You're in for a real treat and a good time, so don't miss this one.",
            "review_date": "2006-08-17",
            "lang": "en"
        },
        {
            "review_title": "My Left Foot",
            "content": "As far as I know the real guy that the main actor is playing saw his performance and said it was an outstanding portrayal, I'd agree with him. This is a fantastic film about a quite gifted boy/man with a special body part helping him. Oscar and BAFTA winning, and Golden Globe nominated Daniel Day-Lewis plays Christy Browna crippled man with cerebral palsy who spends most of his life on the floor, in a wheelchair and carried by his family. He has a special left foot though, he can write with it, paint with it and hold things with it. He learns to speak later in the film, it is very good for a guy like him. Also starring Home Alone 2's Oscar winning, and Golden Globe nominated Brenda Fricker as Mrs. Brown and BAFTA winning Ray McAnally as Mr. Brown. It was nominated the Oscars for Best Director for Jim Sheridan, Best Writing, Screenplay Based on Material from Another Medium and Best Picture, it was nominated the BAFTAs for Best Film, Best Make Up Artist and Best Adapted Screenplay. Daniel Day-Lewis was number 85 on The 100 Greatest Movie Stars, he was number 20 on The 50 Greatest British Actors, he was number 9 on Britain's Finest Actors, and he was number 15 on The World's Greatest Actor, and the film was number 28 on The 50 Greatest British Films. Outstanding!",
            "review_date": "2006-02-06",
            "lang": "en"
        },
        {
            "review_title": "My Left Foot",
            "content": "Biography of Christy Brown, played by Oscar winner Daniel Day-Lewis who was born with cerebral palsy and only able to use his left foot. The film follows his life with his family from childhood to his achievements as a painter and writer.This could do easily have been a mawkish tear jerker, but thanks to a great script and of course great performances from Day-Lewis, Fricker (another Oscar winner) and Ray McAnally, this is a dramatic, often rather funny, but always grounded insight into the highs and lows of Brown's life and those around him.",
            "review_date": "2022-06-19",
            "lang": "en"
        },
        {
            "review_title": "I never seen such a thing before",
            "content": "Well Daniel day-lewis performance here gave me the best performance I've ever seen in my life so farhe studied the character physically and mentally and focus on physically because the character mentally isn't complicated but to express and show the feeling of the character with crippled body and nearly frozen face, I thought till a near time it would be impossibleBut, he changed my mind and 've shown me new highs I never knew it existsTo be honest this is actors movie because every other element is averaged between normal to weak everything was used to parade Daniel day-lewis performance and I respect this choice because he deserves it and there were supporting characters with great performance and arcThe movie fails to balance between Christy childhood and the rest of the film because his childhood doesn't have a great impact on the story we just could use the vital points not to waste all that time and used it instead in showing us his career development not just to sum it up in two or three scenes.",
            "review_date": "2022-07-31",
            "lang": "en"
        },
        {
            "review_title": "One of the greatest work of acting ever committed to celluloid",
            "content": "My Rating : 8/10I've read a lot of crazy stories about how Daniel Day-Lewis always stayed in character during the making of the film and I absolutely love that level of intensity and dedication to one's craft.This is no doubt one of the best acting performances I've ever seen by the master himself. Most highly recommended.",
            "review_date": "2018-09-12",
            "lang": "en"
        },
        {
            "review_title": "A Remarkable, Wonderful Film!",
            "content": "My Left Foot was the film that broke Daniel Day-Lewis into the spotlight, giving him his first of three Oscar wins and labelling him as one of the finest actors in the world. Day-Lewis is the focal point in a movie that doesn't get enough praise in its other aspects. Why doesn't it? It is a Cinderella story about perseverance and rising about the tough times. This general premise has been done, but My Left Foot does it in a completely different way and has more to offer than crippled man.My Left Foot is based on the biopic of Christy Brown. Brown grew up in an overly crowded family in the slums of Dublin, but it was his extreme cerebral palsy that was the family's biggest burden. The only regular functioning part of his entire body is his left foot. His family comes to realize that he is actually smart, as he is able to write and paint with his left foot. He becomes a success as a painter, poet, and writer, ultimately writing the book in which this movie is based on.What I like about this (and what separates this from other similar films) is that it is less of a rise story and more of a coming-of-age biopic. The Browns try to make ends meet and accommodate Christy's disability to everything. Mr. and Mrs. Brown are very admirable. Brenda Fricker does a dynamite performance as Mrs. Brown--a role which earned her a well-deserved Oscar. She is very loving and supportive of her son, and can see beyond his disability. When Christy first writes, it is touching and inspirational. As Christy becomes more of a success and the Browns get out of poverty, it is such a joy.1989 was an excellent year for movies. Believe it or not, Daniel Day-Lewis' Oscar win was not much of a stretch. Tom Cruise in Born on the Fourth of July and Kenneth Branagh in Henry V were just as deserving as Day-Lewis. But it was Day-Lewis that was the victor, in what is still his best performance. As I said earlier, Brenda Fricker also won, but she was a deadlock--nobody in the Best Supporting Actress category was close. These two are the acting highlights, but the entire movie as a whole is so perfect. We have the real Christy Brown to thank for that.4/4",
            "review_date": "2016-02-29",
            "lang": "en"
        },
        {
            "review_title": "painstakingly beautiful",
            "content": "Saw this film on DVD yesterday and was gob-smacked and flabbergasted. The unaffected acting of DDL just blew my mind, and I was surprised by the whole cast and its superb acting. All of the character were so authentic to me, I really took DDL for Christy Burns and Brenda Fricker for his mom. Go and see it! You'll cry your heart out, but you'll experience a wonderful catharsis! Besides, it teaches you one important lesson: Determination is everything. You may be a cripple in the poor suburbs of Dublin, but when you are headstrong enough you will have no problems at all. If you can only operate your left foot you are still good enough to be a painter or a writer. The worst thing you can do when you are mentally challenged is to indulge in self-pity. It won't get you anywhere and the only person who'll pity you will be yourself.",
            "review_date": "2006-02-12",
            "lang": "en"
        },
        {
            "review_title": "A powerful film with outstanding performances all around",
            "content": "Based on Christy Brown's autobiographical novel, this endearing film tells the story of his life, him being affected by cerebral palsy and being considered basically not a person by everyone including his mother. Amazingly, he teaches himself to draw and write using his foot, which is the only part of him he can control. An amazing story of courage with a truly amazing and unforgettable oscar winning performance by Daniel Day Lewis. 9 of 10",
            "review_date": "2001-05-03",
            "lang": "en"
        },
        {
            "review_title": "Daniel Day-Lewis Will Captivate You in This Christy Brown Biography!",
            "content": "My Left Foot is a brilliant film. It is a small Irish movie about a gifted man being dealt a bad hand with the crippling disease cerebral palsy. What I like about Jim Sheridan's flick is that he did not set out to make an inspirational or sentimental film, yet it does inspire. Christy Brown is a real figure who, despite his late start, became an artist and author who left behind works and of course inspiration for people in similar situations. Daniel Day-Lewis delivered some successful performances, but he really became known to Hollywood with his Oscar-winning performance. Dustin Hoffman won the previous year for his Rain Man performance, one that tackles similar disability issues. As great as that performance was, Day-Lewis took it a step higher and became the character. In addition, the film manages to be funny. There are some scenes that had me laughing out loud. Christy playing goalkeeper in a soccer match is one of those scenes.Just for the heck of it, I tried to imagine myself typing this review or writing words or even painting pictures just using my left toes. The thought of myself doing so made me almost lose my mind. It shows the perseverance of this man, because any lesser man would have given up way, way sooner. In fact, as gifted as Day-Lewis is with his acting talent, many of his scenes had to be filmed through a mirror because he could get his left foot to replicate the actions of Christy's. Shane Connaughton's and Jim Sheridan's screenplay made it especially clear that Christy Brown was no saint. Undeniably gifted but no Helen Keller. He is just one of those rogue Irishmen with a foul mouth with the only difference is that he has a disability. From start to finish, Sheridan gives a thoughtful evaluation of a complicated man. He does not create an inspirational or sympathetic film, yet people can find those things in Brown's words, actions, and legacy.The movie tells the story about Christy Brown (Daniel Day-Lewis) who was born and raised in Dublin. The story chronicles the rise of Christy as a child (played wonderfully by Hugh O'Conor) needing around-the-clock care to becoming a successful poet. He grew up thirteen siblings and a less-than-supportive father (although there is a great scene where he admits he will not institutionalize no child of his). Mrs. Brown (Brenda Fricker) is very supportive of her son. With the inability to speak as a child, he surprised everyone except for his mother when he proved he was acutely aware of everything that was happening around him. He used a paintbrush with his two left toes to express himself. His speaking ability is helped thanks to the services of Dr. Eileen Cole (Fiona Shaw), a therapist. As seeks independence, his mother worries about him because of people that would take advantage of him.If people did not know who Daniel Day-Lewis was, now they know. As a method actor, his craft became him. I was enthralled with the nuances of his performance. He was funny when he needed to be, and a jerk when he needed to be. He was an alcoholic as evident in the opening scene where a whiskey bottle is slipped into him at an awards ceremony. Like all men, he wanted to find love. He fell in love with his therapist, and you could feel the heartbreak in some emotional scenes when he discovers Dr. Cole is going to be married. Brenda Fricker never gets much recognition, so it can be surprising to learn she won an Academy Award for her brilliant performance. She is the film's moral conscience and a good influence on her son.My Left Foot is a film that will captivate you because of Daniel Day-Lewis's and Brenda Fricker's masterful performances. It is also proof that Hollywood can back small films for the big awards. It did not win Best Picture, but there was a consensus several years ago that voters admitted if given the chance to change picks, they would choose this film to win. I would have agreed with the decision. I liked how Sheridan made the film without being overly sentimental and isn't afraid to show a bad side of a supposed \"inspiration.\" As a smaller British film, this is the type of film that is not made anymore for theaters. If anything, it is proof that Day-Lewis is an acting legend.My Grade: A-",
            "review_date": "2022-01-16",
            "lang": "en"
        },
        {
            "review_title": "The performance of Daniel Lewis can in my opinion is better than the own film",
            "content": "I watched 6 movies of Daniel Day Lewis including My Left Foot , and of those six only one I thought it was great , the rest was good, nice and average , I expected more from My Left Foot , more is a cool movie , even the movie does not be long, it left me a little bored , the initial moments are interesting , showing the origin of the main character , the acting is good , highlight to Daniel Day-Lewis that their performance is usually better than the film itself , the direction is competent , the soundtrack is very good , photography and beautiful , the script has many problems , some rather superficial dialogues , more My Left Foot is a cool movie , with a very exciting story . Note 7.1",
            "review_date": "2016-06-28",
            "lang": "en"
        },
        {
            "review_title": "Unbelievable performances, mediocre scenario",
            "content": "This could be a 10 if it wasn't for the quite predictable and hollywood-ish scenario. Daniel Day-Lewis confirms its position as one of the leading actors of our time (why not THE leading may I ask) and the rest of the cast stand in a very high level. I personally was impressed with Hugh O' Connor who played Christy Brown as a child. The very first scene I watched him was really strong. Wow.",
            "review_date": "1999-08-09",
            "lang": "en"
        },
        {
            "review_title": "A phenomenal performance",
            "content": "If you ever want to watch an incredible acting performance (that is the ultimate showcase of method acting), then check out My Left Foot. Daniel Day Lewis is incredible throughout and well deserving of his Oscar here. Hugh O'Conor was also incredible (and somewhat under-appreciated) as the young Christy Brown.The pigeon lady from Home Alone 2 (Brenda Fricker) has probably played the kindest characters I've seen in film. Any scene with her and Daniel Day Lewis was instantly heartwarming. The film itself was quite inspirational, without shoving it down your throat or being too sentimental. Emotional me surprisingly didn't shed a tear, which is probably testament to the film not dwelling on sentimental, cheery sweetness.Some of the downsides were that it took a while for me to get into it. It was mostly bleak and quite grim in both tone and lighting choices which didn't always make it easy to watch. The ending, along with some of the storyline choices didn't always float my boat either.My Left Foot has definitely given me a whole new appreciation for not only the art of acting, but Daniel Day Lewis and Christy Brown themselves. It makes me want to go read the book it's based on now.Recommend for those after something a little inspirational, Irish or that is simply a showcase of stellar acting.",
            "review_date": "2019-12-09",
            "lang": "en"
        },
        {
            "review_title": "My Left Foot Puts It in Its Mouth **1/2",
            "content": "Despite the brilliant performance of Daniel Day-Lewis, \"My Left Foot\" is a very disappointing film.In winning the Oscar, Lewis showed great depth and his mannerisms depicting a frustrated man paralyzed from cerebral palsy was amazing.I can't believe that Brenda Fricker was voted best supporting actress for her role as his devoted mother. Fricker showed absolutely no emotion here. In addition, she looked quite frumpy at the beginning of the film only to become younger looking as the picture went along.Even though he was phenomenal here, there were some parts that it was impossible to understand Day-Lewis. I know that he was talking as a victim of cerebral palsy, but the comprehension remained difficult.This language barrier had an effect with his alleged romance with the woman he ultimately married.Yes, the film is inspirational but it could have been a great deal better.",
            "review_date": "2009-03-01",
            "lang": "en"
        },
        {
            "review_title": "Nothing special",
            "content": "This film strikes me as little more than typical Oscar bait. A man disabled with cerebral palsy grows up in a poor Irish family. His father is hard and critical and his mother is loving and shoots words of inspiration at him at measured intervals. The film shows us that the disabled can do everything a normal person can do, like play soccer and get into barfights. Eventually he grows up to become a respected artist and author. Of course, the story is true. It's been done a million times before and since, and I swear it's won an Oscar every single time. This one won two, both for acting, one for the actress playing the mother (Bredna Fricker) and one for the lead (Daniel Day-Lewis). I'm a big fan of Day-Lewis. And, honestly, his depiction of cerebral palsy is spot-on. But so what? I don't particularly think playing a disabled person is difficult, and the actor has done much better elsewhere. In fact, he's no better here than the actor who plays him as a boy. Sheridan's direction is so hacky; he deserves to be making phony biopics for rappers who won't be remembered five months after the picture comes out.",
            "review_date": "2006-03-31",
            "lang": "en"
        },
        {
            "review_title": "Everything in this film is exactly how you would hope to see it.",
            "content": "I watched this film in shire joy.This is possibly one of the best films of all time. It has a timeless value, you can get so much out of it it's amazing. There are parts that are moving, funny, and just great.All aspect are spot on, the portrayal of the story is perfect, every detail is 100% genuine, even small Irish subtleties have been covered.The use of low and high shots gives two great views on Cristy (look out for that).Daniel Day-Lewis's performance is incredible. I've never seen an actor do that, ever. It really is amazing.And it's so great to watch, it flows so well, it's probably the closest thing yo can get to real life experience. I love it.If you haven't seen it, you should see it. Don't have any doubts on it, there is something there for all.",
            "review_date": "2006-09-12",
            "lang": "en"
        },
        {
            "review_title": "The movie that rightfully defines Daniel Day Lewis's consummate commitment to method acting",
            "content": "Would it not be highly upsetting if you are thought to be mentally slow but were physically impaired in reality? Christy Brown, as a kid, was treated like an animal, laid on one corner, fed porridge everyday and taught rudimentary things at an age where his mind was far beyond the basics. A frustrated Christy, in one of the film's important scenes, takes a chalk and begins writing mother on the floor. His family stares in wonder; his mother is overwhelmed with joy while his 'barbaric' father is proud and regards his as a true Brown, as if he were some street vermin lifted by the family before. This brings to memory another scene where Christy becomes aggravated when his overtures of love are not reciprocated. He dislikes 'platonic' love, something that he has been receiving all the time. In fact, Christy's pain can be understood by not only people with cerebral palsy, but also by others, for example the old people. My grandmother got a similar treatment when she began aging and was ailing. Many a times, this spoon feeding annoyed her and she would refuse to comply. Earlier in the film, a stout, caring lady is in charge of Christy and the stairs is not an obstacle just for Christy, but also for the lady. Christy Brown, however, overcomes many hurdles and became an acclaimed painter, author, poet and an alcoholic Irish rascal! And although without support from family and doctors, he wouldn't have been all this, the true instrument that brought him this success was his left foot. And this left foot became the novel of the same name.Daniel Day Lewis doesn't perform Christy Brown; he lives and breathes Christy Brown. His spectacular, almost detrimental dedication towards his character makes us completely unaware of his acting. Daniel's eyes are his most powerful tool; they are as deep as Lord Krishna's mouth (it is believed that when Lord Krishna opened his mouth the entire universe could be seen inside it). It is one of the finest embodiments of a character on screen. But when one talks of a complete performance, I think that compared to the psychology of the character, Daniel has a harder physical hurdle to accomplish. The reason may be that Christy Brown himself was not a supremely complex person; his indefatigable determination was the reason of his fame and glory. What I mean to say is, it isn't a highly complex performance in its entirety (apart from the mental anguish at being physically handicapped and not finding true love). That I would give to his performance in 'There will be Blood' which is thoroughly majestic in all possible ways. What is Daniel's definitive performance? Most probably his role in TWBB. Which role defines his consummate commitment to method acting? My Left Foot would be the most appropriate answer. Brenda Fricker, Kristen Sheridan and Fiona Shaw provide good support to the film. The rest of the characters are minor and help in filling roles rather than carving individualities out of their characters.The movie itself is a one-time watch – it isn't much layered in terms of story but mainly takes the viewers through the painter's bourgeois life in Ireland. Some of the moments in the movie are unapologetically shown, for example, Christy's childhood where he is treated like a caged animal kept in one dark corner. The movie isn't a high octane drama but a well tempered biopic. Though I did wish the scenes held more dramatic quality, the breezy pace was well suited for most part. In fact, when I think of Christy Brown now, I get not a commiserable face but a jovial, almost likably wicked one. The last fifteen minutes look more like a 'film' with its almost corny nature but I think that was to deliberately done to give it the 'movie' quality.Do not watch My Left Foot expecting an unforgettable movie experience but watch the film as it is, simple and frank with uplifting performances.My Rating: 7 out of 10",
            "review_date": "2012-02-28",
            "lang": "en"
        },
        {
            "review_title": "Good film, amazing acting performance",
            "content": "If I were to heavily praise 'My Left Foot', there would be a 95% chance that I'd be heavily complimenting the astonishing performance by Daniel Day-Lewis more than anything. It is a great story with some excellent writing based on a very inspirational man named Christy Brown, but said man is captured so expertly by Day-Lewis that everything else great about the movie is easily ignored.Regarded as being one of the most 'real' actors of all-time, Daniel Day- Lewis reportedly stayed in character throughout the filming process, some may criticize the approach, but when you watch him on the screen, you can tell that all the hard work paid off to the fullest extent. He captures the discomfort, frustration and loneliness of a man with cerebral palsy, and the passion of a man labelled as 'gifted' but is far more 'gifted' than people really know.From top to bottom, 'My Left Foot' is a huge recommendation for any movie fan, and a definite must-see for any aspiring actor.",
            "review_date": "2013-05-02",
            "lang": "en"
        },
        {
            "review_title": "Worth watching for more than just Daniel Day-Lewis' performance",
            "content": "Jim Sheridan's 1989 film adaptation of Christy Brown's autobiographical novel My Left Foot is famed for Daniel Day-Lewis' central performance as Brown, a successful artist born with cerebral palsy who could only fully control his eponymous extremity. And whilst it is true that Day-Lewis' acting is as impressive as everyone always says it is, the film has far more to recommended it than that alone.My Left Foot follows Brown's life from birth to the conclusion of his autobiography, which Sheridan adapted with Shane Connaughton. Unable to speak at all as a child, Brown is dismissed by his nevertheless loving parents as a simpleton, until the day he finally manages to write the word \"mother\" on the floor using a piece of chalk held between his toes. The story then charts his life as he grows to adulthood, learns to speak (albeit with difficulty) and gradually achieves success as an artist with help from his large family and Eileen Cole, a doctor specialising in cerebral palsy who helps Christy achieve his potential.It all sounds terribly sentimental, but the film rarely is: probably because of its autobiographical source, the film never invites the audience to pity Christy, instead making his constant struggles to overcome his disability relentlessly uplifting. At the same time, the audience is presented with a warts-and-all portrayal of a man capable of being obnoxious, rude and occasionally throwing massive temper tantrums. He is, in short, a man rather than simply a character, and one who falls in love with his doctor and then behaves appalling when he finds out she is engaged to be married, and who develops a life-long dependency on alcohol, which doesn't bring out the best in him. Indeed, not just Christy but every major speaking character in the film - including Christy's parents - is believably flawed.Day-Lewis is indeed remarkable as Christy, from the opening shot of him placing a record on a turntable and lowering the needle onto it with one foot, a feat that the actor reportedly saw as a challenge. Despite a long and illustrious career of giving award-winning performances, Day-Lewis' immerses himself in the role so thoroughly and so naturalistically that it is impossible to imagine anybody else playing Christy. Nobody that is, except for Hugh O'Conor, who plays Christy as a boy and also deserves plaudits for his equally realistic portrayal. He brilliantly conveys the young lad's frustration at being dismissed as a moron and his desperate attempts to communicate with his family.Sheridan assembles an impressive supporting cast, with Ray McAnally very convincing as Christy's gruff father Paddy, and Brenda Fricker equally so as Christy's mother, whilst Fiona Shaw is great as Eileen Cole. Sheridan has a clean, unflashy directorial style that allows his actors to shine without distracting from their performances and it does precisely that. He also makes excellent use of the location filming, mostly shot in Bray, which further roots this true story in the real world, whilst Elmer Bernstein's powerful soundtrack underscores the storyline without feeling emotionally manipulative.My Left Foot is a biopic and those aren't to everybody's taste, but for anyone uninterested in the life of Christy Brown, it is still worth watching as a showcase for some incredible acting and a finely-honed piece of filmmaking.",
            "review_date": "2021-04-11",
            "lang": "en"
        },
        {
            "review_title": "Inspiring true story.",
            "content": "This is the only movie that Entertainment Weekly gave an A+. If that is not enough to make you want to see this movie, I don't know what will. I first knew of this story from reading a section of the book in school-in which the main character, who struggles with cerebral palsy, first writes with his left foot. In chalk, he writes: M-O-T-H-E-R. His name is Christy Brown, and he goes into further detail of how he overcomes his disability.As a person on the autism spectrum, I found this to be very inspiring. Here is a person who learned how to live life, even if most of his body is crippled. Even if you don't have a disability, there is no doubt in my mind that this movie will inspire you. It inspired me. It's one of the best movies on overcoming obstacles I have ever seen, and one of my favorite movies in general.",
            "review_date": "2018-09-13",
            "lang": "en"
        },
        {
            "review_title": "An outstanding film: inspirational, uplifting, exhausting",
            "content": "I've just returned from a showing of \"My Left Foot\" at our public library. What an emotional experience -- I feel drained and uplifted.It's the story of Christy Brown, Irish writer and painter, and based on the author's autobiographical \"My Left Foot.\" Christy was born with a form of cerebral palsy such that the only limb he had good control of was his left foot. Doctors advised his parents he was hopelessly mentally retarded but his mother didn't give up on him and, somewhat as Annie Sullivan had done with Helen Keller, helped him achieve a breakthrough in which he learned the alphabet and then to read, write, paint, and speak so others could understand him.This film won Academy Awards for Daniel Day-Lewis (best actor) as well as best supporting actress for the woman playing his mother; it also received Oscar nominations for best picture, best director, and best adapted screenplay.As a retired clinical psychologist and family therapist, while many films may entertain me, many also often leave me having to overlook gross fictions or improbabilities in realistic psychological reactions.Not this film--it was absolutely \"spot on\" in portraying Irish parental roles & behaviors (see, e.g., typical Irish families in McGoldrick's \"Ethnicity & Family Therapy\") as well Christy Brown's uneven emotional maturation--some immature personality reactions that were even further amplified by his picking up traits of his father.The film presents the greater truth while changing certain sequences in his development (painting & writing) and condensing several important people into one person, for the sake of telling a coherent, believable story, unburdened by small, less important actualities that would be distracting to include. (See Christy Brown in Wikipedia for more accuracy.) The DVD version we saw had English subtitles that were a big help in understanding both Christy's speech & all of the Irish brogue (this pix was made in Ireland with Irish actors); the initial release of the film may have lacked CC. (If you see this on DVD, do enable that CC option.)The performance by Daniel Day-Lewis is one of the greatest, completely believable acting jobs I've ever seen. Christy's family members felt he was Christy reincarnated and cried in recognition. Truly magnificent, outstanding, superlative.(\"My Left Foot\" bears some similarity to a more recent film, \"The Diving Bell & the Butterfly,\" in that each portrays the life of a real person successfully surmounting the imprisonment and isolation of extremely severe physical limitations. And in doing so, it resonates with William Ernest Henley's \"Invictus\" which begins: \"Out of the night that covers me,//Black as the Pit from pole to pole,//I thank whatever gods may be//For my unconquerable soul.\")ETA (4-23-12): Recently seeing it again has impelled me to read several books about Christy's life: 1) Christy's book, \"My Left Foot,\" gives a more intimate perspective on his struggles, his life, family, and some significant others up to the time he finished writing it at age 22. GREAT book.2) Also, Anthony Jordan's paperback, \"Christy Brown's Women,\" provides a wonderful, in-depth view of Christy. It does this often through Christy's own words: extensive quotes from long revealing letters he sent mainly to his social worker & his speech therapist; both were substantially & critically important in his development and he felt particularly close with both. Fascinating. It also covers some of his 12 year relation with Beth Moore; he and Beth planned to marry.3) A more recent perspective, covering many details better (and very few less well) than Jordan's, is Georgina Hambleton's \"Christy Brown: The Life that Inspired 'My Left Foot'\". This has much more about his 12 year relationship with Beth Moore who was to marry Christy. It also covers the woman he did marry, Mary Carr, who turned out to be a manipulative alcoholic, unfaithful, a bisexual prostitute, and probably physically abusive to Christy and instrumental in his death. A worthwhile chapter discusses the making of the eponymous film.While all 3 books have some overlap, each one provides a unique, distinct perspective from which to better understand Christy's life, his work, his relations, his ambitions -- and his personality.",
            "review_date": "2009-06-19",
            "lang": "en"
        },
        {
            "review_title": "Incredible.",
            "content": "Daniel Day-Lewis in there brought me to tears. He is one of the finest actors ever and this is one of his best performances, though, in all honesty, what performance of his is not? The only real flaw in the film is the fact that he looks to be about thirty (which he was) when he was like 17 and 18 in the film. Daniel pulls it off though. Extra praise goes to the young Christy, who looks and acts just like Daniel did exscept for a time or two when his CP fades. Overall an incredible film that is worth watching just for one of the finest performances ever.",
            "review_date": "2003-03-31",
            "lang": "en"
        },
        {
            "review_title": "Daniel Day-Lewis is GOD!!!",
            "content": "Daniel Day-Lewis is GOD!!! Now, his work as Christy Brown, an Irishman born with cerebral palsy, who could control only his left foot in 'My Left Foot, can be explained in only one word -- GODLY! 'My Left Foot' is a superb film, one of the most inspiring and greatest biopics to hit the Silver-Screen. 'My Left Foot' has Daniel Day-Lewis man... I so, so, so, love him! He is the GOD of Acting!It would be injustice if I can only the praise the Lewis, Brenda Fricker as Mrs.Brown delivers a power-packed performance. She's outstanding in each and every frame she appear in, and this easily ranks amongst the best performances by an actress ever!'My Left Foot' won Lewis the Best Actor and Fricker for Best Supporting Actress. Do I need to say anything else? Watch this cult film right now!",
            "review_date": "2010-04-01",
            "lang": "en"
        },
        {
            "review_title": "Stunning",
            "content": "For one... I can't believe it took me over 10 years to actually sit down and watch this. Basically because I really didn't know what this film was about. In 1989, I was 12... I don't think I may have been interested in this kind of film, but who knows (I did watch 'Rainman' when it came out, and loved it. It made me have a sense of awareness & compassion for what the disabled go through, at a young age... and I had never heard of Autism before that. I now have a nephew with Autism, and I myself, have developed a severe case of epilepsy, which is also a disability.) Considering I have a disability, I have a taken an interest in watching any film on the disabled.However... the fact that Daniel Day-Lewis was in this film, REALLY HELPS... because I think he's absolutely fabulous! I don't think I've ever seen a crappy movie with him in it!  The fact that Jim Sheridan was responsible for this (and the fact that I thought \"In The Name of The Father\" & \"The Boxer\" were absolutely superb films despite how aggravating the scenarios were in the films... but thats just what made them fantastic... the fact that they were so realistic, and gave you some incite of what the hell goes on in Ireland!) Take it from Sheridan... someone who is Irish... don't let some Hollywood piece of rubbish tell you a bunch of fallacies.  The fact that Sheridan uses non-traditional actors/actresses in his films also adds to the realism. And the fact that Daniel Day-Lewis isn't overrated, and the man can actually ACT (and by his stunning performance in this film) I was really blown away by him.  I fully understand why he had gotten the Academy award that year, and the same goes for the woman who played his mother.The story of Christy Brown was told in a very tasteful, informative, compassionate, & non-exploitive way.  It is a triumphant story of his accomplishments... and I also being an artist... and having epilepsy (and the fact my medication gives me tremors) I have an extremely hard time doing my artwork... but Christy... made me feel like I was being lazy! :) His artwork was beautiful... It made me happy! It was so aesthetically pleasing... and so personal.  I would love to read his writings to get a better incite on him.Another individual I became interested in after watching the film based on his accomplishments is the pianist David Helgoft. The movie \"Shine\" was based on him, and Geoffrey Rush was EXCELLENT in that as well. Both films were as good as one another... and I would definitely suggest that to anyone who liked \"My Left Foot.\"Rating 10/10",
            "review_date": "2001-08-15",
            "lang": "en"
        },
        {
            "review_title": "Inaccurate and unconnected",
            "content": "The name suggests this the story of Christy brown but the film is far away from reality. The character of Dr. Eileen Cole was completely fictional . There was no such love story in Brown's life . Nothing much was shown about the difficulties that Brown faced due to cerebral palsy . Nothing much about his childhood and how his parents brought him up. The film ended immediately after his marriage because people want happy ending. But in his real life, her wife made his life miserable .Even if we forget about accuracy, this film still stinks. It's not a biography , it's a collection of some incidents of his life which hardly have any connection. It is supposed to be a story of a man with cerebral palsy but nothing much is shown about Brown's struggle due to that disease. Nothing about the equipments used by the doctors. And not many scenes between Christy and Eileen .Everybody knows Daniel Day Lewis' acting was great. It's surprising that Hugh O' Connor remained unnoticed . Otherwise, a huuuuge letdown.",
            "review_date": "2018-07-05",
            "lang": "en"
        },
        {
            "review_title": "A perfect tribute to a true legend by a true legend!",
            "content": "One of the best performances by an actor in a leading role and an actress in a supporting role. Christ Brown is a person born with cerebral palsy. He is the son Mrs. Brown(Brenda Fricker) and Mr. Brown, a poor yet large Irish family in which Mr.Brown is the sole bread-winner. He is used by his brothers to steal coal to keep the family warm in the fall and since he's a quadriplegic he isn't a part of the fun the boys of his age have. Despite his disability, he is a supportive brother and an intelligent person. His mom finds out he has the talent to paint with his left foot and even write and helps him hone his skill over the years. He gets recognition for his works and is later infatuated by a dame. He becomes a curmudgeon and irritable man over the years but that doesn't stop him from writing his auto-biography and paint.Daniel Day-Lewis gave the performance every actor could dream of; such a powerful performance. He tries to move forth on his back when he trips from his wheelchair, paints with his left foot with others limb stationary, has spittle flowing all over his face when he tries to yell or speak aloud and most importantly has brought hope to those with the disability and the pain and struggle endured by Christy Brown. An incomparable and impeccable performance.",
            "review_date": "2012-05-17",
            "lang": "en"
        },
        {
            "review_title": "The reason why many people hate this movie is because they don't know people with cerebral palsy",
            "content": "My older sister was born in March of 1985 and has cerebral palsy. in her 22 years of life, she has seen nothing but the walls of our house and her school which is also occupied with other disabled kids. i have been the butt of everyone's jokes because my sister is disabled, and i still think to this day that nobody is, or ever will give a damn about her and her condition. Then i saw this film.I knew what Christy's family was going through. but they were lucky. Christy could talk, he could communicate, and he had artistic skills. my sister can walk, but she can't utter a word, and she can't use her hands to do anything but grab onto things. but this film made me realize there were other people in the world like my sister, and the ending (to tell the truth) made me cry. AND I'VE SEEN SHAWSHANK!!! This film is seriously underrated, and it shouldn't. This movie tells people something. that people should be proud of their own lives. thinking you can't write well? this guy wrote with his foot. thinking you're not attractive? this guy got turned down by lots of girls, because of his condition. not the fastest runner? christy couldn't even stand up.My point: Parents of young children, i suggest your children watch this movie with you, so they'll know the next time they see someone on the street in a wheelchair, they don't stare at them like they're aliens. My sister got millions of stares, and it breaks my heart to think that this is still happening to many people. This film will teach people, that people who might not seem \"normal\" are people too. 10/10",
            "review_date": "2007-12-01",
            "lang": "en"
        },
        {
            "review_title": "Daniel Day-Luis, that's enough, isn't it?",
            "content": "A wonderful work by Daniel de Luis, he played with all his beauty and influence and changed my way of thinking about the world. I wonder how he was able to play the role of a paralyzed person with speech problems so well. It was the best biographical film I have ever seen and I will never see such a beautiful and impressive work, like this. I wish he did not say goodbye to acting so that we can see his brilliant performances again.",
            "review_date": "2022-02-16",
            "lang": "en"
        },
        {
            "review_title": "Uplifting story of human struggle that stays humble",
            "content": "There aren't many overcoming-the-odds stories quite like that of Christy Brown. Born with cerebral palsy in 1930s Dublin, his parents thought his handicap was mental as well as physical. Though eventually properly diagnosed, Brown, in a lower working-class family with nearly 20 children, had to push himself just to be appreciated by his family. Through the use of his only fully-functioning limb, his left leg, he taught himself to write and paint, both skills he developed expertly. But what makes the film version of Brown's autobiography \"My Left Foot\" such a great retelling is its humility. Both director/writer Jim Sheridan and star Daniel Day-Lewis have managed to tell this story in a way that doesn't scream for attention and resort to melodrama. Cheesy struggles and scenes of frustration as well as glorious moments of minute victory are easy pitfalls of a story so miraculous, yet \"My Left Foot\" stays real and intrinsically inspired.Day-Lewis is the easiest to highlight. Playing anyone with such serious physical impairments has to be a demanding task. Not only does Day-Lewis give us a very complete picture of Christy, but he also manages to chronicle the growth, improvement and inner change of the character in different stages of his life. He plays Christy at 17 when he had limited language capability and was emotionally volatile just as crisply as he does the intellectually learned Christy who struggles to cope with why he can't find non-platonic love. The latter theme is the film's strongest and it would've been nice for Sheridan and co-adapter Shane Connaughton to really flesh that out. Regardless, Day-Lewis gets us to understand and sympathize with all those elements, giving a performance that's so believable you often don't have time to think \"wow, he's such a great actor.\" Those are the most commendable performances.Equally important but through more subtle means is Sheridan's work on the film. This story is about day-to-day life and struggles. Although Christy has such a unique set of circumstances hampering his life, his struggles are not unlike our own and Sheridan grasps that concept completely. Christy struggles with love, parental attention, questions of self- worth and capability. His struggles are just more physically manifested (literally and figuratively) than ours. Sheridan gives us moments that capture the spirit of the large Brown family and Christy's unique place in it. The drama evolves naturally when tensions are highest and the humor comes in much the same way. The dinner scene when Christy learns that his doctor/teacher -- the woman he loves -- is going to marry his brother Peter is the film's finest example of both Day-Lewis and Sheridan's efforts. It's built up to so well by Sheridan that it comes out when we're ready and Day-Lewis takes us from there with his stunning work.The other strong component of the film is Brenda Fricker as Mrs. Brown. I did not know she'd won the Oscar, but there was something about her performances as Christy's loving and wise mother that just screamed Oscar-worthy. Her love for Christy and constant fighting for him just seems so convincing and heartfelt and she earns a lot of sympathy given her situation.The emotional punch of the film given the story is surprisingly minimal. Perhaps that was part of the sacrifice of trying to create a film that feels organically human. The two should be reconcilable, but I imagine it's challenging to tell a story that feels true-to-life and one that provides enough dramatic moments to take our emotions on a roller coaster. The choice to downplay the latter was definitely the wise one for \"My Left Foot.\" Brown's circumstances speak for themselves -- they don't need to be squeezed for weightier dramatic impact.~Steven CVisit my site moviemusereviews.com for more",
            "review_date": "2009-12-16",
            "lang": "en"
        },
        {
            "review_title": "Reel Look: My Left Foot",
            "content": "\"This is Christy Brown, my son. Genius.\" Down-to-earth, funny and surprisingly entertaining while avoiding the lachrymose, this 1989 Irish drama film 'My Left Foot', or 'My Left Foot: The Story of Christy Brown', is based off of the said character's own 1954 autobiography, depicting the constant daily struggles of an intelligent individual imprisoned in a body with cerebral palsy. From newcomer director Jim Sheridan and Shane Connaughton adapting Brown's story to a screenplay, we see in the span of almost two hours the life of a uniquely astonishing man unfold from a boy to maturity to well-respected and celebrated Irishman. But does this film truly capture Brown's story as a genius despite him being a spastic quadriplegic? Let's take a look.As a lad, Christy could not walk or talk, but still received love from his family, especially his caring, steely mam Bridget (Brenda Fricker, in an Oscar-winning role) while the rest of the clan sees him as nothing but a vegetable. But one day a miraculous even occurs when the now five-year-old Christy (Hugh O'Conor) sees his mam fall down a flight of stairs one day as she is in labor, and is the only witness as well. He is however able to get the attention of some neighbors. His unpredictable, alcoholic da (Ray McAnally, who died before the film was released in his last great role) never really believing in his handicapped son, becomes a supporter when he sees him using the eponymous appendage (the only body part he could actually control), to scrawl the word 'mother' on the floor with a piece of yellow chalk.Later on in the film, since time has passed, he is now played by Daniel-Day Lewis (a brilliantly deserved Oscar-winning beautifully bravura performance for such a demanding, meticulous role). He masters each nuance of facial expressions, precise movements of a twisted, rigid body and impaired speech flawlessly, and eventually overcomes his infirmity-with no apprehension of determination or ill will-to go on to become a painter, poet, author, find love and eventually marry. With his only controllable limb, Christy paints, scores goals in street soccer, lays bricks, fells an adversary in a pub brawl, attempts suicide and writes his autobiography. To see the world through the eyes of a man undeterred from his permanent state is confounding and yet we can not look away. The zeal in his soul ridden with angst, wonder and the will to laugh at life's circumstances, all the while longing to be accepted in society has, throughout his life shown in the time allotted, never dwindles. From examples as a man to flirting with his speech therapist (teaching him to swear when others are not wanted) to the innocent wonder as a boy with his brothers and sisters partaking in sweet, spooky Halloween street festivities, his outlook remains the same throughout his days while as those around him come to eventually laud his triumphs and travails as a unique and extraordinary human being.Paralleling with 'Rain Man', the same elements are here, but it is also here where we witness a more sentimental depth of human nature. It reveals a painful yet poignant portrait of an essentially paralyzed artistic character that at the film's conclusion we can do nothing but stand and cheer. It deviates from the standard Hollywood story to deliver dynamic realism, robust truths and an overall tour-de-force experience from watching the miraculousness of life within a man and his spirit, unafraid in beating the odds to pursue his visions and dreams. Though the real Christy Brown passed on at only forty-nine, this is truly one of those films that will live in the mind and heart long after one sees it.",
            "review_date": "2015-03-17",
            "lang": "en"
        },
        {
            "review_title": "a showcase for Day-Lewis",
            "content": "Actor/chameleon Daniel Day-Lewis gives an award-winning performance as Christy Brown, the physically disabled (but mentally gifted) artist and writer, who overcame both a debilitating handicap and the social disadvantage of a working-class environment using the only functioning limb at his disposal. Most of us are content to achieve a quarter as much with four times the equipment, but Christy had the advantage of an able mind inside his stubbornly unresponsive body. His quick wit and passionate, opinionated nature, combined with the effort needed to express even one syllable, makes every word count in the spare, unsentimental screenplay, and Jim Sheridan's direction is admirably restrained (surprisingly so, for a newcomer). The sturdy Irish household supporting Christy is well-stocked with fine actors, but the spotlight is clearly on Day-Lewis, who shows his versatility in the opening scene by expressing a range of emotions with just one bare foot in close-up. The film is an honest tearjerker, almost (but not quite) spoiled by the unrealistic neatness of the framing device, in which Christy trades comic banter with his future wife while she reads his memoirs, setting up the flashbacks.",
            "review_date": "2010-12-17",
            "lang": "en"
        },
        {
            "review_title": "best acting I've ever seen. period.",
            "content": "Daniel Day-Lewis is the most versatile actor alive.  English aristocratic snob in A Room With a View, passionate Irish thief in In the Name of the Father, an impudent, violent butcher in Gangs of New York (in a performance ten times stronger than Adrian Brody's in the Pianist) and as the outrageous Cristy Brown with cerebral palsy in My Left Foot (just to name a few). His roles all influence eachother, but each is seperate, and utterly unique. He changes completely, with each character he takes on.   And I'm beginning to believe that he can act as anything.  Anything.As Cristy Brown he is stunning.  He does not ridicule the character, and he does not pity the character.  A difficult achievement.  And Cristy Brown comes to life.  A smart man.  An outrageous man.  Human.This movie, despite small scene-transition faults and the like, is an inspiration.  Yes, it's predictable.  But is it stupidly sentimental?  No. I laughed.  I cried.  Not a single moment of cheese.  Proof that this isn't a Hollywood movie.My favourite scene is the scene in the restaurant, when Cristy is discussing painters with Eileen, Peter and her friends.  Here's where Daniel Day-Lewis reaches an acting climax.  \"I'll kick you in the only part of your anatomy that's animated.\"  \"Wheel out the cripple!\" And his performance never slows down, never falters, and is beautiful. Simply.  He has a lot of screen time here.  I watch it again again, and I never get tired of Cristy's perspicacious eyes, twitching and guttural speeches.A must-see.  Fo sho, yo!",
            "review_date": "2003-08-05",
            "lang": "en"
        },
        {
            "review_title": "Beautiful piece of art.",
            "content": "A beautiful piece of art. I haven't connected to a movie like this in a long time. There is so much beauty in this film. Christy has serve Cerebral Palsy and he is a borderline alcoholic. Daniel Day-Lewis gives a phenomenal performance as Christy Brown. It's not the best film I've seen but it really is beautiful and I love it. I like that the film takes place in Dublin, Ireland. This film deserves to be apart of the Criterion Collection. I could talk about this film a lot more but this film is a piece of art, I love it and it's perfect.",
            "review_date": "2021-09-19",
            "lang": "en"
        },
        {
            "review_title": "Oh, Christy Brown",
            "content": "This masterpiece shows us a mother's love for her son and all the sacrifices she made in life without looking for any acknowledgment.After watching this movie I'll understand deeply that being disabled is not an obstacle to achieving your dreams and trying is all you can do.It's a touched film, and I cried.",
            "review_date": "2022-04-01",
            "lang": "en"
        },
        {
            "review_title": "Daniel Day - Lewis",
            "content": "one of his magnificent performances and one of the most impressive stories from the last decades of XX century cinema. this is the essence of a portrait about survive and about the image. and the great thing is the great performances of each actor. the humor. the air of family. the perseverance, fight against limits and about the verdict of the others. a masterpiece. this is the right word for define it. the motifs - many. each new view as new occasion to discover new and new ones.",
            "review_date": "2017-07-24",
            "lang": "en"
        },
        {
            "review_title": "Well made and inspiring, but...",
            "content": "\"My Left Foot\" is a pretty impressive film that tells the story of Christy Brown, an artist who was crippled with cerebral palsy and learned to paint with his left foot, the only limb in his body he had control over. Daniel Day-Lewis won his first Oscar as Best Actor for this film, which I'm not absolutely certain was deserved, but is still noteworthy. Day-Lewis give Brown a realistic and occasionally almost humorous touch. Brenda Fricker, as Brown's devoted mother, also won an Oscar for a believable and touching role. My problem with this film is that it is a bit too real at times. When Brown is in desperation and must help someone and do it all with his left foot, the film can be difficult to watch. This gives it an often depressing feel that may turn off some viewers for a time. However, if you look beyond that, you will see a sense of hope and inspiration for those who have handicaps and other difficulties to overcome. Those of us who are not crippled and still consider ourselves to have problems are inspired by this film, because if somewhat with a much worse condition than us can overcome their difficulties, we can certainly do the same thing. Well made, occasionally enjoyable, but difficult to watch. May not be for everyone, but not bad at all.*** out of ****",
            "review_date": "2009-06-26",
            "lang": "en"
        },
        {
            "review_title": "Outstanding performance by Daniel Day-Lewis",
            "content": "My Left Foot is a good movie with a sincere reflection on the hypocrisy of the time, regarding the inclusion of people with disabilities in society, and what it takes to overcome these difficulties and all the tabus. A great tribute to a man who transcended himself beyond all expectations. I gave it 7 because the movie could have gone further emotionally, but no doubt it's worth seeing.",
            "review_date": "2019-10-28",
            "lang": "en"
        },
        {
            "review_title": "Wince, laugh, cry and triumph all the way",
            "content": "Anyone who says this excellent biopic of Christie Brown is easy watching is lying. Daniel Day Lewis, as far back as 22 years ago transforms both himself completely; bodily and character-wise and onto his first Oscar. What is refreshing is that the story isn't about a poor wee lad, almost totally crippled (except for that left foot) from birth with cerebral palsy who has no friends, because he has. It's about his sheer fighting spirit & utter determination that gets respect but he also breaks hearts. He uses that foot to score a winning goal in the street but his stoic exasperation often sends his mother to despair. If you thought that Casualty only existed around the firm but fair senior nurse way back when, played by Brenda Fricker, here she is in wonderful Oscar winning form. Girls are touched by Christy's attention, guys admire his guts and outright cheek. Christy becomes a noted poet and artist, either typed out one character at a time or with a brush, both by using the big toe and adjoining toe of that left foot. It also casts a revealing spotlight on hard working Dublin family life in the (I estimate) '50s & '60's. Quote: (Specialist doctor comes to visit him at home. Mother knocks on his bedroom door. A muffled, incoherent expletive is his reply) \"I can teach you how to say **ck off more clearly, Christy\" the female doctor replies. The start of a real road to self realisation begins.Believe me, you'll wince, laugh, cry and triumph all the way with this one and one that you'll remember for a long, long time to come.",
            "review_date": "2011-04-14",
            "lang": "en"
        },
        {
            "review_title": "Daniel Day-Lewis is unfathomably excellent",
            "content": "Daniel Day-Lewis is absolutely one of the most talented and dedicated actors in this modern age of cinema. The challenging roles he takes on put his abilities to the test every time, but every time he pulls out one of the most incredible performances any of us could ever imagine. Such is the case of My Left Foot, the film for which he won his first Oscar. My Left Foot is the story of Irish author and artist Christy Brown, who suffers from severe cerebral palsy. His condition is so bad that the only part of his body he can completely control is his left foot, hence the name of the film. The story follows his story from when he was a child misdiagnosed with mental retardation, to his adult life where he celebrates his talent but also struggles with the idea of acceptance into society because of his condition. Needless to say, it is a very powerful film.The amount of empathy evoked from the character of Christy Brown is uncanny. I could not feel more sorry for him at times in the film. The life he leads is extremely difficult, and not for conventional reasons like an abusive home life or neglect by society because of his condition. In fact, his family is actually very supportive of him throughout the movie and they care for him and love him. The artistic world accepts him despite his condition, and gives him plenty of honor and praise for what he has overcome to make art. Instead, what Christy struggles with is true acceptance as just a human being instead of a handicapped study of human integrity. His desire is to move past just platonic love and experience something more sincere and real in his life instead of people just accepting him because they feel they have to out of respect. Unfortunately it is difficult for Christy to communicate this clearly, both in a figurative and literal sense. He doesn't know how to appropriately communicate these feelings efficiently to people, but he also has a hard time saying anything because of his disease. That is one thing to keep in mind. You have to listen close to everything Christy says because if you just casually half listen it will all sound like mumbling. But back to my main point, it was this inner struggle that kept the character of Christy Brown both fascinating and extremely empathetic.I have the feeling that Daniel Day-Lewis' role in this film is one that will be talked about and studied for years to come. It is just every single definition of the world incredible. It is one of the most physically and mentally demanding roles I've ever seen put on screen and Day-Lewis captures it all so perfectly. He is impressively consistent with his physical mannerisms which are very specific and very large, as it is the defining visual characteristic of Christy Brown. Through the movie, Christy's condition slowly improves with help of doctors and his family, so that made the character even more difficult to pull off, as he had to change his level of deficiency throughout the film. There is a very distinct difference in how badly the cerebral palsy affects Christy's speech and movement at different time periods in his life, and Day-Lewis pulled it off wonderfully. And so behind the physical tribulations necessary to make this portrayal work there was an incredible amount of mental characteristics to master as well. Behind the sad exterior of this character was a very complex and very human interior. The film makes a big point that Christy Brown was more human than so many other people, which is something hard to understand when looking at a man who is hardly self sufficient and can barely even talk right. But there is so much personal emotion behind the physical ailment that it required even more work for Day-Lewis. But miraculously he pulled it off and did a mind blowing job at it.My Left Foot is a great movie. It had so many fine elements to it, but nothing compared to Day-Lewis' portrayal of Christy Brown. This film was one of the more fascinating and compelling character studies I've seen, so I have to give it a lot of credit for really grabbing hold of my emotions and delivering to me an unforgettable experience.",
            "review_date": "2010-12-17",
            "lang": "en"
        },
        {
            "review_title": "The human handicap...",
            "content": "So I finally saw the film \"My Left Foot\" last night after years of being told by my mother how amazing it is... The central performance of Day-Lewis is indeed remarkable and amazing, but anyone with even minimal exposure to his other work should expect nothing less.The fatal misjudgement in my eyes was that in becoming obsessed with proving the normalcy of this man; the movie chose to show him as a complete and utter jerk. On the one hand I can see that this is a logical correlation; mankind always has the capacity to be objectionable, and disability shouldn't obscure that. I just wish that impartial onlookers wouldn't be so forgiving of aberrant behaviour and assume that circumstances automatically make it forgivable. They don't. Acting out is normal, and so yes, disabled people act out - but they don't do it because they're disabled; they do it because they're being unreasonable. A physical impairment doesn't afford you the right to throw a hissy fit in public, just because someone you love turns you down.There are certain things it is unwise to do whether you are disabled or able-bodied. Giving someone tacit permission to boot a football directly at your head for the sole purpose of fitting in is one of them. (Admittedly, I did once save a penalty from the school's star striker with my face, but I already belonged by then. It wasn't for acceptance.) Engaging in a bar brawl is another. Revelling in the fact that your father only extends companionship to you after you've proved yourself capable of metaphorically jumping through physical hoops takes masochism a step too far. All of these things are stupid, and suffering through them as a way to demonstrate your bravery doesn't make them any less foolhardy.So yes; just because you've overcome obstacles to achieve great things doesn't make you any less of a jerk... Being a good person takes priority; setting an inspiring example for the disabled should appear way down the list.",
            "review_date": "2009-05-23",
            "lang": "en"
        },
        {
            "review_title": "amazing performances make it great",
            "content": "I thought Hugh O'Conor was astounding as the young Christy Brown, and really deserved greater recognition for his role.  I couldn't believe how well he played the part.  Of course, Daniel Day-Lewis was brilliant too.  My favourite scene is where the boys are playing football and Christy uses his head to stop the goals and then kicks the penalty!  Amazing performances by the two Christys (and other also).",
            "review_date": "2001-09-07",
            "lang": "en"
        },
        {
            "review_title": "A wonderful film... the performance of a lifetime.",
            "content": "Daniel Day Lewis gives his best performance in My left foot, a wonderful film in which Lewis gave one of the most challenging performances I have ever seen: a man with cerebral palsy. Lewis' performance is brilliant. You've really never seen anything like it.My left foot tells the true story of Christy Brown, a scotsman with cerebral palsy. The film shows his struggle through the years. How he's been judged, how people looked down on him. But yet there are people who cared about him and helped him, such as Eileen(Fiona Shaw), who teaches him how to read and write, and his caring mother(Brenda Fricker).Lewis has given many great performances, such as Bill \"The Butcher\" in Gangs of New York, Daniel Plainview in There will be blood, and John Proctor in The Crucible, but Christy Brown is his strongest. I have never seen a performance like it. You grow to love him. You also feel for Brenda Fricker,obviously. Both her and Lewis won Oscars for their work here, and they truly deserved it. And need I forget Fiona Shaw's performance. To be honest, everyone here triumphs.The story is wonderful. Directo Jim Sheridan does a wonderful job narrating Christy's life, and to know that Christy has accomplished so much just makes you feel all warm inside. My left foot is a wonderful film from beginning to end.There is really a lot to admire about this film, but the main thing is Daniel Day Lewis' haunting performance. It has got to be hard to play this role. Probably as hard as it is to actually have cerebral palsy. In short, My left foot nails it. It deserved Best picture.A",
            "review_date": "2011-07-27",
            "lang": "en"
        },
        {
            "review_title": "Nothing's impossible",
            "content": "My Left Foot is the Irish director Jim Sheridan's first film. It is based on the real life story of Christy Brown, who was born with cerebral palsy. His left foot was his only controllable limb, and it was this very left foot that changed his life forever, turning him into a master painter and story teller, thanks to his intelligence and perseverance, and, last but not least, his mother.The film is very touching but it does not fall into the trap of the exaggerated sentimentality that we might see in similar subjects. The film is also realistic; Christy's move from an incomprehensible spastic quadriplegic in a poor family to the respectable painter and writer was not an even path. His constant isolation is felt in his constant drinking, his several failed romances and his strained relations with many of those around him, particularly his father. It is mainly the love for his mother which keeps him going. But in his high moments, he cannot escape the isolation he feels as a result of his physical difference with others. There are a few people who really understand him and those few people become the reason for his happiness in the end. The film has the hopeful message that nothing is impossible if you really believe in yourself and those who care for you. Daniel Day-Lewis gives another dazzling performance as Christy Brown, and Brenda Fricker as Mrs. Brown. Both won Oscars for their roles.",
            "review_date": "2013-01-26",
            "lang": "en"
        },
        {
            "review_title": "Nothing Short of Amazing",
            "content": "This movie was a necessary movie. People with similar handicaps need to see this, if not for inspiration, at least for commiseration.Christy Brown, played by Daniel Day Lewis, was born with Cerebral Palsy in Dublin, Ireland. It left him with little to no mobility in any of his limbs with the exception of his left leg and foot. With much help from a physical therapist and a lot of practice on his own, he learned to paint and write with his left foot as well as speak a lot clearer.It was nothing short of amazing what he was able to do. Lewis did an impeccable job playing a man afflicted with cerebral palsy--very convincing. This was a satisfying movie if for no other reason than to bring awareness to the plight and potential of those with CP.",
            "review_date": "2020-03-16",
            "lang": "en"
        },
        {
            "review_title": "What Makes a Person Exceptional?",
            "content": "The morning after watching \"My Left Foot\", and musing on how the main character became more and more comprehensible through the film through the help of speech therapy, I had an odd thought: what if Christy Brown had been born able bodied? And the answer was obvious: he would have been just another of 13 poverty-afflicted kids in a struggling working class family in Dublin. He would be just another profanity spouting, booze swilling, day laborer with undependable income, like his father, and probably a high school dropout with as little interest in reading a book as writing one. It was being born with Cerebral Palsy that, paradoxically, made Brown into a hero. It was an opportunity. A terrible one, but an opportunity just the same. And in the film, with the help of the best actor one could possibly have chosen for the job, Daniel-Day Lewis, we are forced to face the fact that heroism is not just for the powerful. It's not just for brawny firefighters storming into the World Trade Center before it collapses, or for police officers who put their lives on the line every day. Being saddled with the inability to speak, eat or even drink normally, much less walk across the room, is a challenge that would make most people crumple--and submit to everyone's expectations. In the movie, that meant becoming a vegetable. But Christie - that is, the Christie on the big screen, refuses. He manages to scream a word when his mother's life savings are about to go up in smoke in the fireplace; he finds humor in being used as a tool to divert a truck driver so his brothers can nab bootleg coal to warm the house; he falls in love and is rejected, but refuses to be treated with anything less than dignity and respect. And hardly least - he manages to write a book, painstakingly, with his left foot - so that his voice is a real voice and he endures as nobody's victim or source of pity.In addition to Day-Lewis' channeling the spirit of Brown in an extraordinary way (other reviewers on this site who have C-P have testified to this), the movie is blessed with the performance of child actor Hugh O'Connor who should have shared Academic Award honors. All other characters were equally convincing.So--why give this movie less than ten? It's hard to escape the reality that listening to a severe speech impediment for over an hour can be taxing--and for some, seeing the physical struggles will be painful. And, while the scene where he tells off his patronizing speech therapist in a restaurant tells us he can be fully human (arrogant as well as charming, cruel as well as witty) it's a stretch that his rants are allowed to go on for what seems like forever until the whiskey is finally taken away. Brown was lucky: in the end he found not only affirmation and praise for his writing and art, but love as well. I hope the movie reminds us that most people with severe physical limitations aren't as lucky, but live their lives as heroically as they can.",
            "review_date": "2010-12-13",
            "lang": "en"
        },
        {
            "review_title": "Respect the acting; have CP friends; hated the movie--boring!",
            "content": "I like Daniel Day-Lewis. I get what he was after (not milking our sympathy and giving an accurate portrayal). That said, this movie was boring. Boring.First of all, the storyline is just not that great. I realize it's Christy Brown's life. I don't dispute that he's amazing; nor that his mom was amazing; nor his siblings, who, too, are wonderfully loving. It's just not that great a \"plot.\"Secondly, I can be very emotional, but this movie didn't make me cry, laugh, feel indignant, or teach me any great life lesson. I wasn't inspired, and felt no sense of triumph.Thirdly, watching the movie was like someone saying to me, \"Hey, there's this guy I read about with cerebral palsy. All he could control was his left foot, so he wrote and painted with it. His paintings were actually very good, and he typed with his toe.\" My response? \"Wow\" (with no exclamation point). Am I interested to hear more? No. Am I glad he told me? Not really.Lastly, Daniel Day-Lewis's acting was so good, that I could understand only 15% of his words. Tough to watch a movie when you can't understand the main character. Give me a break. This may be the case with some individuals with severe CP (but not with my CP friends, 90% of whose words I understand), but even if it were the case for Christy Brown, I mean--come on--I'm watching a movie here. Make me a concession. I know, I know. If he were my brother, I'd have to learn. But this is a movie. I've got two hours, not a background of twelve years listening to this guy and thereby learning to understand him. Speak understandably, DDL, for the sake of the movie viewers; we'll still get your point. DDL's unclear speech causes one to try to figure out through the whole movie what he's just said by the context of how everyone else in the movie responds. Let me understand his words. Speak so that I can. Ugghhh.",
            "review_date": "2013-09-04",
            "lang": "en"
        },
        {
            "review_title": "One Big Toe Up!",
            "content": "30th Anniversary: 1989 - the Best Year in Cinema Marathon Film #84/100: \"My Left Foot\" (1st Viewing.) It would have been criminal if Daniel Day Lewis HADN'T won Best Actor for this roll of a lifetime. Probably in Oscar's history, this has to be in the top 10, maybe 3, best ever performances. Great; now I'm curious if there's a list, opinion or not, of that. Anyways, the movie itself was good, but for too many times, I was a bit lost in all the transitions, jumps in time (not from present to past, but within the past segments.) For example, one scene has a main character set up to die, and I thought that person had and was replaced. Nope. At any rate, the film itself is good, but the movie is highly recommended for Daniel's breathtaking performance.",
            "review_date": "2019-12-09",
            "lang": "en"
        },
        {
            "review_title": "One of the most inspirational movies ever !!",
            "content": "This performance from Daniel Day Lewis goes down as one of the most amazing performances of all time in my opinion.Christie a man who is only able to use one limb - his left foot.Amazingly, he learns how to write and paint with this foot.Watch out also for Brenda Frickers performance.She is absolutely outstanding as a caring mother who would do anything for her sonRATING - 9/10",
            "review_date": "2003-12-07",
            "lang": "en"
        },
        {
            "review_title": "One of the most inspiring true story but fictional changes were less cinematic than True Events.",
            "content": "My Left Foot (1989) :\nBrief Review -One of the most inspiring true story but fictional changes were less cinematic than True Events. If you accept My Left Foot just as the way it is then i believe you will find it One Of The Most Inspiring Biographical Drama ever. But if you read his life history on Wikipedia or somewhere then i believe you will find the Movie less dramatic than his life. The film is about Christy Brown, born with cerebral palsy who learns to paint and write with his only controllable limb - his left foot. There were many scenes in the film where tears rolled down from my eyes and i was feeling like experiencing one of the finest films of my lifetime but then some Idiotic events took place which i first thought were inspired from true events and easily accepted them until i read his real story on Wikipedia. In the film, Brown falls in love with a woman who is engaged to someone she loves and naturally that was making sense but suddenly Brown loses his Cool and finds himself mourning. Again in the climax, he falls in love with a girl Mary whom he has just met few hours ago and tries his chances, though this time the girl is convinced sympathetically and they marry each other. In real life Brown had an affair with a married woman and he rejected her to marry Mary who later became abusing and unfaithful to him. Now if i see these real events i find them more interesting than the fictional writing of the film so somehow it forced to think about the overall impact of the film which obviously reduced a bit. The top 2 performances in the film came from Daniel Day-Lewis as Brown and Brenda Fricker as his mother and both of them went on to receive Oscars. Jim Sheridan takes this film through emotional and sympathetic lanes which surely works as the film is really a tear-jerking experience. If you ever feel useless in your Normal life just imagine that there are so many abnormal people in the World who haven't given up yet. The Left Foot will make you realise the importance of being Normal in your life as the abnormal one teaches you to fight for Living.RATING - 7/10*By - #samthebestest",
            "review_date": "2020-06-06",
            "lang": "en"
        },
        {
            "review_title": "Really good bio Irish movie with Day-Lewis",
            "content": "Seriously you would ask yourself \"Has Daniel Day-Lewis ever pulled any muscles on his face while filming?\". He was brilliant for pulling it off and staying in character. He really showed and made me aware of the challenges a person with cerbal palsy can face! Like the most amazing thing I learned about the real Christy Brown, he painted with his life foot and Christ almighty, the paintings were absolutely out there! Man I wish I was able to paint like that especially using your left foot and never mind using both hands! However since I am not interested in painting, I think I'll pass on this haha. Also Brenda Fricker was excellent too by acting as a wonderful Irish mother who cared about Christy and never gave up on him! I tell ya, she was better than the other mothers on that street who called Christy an eejit for making \"noises\" while the mother was unconscious. I felt like I wanted to shake them and tell them to go look themselves in the mirror, disability is everywhere like! It was very shameful how disability was frowned upon during the 60's/70's. At least Brown proved them wrong and was successful in his art/writing career! Really good movie, just watch it, it really stands out well for an Irish film!",
            "review_date": "2017-06-11",
            "lang": "en"
        },
        {
            "review_title": "Boring and unimpressive.",
            "content": "I was utterly disappointed by this movie. I had read some of the other reviews here and had much higher expectations. I expected a drama with more intense character development. But that never happens in the movie. Daniel-Day Lewis is a good actor, but not as good as some reviewers here would have us believe. I tought he repeated the same set of 4 or 5 movements in the movie. I would rate his performance 6 out of 10.Acting: 6 out of 10 Direction is 5 out of 10. Script is the worst: 2 out of 10. I deleted the movie from my DVR at 70 mins. into the movie. Much better movies out there than this...",
            "review_date": "2004-04-27",
            "lang": "en"
        },
        {
            "review_title": "Day-Lewis is the goat",
            "content": "This movie is simply great, a great story filmed at a high level with strong acting, and still it all was eclipsed by the Daniel Day-Lewis performance. You may like or not the movie but you must appreciate the work of the lead actor. He puts his soul in the work, jump into eternity if you want. There were moments, while watching the movie, I really believed everything is for real, and Day-Lewis doesn't act but is a disabled person who really struggles to live. If you want to see one of the best performance in the history of movie given by an actor you should watch this film.",
            "review_date": "2021-02-02",
            "lang": "en"
        },
        {
            "review_title": "Daniel Day-Lewis Masterpiece",
            "content": "The BEST performance i saw. The movie is emotinally amazing.",
            "review_date": "2020-07-22",
            "lang": "en"
        },
        {
            "review_title": "A Beautiful Portrayal of Life",
            "content": "Sometimes one movie can show you so much of life.. Teaches you the brutality, the sweetness, the harshness, the beauty of life.Life is not fair, and for a cripple it's far more tough, a child whose 10 years of his childhood was just to hold the chalk by his only active left foot to write a letter 'A'.From a child suffering from Cerebral Pulsy to become a Man Christy Brown and earning his name through his painting by his only active left foot was never so easy.But not even one time he saw the world from outside, nor he liked to be sympathized. He grew amidst all the harshness of society , to be recognizable. To fail in Love, to Womanising, from anger and frustration to Success, the journey was never been easy.Yes the journey is predictable in the end but the way this movie showed Christy Brown, like a man with all the negative qualities to show his positive side, is commendable.Very few movie inspires me so much.The movie is not about fantasy, not about scifi, not about neo noir gangstar mafia ballad,nor about dream and illusion reality, its about LIFE, and LIFE throughout. Hugh O'Connor what an acting.. Tears rolled down my eyes when you tried so hard to write the word 'MOTHER'.I have never seen a scene so intense.Daniel Day Lewis, I am awestruck, amazed,how you totally forgot you are not Christy Brown.. Any adjective to describe your portrayal of character will be insult to your acting. I am grateful to see you in this character , Always been a fan of your method acting, from LINCOLN to GANGS OF NEW YORK, you are surprisingly good, but this movie surpassed all. You deserved an Oscar,you got it, so does Brenda Fricker for portrayal of a mother who did not loose her hope. I will be forever grateful to this movie.The way it filled my heart with happiness and pain simultaneously.",
            "review_date": "2015-11-23",
            "lang": "en"
        },
        {
            "review_title": "It is a story of human struggle against uncontrollable circumstances related to the physical and mental existence of the modern man",
            "content": "Wonderful movie, Christy Brown is as cripple as Hamlet. He was not \"Nothing\" so he chose not to end his life. We love his high spirited hopefulness and his refusal to be a vegetable. Millions are mentally and creativity wise more cripple than Christy Brown.The movie depicts the protagonist fighting a great war against outside circumstances ( being a cripple ) and inside world - a desire to make his mark in spite of his apparent inability to create specially in the situation when most around him thought that he was nothing more than a vegetable.I feel Christy Brown represents the modern man struggling against the hostile world without and within. The support of the family, specially the mother figure represents the only hope that we have got - the fellow human beings.Daniel Day Lewis rightly earned his Oscar for his performance. Simply the best.",
            "review_date": "2013-07-20",
            "lang": "en"
        },
        {
            "review_title": "Daniel Day-Lewis puts on the performance of a life-time",
            "content": "I had never seen such an incredible acting job in a motion picture as I did when I saw Daniel Day-Lewis play Christy Brown in My Left Foot.  In fact off the scene his role wasn't even over.  He played the role of Christy Brown or at least disabled like him all through the filming of the movie and needed surgery because of the damage his superior acting had done to his back.  To me that is remarkable and through all the pain he put up with to act that role I believe it is quite true to say he put on the most Oscar worthy performance in history.  He was so masterful in this tough a part that I believe no one could have done it better or with more of an impact than him. Although I cannot say it is the greatest movie of all time I can say that how he played this impossible a role and then kept on acting it until it wasn't even acting anymore is without a doubt the greatest feet I will ever seen an actor do.  Probably a man too for that matter.",
            "review_date": "1999-04-30",
            "lang": "en"
        },
        {
            "review_title": "Simply brilliant",
            "content": "I stumbled upon this movie during a special pedagogy lesson in school. I was stunned by the actors's performances - they're truly talented. Daniel Day-Lewis and Brenda Fricker both won an Oscar for their efforts.The movie is about a real guy named Christy Brown, who, despite his severe handicap, wins a stubborn struggle for respect, love and the outside world's prejudice. When Christy was born in 1932 he encountered complications, which resulted in severe brain damage. He could, for example, not talk or sit alone, and the only body part that he learned to control was his left foot. The film follows how Brown deal with his disability in a fight against loneliness, isolation and sadness.A touching movie, who gets to you a little extra. I held back tears.",
            "review_date": "2014-05-21",
            "lang": "en"
        },
        {
            "review_title": "Inspiring But Niggling Doubts",
            "content": "Day Lewis and Fricker are superb but why do I get the feeling that this is only a part of the story, no doubt the most important part? I'll have to read the book to see if this is the inspiring true story presented by the movie.",
            "review_date": "2018-05-18",
            "lang": "en"
        },
        {
            "review_title": "More to offer than just the Day-Lewis performance",
            "content": "Was at first sceptical whether I would enjoy it but the interesting events of Christy's childhood and humour of 40's Irish family life won me over. The relationship of Christy and his mother is a special one and the way the film shows a person with cerebral palsy doing all he can to live a normal life, is inspiring. Of course most people will seek this out for Daniel Day-Lewis's Oscar winning performance which is completely justified but I think Brenda Fricker is just as good here. Give it a chance even if the subject matter doesn't appeal to you. You'll be glad you did afterwards.",
            "review_date": "2011-07-14",
            "lang": "en"
        },
        {
            "review_title": "A Masterpiece",
            "content": "After a long time I came across a movie that really touches you deep with in. May be since it is a true story based on life of christy brown who rose to fame with his artistic talent despite his physical disabilityIt is a truly inspirational movie.It is based on a writer/artist christy Brown who is born with cerebral palsy. His whole body is paralyzed except for his left foot. He is mute and the only means of expressing himself is with his left foot.The movie is all about his journey of how christy's talent slowly comes out of the cocoon and how with help of this family and his therapist his talent gets visibility and gets appreciated by the world.When your days go bad because you didn't score very well in your exams, when you get sleepless nights coz your appraisal wasn't what you expected,when you complain that you couldn't go for ivy league college and had to settle for a tier II college, you feel you have lost out on everything in this world.After you watch this movie, this takes you to a totally new level of self conscience.It makes you feel that all that grumbling we do over petty issues in life has been futile and you could have used that time/energy in doing something better. Now let us talk about the star cast. As we all know, Daniel Day is one of the best actors we have. I doubt if anyone could match upto his performance in this role. Brown's moms role is of utmost importance in the sense that christy's mom is very pivotal in encouraging christy to fight with his disability. Brenda Frecker does full justice to her role.Both of these actors were bestowed with Oscar award in the year 1989 for Best actor in leading role and for best actress in a supporting actress respectively.His bunch of siblings and his father also add to making the movie more remarkable.The screenplay and the direction couldn't have been better.I would recommend you to watch this movie for a simple reason that it tells you that you have lots of opportunities around you. You shouldn't be dejected if you couldn't grab one of them.Life is about endless possibilities and we should take life with an optimism is my take away from the movie.",
            "review_date": "2011-11-20",
            "lang": "en"
        },
        {
            "review_title": "Very inspiring movie",
            "content": "Watching this movie just makes you want to do better. Very inspiring story and a well-done movie.",
            "review_date": "2019-09-25",
            "lang": "en"
        },
        {
            "review_title": "A wonderful story",
            "content": "A magnificent and unforgettable film that has won several awards, an undeniable lesson in life.",
            "review_date": "2020-06-04",
            "lang": "en"
        },
        {
            "review_title": "A film with a soul",
            "content": "Director Jim Sheridan has worked numerous times with Daniel Day Lewis. One of their first films together was 'My left foot', where they both demonstrated their great ability to tell stories full of emotion.\n'My left foot' tells the story of the writer Christy Brown, who was born with cerebral palsy. On that basis, one could expect a story full of tragedy and melodrama, as an inexperienced director would. However this is not the case, Sheridan shows us her much more optimistic view of this reality. It totally focuses on the family and the people who give all their support to the protagonist of the story. Although this is a positive thing, a greater deepening on some issues is missed. Several things remain in the air or happen too quickly, without further explanation.\nDespite everything, it is a film that seeks to deliver positive messages in the most direct and gentle way possible. A fluid direction and a performance full of feeling on the part of its protagonist result in an emotional film that bluntly shows its own soul, something that many films are not capable of achieving.",
            "review_date": "2020-06-24",
            "lang": "en"
        }
    ]
}