{
  "title": "The Road Warrior",
  "rating": 8.4,
  "release_date": "1982-05-21",
  "genre": [
    "Action",
    "Sci-Fi",
    "Thriller"
  ],
  "summary": "In the post-apocalyptic Australian wasteland, Max (Mel Gibson), a cynical drifter, agrees to help a small, gasoline-rich community fight a roving band of marauders. Originally titled Mad Max 2.",
  "critic_reviews": [
    "It is the Road Warrior (as it was subtitled for the American release) that remains the definitive Max movie, hard as nails, hell for leather, it lands like a punch to the jaw. Don't drive angry? Yeah, right.",
    "Part post-apocalyptic Western, part midnight motorcycle flick and part Rocky Horror Picture Show, Mad Max 2: The Road Warrior is, when you add it all up, a nutty, B-movie masterpiece.",
    "Miller's choreography of his innumerable vehicles is so extraordinary that it makes Spielberg's Raiders of the Lost Ark look like a kid fooling with Dinky Toys.",
    "Miller suggests violence; he does not exploit it. He throws the viewer off-balance by mixing the ricochet rhythms of his chase scenes with tableaux of Walpurgisnacht grandeur.",
    "Director Miller keeps the pic moving with cyclonic force, photography by Dean Semler is first class, editing is supertight, and Brian May’s music is stirring.",
    "The experience is frightening, sometimes disgusting, and (if the truth be told) exhilarating. This is very skillful filmmaking, and Mad Max 2 is a movie like no other.",
    "It's a highly stylized, roaringly dynamic action film that shuns plot and characterization in favor of a crazy iconographical melange—it's like the work of a western punk trucker de Sade...The climactic chase, with its deft variation of tempo and point of view, is a minor masterpiece.",
    "Gibson is surprisingly uncharismatic, but Miller makes up for it with whizz bang action.",
    "In its stripped-down, cannily cinematic way, it's one of the most imaginative Australian films yet released in this country. It has no pretensions to do anything except entertain in the primitive, occasionally jolting fashion of the first nickelodeon movies, whose audiences flinched as streetcars lumbered silently toward the camera.",
    "Mad Max 2: The Road Warrior is a straightforward action/adventure film, filled to the brim with over-the-top chases and stunts."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "This is an awesome 80's movie. It just has a lot of action, it is very entertaining and it works great as the first important adventure to the already known ex-cop Max. Here, this movie set the real standard for every Mad Max movie ever released.",
      "review_date": "2015-05-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Weirdly enough for Mad Max, sequel gets better than the first movie as here you can actually feel the Mad Max universe, with the desert in there and all the apocalyptic vibes, plus the action and story is quite good too. For 1980s movie it isWeirdly enough for Mad Max, sequel gets better than the first movie as here you can actually feel the Mad Max universe, with the desert in there and all the apocalyptic vibes, plus the action and story is quite good too. For 1980s movie it is a really good one even for these days. From first 3 movies this I think is the best one, so if you want to see why everyone liked Mad Max in those days, this is the movie to watch.",
      "review_date": "2016-08-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "......................................................................................................................................................An Sequel who Massacred the Predecessor, that Injected Great Chases, Explosion and Fun.....",
      "review_date": "2016-05-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Mad Max 2 - The Road Warrior is a great improvement over the first movie.A phenomenal action, an interesting script (but little else) and crazy buzzes create this work worthy of worship.",
      "review_date": "2019-08-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film which is the 2nd Mad Max film in the original trilogy (1979-1985) is for me the best one. Bigger budget than Mad Max 1 which makes this film more awesome and it's set in a post apocalyptic world unlike Mad Max 1 which it wasn't.",
      "review_date": "2019-06-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Mad Max 2, the ultimate film in the series. An awesome action film that never ceases to blow people away with it's interesting/quirky/crazy characters and action packed chase sequences. It sets the standard for every other Mad Max film andMad Max 2, the ultimate film in the series. An awesome action film that never ceases to blow people away with it's interesting/quirky/crazy characters and action packed chase sequences. It sets the standard for every other Mad Max film and stands as one of the greatest action films of all time.",
      "review_date": "2015-05-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A thrilling piece of filmaking, this effective action film also has a heart, one of the reasons to why this bizarre movie works.\rMel Gibson it's a hell of a badass in this one, he has charisma, and effectively portrays the Max character,A thrilling piece of filmaking, this effective action film also has a heart, one of the reasons to why this bizarre movie works.\rMel Gibson it's a hell of a badass in this one, he has charisma, and effectively portrays the Max character, who, by the way, grows as a character in this one.\rBut he doesn't carry the film on it's own, George Miller it's back, and his direction is fast-paced and thrilling, but keeping the characters.\rThe only negative side of this film, for me, it's the Feral Kid, but luckily some scenes save this character from being an annoyance.\rIf you liked the first Mad Max, you're going to be amazed by how this one improves on the first one, which is already a great movie.",
      "review_date": "2015-07-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Mad Max 2: The Road Warrior is one of the greatest 80's action movies of all time. The stunts are amazing, the action scenes were spectacular and Mel Gibson is such a bad-ass in this movie.",
      "review_date": "2015-11-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A Inovative,Brilliant and Masterpiece flick,and event today is a super influence for the action genre,for car chases and post-apocaliptic genre... Great narration,script,acting,direction,ideas and so much thing Mel Gibson and George Miller are genius",
      "review_date": "2015-10-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Miller's sequel is just as violent as it's predecessor. It doesn't do too much different outside of a more apocalyptic setting and feel. The villains are just as outlandish as ever, but the characters aren't as well defined. The story doesMiller's sequel is just as violent as it's predecessor. It doesn't do too much different outside of a more apocalyptic setting and feel. The villains are just as outlandish as ever, but the characters aren't as well defined. The story does have more focus though.\r The thrill here is in watching some brutal violence in a world gone to heck. Things are certainly desperate and there's a sense of hopelessness that encompasses the film's biggest action, chase scene. Everything is well shot and director George Miller pulls no punches in depicting the brutality of the world.\r It's exciting and has some tense action. If you enjoyed the previous Mad Max there's no reason you won't enjoy this one. It doesn't offer much in the way of particularly new content, but is still a satisfying dose of what could rightfully be called more of the same. If you are looking for more post-apocalyptic action, \"Road Warrior\" delivers in grand, unflinching fashion.",
      "review_date": "2015-10-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Post-Apocalyptic Action movie with freaking awesome set pieces solid acting and goddamn violence. **** yea Mad Max The Road Warrior is the best in the mad max series and is basically the only good one, besides fury road. If u like Violence,Post-Apocalyptic Action movie with freaking awesome set pieces solid acting and goddamn violence. **** yea Mad Max The Road Warrior is the best in the mad max series and is basically the only good one, besides fury road. If u like Violence, Fallout 3, and anything edgy as **** watch The Road Warrior, its ****ing wild.",
      "review_date": "2015-06-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is obviously what Miller really wanted to create, not the previous film. With more interesting bad guys, far better acting, a more dynamic role performed by Gibson and awesome visuals (not only for it's time but even now they areThis is obviously what Miller really wanted to create, not the previous film. With more interesting bad guys, far better acting, a more dynamic role performed by Gibson and awesome visuals (not only for it's time but even now they are respectable), The Road Warrior to me is the first real Mad Max film. However, dialogue and writing still isn't the best - but definitely improved a lot from Mad Max - and the fact that he isn't mad, just angry, kind of annoyed me a bit. He should be called Angry Max not Mad Max. With some very nice action sequences and a better cast overall and far far better plot and pacing, Mad Max 2 does a good job at being an action film.",
      "review_date": "2015-05-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "George Miller's sequel is filled will competence battle sequences I do not think it is  prowess like the first one, but it's definitely the best sequel I've seen in years. A former-cop named Max is back on the road again! after his wife andGeorge Miller's sequel is filled will competence battle sequences I do not think it is  prowess like the first one, but it's definitely the best sequel I've seen in years. A former-cop named Max is back on the road again! after his wife and young son die in the hands of a vicious gang, drives the post-apocalyptic highways of the Australia, fending of the tribes attacks that prey on cruel outsiders. Max stumbles upon a community filled with survivors; they plan to steal the gang's oil. But soon becomes the group's reluctant defender against the hulking Humungus (Kjell Nilsson) and his ruthless marauders. Director George Miller comes back to the franchise and adds stripes  of flavor towards the story with taste and with kick ass visuals; the filmmakers have made a proper good looking sequel we know the story has changed, but the good thing about the film is that Gibson's performance is just the same filled with tension and it's memorizing! the villain (who looks like Jason Voorhess), was the best villain I've seen. I liked the first one there's something about this film that does not spark, the film was okay it had epic storytelling but I think there's something missing towards the last one. Grade A-",
      "review_date": "2015-05-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Bad movie which is the most overrated of the series, it is the responsible for the post-apocalyptic, which is the most important element for the Mad Max universe, but its cause is only a poorly developed premise. Plus, there's no reason for aBad movie which is the most overrated of the series, it is the responsible for the post-apocalyptic, which is the most important element for the Mad Max universe, but its cause is only a poorly developed premise. Plus, there's no reason for a post-apocalyptic theme in this movie, since it only shows a desert and deserts are always devastated, the presence of a single ruin showing the destruction would solve that problem, the weird is that the roads are completely intact (??). The Road Warrior looks like a small brief, that happens because the movie features interesting characters, but they don't have any development or subplot, making them forgettable. By the way, you don't forget them because you can't stop thinking about how forgettable they are. The violence and insanity, which are very important for the Mad Max series, simply don't exist here. Max is turned into a blockbuster action badass hero, contradicting his development in the first movie and making the series fall to the cliches of the 70's actions and old westerns. The first act is troubled by twenty minutes where NOTHING happens, the story is poor overall and I don't remember the soundtrack of this movie. Only good thing is that the movie isn't long, Max eating dog food and the post-apocalyptic aren't even original concepts.",
      "review_date": "2015-10-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Miller is at it again with this awesome action adventure movie. Still the best entry of the series, although Fury Road is a very close second. A must-see for fans of post-apocalyptic mayhem and badassery.",
      "review_date": "2015-07-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": ".............................................A Surprise and over-the-top sequel with much better stunts,car chases and ideas much more entertaining than the first one.",
      "review_date": "2015-10-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "98y1aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa",
      "review_date": "2019-12-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Feels more assured than first film but I struggled to really get into it. Somewhat entertaining.",
      "review_date": "2019-04-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was the movie that lighted the fuse to create a whole new genre of tropes. The mix of action and story is perfect, and even not being an expensive AAA movie at the time, it still is one of the best movies ever made.",
      "review_date": "2015-06-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What a big leap from the 1st Mad Max movie. This one is much better: With the much higher budget they created a much better world. But also the story is very well written and the character of Max is fascinating. Also the action scenes wereWhat a big leap from the 1st Mad Max movie. This one is much better: With the much higher budget they created a much better world. But also the story is very well written and the character of Max is fascinating. Also the action scenes were top.In addition it is clear, where the Fallout franchise get their ideas from.",
      "review_date": "2021-02-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The continuation of Mad Max is greater in every way; it's an action-packed adventure with great storytelling and really awesome practical effects. The action is refreshing and it got its innovation. The actors are much better than in theThe continuation of Mad Max is greater in every way; it's an action-packed adventure with great storytelling and really awesome practical effects. The action is refreshing and it got its innovation. The actors are much better than in the first movie, and almost everything is in fact much better than the first movie. The villain might be the only aspect that's not better than the first movie, but it's still awesome! This movie is one of its kind; it got great cinematography and the action is really well directed. Solid characters and surprising events are other great aspects of this movie. George Miller really did succeed with this second installment; it's everything the original isn't. But lack of more action-sequences and a bit more innovation too, keeps my rating under an 8.\r An almost flawless post-apocalyptic action movie!\r 7.7/10",
      "review_date": "2015-06-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Road Warrior was great. You don't need to see the first one. **** the first one. It's trash compared to this piece of work. This one has barely anything to do with the first one anyhow, despite the main character. This is the best sequelThe Road Warrior was great. You don't need to see the first one. **** the first one. It's trash compared to this piece of work. This one has barely anything to do with the first one anyhow, despite the main character. This is the best sequel ever made. It's also one of the greatest movies ever made in general. The movie that introduced the world to what apocalyptic movies are like.",
      "review_date": "2015-12-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Though bigger than the first, the plot seems to meander more.  I realize this is a fan favorite, but the pacing didn't work and I believe the larger budget magnified the issues with the original.",
      "review_date": "2018-11-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Mad Max 2: The Road Warrior is one of the greatest 80's action movies of all time. The stunts are amazing, the action scenes were spectacular! still fury road is better.",
      "review_date": "2016-03-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Brilliant and far superior sequel,For the great Mad Max: Franchise, This one makes you almost forget the first one or make the first look like so-so even the first have 7/10 but this without doubt is 10/10...",
      "review_date": "2015-10-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a great movie to watch when you are wanting to just sit back and be entertained.  It is a great mix of camp, basic story, and action.  You won't go raving about it to your friends afterwards but you'll enjoy it and find yourselfThis is a great movie to watch when you are wanting to just sit back and be entertained.  It is a great mix of camp, basic story, and action.  You won't go raving about it to your friends afterwards but you'll enjoy it and find yourself suggesting it to others...I did.",
      "review_date": "2015-09-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The cinematography, editing, music and stunts.... Oh those stunts!! As exhilarating a film as you'll ever see with just about the best chase sequence ever put to film.",
      "review_date": "2015-10-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The continuation of Mad Max is greater in every way; it's an action-packed adventure with great storytelling and really awesome practical effects. The action is refreshing and it got its innovation. The actors are much better than in theThe continuation of Mad Max is greater in every way; it's an action-packed adventure with great storytelling and really awesome practical effects. The action is refreshing and it got its innovation. The actors are much better than in the first movie, and almost everything is in fact much better than the first movie. The villain might be the only aspect that's not better than the first movie, but it's still awesome! This movie is one of its kind; it got great cinematography and the action is really well directed. Solid characters and surprising events are other great aspects of this movie. George Miller really did succeed with this second installment; it's everything the original isn't.",
      "review_date": "2016-04-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Classic, In the series, before the other great one (Fury Road), but still even today Great....\rMad Max 2: The Road Warrior. Mel Gibson Is amazing George Miller is visionary...",
      "review_date": "2015-12-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Unlike the first Mad Max film which this is quite good, Mad Max 2: The Road Warrior that many people say it's one of the greatest sequels ever made. Ever than that, I thought about it too. It actually is great. That is to say that I thoughtUnlike the first Mad Max film which this is quite good, Mad Max 2: The Road Warrior that many people say it's one of the greatest sequels ever made. Ever than that, I thought about it too. It actually is great. That is to say that I thought it's not as good as the first but other than that, I actually DO think that the sequel really IS better than the first! It has big thrills and big chase sequences that is when you're watching up the very end! The end chase sequence is fantastic and it's fast, furious and bigger. Mel Gibson is back as Max Rockatansky and he's leaving town after he defeats Toecutter and the motorcycle gang and now he's driving in the middle of nowhere along with his dog. Seriously. How did he get the dog? Oh, well, I think he got it from the pet shop and then continued on riding. Max doesn't talk until 10 minutes later and then kept quiet until he went to the compound where there're people who wanted to get out but can't cause of Lord Humungus and Wez played by Vernon Wells. If they got out, they will be killed. So Max and the Gyro Captain had to help the people get out and take the fuel tank. So why does Mad Max 2: The Road Warrior is better than Mad Max? Was it because of it's bigger thrills? Was it because of this sequel is one of the greatest films of all time? Was is because of the fact that it has everything that many people have got because it's bigger, faster, louder, but definitely not dumber? I would think so! I'll have to let you both handle this one. Whether than that many people prefer this one over the first is because of this movie gave the audience what they want. Bigger thrills and big chase sequences just like I said at first and that's just what they've got and in many respects, this is what I've got. This sequel is evocative in many levels and never suffers from many flaws. Mad Max 2: The Road Warrior is fantastic and it is one of the greatest sequels of all time!",
      "review_date": "2018-08-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Best Movie of the Franchise, Now Tie with Fury Road, The vision of car chases, speed, and post-apocalyptic of George Miller Is Brilliant!!!!!!!!!!!!!!",
      "review_date": "2016-04-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This isn't a great film, but it's a great 'B Movie'. Its a ton of fun if you don't take it too seriously. This was a childhood favorite of mine so take my score with a great grain of salty nostalgia. I still want a blue heeler because of thisThis isn't a great film, but it's a great 'B Movie'. Its a ton of fun if you don't take it too seriously. This was a childhood favorite of mine so take my score with a great grain of salty nostalgia. I still want a blue heeler because of this movie. Instead, I have a puggle. He's pretty cool though. I might have come to love the post-apocalyptic setting because of this movie, now that I think about it.",
      "review_date": "2016-09-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "There is no doubt why this post-apocalyptic western is one of Guillermo del Toro's favorite films. The new adventure of the asocial ex-policeman who must protect the inhabitants of the last gasoline refinery on the Australian plains hasThere is no doubt why this post-apocalyptic western is one of Guillermo del Toro's favorite films. The new adventure of the asocial ex-policeman who must protect the inhabitants of the last gasoline refinery on the Australian plains has exhilarating action scenes, especially for the motorway chases.",
      "review_date": "2021-04-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great movie & high influential of action genre, and it's no wonder because it's brilliant executed the story and fast action car chases sequences. Mel Gibson it's phenomenal!!! George Miller it's a Alien",
      "review_date": "2016-12-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Le premier Mad Max était un choc et posait les prémisses d'un monde déliquescent et décadent, le début d'une anarchie impitoyable ; le second pour sa part pose les bases du monde d'après, le monde post-apocalyptique dont se sont inspirés bienLe premier Mad Max était un choc et posait les prémisses d'un monde déliquescent et décadent, le début d'une anarchie impitoyable ; le second pour sa part pose les bases du monde d'après, le monde post-apocalyptique dont se sont inspirés bien des oeuvres, films, jeux et séries entre autres.Bien des codes de cet univers cruel sont autant de détails comme les véhicules faits de bric et de broc, les espèces de \"costumes\" délirants à tendance sado-maso, les décors sortis d'une brocante géante et le hurlement des V8 qui marchent à la nitro : un festival de tonnerres mécaniques, caricatures de \"l'ancien monde\" qui a encore la tête dans le pétrole.Des survivants tentent de survivre, assaillis par la bande de dégénérés et de cinglés, rassemblés en une tribu de maniaques aux ordres du grand manitou au masque de psychopathe... Le monde post-apo est revenu au plus bas de l'échelle humaine, rétrogradé à la sauvagerie la plus basique et Mad Max 2 en dresse un portrait brutal mais aussi très ironique et grinçant : on en ricane et on en jubile, à la fois horrifié et fasciné...Et Max \"le dingue\" dans tout ça est l'anti-héros parfait, presque aussi brutal que les autres, désabusé et vagabond, paranoïaque et misanthrope mais encore \"humain\" malgré tout et malgré lui... C'est évidemment le rôle qui a lancé Mel Gibson, très à l'aise dans son personnage cynique, sobre et charismatique.L'action est évidemment spectaculaire dans ses cascades et impressionne encore aujourd'hui avec ses poursuites. La réalisation est par contre souvent brouillonne, très \"brut de décoffrage\" avec un montage agité et même quelques accélérés (!). Et bien sûr, l'effet de surprise du premier film s'est estompé, l'impact n'étant clairement pas le même.La musique de Brian May est tout aussi agitée et furieuse, trop vociférante par endroits, heureusement plus convaincante dans son thème principal solennel et fin de règne.Nonobstant ses quelques bémols, cette suite du premier Mad Max demeure jubilatoire et terriblement efficace... et sauvage jusqu'au bout des pneus.",
      "review_date": "2017-12-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The future may end up being like this film, if humans keep on the way they are.  It has a prophetic, warning feel to it, which is part of its power.  It chillingly rings true to human nature.  \"They had built a house of straw...\" and we'reThe future may end up being like this film, if humans keep on the way they are.  It has a prophetic, warning feel to it, which is part of its power.  It chillingly rings true to human nature.  \"They had built a house of straw...\" and we're living it today.  Yep, we'll probably all end up killing for gasoline, banding together in terrified groups in improvised fortresses with medieval jury-rigged weapons, and eagerly eating canned dog food (if we can afford it in the post-apocalyptic barter economy).  The bands of marauding killers will prey on the ever-shrinking bands of decent people trying to sustain a remnant of civilization.  Basically, it will be like Attila the Hun vs. the peasants of Europe, with the occasional lone heroic knight showing up to help the good guys.  And that's more or less what this film is about, with Mel Gibson as the nothing-left-to-lose knight of the road.A highly original, superbly well-made, riveting and immersive nonstop rampage through a grim and grotesque future that may well come to pass in 50 years or so... let's hope not.",
      "review_date": "2018-12-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "cynically dangerous yet firmly kind..Mad Max 2 3 And A Half Out Of 5\n\nMad Max 2 is a plot driven action feature that is a forward pass on its genre as it retells it with a genuine soul residing within it. The poetic theme missing in thecynically dangerous yet firmly kind..Mad Max 2 3 And A Half Out Of 5Mad Max 2 is a plot driven action feature that is a forward pass on its genre as it retells it with a genuine soul residing within it. The poetic theme missing in the previous is installed subtly that helps delivering the plot and the protagonist just the right amount of gravitas that it needed.Ticking for around 90 minutes, it is exhilarating and gripping, with a concrete material to offer to the viewers. The script isn't structured appropriately nor is it edited better, but it is undeniably a stand alone feature especially in its last act that is culminated into a long but entertaining chase sequence. George Miller; the screenwriter and director, has up the ante of the game with not only his explicit writing but his brilliant execution skills that helps the feature connect with the viewers frame to frame. The performance has improved a lot since last time by the protagonist Mel Gibson especially but it still is a bumpy road on this lane since it doesn't get much range to factor in and leave the essential impression. The chemistry among the characters is built-up in a subtle yet effective way and the makers being aware since it is the only piece of plotline that can and does resonate with the audience instantly.Mad Max 2 is cynically dangerous yet firmly kind on its advanced mythology that is worth exploring.",
      "review_date": "2018-06-30",
      "source": "metacritic"
    }
  ],
  "num_reviews": 47
}