{
    "rating": 8.1,
    "release_date": "2015-10-02",
    "num_reviews": 141,
    "genres": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "summary": "An experienced investigator confronts several conflicting theories about the perpetrators of a violent double homicide.",
    "reviews": [
        {
            "review_title": "A true film, and Excellent is a very small word!",
            "content": "Based on Arushi Talwar's murder case. Written by Vishal Bhardwaj. Directed by Meghna Gulzar. Starring Irrfan Khan, Konkana Sen Sharma & Niraj Kabi. I was not aware of what was happened to Arushi. I only knew that her parents have been proved guilty and they are still in jail. But this film describes something else. And after watching the movie, I can't imagine the life of her parents. Pannel Discussion scene is one of the best scene I've seen this year. Serious topic with a light humor, is Vishal's cup of tea. Irrfan can do everything. Neeraj Kabi is growing faster and faster. What should I say about Kankana! Tabu has a cameo too. Music by Vishal and Lyrics by Gulzar. Insaaf is the perfect song. No background music makes the movie real. Just a one superb background score, during the scene of murder. I have never seen any movie, in which the audience is sitting so quietly and enjoying, as this is not for single screen type audience. People are changing, so it's a good hope for the better Indian cinema. I've read in some of reviews that the movie is very disturbing. I found it too. Questions and questions are there in my mind. With an addition of sorrow. One poor mistake of policeman leads the case to nowhere. Just watch it and it will come in your thoughts for some days for sure. Not writing much, as I've to come out from the film.",
            "review_date": "2015-10-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Rusty Sword",
            "content": "Talvar led by Irrfan Khan is a must watch movie. Got a chance to watch the paid preview of the movie. I wanted to wait for critic's response to the film, but somehow decided to attend the preview. Meghna Gulzar's direction is gripping and thrilling. I am watching her work for the first time and will surely be eager to watch her future works. The film's narration is perfect and grasping, which result in an edge of the seat story. The background music is soothing and Gulzar made sure to give best for his daughter. There is not a single dull or bad moment in the film. Talking about the stellar cast in the movie, I have to say 'mind blowing'. Irrfan Khan does it again. He leads the charge like a boss. It's so much fun to watch him on screen. He is serious, funny, humorous, sarcastic, unapologetic, rude..everything he plays with an ease. I don't know the names of many actors, even though I know them by face, everyone did a fantastic job. It was great to watch a movie like Talvar on Gandhi Jayanti. The faults in the system, the non-interested investigating officers and the society..are properly represented in the movie. Thoroughly researched made the movie haunting and compelling. A MUST WATCH MOVIE. FINEST MOVIE THIS YEAR.",
            "review_date": "2015-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Outstanding!!! just give it a try.",
            "content": "I have never watched a movie like this. The direction of the movie was superb all credits to Meghna gulzar for giving us such a wonderful film and irrfan khan was as always giving gossebumps with his acting and my favourite Neeraj kabi just stunning.",
            "review_date": "2018-07-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Lot Of Insights On What Was Untold And Unknown",
            "content": "A movie stands on four pillars in my understanding - Storyline Cast Direction PerformanceThe storyline of Talvar is woven excellently. It portrays the Aarushi Murder Case and related facts in such an impacting manner that every bit of the movie is engrossing and intense. You need to pay attention to every stream of the reel. The intensity that is built quite early in the story stays intact after interval too. The ending is not at all abrupt. It goes with a number of intriguing questions that keep floating in mind even after leaving the theater. The story gets absorbed in your mind and heart and unknowingly or even if unwillingly it travels with you, stays with you and keeps haunting you and probing you with many questions. What if? Why that? How could it be? are the few questions that keep floating in your mind. It has been well written by Vishal Bhardwaj and the similar credit for screenplay too goes to Vishal. The movie runs for a little less than 2 hours and 15 minutes.The cast has been well chosen and what I feel is that these days there is some scientific mechanism behind the cast selection. Irrfan Khan as Ashwin - a CBI investigating officer. Tabu as Reema is Ashwin's wife and this time I would give her full credit for playing her role well. Ayesha Praveen playing the role of Shruti (based on Aarushi) had little to do but still in her short stint she impressed well. Neeraj Kabi as Shruti's father (based on Rajesh Talwar in the real incident of 2008 Aarushi Talwar's murder) resembled Rajesh Talwar and justified his role by playing it quite perfectly. Konkona Sen Sharma has played the role of Shruti's mother and she too did well. Some new faces like Sohum Shah, Gajraj Rao, and Atul Kumar were able to put substantial impact in the story through their role. It is Irrfan who must get full scores for outperforming so magnificently. But that is his foray and he has mastered to outperform whatever role he is given in any kind of story. He fits well in intense stories. The direction is by Meghna Gulzar and she must get full marks for creating such a great impact through her directorial skills. Performance by each individual has been fantastic. It will be difficult to find out who has done less as even the bad roles have been played in such a good way and with perfection. Overall the movie reflects how politics, media and judiciary can change directions of the justice. Finally, the blind justice symbol's unnoticed weapon has been highlighted but did justice finally win? You watch the movie and decide.It is a must watch movie, quite serious, intense and intriguing with no excessive and non-digestible masala; and/or item numbers. Good to watch with friends and family.",
            "review_date": "2015-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Irrfan Khan and the screen play gets thumps up !",
            "content": "I saw this movie in Toronto International Film Festival 2015. The story is based on real life event and is a tough one to make as most of the facts already are known to audience. Irrfan Khan was marvelous with lot of calmness and patience. The story revolves around him and he make sure that the pace of the movie and rhythm is intact. People who have followed the news may find this story incomplete but Vishal Bhardwaj made sure that the message of the movie is complete. The best part of the movie was that is was very gripping as well as entertaining. I do not want to go more in the detail of the story as that could contain spoilers. For people who have not followed news will find the movie lot more thrilling. The direction is good by Meghna Gulzar and it is good to have her back.",
            "review_date": "2015-09-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Frightening & Powerful!",
            "content": "Based on the 2008 Noida double murder case (the Arushi Talvar murder case), 'Talvar' is a Frightening, Disturbing & Unbelievably Powerful film. Director Meghna Gulzar delivers a tale so infamous & unsettling, that it hits you like a ton of bricks. 'Talvar' Synopsis: An experienced investigator confronts several conflicting theories about the perpetrators of a violent double homicide.'Talvar' left me spellbound. The way this story unfolds (clearly inspired by Rashomon), through multiple point of views on what might have actually happened in the crime scene, is often hard to watch. Who did it? What led to the death of the victim? Who was at fault? And has the law done justice? There are several questions that cross your mind while this story flows & sadly, some questions remained unanswered. Vishal Bhardwaj's Screenplay is top-notch. Its unforgivably unpleasant, but extremely interesting. He has adapted a real chapter of human-horror, into a brilliant, hard-hitting film. The Writing also finds humour at places, which I must say, is the scariest aspect of it. And yet, you laugh. That's how well-done this Screenplay is!Meghna Gulzar's Direction is excellent. She has hit the nail! Cinematography is claustrophobic, complimenting the narrative's mood, perfectly. Editing is crisp. Bhardwaj's Score is moody, but haunting. Performance-Wise: Irrfan Khan is unstoppable. The National-Award Winner is masterclass here, enacting the no-non-sense investigator, flawlessly. Neeraj Kabi & Konkona Sen Sharma are terrific as the parents under torment. Sohum Shah is superb as Irrfan's assistant. Gajraj Rao crawls your skin as the despicably unorthodox cop. Atul Kumar leaves a mark as a fellow investigator. And The Magnificent Tabu is ever-effective in her cameo as Irrfan's estranged wife.On the whole, 'Talvar' needs to watched, because it makes you think. How rarely do films nowadays do that? Run to your nearest cinema now.",
            "review_date": "2015-10-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Thoroughly researched, well executed",
            "content": "The 2008 murder of Aarushi Talwar and Hemraj Banjade and the subsequent investigations, of which Guilty/Talvar is the fictionalized account, are complex, with multiple official points of view, compromised evidence, and of course breathless media accounts with unnamed sources, rumours and innuendo. The views on this case are polarized and often hardened, so how to make a movie about it? Vishal Bhardwaj and Meghna Guzzal took the time to scrupulously research the case, and present a Rashomon-like telling of the story with multiple viewpoints, allowing the viewer to conclude which case is most compelling.The acting is superb, and despite the many details, the editing it tight so that the movie is gripping from start to finish. Highly recommended.For those who want to go deeper into the case, and into the trial that followed (which isn't covered in the movie), Avirook Sen's 2015 book \"Aarushi\" is detailed deconstruction of the case.",
            "review_date": "2015-09-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A story may have many versions, but this story has only one.",
            "content": "This movie is based on true story of what happened in Aarushi Talvar's murder case. It is a beautifully orchestrated movie which shows the deep realities of functioning of police administration in India.Other than the story part of this movie, which is at focus here, Direction is great. Vishal and Gulzar have done a tremendous job to get the best out of all the actors in this movie. Acting is simple and superb. Irfan Khan has time and again showed us how powerful an simple act can be.Now to the story part, All that is needed to know what actually happened in this case is common man's logic and official statements from court, police etc.You know Who is a caged parrot? CBI That's who. And these are not my words, these are words of Supreme Court of India. The law regulating CBI is structurally flawed and it is deliberately so. We need separation of CBI from Parliament and politicians like in U.S., if we want any positive change.India needs more movies like these.",
            "review_date": "2017-04-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An underwhelming experience!",
            "content": "All those who compared Talvar with Rashomon clearly don't have a clue what Akira Kurosawa tries to depict in his groundbreaking masterpiece. It must be understood that Kurosawa never makes an attempt to lead the viewer. He just shows us the same event from four different point of views. And he doesn't feed us with lies (Talvar, on the contrary, comes across as a propaganda film), only the different faces of truth. Talvar, on the other hand, is a different ball game. Not that it is bad but one finds it rather difficult to appreciate its desperation as a work of cinema. Everything about the movie looks somewhat forced, as if someone is knocking at the doors of creativity in a hope to conjure up a semblance of realism. A craving for realism in an attempted \"Whodunit\" is not exactly the best idea.Neeraj Kabi seems to be missing his mojo (an actor of his caliber deserve meatier caricatures). Konkona Sen too looks a bit out of place. And while Irrfan Khan fails to bring his A-game to the table, his performance nonetheless is the movie's strongest point (his scenes with Tabu, who makes a guest appearance, are quite solid), especially thanks to his characteristic wry humour and wit that offer some comic relief at crucial moments. But even that is a bit forced. Don't believe me? Just consider him (and another character) referring to the Missionary Position as \"Dharam Pracharak Aasan\" and Pornography as \"Ashleel Sahitya\" in one of the sequences. Overall, Talvar, given its promise, proves to be an underwhelming experience.For a detailed analysis of the film, please visit my film blog \"A Potpourri of Vestiges\".",
            "review_date": "2015-10-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Flawed but above average police procedural .....",
            "content": "Full disclosure : I would have rated this film very highly if I knew absolutely nothing about the Aarushi murder case. So this is a subjective review.Talvar focuses mostly on three real life investigations into the murder of a teenage girl that shocked India - the first investigation by the police force and two subsequent ones by the CBI (name changed to CDI in this film). The police officers come across as total caricatures - they could have been Kader Khan and Shakti Kapoor from some 90s movie for all we know. Though it is possible that this is how the police officers conducted investigations in real life. It is quite obvious that the makers wanted the audience to look down upon the police officers. They are portrayed as a bunch of callous morons not worthy of our respect.I was a bit disappointed by Talvar. The makers had a very intriguing and widely covered and discussed murder case as material but they made the film without any sort of ambiguity. The film almost entirely absolves the husband-wife duo of any wrong doing.Konkona and the actor who played her husband are unremarkable. But they weren't the focus of this movie. Their story is in the background. This is one of the major drawbacks of the film. The tense film that focuses on the bumbling police officers and the efficient but cruel CBI officials fails to lend any voice to the victims. The horror of their situation does not really come through. I guess this is because the script almost takes for granted the inefficiency and callousness of the investigators.Irfan Khan is very good. This is one of his best performances, up there with Pan Singh Tomar. Though the flashbacks about his failed marriage were completely unnecessary. That space could have been used to expand on the horrors faced by the husband-wife duo.I would have made the film differently. Vishal Bharadwaj and Meghna Gulzar had gold in their hands. They could have done so much with the material. There were so many interesting themes in the background - the clash between urban and rural India, middle class impotence, media fueled voyeurism, the callous Indian police force and judiciary that mirrors Indian society itself etc. A longer film where these themes are foregrounded would have made the film so much more than it is.Instead, Meghna Gulzar and Vishal Bharadwaj gives us a routine and somewhat predictable police procedural.(6/10)",
            "review_date": "2015-10-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hypothetical Drama",
            "content": "Its just Ego factor that leads to utter failure. Two officers who r responsible for their actions gives us horrible fluctuations. This movie is more like a documentary. I wish it was solved. Gripping story with Non linear Screenplay makes it interesting. Climax is awful. Highly recommended. Must watch.",
            "review_date": "2020-08-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Must watch of the year.",
            "content": "Before going to watch this movie, everyone might have speculations, preconceptions, and many thoughts as to what the real thing happened. This is a true story which took place and was the talk of the country for years. Some have anticipation of what might be the truth, some have pre-decided views of what happened and some who didn't know what happened.Coming back to the movie, it consists of all the ingredients to make it a blockbuster. A murder, many suspects and absurd local police work results into special police to take up the case. Enter Irrfan and the whole case takes a new angle. Newer thoughts are given to the case as to what might have happened with help of logic.The major thing about this movie is its logic as to what might have truly happened. Some dialogues are comical and really make you see the funny side of some situations. As the movie ended I wondered whether what might have happened because of the twist shown in the movie. But nonetheless this movie has been made with precision and sticks to its main topic.The only disappointing thing, perhaps, was Tabu not getting much of a role. For a powerful actor like Tabu she should have got a much better role than she got. Irrfan is spot on and is wonderful in every scene and so is Konkona.Verdict: A must watch even if you know or not know what happened in reality.",
            "review_date": "2015-10-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "SUSPENSE GLORY.",
            "content": "Top class acting by Irfan Khan. So thrilling and disturbing. Great investigative drama and conspiracy thriller. The pacing is intense, the treatment of plot with 3 different investigations makes for an interesting retelling. Most shocking part of the movie was hpw things ended.",
            "review_date": "2020-08-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Disappointing, Debauched, Manipulative, Subtly by crafty persuading audiences",
            "content": "I wasn't in India during the famous trigger-happy media frenzy sensationalized Aarushi Talwar-Hemraj 2008 double murder case of Noida India, thus watching Talvar movie was a first time exposure on what actually could have happened. On the promotional campaign the Director Meghna Gulzar and Vishal Bhardwaj reiterated in every channel interview that they have presented the facts as it is – without taking sides and leaving in the end for audience to decide. Such claims added immense credibility and interest for me to see the movie.But I was thoroughly disappointed. Obviously, by the wrong claims made in promotion by them (they should not lie and fool the people) – because assuming they showed just actual facts (as them claim) the main purpose of the movie was clearly to show the parents were wrongly prosecuted due to blotched up police investigation (the movie shows that very effectively). The script, screenplay, writing, dialogues, casting, background score, using one- liners effectively (always in favor of Talwars), slight tinkering of events (that no one knows what happened – except what they show on screen) here and there, (to favor the Talwars). The movie was not only manipulative but intrusively playing on the psychology of audiences by misusing the power of cinematic medium. I found the movie serving the same purpose as the frenzied media – the difference was timing and intent. Clearly the purpose of the movie was questionable. It was well documented and no one can deny the way police messed up the crime scene and investigation and thus CBI (Central Bureau of Investigation) was brought into the case. But just use some intelligence and say that the first CBI team led by Ashwini kumar - Irfan Khan (who is shown as a drunkard, emotionally devastated with a broken marriage and divorce, a mobile phone gamester with short-broken attention spans, a violent investigator using beatings and torture, whimsical to the extent of beating the police officer with a stick, attacking a colleague in official premises) – how can he be believed? On one side, the police churned up the theory of claiming parents as murderers without evidence – is it not possible that after seeing the inadequate forensic and investigative report Ashwini kumar would have had presumed and decisively pursued to build evidence to prove parents were innocent and there servants were murderers? It is possible\u0085!Casting was very important - what impact would it made if the role of Ashwini was played by an unknown actor – and Irfan was casted as head of second CBI team. The audience perception would have had swayed to what the second team would say. Additionally in the movie Tabu was paired with Irfan to build another by-plot of hero-heroine to lend authenticity to Irfan's character as hero. Whatever hero says must be true- is the message audience takes back home. Very manipulative. Last 12 minutes the movie focuses two CBI teams facing and arguing each other in a room trying to convince each other about which investigation is true. This is another ploy by writer Vishal Bhardwaj to get away with the real court scene (which was fact of what actually happened in arguments) and replace it with a fictional scene and presented distorted debate – instead of real one. Obviously court would have looked into much details the arguments of both parties – the defense and prosecutors teams. Close observers of cinema tactics who are really intelligent would immediately question this – Why the Director/ Writer duo should do such a thing and get away with showing at least 5-7 minutes of court arguments that lead to parents prosecution. Very disturbing when the pseudo – intelligent critics and reviewers applaud such a crafty and bogus manipulation.There are rumors as claimed by a Director Manish Gupta who made another fictional movie 'Rahasya' inspired by Aarushi murder case, that the Talwars had approached him to make a movie showing them as innocent, and when the Director didn't agree – they wanted to ban the release of the movie.The producers & production services is unprecedentedly (never seen ever before) using the print media of a leading national daily to promote sway the readers and audiences with two page paid news-coverage for four continuous day since release of this film. Says a lot about what is the intent to push the content of the movie. Is there anyone behind leading this?During the whole movie I found numerous instances where I clearly saw – how the Director and writer are mis-leading the audiences – rather than giving unbiased and factual evidence. I would not go into details of each instance, but will close this review by highlighting the last scene where it is shown the parents entering the jail after being found guilty by the court and the manipulative sad back-ground score playing – stating parents are innocent and this is what should linger in the minds of audiences who walk out of the theatres. Debauching!I am skipping discussing acting, direction, cinematography etc. due to lack of space.I am disappointed with lyricist Gulzar's daughter and I have no doubt but to question the integrity of the duo – Director Meghna Gulzar and screenplay writer Vishal Bhardwaj. Apologies and sorry!If I had heard them saying in their TV interviews that the movie is shown in favor of Talwar parents, I would had certainly rated this movie 6.5, but now...(Rating 4.5 out of 10)",
            "review_date": "2015-10-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Consistently enjoyable but could have been better",
            "content": "Meghna Gulzar's film is a bumpy ride but it's consistently watchable and enjoyable. The film's first portions are a bit messy and require patience and attention, but once it picks up there's no looking back. Interestingly, the film is not written as a taut thriller but rather an absorbing suspense. The Rashomon effect works in its favour, but sometimes something is missing, and above all, the ending will leave most viewers dissatisfied and quite disturbed given the direction the story adapts throughout the film and its development.Technically the film is quite impressive - the cinematography is effective and the sets are most real, helping the director achieve the film's authentic feel and almost documentary-like delivery. The acting is very good especially among the minor players, like the maids and the staff. Irrfan leads the cast with a fantastic performance, as usual, achieving everything with great minimalism. Konkona is given a thankless role and she's almost a prop. Tabu must have been just a favour to a friend. But Talvar works, despite its misgivings.",
            "review_date": "2022-03-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Disturbing.... Yet Mind Blowing......",
            "content": "\"Talvar\" is based on Noida Double Murder Case of 2008, in which a 14 year old girl (Arushi Talwar) and 45 year old servant Hemraj Banjade) were found murdered for which the parents of the girl were convicted for life time imprisonment. The murder case gathered a lot of light in the media and still the case remains unsolved. The makers of the film should be commended for the subject they have chosen. Indeed the film makers had the guts to tell a story which many won't dare to. The story has a lot of strengths such as it exposes how the police, the first ones to reach the crime scene, work carelessly and are unsuccessful to secure the evidences. Besides, it exposes different methods of interrogation by CBI, like narcotic interrogation. The film dramatizes the names of the incident and turns into a feature film instead of documentary. Despite the strong story, the film has its weaknesses. It hasn't freed itself from the regular image of a CBI officer played by Irfan Khan. Don't know why the second phase of investigation by CBI doesn't look very interesting or convincing as the first phase. Anyway, on the aspect of the story, the film still remains disturbing yet mind blowing.Rating: 2 stars out of 4",
            "review_date": "2016-06-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "India is full of Injustice & Overly Judgemental People",
            "content": "Like Most Indians I had heard of the Aarushi Murder Case on the news channels & had believed that The Talwars were guilty But A few days back I read the Book Aarushi by Avirook Sen which left me extremely shocked because the book tells the exact facts related to the case which provides a completely different angle to the case.The Movie Talvar is based upon these exact facts and brings out the case in such a manner that every person watching the movie would feel like entering the movie screens & slapping the policemen and C.B.I officers. The acting of Irrfan Khan and all other actors is brilliant & in the last 15-20 minutes which is a face off between the two cbi teams, you just feel like clapping for each and every dialogue of Irrfan Khan.This movie is a slap on the face of the Indian Legal System. The Talwars are in Dasna Jail for almost 2 years now. All we can hope is that this movie contribute in some way to bring them to justice because as Irrfan Khan said it is better to let 10 criminals go rather than convicting one innocent person .A Must Watch Movie for Every Indian.",
            "review_date": "2015-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Scariest Hindi movie..",
            "content": "Apart from the storyline, the performances of the director, scriptwriter and actors, what stayed with me was how scary this entire matter was. The incompetence of government officials is not something that we are unaware of, but when it results in incorrect convictions of innocent individuals that are already suffering from the horrifying manner of the death of their only child, it generates a disturbed feeling that stays with you longer than any silly movie that calls itself horror.Move aside, Conjuring and Insidious and Ring and Fridays and slashers and zombies. *This* is genuinely terrifying, in the \"it could so easly happen to me\" mould. Congratulations to everyone involved in the making of this gem.",
            "review_date": "2020-09-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brilliant!!!!!",
            "content": "Kudos to Vishal Bharadhwaj and team for bringing such a heart wrenching movie to celluloid. Appreciate the honest attempt of Meghna Gulzar and heart felt applause to the research team for their study on this particular murder mystery. Hope things change in our existing system and things become more clear and visible when it comes to justice. And even feel great to be born in the era of Mr. Irfan Khan the finest actor every bollywood has produced till now. Sir hoping to see more from you. What intrigues me in the whole time span during watching this movie is it gets more intense as i start comparing what we read in the newspaper and what exactly might have been happened is completely different. People in the power to fulfill their ego make some wrong moves and make the public suffer because of their ignorance. Anyways lets not get into this and wish the whole team congratulations.",
            "review_date": "2015-11-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Talvar",
            "content": "This movie based on true events that who killed a14years old girl. The acting of Imran Khan was excellent and he performed naturally. This was one of the best crime investigation movie that moves slow but it doesn't make viewers get bored. More than a film it will make us an unexplained fell in our heart at end. A must watch movie, don't miss this.",
            "review_date": "2020-08-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Could be the best Option to represent India in Oscars",
            "content": "TALVAR - I think Vishal Bhardhwaj could have a great carrier as story and screenplay writer. As he is a visionary , but the problem has always been that he finds it difficult to compromise with the commercial needs of Bollywood audience. That's why not always (because i also like to see VB directing movies) but sometimes (mostly in case of real stories) its good to give VB only the writing department and give the director's chair to someone else who can keep a balance between critical and commercial needs of the movies. Meghna Gulzar in this case has done a great job in that department. Coming back to the movie , as the movie is based on Noida Double murder case which has earlier been portrait in a movie named Rahashya but not much in a detailed manner , i personally will not judge the movie comparing its facts to the real event. It will be judged by me as a movie i.e., how entertaining and gripping it is as a movie. Watch out for the word ENTERTAINING i used as BORE is a word which doesn't apply to any of the scene in the movie. Basically the plot is that First the police department investigates but quite liberally , harassing the total crime scene so that they can force their foolish judgement . Which is of coarse not accepted by the country and its judicial departments and the case is handed to the CDI. The time when we think we get the result , the politics and conspiracy withing the CDI pull back all of us to where we have started and a second team is created to investigate from the start. In a Pre-climax scene we get to see two teams of CDI fighting each other verbally on what right conclusion they have got and whats wrong in the judgement of the other team. That's the best part of a movie which is already in its top form. Its like i personally can give 11 out of 10 to that particular discussion. The film clearly portraits how bad our executive departments have become , that they doesn't care much about what their job is , rather the inner politics is spoiling it all. And if anyone tries to do his job earnestly , they also have tricks to destroy all his efforts. The movie itself never forces its judgment on you , it only wants to show you the fact. Yes of coarse the story has been purchased from the Talvar Family by paying copyright prices so defiantly you can say the movie is favouring a little bit to Talvar family , but i cant say that its a biased movie. This is a back to back success for Irfan after PIKU. Can't think of any other actor who could have done this (not even Nawazuddin , may be Nana Patekkar in his young days , but no one else) . There were no grand entry for him , rather he built his character scene by scene , also not emoting in a same manner , rather we see different sides of his character. Its like even for Irfan this character would have been difficult to do. Konkana Sensharma was good in every scene except in one she just wake up to open the door for her maid but she didn't acted much like she is just woken up from sleep. I guess that's just a silly mistake from a great actress. But in comparison to her Neeraj Kabi as his husband was much better through out the movie including that particular scene i was complaining about. As Police Officer Gajraj Rao needs a special mention who handled the earlier investigation is such a liberal person cracking jokes on a crime scene , i could feel myself how bad a parents whose daughter has been killed last night would feel in front of that pathetic police officer. The dark humour , signature style of Vishal Bhardwaj is always their. I have never laughed so much in any of the movie to which VB is connected , not even in KAMINEY which is my favorite in his filmography. I find TALVAR even better then that. Background score was subtle and perfect which is not to play as distracting rather just go with the flow give actors to do their job. Meghna Gulzar as a director has not done a single wrong thing. Actually a single complaint which i have from the movie is that the investigation done by the 2nd CDI team has not been shown in much of a detailed manner as compared to the investigation done by the first team. That's actually depressing for me as i was so much gripped by the movie that i could have watched it easily if it would have at least 30-45 min long. I am actually complaining about the movie being short. This for me could be the best option to represent India in Oscars. If i get the award to give to the best movie of this year in Bollywood till now , i am going for TALAVAR. Its my personal request to my reader that don't waste money on Singh is Bling (which although i haven't seen but i can predict how the end result will be) and make such movies to go forward to 100crore club just because its light hearted and it has Akhsay Kumar. Go watch TALVAR and help it to become a hit. Yes of coarse only if you like intense thriller with a lot of Dark Humour. 9.1/10. By ANuP APu KuMaR.",
            "review_date": "2015-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A biased depiction of a true story",
            "content": "Movie started pretty solid, but just after 5-6 min, satire was more in the movie than the story. After CDI took over the case, it seemed that now, the story is moving in the right direction but then the scenes from the personal life of an officer didn't make any sense. What do they wanna show? Is it a movie about a double murder case or that one particular CDI officer? Then again another googly. Another CDI team, another investigation from the scratch. But this time, director seemed to be in much hurry. This whole investigation is shown in 5 min in comparison to an hour of the preceding investigation when both took place for 90 days in the movie. It felt as if the director supports the first investigator. Then the meeting between the two teams of investigators made me realised that this movie is actually about the investigation (not murder or the officer). Overall, the direction is weak. If you already know about the actual case, I'll suggest you to skip it or you'll be disappointed.",
            "review_date": "2015-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Irfan Khan is 🌟",
            "content": "The movie is based on a real life event and the case remains unsolved yet the movie tried to gain audience's sympathy towards the parents.\nIrfan Khan as usual is amazing!If we set aside the facts about what happened in real life, then the movie is very good, definitely worth watching.",
            "review_date": "2020-10-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A good thriller based on a true murder case.",
            "content": "I have grown up watching many different thrillers on television, that includes the Crime Patrol TV Series on Sony TV which also shows cases and investigations based on true crimes and incidents.Talwar is a similar concept. This is a movie based on the 2008 Noida Murder case where a teenage girl and house servant were found murdered in their house and after a series of investigations by both the police officers and the CBI, the parents were convicted of the murders.This movie tries to cover up all the aspects of the case and how the investigations were conducted by the police officers and CBI and it is done well for the most part. The carelessness of the police officers is shown at the start of the movie and how poorly it was handled resulting in the loss of crucial evidence. The investigation conducted by the CBI teams is also shown where two different teams use different approaches to handle the case. Motives of the murder by both the parents and the servant's friends were also investigated. Although it is evident that the parents in this film are portrayed in a sympathetic light and they seem like the victims here. However, after reading about the original murder case, the parents behavior and the answers they came up with during the real investigation seemed very shady. The parents in this film feel like they were heavily victimized and the police just blamed them to cover up the botched investigations. Which is to an extent also true when it comes to the real case itself but the parents were also being very suspicious from what I read about the original case. Regardless of this aspect, the film's direction is very good, and it kept me on the edge of my seat to see what happens next, and what other turn would this investigation take. Acting wise Konkona Sen Sharma and Neeraj Kabi perform well as the victim's parents. Irrfan Khan is excellent in his role as CBI officer and offers some humor to the film, although I feel like his side romance story with Tabu was not needed in the film. The other actors are fine, the actors who play as servants could have performed better honestly, I understand the Nepali origin of their characters but the performances seemed lacking in some cases. The film concludes as the original case did with the parents being convicted although in the end of this film it feels like something was amiss and the wrong people were charged with the murders. Honestly we will never know, the decision has been made. Talwar is a great film with does a good job of portraying all the angles on the Noida Murder case on screen. Any fan of crime thrillers should watch this, even ones who don't about this case will entertained for this film's entire duration. Overall Rating: 8/10",
            "review_date": "2016-01-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Talvar- an intriguing and gripping tale of horror, reality, emotion...",
            "content": "Recently watched the movie 'Talwars'. An intriguing and gripping tale of horror, reality, emotion immaculately stitched by Meghna Gulzar, the director of the film. Once again she proved that We, the common people follow news through newspapers, news channels but only what 'we are made to follow', that is how a perception is being made. Not sure we should call it cognizance or ignorance? It again reinstated the pathetic condition of our Indian judiciary system...! In law it says \"Innocent before you are guilty\", here the state of fact reinforces \"Guilty before you are innocent\". Don't miss it...please go and watch the movie, highly recommended!!!",
            "review_date": "2015-10-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Truth Is Still Out There",
            "content": "Fourteen-year-old Shruti Tandon and middle-aged male servant Khempal are found dead, and Shruti's parents, Ramesh (Neeraj Kabi) and Nutan (Konkona Sen Sharma), become prime suspects. The botched original police investigation brings the case to top agent Ashwin Kumar (Irrfan Khan) from the Central Department of Investigation. This thriller, directed by Meghna Gulzar, is based on the real-life 2008 Aarushi Talwar murder case that happened near New Delhi.The details of the actual murder case can be gleaned from here: https://en.m.wikipedia.org/wiki/2008_Noida_double_murder_case. The movie on the another hand does a great job of laying down the facts, the absolute mess of the initial investigation and the gross miscarriage of justice. The murder may look like an open and shut case - four persons were in an apartment locked from the inside, and two were dead. The chief suspects are as obvious as daylight.The movie uses an almost documentary point of view as we follow not one, not two, but three investigations that led to different conclusions. The crime is horrendous and gut-wrenching, and I remember reading it in Straits Times a few years back in which the courts convicted the parents of committing honor killing. How a father could slit his daughter's throat from ear to ear is just unimaginable. But I guess I spoke too soon when a few days ago we were astounded when a Caucasian father allegedly strangled his five-year-old son here in our very own Singapore.The narrative employs a Rashomon angle to give us the details in each of the investigations. But the thing about Kurosawa's masterpiece is that he wasn't asking us who is lying, but he was questioning us on what is the truth in each story. In Talvar, Vishal Bhardwaj and Meghna Gulzar's hand is too heavy in that they are forcing us to take sides. In a multi-faceted investigative procedural like this I have a feeling that it would work better if it takes an even hand and forces us to make the conclusion for ourselves after we have absorbed all the facts. I didn't even feel the element of crucifixion by the media and public is evident. Some really missed opportunities IMHO.However I would be lying if I said I didn't enjoy the gripping movie. I couldn't believe 132 minutes whisked pass just like that. Irrfan Khan is in his element again playing the investigating officer and he adds little clever details which give his character heft and vulnerability. Hollywood just doesn't know how to use him and Life of Pi and Jurassic World are not a great measure of what this actor is capable of. This is one actor who can elevate any film to a higher level and in the case of Talvar he is superb.",
            "review_date": "2015-10-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Stellar performances and electrifying screenplay makes it an exhilarating watch !!!",
            "content": "The court cases in India are one of most complicated and tiring drama as it is a never-ending process and to make the matter worst – the murderers might get away free because of the incompetency shown by police officials. Indian Cinema has not only divulged into the subject of political thriller but has successfully ventured into spine- chilling films like Madras Cafe, Ugly or Haider. Talvar has its own share of story which has been blunt, hard-hitting and yet hair- raising.Based on the true incident of controversial Aarushi Talwar murder case that shocked the entire country, Talvar tells the detailed story of what really happened on the night of murder with different people offering different versions of that entire event.Based on Avirook Sen's recent book Arushi, Meghna Gulzar deep-dives into the real events behind the gruesome murder that changed the lives of so many people. Meghna takes one step ahead and provides a sharp and witty thriller which involves betrayal , confrontation and murder. She is in a great form after debacle Filhaal and comes back with a bang. Hats off to Meghna and her team for creating niche drama and doing fantastic research with well- written screenplay by Vishal Bhrdwaj (also the producer and music director) that will keep glued you on to the screen till the end. Couple of scenes are hair-raising – the scene where Irrfan Khan almost solves the case until he is betrayed by his fellow companion and the best scene is undoubtedly the debate session in the climax when two teams from CBI present their own version of story. Cinematography is just about okay. Art direction is natural. Background score gels well with the mood of the film. Editing adds crispiness to the pace. One thing was unnecessary insertion of marital-discord scenes between Tabu and Irrfan Khan which I felt was not required. Coming to the performances, it is Irrfan Khan all the way. Watch him as he builds up the character and gives his best at the superb dialogue delivery. Konkona Sen Sharma who plays the role of Aarushi's mother and Neeraj Kabi ( Detective Byomkesh Bakshy) playing the role of Aarushi's father are equally competent.Talvar is definitely a solid-punching drama that raises the question of flawed legal system, lethargic Indian judiciary and weak bureaucracy. Watch it to see the ugly truth. Excellent 4/5",
            "review_date": "2015-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very good suspense detective crime movie",
            "content": "Okay, it was difficult for me to watch Indian movie again. Last I watched Indian movie was like 8 years ago, 3 Idiots. I always have this prejudices toward Indian movies. Lately, I've been craving for suspense or thriller genre movies. I watched a lot in the last 2 years. Then my friend suggested me to watch Talvar, an Indian movie. I literally watched this movie because my friend swear on it. And damn, he was right.Talvar is a very good investigation movie. The pace is medium enough, and we were showed how Indian police work and how CDI, the elites, work. The story is intriguing, the acting is superb, and the depiction of real life is so detail and moving.I like this movie, because I felt like I'm in the middle of the investigation. I am surprised that the case is from real life. Wow.Now, I have a plan to watch some others Indian movies such as Kahaani, A Wednesday, and Byomkesh. I think I will fall hard for Indian movies again.",
            "review_date": "2017-07-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A directorial treat where great efforts have been put to portray the fine grains of this plot",
            "content": "Most moving part of the movie is when you realize that whatever you know has been shown in the first ten minutes only. That's how it's justifiable that it was so important to bring this story to everyone. A lot of hard work has been done for showing the fine grains of this plot. Around 50% of the movie is what no one is aware of and that's how all false perceptions were developed in these years. I'm sure the perspective towards this case and its family will completely change after this. Known fact about weak policing has been showcased in a very good way. Although we have great police officers but they constitute very few and are present only in the top level. Sympathy to girl and his family will again rise in the minds. Now the best part comes when all these details are shown in a beautiful cinematic way. Perfect kudos to the storywriter and producer Vishal Bharadwaj for putting great efforts in bringing this forward wonderfully.Meghna Gulzar is back after many years and she showed that the trusted potential in her was not incorrect. Rising above all, this was the ultimate directorial venture. Nothing rises above the effort that is seen in her work. Although a lot of credit share also goes to the veteran editor Sreekar Prasad. Their partnership did the real wonders in this flick.Acting of all the actors were above average where no one really blasted the screen. Irrfan was certainly better than all as he portrayed his usual amazing skills.Overall, a directorial treat where great efforts have been put to portray the fine grains of this plot.",
            "review_date": "2016-02-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A brilliant investigation drama, gets into every small detail of the Arushi murder case. One of the years best films.",
            "content": "The \"Arushi murder case\" has become a legendary story in India now, everyone you meet has there own theory, on who is the murder and why they did it. But as things stand today Arushi's parents rot in a jail cell for her murder. Like many others I have also used Wiki too look up the case details way before Talvar was made, so I went into the film thinking I know everything about the Arushi Murder.Well all I can say is that,\"you know nothing John Snow\" well jokes aside what I meant is that this film just blew my mind, with its new facts, its detailing, and almost complete unbiased approach. Rarely do you see Hindi films that are made like Talvar, a investigation drama, that doesn't leave out any detail what so ever. Therefore by the end of the film we know everything about the case, and can make our own judgment. And I must say even though we knew what the films ending was,Talvar still has so many suspenseful and thrilling moments. However a lot of things you see in the film leave you totally disgusted, especially the way cops handled the case but more on that later.Story wise the film is about the Arushi Murder case but the girls name is changed to Shruti in the film. The film deals with the double murder of 14 year old Arushi and her 50 year old servant Kempal, who was the first accused of the murder of Shruti until his body was found by the family a couple of days after Shruti's body was found. The film shows a detailed investigation of the murder case and how the local police first accused the parents of murder, but after there botched up rushed case is brought to the forefront the CDI (aka CBI) is brought in.CDI investigator Ashwini Kumar takes over the case and starts to unravel his own truth of how he thinks, two servants Rajpal and Kanniya murdered Shruti. His investigation makes up the crux of the plot.Rarely do you see so many superb performances all in one film but Talvar is a great expectation. Irfan Khan is excellent.Neeraj Kabi and Konkana Sen Sharma are superb.Sohum Shah is great. Gajraj Rao and Sumit Gulati are hilarious. The films ensemble cast is just amazing, everyone acted brilliantly even the smallest actor.A film like Talvar gets me thinking that how can India have such, out right dumb, and stupid cops. For example in the Arushi case as shown in the film cops ruined the whole investigation, the didn't collect any forensic evidence, they let people trample all over the murder scene, and they rushed through the case and blamed the parents for honor killing(like come on seriously). Seriously I have only scratched the surface when it comes to the case atrocities, and the media deserves a lot of blame too for the trial by media, and there sensualizing of every small detail. The CDI was also not be left behind with some dumb investigation of there own, and whats with the cops, and CID trying to look out for each others reputations etc in young girls murder trail. Have some heart no and give a fair judgment.But all these misjudgments in real life made from the amazing stuff in the reel life in Talvar. I must add that the film has some amazing dark comedy too, i found myself laughing aloud many times. But works for the film foremost is the way the Director Meghna Gulzar gets into every detail of the case, and the way the investigation proceeding go on it feels like the audience is a part of the case. And by the end of the film you are not only forced to think, but you cringe thinking of the outcome of the parents. I must add though the film is a little biased towards the parents in the case, and thats the only negative.Overall rarely have I enjoyed myself as much as I have while I watching Talvar, its a film that challenged me while I watching it, and thats something I cherish in a great film.Therefore Talvar is a truly thought provoking film. And its easily one of the best Hindi films of the year. Its just sad that the film might get a niche audience in India, because this film is a must watch,its some damn brilliant work that deserves global recognition. 4.5/5* or 9/10",
            "review_date": "2015-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Holly Mollly, what a lousy film",
            "content": "This film is a total joke. The screenplay is horrible, the directing is non-exist, the acting, well, since the screenplay controlled the ways of the actors to go along with, and the screenplay is so bad like a poorly patched kitchen mop, there was no way to ask the actors to perform well. But what turned me off in the very beginning was the terrible casting of the Indian cops who showed up first at the crime scene. I don't know how the movie casting would have picked a guy to play the chief investigator of this case. The guy was such an idiot and clown, a complete moron with such an ugly face, a sunken mouth kept chewing something that I could never figure out. Then when the crime scenes were shown, we saw the girl's body lied face upward with a cut throat, then the next scene we saw her face just turned to the other direction, obviously she was still alive since nobody touched her head yet. Then we got lousy editing job that made the movie scenes jump around randomly all over the places in different locations. Then we saw the moronic police investigator appeared on the screen, still chewing with his mouth grinding. At that moment, I couldn't help but thinking how come this jerk would be promoted to be a high ranking police officer? How it possible that this guy could even qualified for a policeman? The whole movie was a disaster and a totally unnecessary production. But weird thing didn't stop right here, the weirdest thing was there were so many viewers gave this god-awful film 7, 8, 9 even 10 stars! There were only 65 viewers like me thought it was just terrible and gave it 1 star. To me, this film should not be allowed to vote, because it's should be below 1 star.Anyway, those who gave high ratings for this film and those who gave it the lowest like me, should both have their brains checked out and at the same time, all of them should also check if they were watching the same movie, even the movie title was correctly matched. I rest my case.",
            "review_date": "2015-11-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent plot and very well filmed",
            "content": "I didn't know this was based on a true mystery but it is an excellent movie. I don't speak the language but with subtitled it was still very enjoyable",
            "review_date": "2020-09-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "As Good as a Movie About a Real-Life Legal Case Can Be",
            "content": "Reviewed by: Dare Devil Kid (DDK)Rating: 4.3/5 stars\"Talvar\" is taut, enthralling, immensely engaging, and one of the best thrillers of Indian cinema ever. It's an almost perfectly written procedural - the pace never falls off, and the entertainment and revelations never stop coming. The film delivers one gut- wrenching punch after another, and is a literal eye-opener. The insane amount of research that has gone into this movie is clearly evident, and makes the feel so much more credible even if the original names are not allowed to be used.We all know the basics of this story. A 14 year old girl was discovered murdered with her throat slit on her bed,and the servant was accused of being the one who murdered the girl. But then his body was discovered on the terrace of the same house in the very same manner. The blame fell on the parents who were accused of killing their own daughter and their servant. Ashwin Kumar (Irrfan Khan) of the CDI (department instead of bureau) is hired as the leader of one investigative group, and discredits the theory that the parents were the murderers. However, his assistant backstabs him and the case is taken away from him. The new team proves that the parents are guilty in a haphazard manner.The filmmakers embody the story with dark humor that subtly talks about the disparity in the diverse social sections of our nation, like how they inconspicuously highlight the difference in the ideologies between the personnel in the Uttar Pradesh Police Force and the parents who belong to the upper strata of the society, or the different outlooks between the regular police officers in our country and the special crime branch officials. \"Talvar\" is a taut, edgy, and groundbreaking thriller for everyone, more so for the ones who don't know much about the case or have had their opinions completely influenced by certain sections of the media. It looks as realistic as it's possible to shoot a film in India. The camera work is not showy, the editing is not too flashy,and the costume design is very good. The background score also makes sure to not attract too much attention to it, and keeps the proceedings focused on the story, drama, and revelations on screen.Coming to the performances, if Irrfan is the heart of \"Talvar\", then Konkona Sen Sharma and Neeraj Kabi are the soul of the film. In fact, Talvar is one of the best cast films in a long time. Everybody is at the top of their game, and Meghna Gulzar manages to extract great performances from all her actors, even the bit players. Anybody with any interest in good, serious, moody cinema should certainly watch \"Talvar\". It's a fantastic case study of one of the most talked about legal procedures in post-independence India.",
            "review_date": "2015-10-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Enthralling and exhilarating joyride!",
            "content": "India's biggest unsolved case couldn't get a truer justice. Talvar is simply mind-boggling. From the engaging frames of Meghna Gulzar comes a tale without a tail. An investigation that will leave you at your wit's end. With Vishal Bhardwaj's magnificent writing comes a piece that will let you fathom the 'what' and leave the 'how' for you to figure.You can't really forget the Aarushi murder case ever. Primarily because of all the media uproar it had managed to garner. It was always the talk of the town and always playing on the TV. The media were in the search of their masala (spice) and boy did they get their masala. It turned out to be a case where the conclusion was dropped first and assumed true way before the actual investigation. A perfect resonance to a typical Indian societal head! It is brilliantly reflective of the shortcomings of the Indian Police as they failed to take things seriously. It is one helluva slap to the smug face of the Indian Constitution, and would always be remembered as a black patch in the historical leaflets of crime-solving.Irrfan Khan brings a unique vibrancy to the flick that is downright commendable. His innate acting skills prevail in the air, and bring with him the right attitude. Right from the moment the movie begins it has a natural flavor to it, something Gulzar has managed to capture perfectly. All the characters in the flick are very well portrayed and brilliantly enacted. It has a side story too to make things interesting with the protagonist, to take your head off the steam occasionally.Names have been changed for emphasis which is quite understandable looking at the gravity of the case and the propensity for things getting blown out of context.It leaves you with trillion questions, and a billion what ifs. If at the end of the movie you don't come up with a conclusion in your head, and don't find yourself gnawing hard pressing on the detective brain of yours, the job of the filmmakers would be incomplete.That is the beauty of the movie. It leaves you baffled, wanting for more, and a proper closure. But Alas! That's how life is. Unsolved.",
            "review_date": "2016-02-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awesome",
            "content": "Few months before RAHASYA released which also was based on the same real life case. But this film got an edge and also more acclaim. The film is brilliantly handled by Meghna Gulzar who ones upon a time gave us FILHAAL(2002) and what a comeback! The film keeps you on the edge throughout, all the twists and turns are well handled and several scenes hit you like a ton of a bricks. My only gripe with the film is the fun made on religion(the position of sex in a scene is shown as a religious way) which could be avoided. Other then that the film is superb. The film also makes you laugh at several scenes like the scene when Irrfan beats the cop and also later towards the end when both sides of the party argue.Direction is superb,Vishal Bharadwaj's presence does loom large throughout but yet she has done a good job Music is okayIrrfan Khan is excellent as always, he is one of the rare actors who gets into the characters so easily Konkona Sen Sharma is excellent as always, Neeraj Kabi is adequate rest are all good, especially Prakash Belawadi, Tabu has a cameo and is okay",
            "review_date": "2015-12-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Superb Movie Shows That Indian Law is Worst Law!!!",
            "content": "Hi All!!! This movie was Brilliant. This is a real story and it was really shown well hats off to all actors and Ace director was brilliant. No Coming towards the end, the parents are simply sent to jail and criminals are left and are roaming here and there!!! This is not Law!! Indian Law is said to be one of the Worst LAW'S Ever Seen...!!!! This was Frustating as a Citizen of India I Want all of you to watch this movie And Kick Indian law on its ass and make changes in that law so that we can have cases Solved not Cases Closed in FILES!!!! Please all of this who are reading this Please do it!!! We need it!!! and Most Important that Girl Who Died, Their Parents Need it........",
            "review_date": "2015-11-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Engaging till the last scene",
            "content": "Honestly I had high expectations from the movie as it casts genuine actors like Irfan Khan and Konkona Sen, that too directed by Meghna Gulzar. It exceeded by expectations in many ways. An intelligent, thoroughly researched piece that kept me engaged every moment of the film. It is unpredictable and not an overly 'tragic' looking film. The content overpowers the drama and human element. Irfan is effortlessly charming and witty, yet a hopeless character who comes an inch close to solving the case. It is one of those films that left me reading all wikipedia entries related o the real incident. Though otherwise humorless, Irfan's wry humor is a relief in few scenes. Konkona doesn't come across as an overly grieving mother, just as the script demands - leaving us wondering what the case really was. Though initially I felt she'd be too young to play a teenager's mother - the portrayal was perfect. Talvar doesn't have music to really speak of - but any prop like music was not needed to make this a great film. Lastly, I have officially joined Meghna Gulzar's fan club.",
            "review_date": "2016-01-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolutely brilliant.",
            "content": "One of Hindi cinema's finest thrillers, featuring a brilliant central performance from one of Hindi cinema's finest actors.",
            "review_date": "2020-06-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Must Watch",
            "content": "I saw this movie on 1st Oct. Its really very good movie which shows the activities and investigation status of Indian Police.We Need to improve the investigation level of our country police or CBI. I am surprised how CBI can ignore the convict if they are able to catch them. Our county top positioned law personalities has to show a active participation which helps to get the case resolved as soon as possible.I don't know what is the reality but after seeing this movie I will pray to the God please help if someone getting punishment which them didn't.Hope this movie will bring some change in the mind and working level of the laws.",
            "review_date": "2015-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "10 Flaws in Talvar Movie",
            "content": "Here are the 10 flaws in Talvar Movie1. Narco analysis as on YouTube shows that Krishna says that He did not murder 2. Irfaan Khan thinks you need to be superman to move a fridge 3. No scene to show why mother left the key on Aarushis door 4. Irfaan Khan doesn't bother to check mobile tower data 5. Shows 2 plus 5 people in house. Even watchman enters but parents unaware due to AC. But they can hear the door bell from the maid !!6. Krishna rather drinks after murder and goes to Aarushis room again to slit her throat .. 7. Parents never seek revenge or justice or look for any reason or evidence for death of their only daughter8. Hemraj is allowed to entertain guests after 12 midnight and also he is allowed to steal liquor from owner !9. 5 doors open and close at least 2 times .. Main Door, Grill, Terrace door, Aarushi's door, Hemraj's door.. Mother dint hear.. Father also dint hear.. 10. Thick Khurki can make surgical precision cut on some important nerveConclusion - Parents may not have murdered.. but they know more",
            "review_date": "2016-02-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Intrusive experience; reopens the case in depth!!!",
            "content": "\"Talvar\" is an intrusive experience; showing the ugly side of our manipulative Indian society, media, justice system & bureaucracy. Thoroughly researched and handled. Vishal Bhardwaj said it right, he would have gone under lot of pain while writing. Meghna Gulzar comes back really in a good way after 8-10 years of directorial hibernation. It should be her debut. The film explores the \"so popular\" case in depth and tells us what has been untold. One will feel ashamed, angry, emotional, confused on the account of our justice system and it's working. The best thing about this film is, it's not a over dramatic or melodramatic in tone. Every frame make it feel real. Kudos for bringing many perspective to one story. Can't forget the last conversational scene between CBI's team.",
            "review_date": "2015-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The sword of Justice.....",
            "content": "I was a teenager back in 2008, 15 years old, when the Aarushi Talvar killing took place, and soon it became a national sensation. This Meghna Gulzar film dramatises the investigative procedure behind the infamous incident. Obviously, cinematic liberties are taken, but the fact that the film is well researched shows on screen. Intense, dark, gripping, and a razor sharp satire all at the same time, this is one of the best movies out of bollywood in recent years. Irrfan Khan is outstanding as the CDI 'bond' Ashwin.Whenever you feel this is the best you have seen of him, he always pleasantly surprises you with another mesmerizing performance.Neeraj Kabi and Konkana Sen Sharma play the victim's parentsand their performance and are perfect. The film's biggest strength is the Rashomon-esque multiple interpretation scenes,which always keep you on the edge of your seats. Plus, the film is quite apt in its length.The climax sequence and the last lines leave you shocked and you feel a lump in your throat. Talvar is not to be missed. Rating: 9/10",
            "review_date": "2015-11-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Questions for the true events it is based on, yet great admiration for the film!",
            "content": "For a few hours after getting done with this film all that I went through was a strange sort of sadness and depression, that feeling of knowing that great injustice had been done. All of this of course because this film was based on, but this is also a fact that makes me wonder whether the film went a bit overboard in siding the parents, because it is not simply a film, it is based on true events. I ask myself whether the authorities of any country can be that blind to be punishing people who seemed quite innocent. I agree that it is possible that it could not have been possible to fully establish the friends of the servant being guilty, but then again, this nowhere means that the parents should be held guilty on this, especially since it was they themselves who got the case to re-open. Still, I have to keep in mind that the whole system and the authorities in question belong to a country like India. So there is indeed a great possibility of things being truly and to great extent as portrayed in this film. But then comes another question, surely the police and the investigation department can be incompetent and be corrupt, but still, according to the film at least, they weren't able to produce solid enough evidences that they should have been held guilty, then why did a judge act partially and give a verdict against them? What arguments were exactly given in the court that the judge was made to altogether hold them as guilty? Anyway, they have appealed in the Allahabad High Court I see. Let's see what they say. If that too rules it this way, then it's it will be a big set back to the theories proposed in the film. So this film has left me with a lot of questions, wanting to know more and more about the case. I have in fact even read about the case a bit, as is evident.Now, purely on the film, I cannot think of Bollywood having ever come up with a greater crime investigation film than this. Things have been looked at from every possible aspect, in fact going to the extent of actually getting the characters to act according to the every proposed scenario, and then every single detail has been shown in great depth. The beauty of the film lies in the fact that despite the number of issues they had to and have looked at, it remains just 130 minutes in length.Another great thing was how swiftly the focus shifts from the crime scene and the accused to the corruption within the investigation department and yet one doesn't even feel that.... It all seems being a part of things. From all this we come down to that hilarious, hilarious discussion between the two different teams who come to different conclusions from their respective investigation. Despite the fact that the film ends up siding the parents right from the time Irfan enters the scene, suddenly there was again a feeling of uncertainty once the new team takes up the case, but the aforementioned discussion of course completely seals the deal. All of it makes me conclude that this indeed has to be the best crime investigation Bollywood film ever. Still, there were loopholes in it, considering it relates to true events, the absence of the court room discussion being a big one (which could have shown what exactly influenced the judges), but treating it as a film, as some work of fiction, it is brilliantly awesome!",
            "review_date": "2015-10-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Khan really was the best...",
            "content": "Talvar is a solid, engaging murder mystery that works as reminder that America doesn't have a monopoly on troubled justice systems. CINEMATIC PET PEEVE: Has there ever been a character in a movie who says, \"It's an open-and-shut case,\" that isn't eventually proved to have been grossly incorrect?",
            "review_date": "2020-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Talvar.... A must watch film",
            "content": "Talvar is a thriller drama film directed by Meghna Gulzar. The film stars Late Irrfan Khan, Konkona Sen Sharma and Neeraj Kabi.The film is based on 2008 Noida double murder case.Talvar is a film that raises many unanswered question primarily towards the handling of the double murder case that happened in Noida in 2008 and shook the nation. The film very nicely highlighted that how the case got deep buried because of politics, race to take the credit of solving the case. Till date it was believed that the parents were the murderers but the film suggests otherwise.The acting in the film is superb and late Irfan Khan steals the show with his impeccable performance. Konkona Sen Sharma and Neeraj Kabi were equally impressive and so as the support cast.The screenplay of the film is slow but gripping and will keep you engaged in this whodunit film. The climax of the film is strong and raises a question mark on our judiciary system and also highlights how insensitive they are towards such insensitive crime.If you are willing to watch a no non-sense film with impeccable acting then this is the film for you.",
            "review_date": "2022-06-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Talvar",
            "content": "Excellent Movie. Everybody acted very well in the movie especially Irrfan Khan. The movie was so interesting and thrilling. The movie has no unwanted scenes. In the 1st half the movie went more interesting than 2nd half because it lagged a bit in 2nd half. BGM in the movie was also very good. The movie had a good story. Excellent Movie.",
            "review_date": "2019-03-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Dark and disturbing!",
            "content": "Talvar is brilliantly directed by Gulzar, and manages to tell two stories to the same murder case. SHORT REVIEW-The performances were good as everyone plays their part exceptionally well. Irrfan Khan stands out in his likable character. he once again proves while he's the most versatile star these days. the direction is award- worthy. BGM isn't quite noticeable as the movie works best when there is silence! Plus points- + Irrfan Khan + the movie shows that the case has been researched well + conference scene in the end + Screenplay + supporting actorsMinus point- - First half doesn't have as much excitement as the second",
            "review_date": "2015-10-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An Excellent Movie",
            "content": "Being an Indian one thing we unconsciously learn from the environment is how to become NUMB towards all the \"Filth\". Filth could be in any form, like sewer waste on the corner of street, Pan masala stain on the walls, news of politicians stealing public money, or honor killings. It has been more than 7 year since the Aarushi murder case was opened in 2008. Mishandled from the very beginning by the police and media generated awe among Indian middle class. After 7 years there is clear consensus among all the reinforcement agencies that parents are not the killers but as of today Parents of Aarushi are locked up in a jail near Delhi. This movie is the first attempt to bring this case to the People without taking any sides. Which might not have been possible within the constraints of police, CBI, government without offending one or the other. Even honest officers like Arun Kumar were crushed by higher officers with ulterior motives. This movie shows clearly what is Wrong with \"Mera Bharat Mahan\". IMO this movie is a loud message to all the Indians. If you don't start paying attention, your life will become another part of the \"Filth\". VIshal Bhardwaj, Thank you my friend. You have completed your civil duty for India very well. It has motivated me to raise myself above my own little problems and do something for others. Thank you.",
            "review_date": "2015-11-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazingly shown Murder case in 2 hrs",
            "content": "This movie is very well written and produced by Vishal Bhardwaj. The movie shows the real face of Delhi Police and CBI's second team which was handling that case. Konkana Sen did an amazing job, a wonderful acting by her and Irrfan Khan, well he is a superstar, he does his job perfectly in each and every movie.This movie has shown beautifully the complicated Murder case of 2008. Vishal Bhardwaj and his crew does need an applause for this movie, the way it was written, produced, directed and executed. Amazingly a must watch movie to see the harsh and brutal truth behind the 2008 Double Murder case.",
            "review_date": "2015-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An engaging and gripping take on a sad incidence!",
            "content": "Tone, Script & Story: The story portrays an incidence that occurred in Noida in year 2008. It involved murder of thirteen year old girl Aarushi Talwar and same family's 45 year old servant Hemraj Banjade. The essence of portrayal of true stories lies in the research carried out before their execution. More than that, I feel this movie is so much appreciated by critics because of the names associated.The only thing that was highlighted but not followed in the movie can be summed into statement - \"it is better to release 10 guilty people than punish a single innocent person\". If that would have been followed as the truth was not known, story would have gained one more point from me. Yes the movie is that good.Direction, Screenplay, Cinematography: It is Meghna Gulzar's best work as a director till date (yes it is better than Raazi). Other factors are justified as well. Music: Average. Acting: Very good.Final Verdict: It is an engaging and gripping take on a sad incidence, you will cherishing watching.",
            "review_date": "2018-08-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Talwar is a movie made with one eye.",
            "content": "The biggest challenge in front of a director while making a movie on a topic as much discussed as the 'Arushi Talwar' case is that what new to show to the spectator. So, director Meghna Gulzar decided to take us for a ride, the leave us at the same place, may be a little more informed. The case had multiple dimensions; that means a great opportunity for the director to leave the spectators puzzled which direction to go; but, the movie strongly depicts the story only from one predefined angle, somewhat neglecting the others, and thus coming to an abrupt end.I feel, complete justice with the scope of the film would have been done if both perceptions towards the story was shown with equal emphasis. In stead they chose to make a comedy out of the dissents. Screen presence of Irrfan Khan always seem to bring in a sense of enthusiasm in the spectators. The little one liners are crunchy. Light music goes with the tone of the movie. Give it a go, but don't expect to get out of the theater being enlightened.",
            "review_date": "2015-10-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Disappointing - Movie is not even as half good as the book.",
            "content": "I was very excited when I saw the trailer for the first time, but after watching the movie felt disappointed the way story has been shown in the movie. The movie story line is totally one sided and prejudice against the police. If you haven't study the original case and its proceedings & just watch this movie then no doubt you would find this movie very good, but make note that its not based on facts, better part is fiction or I would key parts have been omitted.Suggest you read the book \"Aarushi by Avirook Sen\" which is wonderfully written and has all the facts and findings about the case(that was admitted/not admitted in the court of law). Compared to the details and findings in the book, movie story lacks. Movie is not even as half good as the book.Though its not clear that parents are killers but the movie story line is bent totally to show that parents are completely innocent. Many important facts regarding the proceedings in the courts are omitted in the movie. Even the parents request to autopsy doctor to make sure that the word \"rape\" doesn't appear in the report has no mention in the movie. The guy who as ex-police inspector has vital findings but was made silent in the end due to some dirt, his findings are not shown in the movie. Another important point was that the bathroom in the Aarushi's(Shruthi movie name) room had two way entry. i.e Somebody can enter his bed room without opening the main door of her bedroom.Even after reading the book, its not convincing that parents are murders but for the sake or clarity the movie should have shown both sides. Fourth character in the movie(that with servants) is I think imaginary.",
            "review_date": "2015-10-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sticks to point",
            "content": "This movie made on the shocking double homicide that was sensational in India. But this movie sticks to facts and doesn't show sympathy to any suspects and it's made on neutral ground that's the point I liked and film is well executed and really a great film",
            "review_date": "2021-01-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An eye-opening thriller, extremely well executed murder mystery",
            "content": "A wonderfully conceptualized murder mystery putting an eye-opening twist on the careless investigative methods of some Indian police personnel. Ashwin Kumar (Played by Irrfan Khan) is called in to investigate as part of the central investigation bureau, with the politics in bureaucracy obstructing justice to the verge of ridiculing every theory on the sensational double-murder case of noida. An absolute masterpiece by Meghna Gulzar, with stellar performances by every cast member.",
            "review_date": "2017-03-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Got shocked",
            "content": "Got shocked by the way the investigation was carried out by 2 set of CDI teams who hold grudges against each other and the side effects of the same which critically affects the emotions of general public - This movie clearly starts with an investigation that is preparing to hide an important VIP from getting busted but it actually turned out to be something different looking at which you will get the shock of your life. To be precise, the findings carried out by the last team was totally illogical and makes no sense at all as stated by the judge in the movie. It is only at this point that movie starts to bore you and this movie seems to be perfectly all right from other aspects. Go for it.",
            "review_date": "2022-07-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "TALVAR - the sharp-edged \"trial by cinema\"",
            "content": "TALVAR is a sharp-edged suspense-murder-drama based on the 2008's \"Noida Double-Murder Case\" (involving a fourteen year-old girl and a Nepalese middle-aged male-domestic-help) makes one reflect on more- than the obvious.This film very intricately opens this highly-sensationalized case, and makes one revisit and recollect the incident with all the once possible scenarios. Through the allies of contradictory references and their comprehension (a.k.a. the translucent \"Rashomon effect\"), we come to understand that a lot went wrong.The slack of police in securing the crime-scene, collecting evidence with the forensics - compromised the better part of the initial investigation. Then came the so-called \"trial by media\" which not only over-speculated, but also maligned the deceased in the most character-assassinating manner while putting the parents in dubious lights, much before any sound-factual inferences were made. Followed, the special-investigation teams that tried to pull the threads yet, fell face down around the diplomatic executive safeguarding and the 'pulp-fiction' theories around this urban-legend. A film's sequence subtly mentioned (when the two investigative committees sat down to reach a conclusion) that every investigation must go through \"search, evidence and conclusion\"; ironically their order was conveniently altered and thus, fabricated around consequential evidences. Around this time, we're provoked to question our many social, judicial and legislative norms – practice of keeping domestic-helps, the freedom and mutual trust with the lower-sects of society, responsibility of government machinery to ensure justice, the modern-dynamics of parent-child relationships – a few in the endless debatable list. Nevertheless, unarguably the legal-judgment of the trial (or \"contest of lies and half-truths\") was not served befittingly with the apparent convicts gone scot free and the victims been convicted. For the miscarriage of justice, one could feel that if not the 'shame on system', it's at the least the 'shame on humanity'. Yet again, as a heartbroken man trying to come to terms with harsh-reality in the film \"Blood Diamond\", said – \"Sometimes I wonder... will God ever forgive us for what we've done to each other? Then I look around and I realize... God left this place a long time ago.\"The film is so far \"the best\" by director – Meghna Gulzar who managed to put together a thoroughly researched production with producer-screenwriter-composer Vishal Bhardwaj; an outstanding cast - Irrfan Khan (the righteous lead investigator), Sohum Shah (the associate who 'crosses-the-floor'), Gajraj Rao (the laidback, gossip-filled policeman), Sumit Gulati (the gossip-monging compounder), the most-outstanding ones Konkona Sen Sharma and Neeraj Kabi (the parents) – with enviable cinematography by Pankaj Kumar (\"Haider\") and editing by A. Sreekar Prasad (\"Dil Chahta Hai\"). Most importantly the film doesn't overdramatize the fact-line while covering all aspects in an instance of \"trial by cinema\". The film's 'whodunit' theme, though, objective enough managed to 'exonerate the convicted' in-theory, whilst echoing – \"Jis din samay ne aakhen kholi\u0085 Insaaf - insaaf - insaaf hoga\".Rating – 8.5/10 Verdict – An achievement of good film-making. An eye-opening, matured watch!",
            "review_date": "2015-10-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you want to try a bollywood flick, this one is OK",
            "content": "As an European I rarely watch any Bollywood flicks. This one was appraised by many as the best movie of the year (including only bollywood movies I guess). I found it to be average. I have seen a few Bollywood productions and this one had by far the most coherent plot and cultural differences did not make me feel like I was watching something from another planet which is the case most of the time with Indian pieces. If rated against other local productions Id give it 8.5 stars, if against western flicks I could be generous and score it 7. Looking something with a bollywood twist that is still watchable? Try this. Cultural differences can be amusing. Could not get over how the actors amusingly wiggle their heads around while talking. But if you are looking for an experience that compares to some of the top 250 on IMDb, that this is surely not.",
            "review_date": "2015-11-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worth",
            "content": "One of the finest thriller movie i ever watch. They showed up a real incidents and perfectly casted and screenplayed. Irfhan bhai ka best movie. Watch it. It will leave you on a two sided theories.",
            "review_date": "2021-06-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "True incident brought in to question",
            "content": "When i watch this movie i did not know about the true incident. I think rather than finding who is really guilt, director wants to bring the attention to the what can cause conflict between investigation teams.In the movie, there were three investigation units. The first one is very irresponsible. The second one was very careful and fact based decision making. And the third investigation just to turn around the decision of the second investigation.In here it what i understood was how the departmental competition running between personnel ranks and how it costs the public. And how to protect or destroy others to show your ego.Anyway the different aspect of the movie can be true or false. But the fact about failure of the investigation sytem is always true.At the end you may not happy because as per movie the killers are still out and innocence are going to jail. But remember this is just another side of the story.",
            "review_date": "2021-05-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hard hitting reality in the face",
            "content": "The negligence and corruption, with the pre-judicial nature of the Indian masses, is captured quite extensively in this. The diversity in dialects and accents shown is also a good contrast for the stereotype Indian movies.A good performance by all the actors, and sarcastic humor adds icing to the cake. Although Media played a big role in publicizing this sad event, the movie gives a bold and contrasting summary of how things happened.When Oliver Stone's JFK released back in 1991, the result was many public archives were made public. If this movie, or should I call piece of cinema, could also bring a similar effect such that media could separate itself from a criminal case, maybe justice would be served better.A neutral venue to carry out this case, was not provided to those found guilty and also the proceedings of law was circumstantial. Maybe those indicted were not guilty and the real guilty are still free? This question haunts and will continue to bother anyone who will follow this case.",
            "review_date": "2015-10-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Almost a perfect 10",
            "content": "Excellent movie, perfectly makes use of the famous Rashomon Effect and everything. The story is well told from each perspective, perhaps a tinge of bias to one of them, but that's excused as creative freedom. It's not a documentary, after all, even though it feels like one for the most part. That is also why it loses out on a perfect score. The makers had to invent new names for everyone it started to feel like fiction in certain places. I'd still strongly recommend this movie, however. As a standalone work of art, it is a splendid creation.",
            "review_date": "2020-12-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing!",
            "content": "Talvar is based on the Aarushi Hemraj double murder case which rocked the nation 7 years ago and still hasn't found a proper closure amongst the people involved. Talvar rides on the brilliance of Vishal Bhardwaj's writing and Meghna Gulzar's direction. The film is basically a docudrama which portrays objectively what might have happened in the Noida double murder case. The film does offer a good insight but i felt it left more questions than answers. The film definitely showed the parents in a little more sympathetic form and it is pretty evident.The film brilliantly shows 3 accounts of investigation and how the police botches up the case completely in the first place. The details are excruciatingly shown which takes the movie to a whole different level. First half is a tad slow but picks up in the 2nd half where the director shows the true class of the movie. Irrfan Khan and the rest of the cast have done such brilliant work that you tend to believe that this is not an work of fiction but something actual is happening before your eyes. The climax of the movie where 2 CDI teams(CBI's name changed) argue on why their theory is better is brilliantly written and shot. The narration is crisp, to the point amd doesn't walk around different paths and confuses the audience. Many people have demanded that this case should be reopened as they believe that the verdict passed is incorrect and the original killer is still roaming free. Every body has a different opinion to it, this movie should definitely stir things up again and may justice be done when it comes to that.",
            "review_date": "2021-10-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Watch it. There's hope for justice. Well done Meghna Gulzar.",
            "content": "Movie review: Talvar-No Spoilers-This is not a movie, it's REALITY in your face. How often we leave movie theater shaken from the core, head hanging in shame and heart full of anger. That's TALVAR for you. Lame judiciary and stupid insensitive Police department /CBI will leave your senses numb. This is most discussed legal case, yet the movie reveals many more intricate details of the double murder. Must watch for as astute moviegoer. It excels in all departments. Acting, direction, screenplay and subtle background score enhances every frame of movie. Editing could have be a little more tighter but it doesn't hamper the overall effect. Superb execution of an emotionally filled case.Gripping from the first frame till the last. It's a suspense thriller story told in a fascinating manner. It surely invokes senses of the watchers.Watch it. There's hope for justice. Well done Meghna Gulzar. Thank you for making this movie.",
            "review_date": "2015-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent story-telling supported by brilliant acting performances.",
            "content": "Meghna Gulzar manages to keep us on the edge of our seats with a taut screenplay. She had a cast comprising of some of the finest actors in Indian cinema at her disposal and she used all of them extremely well.Based on the infamous Noida double murder case, Talvar is the story of how a 14 year old girl and her housekeep are found murdered and the girl's parents are the main accused. This movie highlights how the first investigative team led by the local police botched up the entire crime scene and contaminated all the evidences, which could have made it a possibly an open and shut case. The indifference of the police and the hollowness of the Indian Judicial System is portrayed in an eerily realistic fashion. The worst part is that it's all true.Of the cast, Irrfan Khan as Ashwin Kumar steals the show, as the reclusive CDI investigator, who's personal life is in a turmoil and is handed over the charge of this infamous case. He's absolutely fabulous. You can't help,but laugh out loud whenever he ridicules the system or cracks a witty one liner. Neeraj Kabi and Konkana Sen Sharma as the victim's parents are also very good. Sohum Shah as Irrfan's deputy is good too. SUmit Gulati and Atul Kumar also do well in their respective roles. Gajraj Rao as the highly irritable and unprofessional police inspector who is the first cop on the scene is fantastic. Prakash Belawadi as the CDI chief who is approaching retirement and is a mentor to Ashwin, is hilarious in his cameo. Tabu, in her extended guest appearance, is the only weak link in the entire film. And this upset me considering she's one of India's all-time best actresses.The song Insaaf will give you goosebumps. It complements what is being shown on the screen extremely well. Kudos to Vishal Bharadwaj for the composition and the evergreen Gulzar for penning down such hauntingly beautiful lyrics, in an unfortunate age where anything can pass for a song.Lastly, A. Sreekar Prasad has done a spectacular job with the editing. It really helped to keep the screenplay interesting, throughout.This film is a must watch. It needs to be seen on the big screen to get a real grip on the case and why we were never convinced of the final judgment, right till the very end.Final rating: 8.5/10",
            "review_date": "2015-10-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not boring but ....",
            "content": "This film is a great attempt to engage the audience but there is something , something really missing or I didn't feel. .. Overall , I'm giving this 7/10 (which is actually good ..not best). Don't wanna spoil the film . A great thriller !!!",
            "review_date": "2018-12-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great great great.....engaging movie totally..fantastic",
            "content": "Still case not solved? What a shame!\nWhat's wrong with Indian police?police should help it",
            "review_date": "2020-12-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfect portrayal of Indian Judiciary System.",
            "content": "Usually I don't write reviews but this one particularly made me write one. What a film! The writer Vishal Bhardwaj is true gem.The story and gripping reality and fabrication and most importantly not mixing the storyline with craps.This shows how an investigation should go, read clearly \"Should\". But never goes. Watch it.",
            "review_date": "2021-08-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "bollywoood need more movies like these",
            "content": "Yesses. Bollywood need more actors directors writes like these.",
            "review_date": "2021-05-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good one",
            "content": "Acting and Dialogue delivery are the best in movie we can feel the movie all is about Imagination of a person in there point of view camera work is good color grading is good climax is natural like a normal and Real",
            "review_date": "2019-12-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mixed experience",
            "content": "Surely an engaging movie you will not feel worn out the mystery is great probably because of the original case irfan khan was surely the star his presence is felt and make viewer excited but some actors were below par in my opinion like the mom and dad I think they were over doing it especially in the start but it gradually started to grow on me starting that policeman was very frustrating but that is not a fault and the biggest turn off was the lame cliche twist of the officer betrayal I mean why I know this might have happened in real life but you could have come up with a more creative way but overall good engaging story it actually make me interested for forensic science.",
            "review_date": "2022-10-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Over the Top, and worst enact of a True story",
            "content": "I have read the Arushi murder case and heard about the 2 movies that came. This one and Rahasya. I had a chance to see Rahasya when it was aired on TV and I saw only 30 min of it. Later I couldn't and I made a mental note to see both these movies when I got a chance. I got the chance to watch Talvar last weekend when it came on TV and I saw it in one go.I read it here that this movie is like rashomon in terms of story telling.That made me watch it even more and boy I was tricked. I hate that line. I don't know if it was a publicity gimmick or cheap fact but Rashomon ???? If that is written by the movie team for publicity then its an insult to the cult rashomon.I don't have to tell the plot or the other relevant items as we all know about it, but I will tell why the movie sucked !!!Once again, as with lots or I would say most of the genres, Bollywod cannot make a genuine movie without adding the masala into it: We cant stick to the bare bones of a true incident and have to add cheap cliche's masala to sell itWhy was even Tabu in the movie with the divorce sub plot with irfan khan? Just to buy some time and increase the length and add a sense of personality to irfan's character. Well it sucked and just took the mind off from the already boring narrativeWhy did we had to bear songs ( in the BG ) but why?The aarushi murder case itself was pumped with emotions and suspense and drama, which handled well could have been thrill of a lifetime but no, Director needs to add all the jazz to spice it up and in the end it left a bland tasteThe screenplay and edit was illogical and vague for the most part if he was trying to create rashomon effect which by the way was not even miles nearIf you have seen rashomon, you can feel every word, scene and the way it seamlessly flows on the screen to capture the 3 perspectives of the same story and doesn't leave a gap or a moment for us to breathe outTalvar does exactly the opposite, its just 1 level up than Crime Patrol but Crime patrol on Sony is hell better in retaining suspense and making it enjoyable. Talvar was just a power-point presentation with some good actors and sub plots thrown in at randomVery disappointed, and considering the stars here on IMDb, I can feel how easy it is to get better ranking in Bollywood movies. It doesn't deserve more than 6 stars, but people in reviews are praising it like anything which is sad. I am sure most of them have not seen rashomon or other movies that create, maintain, thrill and evoke drama and emotions from the audiences when we have such a topic.Most of the scenes in the movies were dramatically enforced to the audience that \"wanted\" to show what is being done. and most of it was irritating as the cop who came to investigate for the first time. Deliberate attempt to show that the investigation was botched up and it looked naive. I have seen police investigation in India and I know they are not top quality but in this movie they wantedly made them look like jokers and it was irritating.Irfaan Khan was straight out from the Vodaphone Ad and just like in almost all movies, he had the same straight head expression.Its based on true events, so basically the makers had full option to make it RAW and Brutal as it was and ensure full grip over the presentation. But it wasn't, It had all good actors for sure but the presentation was too naive and amateurish. highly disappointing and the ending was too hurried and simple. We all know the ending but still it was far from perfection for an adaption. Need to wait for a few more decades to get a good True story movie to be made in Bollywood. Watch Crime Patrol instead, you wont be disappointing anyone !!",
            "review_date": "2017-06-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A classic example of using the power of television",
            "content": "Talvaar is an example of how to fool and sway the public's opinion and getting away with murder. All you need is money and connections. Rest the world will believe anything on the telly.We have murderes roaming free.",
            "review_date": "2018-08-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Zero Star For The Movie Motive..",
            "content": "Talwar Movie Review:It is a pathetic attempt to try to prove the Talwars innocent... Specially at a time when the couple have appealed at SC for their Conviction. The Logic provided to support the Talwar's and convict the servants were so illogical.... 1. No 1 Reason given by Talwars that they did not hear any noise in adjoining room was because their AC was making too much noise... However they were easily able to hear the morning bell by the servant. 2. The forensic report suggested that the cut on the bodies were done by some one expert in surgical.. however what CBI suggested that the Compounder was expert and was convinced that the dentist doctor was not able to do it perfectly. 3. The whole movie is clearly one sided view of the main protagonist played by Irfan Khan. Which would be like he is the only non corrupt person and rest all are part of large propaganda to frame Talwars. 4. It showed the Convicted Servants had more powerful defense lawyers than the Docs. 5. Just like the movie shows that Talwar's could not think all in advance and prepare themselves by removing all evidence, however the same would apply to servants ( not shown or supported in movie) - Taking Hemraj to terrace, closing the terrace door, killing Arushi and putting everything in room as it is. 6. Non Convincing reason for the Internet Router being on even after death of Arushi. 7. When Arushi's mother called Hemraj, it is provided that the call was within the range of Murder location.She has mentioned that someone picked up the phone and disconnected. While blaming the servant, Cant it be Dr. Talwar taking the phone just to pretend against the maid. 8. It has been provided a proof that CBI officer had tortured the third servant to become a witness. And the list continues.... No One knows what happened behind closed doors... But something was definitely not right and Talwars definitely knew about it but have never disclosed it. Whether it is their deed or something else.",
            "review_date": "2015-10-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Jagged EDGE!",
            "content": "Talvar is a 'rarest of the rare' movie that gives a detailed account of probably the most twisted case ever. The movie attains the impossible by providing veracity to the details and abiding by them however harsh they may be. All the characters in the movie look,play and moan their part with utmost sincerity. Konkana sen sharma and Neeraj Kabi look distressed as the couple who play both the puppeteer and the puppet at the hands of the system. Irfan's 'one good cop' act has him bend the law while prowling on his way to the truth. Among the rest of the cast Sohum Shah,Gajraj Rao and Sumit Gulati stand out. Meghna Gulzar deserves all the applause and accolades that comes her way for serving us 'nothing but the truth' exactly the way it is without being biased. The movie does not promise any answers to the questions but leaves you with many more such questions. Vishal Bharadwaj take a bow!",
            "review_date": "2016-02-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Waste of Time....awwwwwwwwwww..!!!!!",
            "content": "8.5 what the F###!!! lets find out out Baby Guljar -How can Khukhari cut the neck like Surjical knife -In the real Narco Test Ashwini Kumar present at that time and slapping servant in the presence of Doctor but in the movie he just leave his mobile and sitting in any restaurant Why?? -How Baby Guljar know that Palm-Mark on the wall is really of that servant but in the movie that mark is washed out by the rain -Ashwini Kumar is also a UP Police officer and why he is in CBI ....Oh Oh after Crashing Mulayam Singh Yadav in State election by Mayavati....He is very close to Yadav thats why he is in CBI not bcoz of intelligence or honesty...and what about Law & Order when he is in UP and last -The film is made to clean the image of Mr.Talwar and for this manipulate the things to make the servant Guilty..!!!",
            "review_date": "2015-12-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "WHY bother ?",
            "content": "Really cannot understand the good critics.Boring , slow, stupid acting.. managed to see the first 45 minutes. I closed the movie and saw a documentary about whales. It was far more interesting and quick than the movie. DO NOT BOTHER on seeing it. DO NOT believe the good ratings.",
            "review_date": "2020-11-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Breathtaking Thriller",
            "content": "This movie totally changed my perception of Hindi movies. Screenplay and direction done by #VishalBharadwaj and #MeghanaGulzar are the highlight of this movie. And the professional artists have done an incredible job. I must say natural actors. Each character stands of its own but I feel the limelight of this movie is #IrrfanKhan's character. To me it was totally a movie which meets international standards. Each and every scene was well justified. At the interval time I was wondering what will be second half as the first half ends well with leaving no clue what could anything possible happen in the second half. The entire movie holds suspense as it did in real life. It's a must watch. Kudos to the team!!",
            "review_date": "2015-10-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Justice is blind.",
            "content": "When I thought about writing about Talvar, the first thing to strike my mind was that it wasn't a happy ending. Justice wasn't served. But it does represent reality; in fact, it IS based on actual events. It will wake you up from the eutopia created by typical Bollywood commercial movies, where justice is served at the end, the bad guys are punished, and everyone lived happily ever after. The consequence of Aswin also reminds you that working for good and being honest no more brings good nowadays. It's a saddening movie, but it's also thought-provoking. The making and acting of the movie was overall good. You will feel anger, helplessness, anxiety, curiosity through the movie with the continuous storyline.",
            "review_date": "2021-03-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Public Attention!!!",
            "content": "\"On 22 July 2008, a Supreme Court bench consisting of Justice Altamas Kabir and Justice Markandey Katju asked the media to be careful in its coverage of the case, and abstain from making baseless allegations doubting the character of Aarushi or her father. It criticized the 'sensationalist' media reports as lacking in \"sensitivity, taste and decorum\".[169] On 25 July, the Ghaziabad court judge objected to the \"inhuman treatment\" of Krishna, Rajkumar and Vijay by the police.\"-Wikipedia.***Noida double homicide case'/ Indian knows it more as 'Arushi Talwar Murder Mystery!'. A perfect example of an 'investigation' of police, how it shouldn't be done at any...., another crown for India's bad reputation of the police. After watching the movie and an personal investigation conducted by anyone from the available info& documents on the internet. i believe the movie made a crucial argument which is indeed undeniable, Now i believe the movie has made a reasonable rather deniable, I would say necessary claim. The angle which the 'police' and 'CBI' should invoked the earliest. But now the knot arrived a certain point, where the true rope is destroyed/sabotaged by the irreversible time, mistakes of (ignorance,deliberant/fabrication), lobby-ism, egotism, and each one of them made huge/overtly impact on the case that it cannot be coincidental (parents are not excluded!). And the coffin of 'mystery' wrapped with a satin after it has been nailed by the media's mammoth 'prejudices', by their TRP driven mentality or 'inhumane values', craving/ itching for 'dramatic sensationalizing' on contrary to the reality/originality. (specially by some 'No- Ethics' just 'TRP',based channels like 'Aj-kal-porsu Tak','dumb-ass' Sunsani' & almost 'a-z news' etc). But in that whodunit haystack one needle is 'shining' enormous that the 'Uttar Pradesh' Police and weighted CBI didn't do their job other than sleeping and pissing inside their own profession. And circumstantially/surprisingly the CBI's special judge of a 'especial' court Mr. Shyam Lal was 'in-fact' near bound/bounce to decide his conviction against the 'parents' and sentenced them life imprisonment on 24 November 2013., though i believe the hell they are already in by the so called God (in the gap). This case has become India's 'OJ Simpson' case but the trial 'Motive & Verdict'.The 'motive' what seems to be 'proved' in the lower court is one of the lamest and shameful, now I firmly see how the lower courts and some branches of administration/bunch of 'crows' often malign nation's rather great Judiciary & Honest Police Departments, they just do whatever they want and sometime they produce some rats with up-to 14 heads out of the mountains of mysteries. So anyone who suspects & studies the case at least for couple of hours, will be clearer (that what is reasonable) by the repetition in time in your head along with the raw evidence. Such A Wonderful Movie!!! I realized soon after. And the improvised direction of Meghna Gulzar, daughter of the Gulzars, as good after as 'bad', I mean simply, 'Talvar' in 2015 '....... is far ........far... better than the 'Filhaal...' in 2002 & Dus Kahaniyaan' 2007. and she is the example of how a director should or could improvise/overcome after such embarrassing flops.",
            "review_date": "2015-10-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Dont get the points",
            "content": "Without knowing the true story, this film is garbage.\nThe script seems writed by a 12 years old. Some parts seems incredible long. Some just dont make sense. There are side stories that are completely unrelevant to the main story. Its not entertaining at all\nIndian police its really this incompetent? They all jump to conclusion based on absolutely nothing and without any common sense.",
            "review_date": "2020-04-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Showing one-sided view.",
            "content": "In this review I am mainly addressing the factual accuracy than anything else, because the movie is claimed to be based on a real-incident. If you have read about the case in detail before, then you will certainly notice that many important details related to the case are not shown. Some of the details shown in the movie related to the evidence are imprecise. The movie stresses more on the view that Talwars were innocent instead of presenting all the facts, and corresponding possibilities. When I first heard about the movie, I was excited, and expected an unbiased and well-researched analysis of the evidences and possible happenings. But the movie turned out to be substandard.Being a movie based on a mysterious murder case, the writers should have bothered to do some research before presenting this piece, which seems to be intended to feed a biased point of view to the gullible audience.To summarize, the movie could have been more fact-based and unbiased. There wouldn't be much wrong with the movie if it were not claimed to have based on a real-murder-case.",
            "review_date": "2015-10-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I would have preferred a documentary",
            "content": "If you compare this to a regular mainstream hindi flick, its Citizen Kane. If you compare this to inspired-by-real-life thriller/dramas... then it flawed, unnecessary and anti-climatic.The movie tries, but ends up neither a who-dunnit, nor a social commentary, nor a movie that exposes corruption, nor does it sheds light on anything shocking.The movie is based on a botched investigation of a famous double murder. \nThe investigation aspect shown in the movie is flawed. Even a regular audience member can point out mistakes and assumptions being portrayed as evidence that no one could think of. The corruption/botched up investigation aspect is lightly touched upon. Then there is a parallel track of Irrfan and Tabu's separation which seems completely unnecessary and idiotic. It does not symbolize anything related to the story and looks absurd.Performances are fine. Indian cinema has definitely produced such close-to-real-life now and then, so this isnt anything special. Irrfan Khan is a splendid actor who doesnt need my vote. But this seems like a cakewalk role for him. It couldve been portrayed by anybody. In fact, he looks like a caricature of his usual self. Konkona is another fabulous actress. But her character doesnt have anything special to do in the movie. That too couldve been portrayed by anybody. Seems more insulting to the genre and serious cinema if you take known actors to sell your movie.I wouldve preferred a thoroughly researched documentary than this.",
            "review_date": "2018-01-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Lack in climax",
            "content": "I was bit unhappy as they couldn't find who is the exact murderer",
            "review_date": "2018-05-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A gripping thriller- nicely executed",
            "content": "I was pleasantly surprised to see the movie, as the trailer had not appealed much to me. The direction, specially in the first half was impeccable. It provides sufficient content to people who have followed the case closely as well as to people who have not. The performances were extremely credible. The movie is a fresh breath in the air from the over-dramatic song and dance sequences which we see in most Hindi films.Now to the few weaknesses. There was an obvious bias from the point of view of the screenwriter, something which could be easily gotten away with. The subplot involving Tabu seemed a little forced.However, I really appreciate the thrill factor which the director was able to sustain throughout the film. Meghna Gulzar has a lot of potential as a director. Expect more such gems from her.",
            "review_date": "2015-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Edge of my seat",
            "content": "As the expression goes, gespannt wie ein Flitzebogen, that is, on the edge of my seat – is how i felt trough out the movie.Many movies attempt to keep their audience at the edge of the seat and so did this movie.As the cliché goes \"an then the plot thickens\", each plot in this movie kept me moving to & fro on my seat.I have seen many murder mysteries that remain unsolved till the end. But this one is different.  Its a true story about a 14 year old girl aarushi talwar whoes mysterious killer has not yet been identified even tough 7 years have passed. Hence you leave the theater with a feeling of unfulfillment that justice is in lack. You leave the theater with so much unfulfilment that it hurts so bad when you think of 14 year old aarushi talwar.",
            "review_date": "2015-10-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A dish which has something missing",
            "content": "After watching Talvar, one immediately realizes the incompetence of local police and the long strides our law enforcement has to make to keep pace with the developments in society. As one of the key character remarks that if the initial investigation was more proper and thorough then it would have been a easy case to solve. Presenting a sympathetic angle to the parents of the murdered child, the movie tries to portray them as innocent victims of a callous and irresponsible system, a system where the sword (talvar) of the statue of justice has been rusting since past 60 years. Covering all the twists the case has taken over the years, it dutifully follows the story scripted by the media but does not add anything more to it. One of the biggest drawbacks is the lack of viewpoint of parents specially the mother in all this drama. She is there as a silent witness completely emotionless and inert. Her emotional turmoil is not covered in depth. Is justice more importance than preserving her memory? The adulterous angle is also briefly touched but not explored in depth. On seeing their daughter dead on the bed the mother immediately accuses the servant of murdering their daughter. why? what makes her so sure he did it. that angle is also not explored in depth. Acting of all actors is brilliant and Irrfan shines as usual. All support cast has lent a helping hand. All and all a good watch. But like a nice smelling dish you feel there is some ingredient missing.",
            "review_date": "2015-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Law and order.",
            "content": "This movie shows the ugly reality of law and order and injustice done by the people in law and order to innocent people.",
            "review_date": "2021-04-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "BE your own judge",
            "content": "When you watch a movie which is written out of writer's imagination, you know, you it can get thrills and chills out of it, especially when it is written by Vishal Bhardwaj. But when you already know the conclusion of India's most talk murder case, you lower your expectations. Obviously its very recent, right? Not 2 decades old case. Above writing, this is wonderful! Talvar got amazing director Meghna Gulzar, who keeps you thrilling even from starting 10 minutes. Director gives wonderful space to all the cast and takes out best of them. However its Meghna's story-telling and wonderful editing by A. Sreekar Prasad where every scene is perfectly cut and merged into an amazing time line. Its well-researched piece of biopic, where director gives you all the POV's (Point of views) from suspects and instigation teams. And let the audience choose and talk about the movie after hours its over! Just like real life, its not yet been clear of the crime scene and the killer(s) Be your own judge and do the justice. Hats-off to the team of Talvar, and above all Vishal and Meghna for working so close to the project and making an instant classic.",
            "review_date": "2015-10-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Propaganda movie supporting parents",
            "content": "After watching this movie I was convinced that it was the servant's friend who must have done it based on what they showed as narco analysis in the movie. I watched the video of his narco analysis on youtube right after watching the movie and the actual video shows nothing of that sort that he had killed her. I was so angry at the movie writer and whoever else supported it. Trying to blame a poor man for no reason other than that he is poor and not as valuable in their eyes. He should file a case.",
            "review_date": "2020-02-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best at the end",
            "content": "The movie is a bit of a jagged edged movie. The movements in scenes happen too suddenly for the mass audience to participate. Its not a movie which attempts to solve a mystery like its supposed to be solved. The movie stresses more on the ego problems and real problems of law enforcement agencies and experience. And the last 30 minutes of the movie are the best part of the movie. There are plenty of awkward dialogues and average acting performances in the movie (\"woh meri beti ki Tarah hai\"). The movie is decent compared to what the rest of bollywood has to offer. However, don't hold your breath till the end. It will not be concluded and ends awkwardly too. I didn't expect this but its okay in today's marketplace offerings",
            "review_date": "2016-02-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "PERFECT MADE! MUST WATCH!",
            "content": "The Direction Of Meghna Gulzar Is stunningly great with the amazing work with actors like Irfan Khan, Neeraj Kabi, Konkona Sen Sharma, and others .",
            "review_date": "2018-10-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Portrayal of the inefficiencies and ulterior motives of contemporary law forces in India",
            "content": "Well written (albeit disturbingly closer to the facts reported on the case), the film is an excellent reflection of the bias exhibited by the police forces, media and to some extend the society towards what seems like a double homicide. The murders, very disturbing, were consequences of a drunken mishap; but it seems it is convenient and spicy to lay the blame on the parents and tarnish the image of the victim. With a media screaming for sensationalism, the case caught national attention and became front page material of all the newspapers. Having looked at the facts and read about it, it seems that it was all a constantino of ineptitude and then covering backsides on multiple levels. It is a sad film, with a sad outcome. It also shows up the glaring loopholes in the Indian legal justice system and cynicism in some of the methods used by it.",
            "review_date": "2015-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Frightening & Powerful!!",
            "content": "This movie will shake your beliefs on our system. The first reaction that came to my mind after watching this film is that we finally made something at par of Korean movie Memories of Murder or Hollywood movie JFK. As a Music Composer, as a Film Director or as Writer Vishal Bhardwaj has proved time and time again why he is one of finest Craftsman/Creator of this era. Superb Performances from all cast. Hats off to Meghna Gulzar & Team for making this film. It's easily one of the most hard hitting film of our times.",
            "review_date": "2018-07-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worst movie i've seen",
            "content": "Story is trash, actors are trash, direction is trash, events make no sense, dumb characters that makes you want to punch the screen.To be fair, the message behind the ending is ok, the rest is garbage.",
            "review_date": "2021-08-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Lively Conducted",
            "content": "A beautiful movie. Real incident based. Beautiful direction, Flawless Acting by everyone and master screenplay.",
            "review_date": "2020-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Police and Central Departmental of Investigation try to solve a double murder case which becomes superficially difficult due to inefficiency of police and corrupt system",
            "content": "Movie of 21st century! Instead of watching trash watch this.Another marvel making you left out to think about our country once again. A 14 year old girl is brutally murdered in her bed and police trying to find the murderers. Due to inadequacy of the police in the investigation and allegedly declaring parents as the culprit, the case is passed on the Central Department of Investigation and their lead investigator Ashwin (played by Irfan Khan) tries to solve the case from scratch without bias. It is interesting to see how he struggles to find out the truth and cope with the corrupt system while his own personal life is going through down and turns.The story is inspired by a true incident of Arushi's Murder case in 2008. This makes movie more interesting as audience can relate to it and keeps you glued to your seat with thrill.The effort by the actors are remarkable. Once again, Irfan Khan has proved himself through an interesting and strong character of Ashwin Sharma. The role of parents by Konkana Sen Sharma And Neeraj Kabi are very realistic and up to the mark. It is a great comeback of the director Meghna Gulzar even she did not had good movies in her pocket before.It is a must watch if you are looking for thriller. But if you are not, then still as an Indian, it is a must watch,",
            "review_date": "2015-10-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Intense narrative rooted in reality.. A Must watch",
            "content": "This ranks as one of the best movies I have seen recently, one with a real life incident, and making a bold statement.The script, screenplay , direction , casting and acting were truly exceptional. It was refreshing to see veteran actor Irfan Khan the lead, in his elements. Usage of satirical comedy was fitting and effective that helped in driving home the point the movie intends to make.This movie excels at delivering \"sword's blows\" at the bitter reality of corruption and indifference that has plagued a few pockets of the Indian bureaucracy, with the law enforcement and the sensation-hungry media in it's spotlight. It contemplates the misfortune of the innocent citizens who are made victims, instead of being delivered justice and the guilty helped out through the loop holes.Giving 9 /10, as the narrative could have been little bit more aggressive, with subtle cinematic elements.",
            "review_date": "2016-01-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent movie as a replacement of New Channel",
            "content": "If this is excellent movie from all technical aspects, why so low score? Only because I watch movies as an escape from the real world. I read and watch CNN or other news channels for the real world. Until last 10 minutes, I had a score of 10 in my mind and then the movie took me from the imaginary world into the real world and the imaginary world broke into pieces",
            "review_date": "2019-04-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Medium",
            "content": "Medium film one time watchable..\nMedium film one time watchable...\nMedium film one time watchable...\nMedium film one time watchable",
            "review_date": "2020-04-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "AMAZING",
            "content": "Of course, it is a film which shows Talwar's side of the case, throwing light on how they were implicated in the case but never ever does it falsely make you root for them. It also opens our eyes on the fact that things like Narco tests are conducted on the accused even though they are not admissible in court. So even if you manage to get a confession out of them, they are almost redundant.But the clincher is the cast. Such a film with an intense whodunit tale needs actors who can do justice to it. With the likes of Irrfan Khan, Konkana Sen Sharma, Navin Kabi and others, Gulzar had made sure people don't get disturbed by the histrionics but by the proceedings. Even the supporting cast from a small role to a substantial one, everyone was just PERFECT!Even if you have a whole lot to do this weekend, make a point to watch this film. I bet you haven't seen a better whodunit in recent times in Indian Cinema.",
            "review_date": "2021-04-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "content": "Great movie to watch",
            "review_date": "2020-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Talvar is a solid, engaging murder mystery that works as reminder that America doesn't have a monopoly on troubled justice systems. CINEMATIC PET PEEVE: Has there ever been a character in a movie who says, \"It's an open-and-shut case,\" that isn't eventually proved to have been grossly incorrect?",
            "review_date": "2020-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For all of its promising notes which are not safe, really- and they are unmistakable as brilliant and cinematic- 'Talvar' is all towards the judicial system of India. There's a special biases towards the Talvar couple. But this is just a minor complaint in an otherwise moving, subtle, rich and grounded film that always does everything it can to not be exploitative. It has all the elements a truly thrilling film would need. There is heft and vulnerability here. Irrfan Khan and Neeraj Kabi as the CBI officer and Rajesh Talwar- respectively- are my favorite performances from the film. But there's absolutely no denying that even Konkona Sen Sharma is very striking as the poised character inspired by the Mama Talwar Nupur. \nDo watch 'Talvar'. It's a solid film and beyond that, a profoundly seamless example of a horror story of the modern times. If not anything else, watch it for it's unflinchingly emotional gaze and a realistic portrayal of media.",
            "review_date": "2020-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Talvar\" is a very effective true crime thriller that really kept me on the edge of my seat. Since I knew nothing about what happened in real life, I didn't know what to expect. The mystery element of the movie is handled well and all of the possible theories for the crime committed in the movie are explained. I also really liked Irrfan Khan's performance and thought his character was the best part of the movie. Even in the slower patches of the movie, every second he was on screen was great. I can't blame the movie for being based on an unsolved case, but because of that, I felt it lacked closure and it was a tad bit frustrating. However, in the movie's defense, I think that is how they want you to feel because it is showing a situation where true justice was missing. It's not the most pleasant movie out there, but it is a fascinating and intelligent movie that will certainly raise many questions.",
            "review_date": "2018-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "absolutely brilliant.. It worries me how close to real life this whole story is.",
            "review_date": "2016-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When u r talking of bollywood's best this is the one of them",
            "review_date": "2016-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Am I the only one who seen this as an overly spin circus?",
            "review_date": "2016-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A colossal, missed opportunity that retains its shortcomings with a great performance by Irrfan Khan.",
            "review_date": "2016-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Talvar doesn't actually mean guilty, it means sword and is a variation of the name of real life family this movie was based off (Talwar). Sword is a better title because the movie talks about it in terms of the sword that Justice carries and in this movie that sword is possibly rusty and dull. If the parents did not murder their daughter, this is a downright horror movie from their perspective. Even if they did or didn't, all I can think is what a mess. It would be interesting to see a documentary about the double homicide to compare it to this movie.",
            "review_date": "2016-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Hindi cinema's finest thrillers, featuring a brilliant central performance from one of Hindi cinema's finest actors.",
            "review_date": "2016-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "another top class acting by Irfan Khan...the movie is almost perfect, thrilling and disturbing...and the ending is really really shocking...",
            "review_date": "2016-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "91%\nWatched this on 15/1/16\nA film that knows what it is doing, the movie plays many roles, an investigative drama, a conspiracy thriller, a satire towards it's end and makes captivating use of both Irrfan Khan and the Rashamon effect. It's also well written and effectively directed.",
            "review_date": "2016-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing piece of cinematic material for Indian cinema, its portrayal of Indian Police, CBI and the Bureaucracy looks and feels authentic. At the start I decided to keep the real life incident with that of the movie as separate cases, instead decided to watch it as a fictional story.  The pacing is intense, the treatment of plot with three different investigations makes for an interesting retelling. The acting, script and direction are perfect.",
            "review_date": "2015-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most shocking part of the movie was how things ended. Even when competing investigating agencies do not find enough evidence to file a chargesheet, the court manages to identify the culprits and give out punishment. Movie carried with it an authenticity and casualness in portraying the incidents as mundane leaving the viewer to gauge the intensity.",
            "review_date": "2015-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A near to perfect movie which is tense and very disturbing. Irfan Khan stands apart with his outstanding performance. Easily one of the best movies of the year. To understand it better read the real life article in Wikipedia ( that I read 2 years before). A Must Watch",
            "review_date": "2015-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Talvar is a tense and thrilling experience which is neatly packed with a rock-solid script and strong performances. The Rashomon inspired storytelling makes it every bit grippy and entertaining and of course the biggest asset of this movie being Irrfan Khan.",
            "review_date": "2015-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting movie. Good acting. Good depiction of the system in India. Good (re)creation of a confusing scenario.",
            "review_date": "2015-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exception movie carried on the shoulders of Irffan's amazing performance as Mr. Ashwin Kumar......Screenplay is excellent and the pace of the story is also quite good.... The only fault in the is that it is sympathetic towards the parents which could have been made better...    Apart from that the story present us with three different versions of the same story and leaves for the viewers to decide which story they want to believe.....A @hr wholesome entertainment story for the fan who would be left amazed in the end with both the movie and Irffan's performance.........",
            "review_date": "2015-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Every instant of this movie is spectacular... Awesome.....Love it",
            "review_date": "2015-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Had high expectations, but as it happens more often than not, left me disappointed. Maybe due to enough knowledge about the case (not that of  the police staff involved or their family) from which the movie is inspired. While it's a fictionalized version of real crime, it doesn't manipulate the significant facts of the case as far as the evidence and proof are concerned. Well, more than less. Seems like Tabu's character was created to show the emotional side of Irrfan's character and maybe some light moments. But it doesn't help the cause and it'd have been better off without it. While the performances are commendable, the portrayal of the police personnel is quite typical (not to be mistaken for unreal).\n\nOne time watch if you don't know about the Noida double murder case details already. A seemingly open and shut case (more so if you aren't interested to go into the details of the case & pass judgments based on unscrupulous assumptions) that's a hard one to crack. Much, if not full credit goes to the police force that mishandled the case by not following the essential procedures in its initial stage. (Letting the crime scene to be compromised wasn't their only fault.) Beyond reasonable doubt for that matter.",
            "review_date": "2015-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it. The movie says so much without being preachy and mirrors the sad society we live in.",
            "review_date": "2015-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbly made movie. Giving a factual account of various investigations with good use to flashback . Very good acting , and well directed.",
            "review_date": "2015-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very entertaining  movie,  shows how the system messed up.",
            "review_date": "2015-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When you watch a movie which is written out of writer's imagination, you know, you it can get thrills and chills out of it, especially when it is written by Vishal Bhardwaj. \nBut when you already know the conclusion of India's most talk murder case, you lower your expectations. Obviously its very recent, right? Not 2 decades old case. \nAbove writing, this is wonderful! Talvar got amazing director Meghna Gulzar, who keeps you thrilling even from starting 10 minutes. Director gives wonderful space to all the cast and takes out best of them.\nHowever its Meghna's story-telling and wonderful editing by A. Sreekar Prasad where every scene is perfectly cut and merged into an amazing timeline. \nIts well-researched piece of biopic, where director gives you all the POV's (Point of views) from suspects and instigation teams. And let the audience choose and talk about the movie after hours its over!\nJust like real life, its not yet been clear of the crime scene and the killer(s) \nBe your own judge and do the justice.\nHats-off to the team of Talvar, and above all Vishal and Meghna for woring so close to the project and making an instant classic.!",
            "review_date": "2015-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This man never disappoints, phenomenonal range of acting ability.",
            "review_date": "2015-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good pace, keeps you engaged. Not many known actors, but solid performances overall.",
            "review_date": "2015-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Day: Sunday\nDate: 05 Oct 2015\nTime: 10.00 pm\nWith: Maa\nOn: HDTV",
            "review_date": "2015-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know everyone's gone Martian this weekend and are going ga-ga over saving Private Ryan marooned on a real red planet My humble request in this mad rush to watch an awesome Ridley Scott movie is....don't ignore another pathbreaking movie made by Meghna Gulzar and scripted by Vishal Bhardwaj. TALVAR achieves something rare. It is a medium trying to tell us through tinted glass the truth about the Aarushi murder case, which is not a whodunnit or a hazy murder case but a sorry incident or chapter in Indian criminal history, where the media, judiciary, CBI and police have botched a simple murder case and TALVAR does exactly that....expose the trappings and machinations of the state to destroy a family's life beyond repair.\nIrfan Khan is incredible as Ashwin Kumar, who actually is the first CBI officer Arun Kumar who solved the case. Meghna is perfect in her brevity to treat this subject matter with respect and sensitivity with no ounce of sensationalism pouring through it.\nEach and every moment in the movie is fact-based and completely authentic right till the last meeting between the two CBI teams, where Arun Kumar exposes the stupidity of the 2nd CBI team and their theories of wife-swapping, honor killing, golf club murder weapon mumbo jumbo.The black humour pervading the movie is just delectably delicious. \nIf you are Indian, this is a mandatory watch for two reasons:-\n1) Somehow protest in some form or another - to fast-track the appeal of the Talwars to get it heard in High Court so that they are set free for a crime they didn't commit.\n2) Pray to God that you do not fall into jeopardy ever with respect to the State machinery, because it will devour and swallow you whole.\nTo me - this weekend is a toast to TALVAR and no other movie. Hard-hitting, gritty and thought provoking. This is not a movie but a text book to understand what is horribly going wrong with our democracy, which is just a system which perverts truth and bends and breaks and smashes it to smithereens.\nWatch TALVAR - it's uncomfortable, its horrid, it's unflinching but thats the face of truth in India. Movies rarely move people but TALVAR is one such honest humble attempt to discern and distill the truth for a layman which should not be missed at any cost.\nFor many years it will survive as a piece of evidence and testimony which truly showed what happened that fateful night on Aarushi, while her parents were asleep in her adjoining bedroom.And for that we have to salute this piece of art or medium not just as a movie but a body of work, which transcends beyond just providing us entertainment but a catalyst to push and provoke the truth and bring it out in the open.\nThis is not a movie but much more!!!",
            "review_date": "2015-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Talvar puts the entire investigation of 2008's Aarushi Talwar Double Murder Case on big screen and makes the justice system guilty!\nTalvar is an outcome of brilliant team work of director Meghna Gulzar, Writer Vishal Bhardwaj and its whole cast especially the leading guy Irrfan Khan. With  multiple visions of the case, Talvar succeed to keep its audience thinking from start to end and effectively satisfies their expectations. If you are hearing or reading that Talvar is an edge of the seat thriller, go for it without any doubt. It is simply one of the best films of this year.",
            "review_date": "2015-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4.5/5* or 9/10\n\nThe \"Arushi murder case\" has become a legendary story in India now, everyone you meet has there own theory, on who is the murder and why they did it. But as things stand today Arushi's parents rot in a jail cell for her murder. Like many others I have also used Wiki too look up the case details way before Talvar was made, so I went into the film thinking I know everything about the Arushi Murder.Well all I can say is that,\"you know nothing John Snow\" well jokes aside what I meant is that this film just blew my mind, with its new facts, its detailing, and almost complete unbiased approach. Rarely do you see hindi films that are made like Talvar, a investigation drama, that doesn't leave out any detail what so ever. Therefore by the end of the film we know everything about the case, and can make our own judgement. And I must say even though we knew what the films ending was,Talvar still has so many suspenseful and thrilling moments. However alot of things you see in the film leave you totally disgusted, especially the way cops handled the case but more on that later.\n\nStory wise the film is about the Arushi Murder case but the girls name is changed to Shruti in the film. The film deals with the double murder of 14 year old Arushi and her 50 year old servant Kempal, who was the first accused of the murder of Shruti until his body was found by the family a couple of days after Shruti's body was found. The film shows a detailed investigation of the murder case and how the local police first accused the parents of murder, but after there botched up rushed case is brought to the forefront the CDI (aka CBI) is brought in.CDI investigator Ashwini Kumar takes over the case and starts to unravel his own truth of how he thinks, two servants Rajpal and Kanniya murdered Shruti. His investigation makes up the crux of the plot.\n\nRarely do you see so many superb performances all in one film but Talvar is a great expectation. Irfan Khan is excellent.Neeraj Kabi and Konkana Sen Sharma are superb.Sohum Shah is great. Gajraj Rao and Sumit Gulati are hilarious. The films ensemble cast is just amazing, everyone acted brilliantly even the smallest actor.\n\nA film like Talvar gets me thinking that how can India have such, out right dumb, and stupid cops. For example in the Arushi case as shown in the film cops ruined the whole investigation, the didn't collect any forensic evidence, they let people trample all over the murder scene, and they rushed through the case and blamed the parents for honour killing(like come on seriously). Seriously I have only scratched the surface when it comes to the case atrocities, and the media deserves alot of blame too for the trial by media, and there sensualizing of every small detail. The CDI was also not be left behind with some dumb investigation of there own, and whats with the cops, and CID trying to look out for each others reputations etc in young girls murder trail. Have some heart no and give a fair judgement.\n\nBut all these misjudgements in real life made from the amazing stuff in the reel life in Talvar. I must add that the film has some amazing dark comedy too, i found myself lauging aloud many times. But works for the film foremost is the way the Director Meghna Gulzar gets into every detail of the case, and the way the investigation proceeding go on it feels like the audience is a part of the case. And by the end of the film you are not only forced to think, but you cringe thinking of the outcome of the parents. I must add though the film is a little biased towards the parents in the case, and thats the only negative.\n\nOverall rarely have I enjoyed myself as much as I have while I watching Talvar, its a film that challenged me while I watching it, and thats something I cherish in a great film.Therefore Talvar is a truly thought provoking film. And its easily one of the best hindi films of the year. Its just sad that the film might get a niche audience in India, because this film is a must watch,its some damn brilliant work that deserves global recognition.   \n\n4.5/5* or 9/10",
            "review_date": "2015-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What do you expect from a film directed by Meghna Gulzar (Filhaal), written by Vishal Bhardwaj (Maqbool, Kaminey, Haider) & starring power house talents such as Irrfan Khan & Konkona Sen Sharma among others, based on a double murder case which shook the whole country from its core. Well of course - Excellence! The real story - In 2008, Aarushi Talwar, 14, the daughter of middle class parents, was found dead in her Mumbai home with her throat slashed. Suspicion quickly fell upon the family's servant, a Nepali migrant named Hemraj, but when he was found dead the next day in a nearly identical slaying, all hell broke loose. This was only the beginning of an event that captivated the nation with more twists and turns than even the nuttiest that Bollywood could come up with. The 2008 murder of Aarushi Talwar and Hemraj Banjade and the subsequent investigations, of which the film is the fictionalized account, are complex, with multiple official points of view, compromised evidence, and of course breathless media accounts with unnamed sources, rumors and innuendo. The Noida double murder, as the case is familiarly known in India, has been the object of conjecture and speculation since day one, here Meghna Gulzar's film is the second attempt (Kay Kay Menon starrer Rahasya being the 1st) to tackle the material on the big screen, and trust me it's an explosive piece of work. The views on this case are polarized and often hardened, so how to make a movie about it? Vishal Bhardwaj and Meghna Gulzar took the time to scrupulously research the case, and present a Rashomon-like telling of the story with multiple viewpoints, allowing the viewer to conclude which case is most compelling. The best part about the film is it doesn't waste time in establishing a happy family before to show the loss. It gets straight to the point and starts from the morning Shruti's body is found. The script is water-tight so much so that we get engrossed in it right from the first frame. The intensity that is built quite early in the story stays intact after interval too. The ending is not at all abrupt. It goes with a number of intriguing questions that keep floating in mind even after leaving the theater. The story gets absorbed in your mind and heart and unknowingly or even if unwillingly it travels with you, stays with you and keeps haunting you and probing you with many questions. What if? Why that? How could it be? are the few questions that keep floating in your mind. It has been well written by Vishal Bhardwaj and the similar credit for screenplay too goes to Vishal. Of course, it is a film which shows the Talwar family's side of the case, throwing light on how they were implicated in the case but never ever does it falsely make you root for them. It also opens our eyes on the fact that things like Narco tests are conducted on the accused even though they are not admissible in court. So even if you manage to get a confession out of them, they are almost redundant. The film attempts to extensively showcase all sides of the double murders and does it exceedingly well. Issues like sensationalism in the media, long panel discussions on TV and incompetency of the police force are brought up in the film. Personally, I loved the chunks that showed how desensitized the police probably is because murder and crime scenes are this regular to them. It's also great testament to Gulzar's skills as a filmmaker that she manages to make the audience laugh ever so often, in the middle of a super intense sequence. Shruti, name changed for the film from Aarushi, was presumed to be an innocent, a victim of a crime of violence and passion from her repressed household servant. However, as soon as the police arrive to begin an investigation, reality and fiction begin to meld in discomforting ways. The story follows Ashwin Kumar (Irrfan Khan), a CDI (Central Department of Investigation) officer who has been handed the homicide case of teenage girl Shruti (Ayesha Parveen) & her help Hemraj, due to highly incompetent work, media pressure and the mockery the police made of itself. Based on the statements provided by Kanhaiya (Sumit Gulati), the police have already arrested Shruti's father Dr Ramesh Tondon (Neeraj Kabi) & accused her mother Nutan Tandon (Konkana Sen Sharma) of being an accomplice in the misdeed. Ashwin step-by-step gathers all evidence, while verifying each evidence scientifically in order to find the real culprits. The film is a remarkable achievement that works on a number of levels, both as a contemporary Indian movie in contrast with the mainstream market and as an experimental effort designed to question long-held assumptions of superiority and safety. Far from a traditional police procedural thriller, the film turns most of those conventions on their heads, along with the traditional Bollywood reverence for the police. In addition to that, there is also the splintered story line, multiple points of view, and stellar performances to consider. Some of the most remarkable directing takes place as Ashvin attempts to collate all of the different stories into a coherent series of events that makes sense and doesn't fall prey to the lies and liars attacking him from all sides. This gives us multiple gut-wrenching reenactments of the brutal crime through the testimony, both legitimate and coerced, of numerous participants and witnesses. It's not easy to watch, but it is necessary to understand the dynamics of the character and what he must suffer in order to reach his end goal. Vishal Bhardwaj has excellently written the screenplay of this movie. Full marks to him for converting this long, confusing and multi-angle case in just 132 minutes run time. This being a true story, the challenge is on the writer to deliver a screenplay that will keep the audience engaged and Vishal does it really well. Meghna Gulzar's direction could not have been any better. She excellently succeeds in re-showing the already known details of the murder investigation which ruled the news channels for multiple months. The incompetence of police and CDI, the mockery of investigation made by the media, the TRP hungry media and the emotions of parents are all excellently shown on screen by director Meghna. The flip-side is that the pace of the movie is slightly slow in the second half and has unwanted fillers that could have been completely avoided. (e.g multiple shots of loneliness of Irrfan, his story with Tabu, the frozen shots of the blind fold justice lady). Talking about the stellar cast in the movie, I have to say 'mind blowing'. Irrfan Khan does it again. It's so much fun to watch him on screen. He is sharp, intelligent, rude, sarcastic, angry and frustrated. He proves to be a very good choice for the role. Konkana Sen Sharma & Neeraj Kabi as parents are very good. While Konkana has few dialogues, Neeraj mostly emotes through his expressions, any attempt to add unnecessary dialogues would have ruined his character in the movie. Gajraj Rao has also acted well as the incompetent police officer. Other actors like Atul Kumar, Sumit Gulati and Prakash Belwadi also make their presence felt. Tabu is like able in a limited role. On the whole, 'Talwar' or Guilty (released in festivals under this name) is a gripping, infuriating, and at times a humorous film that reflects how politics, media and judiciary can change directions of the justice. It is a must watch movie, quite serious, intense and intriguing with no excessive and non-digestible masala or item numbers to please. Even if you have a whole lot to do this weekend, make a point to watch this film.",
            "review_date": "2015-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "8/14/16 Amazon Video\n\nThis was a really good film. Interesting story based on a true case, it gives two plausible scenarios with two plausible guilty parties and lets the viewer come to their own conclusion even though the justice system came to theirs. Taut, full of twists and turns, police incompetence and media frenzy it could have been set in any large American city as well as India.",
            "review_date": "2015-09-19",
            "source": "rt",
            "lang": "en"
        }
    ],
    "rt_rating": 8.9,
    "rt_summary": "Police investigate the mysterious murder of a teenage girl."
}