{
    "rating": 1.6,
    "release_date": "2016-01-22",
    "num_reviews": 135,
    "genres": [
        "Mystery&thriller",
        "Crime",
        "Drama"
    ],
    "summary": "While investigating the death of his partner, a detective (Keanu Reeves) uncovers police corruption and a dangerous secret involving a young woman (Ana de Armas).",
    "reviews": [
        {
            "content": "Just gave me another reason to hate the city of the Bipocs.",
            "review_date": "2023-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I get where this movie was coming from, but this film kept dragging its feet to get to the finish line and I just couldn't care any less at the end of the day.",
            "review_date": "2023-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has so much going for it. Keanu Reeves and Ana de Armas! Mira Sorvino. NYC Detective picture about a Reeves' partner, who is murdered to open the movie. It just doesn't work. It is not that the cast is not good-because they are. New York City is an extra character in this movie and that is very good. The Direction and cinematography are subpar. The story and script are very weak. There are elements of religious and supernatural which make this an unusual police drama and thriller, but they aren't woven into the story well enough to make it cohesive and interesting enough to overcome the disappointment.",
            "review_date": "2023-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shockingly bad, as captured by the garbage name. I don't see how anybody can score this higher than a 1. There was no coherent plot, just a bunch of generic subplots about race and crime poorly stitched together. Everything was dragged out, dull, and depressing, and everyone was unlikeable and stereotypical, with only surface level depth. Keanu was supposedly the lead, but his character was pointless and did nothing the entire film, not even wanting to talk. The focus was on Ana de Armas speaking in Spanish about angels when she had in fact been sexually assaulted in the subway. Not predictable whatsoever given the constant bizarre hallucinations and rapidly deteriorating mental state... Definitely sensible to not see or be encouraged by friends/family to see any medical professional. Then the cops were, of course, corrupt, just like in almost every single film containing police. Points for originality there. The acting was atrocious from Keanu Reeves and mixed but average at best from everyone else, the action was a joke, the cinematography and visual effects were bland, the sets/props/costumes were equally boring, with the hallucination people looking ridiculous, and the soundtrack was utterly forgettable.",
            "review_date": "2022-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this because Prime video gave it 3.5 stars. They lied. I thought it was just trying to build to something very very slowly. Then it ended.",
            "review_date": "2021-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is like looking at the dishes in the sink and remembering you have to wash them later.",
            "review_date": "2021-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why is it rated so low? You must understand a little psychology. No, it is not wham, bam, Hollywood with stupid smash up cars, or predictable types such as fast and furious, & tough guys stuff, martial arts, etc....\nYou must have some taste to appreciate it and some brains. \nThe acting was especially good with \"Isabela\".",
            "review_date": "2021-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's painfully slow and boring. Watchable but definitely not impressive. Like I don't even know what Keanu Reeves were supposed to do in the movie.",
            "review_date": "2021-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My understanding is that director Gee Malik Linton's version of this movie was so chopped up and altered by the studio that he withdrew his name from the project and used a pseudonym. His original film title was _Daughter of God_.\n_Exposed_ conflates a cop story (Keanu Reeves trying to find out who killed his partner) with Latin American magic realism (a young Hispanic lady keeps seeing angels, although they look more like something from a bad alien movie).\nSound confusing? It is, unapologetically so.\nThe acting in many scenes is awkward and stiff. Keanu Reeves walks through this movie like he's half dead and his face is paralyzed. Ana de Armas fares better as the young lady with the visions. She's at least somewhat believable, whereas Reeves is near-catatonic (He does wake up briefly in a couple of scenes).\nThe movie flips back and forth between the two stories, which are seemingly unconnected. To further screw things up, the young lady becomes pregnant, even though her husband has been serving in Iraq for the past year and she has (ostensibly) been with nobody else. Deeply religious, she calls it an immaculate conception. Also, Reeve's dead partner's wife seduces him. It's quite awkward, and it adds zilch to the story.\nEverything coalesces (rather quickly) in the final scenes. But the whole movie made me feel distanced. I just couldn't get involved.\n2 1/2 stars for good camera work. 2 1/2 stars off for the disjointed, impersonal mood. \nMakes me wonder how the original concept would have turned out if the studio hadn't insisted on messing with it.",
            "review_date": "2021-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wasn't as bad as the press said",
            "review_date": "2021-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So ... Here are a few tweaks I believe could have saved this movie. Here goes. *spoilers* 1.Cut Big Daddy Kanes revenge scene. End him in the SUV with his lawyer. 2. Leave all of Isabel's scenes, but remove her adult father's character, and add this - While she is experiencing the attack, have her flash back to a crime scene in the apartment as Elisa with bloody clothes, where the police chief's younger self is handling the case and sees the \"family photo\" . Add Elisa seeing the \"albino man\" to the end of that scene. Then cut back to Isabel when she and the homeless man are at the flashback of \"that night\". 3) ...This is the tweak that would have turned this movie into a smash hit ... End the movie with Another Call from Keanu to his son, and give him Isabel's dad's lines rewritten as, \" I love you ... and no will ever hurt you again.\" Then flash back to the scene between Keanu and Joey's wife, but show him putting some angry aggressive sex moves on the wife as he looked at the \"family photo\". Then cut back to present day and show a news cast of Isabel being named as a new suspect (Flash her photo) in more development on the case of Joey's murder, discovered by a fellow NYC detective (Flash Keanu's pic)... and End with a final cut to Joey's tearful wife watching this news cast in utter despair. Now, THAT would justify the title EXPOSED.  These few tweaks would have given connection to this terribly disjointed film. Just my 2 pennies.",
            "review_date": "2020-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a fan, slow and boring.",
            "review_date": "2020-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Other than allowing us to revel in the beauty of Ana de Armas, there is absolutely no purpose to watching this movie.  The movie is incredibly slow, disconnected, boring and seemingly incomplete.  When the movie ends, you can't imagine it is over, as there seems so much left that was not included.  It is as if all of the movie's plot points were thrown into a hat and randomly placed in order for the movie.  Keanu's usual stoic facade is completely wrong for this movie, and the two separate parallel story lines are not well crafted int a coherent movie.",
            "review_date": "2020-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies I have seen in a long time.  Waited the entire movie for it to make some sense, was just horrible from beginning to end, and i could not wait for it to end.",
            "review_date": "2020-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this was a great film with an intriguing suspense story, well-acted characters, an original script, and a tone that is realistic yet at moments borders on magical realism. I was captivated the whole time. I just think the screenplay could have used one more solid revision to to get the multiple plotlines and themes harmonized. Also the title could have better expressed the spirit of the film.\n\nEdit: I just watched Daughter of God (aka the director's cut), and honestly I thought Exposed was better. DoG has some really choppy, clunky editing in many places. The repetition of the story of Señor Salazar was way overdone and became monotonous, with a pretty mediocre ending. Also the movie over-explains the shocking reveal at the end regarding Elisa and Isabel. The actor that played the angel-being couldn't deliver the Spanish lines well. It was obvious that he doesn't really speak Spanish and therefore couldn't connect with his delivery and make it flow naturally. Yes, Exposed has some issues, but I'm still surprised that it got such abysmally low reviews.",
            "review_date": "2019-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's ambitious, but tries a little too hard to be a gritty mystery with a killer twist. It's not, and I don't know if that's the fault of the director or the editor, since everyone else seems to have their game face on. It's just a convoluted mess.",
            "review_date": "2019-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed this movie (although i have recently seen worse movies with the exact same theme). I watched it twice in the same evening and would watch it again. Ana De Armas is a great actress.",
            "review_date": "2019-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am 30 minutes in and have no idea what the hell this movie is about..... other than a white girl is pretending to be \"down with the brown\"... ... Keanu, you are better than this SJW crap.",
            "review_date": "2019-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daughter of God - director's cut.\n\nDirected by Gee Malik Linton.\n\nEdited by Hervé de Luze. \n\nI just came across the (Kermode Uncut - Exposing Exposed) review on YouTube from about 3 years ago and  found the director's cut hidden away on the director's social media. I don't think it's a perfect film, but it's definitely worth watching. It's far from the most amazing movie I've ever seen, but it's really freaking different and refreshingly unique.",
            "review_date": "2019-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "SHOCKINGLY BAD!!  *Spoilers*\n\nHard to say the worst thing about it-- how disjointed it was, how underdeveloped crucial elements of the plot were, how predictable it was, how I sat through more than an hour of a terrible terrible movie only to have to endure a violent rape scene... just avoid this movie & do literally anything else with your time ",
            "review_date": "2019-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only redeeming quality is the very beautiful lead actress. Apart from the lead actress, the entire movie is really slow and in serious need of antidepressants.\n\nI watched the movie with English subtitles on which probably made little difference as a solid 1/2 or more of the movie was in Spanish, anyway.\n\nThere were all sorts of side plots that served little point and also found no resolution. If you are really into watching a terrible film, I highly recommend Exposed for this purpose. This is a fairly loaded cast with a plot that seems to have been written by a film student in his first or second year of college.",
            "review_date": "2019-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is one of the oddest plots - and gets even more fragmented with the back and forth of language.",
            "review_date": "2019-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A real head-scratcher that kind of works itself out.",
            "review_date": "2019-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One the up side, Exposed is decently acted and shot.  Some points for not trying to write a stupid plot and hope someone likes it because diversity (Jedi).\nOn the down side, this film is painfully slow, and when the two subplots finally DO merge together, it isn't AWFUL, but it is a bit of a let down.  You can kinda see what is coming about 40 minutes from the end.",
            "review_date": "2019-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The dog died is all you need to know.",
            "review_date": "2019-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As someone who typically watches 1-2 movies in the theater each week, and hasn't seen but two in the past year because so much of what is being produced is simpleminded, I thought this film was terrific. Maybe the intercutting confused reviewers used to linear plot lines, live-action cartoons, nudity, and gratuitous violence and blood-spatter, but I found it riveting and watched it again with my husband, who also found it riveting. We're going to buy this film and add it to our 1000+ DVD collection. I would add that Ana de Armas, who is NOT interchangeable, saw her career skyrocket after this film. Okay, it's a detective story with supernatural elements. If you liked The Sixth Sense, you'll love this film even more, because you won't see the twist at the end coming, even watching it a second time. Yes, the director threw a hissy fit, because he wanted to do what sounded like a self-indulgent art house film and Lionsgate recut it into a tight thriller. I liked the thriller, a lot.",
            "review_date": "2019-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That was easily the worst spanish re-try at Devil's Advocate I've ever seen. It made no sense, kinda rambled along, no one really helped show what the actual plot was.",
            "review_date": "2019-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The synopsis in Netflix - A young teacher has a brush with the supernatural at a subway station where a police officer is found murdered the following day. \nAs I read this I thought ghost, myth, ect. Boy, was I wrong. Hats off for the bait. I will add not confusing when all the pieces came in. I found too many hints to what happened. Husband in iraq war, and no sex with the Isabel De La Cruz for a kid. Detective Galban did not know his partner was a rapist.\nThe start gave you the supernatural thought, mid way gave you the clues, end put all the piece together.\nGee Malik Linton here is a toast to you and all that worked with you, and I look forward to more.\nI am sorry for those who gave bad reviews, and hope this is not your lack for cult understanding.",
            "review_date": "2019-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well established performance from Kanu Reeves, holds this film together as it transitions on unrealistic supernatural. And a brooding mystery murder.",
            "review_date": "2019-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A blend of Spanish and English comprise this story of the death of a cops partner at the Subway. It follows both the cop and a woman who is seeing things which you would think leads one way but there's a twist at the end.",
            "review_date": "2019-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's potential here, and I imagine that the director's vision of Daughters of God might have actually been good. However, as currently cut, this is mighty poor indeed.",
            "review_date": "2019-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On top of being a terrible movie it was also incredibly boring. It's impressive how bad this movie really is. It shot for the stars, missed, and landed in a dumpster full of half baked scripts and terrible dialog.",
            "review_date": "2019-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "didn't care about this movie",
            "review_date": "2019-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Font read if you dont want to spoil it. Basically after being raped it triggers childhood rape of her father. She gets ptsd from it but in the end saves herself. Bad guys die.",
            "review_date": "2019-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie could have been better in my opinion. It started off, well, artistic in a way of the albino man walking out onto the station. Immediately you get a since that 'something wasnt right'. Going with my gut here on this one I stick it out till the end. But half way near the ending you get this 'ah ha' moment where it just hits you that she was covering something or had a reason for seeing what she did. Then with the little girl. I immediately felt like this was a moment where 'ahh thats her' Twenty minutes later and wam there it is. It makes you angry because of how it played out. If it wasn't already obvious by how the family was reacting to her about her fiance's death and news about herself. Or the factor of Keanu's companion characters wife and her attitude towards the MC. \n\nI dont know, The movie could have gone in a better route as it felt sorta of, well, diminished.  It just could have been better. I love the artistic value of her mind couping with what she went through - but it just left a sort of feeling of wanting more of that 'scifi' side into the movie instead of a drug busting cop going down behind his dead partners life as a cop. And then it just ...well...hits you with this over all feeling of 'well that sucked'. \n\nAnother movie where yet again I felt disappointed in Keanu. :(",
            "review_date": "2019-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If zero stars were an option Iâ(TM)d have selected zero.",
            "review_date": "2019-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just based on creativity alone, five stars. Then the character of Isabel is so well acted, and another one, a role model of hers, named Olga. I can understand why others might not have liked this movie because the content, that is, the trauma of childhood sexual abuse, and rape, but it poetic, metaphorically explicit than it is visually in the film. \nMuch of this movie, revealing the main characters culture and its values seems very realistic though. \nIts at once a drama and a thriller, and complex with the two story lines coming together.",
            "review_date": "2019-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Glacially slow, with a frustrating mix of a Byzantine, muddled plot, very poor writing, and a vague genre mashup.  Wastes a good cast which has no idea what to do with this miserable thing.  Hard to imagine how this got made.  Avoid.  */*****.",
            "review_date": "2019-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More wooden “acting” from Reeves ",
            "review_date": "2019-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible and confusing, no one to root for, nothing exciting here ladies and gentlemen",
            "review_date": "2019-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Directing hinders the plot but I liked the story and acting.",
            "review_date": "2018-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WTF? This movie is so stupid. I thought that everything would come together at the end. It did not. So bad! Do not watch",
            "review_date": "2018-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I finally created a Rotten Tomatoes account so I could rate this movie. There should be awards for movies this bad. Horrible directing and some of the worst imaginable editing I have ever seen. How in the world did they convince this cast to join the project?",
            "review_date": "2018-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A young woman claims to have visions of angels and believes she is miraculously pregnant. In reality, her mind has created an imaginary world to make her avoid the traumatic memory of have being harassed and raped by a detective who then killed and by her father when she was a child. Great film but too destabilizing for critics and audiences.\n(Mauro Lanari)",
            "review_date": "2018-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very deep movie that victims of trama and abuse will connect with and relate to. I thought it was a great movie and am only sad that most snowflakes will not get to experience this wonderful piece of work thanks to rotten tomatoes shallow review.",
            "review_date": "2018-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a horrible movie that made no sense. Parts of the story didn't fit in line with the rest of the story. Why was the dirty cop following those people? What did he have to do with them? Was he following the guy or did the girl catch his eye and that's why it happened. I understand victims suppressing what happened but her watching these beings was a little out there. There were still things left unanswered. Keanu has had some really bad movies. This one is right up there.",
            "review_date": "2018-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible movie. Waste of 2 hours I can never get back",
            "review_date": "2018-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I dont really know why I saw this movie.",
            "review_date": "2017-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Actually the story is not bad, but the disastrous editing of making it unnecessarily parallel destroys the film completely. Knock Knock suddenly becomes a masterpiece featuring the Keanu-Ana duo.",
            "review_date": "2017-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While investigating the death of his partner, a detective (Keanu Reeves) uncovers police corruption and a dangerous secret involving a young woman (Ana de Armas).",
            "review_date": "2017-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was pretty deep. Nowhere near as bad as some would say. You have to pay attention to the flow, reactions and imagery to understand it. Not bad at all.",
            "review_date": "2017-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Half the movie is in Spanish so nothing at all makes sense!",
            "review_date": "2017-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is about as bad as they come.  It is completely unwatchable.  I don't know who Keanu Reeves pissed off to get stuck in this movie, but it certainly is not worthy of him.  Words can not quite express how much I despised this one.",
            "review_date": "2017-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I actually loved his movie !",
            "review_date": "2017-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a movie for the people who likes intelligent complex plots. Slow movie but quiet powerful! \n\nApparently the book is way better than the film, but anyhow the movie is different and interesting.\n\nWell acted by Ana, who plays the main role of the film. Keanu is great as always, but in a different type of story, which is a blend of thriller psychological cop story and drama.\n\nThere are two parallel stories which becomes intertwined and clear at the end of the film.\n\nIf you do not watch it up to the end the movie will not make sense at all. Do not expect fast action or thrilling moments.\n\nThis is a film for the people who enjoy slow movies with a twist at the end.",
            "review_date": "2017-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of those movies you have to just go along for the ride. In the end it all comes together. Don't question...just watch.",
            "review_date": "2017-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst Keanu Reeves films I've seen. And it seems to be a continuation trend downward. All i want is John wick 2 and Constantine 2",
            "review_date": "2017-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The mood is pretty good, but otherwise it's a complete mess of a film.",
            "review_date": "2017-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am a Huge Keanu fan, but, this movie was just mind numbing boredom! You never really got into the character Reeves was playing. There was no vested interest in the character. Keanu's other movies are must see's but this one just sadly missed the mark.",
            "review_date": "2017-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really can't believe how many morons don't understand what's going on in the film. And I really can't believe how many morons left reviews for this film when they clearly didn't even watch it to the end to see the big reveal and how everything is explained. Seriously, if you have a below-average IQ like most of the negative reviewers, then why are you even still alive? Just use your brain (if you can) and watch this movie until the end, and you won't be disappointed.",
            "review_date": "2017-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really bad. So many places it went wrong. Director must have been going through something (like a lobotomy). Stilted, stitched together, partial stories. Description of movie makes it seem far better than it is. It struggles to look gritty, stereotype Puerto Rican and African American elements, but is so poorly done. Agreed that Reeves was in pain through movie, probably knowing what a mess it was. 10 sec scenes with no value, smashed together with longer scenes that were just bad. It DOES seem like two crappy movies stitched together with potential plot points unexplored. I am bilingual English/Spanish just like the movie is half English and half Spanish, but for no reason.\n\nCould have separated into 2 more interesting movies. One  about dead dirty cop murder being investigated by partner. The other about rape victim having a psychotic break because of past trauma.\n\nPossible spoilers*** like this movie could be spoiled...\nWhat is the point of detective Scott son in Florida? What does her husband's family have to do with anything? What is the the point to Mr. \"Black\" involvement? Widow and Scott angst/guilt? What does brother in law \"sodomy\" have to do with anything? Was Joey gay (and why, since no real part of story)? Why imply the police are all corrupt, to what end? 10 sec of her in church? Him in bar? Could have cut out half movie without losing anything. Or at 1:34 hr/min, add 10-20 min more to explain why all these themes were tossed in. I won't use the term 'subplots' because they were never developed enough to warrant the term.",
            "review_date": "2017-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At first I was intrigued. With some of these talented actors, it could only be good. Less than halfway through it became apparent that this story was going nowhere. It fell flat of ant expectations. The story had no point. Completely disjointed, super slow and boring.",
            "review_date": "2017-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was very interesting but slow to unravel.  Then became disgusting with a graphic sexual assault.  I am out raged.  What a sick nasty film.  The director should be ashamed.  Does no one ever think about survivors of sexual assault and how horrible it is to see this in a film.  Be warned.",
            "review_date": "2017-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i just dont get it.  Like, i am seriously confused as to what this is about.  it flip flops between two stories, which for a while make absolutely no sense.  the so called creepy moment at the beginning was more like, okaaaayyy that happened...whyyyy?  i didnt even care why anymore.  then theres keanu and another story but is it a different story or is he connected to yhe subway dude or what the f***.  i dont know if this was written while on an acid trip of if they just simply pulled random ideas out of a hat and threw them together\n\nthe other comment on here about false advertising.....agreed buddy",
            "review_date": "2017-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unfortunately I was exposed to this crappy movie. The premises looks interesting and it looks like it could be a decent cop film from the box but the execution is absolutely horrible. The movie is confusing, hard to follow with too many elements that make no sense. Keanu Reeves looks like he sleepwalking through his performance. The main actress and it is decent and I feel she could have a good career ahead of her. But you wouldn't know From the terrible pacing and choppy narrative of this movie.",
            "review_date": "2017-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you haven't been keeping up with keanu's recent movies and looking for and action pack Matrix thriller then this isn't for you. If you're not in the mood to think and wait for the big reveal then this isn't for you.\n\nI happened to appreciate the pace of the film. I love the fact it kept me in suspense the entire film. \n\nThis film reminds me of Premonition staring  his Speed lead actress.  Even the time travelers wife, both files I love.\n\nIm not sure why it received such bad reviews, maybe it's the bandwagon, pack mentality. This was a great film .",
            "review_date": "2017-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not at all as described on the back of the case. There should be a law against falsely describing a movie to get sales. One of the most boring movies yet. Terrible",
            "review_date": "2017-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This could have been a decent movie but it was a waste of time. It could have done without the freaky looking angels/aliens. Story was everywhere and went nowhere.",
            "review_date": "2017-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely rubbish....that is 1hr and 38mins of my life I will never get back !! Utter Tripe !! No Storyline to follow...How the hell did they get Keanu to agree to do this film !!",
            "review_date": "2017-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the best movie Keanu Reeves is in but I always watch whatever he's in. There somehow two storylines going on and usually movies that do this tends to confuse people so easily. Luckily, I can catch with these kind of stuff in one go but let's not say that I can catch ALL the flaws and what not in one go. However, there are two huge problems about the story and I know they had to play into the story. The mysterious figures. One appears in the underground subway and then the other one who usually appears in the streets. This woman named Isabella somehow starts seeing these things and as much religious person that she is, she says it's a sign from God. There is a plot twist in that and it plays big time towards the end.\n\nI feel Keanu Reeves' character was quite underrated. Actually the whole movie was but I think his character was underplayed. The movie focuses more on Isabel and her struggle to some strange antics she's been experiencing. Suffice to say, it has to do with her childhood and it is \"exposed\" in the end as well.\n\nWhile I would rate it higher because of Keanu Reeves, I had to remind myself why this movie is the way it is. It's an okay movie but the cop investigation was lacking and only see glimpses of it. I might not have picked up on why and how Scott Galban's wife died and even why his kid is in Florida but I guess it's to have him away from the stuff that Scott has been dealing with his work. As for Isabella, she's a worn and torn character. You'll find her excuses comes in a tragic end but we'll never know what becomes of her.\n\nExposed is a good movie and if you're a fan of movies from Keanu Reeves, this shouldn't be something to pass up. I enjoy the movie, despite of its flaws but one time is enough.",
            "review_date": "2016-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A completely perplexing crime thriller. Exposed deals with two unrelated stories at the same time which is extremely confusing and difficult to understand. But it's the unbearable pace that makes it utterly unwatchable and deadly boring.",
            "review_date": "2016-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film with no sense",
            "review_date": "2016-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "watchable, but i really want to see the original cut.",
            "review_date": "2016-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the most bizarre takes on a crime thriller that I have ever seen.  For a large proportion of the film there seems to be 2 completely unrelated stories running side by side.  The first seems to be following a woman after experiencing  a supernatural apparition and the 2nd is Keanu Reeves hunt for his partner's killer.  This really confused me as I didn't see how the 2 were connected until the ridiculous ending.  The whole film is one big mess, and a bit of a bluff to be honest as it's promoted as a Keanu Reeves film  but I'd say he has less screen time than the other bizarre character and her weird angel apparitions.  The film makes no sense. Avoid.",
            "review_date": "2016-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excruciatingly boring and pointless, Exposed is a terrible film.  Keanu Reeves stars as a police detective who's investigating the death of his partner, who turns out to have been dirty.  The performances are bland and lifeless, and are made worse by the slow pacing and rote directing.  And for some reason half of the film is in Spanish, which is rather disjointing and makes the different character plots seem disconnected from each other.  Extremely monotonous, Exposed is a complete waste of time.",
            "review_date": "2016-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No mystery or suspense here, just a predictable cop drama with a very mental victim.",
            "review_date": "2016-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would like to try the director's cut; this one is a post-production disaster.\n\nIf you say it is the worst film of the year, I won't deny that. There are more substandard films than this, but having a big name like Keanu Reeves, it is a great disappointment. It was written and directed by an inexperienced filmmaker. That was a big challenge the production house has taken, and in the end it's a failed attempt. But that was not the actual reason for the disaster.\n\nMaybe the director's cut would have been better than this version. Because the actual film was a bilingual drama that reminds us classic cult films. But the production house decided to turn it into a money generating product. Due to that plan-B it went through the lots of cuts to turn it into a single story. In the end the 'lost in translation' happened. So that's answers why it was credited under a false director's name.\n\nIt is hard to give an opinion on the story, because it's a confusing narration due to imbalance in the genres which is originally meant for two different stories. The twist was taken straight out of another film, so that makes the conclusion was very silly. First of all, Keanu Reeves' character was next to nothing. I don't understand how he ended up in this project. If his side story was chopped off, it would have made a decent short film and vice versa. I am sure, 8 out of 10 would feel a letdown and the remaining 2 might like it or maybe fall into a confused state.\n\n3 1/2/10",
            "review_date": "2016-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If not for the quick spanish lesson, this movie had zero value to my life.",
            "review_date": "2016-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just all round a terrible, terrible movie, the kind that makes you feel like you wasted your money renting it. Terrible dialogue, plot is ridiculous, slow, boring, cliche, just anything but entertaining.",
            "review_date": "2016-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Had to watch till the end to see what it was all about. Bad mistake.",
            "review_date": "2016-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very slow, poor story, poor execution. Terrible film",
            "review_date": "2016-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very dull and lifeless. It was a chore to watch.",
            "review_date": "2016-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a really  confusing  movie  but not  that  bad",
            "review_date": "2016-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst film I've ever seen.  Seems like you are watching different movies that have been brought together and make no sense.  Avoid.",
            "review_date": "2016-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review:\nThis movie was awful! I was expecting some in depth investigating from Keanu Reeves character, Scatty, whose trying to find out who murdered his partner but it doesn't go any were for ages and the characters were pretty dull. The writing was also pretty bad and I personally thought that Keanu Reeves was the worse choice for the lead, mainly because the dialogue isn't that great and the basic concept dries up after a while. The other main character in the movie, Isabel (Ana de Armas), just seems to wonder around in a trance for an hour and a half, and when the plot unfolds, I wasn't that impressed. The tone from the beginning of the film is really glum, which doesn't help the slow pace which was set from the get go. There isn't any action through the whole film and I didn't really get the point of the little girl or the strange white person who kept on popping up out of nowhere. I know that Isabel is going through an traumatic episode in her life but I still didn't get her weird visions and strange behaviour. For a film that is supposed to be a suspense/thriller, I certainly didn't feel thrilled after watching it, and it just seemed like a waste of time and money. Disappointing!\n\nRound-Up:\nAfter growing up listening to Big Daddy Kane's music, it was good to see that he was still alive but he really picked a terrible movie to star in. At 47 years old and with a successful Hip Hop career behind him, he has really starred in some poor movies, like the Metoer Man in 1993, Posse, Dead Heist, Love For Sale, Just Another Day, You're Nobody 'til Somebody Kills You, My Name Is Nobody and the upcoming Movie Madness. I'm yet to see if he really can act, mainly because his bad choice of projects but he definitely was one of the top rappers back in the day, with his unique style and suave personality. In this film, his character seemed a bit pointless because he was wrongly accused right from the beginning and you don't actually get to see him in his criminal element because he is constantly being watched by the FBI. Anyway, this movie was directed by Declan Dale who hasn't made a film before, or contributed to any project in the movie world. You can tell that his lack of knowledge when it comes to story telling, is his downfall and the fact that he wasted a decent cast, isn't the best way to kick off your career in cinema.\n\nI recommend this movie to people who are into their mystery/crime/dramas starring Keanu Reeves, Ana De Armas, Gabe Vargas, Christopher McDonald, Mira Sorvino, Big Daddy Kane, Sandy Tejada, Ariel Pacheco and Michael Rispoli. 2/10",
            "review_date": "2016-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awful! Ã°~Â? except for Ana de Armas - I liked her story.",
            "review_date": "2016-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "best thing about the movie was when it finished as this was a horrific film and the fact it was called a thriller was just wrong this film was a bore and confusing with no storyline",
            "review_date": "2016-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It could have been a great story.",
            "review_date": "2016-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are two distinct narratives at play in the movie, one is that of Keanu Reeves who plays a detective that is investigating the death of his partner. The other follows Ana de Armas who sees mysterious apparitions, believes she has had a miracle in her life and may hold the link to solve the murder of Keanu's partner. Let's start with the good in this movie, Keanu, carries himself with the air of a noir detective that feels his character has been doing the job for some time and has taken a toll. Mira Sorvino makes a couple brief but will acted performances as the widow of Reeve's fallen partner.  Poor editing and narrative direction hinders the two storylines from working cohesively. When it comes to the two characters intertwining at the end it comes off as weak due to the slow pacing and fragmentation leading up to the reveal. As the two stories unfold parallel to each other details of the detective's death reveal themes of police corruption, rape and drugs. Also it is good to note the movie features quite a bit of Spanish dialogue with English subtitling. The movie appears to be a victim of when studios get to involved in a film, from articles I read it seems Lionsgate re-edited most of the movie to center around Keanu Reeves after his success with John Wick, this makes it easy to see why it feels disjointed and why Director Gee Malik Linton put the movie under the pseudonym Declan Dale.",
            "review_date": "2016-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This got to be the worst movie of 2106",
            "review_date": "2016-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "About the only positive thing I can say about this movie is that Ana de Armas wasn't terrible.  Keanu Reeves's acting is so wooden, he might as well have been reading from cue cards.  The story is horribly disjointed and undeveloped, with major plot elements simply never explained. At what should be serious points in the movie, ridiculous things happen that leave you shaking your head. There's never any suspense and we never have any empathy for the characters.  \n\nThis is easily one of the 10 worst movies I've ever watched from start to finsh.  It's not Battlefield Earth bad, but it's within shouting distance of it. It's not even int the \"so bad, it's good\" category, it's just plain bad.",
            "review_date": "2016-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this was just....sad.  sad in a bad way. wouldn't even bother renting on bluray.",
            "review_date": "2016-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was mad confusing at 1st but it got good",
            "review_date": "2016-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "VIEWS ON FILM review by Jesse Burleson\n\nUnknown director (with a pseudonym to boot). Generic title. Big name stars who you sense are doing it for a paycheck. Released by way of video on demand instead of theatrical. Sound familiar? It should. If you've seen reviews for movies like The Prince or Vice, then Exposed (my latest write-up) is embedded in that category. Yeah it's lousy like the aforementioned vehicles but in a different way. Vice and \"Prince\" have a sense of coherency. You can mostly follow their every beat. Exposed is just messy. There were times when I didn't know what it was that I saw. So OK, what were you thinking Mira Sorvino? What were you thinking Michael Rispoli? And Christopher McDonald, what the heck?\n\nAnyway, watching this thing is like viewing two different films at once. I don't know how to classify it. You could call Exposed a nonprofessional indie. You could call it a crime drama/supernatural charade. Heck, you could claim it to be a foreign language flick starring Keanu \"whoa\" Reeves (huh?). No matter how you interpret things, there's 102 minutes here that feel like 3 hours. When its best performance is given by a washed-up, recluse rapper (Big Daddy Kane), you know the proceedings are in trouble. When its opening sequence takes forever and sets a bad precedent for what lies ahead, you know the proceedings are in trouble. And finally, when its director doesn't want to reveal his (or her) actual name, you know the proceedings are in trouble. Exposed can easily be renamed, Excruciating.\n\nSpeaking of said director, he may be a rookie or he may be a veteran. Either way, Declan Dale (or whatever his name is) lets you know it's amateur night right off the bat. It's clear from the opening credits (of Exposed) that he can't effectively set up a shot, can't frame a scene, doesn't know when to infuse a close-up, doesn't know where to put the camera, doesn't use a zoom out at the right time, and can't juggle his many, muddled subplots. Scenes in Exposed are either too long-winded or not nearly long enough. And Dale's editing team could have been a pack of monkeys and the audience wouldn't even know the difference. Tone is absent, dramatic momentum starts up only to get sucked into the wind, and laughable overacting comes on like gangbusters. I paid $6.99 to watch this movie on XFINITY. If I paid $1.50 for it on Redbox, it still would have been a bad investment.\n\nFilmed in an uncommon part of New York City, distributed by Lionsgate Premiere, and originally titled Daughter of God, Exposed jots back and forth to chronicle the lives of two different, combative characters. First we have Scott Galban (played by Keanu Reeves). He is your typical, doom and gloom detective. His wife passed away, his son has been taken from him, he has almost no friends, and his partner (Joey Cullen played by Danny Hoch) just got murdered in an underground subway. Galban against mild orders from his superior (Lt. Galway played by Christopher McDonald), investigates the reality of his partner's death. He goes around asking questions yet every witness he talks to, gets murdered. Second, there's Isabel de La Cruz (played by Ana de Armas). She's the only witness that Galban hasn't talked to yet. Her character is borderline schizo. She becomes pregnant by way of a miracle, she has visions of ghostly apparitions, there's a side plot about her husband being stationed in Iraq, and she ultimately wanders the film as though she's a lost puppy. Throughout Exposed, we as the audience see Isabel the most (even though her and Keanu's Scott are loosely connected). Many frustrating scenes involve Isabel, her family, and her friends constantly gabbing in Spanish (when all of them obviously speak English). As for Reeves, well we only discern his screen time in bits and pieces. His presence is never developed or consistent. Like I mentioned in the second paragraph, Exposed feels like you're watching two separate vignettes altogether. They're so unconnected from each other, it makes the film totally shapeless. When every plot element finally comes full circle (in the concluding clips), you feel the damage has already been done. Exposed \"exposes\" itself to be a real scrape. Rating: 1 and a half stars.\n\nOf note: A lot of death occurs in Exposed yet we never see it. Heck, we don't even view any of the actual aftermath. It's like the film is trying to be 1995's Se7en but is too lazy to explain how A led to B. Is it possible the studios didn't want to go over budget? Maybe. Is it possible director Dale didn't know how to make homicide scenes look believable? Maybe so. Or did the special effects crew run out of fake blood? Oh yeah, that's it. Yeesh! Also of note: I usually give Keanu Reeves a pass because a lot of moviegoers think he can't act. I've seen him do solid work in Point Break, Speed, and Street Kings. I know what he's capable of. In Exposed however, he hits a wall by showing us the ultimate, wooden moment. There's a scene where he sits in his police car, gets upset, shows frustration, yells at himself, and bangs his hands on the steering wheel. To say this is laughable would be an understatement.",
            "review_date": "2016-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Makes no sense what so ever.",
            "review_date": "2016-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this movie because my wife makes me watch every Keanu Reeves movie that comes out.  Didn't have big expectations because of the bad ratings.  \n\nYou need a triple-digit IQ to watch this one.  Definitely not one to see if you don't know the difference between \"worse\" and \"worst\".  You have to watch it closely and think about what is going on.  \n\nI could have done without the pervasive Spanish - I don't like to read movies - but I expect the filmmakers were just trying to make it realistic for the setting.  \n\nIt seems that movies that make the viewer think like this aren't made much any more.  Even movies that have a big twist at the end seem to spoon-feed audiences.  It is similar to Memento or the Sixth Sense, although there is no jaw-dropping finale like Sixth Sense.\n\nA pretty good movie, but not meant for anyone who wants a simple, escapist yarn.",
            "review_date": "2016-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Performances are strong, but it becomes dragged out an somewhat boring an does account for much",
            "review_date": "2016-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wanted to see more of Ana De Armas and her family dynamics and life. Go into what was going on in her head...",
            "review_date": "2016-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie gets 2 star. 1 for using reeves to trick me into thinking this is a cop thriller, and a second for ana being hot. other than that, this movie was shit. boring, bland and nothing to keep me interested. i didnt even know what this movie was about, was it about the cop trying to find a killer? or a girl who sees white people(literally white people). i stopped watching half way through",
            "review_date": "2016-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It had the be comings of a great movie so sad it was chopped in half for profit/ it would have been a 10/10 if they hadnt screwed with the script",
            "review_date": "2016-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It sounded like a great story for me I love thrillers but it was so slow and trying hard to be film noir, the acting was just ok except the parts with the dog were really lame, on the whole very disappointing..",
            "review_date": "2016-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You will never get this time back...horrible movie",
            "review_date": "2016-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very, very BAD movie. A waste of time.\nThere's no story and nothing fits. DON'T WASTE YOUR TIME!",
            "review_date": "2016-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hated it took ages to get to point",
            "review_date": "2016-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Confusing and with some really odd editing. The movie is slow and you dont really get to grips with what is happening and why. The plot could have been explained better and then you would have more empathy for the characters. A waste of Keanu Reeves.",
            "review_date": "2016-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "okay, I'll admit the editing makes every single transition from each scene a chunky terrible mess, and Keanu Reeves acting does come off as though he would rather be anywhere else in the world besides in that movie. however, the overall story and the final payoff with multiple reveals not only showing us the killer of Keanu Reeves partner but also showing us the extent of Isabel's torment combined with the fact that the movie used the supernatural element driving the movie all the way up to the end pretty much makes those terrible things forgiving I do wish the movie would have been executed better it just simply needed to be put together by someone with vision but it was amazing!",
            "review_date": "2016-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This currently holds my vote for worst movie of the year. At times, I shut my eyes out of boredom. If anyone understands the ending scenes of the movie, please explain them to me.",
            "review_date": "2016-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked this film. I thought Ana De Armas was great. And, frankly I don't get all the bad reviews, it's an entertaining good little film, that I would recomend.",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was an amazing tale of a young women's struggle to come to terms with her past. \n\nThe story is smart, deep, and rewards any audience that is switched on and paying attention.\n\nIf you need to be spoon fed plots, then this film is not for you.",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "kinda interesting.. with a twist",
            "review_date": "2016-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just an awful movie. Crappy start crappy middle and crappy ending. Not worth anyones time",
            "review_date": "2016-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "https://www.change.org/p/lionsgate-premiere-tell-lionsgate-to-release-the-daughter-of-god-exposed-director-s-cut\n\nLionsgate Premiere significantly edited the movie called \"Daughter of God\" directed by Gee Malik Linton into an incomplete and disjointed film renamed \"Exposed\". Lionsgate Premiere did this without the director's approval so the director removed his director credit from the film. The original director's cut focused on Dominican family and the primary protagonist Isabel. The director's cut also depicts the protagonist's ability to remain strong with the support of her Dominican step-family along with surreal undertones. \n\nLionsgate Premiere removed major scenes featuring black and Latino characters along with major chunks of Isabel's Dominican family life in Washington Heights. Cut by more than 25 minutes, the once dreamy-yet-haunting, female-centered drama is turned into a disjointed thriller with a flat unfinished ending. Some characters' parts are cut almost entirely, diminishing the effect of the final twist of the film and causing the ending to fall flat. The subplot about police corruption and brutality is diluted to make more time for Keanu Reeves to brood, an attempt to expand what was intended as a thin role for the sake of box office revenue. Surreal elements that made this movie special aren't in the final cut. This petition strongly requests Lionsgate Premiere to release the director's cut. \n\nhttps://www.change.org/p/lionsgate-premiere-tell-lionsgate-to-release-the-daughter-of-god-exposed-director-s-cut",
            "review_date": "2016-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Reeves is on a roll here trying to outdo the worst movie ever made - his last - John Wick. This is prime trash can fodder.",
            "review_date": "2016-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No redeeming virtues. Slow, boring, quite meaningless. Avoid at all costs.",
            "review_date": "2016-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "DO NOT WASTE YOUR $ ON THIS MOVIE.  IT REALLY WAS THE WORST EVER!",
            "review_date": "2016-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie feels like a struggle between writer, director and producer.  There are two main stories to tell and you would expect that they would intersect at some point, but they don't.  The editing is ham-handed, scenes and dialogue appear out of nowhere, the character's emotional states change from minute to minute without provocation or lead-in, people die as an aside, there is no character development whatsoever, and the list goes on.  You get to wondering how Hollywood turns out crap like this.  The story has potential but it was destroyed.  Not sure whose fault it was, but they should be ashamed for the mess that was delivered to the public.",
            "review_date": "2016-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie exposed just how horrible a movie can be.",
            "review_date": "2016-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fking horrible film. Why would K take this role. don't waste your time.",
            "review_date": "2016-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Credit goes to the doe-eyed actress who made us believe that there is a miracle happening...",
            "review_date": "2016-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Betrayed by its own fragmented narrative.\n\nWhile Knock-Knock was a mishap, Keanu Reeves still carries the buzz from John Wick, so it's peculiar to see his new movie flies under the radar. It's soon apparent that \"Exposed\" has a rather jumbled presentation. The movie uses multi perspective style and it does try to deliver heavy subject such as abuse, but it's ultimately too broken to create any appropriate connection.  \n\nThe two perspectives are too messy, as though the screenplay or editing is done sloppily. Keanu's point of view is that of noir detective, although the investigation moves so slowly and erratically. Meanwhile Ana de Armas plays as a troubled wife who might just see some apparition. From the color tone, the pace and even the script, these two stories are utterly different. \n\nIt's not to say that there's not an artistic goal in mind, it could have dealt with mature theme well, however the jarring shift is confusing to say the least. It would jump from festive vibe, to brooding case and suddenly to what seems to be psychological thriller with metaphor. This is a really odd direction and it doesn't have to be such, it feels as though the movie tries to needlessly overreach.\n\nBoth the leads perform admirably, in some instances Ana de Armas looks amiable and Keanu Reeves still has his appealing presence. However, the plot is chaotic, there would be incredibly slow development and subplots, yet it would hasten abruptly in mere minutes. The few segments from other angles don't really pan out in the grand scheme, while its intended twist is hampered by over saturation of horror genre, which is odd to see in crime drama.\n\nThis kind of sudden change is not uncommon, some thriller movies shifted to more action atmosphere for casual audience or some action flicks would be altered to accommodate more famous stars. Still, the extreme shift of tone here doesn't have any appeal instead it's only a distraction.\n\n\"Exposed\" could have a surreal depth for narrative, yet it's a just a confusing mess that barely has any charm and even that small spark is muddle with messy production.",
            "review_date": "2016-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sadly, another poor film for Keanu Reeves.  Sad to see such talent wasted in slow, boring, muddled and semi competent crime thrillers.",
            "review_date": "2016-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a terrible movie.  Don't even waste your time when it comes out on Netflix.  It's so bad, I had to do some post-viewing research on how a movie this bad could have ever become produced in the first place.  What I found out, is that it was much worse before it was edited to death.  They tried to salvage some of their money by changing an awful social justice surreal art film... into the cop drama that they thought they were paying for.  It should have went straight to DVD.",
            "review_date": "2016-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One convoluted mess of  a movie which cannot be saved neither by de Armas' soulful performance nor by Reeves'  smoldering anger and guilt. Nor by Lionsgate's editing, apparently.  Still, an interesting movie.",
            "review_date": "2016-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If I could give this movie 0 stars I would! Couldn't even make it half way through this movie without getting bored. This movie was slow and boring!!! Don't waste your time!!",
            "review_date": "2015-12-10",
            "source": "rt",
            "lang": "en"
        }
    ]
}