{
    "rating": 9.1,
    "release_date": "2016-12-21",
    "num_reviews": 790,
    "genres": [
        "Drama",
        "Biography"
    ],
    "summary": "Five year old Saroo gets lost on a train which takes him thousands of miles across India, away from home and family. Saroo must learn to survive alone in Kolkata, before ultimately being adopted by an Australian couple. Twenty-five years later, armed with only a handful of memories, his unwavering determination, and a revolutionary technology known as Google Earth, he sets out to find his lost family and finally return to his first home.",
    "reviews": [
        {
            "content": "Such a heartwarming movie.  I wasn't bored at any point of the movie and I was hoping the ending would be good.  I love true stories and this was a great one.",
            "review_date": "2023-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intriguing. Captivating. Thought provoking. Heart wrenching. Profoundly moving. Deeply touching.",
            "review_date": "2023-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The scene of birth family and the lost child at the beginning were extraordinarily affecting.  What a cute kid.  The rest of the movie was great too.  Got a little slow when he was obsessing but that's just a minor complaint.  Well acted and well told!",
            "review_date": "2023-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Movie was Excellently written and the Acting was Stellar. It is heart wrenching at times, but the approach to resolve Saroo's concerns about his prior life before adoption unfolds so beautifully. Bring out the Kleenex at the end of the Film! Dev Patel is awesome as usual!",
            "review_date": "2023-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worth watching if you want the 'feel good' movie and aren't too critical about bad directing",
            "review_date": "2023-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I knew this movie would break my heart, and it did! Dev Patel and his young counterpart were amazing amazing actors. All the actors were good. Beautifully shot, compelling, bittersweet. A lovely film and even better that it's a true story! Everyone should watch this!",
            "review_date": "2023-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first half or so of the movie—shot in India and ending with a lost little homeless boy being adopted by Australian parents—does seem to be saying India is a sh***ole, The Western World is good, Indians are either poverty-stricken or work as pimps/prostitutes—and White people are rich, happy and good; you soon, however, see that the depictions in the first half are essential to the story. The second half beautifully explores how a seemingly simple matter—that of being adopted in a foreign country—can turn out to be so very emotionally complex. Apart from the fact that the movie is based on actual incidents, the best part for me was the way it slowly and steadily builds up to an emotional climax par excellence—sans mushy melodrama.",
            "review_date": "2023-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "REALLY late on the review but this movie is so emotional and the development of the story is so perfectly documented. Great movie :)",
            "review_date": "2022-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You know, you could just watch this for Dev Patel's near flawless Australian accent, but beyond that wonder, Lion might be the most powerfully moving film I've ever watched. I don't seem capable of making it through without ending up in a crying mess. If you haven't watched it, watch it tonight.",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best filmmaking debut ever from Garth Davis! With the best acting performance from Sunny Sawar!",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful wonderful film. Full of heart and love, full of loss and redemption. The fact that it's based on a true story adds to its wonder. Dev Patel, Nicole Kidman and an extraordinary performance from the young Saroo are standouts in a fabulous classic movie",
            "review_date": "2022-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant. Cried like a baby.",
            "review_date": "2022-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie of the last 10 years in my view. Incredibly emotional, sheds light on so many things I knew little about and all based on a true story!",
            "review_date": "2022-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hard to watch but for the right reasons. This was one of the truest and most realistic movies I've ever seen! I've rarely seen poverty and adoption filmed so masterfully, I cried a lot!",
            "review_date": "2022-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5 years ago- Emotionally impacting, the film is anchored by a powerful, quiet performances from both Dev Patel and Sunny Pawar.",
            "review_date": "2022-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An inspiring and emotional true story! I very much enjoyed it. Highly recommended!",
            "review_date": "2022-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some of us thought the film was very... what's the word? Forgettable? \nOthers thought they'd expect more from a 6 time Oscar nominated film. We also thought it was excellent in ways, and portrayed Saroo's life well. It could've done with a lil' bit more pizzazz at times.",
            "review_date": "2022-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cried my eyes out the whole movie, what an emotional rollercoaster! Great movie",
            "review_date": "2022-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another lost Flixster rating.  I own it digitally.  :(",
            "review_date": "2022-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film is emotional, charismatic, and with a perfect cast. The scenery is good and the costumes are even better. But without a doubt, the performances of Dev Patel and Nicole Kidman are the best. Of course it is a film made to make you feel a lot of sensations and move you.",
            "review_date": "2022-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion is a drama film directed by Garth Devis released in 2016. The film stars are Nicole Kidman and Dev Pastel, the main character are Rooney Mara, David Wenham, Sunny Pawar, Dev Pastel and Nicole Kidman. The film was based on a true story that of Saroo Bierley. This movie tells about a little boy of 5 years Saroo that lived with his mother and his brother. He finds himself alone on a train crossing India that takes him thousands of miles from his family. Lost Saroo learn to survive alone in the huge city of Calcutta. After some mesaventure he is taken by an Australian family who adopts him but a few years later, the young man decides to look for his biological family on Google maps and finds them but then learns that his brother is dead. I think that the plot seems to be absording from the start. The special effects was weak see even absent but the photography was just incredible and impressible. I found the performances of the characters very spectacular, natural and powerful in particular that of Nicole, Dev, David and Rooney. The script was so moving and at the same time beautiful, the music stuck perfectly with the actions of the characters as for the realization it was perfect there was a bit of everything, big plan, over the shoulder, extreme long shot etc. Generally I find this film absolutely fascinating. I recommend it to anyone who likes moving and dramatic movies and if you haven't seen it hurry up to see it because it's simply amazing.",
            "review_date": "2022-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film drags at certain points, but it is an incredible true story that is worth the watch.",
            "review_date": "2022-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An emotional and uplifting story. It falls to a lot of cliches of the genre, but it's performed with expertise by a talented cast, especially the kids, they're insanely impressive.",
            "review_date": "2022-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the few movies that made me cry, mostly the brothers at the beginning and the end. The acting was absolutely natural between those two. Beautiful scenery and music too. \n\nWhat I didn't like was the focus on his adoptive mother later in the movie because while understanding her struggle it seemed like that belonged to the story of his adoptive brother. Not sure if it was necessary to make him look like a bad son without providing any background when he exists in real life and already went through so much.",
            "review_date": "2021-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So emotional, absolutely must see",
            "review_date": "2021-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "mannn this one hit different! Right in the feels",
            "review_date": "2021-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dev Patel and Rooney Mara are superb. The acting and depth of emotion brought on by these actors make you feel you are a part of their journey. I feel that Dev is one of those actors of our lifetime that will forever make movies that will always be remembered. His movies are always a journey and he makes you feel you wish the movies were not over when the movie is finished. Dev is an actor that will forever be a gem to all movie screens to come.",
            "review_date": "2021-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Have a depression triggered by an identity crisis? Watch this movie!",
            "review_date": "2021-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Highly rewarding. I cried. Moving and truly an unbelievable story of perseverance and love eternal.\n\nI'm adopted. I failed in my quest to find my natural parents. My adopted parents wholeheartedly supported my search. They're gone now, but I hope to meet them and my natural parents in the next life. I am not religious. No. Not at all. But you never know. \n\nThanks to this film there is magic in the world.",
            "review_date": "2021-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of only half a dozen films in my live  that have brought me to tears",
            "review_date": "2021-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this movie a while back and was amazed. It was fantastic in the way that it drew so many emotions from the audience. It's such a sad story that was spun into a beautiful journey. Dev Patel is spectacular, as well as Nicole Kidman in her struggles to mother him. Definitely a must watch film.",
            "review_date": "2021-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the best movies I've seen in a long time. Totally captivating and emotionally satisfying. Highest recommendation. Great story. Great cast. Beautifully filmed with a nice score.",
            "review_date": "2021-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There and back to see how (emotionally) far it was.",
            "review_date": "2020-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion is flawed, but it is flawed to the tune of six Academy Award nominations and three BAFTA wins.",
            "review_date": "2020-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story is better than the movie. It's a good watch but a little overrated. It drags in some places. It's longer than it needs to be. Some parts are a bit over-dramatic.",
            "review_date": "2020-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An impressive biographical drama, a story that moves the viewer, is a good film.",
            "review_date": "2020-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touching movie, quite soul soothing especially for this time when people are down and out, stuck in quarantine. I recommend this movie for a good fun time.",
            "review_date": "2020-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spectacular story. Acting was good but not great. Also some unnecessary parts.",
            "review_date": "2020-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm unashamed to say that the tears started falling as the story neared its end.  It wasn't until the story was concluding that I realized it was a biopic, which made it even that much more moving... and tear inducing.\nThe acting is superb, especially by Dev Patel and Sunny Pawar who both play Saroo Brierley, an Australian businessman, at two different periods in his life.  Also outstanding as usual is Nicole Kidman as Saroo's adoptive mother.  This is a tale of family lost, family found, and hopefully family found again.  The second half drags just a little spending a little more time than necessary on Saroo's relationship with his girlfriend, but overall a solid A-.",
            "review_date": "2020-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A touching, based on truth story.",
            "review_date": "2020-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Garth Davis is a name that is new to me, but what a great debut film for the director…and an Oscar nomination for Best Picture to top it off.  Beautiful cinematography, great score, fantastic acting (especially Sunny Pawar as the young Saroo), and a heartbreaking ending.  Other than a few maudlin scenes between Dev Patel and Rooney Mara towards the end of the film, there's not much to dislike here.  Watch the movie, wipe the tears from your eyes, and have a group hug with your family.",
            "review_date": "2020-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well-made and moving story with more strong performances by Dev Patel and Nicole Kidman. Disturbing glimpse into India's yearly child disappearances.",
            "review_date": "2020-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful and emotionally evocative. It's a compelling,  fascinating, and true story of a boy who got lost and years later tried to find his way home. We often get caught up in our First World problems. We could all benefit from occasionally taking note of Third World problems, and of the universality of strong family bonds throughout the World. A must see film, especially if you liked Slumdog Millionaire (Dev Patel starred in both). The 8 year old actor Sunny Pawar was amazing. Nicole Kidman was heartbreakingly real.",
            "review_date": "2020-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most important stories for its message. It remembers the importance of humanity and how much every people's lives count, showing some of the worst problems that can happen to millions of poor people still today. This story tells about one lucky case...",
            "review_date": "2020-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So powerful are the performances by Dev Patel and Sunny Pawar, that it's hard not to empathise and shed a few (or many) tears. The telling of Saroo's somewhat normal new life is punctuated with scenes of his traumatic past, ensuring the pace of the film never falls short of thrilling. An unmissable film.",
            "review_date": "2020-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely gut-wrenching. Took a day for me to recover.",
            "review_date": "2020-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Excellent story line and emotional attachment to the movie.",
            "review_date": "2020-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is literally trash there is absolutely nothing good about this movie you could tell what was going to happen from the start, i could smell the indian all the way from new zealand ffs.",
            "review_date": "2020-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story is nowhere near as uplifting as it thinks and the narrative seems to meander. Deeply forgettable.",
            "review_date": "2020-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion stars Dev Patel, Rooney Mara, Nicole Kidman and David Wenham and it's about a child that got separated from his family by accident and gets adopted by a mid to high class family, then wants to figure out who his real parents are. This movie is extremely emotional, the other two people I've seen this movie with started really tearing up by the end of the movie. I would also want to mention the child's acting which is surprisingly really good. This movie is really beautifully shot and directed, and the score fits right in with all scenes it's in. My problem with this movie is that it feel a little bit too dragged out, if this was 20 minutes shorter and a bit more compressed I would have liked it even more. In the end, Lion is a really touching story that would leave audiences tearing up all around.",
            "review_date": "2020-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A dramatic an emotionally affecting true story that with its talented cast and solid script it trascends the clichés of its genre.",
            "review_date": "2020-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is exceptional! So touching and emotional. Based on a true story that will completely leave you in tears throughout the whole movie.",
            "review_date": "2020-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great. Moving. Will make you cry.",
            "review_date": "2020-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A hidden gem. Such natural acting and an unique setting. Adorable plot that's heartwarming, emotive and heart breaking from start to finish. Beautifully created, a film I simply cannot forget.",
            "review_date": "2020-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful movie, especially so being a true story. Very moving....",
            "review_date": "2020-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very nice portrayal of the true story of a lost Indian boy, adopted by an Aussie couple and returning to India 25 years later to find his birth family.",
            "review_date": "2020-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The real life storyline when you read it is strong and moving. I felt the handling of it was average at best. The movie dragged and could have done better showing the depths of 'why' behind Saroo's inner turmoil as an adult. Thin on action and character development, the flick needed to be atmospheric; but I didn't feel that.",
            "review_date": "2020-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful and heartfelt movie about a young boy finding his way home on the streets of India. It also gives us a glimpse of of so many children affected by poverty",
            "review_date": "2020-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great first half, very exciting and tense, but then a sudden weird tonal shift into being a film about a manic hoarding hermit, with Nicole Kidman whispering barely intelligible nonsense and all the main characters ignoring each other for 45 mins.   \n\nThe last 5 minute were good though.  \n\nSeems the director Garth Davis still a bit of a newbie, will see if his next film has better pacing.",
            "review_date": "2020-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good. ‏‏‎ ‎‏‏‎ ‎",
            "review_date": "2020-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An emotional tale driven by the great performances of the cast. The back half loses a bit of momentum even if it nails the emotion, while the first half os pretty fantastic storytelling.",
            "review_date": "2020-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A riveting drama about survival, home, and acceptance.\n\nGarth Davis' indie drama Lion (2016) is a harrowing Australian biopic about Saroo Brierley's tragic and inspiring life story.\n\nDavis' direction is intimate and honest bringing Saroo's incredible true story to life with gentle indie sensibilities. Lion depicts an Indian child, who got lost from his mother and home, adopted by an Australian family, and found his way home after 25 years. It's unreal to think about such long suffering and conflicted feelings, but Lion handles these complex emotions with sensitive filmmaking and earnest empathy as you watch the boy wander far from home into a hurt grown man with questions that need answering. Garth Davis takes on missing children, Indian poverty, and child trafficking with a gracious respect. Davis should really continue to direct dramas as his style fits all the sincere conversations between characters remarkably well. Lion is a phenomenal picture full of longing and love.\n\nFirst off, I must mention Sunny Pawar's magnificent child acting as young Saroo. His confused and scared looks are deeply affecting. His acting is very realistic too for such a young man. Dev Patel has never acted so complex or affecting in a role before. He is phenomenal as the Saroo Brierley as a young adult. He honestly should have been nominated for Best Lead Actor at The Oscars, I don't know how anyone could consider him a supporting role as he is Lion. His mane of hair, courageous spirit, gripping delivery, haunting facial expressions, devastating statements of confrontation, and tender interactions with his loved ones is just wonderful. Patel is actually underrated as an actor to me.\n\nI loved Rooney Mara in Lion as he embodies as loyal girlfriend Lucy and sympathetic ear for the long suffering Saroo. Mara has excellent and believable chemistry with Dev Patel. She acts with such nuance with every graceful look and gesture that she continues to impress me with every role. Likewise, Nicole Kidman is heartbreaking as Saroo's adopted mother Sue Brierley with her kind presence and welcoming affection. David Wenham is very likable and patient as Saroo's adopted father John Brierley. I love the scene where he pleads to Dev Patel behind his front door. It sounds so authentic.\n\nAbhishek Bharate is fantastic as Saroo's playful and attentive older brother Guddu. Divian Ladwa is strange, haunting, and unforgettable as Saroo's troubled adopted brother Mantosh Brierley. Tannishtha Chatterjee is fascinating as the deceptive Noor, who lures Saroo to the creepy Nawazuddin Siddiqui killing it as Rama.\n\nLuke Davies' script depicts a genuine relationship between mothers and their sons, brothers and their siblings, and boyfriends with their girlfriends. His writing is very naturalistic and carefully sympathetic to the real pain felt by this family. I appreciate his realistic words all the more upon a second viewing of Lion.\n\nAlexandre de Franceschi's editing is so smooth and creative. He cuts between a child's sudden odyssey and a man's turbulent present with effortless class and care. Lion feels more artistic in nature because of his thoughtful cutting choices. Greig Fraser's cinematography is shocking in how he beautifully portrays India and Australia's natural scenery as well as how he honestly displays India's abject poverty. Every mid-shot of each character's body is so striking.\n\nDustin O'Halloran and Volker Bertelmann's score for Lion is subtle with gentle melodies underneath heavy drama and sweeping majesty to accompany powerful reflective journeys. The sounds of Indian and Australian styles blend well in Lion with 1980's synths and traditional Indian instruments harmonizing to aid Lion's soft soundscape.\n\nIn all, Lion is 118 minutes of real tears and astonishing situations.",
            "review_date": "2020-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredibly empowering storyline. I cannot recommend this film enoughb",
            "review_date": "2020-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful story which also makes you appreciate a life free of hardships.",
            "review_date": "2020-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the actors and interpretation. It's a painful history but we can help too many homeless Indian children.",
            "review_date": "2020-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit too much of waste time showing the main character sitting at his own place, googling, and having surrounded people suffer. The movie started with an interesting story of his childhood, and could have focused more on that instead of showing his emotional conflicts for 1/2 of the movie time.",
            "review_date": "2020-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My word, what a tear jerker. Quite a lovely and delicately handled film.",
            "review_date": "2020-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing story that will make you cry",
            "review_date": "2019-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing hard to find movies this good now a days",
            "review_date": "2019-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sadly the film is half an hour too long. The time in Australia is unnecessary as aside from one discussion with adoptive mother, it is not relevant to the story. The start is great and the end is emotionally affecting.",
            "review_date": "2019-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Having such a thin premise stretched out over nearly two hours of running time really hurts this film as while it has it's moments they are fleeting and the film is largely uninvolving. I was rather shocked by the fact that this film picked up so many awards nomination and although I note that it was produced by Harvey Weinstein and that was probably the reason that it made it's way into the \"hearts and minds\" of Academy Awards voters it did seem incredibly dull and milquetoast amidst a lineup that included Moonlight (2016) and Manchester by the Sea (2016). Hopefully we can move beyond films like this that present a story sure to wring emotional responses out of audiences but doesn't do so skillfully enough to overcome the fact that the film itself is bland schmaltz.\n\nAs a child Saroo, Dev Patel, boards a train from a station in Khandwa, India and accidentally separates himself from his mother and siblings. He arrives in Calcutta and struggles to support himself, falling into the hands of several suspicious figures, eventually he is picked up by child services and trained in preparation for adoption by an Australian family. He is raised by the kindly Sue Brierley, Nicole Kidman, and her husband John, David Wenham, who he grows comfortable with but the arrival of mentally unstable fellow adoptee Mantosh, Divian Ladwa, their family is thrown into disarray. As an adult Brierley is professionally successful and enters into a relationship with American Lucy, Rooney Mara, yet he wonders about who his true parents are and with the help of Google Maps seeks to track down his childhood home and family. This search puts him at odds with his adoptive mother who worries that he does not value her parentage and his girlfriend who feels that his focus on this issue is damaging their relationship.\n\nThe best section of the film comes when Brierley is adopted and we see the difficulties of integrating a foreign child into a new culture and family dynamic. Kidman is excellent as the caring mother struggling to keep her family together and she maintains that tremulous tone that she puts to such good use as the brittle, manipulative wife in Eyes Wide Shut (1999). The scenes of the family simply playing cricket on the beach or helping their son learn words in English are simply delightful and simply executed in a way that better highlights the emotional turmoil of Brierley than the other sections of the film. With the arrival of a troubled adoptive brother my interest in the family dynamic increased as this loose cannon with a tortured past could easily disrupt a seemingly settled unit. Sadly we cut from scenes of this devastation to an adult Brierley and other than scenes of him stabbing himself with the end of a fork we miss out on having this conflict developed.\n\nWhat we focus on instead is a boring young man who goes through a crisis that should be emotionally wrenching but seems as though he is mildly concerned therefore the audience is never really engaged. Patel is a fine actor but he fails to compel when we need to care about him and director Garth Davis fails to inject any urgency to the sight of a young man scrolling through Google Maps. Mara gets a thankless role as the needy girlfriend whom he inevitably breaks up with as because we know the course that the story takes we know they will break up and have no reason to invest in their relationship during early interactions. This is a movie where you know almost exactly how it begins and ends but where the real excitement of the film should come is in seeing how he gets from A to B and sadly this is the least fascinating part of the film.\n\nThe Academy would have done better to nominate Silence (2016) or Paterson (2016) for Best Picture as this is a film that likely will not be remembered in twenty to thirty years. Like Finding Neverland (2004) and Seabiscuit (2003) before it this film was inoffensive and reached a base standard of ‘decency' that allowed it to receive awards for not dividing opinions greatly.",
            "review_date": "2019-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a movie that makes you cheer for the protagonist to find his family. The story and some characters are great and the emotion is raw, but some scenes are boring and creates a disinterested to the other characters that are undercooked.",
            "review_date": "2019-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic performances and a great score make this one of the most emotionally gripping movies I have seen at the cinema. ",
            "review_date": "2019-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fascinating story well told.\nThe child actor Sunny Pawar is incredible- his ability to portray the feeling of being completely lost. I just stumbled on this movie on Netflix but would thoroughly recommed!  ",
            "review_date": "2019-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good story, But it is dismal and lacks drama and effects\n\n",
            "review_date": "2019-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The real pleasure of the film begins and ends whenever the camera is directed to the joy of black life in India",
            "review_date": "2019-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A heartbreaking movie really.",
            "review_date": "2019-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Drawn out predictable painful bore, complete with continual whining violin background music. ",
            "review_date": "2019-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent. Every thing about this movie. A must see!",
            "review_date": "2019-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best inspirational movie I have ever watched!",
            "review_date": "2019-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion may be a predictable film but it’s a very heartwarming film and very well-made. Performances all around are top-notch. Cinematography is wonderful and the movie is very moving as well especially towards the end. Lion may not be a perfect film but it’s definitely one film that shouldn’t be missed.",
            "review_date": "2019-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion may be a predictable film but it’s a very heartwarming film and very well-made. Performances all around are top-notch. Cinematography is wonderful and the movie is very moving as well especially towards the end. Lion may not be a perfect film but it’s definitely one film that shouldn’t be missed.",
            "review_date": "2019-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By purposely focusing on the execution, Lion's neglects any element of surprise.",
            "review_date": "2019-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion tells a moving and heartbreaking true story through captivating performances and beautiful cinematography. The film captures the pain of being a lost child without being overly dramatic. Instead it's uplifting and focuses on the happy ending of this remarkable story. The transition between young Saroo to adult Saroo would be the only issue as it splits the movie into two halves and leaves a gap for questions regarding his life after being adopted. Other than that, there's nothing but praise especially for Sunny Pawar who was simply amazing.",
            "review_date": "2019-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a beautiful story about a lost little boy in India.  Best movie I've seen in years.",
            "review_date": "2019-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bring water because you'll need to re-hydrate after all the crying you'll do in the first act of this one.",
            "review_date": "2019-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a lovely film. ",
            "review_date": "2019-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely moving. Touches your deepest feelings. There couldn't be a better cast. Everything, from the language and location to the actual footage in the end, make this a masterpiece.",
            "review_date": "2019-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent Movie. Just when you are start to lose faith in the existence of s great movie, this one comes along",
            "review_date": "2019-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "And I cried while watching this as I did reading the book. Thinking about Saroo's journey is difficult but this movie expressed a bit of how hard it was. Best part being the outcome of his journey.",
            "review_date": "2019-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie!! About a boy who was lost on his country searching for his family, later a couple from Australia adopt him, for later on his adulthood continues his searching for that biological family who loved him so much during his childhood. Great acting and a great story!!",
            "review_date": "2019-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a touching true story.  Cinematography is surpassed \nonly by the performances.  One question to the editor ... the \nlandscape is so beautiful why cover it with opening titles?",
            "review_date": "2019-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heart wrenching, soul searching and wonderfully, passionately acted; “Lion” is a masterful film, with career highlight performances from the immensely talented Patel and Kidman. ",
            "review_date": "2018-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An infant wanders off on a train, and then the train starts moving, not stopping for days till the child is over a thousand kilometers away, and horribly alone. Years later, being adopted and living in an entirely different country, he explores the net and his memories to try to see if he could manage finding his original family again.\nWell portrayed and adequately shot, this extraordinary tale was a good watch!",
            "review_date": "2018-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "love it....except the romance part but thats the only part I do not like :p",
            "review_date": "2018-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this film but I definitely saw the gap from the young child to the grown man, it was almost like two different films.  I admit I loved the way the first half of the film made you feel like the little lost boy and everything he went thru.  The second half, you were more like an observer, it wasn't as intimate.  Regardless, great job on an awful story that breaks your heart even more because it is true.  Sunny Pawar was breathtaking.  A beautiful little boy who turns into a beautiful man, Dev Patel.  Both will pull your heart strings.  My one big gripe, I thought finding out about his brother should have been a scene rather than a sentence at the end of the film.",
            "review_date": "2018-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really liked it. Fascinating story and many remarkable plot points and lines of dialogue. Also, Dev Patel is only getting more attractive with age!",
            "review_date": "2018-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Caught this film when it was first released and was blown away. The best stories are often true, and this is one of the best. One of three incredible yet disparate movies of the year, it deserves serious consideration ( I think it may come down to which genre one prefers). It’s a bit long but never boring. Nicole Kidman deserves special praise here as the distraught adoptive mother. Nothing short of amazing, you will not be disappointed. ",
            "review_date": "2018-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best film of 2016.",
            "review_date": "2018-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spectacular story, spectacular movie, 6 stars from 5 available",
            "review_date": "2018-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Both heartwarming and devastating, this is an emotional rollercoaster that is well-acted and directed. The film is a deep look into an incredible true story, and doesn't glamourise anything for mass-appeal. This is a great biography surrounding an unheard story that all should watch.",
            "review_date": "2018-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The unknown can be extremely scary, especially when you are five-years-old and end up miles from home. ¨Lion¨ directed by Garth Davis, made it to the big screen in 2016 starring actors such as Sunny Pawar, Abhishek Bharate, and Dev Patel. The movie focuses on Saroo's journey after he is lost from home and eventually starts a new life in Australia with his adoptive parents. This film was idiosyncratic as it provided a plethora of different flashbacks which helped the audience better understand Saroo´s situation. The film begins in India, Saroo´s childhood home, which impacts the movie because 80,000 children go missing in the country every year. ¨Lion¨ is definitely a jaw-dropping film that I would recommend to my friends and family.",
            "review_date": "2018-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a must-see and must-see-further",
            "review_date": "2018-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cinematic story telling at its finest. Through the eyes of one boy, we see (and experience) the worst and best of humanity. I never felt manipulated (save perhaps for the unnecessary last few seconds of the end credits) by the film-makers. There are no cheesy, Hollywood-style monologues here—just an honest telling of a story that's raw and real, thoroughly absorbing and deeply moving. A beautifully crafted Australian film.",
            "review_date": "2018-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this movie using boxxy software a few days ago & honestly it has the most emotional storyline imaginable.",
            "review_date": "2018-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible!!  A must watch!",
            "review_date": "2018-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The whole movie leads up to an ending that will move even the coldest of hearts. Dev really made me aware of him in this one... Can't wait to see more from him.",
            "review_date": "2018-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptional in every sense! ",
            "review_date": "2018-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful film, & wrenching story. One of my all time favorite movie’s & soundtrack. ",
            "review_date": "2018-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion tells the endearing true story of a boy named Saroo and his turbulent journey of self-exploration. Saroo is played to perfection in the first act by newcomer Sunny Pawar who perfectly illustrates the struggles someone his age might be dealing with when thrust into such abrupt change. The struggles of this young man are handled perfectly by director Garth Davis, making certain not to rely too much on increasingly awful situation after awful situation to allow the audience to sympathize with Saroo, instead relying on the performance of Pawar to accurately depict this child's many struggles. The gorgeous cinematography displayed throughout the film that lights up the slums of India and the suburbs of Tanzania alike is made first apparent from the third scene of the film, when Saroo is asleep at the train station, waiting for his brother, onward, becoming one of the shining points throughout the film. \n\n\tThe second act, despite brilliant performances from Nicole Kidman and Dev Patel, marks the film's weakest point. After the wonderful set-up in the first act of Saroo's sadness for his true family, the film almost takes a detour, instead favoring adding in development's into Saroo's interest as well as telling a romantic subplot that, while not completely unwarranted, greatly slows down the pace of the film. Almost all of the development into Saroo's collegiate endeavors, is instantly tossed aside as soon as Saroo starts to find himself, rendering that section of the film completely meaningless. \n\n\tThe third act of the film, while not as great as the first, greatly improves on the mistakes of the second and returns to the Saroo-centrical nature of the first act. The third act not only gives the necessarily happy conclusion to Saroo's arc of finding his \"home,\" it does this while masterfully finishing the subplot between Saroo and his Australian mother. The flaws of the third act mainly rely on its follow up of the second act which creates divides in terms of pacing and general plot development. While Saroo's discovery of his home may seem abrupt due to the unnecessarily slow nature of the second act, it is mostly in line with the pacing of the first act of the film. Lion, despite its flawed second act, is an extremely well-done and satisfying film that is buoyed by fantastic performances from the leads as well as an incredibly uplifting ending that leaves the audience, just like Saroo, in tears of joy.",
            "review_date": "2018-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Both heartbreaking and inspiring. I could hardly believe this was true. Beautiful story. ",
            "review_date": "2018-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully told!! Tears!!",
            "review_date": "2018-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "probably watched in the summer of 2017.  Forgot to write a review.",
            "review_date": "2018-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My brother recommend this movie for me, and I can say it was such a good movie to watch.",
            "review_date": "2018-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Be prepared to go along on a journey. Some good and some heart wrenching. In the end... astonished!",
            "review_date": "2018-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Garth Davis swooped in to seize 2016 with a movie that brought all the feels. Try not to well up as Saroo, a young boy from a small Indian village, becomes separated from his brother via unexpected train travel, facing the terrors of Calcutta alone. As a young adult in Tasmania, he must reconcile his love for the Australian couple who adopted him and the sudden pull to find his biological family back in India.",
            "review_date": "2018-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie!!! Cried like a baby at the end!!! Dev Patel is awesome",
            "review_date": "2018-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion: The Personal Decision to Love\n\nDrama movies have always been a very popular option on the billboard. There are hundreds to watch and cry with, but what makes Lion (2016) stand out from all those other films? Together with the cast participating in this film, cinematography, production design and sound, Lion brings to the table a delicate story about the ties built inside a family when each one decides to love the others. There are many movies that want to convince us that love is about destiny, but Lion exhibits with clearity that the ones that love the most are the ones that choose and are committed to love.\n\n\n\nIndia is a beautiful country, rich in culture and traditions but economically poor for many. Inside this world, Kamla and her children try to survive by working hard jobs and begging for money in train stations. One night, two of her sons (Guddu and Saroo) went to a different town to find something to eat and bring home. While waiting for his older brother, Saroo fell asleep in one of the empty carriages at the station. When he woke up he realized that the train was moving and that he was miles away from home, getting lost in one of the most busy Indian cities. This little boy was lost for days and after being discovered by a government organization, he was flown out of his country and adopted by an Australian couple. More than twenty years later, Saroo became obsessed with his vague memories about his roots and starts a path to find home.\n\n\n\nIf you are a mom or if you are planning on becoming one, please bring tissues with you. The day you decided to be a mom, you decided to love your child. You probably knew that raising a child wouldn't  always be easy but you wanted to do it. You chose to have, raise, take care of, support and guide your child because you loved him/her since the first day you knew that his/her little heart was beating inside of you. Because of this pure maternal attachment, if our 5 year-old child gets lost and you don't know where he is, what would you be willing to do to find him? Maybe some of us would run all over the world looking for our children. But if we were single mothers, with other younger children to take care of and in a very poor economic situation, the options decrease. Priyanka Bose (Kamla) does an extraordinary job representing the true emotions of a mom that chooses to purily love her children. Her acting makes you feel like you're inside the film and it converts into a real scenario when watching!\n\n\n\nThis film also shows in a clear way the process of adoption and the true feelings of adoptive parents. Nicole Kidman and David Wenham (Sue & John Brierley) represent in a beautiful form how much love a couple can share with their non-biological kids. After talking with Saroo about the challenges that they have faced because of the adoption process, Kidman goes deep with the phrase: \"I could have had kids. We chose not to have kids. We chose you\". What a strong phrase to show and remind the public the reality of adoptive parents. When they adopted them, they chose to adopt their past stories too, making the experience of raising them more complicated. But their strength and desire to make their family happy helped them stay together, even when going through personal and home problems, specially accepting Saroo's dream to see his biological family again.\n\n\n\nDev Patel and Sunny Pawar (grown and young Saroo) also did an extraordinary job personalizing the main character. Across the entire film, the good characterization of the actors help the viewers create a relationship with them that crosses the screen. After months of being lost in Kolkata, Saroo does all that a 5-year-old could do to find home. He tries to buy a ticket back to his town and to communicate with others, but they don't speak his language. Even though he was young, he chooses not to give up and find his mom and siblings. Pawar's innocence and fear make us enter his world and see the reality from his eyes. It wouldn't be surprising if you end up talking to the screen as if Saroo could hear you. In the same way, Patel makes us sprout emotions of desperation and complete happiness while he deeply searches in his memories for the roots of his hometown and family. He could have decided not to find his family in India and live the life that he already was living in Australia (good economic situation, loving adoptive parents, girlfriend, attending college), but he chose to look for them because he loved them. Dev Patel makes a wonderful representation of what someone is willing to do when when they are completely engaged to love.\n\n\nLion is a movie for the entire family. It's a film for kids, teenagers and adults that reflects the importance of family, perseverance and hard-work. Lion goes beyond the expectations; it is not just a \"drama movie\". Together with the great representation of Indian culture, this film makes you think about your life and the decisions you have taken to show appreciation to your loved ones. It is a great story that provokes an emotional understanding within the viewers about our home: family is not made by fate, it is made by you.",
            "review_date": "2018-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Among the feel goodiest of feel-good movies",
            "review_date": "2018-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pertinent, captivating and with a touching story, Lion was undoubtly the best Oscar nominated movie, bringing to the big screen a delightful real story told with credibility thanks Dev Patel that was a great revelation as an actor considering his heartfelt performances.",
            "review_date": "2018-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a particularly powerful and immersive first-half and a beautiful, touching ending, 'Lion' is an amazing real-life story told wonderfully through the medium of film. It's a gorgeously shot and very well-acted (both Sunny Pawar and Dev Patel are wonderful in the role of Saroo) drama that most definitely achieves what it set out to do: tug at your heartstrings and leave you feeling a strong mixture of emotions.",
            "review_date": "2018-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first 45 minutes of \"Lion\" are some of the most powerful scenes a film has ever shown. Anyone who has experienced even a brief memory of being lost as a small child will sit on the edge of their seat as the story of Saroo is told. \"Lion\" is thought-provoking, to say the least, as it will stay with you for much longer than its 129 minute length. Unfortunately, the story weakens when Dev Patel, an adult Saroo, reaches a point in his life where he is on his own, building his future and stumbles upon a memory from his past. While the viewer isn't surprised at Saroo's desire to go back to India to find out what happened to his family, the story implication that this thought was seemingly nonexistent from the day he was adopted to this memory-stirring moment, is confusing and unbelievable. The film resolves itself in an equally powerful way as the first 45 minutes of the film, but while it's a great film, the second act takes it out of Best Picture contention for me. Still, for the statistical horror it portrays, \"Lion\" is a must see.",
            "review_date": "2018-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saroo's journey to finding his birth mother is surrounded by wonderful struggles and immense hope. Both wonderful performances and the sympathetic yet raw handling of the true events gives this movie a great heartwarming finish.",
            "review_date": "2018-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A promising true story is hamstrung by a lack of imaginative writing and direction.  The writer, Luke Davies, was worried about a story that relied on \"screens on screen\" in depicting Saroo's search for his home town.  Unfortunately, instead of thinking of a powerful way to follow Saroo's search for his home, the filmmakers spend way too much time on melodrama.  Should have been better!",
            "review_date": "2018-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is so well done! An amazing journey! Such a great film. And the Director and  the cast were superb! Bravo! Lion! Bravo! Great story.",
            "review_date": "2018-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Moving, powerful and nuanced....a great movie.",
            "review_date": "2018-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What makes Lion a must watch is the uplifting story and great performances especially from young Sunny Pawar. This journey isn't cliched and Garth Davies(in his directorial debut) makes sure he hits all the right notes and doesn't pander to sentimentality which can happen in movies of this kind.(Go watch Lion for its sheer uplifting story)",
            "review_date": "2018-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sensational movie... a touching tale beautifully told. Mind-blowing cinematography and brilliant performance by Dec Patel. The fact it received no awards from six nominations says all you need to know about the Oscars.",
            "review_date": "2018-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based on a true story, a moving uplifting story that is meant to bring tears of joy to your eyes.  Except mine.  Perhaps the film was over-hyped leading me to have high expectations. Or perhaps it suffered from a contrast effect since I'd watched an intellectually stimulating film the night before.  Or perhaps it just felt like it was trying too hard (with sweeping musical cues to tell me when to feel moved).  Whatever the reason, I wasn't grabbed the way others have been.  That isn't because scenes of poverty and kids in distress in India don't affect me - Pather Panchali (1955) is one of my favourites.  Here, Sunny Pawar is adorable as the boy (who grows up to be Dev Patel) who is accidentally lost thousands of kilometres from home and then adopted from an orphanage in Calcutta by a Tasmanian couple (played by Nicole Kidman and David Wenham).  But Patel himself seems somewhat constricted, probably because the script has him ruminating about finding his real mum (a rural labourer) for a good chunk of the running time, pushing aside girlfriend Rooney Mara in the process.  Finally though, Google Earth is there to save him (and indeed Google pitched in to sponsor the film) and we get the ending we'd been advertised.  I'm sure this was incredibly dramatic when it happened to the real Saroo Brierley, but I found the narrative to be rather simplistic (even with the brother Mantosh subplot that doesn't really go anywhere).  True, there are some beautiful Australian and Indian vistas to behold and if you aren't curmudgeonly like me, you might feel exalted by these vistas, the music, and the stirring emotional story.",
            "review_date": "2018-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very moving true story. And some of the cinematography is amazing. Very well acted - especially by the little boy at the beginning.",
            "review_date": "2018-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought it was going to be heartfelt travel across India but he instead just gets lucky on google maps. I was also not convinces by Nicole Kidman. I feel like I've been cheated.",
            "review_date": "2018-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie does an excellent job of showing how sounds, smells, muscle memory, and customs such as eating without utensils , remind adult Saroo of his birth home. How his new friends asking about his roots brought up his own questioning. Heartbreaking story to say the least. I cried when he finally found his mom. I began to be afraid the movie would end before that, but it was instead the perfect buildup and resolution that leaves the viewer heartbroken,  relieved, happy, sad, and satisfied. The actor for adult Saroo is a head and a half taller and a good deal lighter than all the other people in the community in which he was raised, but otherwise great actor character match up. Funny that he went into Hotel management. Why did the boy in the (Orphanage??) and his adopted brother Mantosh go into fits of hurting/hitting themselves? It never does go into their story, though it doesn't need to, it leaves me personally, curious. As well as the children in the train station that got rounded up. Or what exactly the woman who was \"helping\" Saroo and the man with her that said \"he was exactly what they were looking for\" really wanted for him, I love the title. I was waiting to see how it tied into this lost boy's story, and it was a smile at the end to understand. Overall this is a beautiful although tear jerking story of love and humanity, and the lack at times.  The flashbacks and Saroo seeing Guddu throughout his life still looking for him ever reminding him of where and what he lost were a great tie into his past and well timed. Beautiful movie. Enjoyed hearing the Hindu, and Bengali. Love the Sia song at the end. Parental guidance: Few brief post sex scene bed shots, but nothing is shown.",
            "review_date": "2018-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A little cliche and predictable, but -seeing as it's a true story- I guess you can't really knock it for that.",
            "review_date": "2018-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Follow Simba as he reunites with his long lost family! Wait, what? \nFor me, this was always an under the radar movie. The trailer, the posters and promotional materials that I barely consumed pointed me to believe this was just \"one more drama\". What brought this movie to my attention were its collection of four Golden Globes nominations. As an award season enthusiast, predictor and, may I say, connoisseur, i jumped at the first opportunity to go see this acclaimed movie. And actually, it kind of blew me away! The first half of it is queerly insightful as it depicts the world through the eyes of young Saroo. In this kind of movies with a very strong biopic component, I'm always afraid the filmmaker will just scrape the childhood part and jump right to the money-making star power but newcomer Garth Davis takes his sweet time in it, keeping for a whole hour his shots close to the child, gracefully detailing his wonder and his watchful, hypersensitive view of the world. And, the actor who plays young Saroo, Sunny Pawar, gives a standout performance (best one in the movie), carrying the whole half.  Rooney Mara is unsurprisingly flawless and the score is splendorous which should translate to an Oscar nom. Despite all this, when we pass the half-way mark, the movie becomes standard, as it resorts to Americanized filmmaking devices which is absent from the previous almost \"European indie\" kind of vibe. The performances are all very solid though I don't feel that neither Dev nor Nicole should have been nominated for a Golden Globe (and I adore Nicole!), and, though it's based on real life, the way the hero resolves his conflict feels too convenient and the reveal is conventional. Ultimately, we spend too little time with grown Saroo, so in the end we don't feel the emotional journey as much as we should. Also, a fade to black should be regarded as something special, only to be used when it's strictly necessary.This film uses and abuses them, and they become annoying. A fade to black, unless necesis lazy editing and directing so they are to be avoided. Still, the movie has something deep to say about unconventional families and coming back to our rooots!",
            "review_date": "2018-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing film that is beautifully wrote. Dev Patel is astounding. So heartbreaking yet inspiring",
            "review_date": "2018-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing story. Worth the time. Great for all ages. ",
            "review_date": "2018-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie for my 500th RT reviewed:  Moving and mysterious. Excellent attention to the details.",
            "review_date": "2018-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought all the characters were one dimensional compared to the main character. All their story lines served to enhance the main story line and thus the movie lacked depth as a result.",
            "review_date": "2018-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Moving film, tissues at the ready.",
            "review_date": "2018-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such an amazing story loved it",
            "review_date": "2018-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The ending of this movies hit me like a sledge hammer. I was just sitting there, thinking \"yeah, this is a nice little movie.\" The climax of the movie was coming, everyone could see it coming, but at the moment it just WALLOPED me. I hadn't experienced that much of an emotional impact since \"The Deer Hunter,\" but at the other end of the scale.",
            "review_date": "2018-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great miraculous story, world class acting and an unforgettable emotional experience that will DEFINITELY leave you with tears.",
            "review_date": "2018-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great story with a lot of heart. Solid acting and some beautiful filmmaking, well worth your time.",
            "review_date": "2018-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Life changing. Beautifully shot, minimalistic dialogue, great acting",
            "review_date": "2018-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the first time i saw this movie i was drowning in my own tears!",
            "review_date": "2018-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was good but not as adult entertainment. The scenery was good, the acting good. But, little adult dialog that makes movies interesting. The story was not great. A plain vanilla movie.",
            "review_date": "2018-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice emotional movie, based on true events. I thought it's an indian movie and I expected less, but it's actually good, and most of it is set in western society. I had a few tears at the end and it's a really nice emotional movie. Family is very important, whether it's adoptive family or real one. All 2 hours were very interesting and I didn't have any breaks",
            "review_date": "2018-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overall this is a solid film that tells a very compelling story about a man trying to find his roots. It succeeds in most of its storytelling though at times it can drag and be a tad bit boring.",
            "review_date": "2018-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very well acted movie from all involved, especially Nicole Kidman. We just do not get enough of her.\nThe real letdown is a script and director that do not get enough from the source material...\nThe sadness and joy is never delivered in a story that should be filled with those moments.\n\nThe real clips of the mothers meeting in the end credits is more tearjerking. It feels like this is a companion piece to an already made documentary, so if you don't know the story already there are a lot of blanks to fill in.\n\nShame as it is an engaging story that deserves to be told better.",
            "review_date": "2018-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film showcases the meaning of making movies, taking these amazing stories around the world to make you feel so much hope, emotion, compasion. Nicole Kidman was absolutely brilliant for me.",
            "review_date": "2018-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Which movie made you cried the hardest? LION",
            "review_date": "2018-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The good acting, especially from the child actors,  cannot rescue this movie from the clichés it's drowning in. Every conceivable heartstring is being pulled here. Slumdog Millionairre it's not.",
            "review_date": "2018-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An emotional, moving and exceptional film. Must see!",
            "review_date": "2018-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i'm lost..\n\nLion \n\nThe core of the movie lies within the emotions and feelings of the character rather than the development or the pace of the script which makes it more beautiful and breezy then it could have been. Nicole Kidman, Dev Patel and even Sunny Pawar put their heart into it which makes you feel for them and even cry at certain points. Even after projecting each and every stage of saroo's life one doesn't get tired of it since the character is so much lovable that you can't get enough of him.",
            "review_date": "2018-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was boring. Because what i see in the movie is what i see in my  everyday life.  PS I live in India.",
            "review_date": "2018-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Preferred the edgey first half, second half plods along and eventually delivers a predictable conclusion. Still pretty moving.",
            "review_date": "2018-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow - amazing retelling of a true story ",
            "review_date": "2018-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "88. Very moving, incredibly beautiful cinematography, and great musical score.",
            "review_date": "2018-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully made and an incredible true story. Left me in tears.",
            "review_date": "2017-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I bawled uncontrollably. This was such a touching movie and the acting was fantastic. I loved it",
            "review_date": "2017-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion is a sad but uplifting true story of five year old Saroo who gets locked inside a train while looking for his older brother and ends up nearly 1000 miles away from home.  From here we get an unflinching and frightening view of child poverty on the streets of Calcutta before Saroo is adopted by an Australian couple who provide a fairly privileged life for him for the next 20 years. At this point, Saroo takes on the tireless task of trying to find the family he abandoned. With little to go on, he becomes obsessed with an impossible situation.\nThe film was beautifully shot and very well acted, with Sunny Pawar playing the young Saroo who was particularly brilliant. Well worth seeing but be warned, it's a heart-breaker.",
            "review_date": "2017-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies ever. It is one of my top ten favorite movie I've ever seen. It is an extremely touching movie. At time its sad and at times its beautiful. All together it was a perfect movie with an amazing cast from Dev Patel in the starring role to Nicole Kidman in one of her best roles as the adopted mother of the main character.",
            "review_date": "2017-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An accomplished tearjerker. I found I could mostly forgive Lion its patent manipulation because a) it was very well done and good looking with it and B) it used this unusual true story to shed light on much more common occurrences such as poverty, exploitation and the ambiguities of adoption. Sunny Pawar as the young Saroo is a perfect little poppet and Dev Patel gives great angst as the grown-up version, though Rooney Mara is wasted in a \"supportive girlfriend\" role.",
            "review_date": "2017-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films I have ever seen",
            "review_date": "2017-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(5.5 out of 6)\nWhen we come from a place where there are plenty of people but little of everything else we see from such little places the beauty of things. When what little we have we try to get more in places where there is alot to get little in return. What little those try to live on what others see or don't see doesn't hurt when such places we share when it's our living. What little others have to live on they make due when others have Families to raise in little places to make such livings complete. When what isn't enough we find as little to help out, when being big in such worlds and little in others we wish to be in big ones. When what little we know about this world, something's are too much for us to take when we are little in a big place trying to find whatever little we know to get back home. What little we know we see we have big curiousity when such worlds are not big to discover and find little to live on. When what makes us little is how much we don't have in strength, use or worth when others big try to get rid of us or take us other places we wish not be. \n\nWhen we see we come from places where others have less when what little we know & have others have worse.  When what others see so little in such places we see that they would appreciate such little things they don't normally get in such places that have more. When what is little and doesn't take too much we see is alright to stay when it's little others can do. When what we see others wish to keep, we learn little gifts we can't be bought to stay when we want to go home. When what little we have to hold in our memories we carry with us. When other places we see others have plenty, others see how little we have when we see the world from inside outside to see little what we know what it is like. When what little people like us go we see others like us hold on to little too when there is little to be found out to see such places have little to hold little enough to survive on. When what little others know about our life, we know little too to know we end up in places where there is little much others can do that can take us home to find a new home. When what little we know what to do when little is follow to only follow those big and have those by our side as little as we are to know it's ok. When what little others know about us and little we know about others we go with our little feeling others are ok. When places we see has plenty to see when we see with little eyes a new world. When what little gifts others can't receive we see what little gift we are. When what little we know to communicate or express how we feel we see we are in good hands with those who share plenty there is to bond with. When we learn plenty from new places we know little means alot. When what others may not know plenty there is little they can do when it's the thought that counts. \n\nWhen we know what plenty others have done for us to know the little things matter we can't thank enough. When we are not little to see we are off doing big things. When what little we remember we see how little we don't know but wish to know where we come from. When we see there is plenty to do when we see what little we go on isn't enough. When what little we wish to see we don't others to know when we can't stand to see others go. When what we want others to go we see they can't when we see what plenty others have done and others do little to know what plenty we keep inside. When there is plenty we hate seeing & thinking to know we can't go on living with such plenty of guilt & little to show. When we wish to go places but we are stopped on our tracks when we rather be in other places with little memories of those we have & makeup along the way in places we are not but imagine being. When we see little we go on hurt when some journeys we go alone we are too little back then but big now. When what little we see we can do to help those in need we see we help alot another way when we give those another chance. \n\nWhen we see we are blessed to have plenty when we came from little. When what little we appreciate in little places we see our way back home to little beginnings. When what little we see the world back then sticks with us when such little places & faces we miss and find we cannot connect one world without another, when little missing connections & links in our life mean plenty to us. When we see every little thing that stands in what we saw little we thank for remaining that get us here. When what plenty we do to get back there is little we can do to bring those back when not everyone can return from far journeys. When what little we don't know others don't know when there is little in such parts. When what plenty we owe those for the little time and little things they show us in bring us along their journeys, we thank them when it was that little explorer that brought us back home. When what little we can do to help those we give for they gave us plenty we don't know how to repay.",
            "review_date": "2017-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most amazing films I have ever seen. ",
            "review_date": "2017-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very touching moive..",
            "review_date": "2017-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite being overly sentimental and wastefully romanticised at times, Lion is nonetheless absorbing to the core. Follow him home.",
            "review_date": "2017-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it it absolutely amazing shows you how good you got it.",
            "review_date": "2017-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie of the year! I watched it 3 times and cried each time.",
            "review_date": "2017-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The beginning is amazing",
            "review_date": "2017-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Lion\" is an incredibly moving, emotional story that lacks brevity and dynamism.",
            "review_date": "2017-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fantastic.  very similar to the orphan keeper novel.  I loved this story. total tear jerker.",
            "review_date": "2017-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film makers took their time to craft their story. Perhaps a little bit too much time. I'm not going to say I was bored to tears, but my attention did start to wander. The child actor, Sunny Pawar, was very good. He made me care and fret over \"Saroo\". I found myself missing him once Dev Patel took over. Suddenly Saroo turned into a butt munch. I guess I was supposed to be feeling his conflicted emotions over who he truly was. Instead all I saw was a man being a dick to the people around him.",
            "review_date": "2017-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a biographical film based on how a five-year-old kid lost from his family and finds them back after 25 years. He does it by remembering and retracing his steps using Google Earth!!!\nMost of the first half is slow, depressing and insightful of how poverty ridden India is. I only started enjoying the movie ones we move to Australia as the really interesting parts started happening. The climax is the highlight, it squeezes out the emotions of the audience, manipulating and successful execution of film direction. The casting is great with all the leads giving superb performances.",
            "review_date": "2017-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Im a sobbing mess. Beautiful story.",
            "review_date": "2017-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Lion\" is an incredibe story, one that I honestly could not believe was real while watching it, and the movie does this amazing story some serious justice. Dev Patel (Saroo) was definitely my favourite in this movie, this is one of the best acting performances I've seen in 2016 movies, and there are good ones to choose from. The heartbreak and struggle that you see in him while trying to find his family is really well-done, and really captures what it would've actually been like for the real Saroo. The scenery is also really good in this movie, it really gets you immersed into the world that Saroo lived in, and the harsh atmosphere of living on the streets in a busy and populated place like India. This movie has a bit of everything: heart, drama, desperation, romance, comedy, you name it, and I enjoyed every bit of it. I would've liked to have seen a bit more of young saroo, and his struggle to live on the streets, although that was shown quite a bit in the movie. In the end, \"Lion\" is an incredible story with great acting, and really tells the real life story in a way that shows how miraculous the whole situation really was. \"Lion\" is definitely worth watching.",
            "review_date": "2017-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful true story. I especially liked the part at the end when they show the real people and what they are doing today.",
            "review_date": "2017-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion, is based on the real story of Saroo who, as a little boy in rural India, got lost on a train and hurtled thousands of miles away to Calcutta. After being adopted by an Australian couple, years later as an adult, Saroo goes on a frantic search to find his home and be re-united with his family. First of all, Sunny Pawar, who plays young Saroo, is absolutely excellent in this film and carries a good 2/3 almost on his own, homeless on the streets, desperately trying to get by and get back to his family. Then Dev Patell puts in a great performance as the adult Saroo who becomes fixated on finding his family, searching the railway lines without even knowing the name of his village. It is an extremely emotional story, seeing how callous most of the adults are towards the homeless children, the pain of separation for Saroo and the love and acceptance of his adoptive parents. The film does start to lose steam in the last third of the film however with Saroo as an adult, with an somewhat uninteresting love story and the addition of his seemingly unstable adoptive brother. Overall though it is a very touching film, that focusses on the emotional trauma of a lost child and even goes so far as highlighting that over 80,000 children go missing in India every year and collaborating with organisations to support these children.",
            "review_date": "2017-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not a fan of the way Hollywood decides what culture is the flavour of the decade, but once again Dev Patel delivers a star turn performance, albeit of a much different type. Detailed, gritty and well acted throughout. My only quibble is the truncated brother storyline and the tacked on ending.",
            "review_date": "2017-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another year, another American film about India (seems to be the current vogue). Mostly fine for what it is, but not as engaging as other similar films have been, and a bit overly drawn out at times.",
            "review_date": "2017-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nice biography that has universal tone and relatable emotions of life. Dev Patel's character is somewhat likable but it's antagonizing the brother a bit too much.",
            "review_date": "2017-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Moving and visually beautiful!",
            "review_date": "2017-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant film. Hooked throughout, very emotional. Great acting and directing.",
            "review_date": "2017-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie for the family!",
            "review_date": "2017-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing. One of the best movies I have ever seen. Heart wrenching. The young version in the story did an phenomenal job. Great acting. Being an immigrant it really struck a chord of the meaning of home and the search for belonging. A true masterpiece.",
            "review_date": "2017-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gah, considering there's really not much of a plot, it made me cry twice. The acting is superb, even from the young actors, and they use flashbacks to build an incredible emotional journey, that really gets me with its family values, and how modern or unconventional families can still have so much love.\nNot something I thought I would enjoy, and not something I would watch again, but a truly memorable based-on-a-true-story tale that you won't forget. \nWatched on the plane flying back from Moncton after my cousin Beth's wedding  (on the flight from Montreal to Calgary) with Sam, September 13, 2017.",
            "review_date": "2017-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a performance by Dev Patel! Such a beautiful ending that had me in tears! ð??­",
            "review_date": "2017-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An encouraging look at adoption, as a man successfully reunites with his birth mother.  It touches on the hard parts of orphanage life, without overwhelming the viewer.  All this is set against the beautiful backdrop of India.",
            "review_date": "2017-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heart wrenching!!!   The Amazing actors and actresses made you feel as though their real lives were playing out before you!",
            "review_date": "2017-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies that I have seen in a long time!! Loved it",
            "review_date": "2017-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wife and I enjoyed it good movie to watch once go through the emotions great acting all around.",
            "review_date": "2017-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing story of love of a five year old.",
            "review_date": "2017-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3.5/5.  The first act of Lion is riveting, with a surprisingly great performance from Sunny Pawar, and a terrifying atmosphere.  The 3rd act has an extremely emotion conclusion.  Unfortunately, the second act drags quite a bit and the story stagnates for too long.  That said Lion is a good film and worth the watch.",
            "review_date": "2017-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic, such an amazing story. Heartbreaking and heart-warming. A must see.",
            "review_date": "2017-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "have the tissue ready.",
            "review_date": "2017-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, great story. A must see.",
            "review_date": "2017-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a beautifully told true story about family, identity, home and searching for a lost past. Some beautiful cinematography and gritty representation of poor India and growing up and surviving in the streets in contrast to the seemingly luxurious life of modern Australia.",
            "review_date": "2017-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartwarming stuff. This movie succeeds well beyond initial expectations at making you take another look at family and its significance to the individual.",
            "review_date": "2017-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful & moving. Heartwarming!",
            "review_date": "2017-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit overly dramatic, but all in all a good story.",
            "review_date": "2017-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great cast and storyline.",
            "review_date": "2017-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I remember hearing about this movie during Oscar season and seeing cute little Sunny on all the red carpets. Couple months later I happen to stumble upon it on Netflix, boy was I not prepared for such an amazing movie. A movie never made me cry that hard before, such a beautiful story, beautifully told, beautifully shot, the cast was amazing, especially the boy that played young Saroo, along with Dev and Nicole. I'm no professional film critic but this was a really great movie. The fact that is was a true story is amazing.",
            "review_date": "2017-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's so hard to find a good movie these days. This was an exception. Extremely well done. Very touching story.",
            "review_date": "2017-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first half of the film was terribly dull. It got a little more interesting later, but was still too pretentious. It's missing that magical touch. (First and only viewing - 8/15/2017)",
            "review_date": "2017-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First half is great. Get rid of the second.",
            "review_date": "2017-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've never cried so hard in a movie ever.",
            "review_date": "2017-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touching heart movie ??????",
            "review_date": "2017-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow...this movie had me all IN my feelings. I absolutely loved it.",
            "review_date": "2017-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I did not sign up for this feels fest... Solid acting, although the emotional drama gets a bit muddled towards the middle (too much, too fast). However, all is forgiven considering this poignant miracle is actually based off a true story.",
            "review_date": "2017-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Basically a boring clone of slumdog millionaire",
            "review_date": "2017-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie. It's an amazing story with great actors and actresses. Made me really feel for the characters. One of the few films that brought tears to my eyes.",
            "review_date": "2017-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "solid acting and cinematography and i get the true story theme but holy moly... pretty boring",
            "review_date": "2017-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rightly deserving of its Oscar & other nominations - and right not to win. AARP correctly nominates it for Best for Grownups, Best Intergenerational, & Best Supporting (Kidman). It's a good movie for those whose film interests reach beyond Marvel & Lionsgate.\n\nA critics critique: A fine production in English but beginning as subtitled. No problem. In the 2nd Act the narrative begins to sag. 7 or 8 minutes of cutting would've fixed that & still yielded sufficient run time. But the 3rd Act and ending documentary scenes recover the story. A bit jarring though is how the young Saroo morphs into a visage that seems not to be India'n, nearly caucasian, or maybe half India'n at most. This is most obvious in the final scenes. Patel is an India'n surname and he's a fine actor in this production. Still ... This casting perhaps unintentionally imparts a slight racist undertone.\n\nDefinitely a thumbs-up. And a story about lost & misplaced kids that needs wide distribution. Thank-you Weinsteins for bankrolling blue-road (Kuralt) productions and giving us more \"Chocolats.\"",
            "review_date": "2017-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a very interesting story although by the film's end, you realize that there was too much to effectively tell in 2 hours. This should have been given to a cable network to create a 4-6 hour film that could have delved into the characters as well as the story. It feels as if this must be a better story than could be fully told within the time constraints. It's best to pick up the book since this synopsis us all we got.",
            "review_date": "2017-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sometimes you CAN go home again.",
            "review_date": "2017-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As long as it is accessible, the technology today makes it nearly impossible to be lost. A swell modern drama about a man who found his long lost family and hometown thanks to Google and it's innovative genius'.",
            "review_date": "2017-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing but also hard to watch!",
            "review_date": "2017-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Remarkable cinematography blended with a great narrative. Truly an amazing experience. Glad I watched it!",
            "review_date": "2017-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dev Patel turns in a fine performance as a \"lost\" man-an adoptee who years to know his home and family. Sunny Pawar is magic on the screen,  while Nicole Kidman is distracting as the adoptive mother to Patel's Saroo. The story is based on actual events which makes it even more engaging as we see Google Earth play a role in reuniting Saroo with his village and family.",
            "review_date": "2017-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a great movie. The storyline was great and the acting was great.",
            "review_date": "2017-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would say good not great, lost some steam towards the end. Felt like it was missing something but It wraps up well and pretty amazing story.",
            "review_date": "2017-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super good! Made me want to know more about his story!",
            "review_date": "2017-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must admit I got a lump in my throat at the conclusion. Well constructed and acted drama. The first half was difficult to watch at times but well worth it in the end.",
            "review_date": "2017-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion inspires and captures the viewer with its heart wrenching tale of foster identity, courage, and resilience. Though it has its flaws with some strange acting (would you believe me if I told you young saroo was far more engaging and relatable than his adult counterpart?), the movie triumphs through the irresistible story - made all the more inspirational when you learn it's oh so real.",
            "review_date": "2017-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Great movie. So touching.",
            "review_date": "2017-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this film. Had stupid grin on my face.",
            "review_date": "2017-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent story. Impressive acting and scenery.",
            "review_date": "2017-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is pure Oscar content that tugs at your heartstrings, for better or for worse.",
            "review_date": "2017-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touching story, well acted, cried my eyes out. Biographical but surprisingly poetic.",
            "review_date": "2017-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An emotionally gripping movie about family, roots, compassion and love. Without drifting into cliches. A must-see and probably one of my movies of 2017 so far!!",
            "review_date": "2017-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant story, direction and emotion. Never a dull moment.",
            "review_date": "2017-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, there are all sorts of movies made about all sorts of meaningless things that are seen by so many... then there are true stories such as this that truly need to be seen by more people. Just a beautiful story.",
            "review_date": "2017-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie and great acting!!!",
            "review_date": "2017-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very well-done, absorbing film. However, it could have used more dialog and plot exposition. For example, so much of the film centered on the protagonist's fixation on Home that it was unclear if he had a job. There were also inter-character conflicts whose origins were only hinted at, making it a bit dis-orienting for the viewer.",
            "review_date": "2017-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartfelt story that touches the soul.",
            "review_date": "2017-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "***A MAN'S QUEST TO FIND HIS ROOTS WITHOUT ANCESTRY.COM OR 23ANDME***",
            "review_date": "2017-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible true story, beautifully scripted, and achingly touching.  The cinematography is so potent, it feels like place/setting could also be counted as a full character.  Well cast and acted.  Recommended.",
            "review_date": "2017-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films I've watched in quite a long time.",
            "review_date": "2017-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is someone cutting onions around here?",
            "review_date": "2017-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing performances by Sunny Pawar and Dev Patel!!!! As well as Nicole Kidman, Saroo's mother and brother. We were so touched...Oh, my! Truly speechless and many tears...",
            "review_date": "2017-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A story told beautifully. Much element of courage, love, and family.",
            "review_date": "2017-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story - average film making...",
            "review_date": "2017-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are definitely sections that you will like more than others.  The backing of a true story, that is payed off with real clips of the people that inspired the film always adds at least a .5 star for me.",
            "review_date": "2017-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the kind of movie that Oscar loves - an epic with a powerful emotional story at its core.  It's the story of a man who is torn between his present and his past and his struggle to find the path between.  Dev Patel shines in this role, you can see how he becomes more and more haunted by his memories as the movie progresses and his obsession with finding his biological family deepens.  It is profoundly emotionally affecting, but has none of the contrived sugary sweetness that often goes hand-in-hand with that.  The emotion of the film is natural and builds as it progresses, and before I knew it, I was surprised to find myself completely and totally invested in this family.  \"Lion\" is the biggest surprise for me this year, as I did not expect to love it as much as I did.  Though it is certainly deserving of a nomination, this film falls into the \"it was an honor to have been nominated\" category.",
            "review_date": "2017-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Similarly structured with a realistic constant pace and required level of performances to show and express true emotions for accuracy, \"Lion\" is a family picture with a crafty determination and a hidden meaning, overall resulting this different kind of story being meaningfully narrated. (B+)\n\n(Full review TBD)",
            "review_date": "2017-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well acted and full of heart. A bit cliched in its core, but the beauty is that the story is true. Well done!",
            "review_date": "2017-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touchingly sentimental.",
            "review_date": "2017-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is PHENOMENAL.  I loved every single minute of it.  A definite MUST-SEE!",
            "review_date": "2017-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This story has fascinated me ever since I read the Google blog post that announced that a man born in India, and adopted by a couple in Australia had finally found his biological mother by retracing his steps using Google Earth. Delighted to watch this sensitive, emotional, and beautiful feature film adaptation of this true story. Pure movie magic!",
            "review_date": "2017-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's unusual for a film to be heart-breaking and heart-warming at the same time, but Lion does just that. This is a gripping drama with powerful performances from the entire cast. My one complaint is the pacing. If the filmmakers would have trimmed 10 - 20 minutes out, specifically during the second act, the movie would have been stronger for it. However, this story is one that needed to be told, and I'm glad that I got to see it played out on the screen.",
            "review_date": "2017-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a beautiful tale of courage and determination",
            "review_date": "2017-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Felt like it could be condensed to 45 mins",
            "review_date": "2017-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this movie after I visited India and it brought tears to my eyes. I love all Dev Patel movies and a huge fan of his. This movie acknowledges why. I personally think this movie should have won many more awards than it did. It was beautiful and sweet.",
            "review_date": "2017-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, really uplifting and moving. Very well presented in different form, with a slight slow pace for the second half of the movie, yet very well done. I wanted to rewatch it as soon as I finished it.",
            "review_date": "2017-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wasn't certain what was expected but I am glad I watched it. The little Saroo's acting was remarkable as well as Patel's. Cried a little and satisfied with the happy ending.",
            "review_date": "2017-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sunny Pawar is absolutely amazing. As a kid I will cry my ass off but Sunny did not and Dev Patel who plays the older version is just beautiful. With the chemistry of Nichole Kidman, Dev Patel, and Rooney Mara, this is absolutely a must see film.",
            "review_date": "2017-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a beautiful movie! You DO NOT WANT TO MISS IT!",
            "review_date": "2017-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Garth Davis does an extraordinary job at telling this sad true story",
            "review_date": "2017-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion tries to make you cry with this pretty story, but it fails at making a movie that audiences believe that it was based on a true story",
            "review_date": "2017-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good, highly recommend!",
            "review_date": "2017-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lost in India, found in Australia!\n\nBased on the book 'A Long Way Home' that tells the story of a young Indian boy who lost his brother in a railway station in the night and the next morning he woke up thousands kilometers away from home. Not knowing the language or the address and the names of his family, he struggled from various threats in the society. After that he got adopted from an Australian family and the rest of the film revolved on his true identity. Haunted by his past, how he rediscovered his originality was emotionally told.\n\nVery impressive film. The families should not miss it. Even though it is a must see by all ages. I am not a big fan of Dev's performances, even in his debut film 'Slumdog Millionaire'. After that success, he had survived in the film industry doing decent roles, for like a decade. But it was 'The Man Who Knew Infinity' that changed his career. For the first time I liked him very much in that, and again he was pretty impressive in this. The second best performance in his career. Though his part comes only after the half way mark. Yet in that one hour, he did great, particularly in the sentiments.\n\nI was wondering why it was called 'Lion'. And I got answered only just before the end credit. So you should be patient to learn why, if you are yet to see it. It was not until the 90s the India began to see a real change. This story takes place in the mid 80s, only the opening half and those parts were raw and cruel, especially in the eyes of an 8 year old boy. That kid was so good. Just like Jacom Tremblay, a year before who impressed us with his performance from the film 'Room'.\n\nIt was a feature film debut for the director and he was wonderful in this attempt. The film splits into two, the first half was about lost and the following half is about finding the road back to the home. Less dialogues, but well written in those necessary parts. The music was good. Only negative was the film was out of depth. Yeah, all the events were like fast forward. If they had focused on details, the narration would have reached at least 3 hours. Especially I wanted the Australian mother's perspective on how she went through to raise those kids.\n\nNow I'm waiting for the 2020. I mean 2008 was SDM, 2012 was LoP and 2016 was this one. The 4 years later, surely there will be another India related western film would come. Despite this film nominated for the 6 Oscars, it had won nothing. That's very sad. Overall, I strongly suggest it. One of the best films of the Year.\n\n9/10",
            "review_date": "2017-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a truly amazing story. The little boy in it was fantastic and Dev Patel was great. One of my most favourite movies of 2016.\n\n8.9/10",
            "review_date": "2017-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely one of the better true story movies out there.",
            "review_date": "2017-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I never cried so much during a movie in my life.",
            "review_date": "2017-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fine story, well produced. Unfortunately, the last half of the film is a half hour too long, padded with repetitious funk while I restlessly waited for the inevitable return to India.",
            "review_date": "2017-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "exceptional! impossible not to love it. tissues required!",
            "review_date": "2017-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sunny Pawar's young Saroo hooks us immediately and reels us in. His magnificent five-year-old smile demands that we see this story through to the end - in spite of muddled dialogue and a poorly defined supporting cast. A weepy Dev Patel convinces us of nothing, Rooney Mara can't seem to locate her character and Nicole Kidman is barely audible. Only Saroo's childhood flashbacks rescue the second half of this film.\n\nThis inspiring story may have fared better in more experienced hands; where is Danny Boyle when we need him? From the aptly named \"See-Saw Films\".",
            "review_date": "2017-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was moving and Dev Patel is beautiful.",
            "review_date": "2017-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion after thoughts: AMAZING - CAPTIVATING - DRAMATIC - WONDERFUL!!! Very powerful story portrayed by a well supported cast!!! Sunny P (young Saroo) was inspiring. Nicole K & David W (Sue & John Brierley) were important. Dev Patel (adult Saroo) captured my attention & took me deeper into this world. Director Garth Davis captured important imagery/scenes from beginning to end. Having left my home country at 7, I have memories of my childhood & scenes played through Saroo's eyes at the young age of 5 were not only heartfelt but scary. This was rollercoaster ride of emotions that MUST BE EXPERIENCED! Loved the ending! I want to find the book this film is based on! ???????????????????? (5 of 5)",
            "review_date": "2017-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film starts out so heartbreaking that I almost didn't want to finish it, but it turns into something beautiful. Dev Patel gives an amazing performance as a man who is searching for his family after being gone for so long an not knowing anything about where he comes from. Sunny Pawar gives a great performance as the younger version of Dev Patels character, he gave the character of Saroo so much life. This story is rather predictable, I knew what the outcome at the end of the film was going to be, so I wasn't surprised along he way or at the end. This is however a beautiful film that anyone can enjoy!",
            "review_date": "2017-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie and great acting. Very touching and made me cry. Its a must see movie. Inspires me to consider adopting children .",
            "review_date": "2017-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first half of the movie was heartbreaking, but the second half didn't grab me.",
            "review_date": "2017-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sunny Pawar gives one of the best child actor performances in decades as he effortlessly pulls you into the world of a 5 year old boy (saroo) who against all odds found his Lost home after more than 25 years. A story about love, life and the strength of the human Spirit. A story that proves there's still hope in humanity. For me, the best movie of 2016 and one of the most understated movies of it's genre. Faithfully told and true to it's source...5/5",
            "review_date": "2017-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie about a boy who gets lost in India and ends up on a train that takes him far from where he lives. Based on a true story.",
            "review_date": "2017-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That was some serious allergies for me. Great film.",
            "review_date": "2017-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How this didn't recieve more recognition and the Oscar for best picture, I don't understand. Very moving",
            "review_date": "2017-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No doubt, an amazing story. But the pacing of the second half slows it down. The film tries way too hard to tug at your heartstrings, but fails most of the time.",
            "review_date": "2017-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kudos to the casting and directing as each character expresses a full range of emotions that the audience cannot help but become enthralled within. This is Patel's finest role thus far, and Kidman shows she still has it too in this film which manages to be adeptly heartbreaking AND heartwarming .",
            "review_date": "2017-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A magnificent interpretation of a true story that defies the human spirit. The young actor in the first half of the film really steals the show, but Dev Patel does a fine job or carrying the second half. A real tearjerker, definitely worth a watch.",
            "review_date": "2017-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most moving films of the year.",
            "review_date": "2017-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed this movie-\nNice seeing Nicole K play the mum too. \nWell cast. Great movie.",
            "review_date": "2017-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No doubt, an amazing story. But the pacing of the second half slows it down. The film tries way too hard to tug at your heartstrings,  but fails most of the time.",
            "review_date": "2017-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While somewhat uneven in terms of pace, \"Lion\" effectively realizes its heart breaking real life story, thanks in large part to the inspired performances of its cast.",
            "review_date": "2017-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Captivating, even if it feels like the story is stretched to fit a film at a couple points.",
            "review_date": "2017-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful story !!!!!",
            "review_date": "2017-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Career defining performance from Dev Patel. Emotional from the outset and skilfully told. Highly recommended.",
            "review_date": "2017-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film, not quite a classic, but not far off! Brilliant story, great acting and superb ending.",
            "review_date": "2017-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two hour advertisement for some missing children organization.",
            "review_date": "2017-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I guess Im the rare person that did not care for this movie.If I could give it less than one star I would. Found it boring and the story did not move quick enough.",
            "review_date": "2017-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Revealing, authentic, and amazing!",
            "review_date": "2017-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that could have been so close to perfect if they had just fixed some pacing issues, and stopped confusing us with the timeline. \nRegardless, it's a very telling story of something that happens all too often. Especially is less sophisticated(advanced? Modern?) societies. The beginning scenes of India are suffocating for a  person like me. So many people jammed into what looks like a not very sanitary environment. The train station is nuts, and the way these poor Indian people live is just sad. \nDav Patel is very good as the grown up child who was lost. Everyone else is just kind of there doing their parts, but we never really connect with them much. \nI do wonder why it took him 24 years to suddenly decide to try and find his family. Did he try before this? They don't indicate that he did. \nThen I wonder why it took another 2+ years of research when the obvious answer was what did it it in the end. Why didn't he start there? I don't know. \nIt can be an emotional story, but not the way the director and writers obviously wanted us to feel.\nI just never connected with the characters to feel enough. \nWhats crazy is that this IS a true story.  Apparently thousands of kids are lost in India every year. What a sad situation.",
            "review_date": "2017-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic movie. Wasn't so sure about it when the first half was entirely in Hindu and there were no subtitles but you can make out just fine. An incredible true story (apparently) that really gives the world an insight on the disaster going on India. So many lost and abandoned kids it's sickening. The actors in this were fantastic from the little boy to the older version of him and all others involved. I love movies where you can feel the intensity of a scene. The reunion with his mom was one of the most breathtaking scenes I've ever seen. Well done.",
            "review_date": "2017-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was an emotional roller coaster, beautifully filmed with great acting. Highly recommend! ??",
            "review_date": "2017-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie. It's painful to experience but very redemptive and incredibly well performed and well scored.",
            "review_date": "2017-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stunning, humbling, heart breaking, eye opening and inspiring. Slumdog Millionaire's Patel is perfection as he meanders through his village streets with eyes glassy with anticipation during the film's climax. His younger age character actor is also superb - you feel yourself right there with him on his astonishing true life journey. Don't miss this :)",
            "review_date": "2017-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The familiarity of its plot doesn't stop this \"based on true events\" drama from moving on, with heavily emotional moments, strong visuals, and terrific performances, making it a hard-yet-passionate touching story.",
            "review_date": "2017-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is a powerhouse on all levels. I'm still reeling from its palpable, breathtaking delivery! You will be left completely in awe. If only more inspiring films like this were made, we'd all be better for it. The cinematography is sensational and the performances by each actor, brilliant. A true story unlike any other. I feel truly honoured to have been privy to such an incredible life's journey and so will you.",
            "review_date": "2017-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion reminded me a little of Slumdog Millionaire. It made very good use of locations and the acting was terrific (even the little boy Saroo). The emotional pull of the film was it's 'lost boy looking for home' scenario and potentially, that could have been predictable but this was skillfully avoided and what emerged was a warm, heartfelt story.",
            "review_date": "2017-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie from beginning to end.",
            "review_date": "2017-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good heartfelt film, but in my opinion definitely one of the most over rated this year. Dav Patels performance is not the best in the fikm, and Nicole Kidman didn't do anything that any other person with an a list name could have done.",
            "review_date": "2017-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a solid 9/10. Great movie",
            "review_date": "2017-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful story that somehow gets muddled up and drawn out.",
            "review_date": "2017-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really like this movie. I like the depth of it and it really shows you what we take for granted every day. It's a movie that you think about long after it's over. You can't help but want to continue watching it once it starts because you become emotionally connected to the main character throughout. Rent it, borrow it, buy it, whatever but watch it.",
            "review_date": "2017-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outstanding film based on a true story.  Highly recommend.",
            "review_date": "2017-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a pretty good movie, but I had anticipated more considering all the oscar buzz.  Good story though, especially considering how true it was.  It felt like a really long commercial for Google Earth though.  The kid in the movie was really cute.  There were alot of good shots with him in it.",
            "review_date": "2017-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The beginning of the story was more intriguing than the last half, which was predictable. I don't know why, but I found Sonny Pawar the most intriguing actor in the whole cast. I want to see more of him. His beautiful eyes convey so much.",
            "review_date": "2017-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good....yeh..... but I found it a bit...meh..... story dragged for me, an incredible true story I hope the film does justice to the real characters.",
            "review_date": "2017-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most amazing heart-wrenching film I've seen in years. What a beautiful happy and sad story. Deeply moving, superb suspenseful soundtrack and Dev Patel is superb. 9/10!",
            "review_date": "2017-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful story, very well told.",
            "review_date": "2017-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the first half melted my heart",
            "review_date": "2017-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good first half half asked second",
            "review_date": "2017-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Has its flaws, but is still a good story",
            "review_date": "2017-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An Epic Journey with the perfect soundtracks",
            "review_date": "2017-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie night with Iris. \n\nThe first 30 minutes of childhood India are gripping and emotional beyond belief. The adult Australia connects well and doesn't let up. If you can ignore the annoying piano score, this is impassioned, moving stuff. There were tears in Ware.",
            "review_date": "2017-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice camera work, some beautiful environments, and really good at making you feel like a kid lost in India. Sunny did a great job as a child actor. The first half is where this film excels, as the pacing falls off in the second. Dev Patel had good charisma, but the writing in his scenes wasn't the best and the conflict with his love interest seemed quite forced. The original score was quite beautiful, but should have been used a bit more sparingly. This was close to being an amazing movie - but is still worth watching.",
            "review_date": "2017-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great story made me cry.  was excellent",
            "review_date": "2017-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riviting and soulful tale about memories that haunt and consume, and love that spans distance, cultures, and races. Wonderful acting by a gifted cast leaves you feeling their heart beating in your chest their breath in your lungs...",
            "review_date": "2017-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riveting from the first frame to the last.  This is an amazing story, translated extremely well to film, with terrific acting, direction and photography throughout.  We've seen this type of story before, and it would have been easy to take the standard road in telling it, but this movie somehow makes the story feel fresh and urgent.  I wasn't bored for even a single second, and the ending earns its tears - I bet there wasn't a dry eye in the house on opening night.  Absolutely one of the best films of 2016.",
            "review_date": "2017-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I felt all the feels with this one. I love true stories. Recommend to anyone",
            "review_date": "2017-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The front end is great. The back end is not.",
            "review_date": "2017-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gripping, heartfelt and deeply moving, \"Lion\" is a true story that deserves to be seen. An inspiring story of one man's search for home, it is one of the most moving films of the year. Beautifully shot, powerfully acted and engrossing from start to finish, it manages to do justice to a true story. Although it isn't easy to bring to life a true story of an inspiring individual, the film succeeds. It is due in large part to the powerful performances. Sunny Parwar and Dev Patel, the actors who play the young and older version of Saroo are terrific. Parwar is marvelous, and carries the first half of the film through his emotional expressions. Patel, on the other hand, commands the second half of the film as the older Saroo. Despite an engrossing first-half, \"Lion\" is slightly overlong and drags towards the end. Nevertheless, it is an inspirational film that left me in a puddle of tears by the end. Few films, if any, have the ability to do that.",
            "review_date": "2017-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a lovely story of being lost and finding home. perfect for mothers day.",
            "review_date": "2017-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion was somewhat slow to start, and for a while I had felt that the story's advertised plot was deceiving, though once you make it halfway through the film, the incredible journey and true story of Saroo Brierly unfolds. Great cast and superb acting! Incredible story.",
            "review_date": "2017-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best movies ive seen in years. the story is staggering. as are the realities for children and women in India.",
            "review_date": "2017-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie truth is better than fiction",
            "review_date": "2017-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid movie...couldn't look away. Only issue with it is that it taints Saroo's real life journey by mucking it up with all the extra show biz stuff. Still, great movie. Sunny Pawar is the cutest child ever.",
            "review_date": "2017-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oscar worthy in every way. It is both emotionally and spiritually rewarding.",
            "review_date": "2017-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "http://moviews96.blogspot.in/2017/04/lion-fitting-title-for-brave-child.html?m=1\nCheck out my review for lion",
            "review_date": "2017-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "lovely movie. I couldnt stop crying!!!",
            "review_date": "2017-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can a performance be more breath taking and heart breaking? All the actors and actresses come to play in this tragic tale of a boy who is separated from home. The train scene just makes, even the strongest, hearts break for this young child. The fear the child has in his eyes just killed me. Usually these kind of movies tend to lean on the same tropes, but knowing this was real and actually happened is just so sad. I can't recommend it any higher to anyone interested in watching a film about family and it's strong bonds.",
            "review_date": "2017-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite being a bit disorganized as a film it is a brilliant story and an emotional ride.",
            "review_date": "2017-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrific movie. Great, compelling story.",
            "review_date": "2017-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion at it's core is a tragically heroic story of family, love and survival. In this way it is dynamically faithful to the story which it is based on providing a tearful and compelling look at what it means to have a family and how our cultural identity can define us. Dev Patel is brilliant in the lead role. A difficult performance that never extends too far into melodrama yet feels tortured and beautiful. Kidman shows a depth to her acting that has rarely been glimpsed before providing an powerfully moving support role which adds layers of complexity and intrigue to a myopic plot. All in all Lion, may bank too much on a deep and heavy plot and sometimes this gravity feels emotionally overwhelming but audiences will leave the viewing having realised and challenges themselves on what it means to be loved and what it means to have family. What storytelling can be so bold as to take this lightly?",
            "review_date": "2017-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Feel good movie! Always like a true story and a happy ending!",
            "review_date": "2017-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion is based on a true story that is both incredibly uplifting and heartbreaking.  Don't watch any trailers - go in blind.  This film is a must-see.",
            "review_date": "2017-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A remarkable true story that has been turned into a beautiful film. Emotional and sensitive, echoed by Dev Patel's wonderful acting.",
            "review_date": "2017-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That it is based on a true story made this all the more absorbing and emotive. Well acted.",
            "review_date": "2017-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Northern India, 1986.  Guddu and his younger brother Saroo help out their impoverished family by scavenging anything they can.  One night Guddu and Saroo are separated at a train station.  Saroo tries to find Guddu but ends up on a train that takes him to Calcutta, 1,600 kms away.  In Calcutta he is taken in by a organisation that finds adoptive parents for orphans and lost kids.  Saroo is adopted by an Australian couple, the Brierleys, and moves to Hobart, Tasmania.  20 years later he decides to find his mother and brother. \n\nQuite flat for something that should have been enthralling and emotional.  \n\nStarts very well - the story of how Saroo was separated from his brother and ends up in Australia is well told and is very engaging.\n\nThe movie, however, loses its way in the second act - where the 20-something Saroo first goes to Melbourne and then starts to look for his mother.  The plot development here is incredibly padded, filled with empty, superficial melodrama and sub-plots that go nowhere, making for dull viewing.  The search itself was interesting, but does not get much screen time and is diluted by the padding around it.  \n\nThere's also the fact that you know from the trailers and synopsis where this is all going.  Trying to create an air of mystery around the course the plot is going to take is pointless when viewers already know the outcome.\n\nIt all comes together, eventually.  Ending is quite emotional.\n\nUltimately, okay, but could have been really good with a tighter, shorter middle-to-late section.",
            "review_date": "2017-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can you imagine a world where children on their own, on the street. An astounding story. Very worth the watch.",
            "review_date": "2017-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderfully acted with beautiful cinematography.",
            "review_date": "2017-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wow maybe the best movie of last yr full of heart and heart breaking",
            "review_date": "2017-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "beautifully shot, with a heartfelt story and well acted. a wonderful, sad and joyful movie",
            "review_date": "2017-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unbelievable true story. 5 year old Saroo was lost in India... and he's adopted by an Australian couple. Then 25 years later, he tried to find his home and family by Google Earth! Oscar nominee Dev Patel was really fantastic. Rooney Mara and Nichole Kidman were wonderful too. Garth Davis directed this movie really wonderful and amazing. Climax was really moving and miraculous. What a extraordinary journey Saroo experienced! I liked end title song Never Give Up by Sia! I have so many dreams and I never give up! until it comes true! This movie gave me a hope! Thank you!",
            "review_date": "2017-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrifying at first, then gets better, then gets slow, then ends nicely.",
            "review_date": "2017-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really good story, heart touching.",
            "review_date": "2017-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply outstanding....................",
            "review_date": "2017-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The end is disappointing, too much drama.",
            "review_date": "2017-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion (Garth Davis, 2016) - 7,0/10",
            "review_date": "2017-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really enjoyed the story and the way it was told. 4/5",
            "review_date": "2017-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It took a while to get into the story at first (a little better pacing, maybe with the story interspersed with the modern-day plot, might have worked better for me, but at least I could still follow it decent enough), but once the real plot arc was put into play, it became a very entertaining film. I haven't been that much a fan of Dev Patel's work in the past, but the actor has come into his own with a stunning portrayal of Saroo, a man who is trying to reconcile his new life with the past that was taken from him; he impressively brings the audience along on his journey with intimate, gut-wrenching acting. Second only to \"Hunt for the Wilderbeasts,\" it is one of the most underrated movies of last year, and definitely one of its best movies.",
            "review_date": "2017-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sadness and happiness in equal measures, mesmerising story well executed by the filmmakers",
            "review_date": "2017-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring movie, same sob story in all most recent Indian movies",
            "review_date": "2017-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful story about getting to the very roots of your identity. Yet, the movie lacks something to reach out further than it does. Overall good, but nothing deep and special.",
            "review_date": "2017-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Certainly Hollywood in a lot of ways but still hard not to get wrapped up in the journey.",
            "review_date": "2017-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely well made movie. capturing emotions if all sides very well and . Directed and edited well. With good performances.",
            "review_date": "2017-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptional, moving movie!! About love and family, blood or no blood.",
            "review_date": "2017-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best film I've seen in a long time. Perfectly acted.",
            "review_date": "2017-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an incredible true story. A true triumph!",
            "review_date": "2017-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing cried my eyes out",
            "review_date": "2017-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This beautiful film tells the story of a young boy who gets lost in India far away from his home and ends up being adopted by a Tasmanian family before searching for his birth family a few years later. Although the story is simple and quite straight forward, the film is an incredibly moving and touching piece of film making. The cast, the natural locations, the storyline, everything feels and looks authentic. Nicole Kidman finds here one of her best part ever and delivers an oscar worthy performance. Dev Patel confirms how versatile and talented he is as a young actor. Definitely the most heartwarming film i have seen this year in theaters. A must see.",
            "review_date": "2017-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Emotional true story!",
            "review_date": "2017-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful movie! Some of the best acting I have seen in a while.",
            "review_date": "2017-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hate subtitles but loved this movie!!",
            "review_date": "2017-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A touching and unique true story. Garth Davis directs with such passion with standout performances from Dev Patel, Nicole Kidman, and newcomer Sunny Pawar.",
            "review_date": "2017-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Little Salu is so cute. And amazing tough destiny.",
            "review_date": "2017-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "And why didn't this movie win the Oscar?",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This may be one of the best movies I've EVER watched! There were times that my emotions were so strong, they were almost overwhelming. I wasn't sure if I could continue to watch. Knowing what that little baby, and thousands of others just like him, went through tugs heavily on my heart strings ð'\"ð~¢ What an amazing movie! I'm definitely going to watch it again.",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not often a story, and a true one nonetheless, is told so beautifully. Phenomenal and moving.",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can tell you this movie is perfect - Sunny, Dev, Rooney, Nicole - but that still wouldn't do it justice. Go see it for yourself but bring some tissues because the powerful story, haunting soundtrack, and beautiful shots will bring out the Niagara in you.",
            "review_date": "2017-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful acting all around. Very uplifting and inspirational!!",
            "review_date": "2017-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Made a grown man cry, so then it's worth a watch now isn't it.",
            "review_date": "2017-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is some serious journey!",
            "review_date": "2017-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing experience . Great movie and great story!",
            "review_date": "2017-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing! Been a long time since I've given a movie 5 stars. Make sure to have a box or two of Kleenex ready!",
            "review_date": "2017-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touchy, but very... very... very... slow. I think Sunny Pawar deserved the Oscar rather than Dev. Even though he reivindicates himself at the end of the movie.",
            "review_date": "2017-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never saw the trailer never red the book it was great loved it",
            "review_date": "2017-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh man, there were parts of this that were really tough to watch as a parent of young children. The adult part felt a little less compelling than the parts with the children.",
            "review_date": "2017-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes the movie is sentimental, but most of it feels earned. I think this is due to the straightforward linear narrative (a rare thing these days) without any voice-over narration (an even rarer thing these days) that allows the audience to experience everything without really knowing where it's headed.",
            "review_date": "2017-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing true story.  Great movie.  Emotionally gripping.  I only have one complaint, what took him so long to try and find the family?  Maybe I need to rewatch.  I loved it.",
            "review_date": "2017-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films of 2016. I loved this incredible true story of little Indian boy - Saroo. This true story will break your heart. Highly recommended!!",
            "review_date": "2017-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful story, and a marvelous cast.  Dev Patel never looked so good, and they somehow made Nicole Kidman look like an average frumpy Mom!    The child actor was devastatingly good.  His performance is utterly haunting, and I can't seem to shake it, weeks after seeing the film.  \nRooney Mara didn't have a whole lot to do here, but she made the poster.  I guess that says something about the way they want to market the film.  Too bad, because it's beautifully written and acted by Dev Patel and Nicole Kidman.",
            "review_date": "2017-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With its emotionally uplifting finale and Dev Patel's great performance, Lion is a heartfelt and moving story about heart, family, and determination, that is far better than most films in the biopic genre.",
            "review_date": "2017-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome true story!  Thrilling and emotional!",
            "review_date": "2017-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion delivers a moving, thoughtful, cinematic experience, thanks to a top notch performance by Dev Patel, beautiful cinematography, and an intense but uplifting story about a lost Indian boy's journey back home!",
            "review_date": "2017-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you are in need of a tear duct cleanse watch this remarkable, true story; overwhelmingly fantastic plot and the stunning performance by all actors was flawless to say the least. I will watch this again and most likely buy this film. So moving!",
            "review_date": "2017-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Near perfect movie. On par with Slumdog Millionaire.",
            "review_date": "2017-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So moving! Great acting. Incredible story.",
            "review_date": "2017-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An enjoyable drama to be seen more than once.",
            "review_date": "2017-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion has a great core story but was too long for me, I feel like this could have been an hour long short film and would have been terrific instead of a decent film.",
            "review_date": "2017-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You've got to be kidding.  The self- important \"critics\" rated this 86%?  This is a  MAGNIFICENT movie- gorgeous cinematography, never a dull moment, beautifully done.  One of those movies that stays with you.  Not to be missed.",
            "review_date": "2017-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful movie, and wonderfully made. This movie can make you happy but want to cry. I did cry",
            "review_date": "2017-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The reasoning behind my '3' star review? 'Pretentious child syndrome.'  Lion, effectively creates the lead protagonist complete child, mumbling over his words, and, at times, almost making the viewer feel as though they are sitting through a teenaged drama Nickelodeon dished up and through out for old times sake. I will say however, the story behind this film, will leave you with pure joy.",
            "review_date": "2017-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story is pretty incredible but the details do not make for an engrossing two hour movie. The second act is pretty much dull and not needed. Love story also feels forced.",
            "review_date": "2017-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very emotional and never giving up and inspiring and heart felt.",
            "review_date": "2017-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie. Great acting. True story.",
            "review_date": "2017-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn't care for the start but it made me come around and Nicole Kidman's character was amazing.",
            "review_date": "2017-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie, highly recommend.",
            "review_date": "2017-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a must see very meaning full and emotional.",
            "review_date": "2017-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrific, moving story.  Beautifully filmed and acted.",
            "review_date": "2017-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a very easy film for cynical critics to sneer at, it proudly wears it's huge heart boldly on it's sleeve.  On the face of it, I understand that, it's the sort of film that Mum's will probably love, based on a true story spanning continents and focusing on the love between Mother's and Sons, families torn apart and the search for your true self.  Well corny or not I absolutely loved it, the opening half set in India (subtitled with astonishing performances) is some of the best film work I've seen in years.  I was touched and ultimately moved, in the second half it's fairly obvious where the story is heading and so dramatic tension is lost but Dev Patel lends a perfect touch to his performance.  Believable and empathetic, an excellent film.",
            "review_date": "2017-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome. Broke my heart.",
            "review_date": "2017-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "mr.Garth Davis' take on the story is absolutely brilliant, if you get a chance to see it, you'll know why",
            "review_date": "2017-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very enjoyable and family friendly. Highly recommended.",
            "review_date": "2017-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well done from start to finish. The middle of it gets a bit dry and over the top but still Ana amazing movie with great cast and acting.",
            "review_date": "2017-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An extraordinary journey transformers into a mediocre film due to underwhelming characters and overacting by the lead actor.",
            "review_date": "2017-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyed this movie.  Even though it's easy to predict the plot, the characters are interesting and I found I really wanted to know the story.",
            "review_date": "2017-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An emotional and well-acted film, which ends up giving a valuable message about child abuse in India\nLion is a beautifully told, uplifting story of courage,resilience and determination.\nSunny Pawar should've got an oscar for his acting",
            "review_date": "2017-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion has a great plot based on one man's tragedy. However, it drags with scenes not needed.",
            "review_date": "2017-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful thought provoking movie!",
            "review_date": "2017-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wow. simply wow. amazing true story based on a child who looses his brother one night. ends up on a wrong train get kidnapped and sold to  an Australian couple and the. decides 25 years later to go back to India and try to find his family which he does with some success. extremely well written and produced story. great actors.scenery and music. a must see !!!! 5 stars are not enough.",
            "review_date": "2017-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "way Better than I thought.",
            "review_date": "2017-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true inspirational story about roots. Actors were phenomenal but the scene after the movie ended summed it all. So good to see that nice people like Lion's parents still do exist. Heart-breakingly good.",
            "review_date": "2017-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A story both tragic and uplifting of a boy from India separated from his family for 20 years  8/10 Rev 431",
            "review_date": "2017-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They should have included English subtitles within the film for foreign-speaking parts which are roughly about 30-40 minutes.\n\nThough I'm an Indian and speak Hindi fluently I got annoyed by the thought that foreigners will not understand a dialogue for the first half-an-hour.\n\nNon-Indians please watch it with English subtitles.\n\nThe performances were average for me, including Dev Patel, Rooney Mara, and Nicole Kidman with Nawazuddin Siddiqui making a cameo appearance. The only good acting was from little Sunny Pawar who really makes you feel bad about Saroo. I guess we sympathize more when it comes to children.\n\nThe real credit, and I mean it, goes to Director Garth Davis whose, I read, 'Lion' was directorial debut. If an Indian Director would've directed this, I wouldn't have been so impressed. It would have been normal for them. But when a foreign director comes to a foreign country and still manages to capture it so beautifully is highly commendable.\n\nDespite all that, it bored me for roughly 20 minutes. It starts slow, and spends a lot of time with Saroo's younger self. You run out of sympathy for the kid for that long. That's probably the first half.\n\nThe second half is him grown up and his education. There is a wonderful scene before he decides to find his home that I will not spoil. But the stuff with Google Earth gets repetitive and boring with the audience not understanding much. Though those scenes were vital to the film and had to be included.\n\nI wasn't emotionally moved as much as I thought I would.\n\nAlso another issue that I wanna address is that films like these should be family friendly. Not 'R' or 'PG-13'. 'Lion' clearly is not a family film. Kids also need to see it to inspire them.\n\nI still think 'Lion' is a good film and worth your time.\n\nBut a one-time watch for me at least. Recommended!",
            "review_date": "2017-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very touching.... Based on a true story :'( What strikes me the most is the actual number of people living in such a precarious situation",
            "review_date": "2017-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's one of the most powerful movie of the year, thanks to the strong performances from Patel and Kidman, the cinematography and the music score.. If only, they can edit the script more efficiently, edit it a little bit shorter and put some scenes on the right track, 'Lion' will roar as a masterpiece..",
            "review_date": "2017-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite a touching movie. India is such a place with so many population which everyone is that easy to disappear, He has spent 20 years with a new family and taking care of the step brother... but at the end the desire to be reunited  with his very own family has never eased, which is also a good reminder  to all those good people out there everyone has their own root.....",
            "review_date": "2017-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "sooooo good! such an incredible true story and little Sunny is my new favorite actor kid!",
            "review_date": "2017-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie should have been a contender for best picture.",
            "review_date": "2017-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Family ties us together, no matter the distance. We all have to find a way home eventually.",
            "review_date": "2017-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is awesome!!!",
            "review_date": "2017-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "tissues at the ready",
            "review_date": "2017-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a truly emotional and uplifting story told with such brilliance, in terms of acting, direction, cinematography, and even the soundtrack. This is certainly one of the most memorable films of the year.",
            "review_date": "2017-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very great movie, very touching",
            "review_date": "2017-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cried, nay, BAWLED, from beginning to end.  Humans are awesome creatures.  Lion is an emotionally draining must-see.",
            "review_date": "2017-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful story, acting and shots",
            "review_date": "2017-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "in the morning until 1:30 PM",
            "review_date": "2017-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the excessive emotional story-line would help you to avoid the mediocre way of film-making.",
            "review_date": "2017-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Made me wanna go missing in India.",
            "review_date": "2017-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cried and cried and cried and cried and ... you get the point. One of my all-time favorite movies!",
            "review_date": "2017-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really liked this movie - I felt for the charcters and the main characters situation. What an amazing true story.",
            "review_date": "2017-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Genuine tearjerker but without sappiness that spells doom for many of them, drawing from the most fundamental of human instincts- locating the geography of its biological origin, and the assurance of belongingness, both through blood ties determined by nature and family bonds anchored in nurture.",
            "review_date": "2017-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredibly moving picture! Be prepared to have plenty of tissues handy!",
            "review_date": "2017-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "tissues needed for this one. great true story.",
            "review_date": "2017-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This story will make you emotion. Dev Patel done a good job but over all plot is impressive.",
            "review_date": "2017-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it will be a sin to not watch this film",
            "review_date": "2017-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like quite water it slowly grabs you, hard. You won't want to separate. \nWould watch again right now. \nIt is this kind of movie that earned a honored place in my movie's Pantheon together with 'Terms of Endearment', 'Remember the Titans' and 'The Notebook' among others. \nMaster piece: gifted actors, amazing directing. \nWOW!",
            "review_date": "2017-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect acting. Especially by the young boy and Rooney Mara. \nI had a similar experience where something brought flashbacks of childhood events and I processed them. I also am acknowledging my heritage after being brought up in the West.\nThis is a story everyone can relate to, about family, determination, intuition, and loyalty.\nSheru is a nice person therefore he came across nice people on his journey. I feel more sorry for his brother.",
            "review_date": "2017-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While an inspiring story, the film spends too much of its time watching Dev Patel mope in closeup. Felt like there wasn't enough material to justify the films length.",
            "review_date": "2017-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting to note that the first 30+ minutes all in a language I did not understand.  My wife and I sat bewildered, taking in sights and sounds, and the sheer emotion that is human to all of us.  There was no need to understand the spoken language.  A beautiful film.",
            "review_date": "2017-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrific movie moving and emotional to boot",
            "review_date": "2017-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "caution: this movie will make you cry,tears of sadness and joy. its just that emotional. What can I tell you about this movie?\nfirst, an actual real person went through this,and his story was beautifully produced in this movie. The acting from the cast was very well developed, the story telling captivated me from start to finish. Definitely a must see.",
            "review_date": "2017-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an incredible move! I did not want it to be over. The casting was amazing!!  The true story was mesmerizing. It was so cool to see the real people at the end. Some parts of the story are incredibly sad but others very uplifting. The parts about the children being mistreated was particularly disturbing.",
            "review_date": "2017-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Emotional, Lots of love. Great acting by all cast. I still have no idea why Rooney Mara's character was in this film.",
            "review_date": "2017-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Should've won the Oscar for sure",
            "review_date": "2017-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An incredible true story told very well by Garth Davis and performed wonderfully by Dev Patel and the true star: Sunny Pawar. I work with children, and how you get a 6 year old to act as amazingly as he did is beyond me. It is an interesting and important story than informs and entertains.",
            "review_date": "2017-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A journey of 5 year old boy from khandva  (MP) to somewhere in West Bengal to Australia to return back to him mum after 25 years with the help of Google earth and few memories of childhood.... super awesomely plotted and acted even better. Nostalgia couldn't have been sketched better..... the movie does give a strong message roots and family is imp in every part of the world xxxxx",
            "review_date": "2017-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "2.75 out of 5 Stars!",
            "review_date": "2017-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Straight forward story of loss and the search for connection, but told in an epic way.  A beautiful and poignant film that is deserving of it's Oscar nomination.  Plus this true story delivers an emotional ending that is a moving, rewarding payoff.",
            "review_date": "2017-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw this movie last weekend with my significant other. We both truly enjoyed this movie, it's one of the best movies we've seen!",
            "review_date": "2017-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A little Indian boy (Sunny Pawar) gets separated from his family and ends up far away from home, living on the streets and in orphanage, until he's adopted by a nice couple who take him to Australia. \n\nAlso starring: Dev Patel as boy as an adult, Nicole Kidman and David Wenham as his new parents, Rooney Mara, Diwian Ladwa. \n\nBased on a true story which was turned into book, written by the boy himself, and now a movie.\n\nI liked \"Lion\" a lot, for the most part it's gripping and packs a strong emotional punch. But the two-hour story as a whole is uneven, losing steam during its last quarter and - even worse - starting manipulating with the audience in unconvincing way.\n\nThis big shift doesn't kill the movie but the whole experience would win if adult Saroo's journey was compressed into shorter period of time. As it is, the last quarter is not quite compatible with the previous hour and a half and ends up killing the mood that has been masterfully built up and maintained almost from the start. \n\nThe adult cast offers impressive performances during that last quarter which is totally worth the awards recognition it has garnered. I am especially glad to see Nicole Kidman and Rooney Mara getting strong, well-written female characters and thus turning in more interesting work as usual for them.\n\nBut the movie makers could have easily shortened the adult Saroo's detective work part which really bogs the story down and seems to be more of an excuse to show Patel hanging around aimlessly. \n\nHe'd still have enough screen time for all those stronger acting scenes with the girlfriend and family, or just showing off his fab new looks. Watch out, girls and manlovers, he's turned into quite a heartbreaker indeed, wild hair and strong body, and all...\n\n\"The mood that has been masterfully built up and maintained almost from the start\", as mentioned above, is the main reason why \"Lion\" turns out to be such a moving journey. \n\nThe director uses as little dialogue and talking as possible, concentrating on just showing this lost little boy wandering around - sometimes enhancing the events with not too intrusive music. \n\nThe environment becomes a character of its own - alien, dirty, sometimes hostile. Watching this little guy just trying to get by, without trying to make him act\", or remind us to feel something, gives the story a lot of poetic power and unexpected dimension of depth. \n\nSadly they are unable to repeat or resuscitate this feeling later on, although Patel gives an strong performance of his own, as stated above.\n\nInterestingly, 2008's \"Slumdog Millionaire\" - Dev Patel's breakthrough hit which also shows the shadow side of India and its childrens' lives - is also a movie of two halves, the first of which excites a lot and the second kind of kills the buzz. \n\nSo, it's a great movie for the first three quarters and just okay after that.\n\n\"Lion\" is one of the frontrunners during this award season, with 60 nominations and 32 wins already under the belt. It's nominated for 6 Oscars: movie, adapted screenplay, supporting actor (Patel) and actress (Kidman), cinematography and music. Was also nominated for four Golden Globes but did not win any.",
            "review_date": "2017-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No words to describe. Sensational with a sea of emotions. The way it progresses, its enough to get you in pieces. How beautifully it generates the emotion,is a spell casting. In love with it!",
            "review_date": "2017-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting story and good acting. The young child actor is very likable and him and Patel get your emotions going. For me it was the best picture of 2016.",
            "review_date": "2017-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked it. A nice little story, the sort of thing you could show your grandmother (although not sure she would appreciate the 20 minutes or so in Hindi). Very good story, but I felt it lost some momentum once he moved to Australia.",
            "review_date": "2017-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very touching film. You will cry. A true story that I'm still in awe that it happened.",
            "review_date": "2017-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful. Inspiring movie with a great cast . I wish it would have picked up some Academy Awards.",
            "review_date": "2017-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The little boy who plays Saroo was extraordinary but once into adulthood the story derails.   Not sure what the Oscar hype is about, it's a workaday story.",
            "review_date": "2017-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Number 2 voted by me as Best Picture . Strong performance, strong set, and strong story.",
            "review_date": "2017-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly heartfelt uplifting story. Yes it may be ridden with cliches, but when adapting from a true story, the cliches may be all the necessary. Fantastic performance from Dev Patel, but was upstaged by his younger self Sunny Pawar.",
            "review_date": "2017-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie!! Written so beautifully, based on a true story of success and determination. From the an admirable child who wishes to find his roots as he gets older. An adventure which taken you along this magical ride and find yourself truly attached to the screen.",
            "review_date": "2017-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved it. Dev Patel really shines and Nicole Kidman as his adoptive mother was superb. The story lion is as solid as they come because it is rooted in the truth. You can't make this stuff up! Heart wrenching, seeing a young boy lost in the slums of India and surviving, only to thrive, and then make his way back home. A must see.",
            "review_date": "2017-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion is an unbelievable true story that is heartfelt and definitely deserving of the recognition and nominations it's receiving. The film is broken up into two acts, the first is about Saroo as a boy getting lost and trying to find his way in India and the second act follows Saroo twenty years later desperately looking for his old home. Lion is led by very powerful performances from Dev Patel and Nicole Kidman but is easily stolen from the kid, Sunny Pawar. In his movie debut, Sunny is astonishing and pulls off a performance I most certainly couldn't have when I was his age. The camera work is top notch and the soundtrack is spot on, really adding to the emotion of some of the scenes. Some people found the second half to be melodramatic, slow, and the scenes with Patel using Google Earth \"uncinematic\". I found this to be the opposite as not once was I feeling bored or just waiting for the movie to end. Instead I followed the film closely to the bitter end and enjoyed the journey. I think my biggest problem with the movie is the fact that Rooney Mara is just there and doesn't really do anything. Otherwise I think Lion was fantastic and is a very good movie.",
            "review_date": "2017-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film, although worth seeing, left me conflicted and ultimately depressed. The little boy did such an amazing job, but the story was so heart breaking I found myself just shutting down and turning away. It was too painful to watch at times. I left the theatre three times during the film just to escape. However the story is overall endearing, mainly due to Sunny Pawar. I would have rather seen someone else casted for the adult role than Dev Patel. The film loses the \"charm\" Sunny portrays when making the transition.",
            "review_date": "2017-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was great to bring this true story to big screen and shows us how is life in others countries. Life is though but there will be always good people around. Don't miss this movie.",
            "review_date": "2017-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "is based on true story. It is a heartwarming tale of a 5 year old Indian boy who is separated from his family and after 25 years he is determined to find his biological mother. The young actor Sunny Pawar is brilliant. Dev Patel gives his best performance. The cinematography and background score goes along well with the mood of the film. You will get teary. A very good movie.",
            "review_date": "2017-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie! Great job done by all the cast but especially by Dev and Sunny!",
            "review_date": "2017-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intense, dramatic, exciting. A story that is and feels true due to its high-quality directing and acting.",
            "review_date": "2017-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Uplifting true story - worth a look.",
            "review_date": "2017-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was absolutely really phenomenal! Dev Patel definitely played a great role as Saroo. It's based on the true story of the five year old Indian boy named Saroo who wanted to reach out to his parents again, but he is raised by an Australian couple who took very good care of him and became a great man. In the end he finally saw his parents back in India. It's a great movie to see because it's up for Best Picture as part of the nine nominations.",
            "review_date": "2017-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You go into this movie pretty much knowing how it is going to end,  but it still takes hold of you. This gripping cinematography is accompanied by a beautiful score, and the direction is somewhat entrancing. Hats of to the actors in this film young and old alike, I was no disappointed in the least great film.",
            "review_date": "2017-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most beautiful and agonizing movies I have ever seen! The acting was superb. An emotional and moving film!",
            "review_date": "2017-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "if you aren't touched go see a shrink",
            "review_date": "2017-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mudda fack me man, such a good movie. Tearz 4 daysss",
            "review_date": "2017-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hardly write reviews, but for this one, I must.  Lion, by far, is the *best* movie I have seen in a very long time. Very heart wrenching and beautiful.  It just goes to prove that you don't need crazy special effects and all that violence and villains/heroes to make a decent memorable movie.  And it's a unbelievable true story. Wow! Watch it and don't forget to bring some Kleenex.",
            "review_date": "2017-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Painful and wonderfull!!",
            "review_date": "2017-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didnt know what to expect but it was sad and touching",
            "review_date": "2017-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very impressive overall, especially the acting from lead Dev Patel. It's a shame it got snubbed by the Academy.",
            "review_date": "2017-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A charming and lightweight heartstring tug that offers some original insight in what it is to adopt as a family.",
            "review_date": "2017-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great film and a great story",
            "review_date": "2017-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some long stretches in the middle, but still a very good movie.",
            "review_date": "2017-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked this one a lot. The actors do a great job. The story is crazy",
            "review_date": "2017-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very nice a kind of sad kind of bitter sweet story of little Saroo who get's lost on a train thousands of kilometres away from his family ... a proper tear jerker ...",
            "review_date": "2017-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There was a time when a picture like Lion would have easily won Best Picture. Beautifully shot and lovingly told, this is a grand epic that spans continents and decades. Changing tastes have maligned these kinds of dramas with derisive adjectives like sentimental, melodramatic or, heaven forbid, old fashioned. The production is none of those things. What it represents, is one man's exquisitely composed reminiscence of his life on this earth, a journey that takes him from India to Australia. The narrative builds to a conclusion that had me weeping at the end in an uncontrollable catharsis. It highlights a lot of concepts with sensitivity: the importance of family, the considerations of adoption, one's own identity, the wonders of the internet and love. It's an experience I won't soon forget.\n\nfastfilmreviews.com",
            "review_date": "2017-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very sweet movie but tried too hard to last longer than what the story was about ...",
            "review_date": "2017-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Far and away one of the best movies I have ever seen. Even now I am struggling to see if I am emotionaly able to find a movie on my 10 best of all time to replace with LION.  \nDont, watch the trailer if you haven't allready, don't ask anyone what it's about. Do yourself a HUGE favor. Grab someone you love and go see this movie together.",
            "review_date": "2017-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "May 6, 2017\n4 Stars\n\nNikki and I watched this movie last night after a long day of registering for at wedding at Bed Bath & Beyond. Not sure if we were mentally exhausted or if it was the incredible tacos we got from Taqueria San Jose but we cried a lot!  It was a beautiful/sad story. It also shows a really interesting view of the complexity of international adoption.",
            "review_date": "2017-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "love it!! i don't know how this movie lost against moonlight.. unbelievable!!",
            "review_date": "2017-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie I've seen in a long long time.",
            "review_date": "2017-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best movies ever",
            "review_date": "2017-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I found myself more and more intrigued as the movie went along. I even woke up several times last night thinking again and again about the movie and the story.",
            "review_date": "2017-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly an amazing supported by exceptional acting, writing and musical score.  This cannot be missed.",
            "review_date": "2017-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By purposely focusing on the execution, Lion's neglects any element of surprise.",
            "review_date": "2017-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Charming.",
            "review_date": "2017-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Made me sob like a toddler . The fact that it's a true story twisted the knife in the wound.",
            "review_date": "2017-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful real-life story although I am still not a big fan of Rooney Mara.",
            "review_date": "2017-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Compelling but not great.",
            "review_date": "2017-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Performances were good. The little kid was the best. Oscar standard? \nIf it weren't for it being a true story, I'd have found the Google Earth thing farfetched.",
            "review_date": "2017-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best film I've seen in a long time! Very emotional make sure you wear waterproof mascara and take your tissues! Fantastic film!!!",
            "review_date": "2017-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "excellent, emotional and worthy of its best picture nomination",
            "review_date": "2017-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really interesting adoption story but gets boring towards the later stages when searching for his family",
            "review_date": "2017-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A little meandering towards the middle. Garth Davis does full justice to India in his shots and Sunny Pawar is just fabulous and is deserving of his Oscar invite.",
            "review_date": "2017-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is an inspirational classic and gives detailed insight into the struggles of daily life for young Indian children.",
            "review_date": "2017-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "End the movie after the kid reaches Australia and you got yourself a great short film.",
            "review_date": "2017-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a really well-acted, well-plotted, well-presented story about a small child in India who falls asleep on a train and gets lost only to be adopted by an Australian couple from an ophanage. When he's in his twenties he follows the suggestion of someone at a party to use Google Earth to try to locate the town he was from and reunite with his biological family. There are inner-conflicts and issues with his adoptive family to be dealt with but he eventually starts to put the pieces together to fill in the gaps left by his childhood separation. The conclusion is a very powerful example of a story reaching a climax and tying up all the strands of the narrative almost perfectly. This is a great movie about what it means to be alive.",
            "review_date": "2017-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good story. I liked it.",
            "review_date": "2017-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tear in the eye, grin in the heart stuff. Lovely.",
            "review_date": "2017-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Actors are fantastic. The little boy is especially amazing. The first half of the movie was more gripping then the latter. I wanted to know more about the protagonist feelings about growing up in different culture and his relationship with his adoptive brother also his relationship with his girlfriend was underdeveloped. Overall the movie moved movie to tears (I actually cried during the biggest part of the movie) I would recommend this movie for family. It leaves room for good discussion about identity and sense of belonging when growing up in different culture.",
            "review_date": "2017-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shocked by how great this film is. Along the lines of Slumdog Millionaire in the best way! Watch it if you're curious, you'll be glad you did.",
            "review_date": "2017-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion was one of my favorite movies of the year. It made me want to travel, cry, write, and live. Dev Patel carries an incredibly vibrant performance of the true story of Saroo Brierley, who was lost as a child and then attempts to find his family in his 20's. Pair that with grand sweeping landscapes and the incredibly endearing Sunny Pawar, who shines despite the grit of 1980's slums of India, and it had everything I could have wanted in a hauntingly true film. This movie stuck with me days after leaving the theater and only deepened the lifelong crush I have been harboring on Dev Patel (which started in Slumdog and escalated in The Newsroom). I am in general pretty lukewarm on Nicole Kidman, but this is her at her best, and her maternal interactions seemed authentic without being romanticized. All in all, this was near perfect to me, and somehow managed to avoid landmine cliches that could have cheapened this standout of 2016. 9.7/10",
            "review_date": "2017-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first part is better and has more action than the second",
            "review_date": "2017-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a half star just for the child actor of Lion because he is too cute :)\ni loved the beginning and ending scenes of the movie set in India.",
            "review_date": "2017-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie of the year. Reminds me of PHILOMENA.",
            "review_date": "2017-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really well acted. Great direction and plot...",
            "review_date": "2017-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful true story of self discovery",
            "review_date": "2017-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A moving and uplifting story",
            "review_date": "2017-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this movie!!!! It is dramatic and heartwarming. Would definitely recommend.",
            "review_date": "2017-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inspiring real story of a long waiting homecoming. Captures the attention of viever from the early minutes. A shall to see.",
            "review_date": "2017-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very moving. Great acting. Nice camera work.",
            "review_date": "2017-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films to come out in the last two years! Go see this if you want to see something positive and uplifting!",
            "review_date": "2017-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you don't cry ,there is no hope for you.",
            "review_date": "2017-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow pace, but a beautiful film!",
            "review_date": "2017-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Be prepared to feel emotion.",
            "review_date": "2017-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a beautiful movie, and Dev Patel gave a powerful performance.",
            "review_date": "2017-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inspiring movie with lots of tears!",
            "review_date": "2017-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful. Emotional. Determined. \nHad tears streaming down my face 80% of the movie.",
            "review_date": "2017-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is by far one of the best movies I have seen in the last couple of years.  Many do not give it full starts, such privileged bunch of Westerners!  The acting is phenomenal although I have to say that the girlfriend part is irrelevant but given that this is a true story, it is appreciated that the author shared this part as well.",
            "review_date": "2017-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first half is awesomely true to life and beautifully shot... the second makes you cry.",
            "review_date": "2017-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This uplifting story is told in two parts. The first half chronicles how a five-year old separated from his family came to be adopted by a family in Australia. The second half is the story of how he searches for his family 25 years later. A little cliche at times, but moving and well-acted. 4 1/2 stars, 4 1/2 Kleenex boxes.",
            "review_date": "2017-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just watched it and it is very good. It drags a bit in the second half but them comes to a decent ending. Being a true story always makes a movie more interesting. The first half was outstanding.",
            "review_date": "2017-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3.5 - heartbreaking story in the first half when he was a child, but it almost completely lost me once we got to him as an adult..",
            "review_date": "2017-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible cinematography!!! And the kid is SO CUTE! Just beautiful....lighting, editing, casting...everything.",
            "review_date": "2017-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So moving! Unbelievable story.",
            "review_date": "2017-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never cried so much! Wow...what a movie. It moved be a bit more coz of my Indian roots...but wow...i cried more than Schindler's list (which is the last time I cried at a movie)\n\nSuch a powerful movie and it shows India as it is and human flaws as they are. No sugarcoating.",
            "review_date": "2017-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie I've seen in a very long time!",
            "review_date": "2017-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "there wasn't a dry eye in the house. My husband, kinda, embarrassed me, sobbing, like a baby.\nIt was beautiful. ð??¬ð??½ï¸?ð??¥",
            "review_date": "2017-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Reviewed 3.3.17.  The major drawback to seeing a 'based on true events' movie is how the main reveal of the plot is readily promoted, often in the trailer itself. So you enter the theatre with a general idea of what's going to happen, which can lead to a painfully trite viewing experience if the creative team takes a paint-by-numbers approach to telling the story. And in this case, with a neophyte director behind the lens too, what could be expected from Lion? Well let me tell you, strap on your emotional seatbelt, this Lion has a roar all its own. Shot with passion, grandeur and beauty to spare, Lion captivates from its first frame to the last. Overcoming every genre faux pas as it sweeps you up in a whirlwind of humanity, affirming what lies deepest in us all. The desire to be loved, to be remembered.......and to never let go. Nicole Kidman returns to top form. Kudos to Dev Patel and Rooney Mara for continuing their scene stealing ways, and to Sunny Pawar for the most heartening of debuts.",
            "review_date": "2017-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This really is an excellent film, fantastic story",
            "review_date": "2017-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love movies based on true stories!! I loved this movie n the cast. I recommend it!! I love how they added real scenes of the actual event. Job well done!! Don't listen to the haters they don't kno what they're talking about!",
            "review_date": "2017-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Found it very slow, boring and predictable. Although a nice story, lacked anything worthy of committing 2 hours watching.",
            "review_date": "2017-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an incredible movie about family love",
            "review_date": "2017-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie of 2016, it should of won Best Picture not that dumb Moonlight. About being gay.",
            "review_date": "2017-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great heart felt movie. a must see",
            "review_date": "2017-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. It is so touching.",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible story, worth the watch!",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heart-warming, heart-wrenching, filled with family love and the value of persistence, as well as the breath of fresh air that technology and solely be a good supporter of good causes!",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most base-on-a-true-story movies are usually sappy and predicable.  Lion is heart-felt and genuine throughout it's journey of abandonment, self-discovery, and reconciliation.",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was... okay I guess? It's hard not to avoid at least some comparisons to \"Slumdog Millionaire\" (an amazing flick I never get tired of seeing). Weird how \"Google Earth\" turns out to be a major part of this storyline - Google even ran a TV spot about it later.",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion is Wonderful and heartwarming. It's every thing you want a movie to be and more.",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Someone who made this is f***ing talented. The poster sucks, it's not about Slumdog and his girlfriend at all. This movie really gets to the core of human feeling, and that's a rare and special thing.",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's just an amazing story very well crafted into a movie. Take tissues lots and lots of tissues.",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie of the year! \nBy Far!!!",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is it. One of the best films I've seen in while. Very moving true story, told in a poetic way. You will most likely be crying at certain points in the film, as the story is heart-wrenching. One of the best performances of Nicole Kidman in a while, and well, Dev Patel, is just amazing.",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie greatly exceeded my expectations. It was beautifully made and the first half of the movie (the young boys's life was amazing, yet heartbreaking.  It was definately worth a best picture Academy Award nomination and was in my top three movies for this award.  Highly recommend seeing it.",
            "review_date": "2017-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An extremely slow movie, that drags on painfully for what seems like forever, but using Google Earth (as an adult) he finds his way home.  The story can be told in less than 3 minutes, but instead it drags on for over 2 hours.  It's dull, painful and boring to watch.  Skip it, it's not worth seeing.",
            "review_date": "2017-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow at times but overall good pace of story telling. Well written and directed with wonderful acting. This true story is an epic telling of a journey home.",
            "review_date": "2017-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this shouldve won best picture loved it!  totally oscar worthy...it has everything, suspense, highs and lows, love, family",
            "review_date": "2017-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I cried throughout almost the entire movie but in a very satisfying way. This is a rich story about a difficult but oh-so-human journey. The acting and imagery go straight to the heart, making the theme so palpable: the universal desire to connect to our origins, to family, to home.",
            "review_date": "2017-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Young star Sunny Pawar steals the show. great inspirational storyline. the journey had slow bits which I almost feel asleep to. Perhaps it's because of the nature of these true life stories that we already knows what will happen so parts of story appear drawn out.",
            "review_date": "2017-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant true story.",
            "review_date": "2017-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite the extraordinary story that it tells and a great beginning, Lion is an uneven drama that makes up for its flaws with a beautiful ending. Full review on filmotrope. com",
            "review_date": "2017-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful, heartbreaking yet hopeful story with brilliant acting.",
            "review_date": "2017-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Without question one of the best films I have seen in the last year.",
            "review_date": "2017-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definite 'chick flick' - while it had all the 'wonderful (based upon a true story) stuff it dragged on and on and on. Thought it would NEVER get to the grown up parts. It did and was a bit of a letdown, but a hapy ending thing, then a plug for lost children in India.\nIf you can get out of going - DO, but if you can't bring popcorn - it will help pass the time - a little. Wouldnt have seen it if I knew how LONG it was going to seem.",
            "review_date": "2017-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It would be hard for any viewer to not warm to the true life tale that is the centre piece of Lion. With a strong premise and cast, the film captures the hearts of audience and doesn't let go to the very end. Even though elements of the Tanzania part of the story feels a little underdeveloped, there's no denying the power and poignancy of those involved. Get the tissues at the ready.",
            "review_date": "2017-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought the movie and the message could of been scaled back, but by the end of picture, I was overwhelmed with emotion and I think this is one beautiful story about love and devotion.",
            "review_date": "2017-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent, compelling, engaging film. Dips slightly in the middle but this is more than made up for with a superbly gripping start, and a poignant and emotional ending. This is a film I shall remember for a long time.",
            "review_date": "2017-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Walks the line between forced melodrama and organically intense scene work. Ultimately, the true feelings prevail in this mostly winning film based upon true events. Several very deserving Oscar noms.",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The epic true story that proves that you cannot do shit without Google Maps. Great acting by the entire cast with a great set-piece that Oscar bait cinema usually doesn't explore. I went into this movie expecting a simple premise but ended up with watery eyes till the credits.",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my opinion this is the deserved oscar winner of this year. \n\nTrue beautiful uplifting story of courage and determination. \n\nAnother award deserving talent was Dave Patel and his genius to deliver the agony and suffering of being lost with no identity even in the midst of loving family. \n\nSunny Pawar, \"Little Saroo\" as you can tell from his name he is the sunshine of this little piece of art.",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Until the final act, Lion can feel very slow, but at the same time gives you time to breathe and follow along with the story of Saroo. The ending is very fulfilling, and further reminds me of why I love fully True Story based films!",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion offers up a very strong performance by Dev Patel and Rooney Mara, as well as the rest of the excellent cast, I really enjoyed the first act of the film, and I found myself completely entertained by it. Then it goes 20 years into the future, which is something they had to do, but it wasn't nearly as interesting to me after that part. I think it's because the characters seemed to me to be in the exact same spot in their lives from when we saw them 20 years earlier. Of course, after the jump we see them grow and advance, but it does take a little bit for that to happen. I also thought the ending was a bit rushed. Nevertheless, I didn't hate the second half, I just thought it could've started better is all. I really enjoyed the real life footage at the end, and there were very good character moments throughout, but Saroos father in Australia seemed to take a major backseat in the entire film and I'm not sure why. Lion is a solid film, but I'm not sure it was worthy of a best picture nomination",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion is the real-life story of an impoverished Indian child who is separated from his brother far from home, finds himself on the streets of Calcutta, and is adopted by an affluent Australian family. He is raised in their household and after becoming a young adult he endeavors to retrace his way back home to his village and his original family.  Lion is a pretty straightforward and unpretentious treatise on family, identity, and belonging.  The protagonist (played excellently by both child actor Sunny Pawar and veteran Dev Patel) is a child of two worlds and finds that even as a fully-grown and educated man, he is still a scared, lonely boy on the run.  There are excellent supporting performances from the likes of Nicole Kidman, David Wenham, and Rooney Mara, and the film makes notable use of language and silent isolation to tell its story.  Lion meanders on a bit in the middle, much like its dejected main character, but it's bookended by truly strong and emotionally gripping first and third acts.  I personally found it superior to the once celebrated Slumdog Millionaire (the OTHER movie about Indian poverty starring Dev Patel) as it trades in that film's fantastic whimsy for a realistic and earnest tone.  This is movie that few people have seen so far and I would really recommend it as a rental or download.  The bittersweet and realistic ending is worth the effort.",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first half and ending of this movie are really good.  Emotionally and aesthetically engaging.  But the second act is directionless and overwrogught.",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredibly beautiful heart breaking and heart warming film. All the feels here.",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touchingly beautiful. If you are a mother, child, or sibling this movie will pull at your heart strings.",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We never cried so much I thought it was one of the most fantastic story's and a must see",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touching movie , and cry , the soundtrack so good",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film!  A must see!",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strongly recommended",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very powerful movie, the first half is stronger than the second but this is a must see film.",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Grade:  A-\n\nRating:   PG-13\n\nIn a Nutshell:  Adapted from the book A Long Way Home: A Memoir , this inspiring true story will break your heart and then warm it.  \n\nMost people missed this film when it came to theaters (including me), but now that it has received 6 Academy Award nominations, everyone is talking about it (including me)!\n\nUplifting theme: \nWhat incredibly selfless love people give when they adopt children, especially the street children from poor countries.  Over 80,000 children go missing in India each year.  You can learn more about the movement that has started because of this movie at www.lionmovie.com\nDetermination, love, courage, home, family, blood, bonds, heritage, adoption\n\nThings I liked:\nBeautiful cinematography.  Greig Fraser (Rogue One: A Star Wars Story and Zero Dark Thirty) uses a child's perspective to film surrounding areas and provide a sense of wonder.\nThree cheers for Google Earth!\nThe love of Sue (Nicole Kidman) and John (David Wenham) for their adopted children was so sweet.  I got teary eyed almost every time Sue was with her sons.\nYou don't learn the touching reason why the movie is called Lion until the very end of the movie.\nDev Patel plays the grown-up Saroo with the absolutely adorable Sunny Pawar playing the young Saroo.\nWhat makes the movie even more powerful is knowing that it's a true story.  You get to see real footage of when Sue meets Saroo's biological mother just three years ago in 2014.\nAs an instructor at Le Cordon Bleu Culinary College, I thought it was fascinating that it was food that suddenly brought memories back to Saroo about his childhood.\nI enjoyed learning more about India and its culture. We also get to visit Australia in the movie.\n\nThings I didn't like:\nSPOILER:  It made me so sad that no one would help Saroo in the train station.  Poor thing.  I just wanted to hug him tightly and give him something to eat.\nThe beginning and end were really great, but it starts to drag in the middle when Saroo grows up and gets depressed and mopey before taking action.\nSome of the editing was choppy.\nWhen you first see Nicole Kidman in that wig, you think, \"What the heck?\", but then, when you see the real Sue at the end of the movie, you think, \"Oh, Ok.\"\n\n \n\nInteresting lines:\n\"You weren't just adopting us, but our past as well.\" - Saroo\n'I really hope she's there.  She needs to see how beautiful you are.\" - Sue \nTips for parents: \nThere are subtitles in the first half of the movie and again in the end.\nPre-marital relations.\nYour children will see some extreme poverty and, hopefully, be grateful for what they have.",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful Story of Never Giving Up ^_^\" Inspiration and Blessings",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully told story about the generosity of the human spirit, and the struggle to reconcile western and developing country identity (and guilt). The Brierleys, in particular, represent the kind of fearlessly empathetic Australia I wish we all aspired to. They represent the best of us. Most compelling performance I've seen from Nicole Kidman in years. My only criticism is that sweeping scenescapes meant to establish a sense of place are used excessively at times.  Whilst visually stunning they do slow the momentum of the film down somewhat.",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film about a amazing true story! The director truly helmed a great cast through an emotional story!",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a good movie. Doesn't hurt that Dev Patel is a hottie either",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not enough Kleenex in the house",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I mean, come on. We all love a little bit of cheesy drama on our lives. Dev Patel's performance it's good. But not enough as their competitors - like Moonlight actor-",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh my goodness! Couldnt hold back the tears!",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best true story adaptations ever!",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The storytelling itself was weak at points, but overall the story was heartbreaking, profound, and emotional.",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very moving. good cry. Cinematic. Worth seeing on the big screen.",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion is a good movie, but I have many problems with it. The beginning is easily the best part of the movie, it's suspense full, well shot, and great acting. The middle is what pulls this movie down, when we skip 20 years his life, it drags on and on, to the point where I felt like sleeping. The love interest, Lucy, is just kind of there and isn't fleshed out. His adopted mother and father, are alright, but I don't think they deserved their own subplot, the main point of the movie is him finding his family, but the adopted father and mother subplot takes away from the main point. The ending is where it starts to pick up again, and that's all I'll say to avoid spoilers. Overall great beginning, weak middle, and a good end.",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It feels like it skips some pieces in favor of some unnecessarily drawn-out sequences, but it's well-acted enough and the story is powerful enough to overcome many of the flaws in its screenplay, and its finale still packs an emotional punch.",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dev Patel IS a leading man in every sense of the word and Lion just highlights, like Slumdog Millionaire before it, that he can elevate anything he stars in. As for the film, the performances and story were brilliant and heart-wrenching while the supporting cast compromised of Nicole Kidman, David Winham amd Rooney Mara were sublime. Highly recommended!",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well-made and uplifting film - full points for realism in the India scenes. Dev Patel and Nicole Kidman are both very good here, but young Sunny Pawar flat out steals the show.",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Packs a lot of bang for its buck and although you knew exactly where it was going it was a very satisfying ending.\nNicole Kidman's part could have been played by anyone though, her input/influence to what was on its own a fine movie was minimal.\nThe moral of the story: if something is stopping you getting on with your life because you can't get past it, deal with it. It provides not only relief but other unexpected benefits. And trust those who love you.",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great story of courage and survival.\nThe tale of the young boy sharu who got lost and found in the craziest of ways but somehow managed to build a great life.",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It lost me in the second half. Good acting and amazing story, but the story of the kid was TOO LONG but the most interesting part. I love Dev Patel though!",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am happy for him that he found his Mom.   Seemed a little stretched out that it took two hours to get there.",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked the storyline but it did drag its heels in a lot of places. Dev's acting was good if a little monotonous but the scenery was good to watch.",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a great story and the actors brought it to life. Reminds us all how hard others have to live.",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A \"must see'.....such an amazing story!",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lovely, heartwarming stuff",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A five-year-old Indian boy gets lost on the streets of Calcutta, thousands of kilometers from home, only to be adopted by a couple in Australia before setting out to find his lost family 25 years later. It is an epic story complemented by beautiful cinematography and stellar performances to make it an absorbing and moving experience.",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bit of a tear jerker.",
            "review_date": "2017-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie of the year by far. Nothing comes close.",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Able to rise about typical \"Oscar bait\" trappings largely by a strong performance from Patel.",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In a year where I was told so many of the Best Picture nominees were difficult emotional journeys, Lion is the first one to really deliver on that for me. I cried at least 5 times while watching this movie. It hit so many emotional notes brilliantly. I was crying out of sadness with the characters, and out of joy. I could see someone saying that the story was designed in such a way to make it emotionally manipulative, but because it was based on a true story and was filled with honest performances it worked for me. \n\nThe first half of Lion is superb, and I absolutely loved little Sunny Pawar. He gave a tremendous performance, with nuance beyond his years. The whole film would fall apart if he didn't make us care about Saroo, but he nails it. He's completely adorable and I think I could watch him do his little run all day long. Abhishek Bharate was also excellent as the older brother, Guddu. The connection between these two boys lies at the heart of this whole film, even beyond the connection between Saroo and his mother.\n\nThe second half of Lion is good, but doesn't quite live up to the potential of what was set up. Dev Patel is great and he has some strong moments that connect us perfectly to the Saroo that we met at the beginning. The flaw for me in the second half is that there are several moments where the plot stagnates. It feels like the wheels are spinning and I'm just desperately waiting for the inevitable conclusion. In fact it almost seemed like Rooney Mara's character was voicing my own frustration. Luckily, sprinkled throughout this section of the film are some powerful scenes. Nicole Kidman gets a couple of them and I can see why she got a Supporting Actress nomination. \n\nThe end of this film, without delving into spoilers, was exactly what I was looking for and yet also not what I wanted. That's not to say it was done poorly, or that it was a disappointment, there was simply a bittersweet feeling to the end. I can't say much more than that. I didn't know what to expect, because I did not know anything about the true story before seeing the film, and I think that's a great way to go in because I genuinely didn't know how it would end. Lion might not be the best film of the year, but I thought it was well made and delivered a marvelous story.",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dev Patel was so great, great emotion.  The movie was good, you could feel the poverty, the courage of the little boy, the need to find your roots to define yourself, the understanding of the love of your children.",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After seeing 8/9 nominees this is my personal pick for Best Picture in 2017. \n\n5/5 = Classic",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very inspirational movie. It drags out a bit when he's looking for his family, but it's all worth it at the end. The writing and acting is very good. The plot just seemed a bit too simple, because you already knew what was going to happen by the end.",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the greatest movies of 2016!",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely briliant. Dev Patel shines.",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fact that it's based on a true story makes it powerful.",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A story so incredible you often won't believe it actually happened, Lion follows the journey of a lost boy in one of the worlds most populated and, evidentially, hard to navigate countries to a troubled adult, yearning for the family he was unwillingly separated from. Dev Patel is stellar in the lead role, adopting an Australian accent, long hair and a penchant for temperamental mood shifts. The first half of the movie is definitely the most compelling, and kudos to Sunny Pawar for being a child actor who actually doesn't spoil the proceedings with any awkward line-readings or clueless deliveries. It's also the best directed half, capturing exactly what it must be like to be trapped in a foreign world, even one which is supposed to be your own, and having said world tower all around you. Unfortunately, the second half has a tendency to drag, with repeated scenes of Patel staring at a map and/or laptop screen. It's an emotional movie no doubt, and the frequent moping, pushing important people away, questioning everything you think you knew etc. is fairly trite. It's not that the second half is bad, it's just that it fails to measure up to the first. The tear-jerking climax will move some and nauseate most, but it's really the only way the film could properly end. Its strengths lie in its acting, direction and bringing to light a tale so fascinating it warrants at least one viewing. It may be oversentimental at times, but for a story like this, it's understandably hard to avoid.",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gareth Davis pulls all the right emotional strings and presents a fantastic tale of 'lost and regained'. Sunny Pawar (the young Saroo) is a revelation. Patel puts up a stellar show as well. Fate can be hard-hitting, but it also brings hope. One of the best films of the year!",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Potent, emotive, exhilarating, haunting and hopeful, Garth Davis' directorial debut is spearheaded by an unremitting, almighty cast, combining a profusion of talents to make the most out of a memorable - if just a touch deceiving in its portrayal of ostensibly forgetful Saroo as an adult - tale. I hear a few critics maligned the contrast of Lion's two parts, but I really did enjoy the continuity of Saroo's protracted quest for home: visibly physical and visceral in its first compass, incrementally psychological and cultural all the way up to the conclusion. Essential.",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing story about love, belonging, and family.",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slumdog Millionaire Part Two made solely as Oscar bait. Don't fall into the trap. Please avoid.",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a riveting, tear jerker.",
            "review_date": "2017-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heart breaking but inspiring story!",
            "review_date": "2017-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heartwarming story with a fantastic performance from it's youngest star, Sunny Pawar. I thought all of the flashbacks (a solid 50% of the movie) were amazing and emotional, while the modern day story dragged a bit.",
            "review_date": "2017-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(Spoiler free)\nWhen I walked out of the theatre after seeing lion my first reactions were 'Hey that was a great film!' but now after some thought the most I can say about LION is 'Eh'\n \nLION's first act was extremely suspenseful, engaging, beautifully shot and by far the best part of the movie. It did a fantastic job of luring me in and putting me on the edge of my seat wondering what to expect next!\nThe character development between Saroo (Played by Dev Patel and Sunny Pawar) and his brother Guddu (Played by Abhishek Bharate) However the film decided to cut a hole in its own boat as soon as it reached the second act where he meets his plot devic- oops I mean 'Love interest' Lucy played by Rooney Mara. As soon as Lucy was introduced (Sloppily) this so far great movie crashed and burned. The reason why is because Rooney played one of the most forced, bland, pointless, irritating characters I have ever seen in a movie (And believe me, calling this mess a character is beyond generous) Rooney's 'character' serves as nothing but a forced relationship and unnecessary plot device that ironically does the opposite. Lucy's introduction is extremely abrupt and limited, she seems unnaturally forced into the plot and Saroo's life. Soon enough its shown Lucy wont actually have a character or anything human or relatable about her but will be there to create conflict that in the end has no actual effect to the overall plot. For days I have been constantly wondering why Lucy was even in this film, she is nothing but 45 minutes of your life you will never get back (And only god knows why she takes up a third of space on the poster) she distracts the audience by changing Saroo's intentions and interests constantly making the audience care less and less about Saroo's goal as well as numbing every emotion the great first quarter of this film emitted. It feels like two people tugging at at a steering wheel trying to drive the plot in a different direction each. maybe this would matter a tiny bit less if she wasn't played off as such a main and essential character to the story but it was so bad I felt as if I was actually just waiting for her to leave.\n\nAfter the embarrassment that is act 2 is over act 3 begins...\nand then ends in what feels like 20 minutes. I cannot begin to describe the pacing in this film as I feel like you would need a brain the size of a watermelon to even comprehend this mess. After the drawn out, lengthy abomination that is act two the film decides that it wants to end as soon as possible (Probably out of embarrassment or humiliation) the ending leaves a lot of questions unanswered and its shortness makes all the emotions the film's ending disappear, as soon as the unfitting pop song plays as the credits roll. \n\nIn conclusion I think you should give this film a go. Its not great but its certainly not bad either. I may not have enjoyed it but if the large majority of others see something that I cant in this film its worth a shot. I also think the first act of this film is fantastic and wonderfully done.\n\nAll together I would give this a 2.5/5 rating\nIt had great potential but then it lost it around the second act",
            "review_date": "2017-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant, beautifully crafted true story that gives you hope & will leave you wanting to see it again. It IS the best movie of 2016, hands down.",
            "review_date": "2017-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent portrayal of what it must have felt like for the boy Saroo to feel lost and when he became a man, feeling lost in a different way.",
            "review_date": "2017-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "warm & touching, Nicole Kidman is keep in surprising us every time with a new and fresh performance for a total new character, she going beyond the limits and adding warmth to the movie",
            "review_date": "2017-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a story. All the actors were great..Especially enjoyed Sunny Pawar",
            "review_date": "2017-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The child main character is amazing.  He will surely be a star as a grown up one day.  The movie is worth seeing for his performance alone!",
            "review_date": "2017-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Engrossing and poignant movie.  Dev Patel was excellent but the young Sarno was better.",
            "review_date": "2017-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a wonderful movie that touches the collective consciousness that we are all one family.",
            "review_date": "2017-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully made and simply performed. A superb example of film. Lovely",
            "review_date": "2017-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must see. Really impacting movie.",
            "review_date": "2017-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing emotionally driven story that makes you feel every single step that 5 year old Saroo takes. Makes your heart stop at every threat and brings you warmth at his achievements. Not an inherently sad movie yet i had tears rolling down my cheeks at so many moments. Side note, Dev Patel's Aussie accent is on point and he is looking damn good too. Initially thought it was one of those good movies you'd only feel the need to see once, but i already wanna see it again.",
            "review_date": "2017-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's odd that Lion is a film based on a true story, yet its premise seems familiar: a young man searches for the family he was separated from as a young boy. Yet, the events in Lion are so improbable-but-true that you can't help but be surprised and awed at how the life its main character, Saroo Brierly, unfolded. Lion tugs at your heartstrings and stirs up emotions in all the ways you would expect and... it works. If you cry at movies, you'll likely feel the tears flow while watching Lion and that's okay.\n\nThere are two distinct parts to Lion. In the first half, we see little Saroo living with his mother and older brother in a poor rural village in India. His older brother, Guddu, takes random chores and odd jobs to help support their family. One night, a new job means traveling by train at night. Saroo is eager and excited to help, and Guddu reluctantly brings him along. Guddu leaves Saroo at a train station and tells him to wait while he sees about the job. Saroo falls asleep and wakes up in the middle of the night to find the train station deserted. He calls out for his brother and looks for him on an out of service train which springs into service and takes him thousands of miles away from his home. \n\nYoung Sunny Pawar, who plays Saroo as a child, is remarkably good on screen. His wide-eyed precociousness helps him survive on the streets of Calcutta where he doesn't speak the local language and can't pronounce the name of his hometown. He finds his way into an orphanage that seems too similar to a prison, but it is here that he is adopted by an Australian couple played by Nicole Kidman and David Wenham. \n\nA jump in time takes us to the second part of the film. As a young man, Saroo, now played by Dev Patel, feels more Australian than Indian. He is disconnected from his Indian heritage until a chance sense memory inspires him to track down his original home and mother and brother. It is at this point that Lion treads close to cliché territory. Dev Patel has many scenes where he is moody, depressed, and conflicted about his quest. Does searching for his real mother mean he's ungrateful to his adoptive mother? The movie seems more concerned with the mechanics of how he finds out where his childhood village in India is (with much internet research and Google Earth), than with what is going on inside of the characters. Older Saroo's emotions, which should be driving the second half of Lion, feel more obligatory than earned. That's not to say that when the big scenes in this movie come they don't bring pathos. The final scenes of Lion are genuinely moving. \n\nI wouldn't say that Lion is an uneven film, but from a technical standpoint the best part of Lion is young Saroo's near dialogue free journey through the streets of Calcutta. He encounters uncaring adults, seemingly kind but actually sinister adults, and journeys by foot in a direction that he hopes will take him home. Director Garth Davis keeps the camera and the audience at a distance from young Saroo, giving this sequence the feel of a documentary. Every unlikely encounter young Saroo has seems unfortunately believable. It is a piece of incredible filmmaking that the rest of Lion doesn't equal.\n\nDev Patel has some good scenes of emotional dialogue with Kidman and Rooney Mara, playing his supportive girlfriend. Mara is good, as always, but doesn't have much else to do aside from be supportive. The actors handle these scenes well-Patel and Kidman have picked up Supporting Actor and Actress Oscar nominations, respectively. It is their interactions that keep the audience engaged. This is ultimately an uplifting and heartwarming story and the sentiment doesn't feel forced. You may feel like you've seen this kind of movie before, and I'm sure you have, but Lion is still worth watching.",
            "review_date": "2017-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "V moving and great acting by young boy and Dev Patel although middle part a bit laboured",
            "review_date": "2017-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Total Blast I didn't expect the movie would be that good, Dev Patel Was Awesome He Deserved the Oscar Nomination, Nicole Kidman Was Super Awesome She Was too Much into the Character, Don't Miss this one.",
            "review_date": "2017-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing story about humanity!",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sensational story wrapped in a mediocre movie.",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gosh I loved loved this film! My fave film in a long time ! A must see. I hope it wins something !",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "emotional, moving... feel good movie!",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very nice film well done and well acted. The story of the little boy lost in India was especially compelling. Dev Patel did an excellent job  portraying his loss  and journey to find his family.  Wait for the credits.",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Director Garth Davis' debut is a touch over-stretched but impossible to resist - a classy crowd-pleaser with an especially magical first half. Lion's undeniably uplifting story and talented cast make it a moving journey that transcends the typical cliches of its genre. Once in awhile, a movie comes along that is so touching and sincere, without a moment of false emotion or manipulative self-indulgence, that it establishes squatters' rights and moves into your heart to stay. This amazing true story with remarkable performances by Dev Patel, Rooney Mara, Nicole Kidman and newcomer Sunny Pawar has, like the title would suggest, a blend of brute force and elegance. Patel brilliantly portrays a young man adrift in a sea of uncertainty towards his identity, haunted by a past he barely survived and guilt ridden over loving a family he barely knew. Lion starts strong and finishes on a teary high, with its comparatively lesser moments buoyed by the presence of Patel. A sober and yet profoundly stirring contemplation of family, roots, identity and home, which engrosses throughout the course of its two-hour running time. Unsurprisingly, the finale is manipulative in every way, squeezing out the emotions of the audience. But Lion's well-plotted narrative and thoughtful characters suck you in so much that the journey there is totally worth it.\n\nVERDICT: \"High-Quality Stuff\" - [Positive Reaction] This is a rating to a movie I view as very entertaining and well made, and definitely worth paying the full price at a theatre to see or own on DVD. It is not perfect, but it is definitely excellent. (Films that are rated 3.5 or 4 stars)",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most emotional movies I have ever seen. Really good movie.",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Take a tissue, was totes emosh after watching this",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice cast and pictures but the story is too straight. No surprises at all.",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion is an obvious Oscars bait that is kind of hard to judge. On one hand it's a beautifully shot movie with interesting conflicts and is definitely emotionally impactful, but on the other hand it is like really, really ridiculously disjointed. It's basicly two different movies connected with a funnily loose middle act. First we have a reiteration of \"Slumdog millionaire\" with a field trip trough the \"best\" of India(because that gets you Oscars) then a series of time skips that turn the pacing upside down including underdeveloped characters like the protagonist step brother and girlfriend and then there is what appears to be in my mind one of the most beautiful explorations of adoption I've seen. The protagonists step parents are brilliant and are the high point of the film. Next we have the ending that was the expected tear jerker, but it was hurt by the lack of subsistence of the preceding acts due to the never ending time skips. Overall it has lots of faults and positives, but an Oscar? I don't think so.",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a movie! I was involved in it from the first few scenes. This is based on a true story. What we find out at the end is definitely not what I expected. This is one of those movies that leaves you walking out of the theater thinking about it and still being involved with the characters. That's my kind of movie.",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great thought provoking film!",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic movie don't miss it!",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sad story at times, but very uplifting. A strong story that connects heritage, family, adoption and much more. Very well done and should be seen as a serious contender for movie of the year in 2016. Excellent work by Patel and Pawar. Google must be happy with the film also.",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This has an excellent cast and an emotional story.",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great tearjerker. The 1st of this year's noms that actually made be bawl my fucking eyes out",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love the honesty! The ending was such a heartbreaker! Can't wait to watch it again!!!",
            "review_date": "2017-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "well made and emotional drama just have tissues ready at the end",
            "review_date": "2017-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An extraordinary true story of a young Indian boy who goes missing, gets adopted in Australia, and uses Google Earth to try to locate his home and his birth family. Wonderful performances from Dev Patel and Nicole Kidman. The payoff is superb, but it drags a bit in the second act which keeps it from being mentioned among the very best films of the year, but it is still a heartwarming and wonderful journey.",
            "review_date": "2017-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's pace is slow but an excellent film, Great soundtrack.",
            "review_date": "2017-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "tour de force that is utterly gripping and moving. Patel is phenomenal in both his physical transformation as well as deftly touching on the complex range of emotion needed for this role. Kidman steals every scene she is in, and would have been a real contender for Best Supporting in another year.",
            "review_date": "2017-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie! Compelling story about being lost and the journey home.",
            "review_date": "2017-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably a third place in the contest for best picture, though I wish there was an Academy Award for child performances, as the little guy who plays young Saroo and this deserves one just as much as the kid who plays Little in the nearly perfect Moonlight.  A tearjerker, the second act drags on far too long and could easily have been cut, but it's still a very enjoyable film about a very important subject.",
            "review_date": "2017-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting was great\nThe story was slow and depressing",
            "review_date": "2017-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Lion' is a must see movie! A true story about how a five-year-old boy goes out with his older brother, never to return home.  Saroo gets lost and we are taken on an epic, moving adventure that fills us with emotion.  How Saroo survives and manages to get away from all the kidnapping attempts is truly gut wrenching. \n\nSunny Pawar (little Saroo) is amazing in his performance and really carries the movie and connects you emotionally to Saroo's epic tale.  Dev Patel then picks up the baton and runs with it, continuing the emotional journey.  For some of you, a box of tissues will be required as it's quite emotional.\n\nOne for all to watch and be grateful for what they have.  A passionate, deep and genuinely moving movie.  Highly recommended!",
            "review_date": "2017-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true story, tearjerker at the end",
            "review_date": "2017-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion is an astounding film about a young man who wants to find his way to his home, 20 years after getting lost. The acting and the movie itself is remarkable and I found myself to be very emotional after the credits began to roll. It's a good movie for everyone to enjoy. 8.1/10",
            "review_date": "2017-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I cried and cried, Lion touched my heart. Excellent movie.  Dev Patel was worthy of an Oscar!!! #Love",
            "review_date": "2017-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic movie...If I write anything about the movie, I don't want to ruin the surprise",
            "review_date": "2017-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion is an emotional movie with a beautiful score and cinematography, plus an excelent performance from Dev Patel. An exeptional true story that will make you leave the theater appreciating what family and home means.",
            "review_date": "2017-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very, very, very good human story...Everybody should see it at least one time. I felt there was a little tiny bit of something missing in the 2nd act, but it makes up for it in the 3rd act. The 4th best movie of 2016, in my opinion.",
            "review_date": "2017-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loaded with cliches a little later and some productions errors/flaws hold me back from rating this beyond my opinion.",
            "review_date": "2017-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A privileged former street child looks for the missing piece in his life.  it has its moments but is very straight forward.  Patel and Kidman have some great scenes together",
            "review_date": "2017-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "emotionally powerful slow start but worth the wait a magnificent journey",
            "review_date": "2017-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant, touching, as a parent completely heart-breaking. Absolutely deserves the accolades.",
            "review_date": "2017-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible movie with truly touching moments during flashback sequences.  I found myself more interested in the scenes of the main character as a young man rather than as an adult.  The casting was very well done.  The actors pulled me in and convinced me that this was a true telling of the actual story.",
            "review_date": "2017-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Breathtaking!!! Cinematographer, Grieg Fraser navigates the camera majestically through the busy crowds in the streets of Kolkata. The first act told from the POV of a 5 year old boy, the story only reinforced with each act that follows. A stunning piece of cinema!",
            "review_date": "2017-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was amazing so emotional and a great movie",
            "review_date": "2017-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an amazing movie and the fact that it is based on a true story makes it even more special.",
            "review_date": "2017-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great movie for 2016.  Still La La Land and Hidden figures is better.  But Lion is worth a couple oscars .",
            "review_date": "2017-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not great, but Lion is definitely a moving story with a pretty good cast.",
            "review_date": "2017-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3.5/5 stars\n\nThe first 40 minutes (which feel like an hour) are really uncomfortable and hard.  It is a bit disorienting and there are a few places where it is not entirely clear what is happening, but it sure alludes to REALLY bad stuff.  I kept waiting for that part to get over.    It was one of the first movies where I almost contemplated walking out on -- not because it was *bad*, but because it was unenjoyable and hard to watch.\n\nOnce the movie turns to modern day, it gets easier, but not all the time.  There are several more hard parts that are tough to watch.\n\nThe overall story was interesting. But I think I wish it has been more of a procedural movie delving more into how he found his home and a little less on telling the chronological story or focusing entirely on the characters.",
            "review_date": "2017-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really do recommend it!  A really strong performance and and incredible touching story! I admire that the film is supporting an organization to help prevent and follow through with cases similar to this.",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "outstanding from start to finish. emotional.",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story about a little boy who got split from his brother at an early age. The hurdles he faces creates a bond with you that seems to grows as the movie goes on. Overall it's a great movie, inspiring and true! Go see!!",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie of the year. \n1- Lion\n2- Moonlight\n3- Manchester by the Sea",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion tells a truly incredulous story in a delicate, compassionate and credible way. It's a film of a definite two halves; the first half unflinchingly depicting the harsh brutalities of street life for Calcutta's lost children, the second half a more palatable but well-trodden journey of self-discovery. Patel's honest performance prevents this sentimentality becoming too mawkish, ably assisted by a grounded Kidman as his adopted mother (one of her finest performances for some years). For me however it's 5 year old Saroo's story that was the most engrossing, alarming and heart-breaking, played with perfection by Pawar. Lion may play safe in its storytelling, but it's affecting, distressing and ultimately uplifting. Only the hardest of hearts could fail to quiver a little by the closing credits.",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Top class! Powerful performances through an emotional journey with stunning cinematography! A must see!",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well worth a watch, there is no stronger call than home, and this proves it. Can't help but feel without Google he'd still be looking.",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film. Really hits you in the end.",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing story. emotional rollercoaster.",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extraordinary story told in a very extraordinary way. Dave Patel and Nicole Kidman outstanding. The music beautiful. All in this picture perfect. I really love it",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An uplifting story (sort of) but like, why was he such a dick to his girlfriend?",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved the move , it was a heartwarming story. I will see it again.",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Way better than it's awful poster makes it look.",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Moving, Well Shot and Acted Movie!",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "such a good film. True story of a poor young Indian boy who becomes separated from his family after getting on a empty train carriage to sleep. when he wakes up the train is on the move and the doors locked. two days later and 1600 miles away from home the young boy is unable to tell anyone where he is from or even pronounce his name correctly... so his journey begins... it is an emotionally charged and heart rending tale. Nicole kidman the young boys foster mother plays a blinding part, so genuine and emotional no doubt fuelled by her own real life experiences of adoption.. my only regret is that i forgot to take some tissues and had to wipe my face and blow my nose on my jumper... the best film I have seen in ages x",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant movie. So sad",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dev Patel is making steps to becoming one of my favorite actors. Also, what a gorgeous story!",
            "review_date": "2017-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie went in with a open mind and I wasn't disappointed. Movie takes you on a wonderful ride Thur this persons life and the struggle of wanting to find know where you come from",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Totally blew my expectations out of the water. Critics grade it more harshly because they know the ending, but it's a true story so in my eyes it rises above any accusations of emotional pulls.",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watch the YouTube 60 minutes vid instead",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "starts off a little slow, then it gets sad, very sad, then wonderful",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Lion\" is an ode to accomplishing the impossible.  This unconventional journey is so unbelievable that if it wasn't a true story, it would be way too farfetched for audiences.  It is an amazing example of how the Internet has created endless possibilities for communication and research in a way that changes lives.  From the moment that I first saw the trailer, this became one of my most anticipated films of the year.  It actually did not meet my expectations, but my frustration with this year's weak Oscar class has led me to approach many of the films with high hope-filled expectations that this will be \"the one\" to redeem 2016.  The storytelling grew a bit muddled at the start of Saroo and Lucy's relationship, shifting focus away from the adoption and search for his family.  Still, the film hits all of the right emotional notes to bring this story to life.  The train sequence and crowded train station in West Bengal are a heart wrenching introduction to Saroo's turbulent journey.  The sad piano score by Dustin O'Halloran and Hauschka highlights each dramatic moment throughout the film, especially the ending scene which I consider to be the most beautiful moment in cinema for 2016.  The score was nominated for an Oscar, as were the performances by Dev Patel and Nicole Kidman.  Their acting drives the second half of the film through the strong emotions of sadness and pain, but the real standout is 8-year-old Sunny Pawar.  At first glance, it seems odd that Patel's nomination is for Supporting Actor but it makes sense as Pawar carries the entire first half of the film on his shoulders.  His chemistry with Abhishek Bharate (who plays his older brother Guddu) and ability to advance the story through his mannerisms (since a 5-year-old character in a country that doesn't speak his language leads to limited dialogue) is as good as many veteran actors.  I understand Rooney Mara's presence in the film because this is a true story, but Saroo's disconnect from his mother AND his girlfriend is redundant in shaping his character.  The Oscar-nominated cinematography does a brilliant job of capturing the landscape of India, the grim areas of Calcutta, and the beauty of Tasmania, but my favorite part of the entire film may be the title.  I spent a good deal of time wondering why the film is called \"Lion,\" and saving the explanation for the final moment of the film enhances its poignancy tenfold.  It was an amazing final thought at the end of the film.  \"Lion\" is not a flawless film but it is a film that families can enjoy together, its incredible true story must be seen to believed, and the final result is an amazing buildup to the most beautiful moment in cinema for 2016.",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion is such a great movie. Based off of the true story of a young boy who gets lost far away from home when boarding a train, this movie really respects the story and is very accurate to the true event. The movie is very emotional at times but unlike a dog's purpose, it doesn't just make you sad, the movie lets you feel a true emotion. Not just make you sad all the time. The acting was great in this movie a long with everything else in my opinion. It's so sad to see that a great movie like this doesn't get the full attention it deserves. This movie is like the small one that ends up being great. Over all this movie is just amazing. Worth buying on blu ray and seeing in theaters. Can't wait for blu ray release.",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although Dev Patel and Nicole Kidman deliver great performances, the cliché-filled script and slow direction make Lion a ride worth watching for it's emotional charge as long as you have the patience and time to sit through it.",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion was directed by Garth Davis and tells the true story of Saroo (portrayed by Sunny Pawar and Dev Patel), an Indian boy who gets lost away from home and ends up in an orphanage. After growing up with an Australian couple that adopted him, Saroo begins using the internet to find his home.\n\nAdapting a true story onto the big screen is always a difficult task because there will always be people chomping at the bit to attack any, erherm, alternative facts. I went into watching this without reading up on the true story because I didn't want to be one of those people. The first 40 minutes of this film are beautiful. Sunny Pawar is a fantastic child actor and demanded empathy. Not to be outdone, Saroo's adoptive parents, played by Nicole Kidman and David Wenham, deliver great performances. The movie is gorgeous and filled with beautiful establishment shots of India, and the film score perfectly blends in with every scene, tugging at the heartstrings.\n\nWhile a lot of this movie is fine, the bad gets pretty darn bad. Dev Patel was okay, but he was a huge downgrade from Sunny as the older version of Saroo. Personally, I would have rather seen Sunny nominated for the Oscar over Dev, but that wouldn't have sold with the Academy. Part of the reason Dev was a downgrade was because of his character's girlfriend, played by Rooney Mara. I've liked Mara in the past, but she was obnoxious and generally unlikable in this movie. The middle act, focusing on their relationship, was so melodramatic that it completely took me out of the movie, rendering the emotional finale ineffective in my eyes.\n\nIn the end, there are a lot of great things about Lion, especially its film score and the performances by Pawar, Kidman, and Wenham. However, convenient plot points and the lack of chemistry between Patel and Mara drag this movie down a bit too far. If you like the feel-good movies, you'll probably be able to overlook these facts. For me, I couldn't move passed Dev staring at a computer screen.\n\nFinal grade: C\n\n-Ben",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion is directed by Garth Davis, and it stars Sunny Pawar, Dev Patel, Rooney Mara, David Wenham, and Nicole Kidman in a biographical film about a Hindi kid that got separated from his brother at a very young age, and when he got himself in a new home with an Australia family, he never stopped thinking about it and wants to find his way back home to find his mother and brother. This is the first movie out of all the Best Picture Nominations for 2016 where I got no knowledge from critics that I like watching, except for Brad Jones, but I didn't realize about it the day after I finished the film, and I haven't watch it, which I'll do this review first. So for this movie, let's get on it. I was starting to realize why Dev Patel was nominated for Best Supporting Actor as half the film is about Saroo Brierley in his young age, and the movie starts to get interesting when he gets alone as it felt realistic, and you feel sorry for the kid already that you wonder about how he's going to go through this. Sunny Pawar is great in it that I'm surprised this film is his debut as a child actor, and he gives off tons of emotional moments that will give a feel from the viewers. The writing by Luke Davies is well-written that connects the two stories very well, and understands about how Google Earth works. The second half is just as good as the first act as Dev Patel gives a great performance as he was trying to be happy here, but still can't shake the fact about his past after meeting some Indian people, and Nicole Kidman is also pretty good that she even has her great acting moment that's close to the end. The score by Hauschka and Dustin O'Halloran is very good that it sounded soothing and relaxing for the film. Critics say that the film is cliched, and I agree with them, but the way that the movie executed with a great story and has heart in it, felt like it's telling them for the first time. Lion is a fantastic film that I was glad it got recognized that got me to see it.",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's hard not to be emotionally invested as you watch Lion, but in the end it all pays off.",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this was a fantastic movie. Very interesting an well-directed. A must watch",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great look at the chaos that is India. Excellent work by Dev Patel.",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It a great film almost close to being perfect. The story grabs you and won't let you go. Great acting ! One of the years best.",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful story of heroism, courage, love, and foreign adoption.",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Emotional, smart, realistic and just so powerful, Lion is a masterpiece of a film. It features such terrific performances with Nicole Kidman being particularly outstanding, it is beautifully shot, so well edited and directed and it features excellent, thought-provoking dialogue and a great message. It showcases both pros and cons of adoption, but that eventually it is a beautiful decision. Everyone can relate to this movie as Saroo's journey is amazing and heartbreaking and it is all the more powerful having in mind that it really happened. It is one of the rare movies that made me cry and it is quite possibly the very best film of 2016.",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very well done version of a very well worn story. Could have been cringe worthy but was not.  Well acted by all, with no over preening monologues. And beautiful to watch.  If you like this type of story you'll love the movie.  If you don't, you can go with friends and not hate it.",
            "review_date": "2017-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film makes you want to forgive and forget ANY problems you may have with your family. A lovely word \"Amee\" someone we so often take for granted.",
            "review_date": "2017-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An almost-perfect movie about determination and perseverance. Everything excels.",
            "review_date": "2017-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lion takes the basic formula that define most of those Hallmarky inspirational movies, but gives it the superb acting talent and production values it needs to succeed, forsaking stupid convenient writing for smart convenient writing.",
            "review_date": "2017-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie I've seen in 10 years, absolutely fantastic, seen it twice already. A must see!!",
            "review_date": "2017-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "literally the best movie I've ever watched",
            "review_date": "2017-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome story very moving ??",
            "review_date": "2017-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Lion\" is a film that essentially preaches for simplicity, he wants to do his homework, pass on his message, thrill the audience and it's over, but at some point he tries and ends up being deeper than he is. Here we have a bibliographical, linear script that does not attempt to deceive the viewer with subjectivity or parallel timelines, as I said, he preaches for simplicity to tell the story of Saroo (Dev Patel), a 5 year old boy who gets lost in his Brother at a train station in Calcutta, and after being adopted by an Australian family tries to find his family 20 years later. The setting of the film in its first act is so honest and simple, it is extremely captivating and beautiful, director Garth Davis spends an air of attachment and complicity, blending the violence and innocence that is a beautiful thing, pity that his second act is the Opposite that, with a beautiful photograph in its first act, dark and highlighting the elements of the screen, the rest of the film opts for something lighter and blending the shades of blue with a simple track and a camera that is often used without a tripod The film technically only pleases. The performance of Sarro is wonderful, but Dev Patel does not impress as Saroo, he does not pass the air of lost or desperate and alone does not raise the dramatic charge, and were it not for the good construction of the script, Patel would not make us dry The eyes at the end of the film. We have here a movie that has a great first act, a second act too elongated with many repetitions of idea and bad construction of characters (Only Sarro is built) and a third that is short, but extremely beautiful and precise, and is always very sensitive Of the director showing pictures or videos of the events has put film, served to spend more wipes, \"Lion\" is a good movie that fulfills its role.",
            "review_date": "2017-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must see film.Brilliant acting from the little boy who played Saroo as a child.",
            "review_date": "2017-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its a well made film, but it was longer than it had to be. The little boy was adorable. Pulled heart strings, and opened tear ducts. It was a bit too simple for me to be considered best pic, but it was nominated on the emotional vote.",
            "review_date": "2017-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok, I can see the hype. This movie is well-acted and told. Nice performances by the cast but visually it was quite captivating as well. I think this director is relatively new on the scene and if this movie says anything, I look forward to his next. One gripe, what was the purpose of Rooney Mara? I mean, yes she serves as a mirror character but her large presence in the marketing material is so disproportionate to her actual role that it was a bit disappointing. I hope film makers realize that a good movie will get audiences even without big names.",
            "review_date": "2017-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, emotional, cinematic & confronting of India's perils for children, but I felt it matched Slumdog millionaire (unintentional) with Dev Patel playing both lead characters, too closely.",
            "review_date": "2017-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved everything about it - acting,photography,story line & a good dose of realism.",
            "review_date": "2017-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4.5*\nOf all the Oscar-bait crap I've seen this year, Lion was by far my favourite.",
            "review_date": "2017-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed lion, but i wished i saw more of Dave Patel and Divian Ladwa. I thought some scenes of young Saroo where innecesary,the could´ve perfectly repleaced those scenes with other ones revolving the family´s relationship across the years, or Mantosh´ illness, but overall i actually enjoyed the film. The cinematography is astonishing, beautifuly acted, and gets you emotial. It explores adoption and the experience of joining a new family, a rich subject that is done extremely well in this film, and i am hopeful it can be seen in other films as well.",
            "review_date": "2017-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a beautiful first hour. and uneven middle. and a beautiful ending",
            "review_date": "2017-02-17",
            "source": "rt",
            "lang": "en"
        }
    ]
}