{
    "rating": 7.8,
    "release_date": "2016-12-16",
    "num_reviews": 509,
    "genres": [
        "Drama"
    ],
    "summary": "After the death of his older brother Joe, Lee Chandler (Casey Affleck) is shocked that Joe has made him sole guardian of his teenage nephew Patrick. Taking leave of his job as a janitor in Boston, Lee reluctantly returns to Manchester-by-the-Sea, the fishing village where his working-class family has lived for generations. There, he is forced to deal with a past that separated him from his wife, Randi (Michelle Williams), and the community where he was born and raised.",
    "reviews": [
        {
            "content": "Welcome to the world of the story-free movie!\n\nNo spoiler alert: The movie is so spoilt, no alert can spoil it further. Here's the story: A guy's brother dies. He's upset. He's also uncommunicative. He acts out once a tiny bit, once a little more. There are some matters like a divorce, a nephew, and a boat. There are kids, young people, middle-aged people, and old people. People talk; some talk more, some talk less. —And that's it, folks!",
            "review_date": "2023-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely gut wrenching, has high ability for a rewatch. This movie tugs on the heartstrings in ways unimaginable. What happened in this movie, could happen to anyone. Will be recommending to others, and rewatching this myself.",
            "review_date": "2023-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic film. Great performances. \nIncredible cinematography",
            "review_date": "2023-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A slow and deliberate drama that makes good use of mundane situations and boasts some very natural dialogues. Doesn't sensationalize its subject matter and handles it with care. Because of its pacing it does slip into being dull sometimes, but overall it leaves a very human and very thoughtful impression.",
            "review_date": "2023-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Being from the Boston area and being between homes as a kid really made this movie hit hard for me. Was disappointed at first. But thinking back on my viewing experience I really appreciate this one. Lee really tried to make it work, but ultimately couldn't, interesting twist when you really thought he was gonna stay at one point.",
            "review_date": "2023-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst movie I have ever watched.",
            "review_date": "2023-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very long, very slow, very boring. If you have the patience to watch the whole thing, perhaps there’s a payoff. But man, you’re going to earn it. This movie is sloooooowwwwww.",
            "review_date": "2023-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Personally I think the other reviews are wrong and there isn't alot happening in this film it does not deserve a 5 star rating at all.  It got to a certain poin  I thought it might start getting good but only to be let down by very few notable events sorry say",
            "review_date": "2023-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"| Ratings Categories |\n{Characters (8.5/10) ; Cinematography (9/10) ; Plot (8.5/10) ; Acting (9/10) ; Pacing (8.5/10) = 87%}\"",
            "review_date": "2023-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best acting performances from Casey Affleck and Lucas Hedges! With the best movie screenplay ever written!",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have no understanding of why this movie  has such great reviews.  I'm so upset about the chunk of life wasted watching this, that I will never get back.  If you want to be terribly sad and bored....with no conclusion to be found, this is the movie for you!",
            "review_date": "2022-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5 years ago- A strong performance from Casey Affleck is brought further by a terrific, understated screenplay, beautiful direction, and a achingly morose tone.",
            "review_date": "2022-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very Sad But Fantastic film.",
            "review_date": "2022-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing and heartbreaking film. Highly recommended. There is a scene well towards the end where Affleck and Williams meet which is, I think, one of the most superbly acted I have ever seen.",
            "review_date": "2022-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Look I understand this movie is highly rated. Was the drama well written? Yes. Actors performance? Stunning. However! I like more flow to movies, that I can have even the slightest idea of where it's going or at least the overall goal. Didn't get that here. Personally, this was much too drawn out, the soundtrack was a bit haunting (maybe that makes the movie better, I don't know) and the ending left me feeling exhausted. I suggest you watch a show, movie, or youtube video before going to bed so you don't have weird dreams that night.",
            "review_date": "2022-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's just fantastic to watch how the film manages to show the character's suffering.",
            "review_date": "2022-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie so fucking much I wanna kill myself. Gets even better as I think more about it in retrospect. Made me cry a river.",
            "review_date": "2022-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most powerful movies I've ever seen, what a traumatic movie.",
            "review_date": "2022-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slice of life stuff. Lacking in joy. Insightful. Our past makes us what we are.",
            "review_date": "2022-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It pulls at your heartstrings a bit before taking a vice grip to your heartstrings, then turns it up a bit more for good measure.",
            "review_date": "2022-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "These characters aren't exactly likable, perhaps Casey Affleck's character is similar to an anti-hero but this bleak look into a fractured family trying to cope and adapt to their loss is mildly fascinating. Almost feels like one of Atom Egoyan's earlier pictures.",
            "review_date": "2022-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent movie to watch on a rainy day.",
            "review_date": "2022-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great movie about family and loss",
            "review_date": "2022-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film is a good film if you are looking for a quiet, angsty character study.  It does what it does very well, with good performances, and a drawn out reveal of what came before.  You kind of get the feeling there is some extemporaneous material here, and that this might actually be how real people would react to these events.  It reminded me a bit of that other Casey Affleck film where he has to protect his daughter from all the rapey men, but much more understated.  That all said, this isn't really my type of film, it was bit too long, and didn't really have an ending (like real life?)",
            "review_date": "2022-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The acting and directing was impeccable, the photography was great and it kept me on my toes. The ending and all of that made me feel a bit empty tho, like, what was even the point of it all? I don't know why it's so INCREDIBLY hyped up but I can see why people admire the work behind it.",
            "review_date": "2022-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One off the best movies after Breaking Bad and I, Tonja",
            "review_date": "2021-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Manchester by the Sea has one of the most emotional stories I've seen in a while.\nThe script was really great and so was the cinematography and music.\nCasey Affleck delivers his best performance as the main character.\nThe rest of the cast was really good as-well especially Michelle Williams and also Lucas Hedges.\n\nThis movie is a masterpiece in my eyes and I definitely recommend watching it.",
            "review_date": "2021-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie of 2016. I love the way it unfolds with new layers of psychological depth being added to the main character as his backstory emerges. This film has the power to make a grown man cry.",
            "review_date": "2021-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie of that year! Simply splendid. The acting and directing and writing are beautiful. My pick for Best Picture over Moonlight.",
            "review_date": "2021-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this movie is slightly overrated. Yes, the performances are good, but was it really Oscar worthy? The whole film is built around a scene where a woman tells a man she forgives him for the horrible thing that happened in their lives, a phenominal scene, but the rest of the movie is just okay. The story dragged a bit and characters are a bit annoying at times. That said, the cinematograph and editing isn't bad.",
            "review_date": "2021-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good but far from perfect. Almost all of the characters were unlikeable, although I felt some sympathy for the main character, even though he was clearly a moron. The boy was especially intolerable, and his girlfriends weren't much better. As for the plot, the main plot point wasn't predictable, and the writing was well executed in terms of providing increasing amounts of detail as time went on, developing the main character. However, it did feel somewhat uneventful and repetitive (e.g. predictable bar fights), there was quite a lot of needless swearing, not much was learnt about the brother, the flashback transitions were a bit confusing, and the ending could've been better, although I get the message they were going for. The film also dragged on in places, and the tone was pretty miserable, but I didn't find it had much emotional impact on me as a viewer, probably because of how easy it was to hate the characters. On the other hand, the acting was strong, the cinematography, visual effects, and editing were above average, and the classical soundtrack was pleasant.",
            "review_date": "2021-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Had a very powerful punch emotionally, one I haven't seen replicated in many movies. Warning, you will cry.",
            "review_date": "2021-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 20 percent in here that dont care for the movie and claim that it was a “waste of time”. Little concerned for your “mental capacity”. This was a film. Great one. Its Ok i really enjoy both of the Guardian of Galaxy movies as well but maybe some should just stay in their lane and stick to those. Maybe dont rate movies if they are a little too heavy for you or a little over your head. ",
            "review_date": "2021-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was on of the worst films we ever watched. We laugh now when we compare horrible,  waste of time films to this one. It's always, \"yea but it was better than Manchester by the Sea\". Says it all doesn't it.",
            "review_date": "2021-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great characters. As life is in tragic times.",
            "review_date": "2021-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good shit, heavy shit but good shit. I get him like I really get him.",
            "review_date": "2021-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a wonderful film all the way through.",
            "review_date": "2021-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Deeply affecting, one of those rare unforgetable films.",
            "review_date": "2021-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Waste of almost 2 hours.  Edit please.  Every poignant and \"artistic\" image does not deserve 5 minutes.  Keep the story moving. Start with a good script.",
            "review_date": "2021-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Drags in the middle, unfortunately. It pains to say that, because Lonergan crafts a really morose and effective tone through the superb performances of Affleck and Williams. Some of these scenes really twist your insides and reduce you to near tears due to their realism and raw emotion. I was less sure of Hedges, and felt that the experience became weaker when he was on the screen due admittedly to some weak and random plot points that included his multiple girlfriends and them having sex practically in front of their guardians. Ultimately, the two hours waste little, but become aimless as time drags on and it becomes clear that the conflict does not evolve or strike profound evolutions in the personages. The characters, especially the protagonist, pique interest enough to ensure that Lonergan's skilled work, along with a magnificent score and a unique New England setting, and that the attention and awards given were not completely undeserved.",
            "review_date": "2021-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Manchester by the Sea\" is not as deep and emotional as I thought going in. Not one moment really grasped my attention. The movie was good  don't get me wrong, I just felt like it lacked that one thing that I needed to really enjoy it. Casey Afflek was fantastic tho. Totally deserved his Oscar.",
            "review_date": "2021-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of those films set against tragedy that exudes the complicated joys of life.\n\nThere are moments so raw that it feels like watching real people. The misunderstanding of \"okay let's just go\" and Casey Affleck's detached arrival to the hospital after his brother died to the inarticulate, stammer-filled conversation between Lee and Randi toward the end of the film are perfect examples. The performances are similarly raw, and so it draws you into these people's lives. And as we watch the aftermath of one tragedy unfold, the perfectly interwoven flashbacks shed light on a past tragedy that colors who Lee is today. [SPOILER]: the scene in the precint where Leo goes to shoot himself with an officer's gun and yelps a \"please\" as he's wrestled to the ground is one that moistens the eyes. \n\nIt's painful to watch a broken man resist self-forgiveness and avoid companionship with his remaining friends and family. This film is an authentic representation of that, and that's a credit to the writing and the performances.\n\nI felt it dragged a bit toward the end; I noticed that I was less engaged than I was in the first hour. But it's still a powerful film. This medium is about fostering empathy, and Manchester by the Sea skillfully executes on that promise.",
            "review_date": "2021-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We all grieve, but in different ways. Manchester by the Sea captures the emotional depth of grief.\n\nAfter watching, I feel grateful for the life I have right now because I don't know if I would be in Lee's shoes. I can't possibly imagine how he stands up for himself after his family's tragic events.\n\nIn any case, it was a fantastically emotional film to watch, particularly if you were alone. The script for the film was excellent. From beginning to end, Casey Affleck gives such an excellent performance as his character that you can really sense his emotions.\n\nFurthermore, it was a very entertaining viewing experience that deserves appreciation.",
            "review_date": "2021-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good story.  Terrible parenting.  Useless end.  I hate ends when nothing happens.",
            "review_date": "2021-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only film to make me weep thus far.",
            "review_date": "2021-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Words can't describe how much I love this movie. Soundtrack to cinematography and everything in between, there has never been a more accurate and emotional depiction of contemporary New England in cinema. Casey Affleck gives, in this film, the single best acting performance I have ever seen. Period. \nThis is one of, if not my favorites movie(s) ever.",
            "review_date": "2021-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect movie for a gray day! This film feels a little long and the editing/cinematography could use some work, but the acting is award-worthy! It is definitely Casey Affleck's best work and also a wonderful performance by Lucas Hedges!",
            "review_date": "2021-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie for its mood and cinematography. I love the way the shots are captured throughout the movie, making everything feel so real. Sometimes the interactions are a little drawn out, but it adds to the feeling of all dialogue mattering. Casey Affleck did a great job, although at points I felt he was too detached, even for a guy who's kids died. The point is, this movie is not perfect but it is pretty close to it because of its intricate story and great cinematography.",
            "review_date": "2021-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lulls you into real heartbreak",
            "review_date": "2021-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'd give it about a 75%. Moving story. Case Affleck's backstory is traumatizing and you understand why he is the way he is as you see more flashbacks. But he doesn't seem like a very good person, justifiably or not. Pretty sad and somber. Low on the rewatch scale.",
            "review_date": "2021-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its like In Bruges minus the crime.",
            "review_date": "2021-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is quite solemn, with its heartbreaking backstory and chilly filmography. Definitely not a family movie, but that's what I like about it. It reigns true to how sometimes life is incoherently tragic. For me, the highlight of this film was Michelle Williams' performance - just moving.",
            "review_date": "2021-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For once the summary and preview image were wrong and that was a good thing.  Dead brother movies are usually fun for me because they're usually about the big brother and I am a big brother so...this was pretty good.  I felt it was very accurate in it's portrayals and very relatable for the brotherhood.  Unlike a chick flick... it is not as dramatic a situation as you might think when it's dealt with by brothers and not sisters, just sayin'.",
            "review_date": "2021-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dark. Dark and heavy and cold, but with a very very good story. Well done.",
            "review_date": "2021-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A phenomenal acting by Affleck (the rest of the cast delivers too!) paired by a meticulously detailed script makes a terrifically dramatic story believable and honest. A great movie.",
            "review_date": "2021-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Masterpiece ,brilliantly written and directed  ,with oscar worthy performances from a great cast.",
            "review_date": "2021-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies I have ever seen I can not fault it. The acting from every single character was spot on and it's definitely Casey Afflecks best performance no doubt about it. Great cast and a great story. The Oscar was well deserved.",
            "review_date": "2021-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Literally the worst movie I've ever seen",
            "review_date": "2021-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After his brother's death, Lee Chandler is named guardian to his 16-year-old nephew, Patrick. This forces him to return to his hometown and confront his past.\n\nManchester by the Sea is one of the strongest/genuine if not the strongest/genuine drama films I have ever seen. A deep/sad story that the cast & crew made it 10x better and unique whether it's the directing, cinematography, or the acting. The film is absolutely great.\n\nThe script is very well written and unique especially when telling the backstory, it'll take you a while to release that this specific scene is a flashback which was a bad thing at the beginning of the film because it was casing a little bit of confusion especially when I didn't know the characters so well and who's who but after that it actually starts to be obvious and it starts to look like a very great way of telling a backstory. Each scene seems like it was written so well and in a way to take the audience on an emotional/dramatic ride, which the acting, set design, and directing made then even more emotional/dramatic. The dialogues were so REALISTIC and that's thanks to the great acting performances and the screenplay. I think without one of these elements, we would've not had this beautiful result, both of them worked together to give us such dramatic/emotional dialogues that would make the audience emotional.\n\nThe acting performance of each actor/actress was genuinely very well done. Michelle Williams didn't appear much in the film. But, when she did, she absolutely killed it. Lucas Hedges gave his role the nephew an amazing little unique touch, a great choice. And the incredible Casey Affleck who proved to everyone that he is so talented and can put on a performance that will live for ages.\n\nThe film's pace was a bit cold and slow which caused troubles in the first hour of the film and specifically before explaining the backstory. I felt bored a bit and didn't know where the film was going but after the backstory was explained, the film became much better and started to all make sense. \n\nManchester by the Sea is a \"must-watch\". If you want a deep/emotional/sad/dramatic film that has great acting performances, then this is the perfect film for you. \n\nMy rating is 9/10",
            "review_date": "2021-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RATING: A+  Director: Kenneth Lonergan \nIf I had the challenge to describe Manchester by the Sea in one word I guess I'd say \"Excellent\", cause really that is what this film is. The film's lead, Casey Affleck, is delivering an Outstanding Performance that is worth of all the award love he received. The Score, especially the 7 Minutes piece ( performed by The London Philharmonic Orchestra ) is really good and it fits really well with the Scenes we are seeing. Writer/Director Kenneth Lonergan has done an amazing job first with Writing the Screenplay and then with directing this film. It is heartbreaking and hard to watch at some points but I'm definitely gonna watch it again.",
            "review_date": "2021-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though I do think this movie is wonderful with its writing and acting, I will controversially admit that Casey Affleck's performance is probably the least impressive out of all the actors. It's not that he did bad, I just don't think he did a good-enough job to be deserving of an Academy Award.",
            "review_date": "2021-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This gut wrenching story is not for the faint of heart, but it's the most accurate depiction of grief I've seen in a film.",
            "review_date": "2021-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great acting and a beautiful story. Wasn't a fan of the open ending.",
            "review_date": "2021-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a great movie! Heartbreaking but so well directed, acted and written. Real life",
            "review_date": "2021-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kenneth Lonergan's Manchester by the Sea is a slow, deliberate, pensive film about one man's struggle in dealing with the demons of his past.  In order to take care of his nephew, Lee (Casey Affleck) is forced to return to the community where, several years earlier, a simple mistake led to a tragic and life-altering circumstance.  The film doesn't rely solely on dialogue to convey the anguish of Lee and those around him, instead relying on haunting imagery and lingering shots to show the pain and suffering of the characters.  While not an easy film to watch, it is a rewarding experience and will linger long after the credits have rolled.",
            "review_date": "2020-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies I've seen in a long time. Casey Affleck is brilliant in this role.",
            "review_date": "2020-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Casey affleck's performance is amazing. The acting and drama all throughout is great.",
            "review_date": "2020-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a must watch for me. Excellent acting from everyone is an excellent film.",
            "review_date": "2020-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's about life, not about narrative in the way we're usually spoon fed. It builds very slowly, is almost blasé about some truly horrific life events, and carries on at a quietly morbid pace. It supposedly matches real life - bad things happen; there is no known ending; work is often unfulfilling, etc, etc. The emotion builds as the movie unfolds.",
            "review_date": "2020-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "MANCHESTER BY THE SEA 10.0",
            "review_date": "2020-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Manchester By The Sea\" is a good movie and I can see why Casey Affleck got his Oscar, but besides his astonishing performance there really is nothing to add for this movie. The plot is really forgettable and I can't remember half of it, among side the fact that I have seen it yesterday. There is no decorations, so I can't judge them, music is very forgettable and no one besides Casey Affleck stands out. Yes there is a depressive tone, which keeps you hooked for some time of the movie, but other than that there is nothing up to it. This movie is a good watch if you want a good drama with a sad tone to it, but nothing else. There is no real thrill, although there were some good twists, they were not good enough for the entire movie. A very depressing and at some points astonishing movie, but very forgettable and I don't think rewatchable. A 7/10.",
            "review_date": "2020-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfectly told story. ",
            "review_date": "2020-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastically acted and filled with drama. Casey Affleck was tremendous and the relationship he has with his nephew here is worth watching. I don't think it's an all-time great but it was very good.",
            "review_date": "2020-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The storyline was very good, however the character development was weak. For example, the scene where the nephew was viewing his dead father had no emotion from any characters in the scene. The cinematography could have provided better expansion of the emotions each scene was trying to depict. Expanding the length of the movie would have given the opportunity to expand the depth of the story The actors were very good. I lay this one on the director.",
            "review_date": "2020-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Life goes painfully on after an unimaginable tragedy. Casey Affleck's performance is brilliant. He masterfully portraits a father full of grief, anger, guilt, and love.",
            "review_date": "2020-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Emotional, touching, and realistic, the film offers a good look into the sorrow of an adult and a child, while these coexist under new and difficult circumstances.",
            "review_date": "2020-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "performance chops by the leads and supporting all add up to a moving and dramatic film",
            "review_date": "2020-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Manchester by the Sea is a blunt yet heart-piercing drama that displays and develops a plethora of themes, especially those surrounding family, grief, and forgiveness.",
            "review_date": "2020-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Affleck does his job as the lead actor, but the writers created a character who became frustrating to watch due to his inability to speak like an adult, or even speak at all at times. While he was so broken by the death of his three young children in the house fire, he was never able tor recover what little personality he had at the beginning of the movie. \n\nWe can all sympathize with a tragic loss like that, but after a while, it became impossible to feel anything positive about him due to his \"tuning out\" on all those around him.",
            "review_date": "2020-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great movie, it has some really strong acting and a simple, yet so emotional, heartwarming story.",
            "review_date": "2020-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "oh my. what a bunch of yelling. ",
            "review_date": "2020-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of those movies that will get flack from short attention span viewers because it doesn't unfold the way you'd expect it to. This is a movie that is so real that it can be seen as a flaw. It's not boring, or uneventful, or drawn out. It can feel that way because it's not the usual cookie cutter, formulaic, predictable movie that's intended to be larger than life. In many ways it feels the same way that the characters feel and how anyone would feel while suffering the losses that the characters did. It's unorganized, unresolved, erratic, grief-stricken and emotional. This is one of the most interesting films I've ever seen and it's definitely worth the watch if you're not a surface level moviegoer.",
            "review_date": "2020-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A tragic story about ordinary people and how they cope. Slow to unfold but all the better for that, especially the dialogue-free scenes of the more harrowing back story. A challenging watch, beautifully filmed and acted, with a great soundtrack too!",
            "review_date": "2020-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "disappointing as it seemed like a one-hour movie that they dragged out to 2 hours as the story and characters evolve through flashbacks. I didn't really like the characters either, but, understood their grief in the story",
            "review_date": "2020-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The scene in the police station is heartbreaking, the music in that scene is perfect.",
            "review_date": "2020-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "brilliantly acted and directed! crushing story.",
            "review_date": "2020-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I could give 3 stars if the ending was better. There was no meaning behind the end. The movie was slow... The actors were great though. Not well written as many said.",
            "review_date": "2020-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I created an account just to give this movie 5 stars. Well done.",
            "review_date": "2020-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Manchester by the Sea is so carefully constructed that it is both heartbreaking and richly enveloping in equal measure. Casey Affleck's performance is subtle yet utterly masterful, providing a wholeheartedly convincing portrayal of the effects of life-shattering grief. Combined with Lesley Barber's beautiful score, this is a compelling drama that really resonates.",
            "review_date": "2020-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A rotten viewing experience. I can't for the life of me figure out why this film was so acclaimed.",
            "review_date": "2020-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can’t believe Affleck won an Oscar for this. His range is limited here at best. Restrained? Yes. That’s about it. This movie fails to deliver the emotional punches despite its soaring score.",
            "review_date": "2020-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I suppose the most disappointingly unresolved finale possibly of the decade can only detract \"so much\" from an ultimately excellently crafted film (both by Kenneth Lonergan and its cast of perfection).",
            "review_date": "2020-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful film about grief and how some people handle it better than others.  Sometimes you can't beat/get over your past mistakes and they will haunt you the rest of your days.  This film shows the coping mechanisms of a broken man. The acting is incredible and it makes you feel like everything in the movie has happened to you.  Very personal if you have had to deal with extreme tragedy.",
            "review_date": "2020-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A state of numb portrayed in a realistic way/setting",
            "review_date": "2020-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film starts and progresses at its own pace, capturing the essence of mourning and acceptance of different personalities, with a sorrowful Oscar worthy tone.",
            "review_date": "2020-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't believe the reviews and that this won the oscar. It wasn't terrible, but it wasn't great.",
            "review_date": "2020-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Phenomenally acted with 3 dimensional characters and dramatic heft.  I love the use of classical music to score certain scenes, being the only sound within them; characters talk but the dialogue is inaudible and muted.  It was pretty mesmerizing.  I do feel however that the movie's strongest section is the first 30 to 45 minutes.  After that, it remains engaging, funny in parts, relatable in others, but nonetheless kind of simmers down, mainly in terms of pacing.  Perhaps the run-time could've been trimmed down by 10 or so minutes as well.  I appreciated the concurrent storytelling style of showing Lee (Affleck) in his present state, and every now and then showing us the events in his life prior to the present story which shaped his character and personality.  Despite the few nitpicks and flaws, this is ultimately a very good movie.",
            "review_date": "2020-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie ended 20 hours ago, but I am still in it. Full of feeling.",
            "review_date": "2020-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Poorly constructed. Atrocious plot. No resolution whatsoever. Rotten musical score. If they had left out the f word there would have only been about 2 minutes of dialogue in the whole film. Terrible",
            "review_date": "2020-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good drama. The characters really make this movie; each one is unique and interesting, and I was generally invested in the stories of each. The plot is occasionally difficult to follow because the story jumps around through the lives of the characters, and it's not always clear when each scene takes place. It doesn't hurt the film much though, and I would definitely recommend it.",
            "review_date": "2020-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Touching without being overly sentimental. First class acting from the lead actors",
            "review_date": "2020-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Deeply moving performances. Exquisite choice of music, especially the parts composed by George Frideric Händel",
            "review_date": "2020-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Screenplay is well done, and several scenes from the film leave us breathless. Best performance by Casey Affleck",
            "review_date": "2020-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie presents a deep sad story about a man trying to beat your traumatic past, expressing the unhappiness that surround the protagonist. The only negative and most important point is the end, it leaves loose ends not presenting a conclusion, not even one imagine possibility.",
            "review_date": "2020-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While this movie is well acted, and even well written, it is incredibly heavy and difficult to watch, and the hopelessness never lifts.",
            "review_date": "2020-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An emotionally devastating movie. Casey Affleck gives one of the finest performances ever put on film. He lives the agonized character in a way that will haunt you for a long time. Brilliant fim, one of the best I've ever seen.",
            "review_date": "2020-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I felt a great variety of emotions when watching this movie. I laughed at times, felt hopeful at times, and cried a few times. The emotionally stunted Casey Affleck plays a tremendous role of a father who can not get over a heinous mistake which caused the death of his children and leading to his divorce. Years later he finds himself in a position to take guardianship over his nephew after his brother passes. Acting by all is incredible, especially the scene where Michelle Williams and Casey Affleck meet and she has her new child with her. The muted tones of the north east USA fits the somber mood of the film extremely well. The choice for it the actors to have heavy Boston accents and carry the \"tough guy\" Boston mentality makes the softening of Casey Affleck even more heartbreaking. This is a fantastic movie of two men figuring out a tough time together.",
            "review_date": "2020-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptional, impressive, and doesn't end.",
            "review_date": "2020-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A gently paced, sometimes darkly comic, powerhouse flick where Lonergan's steady hand elevates a fairly mundane, borderline generic idea, into something palpable, strangely energetic and genuinely engrossing. It's not just a performer picture, there's some excellent writing and directing, some neat, easy concepts, and a very likeable use of naturalistic sound. \nIt's a film that can't fully be jusdged until it's complete. It's raw and emotional but not uncinematic. It's a film about not all the pieces of a soul fitting back together. But a few pieces fall into place and that's enough to keep going. It has a contemplative and bittersweet ending.",
            "review_date": "2020-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring, depressing too long. This is the The Emperor's New Clothes for pretentious movie critics.",
            "review_date": "2020-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first movie I walked out on. It was just stressful, uneventful, and I just didn't see the point. It just felt like watching a daily vlog of two depressed people that had no editing.\n\nThe most entertaining part was when the chicken fell out of the fridge, which I got for free in the trailer.",
            "review_date": "2020-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's absolutely stunning, a masterpiece of pain",
            "review_date": "2020-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sometimes it feels like some movies exist for the sole purpose of being sad.\nThis movie has one spectacular scene between exes on the street. Its brutalizing. Its probably worth watching the movie just for that scene. \n\nMichelle Williams is one of the best actors in the world. Casey Affleck did a great job as well, but I think sometimes fell too much in love with subtlety. \n\nOverall, the movie was undoubtedly good, but its just too illusive to be great.",
            "review_date": "2020-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a great movie. 100% recommended.",
            "review_date": "2020-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very resonating movie, deeply moving. One of the best movie of this decade..",
            "review_date": "2020-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Affleck puts in possibly the best performance ever by an actor on-screen in this gritty, heartbreaking tale of guilt. A film you might only ever watch once, but will stay with you forever.",
            "review_date": "2020-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A compelling story that will leave you more heart broken that any movie prior. Manchester by the Sea's lack of anything encouraging will leave you depressed but still impressed with its narrative.",
            "review_date": "2019-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliantly assembled, perhaps doesn't quite satisfy fully by the final credits.",
            "review_date": "2019-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "could see my sadness on screen",
            "review_date": "2019-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cinema of feelings, which from its dramatic tension, flows with valuable humanism",
            "review_date": "2019-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very moving look at the struggles on a man (and his family) who must endure tragedy and heartache. One of the most divergent set of reviews I have ever seen with ratings mostly in the one-star or five-star categories. I’m much closer to the 5-star view. ",
            "review_date": "2019-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my mind's eye, \"Manchester By The Sea\" deserves its praise at the arthouse and filmmaking levels, as it is a poignant examination of human grief that is hard to touch. But perhaps like few other films in history have, it also epitomizes the rancorous gap between the erudite grading scale of Academy Awards voters, and the public's desire to see their most joyously-consumed films be deemed worthy of cinema's highest accolades. It's likely the true fire starter film to the Academy's proposed inclusion of an \"Outstanding Achievement in Popular Film\" award.\n\nI personally found Casey Affleck to be very solid but short of mesmerizing as a janitor forced to care for his deceased brother's boy. I enjoyed the film itself far more than the collective acting. But regardless of the nits and gnats, The Academy's recent consideration to recognize blockbusters -- while largely frowned upon by alarmist film snobs -- is perhaps it's the best conciliatory olive branch available, allowing fine films like \"Manchester By The Sea\" to earn its deserved recognition, yet not without an equalizing tip of the cap to public sentiment.\n\nThis is a very good movie that falls short of an eternal masterpiece, and perhaps might be best remembered long-term by its contribution to a larger public debate between the need to champion great storytelling while also allowing the voices of the masses to also be heard.",
            "review_date": "2019-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my favorite movie. It's one of those that makes you think about the ending because it never truly resolved. Or maybe it does, but you have to decide if it's the best option",
            "review_date": "2019-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies.",
            "review_date": "2019-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Manchester by the Sea is pretty much perfect.\nI just wish it was also good.",
            "review_date": "2019-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've never been the type of person to stubbornly decide whether or not I like a movie prior to giving it a real chance. In fact, I feel I am the opposite—I do everything I can to retain an open mind throughout the entirety of a film in order to ensure I'm taking the entire production in and giving it a real chance. WITH THAT SAID, it took every ounce of willpower I had not to leave the theater in the middle of watching the nothingness that is Manchester by the Sea. Now I'll admit that parts of the movie certainly did provoke emotion, but those THREE thought-provoking minutes didn't make up for the painfully dull remainder of the film. I kid you not, the entire theater walked out at the end with stunned looks of confusion as to what we just watched and why we all sat through the blandest few hours of our lives in order to see if it maybe got better. For the life of me I cannot understand why the ratings are so high for a movie that could double as a sleeping aide. ",
            "review_date": "2019-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is not exactly pleasant to watch. It's quite brutal to watch what Casey Affleck's character is going through. It's certainly well made and well acted. The scene with Lee and Randi towards the end is especially heartbreaking. Matthew Broderick felt a bit out of place here. I don't know what it is about depressing movies from the Boston area (Mystic River, Gone Baby Gone, etc.)...",
            "review_date": "2019-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very real; great acting; very sweet, very moving.  Beautiful scenery.  I WISH the ending had been a little different... but I guess it was meant to leave it up in the air for your own imagination.",
            "review_date": "2019-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"What they don't tell you about depression is that sometimes it feels a lot less like sadness and a lot more like the emotional equivalent of watching paint dry.\" —Alexis, Tumblr\nPerfect way to describe this movie... watching paint dry...",
            "review_date": "2019-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was very disappointed with the movie.  I had very high expectations and the movie didn't live up to them.  The acting was very good especially Casey Affleck and Lucas Hedges.  I am very big on a movie ending a movie well, and this one did not.  It just sort of ended. I sat there thinking wait, that's all.  Another Oscar nominated film that disappointed.",
            "review_date": "2019-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Forced acting, forced accents. Casey Affleck would’ve NEVER been famous without his alcoholic big brother Ben Affleck. Casey’s about as talentless as Channing Tatum, both always plays flat characters.",
            "review_date": "2019-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies ever! ",
            "review_date": "2019-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent except the end was dumb",
            "review_date": "2019-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect opportunity for an uplifting ending after an incredibly depressing movie. The filmmaker swung and missed. I want a movie to entertain, evoke strong emotions and make me think. This movie didn't entertain, but it succeeded on the other two points: it was depressing as hell and made me thing, \"Why the hell did I waste $12 on this movie?\"",
            "review_date": "2019-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterfully written drama powered by powerhouse performances. Lee Chandler goes down as one of the most tragic in cinematic history and Casey's performance deservedly resulted in an Oscar. The movie's somber and pitiful mood is balanced with an authentic level of emotional humanity rarely achieved. Manchester by the Sea is a career defining masterpiece for writer-director Kenneth Lonergan and will surely go down as one of the most tragic tales in recent memory.",
            "review_date": "2019-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "loved this movie and the score was fabulous!",
            "review_date": "2019-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like life, this tragic story has its funny moments and it all comes together really well.",
            "review_date": "2019-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is so slow and boring.",
            "review_date": "2019-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it is extremely cotidian almost to a fault, its fully realized characters, along with its captivating atmosphere and soundtrack result in a moving cinematic experience. The actors do a fantastic job of bringing these characters to life and the world is believable, yet raw and bleak. It parallels the life of its protagonist in that it can be a chore to live through and becomes almost unendurable at moments, yet its central tragedy was so gripping as to overcome its otherwise subtle plotting and very slow development. TLDR: Pretty boring but super affecting and very realistic story about life continuing in the wake of immense tragedy",
            "review_date": "2019-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film affected me deeply. It was one of the best and most astute depictions of grief I've seen in a long time, heartwrenching and beautifully told. I loved the non-linear storytelling, and the scene towards the end with Casey Affleck and Michelle Williams was one of the most beautifully realized scenes ever committed to film. Haunting and brilliant.",
            "review_date": "2019-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For being Rotten Tomato fresh and having the actor of the year, the movie was a huge let-down... but it is a good film to watch.",
            "review_date": "2019-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A realistic take on loss. It has its awkward moments.",
            "review_date": "2019-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the sort of film that you have to watch in the right mood, if you don't want to be left broken and in tears or just plain angry. I came to the film as a fan of Kenneth Lonergan, his two previous films are among the best of the 21st century, so I was expecting dark and depressing material and a very flawed main character. The other expectation I had coming into the film was that it would contain great acting and this proved to be true as Casey Affleck and Lucas Hedges give beautiful performances. This is a film that deserves to be savored and it is filled with incredibly emotional moments that are painful to watch but have the sort of realism that clings to all of Lonergan's productions.\n\nLee Chandler, Casey Affleck, is a depressed janitor working in Quincy, Massachusetts who is called back to his hometown of Manchester by the Sea after the death of his brother Joe, Kyle Chandler. In his will Joe outlines that he wants Lee to become the legal guardian of his son Patrick, Lucas Hedges, and remain in Manchester by the Sea. Patrick and Lee bond as they struggle after the death of a beloved family member and while Patrick juggles multiple girlfriends and Lee's past comes back to haunt him. His inability to change leaves you frustrated with him and yet he is sympathetic in his complete lack of desire to confront his dark past.\n\nLonergan's screenplay, as with all of his screenplays, is very naturalistic in most of it's interactions with this being punctuated by moments of intense violence and emotional conflict where problems aren't necessarily dealt with. When Patrick awkwardly tries to connect with Lee he speaks like a real, immature teenager not like the precocious invention of a middle aged screenwriter. The actors deserve credit for their work in crafting these characters of course but they are given a tight, deliberate script to work with that forces them to act between the lines. The lack of dialogue that Lee receives conveys his utter hopelessness as Randi's monologue shows her own desperation and enduring love for her ex-husband, everything in the screenplay has been so well thought out that it's not surprising it won the Best Original Screenplay Academy Award.\n\nThe best part of the film is undoubtedly the performance of Affleck as he exquisitely portrays a broken shell of a man. Although I won't reveal what he is lost we do understand in the film that Lee was once a happy and fulfilled but still significantly troubled man. The way that we see him throughout most of the film however is as a man who refuses to express emotion for fear of the pain of his past fully resurfacing. His reticence hurts those around him as his selfishness and anger is displayed by Affleck's soulless eyes and tightly pulled lips. He never makes his character sympathetic but if he were to even attempt that the film wouldn't work and his unmoved posturing throughout fits the character perfectly.\n\nThe other standout performances, everyone in this film is great, are those of Michelle Williams and Lucas Hedges who each get moments to shine. Hedges get several arguments with Affleck to tear into and he manages to match him as their interplay with one another is spiky but loving, reminiscent of Sammy and Terry in You Can Count On Me (2000). His teenager is self-possessed, arrogant and very naÃ¯ve, in other words he is a normal teenager. Williams is incredible as she inhabits a character who may be even more traumatized than Lee and sells the pain that this woman would have held with her for years so well. I was awed by their abilities and completely believed in their characters and their motivations even when they made strange choices.\n\nThis is a great exploration of several troubled people with dark pasts who try as they might can't find it in themselves to change. It leaves you as hollow as it's main character but that's the intent of the film, understanding grief should not be a pleasant experience. This is a film that should be watched if you are prepared for an intense emotional experience.",
            "review_date": "2019-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An emotionally draining film, with exceptional character development and a realism that is hard to ignore.",
            "review_date": "2019-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Elusive as a film study, but brilliant as a character study, Manchester by the Sea is one of the most unique and affecting films of 2016.",
            "review_date": "2019-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really well written and outstandingly acted drama. Flashbacks unfold the full scale of the tragic events only by and by, but considering relatively little happens overall, the movie flows really well anyhow. There is a very authentic feel to it, that makes for a couple really amusing scenes amidst all the drama, too. Ultimately a very rewarding viewing experience, for which Affleck completely deserved his Oscar.",
            "review_date": "2019-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Forgettable movie for me. As Trump might say, it was just sad, sad and sad. Nothing that could leave any sort of emotional impact on me, not helped by an absolutely long, drawn-out script. Affleck was really believable though in some (very rare) moving scenes.",
            "review_date": "2019-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good Acting, Good Story, beautifully drama",
            "review_date": "2019-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A raw telling of grief, believable acting. Brilliant.",
            "review_date": "2019-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I donï¿ 1/2(TM)t understand why this too long movie about received so much praise. I enjoy Casey Affleck but his fairly one note character, while suffering a tragic loss, is pretty unlikable and uninteresting. Felt like was set up as Oscar bait.",
            "review_date": "2019-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn't like this movie at all, seemed pointless.  I liked Casey Affleck, as an actor.  What would have been nice, is a plot.",
            "review_date": "2019-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The coups de theatre not withstanding this is a profound piece of tragedy that gently reveals its devastating secrets, creating some unbearable moments, but never losing its dark sense of humour, and Affleck is brilliant in every scene (thanks in no small part to his co-stars).",
            "review_date": "2019-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Casey Affleck plays loner Lee, a man with a short temper and zero social skills.  He discovers after the death of his older brother Joe that he has made him sole guardian of his nephew Patrick. Lee returns to the town he grew up in to reluctantly take care of his teenage nephew, a place where he is confronted with memories that led to his separation from his wife and a tragic event from his past that will break the strongest of hearts when revealed. From here he struggles to be the person his brother hoped he would be for his nephew.\nThe film is a painful and tragic portrait of people dealing with grief and loss on many levels.  Casey Affleck was superb playing the lead, a man so broken from a tragic past that he refuses to let anyone get close.  It's not a film you will want to experience more than once but the film is so well written and acted it is worth hunting down.",
            "review_date": "2019-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful and haunting drama, anchored by a stunning and muted performance by Casey Affleck. Really connected with this film.",
            "review_date": "2019-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love casey Affleck movies,he's moody and good,this movie is well made and well acted, but it's to long,and at times ,sorry to say a little boaring, good but to messy",
            "review_date": "2019-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am never going to watch this movie again. boring as hell, none of the characters are memorable, acting was terrible, the fact that they gave best actor to a man that basically mumbles and acts like an asshole throughout the film does not mean he should get best actor. most overrated film people have talked about a man who dose nothing to change himself after basically being the cause of his children death. even the nephew is a total jerk that uses two girls for sexual benefits without them even knowing what he's doing and I'm suppose to feel sorry for him? It was also  awkward at most parts of the movie as well with the uncle fighting Wirth the nephew.",
            "review_date": "2019-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Manchester By The Sea is a movie about 2 irresponsible, selfish people who suffer a tragedy due to being selfish and irresponsible.  I mean really, she doesn't want to turn the central heat on because it dries out her sinuses?  Nope, just let the kids freeze.  And he won't turn back because he has to go buy beer?  Sorry, it's really sad and all, but totally avoidable.  The rest of the movie depicts the main character's grief and guilt, but does he do anything to grow and change?  No, he is just as self absorbed as he was before the tragedy.  Just because he stops partying does not mean he grew from the experience.  Instead he drinks and beats people up for no reason other than to relieve some of his pain and guilt briefly.",
            "review_date": "2019-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film, cried my heart out for the lead character Lee and the pain he carried.",
            "review_date": "2019-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despicable characters, a lackluster story, and confusing flashbacks make this a hard watch",
            "review_date": "2019-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "SURVEILLANCE does not qualify as FILMMAKING. This sucks.",
            "review_date": "2019-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So demonstrates how adversity can initiate self destruction and suicide ideation.  Beautiful film.",
            "review_date": "2018-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "FABULOUS! I was mesmerized by this film. I felt like I was reading a novel, there was so much to contemplate and digest. I did not know what to expect or where the plot would lead. Captured the complexity of life and tragedy in a masterful way. Excellent.",
            "review_date": "2018-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best film to come out of 2016. Casey Affleck turns in one of the greatest cinematic performances of all time. Excellent supporting cast as well. Direction, writing and characters are all front and center and you go along with a very dramatic but empathetic showcase. Well done by all!",
            "review_date": "2018-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even the greatest tragedies you can live your life... What acting, what scenario. One of the best films ever.",
            "review_date": "2018-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great and powerful masterpiece. Casey Affleck deserved the Oscar!",
            "review_date": "2018-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie of all time :)",
            "review_date": "2018-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Long, slow, torturous - it's a hard watch - but worth every second.",
            "review_date": "2018-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was solid.",
            "review_date": "2018-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Moving, emotional, and engaging. A genuine surprise.",
            "review_date": "2018-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent acting from Casey Affleck, Michelle Williams, and Lucas Hedges. Just a heartbreaking film, but one I feel would be worth watching again because of how nuanced Affleck’s performance was. ",
            "review_date": "2018-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Manchester by the Sea\" is making a name for itself as one of the greatest dramas to date with Casey Affleck's incredible performance and the amazing writing involved.",
            "review_date": "2018-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is a masterpiece.",
            "review_date": "2018-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. Was expecting a real tear jerker, but instead found myself bored to kingdom come. I know the film has a sad story line and is supposed to be depressing, but no, felt nothing. Yes, it\u0092s well acted, but the pace of the film is horrific. One more reason to hate the oscars.",
            "review_date": "2018-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movie ever, No story, nothing good, just a spiral of sad events. It was just a waste of time",
            "review_date": "2018-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "probably the most \"realistic\" movie I've seen too. Nothing seems scripted or fictitious. It feels like an infiltration of real life with a surprisingly epic score sprinkled on top. Glad for this mood recommendation from boxxy software.",
            "review_date": "2018-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Led by strong work from Casey Affleck, Manchester by the Sea is a subdued, thoughtful and relatable story about grief that defines genre conventions from what you’d expect.",
            "review_date": "2018-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "phenomenal acting by Casey Affleck)",
            "review_date": "2018-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "MANCHESTER BY THE SEA is one of the saddest, most arid films I've seen in years- but it is also one of the best films I've seen this decade. Casey Affleck delivers a phenomenal performance as a permanently damaged man who has to go on living the rest of his life after a shattering tragedy. This is real life realized onto the screen: it will go down as one of the essential American classics.",
            "review_date": "2018-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Phenomenal charactarisation and acting especially from Casey Affleck. That's how to make a melodrama.",
            "review_date": "2018-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring and pointless.   complete waste of time.",
            "review_date": "2018-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutly boring! My wife had to wake me up twice from snoring during this movie. It is just a long slow conversation with a changing back ground. The credits were the best part of this lackluster nap time production.",
            "review_date": "2018-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely incredible. Deep and very emotional, Affleck is just amazing in this",
            "review_date": "2018-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overrated. Slow. Kinda boring and predictable.",
            "review_date": "2018-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's emotional and raw, but it's so depressing a story, I don't know why it's a film. Where's the entertainment factor? If not entertainment, there should at least be thought-provoking ideas. Yet, it's just a lot of pain after pain after pain. That said, the acting is terrific. You will cry several times, and your heart will break in the key scene.",
            "review_date": "2018-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you want to make a realistic movie, Manchester by the Sea is the perfect example to take notes from. The camerawork is subtle and lets the characters live in the frame. The dialog is not poetic, there's a lot of swearing and interrupting and you feel like these people would actually talk that way. The editing is superb, taking a step back when it needs to, but enhancing some of the emotional scenes by mirroring the characters feelings. Now don't get me wrong, I love some good, old, loud ~ I drink your milkshake ~ acting, but I am so glad that an understated performance like Casey's won the Oscar that year. All in all, I am very happy with Kenneth's direction and what he did with the story. The only thing I'd like to have seen more of is Michelle Williams.",
            "review_date": "2018-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Manchester by the Sea is a heartbreaking, beautifully written film. The story artfully unfolds through a series of flashbacks. Casey Affleck's portrayal of a grief stricken man, angry at times, but empty inside, is brilliant.",
            "review_date": "2018-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful cinematography, use of music, compelling performances.  While everything was \"perfect\" and deserved every award recognition received, it didn't actually move me. While I logically see its merits as a complete and quality film, it left me emotionally wanting.",
            "review_date": "2018-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is pure art. The way characters are intertwined in the script is super enthralling. Screenplay is classic and cinematography is apt with nothing left unturned garabbing every opportunity for the sake of beholders.  \n\nCasey at his usual best. He moves around with such ease and isadorable in every single frame. The epitome is when he meets Randy at Joe's funeral service. Can't even say he has relied on underplay or method acting. It's just plain simple emoting by a gifted actor.",
            "review_date": "2018-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A gut-wrenching, depressingly realistic movie about dealing with grief.",
            "review_date": "2018-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Written and directed by Kenneth Lonergan which opens with Lee Chandler (Casey Affleck) bonding with his 12 year old nephew Patrick, while he is on his broher's Joe Chandler (Kyle Chandler) boat, We're then between flashes know more about Lee's life as the movie is progressing in which he ends up looking after Patrick in unsurprising circumstances in which his brother Joe dies in a cardiac arrest with nothing but a will, forcing his younger brother to look after his only son.  Winner of 2 Oscars for Best Performance by an Actor in a Leading Role for Casey Affleck and for Best Original Screenplay for  Kenneth Lonergan out of 6 nominations.",
            "review_date": "2018-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Me and my mom were sitting on the couch for too long waiting for this to end.",
            "review_date": "2018-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a drama film that I strongly suggest you do not miss. It includes some of the greatest acting for a lead role I ever seen in what feels like a long time. The film is simple but it's also hard to predict each step. \n-  Finesse Movie Reviews",
            "review_date": "2018-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i only gave this movie 1/2 star. after all the great reviews i was highly disappointed. the movie lacked emotion and was confusing with all the back flashes. only made it through 1 1/2 hours. almost stopped after 10 minutes but was curious what everyone thought was so great. still wondering.",
            "review_date": "2018-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Casey Affleck deserved his Best Actor Oscar.\n\nKenneth Lonergan crafted an emotional masterpiece. Beautiful panning cinematography, deep characterization, with the occasional bleak joke. Lonergan has made a modern day, New England tragedy with Casey Affleck diving into his role as the hopeless Lee Chandler. I highly recommend Manchester by the Sea, but be warned: you'll cry.",
            "review_date": "2018-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I could barely make it though the movie. it was lackluster at best. The story felt flat along with the indifferent acting.",
            "review_date": "2018-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While slow paced, Kenneth Lonergan's drama is well written and touchingly performed, special mention to Casey Affleck in the lead role and Lucas Hedges providing the other element of a particular interesting antagonist-duo, combining great direction towards psychological and emotionally-deep themes about loss and indifference towards humanity, that'll provide a simplistic-yet-profound tone worthy of the works of Camus, but from a modernized point of view.",
            "review_date": "2018-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Should have won Best Picture. Great performances. Truly touching story. An original drama for those who still appreciate too quality movies without special effects.",
            "review_date": "2018-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very disappointing movie. It's surprising that this movie got a lot of good reviews and people say it's great. It's not a great movie. Manchester By The Sea really let me down. Very overrated. The acting is good. But this movie really dragged a lot, and there was a lot of really unhappy moments that definitely made this movie become a disappointment. I absolutely do not recommend anyone seeing this movie at all.",
            "review_date": "2018-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A haunting, intimate story of redemption.",
            "review_date": "2018-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By far the most depressing and dark movie of the year. If you can watch this movie twice, you are a trooper.",
            "review_date": "2018-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Oscar season this year hasn't appeared very promising. After watching the Golden Globes, I felt even less interested. Coupled with the fact that it is mid-January and I've seen one movie in 2 months, and only one real Oscar-level contender, \"Hell or High Water,\" which was a disappointment, I haven't been very excited. Today I chose to see the one movie that promises to be a contender and actually looked interesting to me, \"Manchester By the Sea.\" \n\nAnother New England-centric drama by the Affleck/Damon clan,along with recent addition of John Krazinski, didn't fill me with a lot of hope. However, the trailer looked good when I saw \"Nocturnal Animals back in early November, plus the buzz and Casey Affleck's Golden Globe win sold me. Unfortunately, I wasn't blown away.\n\n\"Manchester By the Sea\" isn't a bad movie. It's head and shoulders above most of the drivel in theaters today. The acting is pretty darn good, the setting is lovely and the story has a lot of potential. For the newbie, Amazon Studios, which has been more hit than miss, it seemed like its inaugural legit hit. And, for the most part, it's been perceived that way with a 97% Rottentomatoes critic score. I simply don't get this. Again, the movie isn't bad, but it isn't anything special.\n\nI'm the first to criticize films that are \"too\" Hollywood. This movie isn't. \n\nI'm the first to criticize films that are too easy to predict. This movie isn't.\n\nI'm the first to criticize films that have perfectly defined bookend starts and finishes. This movie doesn't.\n\nI'm the first to criticize movies that have an ending that isn't an ending. This movie really isn't that either. \n\nSo...why is it barely above average to me? Well, \"Manchester By the Sea\" had some familiar story elements that have steered my emotions into places that stick with me long after the film is over. They make me go back to the movie and watch it over and over. It's these kind of elements that give richness to the characters. What's weird about this film, though, is while there is a lot of depth to the characters, the story is pieced together in such a way that you really don't fully grasp the depth of issues in Casey Affleck's character, Lee, until near the end. I'm guessing that's intentional, but at 2 hours and 15 minutes, it just annoys me. The movie is entirely too long with a myriad of inexplicable starts and stops that appear to lead nowhere. They seem to be placed in the story to explain certain pieces, but then are left alone. The result is a spoon-fed story that makes the emotions we are supposed to be feeling, artificial.\n\nThe plot has a ton of potential. It's rooted in a sad subject that the strong acting is capable of executing in a powerful way, but the story, or at least the editing, prevent it from doing so. Repeatedly. This choppiness and eventual petered-out ending left me feeling like this was a college film. Certainly not worthy of the Oscar buzz.\n\n\"Manchester By the Sea\" suffer under the weight of its topic. The characters trying to carry this story to its eventual finish line are frequently readjusting their place in it, causing ripples in the flow of the film, making it hard to fully appreciate the writer/director's intent.",
            "review_date": "2018-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movies do not get better than this.",
            "review_date": "2018-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow and sad and depressing. ",
            "review_date": "2018-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If I could use Casey Affleck’s suicide attempt in the film for myself, I certainly would whilst watching this movie. I was so bored and depressed while watching this movie, that I was googling Wheres Waldo images to spice it up a little. Horrible film, and horrible ending too... this is the white pita bread type of movie without soul.",
            "review_date": "2018-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First and foremost, I just have to praise the writing here, it truly is outstandingly good. From the genuine-feeling characters and realistic dialogue, to the very human story full of very human emotions and the lots of little things that make up life, 'Manchester by The Sea' is an all-out fantastic drama that tackles a very difficult subject with grace, sensitivity and a clever infusion of just the right amount of humour. The superb directing and acting from the immensely talented cast brings the writing to life, resulting in a real feeling story that has you 100% invested. It's a quiet and powerful film that conveys so many things, and it certainly stays with you.",
            "review_date": "2018-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sad but not overtly melodramatic, handled with subtlety.",
            "review_date": "2018-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really, 95% critics liked?  Why, because Hollywood told to like it.  Because Affleck ugly younger brother was in it? Dumb, meandering script about an idiot who burned his children alive.  Some nice scenes, but to call it great is beyond reason.",
            "review_date": "2018-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fantastic insight into the trauma and struggles of dealing with the passing or relatives. Mixed with a dark back story that adds all the more drama and depth to the film.",
            "review_date": "2018-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really depressing movie, that feels real and you can connect with all characters.",
            "review_date": "2018-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best acting performances I've seen from an entire cast. A very straightforward story that everybody can relate to. In other words, not your Hollywood story, but one that reflects the lives of real people.",
            "review_date": "2018-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie!!! The genre of this movie should’ve been dramatic comedy. There were a lot of scenes that were hilarious! It’s the best of both worlds between drama and comedy put together very well!",
            "review_date": "2018-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Moody and effective drama which contemplates the role in life of accidents: large and small, happy and unhappy. The performances are excellent all round and there are some interesting choices in characterisation, which saves this from being a standard sob-story.",
            "review_date": "2018-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Are you feeling depressed about life? Cheer up! This guy is way worse...\nMANCHESTER BY THE SEA\nThis was the film that, along with Birth of a Nation (R.I.P), had the earliest Oscar buzz. From the start there were promises of gold for this feature film who featured the \"other Affleck\" as the main character. This, along with the actual accolades and Oscar noms, caused my expectations to be high and the film didn't quite live up to them. This film is what you'd call an \"Oscar movie\", i.e. a very good film that the Oscars overhype, considering it one of the best of the year. And it really is one of the best dramas of the year, but if you take genre and foreign films into consideration, it will rank lower. The movie is too long, its replay value is near to 0 and it's too common and quiet in nature. Like the boat being rocked in the beginning, the movie just stands. Despite this, the movie is so grounded on reality, that it grips you in for a sad ride. This is achieved mainly by three things: the realistic performances of Williams, Hedges but chiefly Casey Affleck who delivers a heartfelt and inherently miserable character study. Hollywood is in dire need of performances like this which depict how a person would react to a situation, not how an actor would perform it. He's just a regular man inner reacting to the pille on of sad situations (in that sense I compare it to Hank's Sully); the other thing is Lonergan's direction who tries to be inventive and select the shots according to emotions, not according to action and he isn't afraid to stay far and cut slow when necessary; the final thing is the film's strongest asset, the screenplay. While the structure provides meaning, the dialogue (and its lack) are a reminder that people can talk realistically on film. It's smart but never quipy, it's complex but never pretencious. Furthermore, the use of music is something to behold proving that sometimes you don't need  a composer for every second. It's a wellcrafted, depressingly Oscarmade movie that you'll watch once and say \"ok,  that's enough\". Still, worth the watch!",
            "review_date": "2018-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Uncomfortable. Realistic. Awkward. Depressing. Existential. Provocative. Unflinching. \n\n\n\n\n\n\n\nBrilliant.   9.4/10",
            "review_date": "2018-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "nothing too special here,  no element of surprise.",
            "review_date": "2018-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The thing about sorrow is, you'll never feel it at the moment bad things happen as much as you'll feel after a while, it's always the aftermath that gets you, this is the movie that get it",
            "review_date": "2018-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this could have been over in half the time,  it was slow, did not hold my interest and I won't re-watch it",
            "review_date": "2018-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A dreary, plodding, and ultimately pointless film with terrible music, wooden acting, and ham fisted direction. I really do not see what all the fuss is about. ",
            "review_date": "2018-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "absolutely gut-wrenching and will resonate with you for hours afterwards. although deeply depressing, this film will connect with you on an emotional level and the characters and plotline are believable and heartbreaking.",
            "review_date": "2018-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Fresh\" what the heck were you inhaling??\nIt was gloomy and unbearably depressing",
            "review_date": "2018-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow to start but ultimately a well told story. Top performances.",
            "review_date": "2018-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Genuinely moving, low-key, beautifully filmed portrayal of a tragedy so deep and so sad that it cannot fail to make you understand that, sometimes, one simply cannot beat it.",
            "review_date": "2018-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing film with a cast of endless talent! Story brought tears to my eyes. Casey Affleck was amazing as always! Wow",
            "review_date": "2018-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I found this movie quite powerful actually despite the slow pace the details were very well thought of and the acting was so amazing that you can't tell it's been more than 2 hours. Casey Afflect is so great.",
            "review_date": "2018-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie shows the decline in a human after horrible events unfold. It captures the human spirit at its weakest. All the charterers are flawed and that's ok becuase they're people too. This film is beautifuly directed and written. Kenneth Lonergan did a great job with this. Bring tissues!",
            "review_date": "2018-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There was great acting in this movie, but the storyline was too depressing for me to really like it.  Some may enjoy this, but I didn't.",
            "review_date": "2018-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nostalgic and heartbreaking, Casey Affleck drove this film effortlessly.  One just feel the life in the characters.",
            "review_date": "2018-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The negligent drunk dad that starts a fire and go out at night to fetch more bear after a party where he diss the wife was not credible for me. Especially that in previous scenes he was looking in love and the kids were lovely as well. This film is in the dark alley of the writer-director, yes. It's basically the slices of life of psychopaths in hell on earth. Makes sense! The USA!",
            "review_date": "2018-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you have not seen this it is something very old fashioned- a tragedy. Tragedy only works as social realism so it is as true to life as mainstream movies get. And tragedy does not work fast paced. This is an adult movie in the truest sense with truly adult content. If you like popcorn movies this is not for you.",
            "review_date": "2018-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "pretensious rubbish, and extremely BORING.",
            "review_date": "2018-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like a 3 month conversation on death with the interesting parts removed. As brilliant as the character Chance (truly dumb but everybody pretended he wasn't) but without any humor.",
            "review_date": "2018-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you would like to become a script writer, Manchester by the Sea is the textbook for you. While most people praised Casey Affleck's acting, solid performance from Michelle Williams and Lucas Hedges shouldn't be overlooked.",
            "review_date": "2018-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally a film that represents the reality of life!",
            "review_date": "2018-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am immensely disappointed if you haven’t seen this film yet. It’s a real look into the complexities of life and how you get through it. Just power through. Life will throw shit at that fan over and over, and all we can do is clean it up afterwards. This movie deals with the incredible loss and how people have to live through it. It’s a powerful film and I’ve managed to watch it once more since I’ve seen it in the theater.",
            "review_date": "2018-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the best movie, I have watched last year, Casey is awesome.",
            "review_date": "2018-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good but Casey Affleck is a trash human being lol",
            "review_date": "2018-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well made but definitely overhyped",
            "review_date": "2017-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Marvellous. Even if this was one of the saddest movies of 2016, it never was self-pitying. And that's the great beauty in it. There is a real life awkwardness that makes you cry and smile, almost at the same time. And for me what ties all together so well, is the little Affleck. This film seems to be written for him.",
            "review_date": "2017-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies of the decade so far, in my opinion. Some will disagree; one could say it was a boring mess. It worked completely for me, though, with great, realistic, dialogue and a melancholy tone throughout. The acting was superb. I was blown away by Casey Affleck and Lucas Hedges. You have to appreciate subtlety to enjoy this movie.",
            "review_date": "2017-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I felt like I was watching real people in a real place dealing with real problems.",
            "review_date": "2017-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story takes place in the present while injecting the narrative with a series of flashbacks that inform the viewer about significant events from the past and the characters' motivations. The protagonist is Lee Chandler (Casey Affleck), a janitor and handyman in Quincy, Massachusetts, who lives a solitary life in a basement apartment. His interaction with the tenants of the apartment complex where he works is minimal. After being reprimanded by his boss for swearing at an irritated tenant, he gets into a drunken bar fight with two businessmen because he believes they were \"looking\" at him. While shoveling snow, Lee receives word that his brother Joe (Kyle Chandler) has suffered cardiac arrest. Joe dies before Lee can get to the hospital, and Lee insists on being the one to tell Joe's teenage son, Patrick (Lucas Hedges), about Joe's death. While making funeral arrangements, they learn that Joe's body cannot be buried until spring when the ground thaws, and it needs to be kept refrigerated until then, so Lee remains in Manchester-by-the-Sea, Massachusetts until the delayed burial. While reading Joe's will with Joe's lawyer, Lee is shocked to discover that Joe named him Patrick's guardian. Lee once lived in Manchester with his then-wife Randi (Michelle Williams) and their three small children, until his negligence while intoxicated led to a house fire that killed the children. No criminal charges were filed against him; however, after being questioned at the police station, Lee pulled a gun from a police officer's holster and attempted suicide. In light of these events, Lee remains reluctant to commit to the guardianship and unwilling to move back to Manchester, where the locals treat him as an outcast. Even so, he is opposed to Patrick's reconnecting with his mother, Elise and so Lee begins planning for Patrick to move to Boston with him. Patrick, who is deeply rooted in the Manchester community, strongly objects to the idea. Lee only commits to staying through the end of the school year. Over time, Patrick and Lee reestablish their bonds, although conflict continues to arise between them when it comes to making decisions about Joe's boat, Patrick's girlfriends, and their future living arrangements. Over Lee's objections, Patrick notifies Elise of Joe's death by email, and she invites him to have lunch with her. She has found Christianity and sobriety with her fiancé, Jeffrey, but during an awkward meal with them, Patrick finds himself unable to connect with her. Patrick is further unsettled when Jeffrey emails him, insisting on being an intermediary in any future communication between Patrick and his mother. Additionally, Lee's positive comments about Elise's sobriety lead Patrick to believe that his uncle is trying to get rid of him, straining their relationship even more. As a result, Lee takes some steps to possibly extend his stay in Manchester, and he begins to seek ways to spend more time with Patrick...\n\nManchester by the Sea received critical praise for Lonergan's direction and screenplay and for the performances of Affleck, Williams and Hedges, with Rolling Stone calling it the \"must-see film\" of the 2016 Sundance Festival. Rotten Tomatoes critical consensus reads, \"Manchester by the Sea delivers affecting drama populated by full-bodied characters, marking another strong step forward for writer-director Kenneth Lonergan.\". Giving the film five-out-of-five stars, Phil de Semlyen of Empire called the film \"masterfully told and beautifully acted\" and favorably compared Affleck's performance to that of Marlon Brando in On the Waterfront, saying \"there's not much higher praise than that.\" Justin Chang of Variety said it was a \"beautifully textured, richly enveloping drama.\" Critic Peter Travers said the movie \"ranks with the year's very best films,\" and that \"it takes a piece out of you.\" Matt Zoller Seitz of RogerEbert.com gave the film four-out-of-four stars, stating that it is \"the kind of movie you'll want to see a second time with someone who hasn't seen it yet, to remember what it was like to watch it for the first time.\" Anthony Lane with The New Yorker called the film \"carefully constructed, compellingly acted, and often hard to watch.\" Leah Greenblatt of Entertainment Weekly said that \"the exquisitely crafted, emotionally ragged Manchester doesn't just ask for time and effort; it earns it.\". The scene which drew the most critical praise featured the characters Randi and Lee speaking again years after their divorce. Anthony Lane called it the \"highlight\" of the movie. Speaking of William's performance, Tom Shone said that \"if this actress were put on earth to do one thing only, it would be this scene.\"[14] Zoller called the scene \"a duet of mortification and mercy that stacks up with the best of Mike Leigh (Secrets and Lies)...The effect is cathartic.\" Affleck says he strove to show restraint while acting the scene, explaining, \"The challenge was to have all of those feelings and hold it without weeping and wailing and gnashing your teeth. To be there, and not be there.\"\n\nManchester by the Sea received critical acclaim upon its release and was counted among the best films of 2016. Critics praised in particular Affleck's performance, as well as Lonergan's screenplay and direction. For the 89th Academy Awards, the film received six nominations: Best Picture, Best Director, Best Actor (Affleck), Best Supporting Actor (Hedges), Best Supporting Actress (Williams), and Best Original Screenplay-winning for Best Original Screenplay and Best Actor. Affleck also won the Golden Globe Award for Best Actor and the film itself was nominated in four more categories at the Golden Globes.\n\n\"Manchester by the Sea\" wasn´t what I hoped for. With all the praise it has been given, I found myself not being pleased by what I saw. The film is overly static, the script doesn´t seem like it has been finished before the production started, it has a strange scene structure and editing, all the flashbacks don´t work fully in my mind, it was not as emotional as I hoped would be (it only really touched me properly during the fire scene) and the acting is a bit wobbly. Part of the problem is as well that you don´t really feel any sympathy for Lee nor Patrick. With that said, you can´t deny that Casey Affleck gives us a wonderful performance as the ghostlike, depressed and lost Lee. But, that´s not enough when the rest of the film suffers from so many flaws in my opinion.",
            "review_date": "2017-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid movie. Very sad plot, but good acting.",
            "review_date": "2017-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The maudlin gloom fest I expected.",
            "review_date": "2017-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful, devastating, affecting.",
            "review_date": "2017-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If I had to use just one word to review this movie in order to help others determine whether or not this movie is worth using up two hours of their recreational time--I'd choose the word pointless.  Why do we watch movies?  To be entertained, relax, laugh, cry, relate, escape, etc. \n\nI expect more from a movie than to simply hold my interest.  Just keeping an audience's interest through to the end isn't enough--if it were then we would simply stop a movie we find interesting in the middle and say, \"Okay, that was interesting, I've been entertained for an hour.\"  This movie, which is over two hours in length did just that--stopped about two-thirds of the way into the movie. \n\nReally,  It shouldn't have been a \"movie\" it should have been a miniseries or something and fleshed out the story.  I'm not talking about leaving the audience to draw their own conclusions, which often irks viewers, this truly was an INCOMPLETE story not worth having wasted my time on.  It was, truly, pointless as presented.",
            "review_date": "2017-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Casey Affleck was and is Ben's little brother who played the younger sibling in the back seat of Ben's car in Good Will Hunting who couldn't afford his hamburger. Twenty years later he can trade Oscars with his Brother who has at least two but none for acting. Keeping it all in the family so to speak Matt Damon produced this opus. The director also wrote the screen play for which he too got an Oscar. Produced by Amazon. \n\nWhat makes this film special is the fact that the characters are ordinary down on their luck working people. Lee Chandler is the caretaker/handyman for a group of Brownstones in the Boston area. \n\nUnlike the Mr. America wannabes on Riverdale Casey does not affect a six-pack though he shovels snow with alacrity. The sound quality on this disk is somewhat lacking making the dialogue often hard to follow. The language used is working class, the behaviour rough and tumble, bar room brawls and on ice fights. The classical often sacred music in the score often seems off-kilter with the action onscreen. \n\nLee and his 16-year-old nephew Patrick love one another but their relationship is not touch feely. Through flash backs we learn of the tragedies that have caused Lee to shut down emotionally and why coming back home is the last thing he wants to do. Both Lee and his brother Joe are divorced. \n\nFrom IMDB one learns the production team shot in Manchester by the Sea and its police chief, fire, and EMT Staff participated in the filming, ironic because on camera the paramedics have trouble getting the guerney into the truck. \n\nA great deal of repressed emotion makes this a difficult film to watch at times. Lee expresses his in anger which comes out when he is drinking though in bar room brawls, not at home. This film makes the audience feel uncomfortable Casey's performance obviously the kind that members of the Academy admire.",
            "review_date": "2017-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring long movie where nothing happens. ",
            "review_date": "2017-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this film is over-rated. it is a janitor's life, how interesting can it be, it is actually really slow. however, it is not so boring that i had to stop.",
            "review_date": "2017-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kenneth Lonergan directs with astonishingly subtle brilliance, deriving this film's beating heart from emotionally powerful performances from Casey Affleck, Lucas Hedges, and Michelle Williams, and from a tight script by Lonergan himself.",
            "review_date": "2017-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie represents every situation where unwanted responsibilities slap us in the face, but we accept them as an unavoidable part of life.",
            "review_date": "2017-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A long boring movie with very little plot and so many unnecessary scenes. It's very depressing and disjointed...",
            "review_date": "2017-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "***THE GIFT OF GRIEF AND THE SOUVENIR OF PAIN***",
            "review_date": "2017-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(5.0 out of 6)\nWhen we see that great moments we can't fix when they are real when life is good. When what we know how how to fix we handle it all when it's our job. When what we can't fix are what's coming when there is death in the family. When other things we can't fix are other's children who are independent and loose canons. When what is already fixed are moments we plan when it's wills. When what we can't fix are our pasts when it's unfixable. When somethings we wish for is a quick fix when we can't live with ourselves. When others need a quick fix when they are young and free to do what they want. When fixing is what we are good at, yet can't seem to fix our life. When we see others are fixers when they build a life they fixed to manage. When there are plenty of fixes to turn to when there is not much to see and do, that we turn to God, hobbies, distractions, activities, work, relations, and new families when we all lost something to not let it bring us down. When some fixes are easy to fix when it takes practice. When somethings we can't fix when they don't want to be fixed when they don't want things to go anywhere. When indulging in fixes is natural when it's biological when it comes to maternal nurturing. When somethings we get into, we see we couldn't fix before when we were with others to see that we can fix our future with others. When not everything in life we can fix when not everything goes smoothly, when some things are awkward we can't get over. When what we can fix we do so when we can always get rid of others things to replace new things we want. When what we wish we could fix is all the things we have done to eachother when some damages are not meant to be damaged further but built that we shouldn't resort to having the option to fix. When what we wish not to fix we keep making worse when what surrounds us we hate. When what is already fixed for us we wait when others plan the worse to come. When someplaces are just fixed in time when we are born into something's we don't see coming to only try to move on or stay what we can try to fix but ultimately know we have to live with. When what is fixed are families we are in that we must live with and their actions when we can't change it.",
            "review_date": "2017-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A tedious, tiresome film devoid of anything resembling a plot or character-development. Exhausting to watch, assuming you can keep awake. There's nothing \"profound,\" \"Insightful,\" \"beautiful\" o whatever ever drivel the critics labeled it. It's vacuous, viscous, and vacant. Try \"Moonlight\" or \"LaLaLand\" for far better movies from 2016.",
            "review_date": "2017-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thanks to a mesmerizing performance from Casey Affleck and one of the most emotional scenes on film with Michelle Williams, writer-director Kenneth Lonergan successfully creates a heartbreaking, affecting, and realistic drama about grief and trauma through rich dialogue and characters.",
            "review_date": "2017-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a disappointment! I watched this because it's an Oscar-winner but for the life of me I could not see why. Pedestrian acting, an implausible plot, confusing leaps between present and past, and negligible ageing of the characters - although 10-15 years has elapsed between the various events we see.",
            "review_date": "2017-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A stunning, moving portrayal of loss, regret and reconciliation by director and writer Kenneth Lonergan. Starring Casey Affleck as Lee Chandler who, due to a lapse years ago, has been ostracised by the community he grew up and lived in. Following a family bereavement, he is called on to return to the small coastal town and take care of his nephew, Patrick. As the pair slowly build a relationship with each other, they need to come to terms with Lee's tragic past and make plans for Patrick's future.It is a moody, atmospheric film which has some intensely moving moments that are emphasised by a sparse and intelligent script. There's a wonderful use of the stunning New England scenery which is both bleak and haunting. Definitely a slow burn but as an examination of the dynamic of a broken family, this is a really inspirational and beautiful movie.",
            "review_date": "2017-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the longest, most boring movie I have ever sat through.",
            "review_date": "2017-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought the acting was excellent and the story was powerful. However, when I watch a movie, it's usually to escape and be entertained or uplifted. I like movies with a positive ending. This is one of those movies that resolves nothing and just leaves me thinking, \"All that and he still ends up pretty much he was in the beginning\". I don't think its a story that needs telling if he just continues to say he \"can't beat it\". It's too much like real life for me, and I get enough of real life every day.",
            "review_date": "2017-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can respect what they're trying to do here, but the plot seemed a little lacking. Lucas Hedges was grade A.",
            "review_date": "2017-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Second viewing review here:  touching, heartfelt, heartbreaking, humorous.  But only in small doses.  This is a Lonergan film for sure.  Every dramatic point is painted with a feather.  The actors are all in with the script ... subtlety and nuance.  But arguably it seems to undermine the seething rage that boils beneath the surface.  All we get is Lee (Affleck) randomly punching strangers in a bar while he's drunk.  The plot and the script point to more drama but it's swallowed whole by the passivity of the characters.  As though it was meant to be a movie about martydom?",
            "review_date": "2017-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A missed opportunity mainly because screenwriter Lonergan indulges director Lonergan. A wilfully overcomplicated flashback structure and a mumbly central performance by Casey Affleck mean that a basically straightforward examination of grief and guilt becomes tricksy and irritating.",
            "review_date": "2017-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was depressing.",
            "review_date": "2017-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, from the cast to the story line. Casey Affleck is one of the most underrated actors right now, I hardly ever see him in a bad role, Casey makes every one of his roles feel so natural like you really believe he is the character he is playing.",
            "review_date": "2017-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I try not to judge others but if you can't relate or didn't feel anything throughout this movie either you are a sociopath or truly have had a very easy life.",
            "review_date": "2017-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It gets into your heart like no other movie.  Deeply melancholy and extremely wonderful.  Affleck at his best (He deserves the oscar completely), direction, writing (Oh, fantastic), music, cinematography are fantastic.",
            "review_date": "2017-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing performances and a story well put together. Had all the ingredients to fail on conquering your emotions... Mine came out.",
            "review_date": "2017-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow and depressing.  Casey is trying to be as stone-faced and reticent as Ben is.",
            "review_date": "2017-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic acting from all parties involved",
            "review_date": "2017-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Manchester by the sea centres around Lee Chandler, a sullen janitor who's brother passes away and he is faced with the possibility of being his nephew's guardian while also confronting his dark past. It's a very slow burn, the first half an hour being a bit of a crawl, and Casey Affleck's character Lee, is hard to like at first but as you learn more about his past, his actions become more understandable and sympathetic. The dialogue and performances are very realistic and raw with excellent performances from Casey Affleck and Michelle Williams in particular. It's also unlike most Hollywood movies in that it isn't over dramatic in the slightest, all of the performances are very subtle and subdued and that adds to the depths of the characters and the story as a whole. Sometimes the pacing is a bit too slow, the scenes with the nephew and his two girlfriends seem particularly pointless and take away from the tension of the film. It is an excellent look at grief and a reflection of how real people cope with these kinds of experiences but it is a somewhat forgettable story and not as emotional as it may have intended to be.",
            "review_date": "2017-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I did not think this movie was good. It was just another movie trying to win an award in the modern era and sadly it did for Best Actor. In this film Casey Affleck constantly mumbles and talks in a low tone making every line difficult to hear. This movie is trying to portray a real guy struggling with losing his kids, but the acting of Casey was extremely phoned in. I thought it would be better for Lucas Hedges, the teenager in the movie. Not only were his lines written like what a real teenager would be like, Lucas' acting was great as well. This movie did use many cliches and 'cheap tricks' that most movies use nowadays, but it did it in such a poor way. \nThis is all just my opinion, and seeing the ratings for this people MUST'VE thought Casey's acting was superb for whatever reason.",
            "review_date": "2017-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely predictable and sappy",
            "review_date": "2017-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that really risks and tests it's viwer's patience with it's purposely boring and slow pacing, and rewards it with a grand emotional ride other than the meh. the acting is fantastic the story is fantastic the chemistry between Lee and Patrick is compeling the script is sharp, the shots aregood, best film of 2016!",
            "review_date": "2017-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "total absence of character development mind-numbing boring weird camera angles looks like it's filmed by a Middle School drama club dialogue completely void of in emotion or significance to the plot manchester-by-the-sea is worthy of mutiny by it's unsuspecting audience",
            "review_date": "2017-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4.5/5.  Manchester by the Sea (aka Sad Affleck the Movie) is a an absolutely heart-breaking gut punch of a movie.  With a phenomenal performance from Casey Affleck, I don't think its possible to make it through this movie without wanting to cry.",
            "review_date": "2017-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never have I seen such a beautiful merge of humor and tragedy. Kenneth Lonergans beautiful writing and on point direction create an absorbing story of human tragedy and emotion brought to life by the stellar performances by Casey Affleck, Michelle Williams and Lucas Hedges",
            "review_date": "2017-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Started off really well, but gets long and drawn out, and honestly I liked the character more when he was just a grumpy bugger before the past trauma is revealed. \nI watched about half (and it's over two hours long). \nMichelle Williams is underused. \nIt's a well made movie, I can understand the praise, but my copy was on loan and I needed to return it, but didn't have enough interest to renew it.",
            "review_date": "2017-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Manchester by the Sea is a disappointing film. It is about a depressed uncle who is asked to take care of his teenage nephew after the boy's father dies. Casey Affleck and Michelle Williams give terrible performances. The script is badly written. Kenneth Lonergan did a horrible job directing this movie. I was not impressed with motion picture.",
            "review_date": "2017-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was about to ball my eyes out multiples times. This is a masterpiece of an emotional movie.",
            "review_date": "2017-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Acting, screenplay, cinematography... all excellent. So why only 2 stars? Because I watched and waited for what seemed like an eternity for Affleck's character to come around, and IMHO, he never does. At the end my wife and I looked at each other and said, \"That's it?!?\". What a let-down!",
            "review_date": "2017-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The sadness of \"Manchester by the Sea\" is the kind of sadness that makes you feel more alive, rather than less, to the preciousness of things.",
            "review_date": "2017-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie! Worth the watch.",
            "review_date": "2017-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb! The way that the tragedy unfolds through the film and the use of the soundtrack were tremendous. I never cry at films but I sobbed at this one. Totally captivating. Very powerful.",
            "review_date": "2017-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too much of the film didn't feel real, deadpan actors delivering bland, hackneyed dialogue. Patrick character was just a confluence teenage cliches, portrayed by an unimpressive Hedges. Though the climax was not expected, I can't help but feel that the film would be both more enjoyable and moving if Affleck's character was dynamic and redeeming, instead of remaining his same mopey self for 135 minutes. In addition, the real tension in the film came from learning Lee's past, and truthfully the rest of the film isn't quite as interesting after this first turning point.",
            "review_date": "2017-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It ends on a blank stare; nonetheless everyone's' performances - not just Affleck's - deserves recognition for making this film a contender and true to life.",
            "review_date": "2017-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Half an hour in.  Paused...questioning...checking now to see how it was rated on Rotten Tomatoes.  Great by the critics.  So-so by the ticket buyers.  I'm a ticket buyer.  Like a book, I only read so far before flipping the coin to determine whether to continue or not.  Even my time is valuable.  So far, not engrossed by anything.  Rated highly by an awards show?  Maybe this could pull me ahead.  Didn't work out.  I don't care what the cost or who the stars were.  LaLaLand ...and I love musicals... was a huge disappointment disregarding the leads...both talented.  It just didn't sail. This story didn't sail either.  Didn't bother to watch the rest.",
            "review_date": "2017-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring, overrated, pointless.  There's 2 hours I'll never get back.",
            "review_date": "2017-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Acting was incredible, but was bored through movie.",
            "review_date": "2017-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies I've seen in my life. Cruel reality of living with consequences of one's choices and mistakes. Absolutely fabulous acting by Casey Affleck (had no idea he is such a fantastic actor!) and Michelle Williams. Recommended for everyone. Will make you think about it for days. A must.",
            "review_date": "2017-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie the first time I saw it and the 5 times I've rewatched it since. the movie shares a realistic approach that a lot of people take towards loss and how unhealthy it can be. Casey afflecks character is basically an example of all the things not to do when dealing with the loss of a loved one (or multiple in his case)",
            "review_date": "2017-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "SCOTT: (Dr. Scott Allison, Professor of Psychology, University of Richmond) Greg, can t you see that it s time to review Manchester by the Sea?\n\nGREG: (Greg Smith, Founder of Agile Writers of Richmond, VA) Its the end of the Oscar year and about time for a serious movie. Let s recap.\n\nSCOTT: We meet Lee Chandler (Casey Affleck), a handyman who lives in Boston and whose job is to fix the plumbing and electrical problems of the tenants in several apartment buildings. Lee appears to be a loner and gets into occasional bar fights. Yet for the most part, he is kind and gentle. One day he gets a telephone call telling him that his brother Joe (Kyle Chandler) has died.\n\nGREG: Lee travels from Boston to his hometown of Manchester to meet with friends and family of Joe s. It seems Joe has left behind a small boat, a house, and a son, Patrick (Lucas Hedges). While Lee attends to Joe s funeral needs, he stops by the lawyer s to check on Joe s will. Since Joe had a degenerative heart condition, he made sure all his affairs were in order. Lee is surprised beyond words when he learns that Joe has made him Patrick s guardian. Joe has left enough money for Lee to move from Boston and take residence in his home. But Lee doesn t want this new responsibility and is strangely opposed to moving back to Manchester.\n\nSCOTT: Greg, Manchester by the Sea is one of those rare movies that takes its time telling its story and developing its characters. There are scenes that don t seem necessary yet speak volumes about the kind of people we are getting to know, as when Lee Chandler misunderstands his nephew Patrick and almost inadvertently hurts him with his car. Scenes are also extended to include seemingly superfluous dialogue, yet in this movie even small talk looms large in revealing character details. Casey Affleck is highly deserving of all the kudos he is receiving for his performance here. In truth, almost all the performances here are dynamic and convincing. We see the pain in these characters  eyes and we care deeply about how their messy predicaments can get resolved. This movie pulls no punches about what Richard Rohr calls  the tragic sense of life . There are no villains here; life s difficult circumstances crop up and grab our hero by the throat, forcing him to make decisions and take risks. This is compelling drama, portrayed with heartfelt realism.\n\nGREG: I couldn t agree more. This is a story with no winners. Death leaves Lee holding the bag and it doesn t make his life easy. He is hesitant to move back to Manchester and we re left wondering why. Then, through a series of flashbacks, we re shown that he once had a family in Manchester. While things weren t perfect, they were pretty good. And then one night he accidentally burned down his house, killing his three young children. Afterwards, he, his wife, and the town, could not forgive him. He is forced to leave Manchester and take up residence in Boston doing odd jobs. When he is given the chance to return to Manchester, he at first rejects this  call to adventure.  He doesn t want to try and make it all work. But as he becomes more attached to his nephew and the town he left, we see him attempt to find work. But he is turned away. The town still hasn t forgiven or forgotten what he did. Ultimately, he finds a middle ground. Patrick will be adopted by friends, and he will regain his full birthright at the age of 21. Lee will relocate to a closer job in Boston so he can be a part of Patrick s life. It s not a Hollywood happy ending. It s not what anyone really wants. But in the circumstances that Lee, Patrick and Manchester find themselves, it is the best that can be done.\n\nSCOTT: Lee desperately needs a mentor to help him with his life decisions, especially regarding what to do with caring for Patrick. This movie shows us how agonizing life s difficult circumstances can be when person lacks help from a trusted mentor figure. Lee s older brother Joe, now deceased, probably served as a quasi-mentor figure for Lee, but now Joe s gone. Lee s parents are pretty useless in helping Lee, his vitriolic mother especially. Lee is left in the role of mentor for his nephew and finds himself ill-equipped to perform in this role, mostly because Lee himself hasn t properly come to terms with his past. He s an emotionally shattered man who has shut down. In the end, Lee finds a compromise regarding his nephew, an arrangement that is far from perfect but is the best Lee can do, especially considering the fact that he lacks any kind of mentoring.\n\nGREG: I think you re right again, Scott. This movie proves that you don t need a mentor for the hero. But there are consequences for the mentorless soul. The hero goes looking for answers but finds none. The hero looks for solutions but finds none. This is a story of a man thrown into a position of responsibility, but a responsibility that he cannot handle. He does his best, but his best is not good enough. Manchester by the Sea is a heart-rending story of a man looking for redemption, but finds none. It is an honest story about a man fractured by his own guilt. The story unfolds, not slowly, but deliberately. Each scene takes its time showing us the events of a man trying to cope with the responsibility that he didn t ask for. We want Lee to succeed. We even need him to succeed. But he won t succeed. It s not the story we want to see. But in life, it s often the story we re dealt. I give Manchester by the Sea 5 out of 5 Reels for telling a story that is as honest as a movie can be. Lee Chandler appears to be a decent fellow in the beginning of the film. He serves his tenants and keeps to himself. His one vice is that he seems to pick fights in bars - even preferring them to advances by attractive women. Although he doesn t want the responsibility of taking care of his orphaned nephew, we witness him doing his best. This is the hero within him. He tries. He tries very hard. And in the end he cannot overcome the tragedy that he brought upon himself. He is guilt-ridden and broken. He is the tragic hero who gets 4 out of 5 Heroes from me. As you point out, Scott, there are no mentors in this film. And that is part of what Manchester by the Sea is about. Lee is mentorless at a time when he could most use a mentor. He has no champion. And in the end, he loses to circumstance. If he had a mentor, things might have gone differently. It seems unfair to award this film zero mentor points since it succeeded in telling this tale without one. But as there is no mentor, 0 Mentor points is all I can offer. Movie: Mentors: 0 Heroes:\n\nSCOTT: Manchester by the Sea is a heart-achingly realistic portrayal of a damaged man doing his best to cope with a family emergency. This movie pulls no emotional punches; it tells a tough story and does it with searing truth. Casey Affleck does a phenomenal job portraying Lee Chandler and deserves strong Oscar consideration. I can t think of an actor who is more gifted at showing pain through his eyes and nonverbal behavior. I award this film 4 Reels out of 5. The heroic path of Lee Chandler is fascinating and unconventional from the standpoint of the classic hero s journey. He is independent to a fault, resisting efforts to bond with people who could grow close to him and help him with much-needed healing. There are no villains, only inner-demons to conquer. Lee s story is hard to watch at times yet ultimately redemptive. I award his character 4 Hero points out of 5. While there is no mentor for poor, suffering Lee Chandler, he does nevertheless serve as a mentor figure for his nephew Patrick. How effective Lee is in this role is open to debate. Patrick needs a mentor almost as badly as Lee does, and we get the sense that the loss of Joe has created a big mentorship void in the entire family. Ironically, the conspicuous absence of mentorship in this film gives it prominence. Thus I give the mentorship in the film a total of 2 Mentor points out of 5. Movie: Mentors: Heroes:",
            "review_date": "2017-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Every once in a while a movie will be released that screams that life is a pointless melancholic ball of crap. This movie rules them all.",
            "review_date": "2017-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst date movie ever. Kept waiting for things to get better or turn the corner. Nope. The story started with tragedy, slowly revealed an even-more-tragic backstory, and ended with the main character being unable to overcome the events of his life. The audience did not cheer at the end.",
            "review_date": "2017-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The trailer is pretty much the whole movie. Nothing is progressed beyond what is shown. I think it even includes every scene Michelle Williams is in. It's unfortunate that simply because a movie doesn't have one dimensional characters it's worth such a high rating.",
            "review_date": "2017-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though it feels overlong sometimes, Kenneth Lonergan's direction in \"Manchester by the Sea\" pushes the actors well enough (with Lucas Hedge and Casey Affleck standing out with a note) to bring out the best of his own script, which outstandingly showcases people's inner fight against profound grief.",
            "review_date": "2017-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing acting and also great sense of humor in this movie. I don't really know how else to praise it rather than to tell I laughed and cried.",
            "review_date": "2017-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First, let me say the best performance in this film is by Casey Affleck!  He's cold, calm, angry, guilty, and dead(emotionally).  And he makes you feel those emotions with his acting.  But it wasn't just him, all the actors did really well in this film, he just steals the show!  The story is great but it's one of those movies that will really make you sad, I felt really down after watching this film.  I'm not going to spoil anything...all I'll say is, get some Kleenex ready.  \n     Only time will tell if this movie will get better with time.  I'll rewatch it some other time but not anytime soon...it's a sad story and I'm not always in the mood for a story of this type.  Excellent!  4/5  OR 8/10",
            "review_date": "2017-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "6.3/10 — \"Okay\"/\"Watchable\"\n\n-(Seen on 7/30/22)",
            "review_date": "2017-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good movie, but really slow...which I also get why it was filmed in this manner.",
            "review_date": "2017-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know what is was, but the strong emotional scenes fell flat for me. I generally cry no prob :P",
            "review_date": "2017-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Casey Affleck has that thing where he makes you want to leave any room he's in",
            "review_date": "2017-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you enjoy feeling like you just lost a bar fight, you'll love this movie.",
            "review_date": "2017-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An emotional roller-coaster with a standout performance from Casey Affleck, richly deserving of his Oscar. A film that tackles loss and guilt with remarkable assurance by writer/director Kenneth Lonergan.",
            "review_date": "2017-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In 2017 we saw quite a few overrated movies be nominated for and/or win Academy Awards.  \"Arrival\" and \"La La Land\" are two such examples.  You can add \"Manchester by the Sea\" to that list.  One of the most depressing movies I have ever seen.  Just when I thought you could never get more miserable that the absolutely horrible \"Beats of the Southern Wild\", \"Manchester by the Sea\" comes along.  This movie in my opinion did not deserve either of the two Oscars it won.  Casey Affleck played the type of character the Academy voters love which I believe is the reason he won.  His acting here is not terrible by any means, but it is not Oscar caliber.  The same can be said for Kenneth Lonergan's lethargic and very predictable script.  I sadly knew what the incident that turned Casey Affleck's character into an alcoholic loner was immediately.  I can't figure out why Affleck's character even married Michelle Williams' character.  She is absolutely miserable every second she is on screen.  What in the world did she see in her?  The cast gives it their best shot which is why I have given this movie two stars.  However I am beginning to think I was a little too generous.",
            "review_date": "2017-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most subtly heart-breaking movies ever made. Beautiful in it's location and performance, with a realistic depiction of emotion through non-traditional cinematography. Definitely the best film of 2016.",
            "review_date": "2017-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Blacker than midnight in a skillet, seating drama Manchester By the Sea showcases a lead actor and writer-director at their finest, drawing you into a very real-feeling blue note that nonetheless features a lot of high notes both tonally and artistically.\n\nIn this R-rated drama, a depressed uncle (Casey Affleck) gets asked to take care of his teenage nephew (Lucas Hedges) after the boy's father (Kyle Chandler) dies. Yes, for the most part, it's a downer. There is a deeper darker tragedy at the center of this already tragic story, the collateral damage from which our main character, Lee Chandler, never recovers. Say what you will about the film's funereal tone but there is nary a false feeling or false sounding moment in the entire 137 minutes...nary, mind you. Though that sad page from Lee's past almost feels TOO tragic as it unspools, it's the resulting interactions of the characters involved - especially between him, his ex-wife Randi, and nephew Patrick - that feel note-for-note authentic. Despite the general malaise, Manchester By the Sea's truthfulness - coming to terms with the turmoil scene by scene as much as humanly possible - ultimately makes for an optimistic experience. Life is often a bummer, which all filmgoers can relate to in spades. The fact that this film's authenticity nearly moves the viewer from sympathy to empathy, however, speaks volumes for its emotional punch. And while it's true that some wish to escape a depressive atmosphere when they step into a cinema, these audience members probably shouldn't have wandered into a drama with a movie poster featuring two sullen people and more oak clusters than the most decorated Army veteran.\n\nLee is a broken man. We know this without dialogue. Casey Affleck has turned in many understated performances where a character fails to deal with some emotional issues (The Assassination of Jesse James by the Coward Robert Ford, Gone Baby Gone, The Killer Inside Me), but his turn in Manchester By the Sea takes it a step further. In this very gifted actor's hands, Lee unhealthily shoves down every last feeling such that the internal pain exhibits itself externally and he looks perpetually stooped but coiled, seemingly reticent but ready to strike as soon as someone pushes his buttons. It's an amazing turn worth its weight in Oscar gold more than any other male performance this year. Michele Williams as Randi, meanwhile, meets him beat for beat with a lot less screen time. Both say so much with so little; both performances are truly unforgettable. Without Kenneth Lonergan's masterful screenplay and direction, however, these turns might have very well been rudderless. They chart some rough waters in Manchester but their downbeat experience amazingly gives way to an upbeat outlook thanks to the transparency of all the artists involved. It's a rare film that has you run the gamut of emotions without filmic tricks or manipulation. Here, simply put, reality truly sets in. \n\nTo Sum it Up: Deep but Blue Sea",
            "review_date": "2017-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched 15 mins and then realised I had passed on from boredom",
            "review_date": "2017-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good performances might be better served as written word.",
            "review_date": "2017-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyed this movie, even though it wasn't any sort of a happy tale. Well acted.",
            "review_date": "2017-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very powerful film. Underwhelmed by the ending but Casey Affleck's performance is incredible.",
            "review_date": "2017-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant acting by Casey Affleck!",
            "review_date": "2017-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Manchester by the Sea has mastered the conveying of feeling with stunning acting, realism, tragedy, and above all heart. Bravo.",
            "review_date": "2017-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Manchester by the Sea is a sad sad film with brilliantly understated performances that suck you in before punching you in the gut. This is one of those movies where the synergy of everyone involved in front of and behind the camera is evident.\n\nCasey Affleck plays the depressed, self-isolating Lee Chandler who is forced to deal with new responsibilities. He doesn't have a ton of dialogue but his thoughts and feelings are palpable. Despite what the marketing will have you believe, Michelle Williams has a small role. A small role that will tear out your heart. One scene in particular in the third act is heart breaking and will have you openly weeping.\n\nThe film is entirely from Lee Chandler's point of view. Despite having a crappy job the film quickly establishes him as an intelligent man whom people are drawn too, further emphasizing how self inflicted his isolation is. Flashbacks are peppered throughout giving you insight on the emotional state of the characters. If you pay close attention you can see how every character has changed physically in some way except for Lee (it's sometimes hard to know if it's the past or present if Lee is the only one in frame). Wonderful example of how costume / hair & make up can go a long way to compliment a movie's theme.\n\nAnother tool used to great effect in the film is to intensify or prolonging tension by interrupting the flow of the scene. Almost every scene is deliberately interrupted with believably clumsy dialogue or a character fumbling or struggling with an object. A character will have a rude outburst, forgot where they parked the car, a band member will be off beat or someone might hurt themselves. This creates a very realistic and un-cinematic feel that serves the film very well.\n\nThe only criticism I have is most likely due to the environment in which I watched the film. I was not in the mood for a serious film and I got a little bored for the first half an hour. My suggestion is to make sure you are ready to watch a grounded and emotionally draining drama and bring some tissue paper.",
            "review_date": "2017-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Movie about real life situations. The acting is phenomenal!!",
            "review_date": "2017-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an incredible film.  Though it's heart-wrenching at times, it's not the downer that I expected it to be.  There is some seriously heavy stuff here, but the film perfectly balances it with just the right amount of humor.  This is a movie that some people may not appreciate due to its subtlety.  The genius of this film lies in what is unsaid.  Everything you need to know is there on-screen, but it's not spelled out for you - it's in the details:  how the characters look (or don't look) at each other, a picture on the wall, a silence between two people.  The film exemplifies a naturalism that is rarely seen in movies these days... it immerses you in a world of real people, in a real place, experiencing real crises and real emotions.  The characters are SO well written, including the best written teenage character I have seen in a movie, maybe ever.  And Casey Affleck is a revelation, he embodied his character so fully, I'd swear it was actually him.  He's got that Best Actor trophy in the bag, no one else can touch him.  The film is peppered with flashbacks that take some getting used to, but they are used brilliantly to slowly unfold the story behind the story... which is really where the meat of this film is.  If I have any complaints, it's that it's a little too long and drags a bit in parts.  But for me, this movie is easily one of the best of the year, if not THE best.",
            "review_date": "2017-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In a dour yet affecting feature from Kenneth Lonergan, \"Manchester By The Sea\" gives an intense depiction of grief that's bolstered by strong performances, not the least of which is Casey Affleck.",
            "review_date": "2017-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie.. It is a depressing movie throughout the whole movie because Lee Chandler Casey Affleck's character . Joe Chandler who is Lee's brother dies of a heart failure has to be the guardian of Patrick. He is such asshole because he is mean to her while fixing her plumbing issues in the bathroom.   He doesn't want to apologize and gets into a fight with people at the bar.",
            "review_date": "2017-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How does this movie have more than like 30%?  It's the worst garbage fire I've ever watched, and to top it off it drags on for 2 hours instead of like the normal 90 minutes or whatever.  We wished to be in that house fire.",
            "review_date": "2017-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film didn't stand out to me that much but it has a way of making you appreciate the smallest amount of humanity. It's progressively more and more tragedy until the very last scene. Casey Affleck's minimal performance is surprisingly powerful (and this is from someone who DOES NOT LIKE ANY AFFLECK). \n\nOverall strong film. Well worth the good reviews",
            "review_date": "2017-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too depressing for my tastes.",
            "review_date": "2017-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The main character might be one of the saddest people I've ever witnessed, but Casey Affleck doesn't bring enough to really make you fully care.  The movie could have been an inspirational film, but instead it goes nowhere and has a disappointing ending.  And the writer and/or director has some weird obsession with teens getting to have sex.",
            "review_date": "2017-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie convinced me that Casey Affleck is awarded movies because his brother is Batman. Boring, slow, pointless. If you care about Casey Afflecks character I hope you never walk by an anthill because the compelling lives of mindless insects will destroy you.",
            "review_date": "2017-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great acting. Horrible movie. Don't waste your time.",
            "review_date": "2017-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mix boring music, boring drama and boring scenes of landscape and you get manchester",
            "review_date": "2017-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well Acted... bad material",
            "review_date": "2017-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Phenomenal movie anchored by a flawless performance from Affleck make this movie a must see and instant classic.",
            "review_date": "2017-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I knew the bighead critics would love this one-it has a lot of whining.  Seriously the most boring movie I ever tried to watch.",
            "review_date": "2017-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "stuck in low gear!  boaring",
            "review_date": "2017-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Complete waste of time. I feel like I need an antidepressant after watching this movie...",
            "review_date": "2017-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unfortunately for Ryan Gosling, Casey Affleck would steal the thunder with his defining performance as the tragedy and guilt stricken Lee and hence won the Oscars. Not since Doubt has another film with tour de force acting gripped my attention so fiercely and unrelentingly. Using flash backs, the director Lonergan brilliantly filled us audience in on the background of Lee and the tragedy that shaped his character. Casey had the lion share of the 135 minutes movie since the focus was on him. But the supporting cast gave stellar performances such as the beautiful Michelle Williams to treat us to an ensemble performance. It is a long movie but never felt draggy. The director never shot a scene longer than it should which means that the director really packed many many scenes in, making editing work all the more difficult and time consuming. But the end result is a masterpiece. Manchester by the Sea is beautiful and unforgettable and Casey is under radar of many now. But in fairness to Ryan Gosling, its a much more difficult role to play the jazz pianist, the tap dancer and the crooner. Gosling could play Lee, but Affleck will be hopeless playing the jazz pianist. The Oscars, unfortunately, always favour the serious genre over musicals or comedy. So I think the Golden Globes did the right thing of having two separate categories for acting. Comedy/ musicals & serious dramas.",
            "review_date": "2017-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a film with amazing performances that is also depressing and as subtle as a ball peen hammer to the back of the head.\n\nThe film is a character study in grief, with the tremendous Casey Affleck playing Lee, a Man who feels he failed as a Father and Husband following a tragic incident in his past. Lee isolates himself from people, and drinks his sorrows away, not learning that his alcoholism is one reason the tragedy occurred. \n\nLee is forced to have to deal with people when his brother Joe, played by the always excellent Kyle Chandler dies from a long term illness. Joe has left Lee as the Guardian of his teenage son Patrick, played by the standout Lucas Hedges.\n\nThe main story is the relationship between these 2 characters, the wounded, self pitying Lee, and the stronger Patrick. The 2 actors have great chemistry and bring drama and meaning to every scene they share.\n\nThe cast has the exceptional Michelle Williams as Lee's ex wife, but unfortunately she is only in a few scenes, but each scene she is in sears off the screen. \n\nThe Strong cast includes CJ Wilson as a close family friend, that might be the best candidate to be the Guardian. He brings great humanity and caring to his role. Gretchen Mol is fantastic in one scene as Patrick's estranged, newly sober Mom, trying desperately to be a Good Mom, when her only impulse is to drink. Matthew Broderick plays her Born Again husband, and nails the role as an upright, uptight Christian.\n\nThe acting is the Only reason I can recommend this film, because it is one of the most depressing movies I have ever seen. The soundtrack is horrible, and is funeral like music that unwisely tries to evoke sadness, when the viewer doesn't need the musical cue. The story is manipulative, and the script is not strong using flashbacks almost every other scene. I love the cinematography and the location of the story, and the actors all do a good job with the Boston type accent. I give this film 3 stars solely based on the Brave acting choices,but the rest of the film I found not very good.",
            "review_date": "2017-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow! Critics have very low standards! SLOW AND BORING!",
            "review_date": "2017-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have mixed feelings about Manchester by the Sea. I was actually more impressed by the acting around Ben Affleck's brother than his own performance. I doubt Denzel Washington was one of the first people who taught him how to act. Lucas Hedges was pretty darn good. It was a decent story, but seemed to focus more on details not relevant to it. The film score was noticeably good, though. I mean, if you like that kind of thing.",
            "review_date": "2017-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a waste of time.",
            "review_date": "2017-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible waste of my time.",
            "review_date": "2017-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If your looking for a deep movie with conflicted characters \nThen I would say this is an excellent choice. It depicts the reality that not every story has a happy ending . Overall it's just not a movie that you will remember much about after you watch it. It's undoubtedly forgettable and ends so abruptly that it leaves you wondering why you bothered to sit for over 2 hours watching it. The acting was top notch and I'll give Kudos to Affleck. He's a very diverse actor and doesn't live under any shadow of his big brother . That's about it.",
            "review_date": "2017-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible with an even worse ending",
            "review_date": "2017-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super boring. Over hyped by hollywood. Critics clueless to what everyday folks like",
            "review_date": "2017-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The actors are fine, the cinematography is fine but WOW what a SLLLOOOOOWWWW MOVIE that is about as fun watching paint dry.",
            "review_date": "2017-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The rating here is exactly what I suspected, as it is technical masterpiece. It has the acting and realism that draws you into the everyday life of its cast, but therein lies its greatest downfall; the heart wrenching story punches you in the gut and it becomes a film you can only watch once.",
            "review_date": "2017-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Character studies, within as close of an approximation to real life as drama allows, generally do not scream, \"That's entertainment!\" Everything that can count towards film quality will count -- cinematography, score, acting, dialogue, storytelling, lighting, editing. Thus, I would argue that the best character studies are generally better than the best of nearly all other genres. Of course, that comes with plenty of personal bias. I have trouble in enduring characters not worth my time learning about. Luckily, director-writer Kenneth Lonergan has created and developed a character who may be all too familiar to us somewhere in our personal lives, yet strangely absent in the realm of cinema. On the surface, Lee Chandler (Casey Affleck) may seem like a typical deadbeat father / husband / employee / friend / uncle / general member of society, treating everyone like crap and is forced to face the consequences of his actions. But Lee knows himself well enough, to understand that seeking redemption is futile. He made a grave mistake, and second chances won't prevent him from making the same mistake again. He won't ever forgive himself, even if everyone else does, and will simply do what he can to distract himself for however long he lives. Because he does not forgive himself for *SPOILER* neglecting a fire that ultimately killed all three of his children, he could not ever take the place of his brother Joe (Kyle Chandler) as the guardian of Patrick (Lucas Hedges).\n\nI dig negative spaces. With Manchester by the Sea being the second Kenneth Lonergan film I have seen, I hail him as an artisan of the cinematic negative space. We can see connections develop and thoughts transmit through both what is said and what is not said. We fill in the blanks, based on both what is on the screen and what is not on the screen. Not just in one scene, but also in between scenes. That can apply to a whole plethora of directors, so I would also note something unique about Lonergan's style. I would not necessarily call him darkly humoured, but he does let sad jokes also stand as revealing moments for us to better understand the characters. Thus, you are free to laugh off whatever was said or done, or you can spend more time considering whom the person in question is. So, uh, I've seen two-thirds of Lonergan's entire filmography as director and writer, Margaret being the one film I missed. Looks like I am a fan. I'm not sure why Manchester by the Sea got some audience negativity for being slow. Maybe it really is too real for some viewers. Oh, well. Incidentally, I recommend this to anyone with a general appreciation for cinema, not to mention Massachusetts.",
            "review_date": "2017-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A stunning introspective performance by Casey Affleck, a really sad film and that scene between Affleck and Williams - wow, just wow. Intense.",
            "review_date": "2017-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was on the fence about seeing this one in the theaters, and finally caught it on NetFlix. Disappointing film, and I don't see the reason for all the critical love. The movie goes nowhere, answers no questions, and despite the acting reviews, felt shallow as if it were written for the critics and not from real-life. The move is by no means terrible, but I found myself sitting through the entire thing waiting for something to happen to make the movie worthwhile and not just two hours of an annoying main character who can't get his act together and has nothing to say. Alas I made it to the very end only to be disappointed with my main impression that this was a 2-hour waste of time.",
            "review_date": "2017-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "JUST TO  WEIRD OF A STORY TO LIKE",
            "review_date": "2017-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can see why it won awards, but this is one depressing film",
            "review_date": "2017-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Review (1~5)\n\n#Content: Script 5 | Acting 5 | Cinematography 5 | Film Editing 5\n\n#Visual: Costume Design 4 | Makeup & Hairstyling 3 | Scenic Design 3 | Lighting 4 | Visual Effects 3\n\n#Sound: Score & Soundtracks 5 | Sound Editing & Mixing 4\n\n#Overall (1~10): 8",
            "review_date": "2017-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one impressed me. Great writing, great acting, and deserved the awards it won.",
            "review_date": "2017-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is easily the most overrated movie of 2016.  It's relentlessly bleak, idiotic, even absurd.  A caring father decides to make his brother the guardian of his child, without ever asking his brother about it.  This basically sums up the seriousness of the entire movie.  None of the characters are likable, the themes are carelessly handled, most of the subplots ultimately turn up empty.  All of this is wrapped under the guise of a movie that is somehow important. It's not.  It's \"Rocky\" if Rocky punched himself in the face for two hours and then decided he wont fight Apollo Creed after all.  That it takes place in and around Boston is supposed to give it some gritty feel... or something.  Of course the critics loved it.",
            "review_date": "2017-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lee Chandler seems to exist in a permanent state of stoic despair. Despite the film's humour, there is no moment where he is able to escape his stagnant condition of misery. But the film does not attempt to present conventional themes of overcoming loss, rather it serves to explore the idea of enduring stoicism. Lee seems to exist outside the superficialities of day to day life. His inability to conform to standards of social etiquette (refusing to engage in small talk and be polite to those he meet) is representative of his indifference to the world around him. As a janitor, he witnesses his clients complaining and discussing the various worries they  are confronted with. Yet Lee remains in his state of indifference. A client confesses their love to him, and he remains emotionless. His relationship with his nephew is built on an unspoken sense of comfortability, and security they feel with one another. This is contrasted with the superficiality of Patrick's meeting with his mother. The final shot of the two broken relatives fishing serves perfectly to underline the nature of their relationship.",
            "review_date": "2017-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An incredible movie with some incredible performances from Casey Affleck and his co-stars and incredible writing and directing by Kenneth Lonergan. The film some how gets some comedy in with the tragedy we see unfold with incredible flashbacks but unfortunately are overused. The plot is also pretty good however we don't get a story arc from some of the characters unfortunately and they are just there to move the story along.",
            "review_date": "2017-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The wonderful writing and acting flushes out complex characters in this depressing story about grief.",
            "review_date": "2017-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie, a bit slow in pacing for me, but entertaining.",
            "review_date": "2017-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good. Very sad. Very New England",
            "review_date": "2017-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tedium by the Sea.\n\nThis started off promisingly, with that interesting indie-drama feel, but it doesn't have much of a direction, and after an hour or so it gets just a bit boring. Half an hour after that I was just willing it to end. \nSome nice performances, sure, but ultimately a bit of a let-down.",
            "review_date": "2017-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a very slow, boring and depressing film.  But ultimately, it is good.  It doesn't have much repeat value.  Casey Affleck won Best Actor for this movie, but is he really that good of an actor?",
            "review_date": "2017-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "2 hours and 13 minutes of my life that I can't get back! I truly dont understand the good reviews this movie has had. There is no beginning middle or end. There is no plot or storyline that has a conflict with a resolution. It tells a story with no conclusion or situation that is overcome or settled in any manner. Basically its another story about \"a few weeks in the life of\", but who wants to pay money to see someone else's crappy situation with no resolution, we just have a family with a bad situation and people that aren't dealing with it well. If I wanted to see that, I could leave the theater and just watch any ordinary family for a few days.",
            "review_date": "2017-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very seldom does a movie move me like this one has. It's one of the best films I've seen in at least ten years. It's a masterpiece.",
            "review_date": "2017-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Started out good, had some nice awkward humour, but then degenerated into a bizarre character study, although interesting. Definitely not an Oscar worthy performance from Affleck, he's still got a ways to go before I'd consider him great. \nThe environments and accents were fun, and the tough story was worth telling, but it's just not a film for everyone. \nWatched with Sam at her parents place on their Chinese streaming box, May 26, 2017.",
            "review_date": "2017-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great acting, likeable story, bad script, awful score, pretendish.",
            "review_date": "2017-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "HORRIBLE MOVIE!!! So boring, nothing ever happens!",
            "review_date": "2017-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you like you cinema moody and character focused, maybe this is the film for you, but I need at least some plot to hold my attention.",
            "review_date": "2017-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Manchester by the Sea [Kenneth Lonergan, 2016, United States] a quiet yet profound drama narrated too effectively resulting to a mournful yet beautiful symphony. A film that brings the kind of sadness that is both painful and alluring. 10/10",
            "review_date": "2017-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie just wasn't for me. If you like your film to be full of character development then give this a go, if you need some plot to make it through 2 hours, give this a miss.",
            "review_date": "2017-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shows the real side of dealing with tragedy and family. \"Manchester by the Sea\", will have you laughing at points, and reaching for the kleenex box during others. Great story and character development.",
            "review_date": "2017-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It felt so real, I could feel the pain of Lee. Hats off  Casey Affleck, you really deserved the Oscar.",
            "review_date": "2017-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heavy drama about loss, showcasing the full force of the acting ability of Casey Affleck and Michelle Williams.",
            "review_date": "2017-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Let me save you from this depressing miserable drivel. Boring as hell. Unimaginative scripting. A miserable trip through hell.what a waste of 2 hours of your life. HOW did this win awards is a massive mystery. Hide rope and razor blades so you don't top yourself from the Bordem factor",
            "review_date": "2017-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I normally complain when a film is all men and all about men because it's invariably men's violence against men. This is different. It's about being unable to express yourself because you're a man and a fascinating insight in to being male. Beautiful, sad, intense, superbly directed, perfectly paced.",
            "review_date": "2017-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lee Chandler is a janitor in Boston.  He is in a permanently depressed state and nothing seems to matter to him any more.  Then his brother Joe dies and Lee is given guardianship of his teenage son, Patrick. Patrick lives in Manchester, 90 minutes drive from Boston.  This is an imposition to Lee and he decides to conform Patrick's life and living situation to his own.\n\nWonderful, emotional journey.  A gritty, realistic human drama about tragedy, how one reacts to it, recovering from it (or not) and second starts.\n\nWell written and directed by Kenneth Lonergan.  Particularly impressive is the use of back-and-forth time jumps to feed in background information.  The revelation of the reason for Lee's depression is incredibly powerful and is woven into the plot with a deft touch.\n\nThis non-linearity helps the intrigue and the engagement level.\n\nOn the negative side the conclusion feels a bit tame after all that came before.  I was expecting something quite profound and more closure-oriented but, while there is a degree of closure, it doesn't quite end up as conclusive as I imagined.  This said, life doesn't always work out so neatly, so the ending is fairly realistic.  This movie is about the journey, not the destination.\n\nSuperb performance by Casey Affleck in the lead role, for which he won the 2017 Best Actor Oscar.  Good support from Lucas Hedges (as Patrick), Michelle Williams, Kyle Chandler, CJ Wilson and Gretchen Mol.  Hedges and Williams received Best Supporting Actor/Actress nominations for their performances.  Matthew Broderick also appears in a minor role.",
            "review_date": "2017-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Downbeat drama that packs an emotional punch.",
            "review_date": "2017-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one is excellent, it's naturalistic and believable, and deals with grief and guilt in an honest fashion. Nothing too expressive, or articulate; just real hard experience. It very American, and is thoroughly smeared with foul language; but hey, that's how they roll. Very powerful.",
            "review_date": "2017-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I went into this with low expectations and finished it with a worse opinion than I could've imagined.",
            "review_date": "2017-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "these oscar picking movies..i should know better. another disappointment as La La Land. this is a massive drama where a brother who life is just there has to go back to his homestown when his older brother dies of a heart attack and has to decide how to handle being the custodian to his nephew and face the demons from his past. the acting was good so was the storyline. but it was extremely slow at times and the ending did not answer anything.",
            "review_date": "2017-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "2 - bored bored bored. wasn't the heart wrencher that it was made out to be",
            "review_date": "2017-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very disappointing movie. The acting was stiff and lacked any real depth. The music was often misplaced and loud and the movie left me feeling nothing....except feeling conned with all the Oscar buzz and great reviews from critics which is what made me want to watch the movie. I don't remember if this movie won any Oscars for acting, directing or screenwriting, if it did then there's something terribly wrong as there were more worthy movies that missed out on being nominated.",
            "review_date": "2017-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie was a masterpiece in character study, until the very end, when you realize that Affleck's carefully crafted Lee Chandler has no arc. The film ends on a whimper with a flat character arc that leaves you wondering, \"what the hell just happened? That's it?\" Even a slight arc would've been nice. Overall, it leaves me feeling a bit empty, like the movie was rushed to its conclusion or just simply unfinished.",
            "review_date": "2017-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Started out great, lost it's way half-way through and then just ended abruptly. Very disappointed. Almost felt like I wasted my time.",
            "review_date": "2017-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie to me is a really great watch. Casey Affleck is the leading role and he takes over very well his performance in this is outstanding. Him and his co star his nephew connect so well they share the scene with each other so well and it seems genuine. This movie is great like I said but it's def not a fun movie it's a dark movie it's a movie you should see once and that's it.",
            "review_date": "2017-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you have a soul, you need to see this movie.",
            "review_date": "2017-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully tragic, Great cinematography",
            "review_date": "2017-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lousy movie. Dull emotionally dead hopeless hero.  No redeeming qualities.  What idiot gave this 5 stars??",
            "review_date": "2017-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Drop everything you are doing and see this movie. Right now. I can't think of the last time I saw such a powerful storyline paired with equally as powerful acting. Manchester by the (must) sea movie.",
            "review_date": "2017-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sad, but well acted and I liked the music.",
            "review_date": "2017-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "haunting, heartbreaking, brutal, beautiful",
            "review_date": "2017-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hope this movie doesn't get forgotten. An emotional masterpiece of a film.",
            "review_date": "2017-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Manchester by the Sea hits you on practically every emotional front. It's a powerfully dramatic story that sometimes feels like it's trying its hardest to make you cry. This movie feels realistic, but it also drags on a bit too long and the ending isn't very satisfying. I can see why this film got so much critical acclaim, even if I didn't love it as much as others.",
            "review_date": "2017-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing acting with a very interesting storyline. I am using a huge fan of action and suspense movies so experiencing a different genre was out of the comfort zone. Manchester by the Sea leaves a very strong message behind that captivates the audience.",
            "review_date": "2017-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Casey Affleck disappears into this role, a really fantastic movie.",
            "review_date": "2017-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was not a particularly good movie. I'm not sure the point of the movie. No redeeming value or significant importance. Just a decent movie with decent acting but why it got Oscar buzz is beyond me.",
            "review_date": "2017-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not sure about all the buzz around this movie.",
            "review_date": "2017-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm being generous giving the movie 3 stars. I'm all for serious dramas and pieces of work that really make you think, but the 2:17 movie could have been edited down to 1:30 and made the same impact. The movie was so stretched out it just made its pace extremely slow and at times boring to keep up with. I walked away to put laundry in, serve myself some dinner and returned feeling like I hadn't missed much, because I really hadn't. I almost feel like a lot of the talent was wasted on this film.",
            "review_date": "2017-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite the deserved rave reviews for Michelle Williams' and Casey Affleck's performances, this is not a great movie. Michelle Williams' short screen time doesn't diminish her deeply affecting performance, and Affleck does a lot with surprisingly little dialogue. But this is more character study than anything, and the unrelenting depressing tone of the film and the acting is not redeemed. Not every film gets tied up in a bow, but to maintain a connection with the audience a film has to give back. This didn't.",
            "review_date": "2017-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "boring. only half end was beautiful.",
            "review_date": "2017-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Few--thank God--have rowed the boat this protagonistt rows. The portrayal is pitch perfect, even if the sound is that of a howl beyond  comprehension for most people. That the teen nephew suddenly gets a whiff of understanding upon seeing his struggling uncle's tenderly cared for photographs offers insigh",
            "review_date": "2017-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the worst movie since Meet Joe Black.",
            "review_date": "2017-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stellar. Just stellar. I hadn't read much about the movie other than the top line, so I'm lucky to have experienced it fully. I've loved all of Lonergan's movies -- loved in a way where the movie stays with me for years. I saw \"You Can Count on Me\" more than five times. I waited for Margaret to finally make its way online (or anywhere).  And now this one. To be honest, I didn't even realize it was a Lonergan film until the Oscars because all the hype was Affleck and Damon and Williams. \n\n But this is a Lonergan film, completely. It's the everyday-ness of his stories, and of the people, that resonate and stay with you. We're immersed in their lives and it's like people you know. \n\nWith each of his films, though, he ratchets up the central tragedy. The first film's tragedy was a distant car crash that orphaned two young children. His second was...no spoilers. And now Manchester by the Sea. I honestly don't think if I can endure his next film if it takes tragedy to yet another level after this one. \n\np.s. awesome cameo from the well-known actor from You Can Count on Me. That guy does creepy unlike anyone else.",
            "review_date": "2017-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you want to depress the hell out of yourself, during a movie in dire need of 30 minutes of editing, have at it.",
            "review_date": "2017-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First, let me be fair.  This is not the worst movie ever made.  In fact, the actors were tremendous as they attempted to make you believe this movie was worth watching.  \n\nPrompted by sister and girlfriend, who by the way did not want to see Guardians of the Galaxy, vol. 2, I spent  the next 2 hours and 15 minutes wondering WTF?!  \nI knew it was too far, that I had invested too much into the movie to turn back when they depicted the funeral scene in slow motion.  Slow motion for the most boring movie ever made.  Go figure.  And lest you think me a Luddite, I actually enjoy films without a car chase or ninjas if they have a solid story to tell and tell it well with such conventional plot ploys like pacing, structure, conflict, and a shadow of a climax, as opposed to fading to black, leaving your audience open mouthed and thinking WTF?!",
            "review_date": "2017-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The pits! Michele is wasted here and Affleck is zombistic in his performance as a ...what exactly?  A loser?  Sorry, the film is a loser so why go on.",
            "review_date": "2017-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie sticks with you. Definitely a 5 star movie except the ending felt abrupt with no character change or closure",
            "review_date": "2017-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Devastating and that rare film that lives up to the hype. The performances are stunning and dead on.",
            "review_date": "2017-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie I have seen in a long time. No hype, no cheese, just real-life done well and with subtlety.",
            "review_date": "2017-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing story and amazing acting, all I could adult for in a movie.",
            "review_date": "2017-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a super slow movie.  I understand that a person is mentally scared after losing their children, but I feel a movie 2:17 long of it, is just utter boredom. The mvovie had a couple funny parts, but there is no way this movie gets more than 1 star.  I should had know better, any movie where the critics give it over 90, is  movie that I en\nd up not liking, and movies they have low scores, are movies I end up loving.",
            "review_date": "2017-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This by far should have won best film over moonlight. This movie was great and made me cry my eyes out. I left the movie in tears and was crying the whole way home.",
            "review_date": "2017-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another big Oscar-awardee with a pretty untouched name as the director. Kenneth Lonergan serves you a film where a man filled with issues from his quite recent past get's a bunch of new responsibities thrown over him. He's not ready for it, he knows it, but he really tries his best. Maybe he is actually so up for it that it makes his life better, but he just can't take the shot or maybe he wanna to try it for a while? There are loads of questions here, slowly being aswered. The story moves very neatly. It's sad, deep and touching. It's fresh, still not that original. It got that delicate drama-feel, that makes you feel with the characters, laugh and cry.\n\nCasey Affleck is doing his best effort to date. It's absolutely brilliant. The way his face, bodylanguage and his ways in general acts out is fantastic. There is so much going on in his head that it shows from miles away but I'm glad we are close to him at most scenes. Hand's down, it's one of the strongest performances I've seen lately. Brilliant supporting actors helps and the smart double story line is making it a film with a lot to digest. That way, two ours plus runns by and I never feel it's to easy even if it uses known tricks. A very solid film and a sure shot for fans of realistic films with people in personal crises.\n\n8 out of 10 boat engines.",
            "review_date": "2017-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Manchester By The Sea (Kenneth Lonergan, 2016) - 8,0/10",
            "review_date": "2017-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't enjoy monotonous movies, but I do love character studies. Confusingly for me, Manchester by the Sea is a monotonous character study. And so I had to forcefully endure the monotony for the first few minutes of the movie to get completely immersed in the drama. But once immersed, it became effortlessly easy to see that Casey Affleck is the main source of wonderment. His character, Lee, constantly looks like he's thinking of something terribly stressful. As we see him trudge through his challenges, we wonder what sorts of submerged emotions he is actually experiencing, and whether or not he will explode. We rarely see explicit action that substantiate Lee's thoughts, but through just a handful of short yet powerful scenes, the heart-rending intricacies of the character is strikingly illustrated to maximum effect. Such would not be possible without Affleck's sublime performance.",
            "review_date": "2017-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A depressing tale of grief with some of the best acting this year",
            "review_date": "2017-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Expected more given all the hype",
            "review_date": "2017-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Manchester by the Sea is directed and written by Kenneth Lonergan, and it stars Casey Affleck, Michelle Williams, Kyle Chandler, and Lucas Hedges in a drama film about a janitor that is not likable, and his brother died, which put him into parental care of his brother's son, which he think isn't the right idea to do. Out of all the Academy Award Best Picture nominees, this is the one that I was the least looking forward to only for the fact that I didn't really find it that interesting as drama films tend to get easily boring, but I know that I want to watch all the films that were in that category, so I know that I'll have to watch this, and go my surprise, I really liked it. This is the best performance that I've seen from Casey Affleck as he's depressed in that he feels like he lost everything, but still keeps going with his life. Michelle Williams is not in it that much, but she does put a spark when she's in it, especially in the end where she gave an emotional scene. Lucas Hedges was fine in it, but he doesn't quite have that same weight that Casey Affleck and Michelle Williams has, which when I saw him in the film for the first time, I knew that there was something missing. The writing by Kenneth Lonergan is fantastic in that it's just a piece of life happening, and the way that it shows flashbacks is quite subtle that I honestly forgot I was watching a flashback. The characters felt like actual human people, which is quite an accomplishment to do, and I was actually invested in this as the pacing in this is very slow and is entirely a drama film, with some surprisingly comedic moments that are effective. I'm surprised that with this being more than 2 hours long and the pacing going in a snail pace, I wasn't bored of it, nor was it dragging either, except in some rare moments, but there's not much of it. Manchester by the Sea is a really great film that I'm glad it got some awards out of the actors and the director.",
            "review_date": "2017-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It felt like the first act of a movie stretched out to over two hours.",
            "review_date": "2017-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Manchester by the Sea is filled with great performances and amazing realism but its somberness, slow story, and unchanging characters will make it uninteresting for some viewers.",
            "review_date": "2017-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How is this called a movie? This has nothing in common with the art of cinematography. Disgusting.",
            "review_date": "2017-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "decent mov: but ANOTHER (prob true) no-talking non-comunitive Irish rough family story",
            "review_date": "2017-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It kept my attention somewhat, but I just couldn't shake off the feeling of boredom while it was onscreen, like I had to remind myself to keep watching even though I never fell asleep or got distracted. \n\nI guess I'm just not much for dreary, apathetic stories and characters. I much prefer one where the main character fights back and is fiery because apathy is not my game. \n\nI did like the scenery where it was filmed, and they managed to make the location seem very cold without being decorative, like a snowy Christmas card would be. This adds to the feeling of desolation and loneliness. \n\nHowever, although I can appreciate it had some \"meaningful\" theme, I just couldn't get into it. It didn't light my fire, so to speak.",
            "review_date": "2017-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A real sad movie, the acting feels so natural but still being a sad story marked for a huge tragedy",
            "review_date": "2017-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very depressing.  Thank gods I saw it at home.",
            "review_date": "2017-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good conversation flick, character development, despite the slow pace...",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies I have seen in a long time.  Not sure why all the hype. This plot was tedious and the ending was the type you expect when the writer literally can't think if anything else to do but stop.  Don't waste the time.",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't understand how this was so highly rated.",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Story,Great Cast.However some scenes seem repetitive and some scenes go really long.Other than that its a great film",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kenneth Loregan has done it well , the background moments fit perfectly and helps adding dynamic movements to the movie , which certainly is not easy in a dramatic film , likewise the script and particularly the music were perfect , almost cried with Adagio in G minor and felt all the struggle  of the characters with themselves",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrific acting by Casey Affleck and everyone else. Very well written script. Very sad story. Simple and complex at the same time.",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie some will have to be prepared to watch. It's not a happy movie and can be hard to watch. Lee's background caused him to be depressed and withdraw from close relationships for the most part. So the movie can be very sad and some may find it depressing. When his brother dies, he's put in an awkward situation when he finds out his brother wanted him to be guardian for his teenage nephew. Given he's never really dealt with his own grief and guilt from a tragedy that happened in his past, that seems impossible to him. He manages to arrange his brother's services somehow, but dealing with his nephew isn't something he's prepared for. He has flashbacks to years ago often in this movie and you don't always know the flashback is starting or ending. The musical soundtrack is too loud, as if make up up for the relative lack of enough meaningful dialogue in the movie. Lee and the nephew talk, but not enough to truly bridge the gap.Dealing with deep feelings isn't something Lee does well, so don't expect much of the ending...it doesn't get better in this movie. Good acting, I guess, in a repressed sort of way. But itt wasn't a story I would have chosen to watch if I had known what it was like..",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredibly boring, uninteresting, dark, depressing, overrated film! If you've not seen it, consider yourself lucky. I had trouble getting through it at home on DVD. Entertainment isn't supposed to be tantamount to getting a \"root canal!\"",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a powerful movie, with some wonderful performances, especially by Casey Affleck and Michelle Williams. I can't imagine going on if that kind of tragedy happened to me. I'm glad I finally got to see it. You'll shed a few years, but it's definitely worth seeing. An A-.",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie night with Iris.\n\nAcademy award-winning fare that left me totally unmoved. I typically like slow, emotional films and I loved You Can Count On Me. But one-hour into this and I was struggling to comprehend the musical flashbacks. I couldn't remember what time line we were in, and which actress was who. So the tragic loss failed to resonate with me. And even in the 2nd half the much lauded confessional scene totally passed me by.",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as profound as the reviews......",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absoluteely Terrible movie. Slow plodding, frustrating. Do not watch this drivel.\nWhy this was giving Afleck such high accolades is beyond me.\nThe plat was WAAAYYY too slow to develop.  I was bored, dissapointed, and upset I spent money to watch it.\n\nYou want to see a good movie? watch \"Hidden Figures\" INFINITELY BETTER.",
            "review_date": "2017-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The excessive profanity became tiresome pretty quickly. The story of family disasters was well done but there is little that offers some kind of  redemption. Thus the ending is a bit of a shock making this into a quite depressing movie.",
            "review_date": "2017-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies I have seen in awhile, grim but so involving and realistic (as far as movies go) - especially an ending that rings true.",
            "review_date": "2017-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never judge a book by its cover. There is a story behind every smile or every sad face. This beautiful movie shows that in a very unique and gritty way.",
            "review_date": "2017-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Summary: bad things happen in life.  Skip it.",
            "review_date": "2017-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sad, boring, depressing movie. It started slow and finished slow. I kept waiting for it to get better, but it never did. The young mans (son, nephew) acting was good, the the rest was below par. I've very rarely rated a movie 1 star, but this movie is terrible. Two other people that watched it with me agreed.",
            "review_date": "2017-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the slowest and most boring movie ever! I want the 4 hours of my life back!! Won awards???",
            "review_date": "2017-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now, that's an actor that knows how to own a pain-filled role. I'm beginning to love Casey as much as I love his brother, Ben.",
            "review_date": "2017-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I genuinely thought that this film was worth watching and until the end I felt that It was, however it left me with so much disappointment for the barely existing finale that I kind of wish I would have never watched it. Inconclusive.",
            "review_date": "2017-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely without a doubt the worse excuse for a movie I ever endured through. I would rather soak my naked body in honey and sit on a fire ant hill than watch this cinematic piece of crap.",
            "review_date": "2017-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are no redeeming characters and the pace of the movie crawls.",
            "review_date": "2017-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible film. Definitely sneaking into my top list after a few watches.",
            "review_date": "2017-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "- Are you having a great day? The skies are blue? You're thinking \"I'm just doing too good & need to come down ...\" Or maybe you're in the manic phase of bipolarity. Pop this into your Bluray & you'll be down in a half-hour. Another dull, dark (badly lighted) Damon downer - an actor's buds as producers vanity project with his Kimmel bro' Mr. Emily Blunt, J. Krasinski. Writer K. Lonergan? A guy with whom to avoid lunch. \n\nSee those Reviews saying \"slow,\" \"depressing,\" etc? Dead-on as much of the first half dialogue deals with a guy in a morgue freezer. Speaking of which, the slo'-moving un'movie easily is a half-hour too long. Ferris Bueller makes a distracting cameo to make things worse. Funny. Not. - The sound pick-up is so muffled in places it's necessary to switch-on the subtitles. \n\n- There is one scene with Michelle toward the end where she delivers a worthy truly heartrending performance, but it's not worth the long wait & misapplied back-&-forth cutting to get there. And whose baby is that in the carriage? Theirs from a suggestive earlier poking? Your guess ... You'll also get your MDR of the F word, too. What an all-purpose adjective.\n \nThe critics must be a mopey group.",
            "review_date": "2017-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow, boring, depressing!",
            "review_date": "2017-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very slow. Overly dramatic music, and I feel like I have seen this movie over and over already. I do not get all the rave reviews for this.",
            "review_date": "2017-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. Great performances. Tragic.",
            "review_date": "2017-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Imagine this without a tragedy.",
            "review_date": "2017-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "kind of boring.... snoooooze... but still ok I guess.",
            "review_date": "2017-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A decent film but that's about it. Nowhere near the standard the reviews suggest. Some good acting, especially from Casey Affleck. However, the film is so slow and never really materialises. I feel robbed by the ending. I literally only watched this because of the reviews and now I feel lied to.",
            "review_date": "2017-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very slow pace movie.",
            "review_date": "2017-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "CASEY AFFLECK THOUGH",
            "review_date": "2017-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I truly don't get the Oscar nod.",
            "review_date": "2017-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very intense movie, didn't know whether to laugh or cry at points. Heavy subject matter so be warned but well acted and well done.",
            "review_date": "2017-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beyond depressing.  We kept waiting for the story to develop...guess we are not artistic enough...very disappointing.",
            "review_date": "2017-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. I think I'm most sad that it ended. Heart wrenching and Beautiful. If this were a TV show it'd certainly stand tall aside This Is Us. What am I thinking, it would blow that show outta the water!!!",
            "review_date": "2017-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good acting from Casey and the kid reminds me of a young Matt Damon. Somber movie though and I can't imagine watching it twice.",
            "review_date": "2017-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing. Best film of 2016",
            "review_date": "2017-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hard hitting and very sad, at times desperately depressing. Convincing performances by all.",
            "review_date": "2017-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fitting role for Casey Affleck.  How COULD he not do this with his eyes closed? Brilliant!",
            "review_date": "2017-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A real vision of life and its many demons.",
            "review_date": "2017-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Main character is not \"sympatico,\" therefore, I had no sympathy or empathy for him.. I consider Casey a very poor, wooden actor.",
            "review_date": "2017-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie I suspect will stay with me for a few days at least. One would argue that it's slow, but I appreciated the pace which is a true escape from most of our lives. But the greatest aspect of this movie besides the stellar performances was the untainted, non glorified script and the quirky scenes that amounted to not much, but complete realism. Walking in the wrong direction to the car, the ambulance trolley that wouldn't function properly, the phone that cuts out... all these during tragic circumstances is exactly what happens to us all. A really honest movie that all can relate to that showcases the beauty of American suburbia.",
            "review_date": "2017-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really slow.  I got it but certainly didn't think it was award winning.",
            "review_date": "2017-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was slow, boring and not well made at all.",
            "review_date": "2017-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Casey Affleck carries the whole film, and it is definitely worth a watch for his performance alone. The problem ,though, is that without his strong lead performance and well written character, I probably wouldn't have cared for Manchester by the Sea. I personally didn't find the story very interesting and the film concentrated a lot on the underwritten character of Patrick, performed quite underwhelmingly by Lucas Hedges, which made parts drag on or just rather boring for me. Other than that it's a solid film, with real drama and a very neat way of using flashbacks.",
            "review_date": "2017-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I would gladly give what I make in 4 hours to get back the 2+ hours I wasted on this movie.  I like Affleck and he is a strong actor...the story, script, and timing are some of the worst I've suffered through.  VERY disappointed and frustrated...complete waste of time.",
            "review_date": "2017-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am still trying to figure out why the movie was considered a contender for \"Best Picture\".  The plot, while promising, left too many unanswered questions, and it took a long time for those questions to be asked.  The acting by Casey Afflect was superb, and he deserved the Oscar.  Michelle Williams was great as well.  But as for the movie, it didn't come close to by expectations.",
            "review_date": "2017-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie has a dour undercurrent to it with flashes of sweet humor but it does seem hollow at times considering the tragic happenings. The highlight of course is the acting of Casey Affleck with his emotional baggage from past, this slow unfolding of the past is done up masterfully by the direction and cleaver screenplay. While the movie is good, it's not an entertainer.",
            "review_date": "2017-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a god awful movie! Did the critics sleep through this movie??? Dull, boring, poorly acted, lousy sound track!",
            "review_date": "2017-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you want to see a movie about how a human being can get so depressed over the past, see Manchester because this is one of the most realistic dramas ever made. The story is very engaging and flows very naturally. The characters are wonderfully realized with some beautiful performances by Casey Affleck, Michelle Williams, and Lucas Hedges. This is worth watching for anyone who's ever gone through rough times like the ones shown in this film. It will bring tears, but in all the best ways. It's a must watch.",
            "review_date": "2017-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Manchester by the Sea is a breezy-yet-chilly character study hellbent on bleeding dry the bizarre relationship aesthetic between its two central players.\nA detached Casey Affleck is brilliantly miserable as the unlikely guardian to brooding teen Lucas Hedges, but the on-off bond between the two is never quite as interesting nor as profound as director Kenneth Lonergan seems to think it is.\nThe exchanges between the two are characterised by moody misunderstandings and gruelling awkwardness, as the film bounces back and forth between depression and general douchebaggery.\nAt its best, Lonergan's picture tries to show us a new level of the classic love-hate relationship - and occasionally succeeds. At its worst, it consistently avoids interesting secondary characters in favour of meandering moodiness, which slowly stagnates and quickly starts to stink.",
            "review_date": "2017-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The power of tragedy is illustrated as kindly as possible in this relatable film. It's real, gritty and conveys it's message clearly. A great drama.",
            "review_date": "2017-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an extremely powerful film and the acting is brilliant, Affleck is incredible in the lead role. The film has a strong balance of editing the past story into the film at any given moment, the filmmaker will only allow you snippets of the past events when he feels you are ready to see them. This is one of the best drama films I have seen for quite sometime, the gut punch narrative confuses and rewards the viewer. Affleck enters the lead role category with this powerful performance and while the supporting cast is also top notch they can't steal the limelight from him. This beautiful film deserved the critical awards and it is easily one of the best films of 2016. 05-07-2017.",
            "review_date": "2017-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring and super slow.",
            "review_date": "2017-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very sad story about death and tragedy.  Not family friendly with bad language and juvenile sex scenes.",
            "review_date": "2017-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fall asleep after 35 minutes. Movie is about the boring life of boring people, so movie is boring.",
            "review_date": "2017-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The way the Oscars are going more and more often if it's up to win one then it'll probably be a hipster catastrophe. With a movie that starts out at a flat drudging through mud and continues throughout the whole movie it's a wonder that this movie that of course came out just in time for Oscars was even seen by anyone. I guess the right about of bribes and getting your movie Oscar attention proves any movie can almost be saved and sheeple will watch just about anything with Oscar attached to it.",
            "review_date": "2017-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film deserves 5 stars for the writing, cinematography, music score and Oscar worthy performance by Casey Affleck. Unlike other films or series that are driven by political motivations (Get Out) or feminism fantasy (Game of Thrones), this is a beautiful, dramatic story that is very real. I simply loved it. Not since the film The Artist, has the central character been so compelling in his role. In an era when so much focus is on women warriors, unrealistic CGI based films and violent anti-heroes, it is nice to see a strong realistic life altering story. I just wish Hollywood would take note and stop making politically correct, female warrior, unrealistic CGI garbage. Reviewers who panned this film are usually the same one who panned brilliant films such as Tinker, Tailor, Soldier, Spy because they're impatient thrill seeking millenials who grew up playing video games and prefer the instant sugar rush of a derivative CGI film over a substantive story that unfolds like a great novel.",
            "review_date": "2017-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Soooo boooring, no sense and stupids conversations and bad performances.  Oscar and Golden Globe winners? = FRAUD",
            "review_date": "2017-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OK story.  Well acted. Hated the ending.",
            "review_date": "2017-03-26",
            "source": "rt",
            "lang": "en"
        }
    ]
}