{
    "rating": 9.7,
    "release_date": "1956-03-25",
    "num_reviews": 270,
    "genres": [
        "Japanese"
    ],
    "summary": "Mr. Watanabe suddenly finds that he has terminal cancer. He vows to make his final days meaningful. His attempts to communicate his anguish to his son and daughter-in-law lead only to heartbreak. Finally, inspired by an unselfish co-worker, he turns his efforts to bringing happiness to others by building a playground in a dreary slum neighborhood. When the park is finally completed, he is able to face death with peaceful acceptance.",
    "reviews": [
        {
            "content": "A thoughtful, artful movie about the meaning of life, bureaucracy, pleasure, doing a good job, family, and how we are seen by our colleagues.",
            "review_date": "2023-03-03",
            "source": "rt"
        },
        {
            "content": "Best movie ever.  Don't remake it.",
            "review_date": "2022-11-28",
            "source": "rt"
        },
        {
            "content": "I suppose it's not too late to live, as the Japanese title translates as \"to live\".  So live today, don't put it off.\n\nOne more thing, frak the guvament pigs",
            "review_date": "2022-11-02",
            "source": "rt"
        },
        {
            "content": "Kurosawa's most personal and moving film to date for me.  Touching, poignant, and utterly human, Ikiru is a triumph of human will and life itself.  Takashi Shimura delivers a powerhouse performance as both a young man, in flashbacks, and a gray haired old man full of regret in present day.  After losing his wife, he spends the next 30 years going through the motions in a meaningless job and forgetting to actually live.  When he is diagnosed with stomach cancer he is given only 6 months to live, and it's at this time he decides to finally live life to the fullest.  Sad, hopeful, thoughtful, trying, and so raw with emotion that you feel Watanabe's (Shimura) grief foremost but also his hope.\n    Ikiru proves that Kurosawa wasn't just a master of samurai films and can handle a human drama with the utmost care and potency.  Any film that can push the viewer to think about their own life and what it is that they are living for has done it's job when trying to show the meaning of life and what it is all for.  While the film is grim and at the beginning downright hopeless and sad, once Watanabe finds his reason to live finally, he has renewed purpose and drive and lives his final months at the fullest.",
            "review_date": "2022-08-22",
            "source": "rt"
        },
        {
            "content": "Great Film.\nGreat Directing and Acting.",
            "review_date": "2022-08-20",
            "source": "rt"
        },
        {
            "content": "If pressed to name the most important and universally relevant film that I've ever seen, \"Ikiru\" would be the first one to escape my lips. An inherent feeling of urgency permeates the film's stirring emotional tone, yet we never feel as though we are being admonished or preached to. The near miracle is that the impulse to wake up to the bittersweet transience of life (mono no aware), as facilitated so movingly by \"Ikiru,\" emerges in what feels like a purely natural way. The film is a masterwork of story development and editing in the sense that every technical decision involving construction and execution directly sustains the film's deeper purpose of peering into the purifying depths of the lead character's awareness of his approaching mortality. As he awakens to life in an intermittently devastating and liberating fashion, we share his catharsis as we naturally envision ourselves in his place. The deeper realization is that, in a less condensed but equally important sense, we already are in his place. \"Ikiru\" is nothing short of a testament to the most important unspoken realities of life, crossing all cultural boundaries and binding us lovingly together with the bittersweet rejoinder that life is brief.",
            "review_date": "2022-06-25",
            "source": "rt"
        },
        {
            "content": "What a powerful movie; it's perfect in respect to its direction, photography; deeply moving in its story and examination of the fragile human nature; its screenplay is outstanding and the second part of the movie is a brilliant move, when they speculate about Watababe's behaviour and actions at his funerals. The film is saturated with scenes of immense power and beauty and variety, of realistic human interactions lacking understanding and meaning, on the surface.",
            "review_date": "2022-05-07",
            "source": "rt"
        },
        {
            "content": "\"Ikiru\" is a devastatingly sad but truly moving human drama. This is one of those classic films that just have a timeless appeal because of its profound and universal themes. I think at some point, whether young or old, we have all tried to find some sort of meaning in our lives and we all live with the fear that our time can be cut short at any moment. This film explores complex themes about life with a beautifully realized story. I think the movie is a bit on the slow side, but it is definitely very engaging once it gets started and it is certainly a film that will stick with me. Overall, out of the Kurosawa films I have seen so far, I think this is one of the best and universally accessible stories in all of cinema.",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "Known primarily for his medieval samurai epics, the quiet and thoughtful Ikiru is one of Akira Kurosawa's finest films, if not his best.  Mr Watanabe, a bureaucrat with the municipal government, is diagnosed with stomach cancer, forcing him to reflect on the emptiness of his life and, more importantly, the legacy he will leave behind.  While it may not be perfect (the montage of bureaucracy in action early in the film feels unnecessary and the wake at the end of the film runs a bit long), it is a film filled with existential angst that never becomes maudlin, a meditation of what our lives amount to and how others will view our actions when we are gone.  The themes are universal and the images that Kurosawa creates (Watanabe on the swing set, for example) are impactful and memorable.  Ikiru is a film that will linger with the viewer long after the movie ends.",
            "review_date": "2022-02-17",
            "source": "rt"
        },
        {
            "content": "Very deep movie. You have to feel the depression behind it.",
            "review_date": "2022-02-11",
            "source": "rt"
        },
        {
            "content": "Not often a Kurosawa fan but this is a well told yarn about a fan confronted with his mortality and wondering how to bring value to his final days. Most of us do administrative bull jobs and the protagonist battles to break free of those constraints to achieve something of value, having first lived a hedonistic lifestyle for a short period.",
            "review_date": "2021-08-14",
            "source": "rt"
        },
        {
            "content": "I hate to say I had a little bit of a problem with the movie's pacing, with some scenes feeling like they kinda dragged out for me. But besides that, Ikiru is a poignant, bittersweet, and ultimately moving drama about a man facing his imminent death that features a great performance by Takashi Shimura and very strong themes and a message for people to live life while you can. It's one of the great Akira Kurosawa's best.",
            "review_date": "2021-05-05",
            "source": "rt"
        },
        {
            "content": "How did this beautiful film escape my attention all these years?  As a former bureaucrat myself I can attest that Watanabe's fight against City Hall is spot on.  But the film's true greatness lies in it's core message: that we are all capable of redemption at any stage in our lives.  The performances are terrific and of course, Kurosawa's direction is flawless.  I recommend this poignant drama to all.",
            "review_date": "2021-02-28",
            "source": "rt"
        },
        {
            "content": "Kurosawa's deepest and most moving flm.",
            "review_date": "2021-02-15",
            "source": "rt"
        },
        {
            "content": "Life is temporary, but we all seem to forget it as we go through life. It sometimes hits you though. And usually the first thing to come to mind, especially in case of lives as Watanabe's, is our regrets. It is good that even one action can undo all those regrets. The film is painfully real. Also it is unbelievable to see that the political regime has not changed even after all those years. Therefore, with all its reflection on human nature and political criticism, the film manages to stay very modern to this day.",
            "review_date": "2021-02-08",
            "source": "rt"
        },
        {
            "content": "The saying \"every frame a painting\" is never rendered more true than it is by Kurosawa. Despite the black and white (or because of it?) truly every shot is meticulously composed. Even \"boring\" singles are, in fact, ones designed to be boring. Especially in a movie about the stultifying nature of government bureaucracy. There is one thing I wish about the movie though. For me, the choice to convey the story second-hand in the second half of the movie didn't quite hit right. I was so immersed in Watanabe's story, I desperately wanted to see what happened to him, first-hand. I can see the argument made that this was to make the audience miss Watanabe, perhaps even to doubt him like the other bureaucrats do. I missed on that part, but I really enjoyed the rest of it.",
            "review_date": "2020-12-29",
            "source": "rt"
        },
        {
            "content": "Touching and quite entertaining. Superb classic film.",
            "review_date": "2020-12-22",
            "source": "rt"
        },
        {
            "content": "Kurosawa's greatest achievement, Ikiru is as close to perfection as film has ever reached. Takashi Shimura gives one of the greatest performances in cinematic history as an aging bureaucrat dying of stomach cancer in a philosophically-rich landmark piece of existentialist art loosely based on Tolstoy's The Death of Ivan Ilyich. This is one of the few films which might legitimately inspire the viewer to alter their philosophy of life and one of a scant handful of movies which made me cry without feeling the slightest bit exploitative.",
            "review_date": "2020-09-12",
            "source": "rt"
        },
        {
            "content": "It took me FAR too long to watch this movie. Tremendous in all aspects. A must watch for any movie lovers",
            "review_date": "2020-06-15",
            "source": "rt"
        },
        {
            "content": "I have been on a bit of a Kurosawa kick as of late and am sad to say, all i knew of his work was Seven Samurai. So i set about looking at his other works and i bought this one (Criterion Collection) based just on the story synopsis and am i ever glad i did.\nThis is not a Hollywood film and you can see that at every turn (not that Hollywood dramas are bad but they tend to be obvious). Every time an event occurs to our 'hero' that seems like a time to amp up the drama or steer toward a typical redemption scene, it stays realistic even as it is able to make us really care for Watanabe-san's plight and emerging lust for life. It is not a simple movie. It doesn't bash you over the head with sentimentality and rarely even displays any. That might make it sound like a heartless film when in fact, it has tons of heart. All of the realism serves to make Watanabe-san's life change more relatable and thus, in my opinion more affecting long after viewing the film. It is not a fairy tale.\nShimura's performance is incredibly moving. Even though he does not outwardly complain of his symptoms, his increasingly bowed head and sagging demeanor reveal his disease's physical toll. Seeing him start to lift his head as he sees his purpose is a nice touch. One of the only truly sentimental moments in the film with Shimura singing as he accepts his limited time is a masterpiece of acting. He is surrounded with a few characters that are also intriguing and some, primarily the coworkers, that are more archetypes, however, the acting in general is very solid.\nKurosawa's technique throughout is nearly flawless. The shot compositions and long takes are so ahead of their time, especially for a mere drama. The use of sound and music at just the right times is very effective at drawing us in such as the silence when Watanabe-san exits the hospital only to be broken by a car horn as he snaps back to reality after the horror of what he just heard.\nAn absolutely beautiful film, asthetically, thematically, and emotionally. It affords multiple views to really appreciate it. Easily proves that Kurosawa was not just 'that samurai movie guy'.\nAn easy contender for the greatest film ever made.",
            "review_date": "2020-05-28",
            "source": "rt"
        },
        {
            "content": "The virtues of this film have been well addressed by droves of film critics. The same critics in general seem almost afraid of writing anything critical of Kurosawa and his films. For all the aesthetic value of the screenplay, direction, camera work, I found some issues with the movie that I feel it's only fair to mention as well.\nThere is some questionable, at best, acting from many of those in the film. All the overt nodding from the men from his office at the wake, along with some very poor attempts at looking drunk. The young woman in the movie, Toyo, often just bursts out laughing loudly, almost out of nowhere. Is this supposed to make her seem 'full of life' like typical youth in the face of the old crumbling Watanabe, who it seems hasn't truly 'lived' for 30 years? For me, it seemed awkward and rather took me out of the movie. Also, not a single one of the reviews I've read or heard mentions scenes like when Watanabe is trying to get Toyo to explain how she is 'so alive'. She is disgusted, freaked out by and afraid of him as he gets so aggressive. \nThe scene on the swing set at the end was not some overwhelming, amazing scene that filled my heart with warmth as many go on about. It was a very nice image, yes. But what was with the weird, distorted voice? And does dying keep you from getting cold in the freezing weather? \nStill, it isn't hard to see the power and artistry of the film. I still find much of the acting rather stilted, but I guess I'm in the vast minority on that; or at least the minority who will admit it. 3.8 stars",
            "review_date": "2020-05-28",
            "source": "rt"
        },
        {
            "content": "Shimura (I say again) is one of the screen's greatest actors, and his performance here is surpassing. The performances also of Yunosuke Ito and Miki Odagiri are merely outstanding. As ever Kurosawa includes hackneyed filmic moments, but the moral seriousness of the depiction of the depradations of hierarchy covers every flaw. If you don't weep ...",
            "review_date": "2020-05-15",
            "source": "rt"
        },
        {
            "content": "What can I say? You have to see it to believe how good it is.",
            "review_date": "2020-04-30",
            "source": "rt"
        },
        {
            "content": "Impressive, existential, sad and affectingly hopeful",
            "review_date": "2020-04-26",
            "source": "rt"
        },
        {
            "content": "Ikiru is another perfect film made by Akira Kurosawa himself. I love everything from this movie from the acting to cinematography. I also love the story about a bureaucrat who decides to do something good before he dies from stomach cancer. It really brings me to tears to show an old man, who is on the verge of dying, doing something for the people of his town. Overall, Ikiru is a movie that shows no swords nor fight sequences but only dedication and determination.",
            "review_date": "2020-04-16",
            "source": "rt"
        },
        {
            "content": "Narratively, I feel that Ikiru represents Kurosawa wielding a hammer rather than a scalpel, especially compared to some of his masterpieces like Rashomon. However, that doesn't take away from the emotional impact of this film, commenting on universal themes such as mortality, purpose, and bureaucracy, which resonate with all but retain a distinct Japanese flair. The entire picture bears Kurosawa's distinctive visual watermark as well; the swing set may be one of the most iconic single shots in the director's entire output. (4.5/5)",
            "review_date": "2020-04-09",
            "source": "rt"
        },
        {
            "content": "This movie, not only deeply overwhelming, but also taught me the purpose of living my life. The acting was poignant and the film burns slowly into your mind as you keep on watching until its last moments.",
            "review_date": "2020-04-03",
            "source": "rt"
        },
        {
            "content": "One of AK's most of representative, emotional, and multi-layered works, ikiru proves to be an almost Perfect masterpiece of inspiration that still rings true to the hearts of today.",
            "review_date": "2020-01-28",
            "source": "rt"
        },
        {
            "content": "Kurosawa's wisdom is on full display in this movie. He's honest about showing the different whims and images that go into someone's head before they find the proper way to make use of the their knowledge, experience and talents.",
            "review_date": "2020-01-13",
            "source": "rt"
        },
        {
            "content": "A moving reflection on the joys of life.\n\nAkira Kurosawa's epic drama Ikiru (1952) is a sublime rumination on what is really significant in a person's life. An intimate film that follows an old man dying of stomach cancer as he attempts to find a reason to live. Kurosawa's editing is fantastic and inventive as Kurosawa cuts seamlessly to the past with flashbacks and in the present. His tight editing also gives this mammoth drama a brisk pace. I adore Fumio Hayasaka's classical score for Ikiru. It sounds tender and romantic, but with a reflective maturity at all times. For all the dark material of Ikiru, I actually found it delightfully endearing and constantly funny. There is a general somber tone and it's emotionally devastating, but the majority of Ikiru steps into the world of black comedy.\n\nIkiru means \"To Live\" and that's the exhilarating and heartwarming feeling you get after watching this loving masterpiece from Kurosawa. His writing is tender and affectionate towards his pathetic elderly protagonist that you cannot help but feel sorry for this lonely old man. Ikiru is a cute film that's inspiring. I guarantee any viewer of Ikiru will find a new perspective on life and what to go out and have fun.\n\nKurosawa's direction is beautiful with Asakazu Nakai's unforgettable cinematography with shots like the hero sitting on a playground swing in the snowfall as the camera slows pans behind playground bars to reveal the man is happy. Clever visual metaphors are abundant in Ikiru like the old man stumbling and tripping on his own coat to make him look more frail or the camera panning down as a man helpless to rise above his work is buried under his work papers. Ikiru is a treasure trove of stunning visual prowess and powerful imagery. Kurosawa knows that he is both trying to make people identify with his unlikely lead by utilizing universal messages of compassion and joy to allow audiences to relate. Akira Kurosawa's finest direction may very well be in Ikiru as 143 minutes pass by like a sweet dream.\n\nI think there will never be enough praise to properly describe Takashi Shimura's lead performance as Kanji Watanabe. He is incredibly moving and sympathetic whether it's his wide eyed shock, quivering mouth of helplessness, or his mournful rendition of \"Life Is Brief.\" Shimura forces the audience to empathize with his feeble cancer stricken man because he plays him so fragile. He stumbles and limps while he walks, he stutters his words to sound older than Shimura was at this point. I think his expressive face and desperate pleading eyes is what sells Ikiru for me. His looks of anguish and longing convey a sadness so deeply profound that he is universally relatable to any person who has ever suffered with depression. He is the poster boy for unhappy man, who genuinely wish for betterment in their lives. I simply love Takashi Shimura in Ikiru.\n\nIkiru features any number of neat little supporting roles whether they are cold family members like Nubuo Kaneko's estranged son Mitsuo or self gratifying diplomats like Nobuo Nakamura's deputy mayor. However, the kindly characters stuck out to me the most. I adored the character of the novelist, sympathetically played by the nuanced Yunosuke Ito. He gives the next best acting after Takashi Shimura in Ikiru for my money. Miki Odagiri is a revelation as Toyo with her bubbly personality and sincere compassion for an old man who is nice to her. She also manages the difficult role of not understanding his pain completely as he is experiencing it. Odagiri's playfulness is particularly fun opposite the dour seriousness of Shimura's performance as Watanable. I should mention Bokuzen Hidari's hilarious acting as essentially the oldest man in the world.\n\nI found Ikiru's critique of capitalist lethargy interesting as well for anyone at work in Ikiru is bored and uninspired. All of the bureaucrats defend a broken system that maintains the status quo and leaves the average citizen suffering in misery and filth. What could have been a nihilistic message of hopelessness turns into a glimmer of aspiration as Ikiru demonstrates how one person can change the world if they have the willpower and courage to do so. Ikiru takes on lazy government policies as well as dull lifestyle routines, so that you want to be more spontaneous and happy by the end of Ikiru.\n\nIkiru feels like a happy medium between Wild Strawberries, It's a Wonderful Life, and A Christmas Carol as parallels can be drawn between these narratives of a miserly old man reflecting upon his wasted life, who must learn to overcome his inaction. I found shades of The Farewell and Citizen Kane. Ikiru is as classic as any of these iconic pieces of cinema. Akira Kurosawa outdid himself with a mature film well beyond his years as he astonishingly directed Ikiru early in his directing career. Ikiru is important, influential, and as entertaining as dramas come!",
            "review_date": "2019-12-14",
            "source": "rt"
        },
        {
            "content": "The finest film ever made— without peer in every sense. Truly, an emotional, life altering tour de force ....with Kurosawa at the top of his game. This film carefully and beautifully shows us the transformative power of finding meaning in our life - no matter our situation. If this film does not move you and have you thinking carefully about your life, nothing will. ",
            "review_date": "2019-05-13",
            "source": "rt"
        },
        {
            "content": "This is one of those MUST SEE films before you DIE.  WHY?!!! Because it's about life and living and DEATH in the light of a fading life.  \n\nWhat films and movies should be about as they teach us things whether we'd like to admit it or not.  Now, well into the 2000's movies, music, and art are about hedonism and random entertainment.  Pure pleasure because we can WASTE our time and money.  Guess what?  People weren't able to do that before and REALLY we never had the time to do so, we just chose to WASTE our time on GARBAGE movies, music, and art.  The FUTURE generations will pay for our hedonism and overconsumption of mass entertainment.  THIS movie is not a waste nor random entertainment.  It is REAL storytelling, characterization, and YOU WILL BE CHANGED after you see it.  Like a tribal wiseman telling his story about the beginning of the tribe you will be MOVED, which is what REAL art does.  It moves your soul to the REAL and towards becoming something better.",
            "review_date": "2019-02-26",
            "source": "rt"
        },
        {
            "content": "Even with its pace cut down by a classic Kurosawa overwrought story structure, Ikiru functions with the highest marks as a humanist drama on a theme of utmost importance: the meaning of life.",
            "review_date": "2018-10-17",
            "source": "rt"
        },
        {
            "content": "I thought the first 2/3 of the film was amazing existential drama but was a bit disappointed by the final third's shift to a debate over what the main character's actions meant for his colleagues. The film's greatest strength was Takashi Shimura and I'd have liked to have followed his perspective through to the end rather than shifting to others talking about him with occasional flashbacks. His existential drama was just intrinsically more powerful and universal than the didactic stuff about bureaucratic sclerosis.",
            "review_date": "2018-09-15",
            "source": "rt"
        },
        {
            "content": "You know u saw a good movie if it still feels relevant after 60 years...in the end the world havent changed so much...heartwarming",
            "review_date": "2018-08-18",
            "source": "rt"
        },
        {
            "content": "Very powerfull movie. Yet another masterpiece by kurosawa-",
            "review_date": "2018-06-06",
            "source": "rt"
        },
        {
            "content": "Fascinating film.\n\nI was really surprised that the issue this film tackles is the same one that is still plaguing Japan to this day. I suppose it's that deeply rooted.\n\nThis film explored a wide range of issues very well. Weaved them all together. Life's worth, death, family relations, life-work balance, and even fucking criticisms of bureaucracy, government, and Japanese culture as a whole. All tightly told in this one guy's tragic story.\n\nIt was technically very impressive. A whole lot of insanely creative shots. Extremely impressive cinematography and framing. Scene arrangements. All so organic, working naturally well. The sound was also pretty impressive, since I was expecting the sound department to be a bit lacking because of the movie's age. The acting was mostly very fitting, surprisingly realistic and true to actual human behavior. The film was edited in a style that actually felt recent. A lot of energetic cuts.\n\nThe story itself was also really well told. From directly engaging the audience, to changing up the pace of the movie, to shifting from linear storytelling to nonlinear flashes forwards and backwards. It was all very surprising. I didn't expect to see such intricacy.\n\nOverall this was a very impressive and eye-opening experience. I enjoyed it a whole lot more than I thought I would.",
            "review_date": "2018-04-09",
            "source": "rt"
        },
        {
            "content": "Truly a masterpiece.\n\nKanji Watanabe is a civil servant. He has worked in the same department for 30 years. His life is pretty boring and monotonous, though he once used to have passion and drive. Then one day he discovers that he has stomach cancer and has less than a year to live. After the initial depression he sets about living for the first time in over 20 years. Then he realises that his limited time left is not just for living life to the full but to leave something meaningful behind...\n\nWritten and directed by the legendary Akira Kurosawa, this is his magnum opus. Yes, Seven Samurai, Rashomon or Yojimbo might be more popular or more critically acclaimed but this, for me, is his greatest work.\n\nIncredibly profound and thought-provoking, examining life and living it plus death and what you leave behind. Also takes a dig at politicians and the wastefulness of the civil service.\n\nVery engaging too: characters are well-formed and develop throughout the movie. Moreover we empathise with Watanabe and his issues, issues which are relatable.\n\nHighly emotional towards the end too, as we see the impact he has made.\n\nA timeless classic.",
            "review_date": "2018-01-20",
            "source": "rt"
        },
        {
            "content": "What a penetrating, heartbreaking film this is, a movie so revelatory in its honesty that it ends up being the most authentic depiction of humanity ever brought to the screen.",
            "review_date": "2017-07-23",
            "source": "rt"
        },
        {
            "content": "I think anyone could relate to the journey of Kanji Watanabe in Ikiru. Of course we aren't all facing death, but the journey to find purpose and meaning in life is totally relatable. What the movie does well is condense the entire exploration of life's meaning because Watanabe has so little time to figure it out. There are some real heartfelt moments and I could see people getting emotional at times. It didn't quite hit me that deeply, but perhaps if I was in a different mood it would have worked. \n\nTakashi Shimura has a very interesting way of playing the protagonist. He kind of mumbles all the dialogue, and also has a heavy rasp in his voice. That combined with his continuous dour expression makes me wonder why it wasn't obvious to everyone he was about to die. I thought the rest of the cast did a good job, particularly the two companions who help Watanabe through his journey. I just wish his coworkers were established better from the start so I knew them in the end.\n\nIkiru has a tendency to go to repetitive extremes at times to make its point. There were a number of sequences where I found myself thinking \"OK, I get it, can we move on?\" But the movie was not interested in moving on that quickly. There's value in it at times (particularly in the early sequence that shows the women getting the runaround about building a park) but I couldn't sense that value every time. It's tough, because I didn't hate the film at all, but it didn't do enough for me to understand why it is so highly praised.",
            "review_date": "2017-06-02",
            "source": "rt"
        },
        {
            "content": "?????????, ????????????, ??????, ?????? ????????? ?? ??????????????, ????? ??????????, ???????? ????? ????? ???-???? ????????? ????? ???????? ?????????????",
            "review_date": "2017-06-02",
            "source": "rt"
        },
        {
            "content": "The wheels of bureaucracy",
            "review_date": "2017-05-24",
            "source": "rt"
        },
        {
            "content": "Quite probably my favourite Kurosawa picture (...so far)",
            "review_date": "2017-04-22",
            "source": "rt"
        },
        {
            "content": "A dark and heart-wrenching, yet beautiful analysis of what a life well-lived really is. Akira Kurosawa elevated the form with this gorgeous masterpiece of Japanese cinema. With the empathy and truth brought to characters seen in his grand epics, combined with an intimate atmosphere, Kurosawa gets to the heart of the human condition. It's a story about the inevitability of death, but it doesn't bore you or depress you. Rather \"Ikiru\" shows a man on the brink passionately observing life in motion, that fleeting thing that he's missed out on all this time.",
            "review_date": "2017-04-15",
            "source": "rt"
        },
        {
            "content": "Sometimes films released more than 50 years ago don't have the same impact they once did. Well, that's not the case at all for Ikiru, one of Akira Kurosawa's first universally praised hits.\n\nIkiru tells the story of a man out of time. A bureaucratic man who has worked the same job for decades and can't seem to find any purpose in his work or life in general. That is, until he finds out he has terminal stomach cancer. What follows is a coming of age story for a middle aged man who does his best to leave an impact on the world he will inevitably leave. With one of these types of stories, it all comes down to execution. The only way to make a film like this leave you with a particularly effective message is to have a filmmaker like Kurosawa. For the most part, I did go through the emotions the film wanted me to. It's also a story that lends itself to being more relatable the older you get. It's not easy for a 23-year-old guy like me to understand what Watanabe goes through in Ikiru, but it may be something that I relate to more as I get older.\n\nI found this film to be especially inspiring from his co-workers perspective. No one at the office does anything of value it seems, and it's only until after Watanabe takes a leave of absence and goes on a journey of self-discovery that they feel like they need to do something as well. The film shifts from Watanabe's story to his friends & families' story about half way through. I found each part to be interesting in its own right, but watching the people he cares about look back on his life and the impact he seemed to have made was some powerful stuff. The lessons and themes in the film are important ones. Pleasure is not living. Don't always do things for others or to please others, make sure you're taken care of as well. And most importantly, life is brief, make of it as you wish.\n\n+Poignant\n\n+Kurosawa's direction (duh)\n\n-Two separate parts feel jarring at first\n\n8.4/10",
            "review_date": "2017-03-29",
            "source": "rt"
        },
        {
            "content": "First off right off the bat, the narrator is great. It was really nice to see a different side of Japanese cinema I've never seen - the 50's. Scenes that took place in the bars and on the streets, made me realize how Westernized things were even back then. Seeing how respectable Japanese culture is, really humbles you. The amount of respect in a bow is admirable.\n\nIt's really sad to see how someone just wasted away the years of their life by doing nothing. What's even sadder is that it happens to a lot of people. They get stuck in this little bubble and never break out of it. Like they say in the movie, life is to be lived to the fullest and with joy. \n\nOn another note though, the girl from the office that visits him at his house, is really cute and charming. \n\nBrilliant writing, especially towards the second half of the movie. The way it keeps going back and forth telling the story. This movie is 2 and a half hours long but it went by so quickly due to the brilliant writing, the wonderful acting, and the interesting story line.\n\nThis movie just proves how fucked up the bureaucratic machine really is and no matter what happens (people dying or whatever), things won't really change. But what does matter is trying to make a difference in the world and helping out people in any way possible. Living your life to the fullest and just trying to be a good person. \n\nOverall, very enlightening film. It can definitely open your eyes to a lot of things. I will definitely watch this one again.",
            "review_date": "2017-03-25",
            "source": "rt"
        },
        {
            "content": "I'm in the early stages of my Kurosawa journey, and to say that this is his best work so far is a spiritless understatement.  As I will see, Takashi Shimura (Watanabe) is to Kurosawa what Jack Nance is to a David Lynch film, and where I'd left off at Drunken Angel with him concerning over another's disease, here he is now the afflicted one in a performance so emotionally riveting that it's transcendent.  There's a moment near the end of the film where he's standing up to authority, and the way his eyes dart, fearful of the consequences but relentless in his pursuit, is so honest that it goes beyond what an actor embodies.\n\nIn my journey thus far, Kurosawa has painted such a human portrait of Japanese culture that I often forget I'm watching a foreign film. I've learned that the culture is very much American, the music and dance, the attitude on the streets, prostitutes and gangs, singing \"happy birthday\" in English, certain words printed in public places in plain English.  \n\nIf Watanabe's suffering is evident enough by the bored way he sits there doing his work, or by how pathetically overwhelmed he is to nightlife, it becomes painfully clear when he starts for fall for a young girl who was inspired by him to quit their mutual workplace.  Here we see her giggly girlishness contrasted against his old \"mummy\" mannerisms, and his foolish fascination with her youth.  Eventually she's not so childishly happy with him, but creeped out by his leering - we can only feel sorry.  But he's inspired, he's going to make a change that will carry him through the remainder of his days.  And he acts on the good of his community, making him a saint in the eyes of many.  This is foreshadowed much earlier when his nightlife friend calls himself a Christ figure, but having nothing but knowing he'll die to back it.  \n\nBut the film is grounded in neorealism.  Our protagonist is shockingly dead with more than forty minutes of film left.  The rest of his journey will be dealt with in flashbacks as his coworkers get drunk at his funeral and start to consider the idea that this new park in town happened because of him, something they only consider more seriously after the deputy mayor and other authorities have left.  One coworker had flat out stated that it was in fact, but the rest, bound by the great system, were too afraid to see it this way.  After they each share their stories and piece the puzzle together, they see clearly that this is Watanabe's park, and swear to uphold his honor and act as he did.  The opportunity is presented in the following scene, and nobody acts as Watanbe would've, but follow suit with the system.  Our one defender stands up, his chair falling over, but to no avail.  He returns to his seat, and the camera focuses on the paper stack of work all are encumbered by.  Later he returns to the park in memoriam of Watanabe, and we hear that Life is Brief tune for the third time, but more faint and without the lyrics.  Whereas so many films struggle to have good endings, this is a brilliant note.  He walks away on the bridge, and an odd frame of that, the sky, power lines, and the top of the park's swing set fill the frame.\n\nI'm taken by the film's honesty, by the mesmerizing performances, by the sadness of life, systems, destined behaviors, missed opportunities, that the right thing comes at great hardship and sacrifice.  This is a journey story, the time slot allows for us to get that in a huge, satisfying serving.  We get so lost in the idea that he's left his job, and the absurdity that two weeks goes by, that we forget about the idea of what would happen if he returned.  We get all of it here.  \n\nWatanabe is a Christ figure, he does carry the cross on his back in the form of burden. Christ died at age 30, Watanabe hasn't missed a day of work, or lived life, in 30 years.  This is the thing a 30 year old like me needs to see!  He does this to protect his son.  We get a devastating flashback to his wife's funeral procession, his son flinging himself into his arms, crying as the Hearst turns a corner and he confronts the reality that he'll never see his mother again - watch Watanabe's face, it's awe-inspiring to see such rich emotion from an actor, experiencing the pain of this loss.  In the end, he makes sacrifices for his family and then his community - they love him, and they weep for his passing.",
            "review_date": "2017-02-17",
            "source": "rt"
        },
        {
            "content": "What if in the dreary days of middle-age, as you were cruising along in the set routine of your life, you came to understand you had six months left to live?  And further, that your son and his wife looked forward to their inheritance more than they cared for you, and that your co-workers mocked you for how little you accomplished in your meaningless, bureaucratic job?  Such is the fate of Kanji Watanabe, played by Takashi Shimura, in an excellent movie by Akira Kurosawa.   It may sound depressing and I suppose parts of it are, but Shimura's face evokes such a depth of emotions, Kurosawa's story-telling is so brilliant, and the movie is so profound, that you can't help being gripped by it.   Ikiru - To Live - what does it mean to live, what is the meaning of life, when it's so brief?   Can there be meaning?\n\nWatanabe at first 'lives it up', going out on a bender with a stranger he meets, playing pachinko, visiting dance halls, drinking, and going to a strip club.  It's the reaction some have to the horrifying transience of life, and in some sense, the characters are right when they say that he has begun to live when he found out he was going to die.  It's an immature, unsatisfying reaction, however.  He attempts to get closer to a much younger woman from his office, played with childish spunk by Miki Odagiri, not in an attempt to seduce her, but because he admires her passion, and her decision at an early age to leave her boring job.  She ever-so-subtly steers him onto the right path by saying he needs to find his own things to make, and he has the idea to use his remaining time fighting for the cause of park which has is stuck in a bureaucratic quagmire.  Therein lies his redemption.\n\nThe movie is distinctly Japanese, with customs like bowing and strict hierarchy on full display, but on the other hand, it has a universal feel to it.   Faust and 'Ecce Homo' are referenced.  The screenplay was influenced by Tolstoy's \"The Death of Ivan Ilyich\".   The nightclub scenes are highly Western, particularly the piano player.  There is evidence of Kurosawa's artistry throughout the movie, with scenes in light and shadow that might remind you of paintings by Caravaggio.  The film itself may also remind you of Ingmar Bergman's masterpiece, 'Wild Strawberries'.  And of course, the theme itself connects us all at that most fundamental of levels.\n\nThe story is often told in flashbacks, and revealed gradually.  It's poignant seeing Watanabe's relationship with his son over the years.  It's profound that he eventually realizes he needs to do good deeds with the time remaining, and that, despite obstacles in his path, he says \"I can't afford to hate people - I haven't got the time\".  If only we could all come to this realization!  He will see the beauty in a sunset, and perhaps in the most moving scene, swing on the playground in the park he built, singing 'Gondola no Uta', whose lyrics are \"life is brief; fall in love, maidens, before the crimson bloom fades from your lips.\"  While he had sung those words despondently before, he now sings them in quiet triumph, knowing he may be the only one who ever understands his life and his truths.  Perhaps it's the best any of us can hope for.",
            "review_date": "2017-01-22",
            "source": "rt"
        },
        {
            "content": "A tour-de-force, one of those few movies that can potentially alter the course of your life",
            "review_date": "2017-01-20",
            "source": "rt"
        },
        {
            "content": "Ikiru is slow paced but wastes no time ripping your heart out.",
            "review_date": "2016-12-11",
            "source": "rt"
        },
        {
            "content": "5 Stars. Such a perfect, beautiful little film.",
            "review_date": "2016-11-20",
            "source": "rt"
        },
        {
            "content": "Has Akira Kurosawa ever made anything that wasn't considered one of the greatest films ever made?",
            "review_date": "2016-11-20",
            "source": "rt"
        },
        {
            "content": "Beautifully crafted, handsomely acted, and heart-wrenching, this life portrait rewards sympathy with inspiration.",
            "review_date": "2016-10-02",
            "source": "rt"
        },
        {
            "content": "\"How tragic that man can never realize how beautiful life is until he is face to face with death.\"\n\nSo after I watched the masterpiece \"Seven Samurai\" back in April, I couldn't wait to watch another Kurosawa movie. \"Ikiru\" was one of his movies that I wanted to watch next after hearing so much recommendation for it from The Criterion Collection selection. And the fact that this has been on my watch-list for quite awhile. Actually, it's been on there for over three years now and I finally got myself to watching it.\n\nAnd what can I honestly say about this one.\n\nThis movie broke me, but surprisingly in the best ways.\n\nIkiru is a miserable and yet powerful film that has a hard hitting message. And to think that this movie was made in the 50's can have a deep impact on you and make you think twice about your life.\n\nI have this feeling inside of me that Kurosawa is slowly becoming my favorite director. The camera work, the transmissions and the finest of acting are only naming a few things that's great about this movie. Never as a film that captured depression and people who are diagnose with cancer so damn accurate. Or how relatable it is even today. He really dose live up to be the most influential directors of all time, as he's film making style is seriously impressive beyond any words. As for right now, I only seen two of his films and I'm already in love. Akira Kurosawa is cinema. No question about it.\n\nTakashi Shimura delivers such a raw and haunting performance that you just want to reach out and give the guy a hug. It's one of the finest piece of acting I've ever seen. I don't think any other performance broke me down like this guy did. I mean, a scene that involves a man simultaneously reminisces over a favorite song of his, whilst contemplating imminent death in a drunken state of melancholy. The sadness and regret was captured so perfectly just by his face and eyes that tells so much without him saying anything. Even as I'm writing this right now, I see have the image of Shimura sad face is implanted in my head. And to think that about two years later this guy will be in \"Seven Samurai\", which I didn't know while watching this. That's how good he is.\n\nThis is one of the most honest look at life anyone has ever portrayed on the screen and it will be long before anyone can do the same. What makes this Akira Kurosawa greatest achievement is by displaying the most poignant images in cinema. Watanabe (Takashi Shimura) swinging slowly in the children's playground, singing to himself, \"Life is so Brief/short\" while snow softly falling. And here's something interesting I found out before I started writing this. Akira Kurosawa instruct Shimura to sing \"Song of the Gondola,\" as if you are a stranger in a world where nobody believes you exist.\n\nKurosawa is just a genius and he never stops to make us be so awed at his work.\n\nOverall rating: Ikiru is a movie that I think everyone needs to see. To anyone who lived through cancer or got cancer, I know this movie will touch you very deeply. It's depressing and inspirational at the time.",
            "review_date": "2016-10-02",
            "source": "rt"
        },
        {
            "content": "A carpe diem plot. I wasn't quite as impressed with this film as many people seem to be, mainly in that the plot seemed too formulaic even for 1952. Also their was too much negativity for the plot to make a more transcendent optimistic point, which may not have been intentional. What still makes it a great film is  the acting and originality of the characters and dialogue, along with historical and cultural context.",
            "review_date": "2016-09-24",
            "source": "rt"
        },
        {
            "content": "One of the very few perfect movies i've seen in my life.  The art of cinema exists to achieve such heights.",
            "review_date": "2016-08-18",
            "source": "rt"
        },
        {
            "content": "It belongs to  a wonderful area for social justice thinking: after ww2 and before 60s anti-establishment movement. Demonstrated the potential of dedication to the proletariat causes using the tool that was available: bureaucracy. The emphasis on collective (mothers) and an individual  (Watanabe) simultaneously  was a fantastic synthesis example.",
            "review_date": "2016-08-17",
            "source": "rt"
        },
        {
            "content": "Ikiru is a compelling, riveting, and spectacular story about the meaning of life, found in Akira Kurosawa's excellent direction, and powered through an incredible performance from Takashi Shimura, in perhaps the best movie of the legendary director's career, and one of the bests ever made in cinema.",
            "review_date": "2016-06-06",
            "source": "rt"
        },
        {
            "content": "An incredible piece of cinema, Ikiru is deeply moving, and it sheds some light on government inefficiency, especially in the final act of the film.",
            "review_date": "2016-04-07",
            "source": "rt"
        },
        {
            "content": "I'm still pretty unfamiliar with Akira Kurosawa's work as this is only my third film from the man.\n\nWe follow a dying man. He's had the same job for many years, no sick days and he lives a boring life. That's the thing - he never really lived. His son is not proud of him, he has never bought himself a drink and he is suddenly in a big life crisis, just months before his predicted death. He decides to change this but it's not an easy task, he has no experience in true living. This is a sad and very humane film - one of the most humane I have seen.\nGreat shots and I've seldom seen a man act as such a troubled man. Full of sorrow, self hate and feelings of failure.\n\nThe bureaucrat life is taking a bit much space og the last hour or so, even if that's where we get the nice flashbacks - almost like we do in \"Wild Strawberries\" even of they only goes weeks back and not decades, A simple but splendid story well told. Heartbreaking and a learning experience of what life really is about.\n\n8.5 out of 10 swings.",
            "review_date": "2016-04-06",
            "source": "rt"
        },
        {
            "content": "The first half of Ikiru (\"to live) focuses on an elderly bureaucrat (Takashi Shimura) who embarks on a heartbreaking quest for identity after receiving notice of mortal illness. The second half of the film takes place after this man has died and it studies what kind of effect his passing has made upon those around him. Director Akira Kurosawa relies heavily on facial closeups to bring impact to the film's themes and this helps his cast deliver lines in a way that transcends subtitle barriers. While Ikiru does make plenty of room to take potshots at the inadequacies of government, the movie as a whole is an emotive, honest, and forthright meditation on the nature of human frailty in its myriad forms.",
            "review_date": "2016-03-17",
            "source": "rt"
        },
        {
            "content": "A sensitive and touching tale of a man dying from cancer and trying to accomplish one last meaningful deed before he dies.  From the great Akiro Kurosawa, Ikiru evokes many emotions such as sadness, pity, empathy, joy, etc.  A must watch for any cinema student.  After all, this is another masterpiece from Akiro Kurosawa.",
            "review_date": "2016-02-05",
            "source": "rt"
        },
        {
            "content": "This is an absolute Masterpiece, and might be master director Akira Kurosawa's best film.  The story is great, the lead performance is outstanding, and in a way it's life affirming.  I thoroughly enjoyed it and very highly recommend it!",
            "review_date": "2015-12-26",
            "source": "rt"
        },
        {
            "content": "Slow, moody and poignant, all of which emphasis the deep soul searching that occurs in the first part of the movie, and make up the sum of its parts.  It's a really interesting look on how a person without meaning in their life enacts to define it.",
            "review_date": "2015-12-15",
            "source": "rt"
        },
        {
            "content": "A special, bittersweet and sometimes surprisingly funny celebration of the act of living, beautifully directed and with a wonderful performance by Takashi Shimura as an awkward old protagonist who should inspire us all to reconsider the way we have been living our lives.",
            "review_date": "2015-11-15",
            "source": "rt"
        },
        {
            "content": "Will watch this for 10th time on my way to Singapore.",
            "review_date": "2015-11-13",
            "source": "rt"
        },
        {
            "content": "94%\nViewed this on 24/10/15\nOne of Akira Kurosawa's most realistic and layered films, it explores the human condition with such excellent care and depth. It's well acted and Kurosawa takes great care in bringing out well controlled performances from even his supporting cast and extras. This is one of the director's least known great films and it's narrative and story structure especially in the second half is intriguing.",
            "review_date": "2015-10-25",
            "source": "rt"
        },
        {
            "content": "One of the most arthouse movies to ever arthouse, Ikiru (literally translated as \"to live\") is the complete opposite of Kurosawa's samurai epics, and is an intimate chamber piece, as heartfelt and affecting as his other films are epic and thrilling. Discovering he is in the last stages of terminal stomach cancer, an elderly civil servant emerges from his self absorption and devotes his last days to discovering the purpose to life, which ultimately leads to him building a kids playground in the slums. A rare case of Kurosawa tackling (and criticizing) modern Japanese society, Akira Kurosawa demonstrates his range by segueing from acidic dissection of Japanese office workaholism to understated, uplifting tragedy. One of the greatest masterpieces in any language, If you don't cry at the end at the unbearably moving final image of a man on a swing in the rain, you need a new heart.",
            "review_date": "2015-06-11",
            "source": "rt"
        },
        {
            "content": "Probably the best film ever",
            "review_date": "2015-03-23",
            "source": "rt"
        },
        {
            "content": "A heart-breaking and very moving film - yet inspiring and uplifting in equal measure. A fabulous film that details the very essence of mortality and life itself in a thought provoking way. Leads the audience to treasure and examine their own lives and sticks with you after the final scene. Highly recommended!",
            "review_date": "2015-01-11",
            "source": "rt"
        },
        {
            "content": "The existential struggle. One of my favorites of his.",
            "review_date": "2014-12-26",
            "source": "rt"
        },
        {
            "content": "A true classic. About as hard-hitting as they come; sober and genuinely touching. Don't go into it thinking of it as a classic, or as a reviewer trying to rate it, or anything. It's beyond all that. It is what it is -- a mirror. Approach it as a human being -- that's how it approaches you. Let it affect you (which it may deeply do anyway). The film is in my estimate probably unrateable, but after my first viewing I'd say it's either a 4.5 or a 5.",
            "review_date": "2014-12-04",
            "source": "rt"
        },
        {
            "content": "Great story. Brilliantly filmed. A classic.",
            "review_date": "2014-10-15",
            "source": "rt"
        },
        {
            "content": "Kurosawa's \"Ikiru\", which literally means \"To Live\", is an emotional, heartbreaking and affecting movie that tries to explore what does the life really mean, through a story of a dying man who searches the meaning of his life.\n\nTruth be told, Ikiru is not as subtle as his previous work Rashomon and what makes this powerful is his direction .\nWe all know that Kurosawa is a master at storytelling. At the beginning he uses a narrator to introduce few things and then make the flow of the story itself on a linear surface. When the movie comes to its second half the way Kurosawa presents the rest of the story becomes completely different, also it makes the film a ' little 12 angry men '. .\nSome shots and sceneries are unbelievably powerful. For an example, there cannot be more than a few scenes, even a diehard art movie fan can witness as emotional and symbolic as the 'swinging in the snow ' scene of this film. I was shocked when I saw it for the first time. \n\nEverything I wrote was about Kurosawa's talent. Now it's time to bring the other person who deserves honorable mention for his performances throughout the entire movie as the main character 'Watanabe'. Speaking of 'Watanabe', he is a man who doesn't move much, but he is a man of immense emotion. He expresses himself through his eyes. To bring up that kind of character blended with Kurosawa's Close-up shots is not an easy task. But kudos to Takashi Shimura, who has delivered that perfect act. And the song he sings 'life is brief', may be the saddest song you will ever come across in a film. I'm pretty sure, that song will completely and utterly shatter you.\n\nFinally, I'm going to introduce this as a life changing movie, which should be watched at least once by every cinema lover. A triumph of humanity. If you aren't moved by this movie, you really need to check your pulse.",
            "review_date": "2014-10-07",
            "source": "rt"
        },
        {
            "content": "No words. Just watch the thing.",
            "review_date": "2014-09-16",
            "source": "rt"
        },
        {
            "content": "A captivating and poignant tale with masterful direction, even if at times the camera does linger just a bit too long on those sorrowful frown's of the lead character.",
            "review_date": "2014-09-11",
            "source": "rt"
        },
        {
            "content": "Profound and deeply moving!",
            "review_date": "2014-07-08",
            "source": "rt"
        },
        {
            "content": "Directed and co-written by Akira Kurosawa, this touching and moving drama was partially inspired by Leo Tolstoy's 1886 novella The Death of Ivan Ilyich. You could almost say this is Kurosawa's take on It's A Wonderful Life (1946), and there are parallels in places. But this was the one that helped put Kurosawa on the map as a internationally renowned talent, and it was onwards and upwards after the success of this. Set in Tokyo, bureaucrat Kanji Watanabe (Takashi Shimura) is a middle aged man who has held the same monotonous position for about 30 years, and nothing has changed in that time. His wife is dead, and his son Sakai (Haruo Tanaka) doesn't have much time for his father, only his money. However, when Kanji learns that he has stomach cancer and will die within a year, something changes in him. He decides not to tell his son, and he ends up spending a lot of time in nightclubs in Tokyo. He starts spending more time outside the office and when he meets office employee Toyo Odagiri (Miki Odagiri), he begins to embrace and enjoy life a lot more. It's a sentimental drama without becoming unbearably mawkish, and it's an ode to the joys of life you can find if you just get out of your daily routine more. This would win a Special Prize at the 1954 Berlin International Film Festival, and for his follow-up, Kurosawa unleashed Seven Samurai (1954).",
            "review_date": "2014-05-01",
            "source": "rt"
        },
        {
            "content": "As I keep going further and further into Kurosawa, the more respect and appreciation I gain for him. For a couple of weeks, I have regarded Rashomon as my favorite Kurosawa, and when I do watch it again, I'm going to bump up the rating I have given for it because it definitely is one of his strongest work. But now I just finished Ikiru, and I finally found a Kurosawa film that matches the love and excitement I had for Rashomon. Ikiru is an excellent film, that hits the audience in all the right places.\n\nIkiru was written by Akira Kurosawa, Shinobu Hashimoto and Hideo Oguni. They have written a wonderful screenplay about a man who is aware of how much time he has left in the world, and what he's going to do about it. The film feels very genuine on the decisions and thoughts a man would have with a person who is aware of his fate. We go through the greediness and indulgence that one would lean on in order to fulfill the void that is life. It's even more clear with our protagonist as it's explained early on the film that he doesn't seem to  be living life and he has been empty and dead for so many years because of the job he has. The film explores the idea of humans not living our lives because we want to work and earn money in order to get the things that we suggest are \"important\". The office jobs that our character takes never gives this sense of reward, even if he receives a certificate from his employer and peers, as we are placed behind a desk and we never see what we actually get done. As public servants, they're supposed to be there to help and represent the public, acting on their best interest. It seems these officials or \"chiefs\" seem to only care about their ego. The writers were able to give us more detail on our protagonist's backstory and reasons for his current state, career-wise, in order for the audience to understand and empathise, rather than just pity him for not having any sense of awareness. The film is essentially a journey of filling a void that our character has that hasn't been filled for a long time, which is his sense of purpose in the world; it used to be his son but as time passes, it seems his son needs and loves him less and less now. It was really interesting and entertaining on how he looks for this purpose, and the writers successfully made me want to invest in understanding him. The film explores the concept of a bureaucracy and how the system works. I am not very good when it comes to politics, as I don't seem to have any passion to go deep into it, but the writers have done a great job on making me understand it, even if these were the conditions and values of the government back then and maybe unrelatable to the conditions and ethics of the government of today. I had no issues with the film's dialogue, as a lot of the moment really hit the spots that could make some weep or heartbroken, but I'm a tough shell to crack and only specific things make me teary. The use of the voice-over by a unknown third person, during some moments of the film, like the start explaining his current state was a bit annoying at first, but I think it wouldn't be a big issue during subsequent viewings.\n\nIkiru was directed by Akira Kurosawa, and this was released and made during a time when he was on a roll, making great films, one after the other. Ikiru is an excellent film and probably one of the most deepest and intimate films he has made. Some of his films, he likes to keep the audience at a distance, in order to see more of the situation, but Ikiru keeps us stuck to the protagonist throughout the film. We go through this journey with him, and very rarely are we given a scene that doesn't have or focus on him. Kurosawa wanted us to realise that this man is a symbol of a person who can change their entire life around in such a small amount of time. He wants us to remember that, we don't have to live the repetitive, dull, mediocre life. Life is precious, and it's sad to see people being lazy and just wasting their life away, not doing something productive with it; Kurosawa understood this completely, as we see our protagonist planning to waste his life with drinking, partying and having fun, then change to have his last few precious moments of his life be dedicated to something that would be beneficial to others, and also evidently himself. Kurosawa managed to not make a film like this too melancholy, with some moments that had me laughing, like the scene where he was drunk and walking across the street, pretty much the entire sequence when he was with the man that supposedly was going to show him how to live. But when the sad moment hits, they definitely hit, there was a scene that was really heartbreaking, and if I was much older and having similar emotions as he does then I would weep too, it was the scene where he sing that song at that party, and everyone just stops having fun and was either moved and reflecting on their own life, or they were disturbed as he was bringing the buzz down. Ikiru has a lot of memorable moments and the bulk of this is due to Kurosawa's direction. I think Ikiru was well paced, though the ending dragged just a little bit, but the content was strong enough to prevent it from being boring or unnecessary.\n\nThe film's director of photography was Asakazu Nakai, who has also worked on other Kurosawa films, including Red Beard, Seven Samurai and Throne of Blood. I don't consider Ikiru's photography to be gorgeous or groundbreaking, as for the most of it are things that we have seen before. It may not have the beauty that Rashomon has but it does create that intimacy and depth that no other Kurosawa film, at least that I have seen, has ever done. Nakai seems to capture our protagonist in a way that successfully transcends the character's feelings of gloom and doom, particularly during the start of the film. Nakai then shifts it during the third act, by making it seem more uplifting and hopeful, while still keeping that intimacy intact. Most Kurosawa films that I have seen are in black and white, and in doing this always made me become more invested and focused on the more important and thought provoking aspects of his films; It heightens the performance of it's actors and it depicts emotion at a more dramatic level, seeing images as dark or light, rarely anything in between. There were surprisingly a couple of gorgeous shots in this film, even if the black and white strips the image off it's depth in texture, one of the scenes was the shot that captured our protagonist and another figure as black silhouettes and the imagery behind them were a bunch of clouds being highlighted by the sun as it sets.\n\nThe film's score was composed by Fumio Hayasaka, who also has worked on a couple of films with Kurosawa. Hayasaka's score for Ikiru was beautiful. It was able to create certain emotions in his score and be emphasised in a naturalistic way with Nakai's imagery and Takashi Shimura's performance. I also adored the way the Happy Birthday was used as it connects with the idea that this our protagonist has grew emotionally and that this day is a start of his new self.\n\nThe film was mostly carried by Takashi Shimura and he brought a very strong performance; I think he deserved a win from the BAFTA nominee he gained from this film. Shimura brought so much sadness to his character, and his performance was one of the main reasons why the emotions of the film were so strong. This was definitely his best role and deserves a lot more praise from it. This ranks up there as the best performance from an actor in a Kurosawa film, right alongside Toshiro Mifune in Red Beard.\n\nIkiru may be too sad for some, but one can really gain a lot from watching it. The film showed us on how to not waste our life and make something significant out of it. Ikiru sports an amazing performance from Takashi Shimura, an emotional score from Fumio Hayasaka, and great direction from Akira Kurosawa. Ikiru, along with Rashomon, are worthy of being alongside with the most important and greatest films of all time",
            "review_date": "2014-04-06",
            "source": "rt"
        },
        {
            "content": "As I keep going further and further into Kurosawa, the more respect and appreciation I gain for him. For a couple of weeks, I have regarded Rashomon as my favorite Kurosawa, and when I do watch it again, I'm going to bump up the rating I have given for it because it definitely is one of his strongest work. But now I just finished Ikiru, and I finally found a Kurosawa film that matches the love and excitement I had for Rashomon. Ikiru is an excellent film, that hits the audience in all the right places.\n\nIkiru was written by Akira Kurosawa, Shinobu Hashimoto and Hideo Oguni. They have written a wonderful screenplay about a man who is aware of how much time he has left in the world, and what he's going to do about it. The film feels very genuine on the decisions and thoughts a man would have with a person who is aware of his fate. We go through the greediness and indulgence that one would lean on in order to fulfill the void that is life. It's even more clear with our protagonist as it's explained early on the film that he doesn't seem to  be living life and he has been empty and dead for so many years because of the job he has. The film explores the idea of humans not living our lives because we want to work and earn money in order to get the things that we suggest are \"important\". The office jobs that our character takes never gives this sense of reward, even if he receives a certificate from his employer and peers, as we are placed behind a desk and we never see what we actually get done. As public servants, they're supposed to be there to help and represent the public, acting on their best interest. It seems these officials or \"chiefs\" seem to only care about their ego. The writers were able to give us more detail on our protagonist's backstory and reasons for his current state, career-wise, in order for the audience to understand and empathise, rather than just pity him for not having any sense of awareness. The film is essentially a journey of filling a void that our character has that hasn't been filled for a long time, which is his sense of purpose in the world; it used to be his son but as time passes, it seems his son needs and loves him less and less now. It was really interesting and entertaining on how he looks for this purpose, and the writers successfully made me want to invest in understanding him. The film explores the concept of a bureaucracy and how the system works. I am not very good when it comes to politics, as I don't seem to have any passion to go deep into it, but the writers have done a great job on making me understand it, even if these were the conditions and values of the government back then and maybe unrelatable to the conditions and ethics of the government of today. I had no issues with the film's dialogue, as a lot of the moment really hit the spots that could make some weep or heartbroken, but I'm a tough shell to crack and only specific things make me teary. The use of the voice-over by a unknown third person, during some moments of the film, like the start explaining his current state was a bit annoying at first, but I think it wouldn't be a big issue during subsequent viewings.\n\nIkiru was directed by Akira Kurosawa, and this was released and made during a time when he was on a roll, making great films, one after the other. Ikiru is an excellent film and probably one of the most deepest and intimate films he has made. Some of his films, he likes to keep the audience at a distance, in order to see more of the situation, but Ikiru keeps us stuck to the protagonist throughout the film. We go through this journey with him, and very rarely are we given a scene that doesn't have or focus on him. Kurosawa wanted us to realise that this man is a symbol of a person who can change their entire life around in such a small amount of time. He wants us to remember that, we don't have to live the repetitive, dull, mediocre life. Life is precious, and it's sad to see people being lazy and just wasting their life away, not doing something productive with it; Kurosawa understood this completely, as we see our protagonist planning to waste his life with drinking, partying and having fun, then change to have his last few precious moments of his life be dedicated to something that would be beneficial to others, and also evidently himself. Kurosawa managed to not make a film like this too melancholy, with some moments that had me laughing, like the scene where he was drunk and walking across the street, pretty much the entire sequence when he was with the man that supposedly was going to show him how to live. But when the sad moment hits, they definitely hit, there was a scene that was really heartbreaking, and if I was much older and having similar emotions as he does then I would weep too, it was the scene where he sing that song at that party, and everyone just stops having fun and was either moved and reflecting on their own life, or they were disturbed as he was bringing the buzz down. Ikiru has a lot of memorable moments and the bulk of this is due to Kurosawa's direction. I think Ikiru was well paced, though the ending dragged just a little bit, but the content was strong enough to prevent it from being boring or unnecessary.\n\nThe film's director of photography was Asakazu Nakai, who has also worked on other Kurosawa films, including Red Beard, Seven Samurai and Throne of Blood. I don't consider Ikiru's photography to be gorgeous or groundbreaking, as for the most of it are things that we have seen before. It may not have the beauty that Rashomon has but it does create that intimacy and depth that no other Kurosawa film, at least that I have seen, has ever done. Nakai seems to capture our protagonist in a way that successfully transcends the character's feelings of gloom and doom, particularly during the start of the film. Nakai then shifts it during the third act, by making it seem more uplifting and hopeful, while still keeping that intimacy intact. Most Kurosawa films that I have seen are in black and white, and in doing this always made me become more invested and focused on the more important and thought provoking aspects of his films; It heightens the performance of it's actors and it depicts emotion at a more dramatic level, seeing images as dark or light, rarely anything in between. There were surprisingly a couple of gorgeous shots in this film, even if the black and white strips the image off it's depth in texture, one of the scenes was the shot that captured our protagonist and another figure as black silhouettes and the imagery behind them were a bunch of clouds being highlighted by the sun as it sets.\n\nThe film's score was composed by Fumio Hayasaka, who also has worked on a couple of films with Kurosawa. Hayasaka's score for Ikiru was beautiful. It was able to create certain emotions in his score and be emphasised in a naturalistic way with Nakai's imagery and Takashi Shimura's performance. I also adored the way the Happy Birthday was used as it connects with the idea that this our protagonist has grew emotionally and that this day is a start of his new self.\n\nThe film was mostly carried by Takashi Shimura and he brought a very strong performance; I think he deserved a win from the BAFTA  nominee he gained from this film. Shimura brought so much sadness to his character, and his performance was one of the main reasons why the emotions of the film were so strong. This was definitely his best role and deserves a lot more praise from it. This ranks up there as the best performance from an actor in a Kurosawa film, right alongside Toshiro Mifune in Red Beard.\n\nIkiru may be too sad for some, but one can really gain a lot from watching it. The film showed us on how to not waste our life and make something significant out of it. Ikiru sports an amazing performance from Takashi Shimura, an emotional score from Fumio Hayasaka, and great direction from Akira Kurosawa. Ikiru, along with Rashomon, are worthy of being alongside with the most important and greatest films of all time",
            "review_date": "2014-04-06",
            "source": "rt"
        },
        {
            "content": "For some reason I just don't find any appeal in a lot of Kurosawa's work, no matter how human it is.",
            "review_date": "2014-03-20",
            "source": "rt"
        },
        {
            "content": "An office worker finds he has a terminal illness so sets himself a target of completing a playground project for the youth in his community. Acting and Directing of a very high quality here.",
            "review_date": "2014-03-19",
            "source": "rt"
        },
        {
            "content": "One of phenomenal director Akira Kurosawa's most human films - a superbly acted, emotional story of a man approaching death that has the ability to embolden us to be better people.",
            "review_date": "2014-03-15",
            "source": "rt"
        },
        {
            "content": "This time Kurosawa's film not only criticizes and mocks about the patriarchal social hierarchy, but also the whole administrative process of post war Japan, and there lies the main reason of its universality in its concept, which is not a bit outdated. Here the Master even didnt leave the main protagonist out of criticism. The narrative changes in unusual way,sometimes through voiceover,or sometimes through the eyes of different supporting casts here, but never leaves the central plot. When the fellow bureaucrats trying to postmortem their recently dead colleague and come to conclusion that despite suffering a mortal disease, only he had the ability to do such extraordinary thing and the last shot of the film fully supports that, it seems like a slap to us.",
            "review_date": "2014-02-22",
            "source": "rt"
        },
        {
            "content": "One of the greatest, saddest yet most uplifting films ever made, if that makes any sense. A masterpiece if ever there was one. See it, or see it again, as soon as you possibly can. Had Kurosawa only made this film, his legend as a superb filmmaker would still have been validated.",
            "review_date": "2014-02-10",
            "source": "rt"
        },
        {
            "content": "Fantastic film. Very beautiful and emotional. It's a good film about a man's reflection of life when he gets to the end of his life.",
            "review_date": "2014-01-03",
            "source": "rt"
        },
        {
            "content": "It's a perfect film. It's entertaing and powerful.",
            "review_date": "2014-01-01",
            "source": "rt"
        },
        {
            "content": "Powerfully acted, emotional and with strong message, Ikiru is a very poignant film, a Japanese classic and one film that everyone should see at some point. Although the third act feels too long, that is probably the only flaw one could find in this film which is really strengthened by its enormously beautiful and poignant quotes which are truly revealing and thought-provoking. Ikiru is a must see masterpiece.",
            "review_date": "2013-12-29",
            "source": "rt"
        },
        {
            "content": "While Akira Kurosawa will always be remembered for his samurai epics, Ikiru is a deeply moving and intricate fable that only he could have perfected. While it's commentary about 1950s Japan has more-or-less aged well, it's the pure humanism on display here that really makes the film a classic, and an unexpected plot turn mid-way through the film really does wonders for the film's most intimate narrative. My personal favorite of the director's immense body of work.",
            "review_date": "2013-12-05",
            "source": "rt"
        },
        {
            "content": "Along with some great scenes, Ikiru is overrun with cheesy moments, cringeworthy overracting, pointless roundabout conversations of on-the-nose dialogue, and is in desperate need of a re-cut.\n\nOverall, Ikiru is good, but flawed and disappointing.",
            "review_date": "2013-12-03",
            "source": "rt"
        },
        {
            "content": "About our mortality and existence. Essential cinema.",
            "review_date": "2013-11-22",
            "source": "rt"
        },
        {
            "content": "depicting absurdism of albert camus, full of humanity, and finishing with brilliant way",
            "review_date": "2013-11-07",
            "source": "rt"
        },
        {
            "content": "Another great film from Kurosawa.",
            "review_date": "2013-10-24",
            "source": "rt"
        },
        {
            "content": "one of Kurosawa's best films",
            "review_date": "2013-10-11",
            "source": "rt"
        },
        {
            "content": "Perfection. Plus it features hats...",
            "review_date": "2013-08-17",
            "source": "rt"
        },
        {
            "content": "A very inspiring story of a bloke who has wasted his life in a meaningless office job then has a moment of clarity. Splendidly Japanese.",
            "review_date": "2013-08-08",
            "source": "rt"
        },
        {
            "content": "This is what a master can do with a trite subject. The man who discovers he is dying and tries to find meaning in his life seems like the most tried of concepts, but the legendary Akira Kurosawa infuses it with depth and gravity.\n\nA clever, back-and-forth screenplay by Shinobu Hashimoto holds our interest throughout even though we know at the very beginning of the movie how it is going to end. The movie is well-acted too - the great Takashi Shimura, only 47 when he made this film, plays the part of an elderly, desperate man to perfection, and is supported by an extremely able cast. As my eyes drifted across the screen during some long scenes, it struck me how even peripheral character actors on the edge of the shot were reacting perfectly to what was happening. \n\n'Ikiru', which apparently translates to \"To Live\", is not just an examination of life - but also often a satire on society and human nature. Roger Ebert described it best in his review: \"The scenes of his efforts do not come in chronological order, but as flashbacks from his funeral service. Watanabe's family and associates gather to remember him, drinking too much and finally talking too much, trying to unravel the mystery of his death and the behavior that led up to it. And here we see the real heart of the movie, in the way one man's effort to do the right thing can inspire, or confuse, or anger, or frustrate, those who see it only from the outside, through the lens of their own unexamined lives.\"",
            "review_date": "2013-08-03",
            "source": "rt"
        },
        {
            "content": "Shimura's acting lets the audience feel the void inside a broken man that pulls the audience throughout the film. It is long, yet rewarding; always exploring the principal character as cunningly as Kurosawa desires.",
            "review_date": "2013-07-25",
            "source": "rt"
        },
        {
            "content": "This is my favourite film of all time. I cannot imagine a more compelling, moving, stupendous film. It reveals more and more of its richess on repeated viewing, and I count Shimura as one of the very greatest actors in the history of cinema.",
            "review_date": "2013-06-27",
            "source": "rt"
        },
        {
            "content": "Kurosawa's most compassionate film.",
            "review_date": "2013-06-26",
            "source": "rt"
        },
        {
            "content": "Far from my favorite Kurosawa film- although with competition like seven samurai, who could blame it?",
            "review_date": "2013-06-25",
            "source": "rt"
        },
        {
            "content": "A poetic parable about the fragility of life is beautifully executed in this little film. A man, with terminal stomach cancer, tries desperately to find meaning in his mundane life, devoid of friends & estranged from his son. Unable to make human connections, he buries himself in a park-building project, & reluctantly becomes a hero posthumously.",
            "review_date": "2013-06-09",
            "source": "rt"
        },
        {
            "content": "\"Ikiru\" is touching without being overly melodramatic. The film has a universal theme combined with social commentary on Japanese society that is unusually cynical for Kurosawa.",
            "review_date": "2013-06-07",
            "source": "rt"
        },
        {
            "content": "Ikiru is a near flawless character study, showing a dying man contemplating the value of his life.  The film's message of action over passive living, demonstrated in the main character's bureaucracy, is, of course, still relevant today.",
            "review_date": "2013-05-30",
            "source": "rt"
        },
        {
            "content": "Ikiru is undoubtedly one of the greatest movies of all time, for its story is enough to inspire someone to do something with their life. In this way it is one of the most powerful movies ever made.",
            "review_date": "2013-04-23",
            "source": "rt"
        },
        {
            "content": "An emotional, heartbreaking, and affecting film. Kurosawa's greatest achievement.",
            "review_date": "2013-03-24",
            "source": "rt"
        },
        {
            "content": "Kurosawa is probably one of my favorite directors in Japanese cinema, and this film is a testament to that. I've seen this film so many times, and there's a reason it's my favorite Kurosawa project. It's a wonderfully done representation of our main goals as a society, and is oddly relatable at any age. I especially like the the ending act of this story, as it really shows how misunderstood Watanabe was. The very last scene is extremely heartfelt and one of the best feelings I've ever had of closure in a film.",
            "review_date": "2013-02-19",
            "source": "rt"
        },
        {
            "content": "One of the things we as human beings tend to shut out of our lives is the task of evaluating the meaning of our own existence- can't we just live for living's sake? Akira Kurosawa challenges viewers to take on this simple-at-first but daunting challenge in his tragically beautiful, poignant and unforgettable Ikiru. Longtime Kurosawa collaborator Takashi Shimura gives a solemn and quietly devastating performance (be sure to open the tear duct floodgates when he begins to sing in a standout scene), and the script is brilliantly structured in a two-act formula that allows us to evaluate the protagonist's life- and the meaning of life in general- from both sides of the fence",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "Akira Kurosawa created one of the best films ever! Takashi Shimura performs his GREATEST PERFORMANCE in a delicate, childish,depressing, powerful, extraordinary and moving way.( And I thought Toshiro Mifune was the greatest japanese actor; maybe I will have to reconsider.)Critics have claim that this is Kurosawa´s greatest work, Personally- I won´t say is it is, only because this is just one of many other Masterpieces from Kurosawa. The meaning is simple... DON´T WASTE YOUR LIFE- YOU HAVE TO LIVE.\nLife is brief. Fall in love, maidens, Before the crimson bloom fades from your lips, Before the tides of passion cool within you, For those of you who know no tomorrow. With powerful performances, imagery, and songs... IKIRU is a phenomenon when speaking of excellent filmmaking! I was crying at times..\nLife is brief. Fall in love, maidens, Before his hands take up his boat, Before the flush of his cheeks fades, For those of you who will never return here. Not a film for everyone, just film-lovers.",
            "review_date": "2013-02-09",
            "source": "rt"
        },
        {
            "content": "Overall it's intimate and has a great message, but stylistically it is pretty dated.",
            "review_date": "2013-01-30",
            "source": "rt"
        },
        {
            "content": "A wonderful, sad, moody tale about a dying man's quest to find meaning in his life.",
            "review_date": "2013-01-04",
            "source": "rt"
        },
        {
            "content": "Ikiru is a bit heavy-handed at times, and it could certainly have been streamlined a bit, but this humanist tale about a man yearning to make his final days count is still very affecting all the same. It is the kind of film which will cause many to re-evaluate their lives, and it also doubles as a scathing commentary on bureaucracy.",
            "review_date": "2013-01-03",
            "source": "rt"
        },
        {
            "content": "\"This stomach belongs to the protagonist of our story,\" says a narrator, who's pertaining to an x-ray image of a stomach obviously ripe with cancerous complications. And so begins \"Ikiru\", a meditative film of quiet power that tackles mortality and life's purpose yet also dips its fingers on issues concerning the cons of bureaucracy. The film's protagonist is Kanji Watanabe, an old man who seems to be no more alive than a dysfunctional machine.\n     \nIn many ways, films like \"Scent of a Woman\" and \"About Schmidt\" derive from \"Ikiru's\" main emotional drive, which is as timeless as it is life-affirming. As what the film suggests, maybe it is only in the face of death and mortal desperation will we muster change and find true significance; indeed, life is brief. In the words of the narrator in \"Fight Club\": \"This is your life, and it's ending one minute at a time\".\n     \nTakashi Shimura, who has previously played the woodcutter in \"Rashomon\" and who will later play, after this film, the noble Kambei in \"Seven Samurai\", plays Watanabe, a bureaucrat who, for the longest time, has led an uneventful life drained of all meaning or worth. Making his living by stamping insignificant papers for approval, he is as mechanized and emotionless as he can be. But in one ill-fated day, he is diagnosed with stomach cancer. According to the doctor, he has around six months to live. \n     \nDevastated, Watanabe has never felt more strangely detached from the land of the living. His already hunched posture even becoming more contorted and his already fragmented articulation of words becoming even more so, Watanabe, as maybe what Kurosawa has intended, is the defining image of a modern man who has nothing to say about his life other than the painful fact that he has merely 'lived'. \n     \nGoing home, Watanabe then pitifully tries to tell his son about his terminal illness but is discouraged by the latter's coldness. Finding no sense of belongingness either in his own home (with his son being mainly concerned not with his father's well-being but with his pension) or in his work, he suddenly had this craving to just lash out. Guided by a struggling novelist, Watanabe then tries to navigate the busy, booze-laden nightlife of '50s Japan to find out whether or not it can make up for his final days. As it turns out, it does not. \n    \nAfter his bar-hopping misfire, he then gets closer to a young woman named Toyo, an office subordinate of his who has recently tendered her resignation in Watanabe's office in favor of working in a toy factory, and whose exuberant and pure love for life leaves Watanabe in utter awe and in disgruntled fascination.\n     \nMiki Odagiri, who plays Toyo, has this distinct kind of energy that finely balances out Takashi Shimura's seemingly stagnant and doomed presence. By often framing Shimura's Watanabe, hunched, blank-eyed and ever-brooding, in the foreground and Odagiri's Toyo in the not-so-distant background, Kurosawa was constantly able to highlight the two characters' contrasting traits, behaviors and overall existence within the spatial landscapes of the film.     \n     \n\"...In other words, why are you so incredibly alive?\" Watanabe blurts out to Toyo, who innocently mistakes his desperate need to understand his own existence as romantic advances. Toyo answered him that all she does is work and eat. She then gets a toy rabbit from her bag, one of the many products being made in the toy factory where she's employed; \"Making them (the toy rabbits), I feel like I'm playing with every baby in Japan,\" Kimura then said. \n     \nSeemingly refreshed from Toyo's all-too-naïve yet honest response, Watanabe then sets out to do something that may hopefully make him matter. In a stunning turn of events, Watanabe transforms from an old nobody to a defiant spirit reminiscent of Jimmy Stewart's Mr. Smith determined to will through the lethargic incompetency of the city hall officials so that he can convince them to turn a mosquito-laden cesspool into a children's park.     \n     \nMuch like \"Rashomon\", we then get to see another epistemological discourse on Kurosawa's part, this time not about the truth (or the lack thereof) behind a mysterious murder but about the legacy of a man who everybody never expected to have left one. And by piecing together some fragmentary moments in Watanabe's life as witnessed by his co-workers, from his brave persistence to stand up for the children's park to his starry-eyed admiration of the sunset, we then finally arrive at what Watanabe is looking for all his life: meaning and self-worth. \n     \n\"Ikiru\", which literally means \"To Live\", is an affecting film that explores man's search for existential meaning not through philosophically sophisticated means that may alienate viewers but realistically through an old man's eyes who just want to be at peace with those around him and, more importantly, with himself. Despite of \"Ikiru's\" apparent and sometimes much too overwhelming commentary on political bureaucracy, I'd rather remember it as an honest and reflective film about mortality and the often undermined beauty of life; simple as that. This then reminds me of a quote by Monty Python's Michael Palin: \"Don't talk about living, just live\".",
            "review_date": "2013-01-03",
            "source": "rt"
        },
        {
            "content": "I don't think I can be friends with someone who doesn't appreciate this film.",
            "review_date": "2013-01-01",
            "source": "rt"
        },
        {
            "content": "Ikiru is such a sad movie. From beginning to end, audiences are given an intimate and personal treatment to one of Kurosawa's most misunderstood and abused characters. The heartbreaking emotions encapsulates every scene with enticing detail to cinematography, character interaction, and the existential and self-aware dialogue. Certainly among Kurosawa's best.",
            "review_date": "2012-12-31",
            "source": "rt"
        },
        {
            "content": "Pacing is typical Kurosawa, and spot on for the tone and plot. Mind blowing in it's entirety, especially for the stark humanity of the characters.",
            "review_date": "2012-12-12",
            "source": "rt"
        },
        {
            "content": "intimate, honest, quietly powerful.  perhaps my favorite kurosawa film.",
            "review_date": "2012-12-06",
            "source": "rt"
        },
        {
            "content": "Deep. Thoughtful. Poetic. And pretty good cinematography that still holds up.",
            "review_date": "2012-11-26",
            "source": "rt"
        },
        {
            "content": "Directed by Akira Kurosawa and starring Takashi Shimura, this drama is loaded full of irony. As the film opens, right away we learn the protagonist has stomach cancer, except he has yet to find out. He has spent 30 years of his life working at a monotonous job as a bureaucrat. Only after he discovers that he barely has 6 months left does Watanabe-san actually begin to live his life again. He tries the night life of Japan and it does not satisfy. Then he starts spending time with a lively, young worker that he used to know. All the while he thinks about telling his son about his condition but he cannot bring himself to do it. However, Watanabe-san finally finds a way to leave his mark on this life. And yet 5 months later he is dead and his fellow bureaucrats seemingly dismiss his accomplishment  Through a series of flashbacks they ultimately realize what he really did. I found this film to be powerful because this idea is so powerful. It makes me question if I am really living my life to the fullest extent.",
            "review_date": "2012-11-21",
            "source": "rt"
        },
        {
            "content": "I cried for days...hauntingly beautiful.",
            "review_date": "2012-10-29",
            "source": "rt"
        },
        {
            "content": "Perfect character study of one man and his destiny.",
            "review_date": "2012-10-28",
            "source": "rt"
        },
        {
            "content": "so beautiful and well-done in every way.",
            "review_date": "2012-10-14",
            "source": "rt"
        },
        {
            "content": "An interesting film, not only because Kurosawa tackled subject matter that wasn't set in feudal Japan, but because it brilliantly covered a few very deep topics. The futility of bureaucracy. The importance of legacy. The cautions of living vicariously through others. Overall, a solid film.",
            "review_date": "2012-10-08",
            "source": "rt"
        },
        {
            "content": "Not quite Hollywood, in the best sense: brilliant Japanese director Akira Kurosawa delivers another profound and beautiful movie.\n\nConsidering it's from 1952, in black and white and lasts for about two and a half hours, it may be quite a challenge for some to see. The theme is timeless and applies exactly today as it did back then.\n\n\"How tragic that man can never realize how beautiful life is until he is face to face with death.\"",
            "review_date": "2012-09-25",
            "source": "rt"
        },
        {
            "content": "what beautiful and wonderous piece of film .  intense and pure moving .",
            "review_date": "2012-09-09",
            "source": "rt"
        },
        {
            "content": "One of the most heart warming movies I've ever seen.",
            "review_date": "2012-09-09",
            "source": "rt"
        },
        {
            "content": "read tolstoy's death of ivan ilyich...",
            "review_date": "2012-09-02",
            "source": "rt"
        },
        {
            "content": "This is my ultimate favorite Kurosawa. That beautiful song is so haunting.",
            "review_date": "2012-08-09",
            "source": "rt"
        },
        {
            "content": "Kurosawa's most intimate and emotional film.",
            "review_date": "2012-08-05",
            "source": "rt"
        },
        {
            "content": "Absolutely perfect. A humanist masterpiece from one of the absolute masters.",
            "review_date": "2012-08-05",
            "source": "rt"
        },
        {
            "content": "Rarely does a saddening film achieve this level of greatness, however Kurosawa is the greatest director in cinema history, not necessarily my favorite, though he is among them. Akira Kurosawa makes me sad just thinking about him. He was just a tall, quiet guy who sat around watching movies, eventually trying to kill himself. But, he still is the greatest mind in cinema. MANY films owe him A LOT.  Emotions are vividly present throughout the entire film. It leaves your heart in the same place for the length of the film. Just as much irony is used as emotions, mainly in the final part. Just like many Kurosawa films, the cinematography makes an already masterful film, even better. An essential for everyone.",
            "review_date": "2012-07-28",
            "source": "rt"
        },
        {
            "content": "This Is Such A Sad Movie.",
            "review_date": "2012-07-20",
            "source": "rt"
        },
        {
            "content": "Beaurocrats and city slickers take note.\nThis is a film you really should see, along with anyone else in need of some humanity in a seemingly machine run world.\nThis is the fourth Kurosawa I have seen after the epic and almost monumental movies Kagemusha, Throne of Blood and the masterpiece Seven Samurai.\nThis one takes place in a 20th century urban setting telling the story of man with cancer who finally wakes up to do some good and build a playground. \nGreat performance from the leading man, just an excellent film all round.\nAkira Kurosawa is a true legend of cinema.\nHighly Recommended",
            "review_date": "2012-07-16",
            "source": "rt"
        },
        {
            "content": "The guy from Godzilla's dying from stomach cancer and needs the help of HUMFREE BOGART to build a playground before he dies--\n\nIKIRUUU!",
            "review_date": "2012-07-10",
            "source": "rt"
        },
        {
            "content": "Among most sentimental , most touching drama you can ever see in films !",
            "review_date": "2012-07-10",
            "source": "rt"
        },
        {
            "content": "Really, really good, but probably the saddest movie I've ever seen.",
            "review_date": "2012-07-06",
            "source": "rt"
        },
        {
            "content": "Watched before July 2012",
            "review_date": "2012-07-02",
            "source": "rt"
        },
        {
            "content": "As a lifetime government official who had always played safe and hadn't done anything extraordinary walks out of an oncologist's cabinet with a deadly diagnosis, he confronts with the meaninglessness of his life. With the death looming in a mere month he starts burning his life, then living a life of another, and only in the last few weeks he makes it a point to rip through the thick inertia of his own element - civil service bureaucracy, - and initiate a government-built playground for kids in a swampy slumps on the city. Retrospectively, his former colleagues recall his life, and are amazed at his determination and stamina her showed when pursuing his goal, a well as the happiness and the peace of mind he obtained after the playground was finally built.",
            "review_date": "2012-07-02",
            "source": "rt"
        },
        {
            "content": "A beautiful film that really gets one to think about life. It reminds us to live each day with a purpose and to never take simple moments for granted. This is a must see!",
            "review_date": "2012-07-01",
            "source": "rt"
        },
        {
            "content": "One of the greatest movies of all time. Hands-down.",
            "review_date": "2012-06-26",
            "source": "rt"
        },
        {
            "content": "Open of the most poignant films I've seen in my life... Even for Kurosawa",
            "review_date": "2012-06-20",
            "source": "rt"
        },
        {
            "content": "Stands shoulder to shoulder with Ozu's Tokyo Monogatari as the saddest film ever made. Close to death, protagonist Kanji sits on a swing, contemplating how his life has gone while snow gently falls. Remarkably moving. Kurosawa's underrated masterpiece.",
            "review_date": "2012-06-12",
            "source": "rt"
        },
        {
            "content": "Slow at first, but crescendos into a master work of art.....worth every effort you can make to see it....To pick a favorite Kurosawa film is painfully difficult, but if I had to pick, it would be this one.",
            "review_date": "2012-06-09",
            "source": "rt"
        },
        {
            "content": "Desperately need to see this again, but it's my favorite Kurosawa film.",
            "review_date": "2012-06-03",
            "source": "rt"
        },
        {
            "content": "Kurosawa has made some of the greatest films that I've ever seen and this one is clearly one of his best imo. There are only two other Kurosawa films that I hold in as high regard as this one: 7 Samurai and Rashomon. However, this one is different since it isn't a Samurai film. Kurosawa goes away from his usual pattern and makes one of the most beautiful and most deeply affecting films that I've ever seen in my life. If you have never seen this film, do yourself a favor and do so....you will not regret it.",
            "review_date": "2012-06-02",
            "source": "rt"
        },
        {
            "content": "His period pieces are easy to introduce  Kurosawa to people, but eventually you appreciate his modern works more. This is one of the finest movies ever made.",
            "review_date": "2012-05-25",
            "source": "rt"
        },
        {
            "content": "maybe the greatest film ever made",
            "review_date": "2012-05-24",
            "source": "rt"
        },
        {
            "content": "This movie'll make you think about your life. Great stuff. \r\n\r\nWatched May 22, 2012 with Bryce on the downstairs' T.V. We got Ikiru in the mail from Netflix.",
            "review_date": "2012-05-23",
            "source": "rt"
        },
        {
            "content": "One of the most moving films ever made.  Pure perfection.",
            "review_date": "2012-05-19",
            "source": "rt"
        },
        {
            "content": "I felt different after I watched this movie.",
            "review_date": "2012-05-09",
            "source": "rt"
        },
        {
            "content": "Slow and sad, but really really good.",
            "review_date": "2012-05-05",
            "source": "rt"
        },
        {
            "content": "One man stands up against the world, the world wins, but the man embraces his draw.",
            "review_date": "2012-04-25",
            "source": "rt"
        },
        {
            "content": "I really enjoyed this one a lot, as a man who has devoted his life to a fairly dead-end job finally finds a purpose when he is given a very short time to live.  I loved that he focused on the most obvious thing that has been ignored for the first half of the film, devoting himself to a project that will make the lives of others better.\n\nWell worth a rental.",
            "review_date": "2012-04-18",
            "source": "rt"
        },
        {
            "content": "one of my favorite movies.",
            "review_date": "2012-04-03",
            "source": "rt"
        },
        {
            "content": "One of the most genuinely inspiring movies out there. Kurosawa's greatest movie.",
            "review_date": "2012-03-27",
            "source": "rt"
        },
        {
            "content": "I felt like it's about, but it's about the humanity, and it's too interesting ,,,\n\nbrilliant Kurasawa  !!!",
            "review_date": "2012-03-20",
            "source": "rt"
        },
        {
            "content": "Akira Kurosawa proves he's as adept at modern-day existentialism as he is at medieval swordplay. His protagonist in this moving (and admittedly slow-moving) classic learns he has just a few months to live. Unused to living at all (he's a town bureaucrat), he has to learn how and finally succeeds, gloriously. Watch for the brilliant editing in the last half hour as his fellow bureaucrats self-justify at his wake as we intercut to our hero's fervid actions in the final days of his life. Beautiful and profound, this film made me want to take a bigger bite out of life.",
            "review_date": "2012-03-17",
            "source": "rt"
        },
        {
            "content": "Really good movie, I think it's one of Kurosawa's best, really reminds us we only have such precious time on this earth.",
            "review_date": "2012-03-10",
            "source": "rt"
        },
        {
            "content": "Ikiru is a wonderfully told, beautifully shot story of a man in the last year of his life. The first half of the film is him finding out he only has 6 months to live because of stomach cancer, realizing he has done almost nothing with his life, and then enjoying his life the best way he can. Rather abruptly a narration tells us he has died 5 months later and the rest of the film takes place at his wake remembering and trying to puzzle together how dedicated he was to making a difference in the community by pushing to build a park where a cesspool was located. It is deeply moving as this man is a man you come to love from the beginning (irregardless of his facial expressions and his wide open eyes). Kurosawaâ(TM)s utilization of deep-focus, framing with the frame, and character blocking are absolutely astounding in this film and only adds claim to the fact that he truly can make films, even non-samurai ones.",
            "review_date": "2012-03-04",
            "source": "rt"
        },
        {
            "content": "One of Kurosawa's finest films explores the true meaning of life, and what it is to truely live.  Takashi Shimura gives a wonderful performance as our tragic protagonist, Kanji Watanabe, a Japanese bureaucrat who discovers that he has stomach cancer and must come to grips with his short time left on this earth.  \"How tragic that man can never realize how beautiful life is until he is face to face with death\" a saying by a novelist  early in the film pretty much exemplifies this film.  A true masterpiece of cinema.",
            "review_date": "2012-02-26",
            "source": "rt"
        },
        {
            "content": "Yet another masterpiece from Kurosawa.",
            "review_date": "2012-02-24",
            "source": "rt"
        },
        {
            "content": "The best portrayal of bureaucratic bungling I have ever witnessed in a movie. A Kurosawa masterpiece although I miss the epic battle-scenes that are the hallmarks of most of his other films... Kanji's words are unforgettable: \"Life is brief. Fall in love, maidens. Before the crimson bloom. Fades from your lips. Before the tides of passion. Cool within you, For those of you. Who know no tomorrow.\"",
            "review_date": "2012-02-19",
            "source": "rt"
        },
        {
            "content": "A brilliant, insightful look at the human condition and the frightening chances we take.",
            "review_date": "2012-02-17",
            "source": "rt"
        },
        {
            "content": "A classic film that lives up to its reputation - simply beautiful.",
            "review_date": "2012-02-15",
            "source": "rt"
        },
        {
            "content": "This is one of Akira Kurosawa's greatest films.  This is quite possibly one of the greatest films of all time.  I highly recommend it to everyone, it is a very powerful and very deep, it really hits your soul.  Watch this film, and you will see.",
            "review_date": "2012-02-09",
            "source": "rt"
        },
        {
            "content": "Kurosawa's blue collar meditation on mortality seems like one of his most personal films, and most poignant.",
            "review_date": "2012-02-08",
            "source": "rt"
        },
        {
            "content": "Ikiru should be required viewing for everybody. Kurosawa crafts a masterpiece that is thought provoking and moving. To say this is Kurosawa's best film would not be overstating in the least bit.",
            "review_date": "2012-01-31",
            "source": "rt"
        },
        {
            "content": "a great movie on evaluating the importance of life",
            "review_date": "2012-01-19",
            "source": "rt"
        },
        {
            "content": "I'm unable to put my finger on the exact problems that I had with Ikiru. Perhaps it is that the news which provides the catalyst for the plot comes near to the beginning. It therefore has no great impact, if I had known the character then it may have been more resonant. Also there wouldn't have been the need for quite so many scenes of Kanji making up for lost time, which did grow tiresome. I understand that the emphasis is intended for events that come after Kanji is told about his illness, I just found it to be problematic. Ikiru is competent, of course it is it's a Kurosawa film, but it didn't have the effect I was perhaps entitled to expect.",
            "review_date": "2012-01-19",
            "source": "rt"
        },
        {
            "content": "A simple yet powerful story, I think the ending sequence just shows how Kurosawa was a true master of narrative construction.",
            "review_date": "2012-01-19",
            "source": "rt"
        },
        {
            "content": "A man tries to find purpose as he faces his imminent death.  I'm not sure if this is a film to inspire, or a deeply cynical look at those around us though!",
            "review_date": "2011-12-30",
            "source": "rt"
        },
        {
            "content": "ust like, Bergman's Wild Strawberries, Kurosawa's Ikiru is a film about life. Constantly complex and thought-provoking, although simple at the same time; it tells a story about life's limits, how we perceive life and the fact that life is short and not to be wasted. Of all of films Kurosawa made, this is probably the one movie that works perfectly on an universal level, because at its core it is about one of the basic truths of life- death.\r\n\r\nIn its starch and unforgiving black-and-white form the movie records the time of one man's life in such a beautiful and yes, colorful way, that by the time the final moments of the film play out, it will be very hard for anybody not to be touched. The film details the existential struggle of one ordinary man in his desperate search for purpose.\r\n\r\nIkiru is a film that expresses itself in two separate parts. The first half is the exploration of a bitter man's death and the second half is an affirmation of life provided through the awareness of mortality, recalled by those whom he knew best.",
            "review_date": "2011-12-27",
            "source": "rt"
        },
        {
            "content": "Ikiru will put your soul through absolute hell. Shimura perfectly embodies the character of Kanji Watanabe. Some of his reaction shots are so unbelievably heartbreaking. The story alone is very sad but Kurosawa handles the material with such care. From the opening shot to the closing shot(which is one of the greatest in film) you want Watanabe to be okay. I found myself relating to him. I understood how his life became a routine in a routine and before he knew it was almost over. The ending isn't as uplifting as you would hope for this character but it's still very moving and very powerful.",
            "review_date": "2011-12-17",
            "source": "rt"
        },
        {
            "content": "My Favorite Kurosawa Movie this is the film that showed his true talent and made him an unstoppable force in Movies in Japan",
            "review_date": "2011-12-15",
            "source": "rt"
        },
        {
            "content": "Absolutely heartbreaking.",
            "review_date": "2011-12-08",
            "source": "rt"
        },
        {
            "content": "Couldn't have been done without Takashi Shimura as the protagonist Watanabe. Realizing his death is near and imminent, he tries to find joy in the last few months he has to live. He leaves his day job and tries to truly 'live', but fails to find any sustained happiness. He confides to a young girl that he finds it very hard to 'live' at all. Shimura delivers a tremendously powerful and emotionally intense performance; completely embodying his character to the extent that he blew me away because it was nothing like I have ever seen before. Also, there is Shimura's well-known ruminative and perplexed look that serves as a knock-out punch among the arsenal of his craft. Director Akira Kurosawa continued to impress as his career progressed. He uses a non linear structure to film a very good story. The first 15 and the last 40 minutes of this films are very,very,very good examples of filmmaking and effective story telling. Emotionally moving without being overly sentimental, it's protagonist earns every bit of sympathy and emotion from us. An optimistic film which is executed just wonderfully by Kurosawa, making it neither sappy nor trite filled with platitudes and peppy little bromides. The film provokes a lot of thought and manages to depict psychological aspects of modern society in a truthful manner.",
            "review_date": "2011-11-28",
            "source": "rt"
        },
        {
            "content": "There's a truly incredible performance and transformation of character in the film. If you think 'Titanic' is sad, you'll drown in your own tears by the end.",
            "review_date": "2011-11-27",
            "source": "rt"
        },
        {
            "content": "Akira Kurosawa's greatest film. A story of a doomed man who wants to accomplish one last, worthwhile thing before he dies.",
            "review_date": "2011-11-24",
            "source": "rt"
        },
        {
            "content": "Great movie, heartbreaking and life affirming at the same time. Also an amazing performance from Takashi Shimura. A complete masterpiece.",
            "review_date": "2011-11-22",
            "source": "rt"
        },
        {
            "content": "Painful to watch, but ultimately a heartfelt story that is poignant and deep, this masterpiece of Japanese cinema deals excellently with one man's search for purpose. A slow, but intimately made film that firmly established Akira Kurosawa as one of the greatest directors to ever live.",
            "review_date": "2011-11-17",
            "source": "rt"
        },
        {
            "content": "The main focus of Ikiru is the concept of a worthy life, contrasted against bureaucracy, hypocrisy and lack of caring for our fellow man. These issues draw more attention in light of the world crisis we are going through, so this is a particularly good time to watch it. Shimura delivers an exceptional performance and I would consider the film a masterpiece but for the editing: The last third loses its pace, being overly explanatory and including unnecessary scenes.",
            "review_date": "2011-11-17",
            "source": "rt"
        },
        {
            "content": "A well crafted film with a heartfelt story that is poignant, deep, this masterpiece of a film laments life's biggest truths about our own measly, mortal existence. I haven't seen a modern movie quite like it. Ikiru is a brilliant film because of the ingenious cinematography, one would certainly agree to such; that it concerns us, because the problems faced are very real and speaks of truth, however sad(or liberating) as one may see fit. Ultimately, it works because it succeeds in doling out quintessential truths about our humanity, of our very lives.",
            "review_date": "2011-10-31",
            "source": "rt"
        },
        {
            "content": "Questo film ha qualcosa di atipico per il Paese in cui è stato prodotto. Di solito, almeno negli anni cinquanta, le tematiche di una pellicola del Sol Levante riguardavano quasi sempre le gesta dei mitici samurai del tardo medioevo (come conferma la filmografia dello stesso regista), eppure in \"Ikiru\" c'è un'atmosfera strana. E' quell'aria che si respira nell'introspezione più acuta di un Fellini nel periodo d'oro della sua carriera, come in un toccante lungometraggio della corrente neorealista di De Sica. Insomma \"Vivere\" è probabilmente uno dei film più occidentali che siano mai stati prodotti in Giappone... e questo lo si nota per come viene rappresentata la città di Tokyo. Night club, sale giochi ed impiegati annoiati con poca voglia di lavorare ne fanno da sfondo. Watanabe, però, è un lavoratore serio, a cui è stato diagnosticato un tumore che lo farà vivere solo per pochi mesi. La sua vita sembra non avere più un senso. Il protagonista non ha una grande vita sociale ed il figlio è sempre stato distaccato. A questo punto decide di divertirsi improvvisando a modo suo, frequentando la giovanissima collega, che invece ha ancora tutta l'esistenza davanti. Quando però i rapporti si freddano pure con lei, compierà il suo ultimo grande gesto: portare avanti il progetto di bonifica di una zona infetta della città. Lui non ha niente da perdere quindi le difficoltà politiche, le minacce e i problemi di salute non lo fermeranno.\r\n\r\n\"Ikiru\" è una delle pellicole più pessimiste di Kurosawa. \"Anche i grandi uomini prima o poi verranno dimenticati e tutto ricomincierà da capo, come se non fosse successo mai niente\". Questo evidentemente è il messaggio che vuole trasmettere l'autore. L'\"eroe\" in questo caso non è un impavido guerriero armato di katana, ma un semplice e timido impiegato comunale. Le azioni più valorose vengono dunque compiute dalla gente comune, sono persone di cui mai e poi mai ci si aspetterebbe arrivassero a tanto, eppure sono in grado di cambiare le cose. Watanabe, infatti, poco prima della sua morte, è riuscito a realizzare una richiesta apparentemente impossibile per un gruppo di poveri cittadini, e per farlo ha dato tutto se stesso; è stato allora che ha capito che la sua esistenza poteva comunque avere un senso nella società in cui si ritrovava.\r\n\r\nStruggente e senza speranza, questa storia di Kurosawa aiuta a riflettere sul senso della vita e della morte. Ovviamente le interpretazioni su di esse dinanzi a questo film, cambieranno in base al vostro modo di comprendere e valorizzare entrambe.",
            "review_date": "2011-10-24",
            "source": "rt"
        },
        {
            "content": "one of the proof that why Akira Kurosawa is Legen",
            "review_date": "2011-10-24",
            "source": "rt"
        },
        {
            "content": "A Kurosawa film that felt more like a Bergman film - very interesting.  I found the pacing to be a little stagnant and the editing somewhat indulgent compared to many of Kurosawa's other works (the last third, in particular, when Shimura's coworkers ruminate on his strange behaviour, drags painfully and feels largely redundant), and I found myself pining for the unique, incisive criticism of the first third's narration or a creative equivalent as the film quickly slipped into more familiar narrative territory. \n\nNonetheless, to dwell excessively on criticism would be a major disservice to such a profoundly resonant film. As such, despite being a more sombre Kurosawa effort, it remains a rich, devastating and yet (in a roundabout way) affirming meditation on mortality with an unforgettable central performance by the loveably raspy \"mummy\" Takashi Shimura.",
            "review_date": "2011-10-07",
            "source": "rt"
        },
        {
            "content": "A very moving film, I didn't get to the end but what I did see is an amazing movie.",
            "review_date": "2011-09-12",
            "source": "rt"
        },
        {
            "content": "Kurosawa puts the viewer in a trance. 'Ikiru' takes emotionally draining to the top of the mountain. The performances are powerful and affecting. I've read a few books I can say helped changed my life but not as many movies, 'Ikiru' is one exception. Kurosawa demonstrates masterfully how powerful of an art form movies can be. 'Ikiru' is Kurosawa's best and the finest movie from Japan I've seen.",
            "review_date": "2011-09-12",
            "source": "rt"
        },
        {
            "content": "\"Sacrifice the self to Serve the many.\"\n\nThree option to make your life meaningful.Takes your savings and spent with women and beer?Looking for someone who you want to spend with?Change the life of public?\n\nAnother Director Kurosawa's masterpiece I have seen after Seven Samurai.My most favorite shot is when our prtogonist holding the toy rabbit and walk down to the stair and then,the Birthday Lady turns up.Takashi Shimura's creepy and sad performance which lead me to the same expression like the female co-worker at the restaurant.\n\nIt's never too late to repay your parents,yes,I have seen some children thought they are grown up and shout to their parents with no reason.It's hard to tell sometimes,depends on your living lifestlye.",
            "review_date": "2011-09-09",
            "source": "rt"
        },
        {
            "content": "This is a wonderfully idealistic, sentimental meditation on what it means \"to live\". Are you missing your own life, and will you one day discover that you've never really experienced it? Will your discovery come just in time, or too late? Watch this movie and take the opportunity to reflect on how you may be running through your brief years with little to show for them...The film's structure alone is masterful. The storytelling techniques used by Kurosawa are still unmatched. Also worth mentioning is the acting-Shimura Takashi proves himself as one of the greatest actors of all time with his portrayal of Watanabe Kanji. You may recognize him from his role as the wise leader Kambei in Shichinin no Samurai, but this is his greatest achievement. Several of Kurosawa's core group of actors are also in this movie, such as Fujiwara Kamatari. I would recommend this film not only for film buffs, but for anyone interested in powerful, intelligent cinema.",
            "review_date": "2011-09-04",
            "source": "rt"
        },
        {
            "content": "A thoughtful, moving study into human nature and the nature of change. How much does it take for any man to change and indeed how much can he change? It is almost impossible not to be moved by Takashi Shimura's performance as the unassuming Mr. Watanabe as we follow him in his journey towards self discovery and self worth.",
            "review_date": "2011-08-29",
            "source": "rt"
        },
        {
            "content": "One of the truly great movies ever put on cinema - a defining post-war Japanese movie alongside the likes of Tokyo Story. It features what I feel is the greatest scene in the history of cinema--the lead character dying and sitting on a swing of the park he has finally been able to get built, singing a song from his youth about how short and fragile life is. The subtext here is we do not truly appreciate life until we are faced with death. Movies can have an impact on people but only a few can change people's lives - this is one of them. This is the kind of movie that makes people stop, feel and think. A masterpiece that reveals itself as such in every frame its true power becomes all more daunting as one reflects about it afterward. Perhaps more than changing lives 'Ikiru' provides an emotionally charged space in which to ponder on how people, no matter how average, can make a change both in themselves and on others. Akira Kurosawa may have been the greatest filmmaker of all time and Ikiru his greatest movie. Ikiru is a movie that can't be missed, so be sure to see it. Highly recommended.",
            "review_date": "2011-08-28",
            "source": "rt"
        },
        {
            "content": "One of the truly great movies ever put on cinema - a defining post-war Japanese movie alongside the likes of Tokyo Story. It features what I feel is the greatest scene in the history of cinema--the lead character dying and sitting on a swing of the park he has finally been able to get built, singing a song from his youth about how short and fragile life is. The subtext here is we do not truly appreciate life until we are faced with death. Movies can have an impact on people but only a few can change people's lives - this is one of them. This is the kind of movie that makes people stop, feel and think. A masterpiece that reveals itself as such in every frame its true power becomes all more daunting as one reflects about it afterward. Perhaps more than changing lives 'Ikiru' provides an emotionally charged space in which to ponder on how people, no matter how average, can make a change both in themselves and on others. Akira Kurosawa may have been the greatest filmmaker of all time and Ikiru his greatest movie. Ikiru is a movie that can't be missed, so be sure to see it. Highly recommended.",
            "review_date": "2011-08-28",
            "source": "rt"
        },
        {
            "content": "It took a while to get warmed up, but this film proved to be one of the most thought-provoking pictures I've seen. It also comically demonstrates what I keep finding out for myself - that government bureaucratic agencies will f you over if you don't constantly keep them in check yourself.",
            "review_date": "2011-08-19",
            "source": "rt"
        },
        {
            "content": "My first non-samurai Kurosawa film is also one of his mostly highly regarded works.\n\nA government bureaucrat discovers he has stomach cancer and searches for meaning and purpose in his life after having squandered it behind his desk.\n\nThe structure here is odd.  The first half of the film is told in a straight-forward manner as Wantanabe tries to come to grips with the fact that, not only that he's never really lived, but even worse, he doesn't know how.\n\nThe second half takes place at his wake, with various characters, emboldened by the alcohol, reflect and opine on what drove him to the way he spent his final months.\n\nAnd that's all I'll say for fear of spoiling the film (although you've probably seen the final moments referenced somewhere as it's quite famous).  It's incredibly well made and one of Kurosawa's most moving films.\n\nIt's great.\n\nWatch it.",
            "review_date": "2011-08-08",
            "source": "rt"
        },
        {
            "content": "Much of the film is quite good... until we get tot he wake. It falls apart after that because good God, does that wake go on forever. We don't need it. It's too long. Take it away or reduce and you have a great film.",
            "review_date": "2011-08-04",
            "source": "rt"
        },
        {
            "content": "truly a great movie that makes you think about human life",
            "review_date": "2011-07-17",
            "source": "rt"
        },
        {
            "content": "A film everyone should see. May be the finest film ever made about human mortality. Truly inspiring. It's my favorite Kurosawa film.",
            "review_date": "2011-07-11",
            "source": "rt"
        },
        {
            "content": "A masterpiece, just as good albeit very different than Kurasawa's great Samurai movies and Takashi Shimura's performance is as good as you could hope to see.",
            "review_date": "2011-07-06",
            "source": "rt"
        },
        {
            "content": "The perfect movie - hands down.",
            "review_date": "2011-06-24",
            "source": "rt"
        },
        {
            "content": "Any and all synonyms of profound and beautiful would fittingly describe this movie which tugs at every cerebral synapse and heartstring, often simultaneously.  Shimura's character attempts to give his life some sort of meaning after atrophying his life's possibilities at a thankless, quotidian job in some government organization; an organization that is ironically faceless despite its many adjuncts and sub-groupings.  Although our protagonist does not have much to show when it comes to any nuclear connections with other people, he eventually finds comfort in the fact that he gave something back to other people, the first faceless thing he's done which has any real altruistic meaning.  Reeking of pathos, but skillfully avoiding crossing over into bathos, Shimura's character and his story of self-pity, self-indulgence and eventual selflessness is so very human, so empathetic.  The movie is pure art:  in the emotions it rouses out of its viewing audience, in its visual panache and stunning photography, in the maturity and great care with which the story is presented, and in its incredible ability to edify and inspire others to do their own bit of good in this world.",
            "review_date": "2011-06-23",
            "source": "rt"
        },
        {
            "content": "What is our purpose in life? What we do everyday - does it matter? The main character of IKIRU, Watanabe never thought of these things. He lived without accomplishing anything in his personal and professional life. His coworkers and family members misunderstand him. It isn't until he finds out he is going to die does he ponder over how to spend his last days. In those days he gives love and understanding to the people around him and through his work - he gives back to his community. There is a favorite moment of mine in this film, when Watanabe looks back at key events in his life. His son is in all of them. It's a touching montage displaying the humanity that does exist inside of him but people fail to see even his own son.He seems like a rigid old man but he is anything but! Once he opens up and actually embraces life, he turns out to be a man who does have a heart and can enjoy the world around him. All his life he was a quiet, sad man but it took this illness to shake him up. After his death - the people that would gossip about him discussed the great things he did. Sometimes we really don't appreciate people until they go away do we? I was instantly reminded of PYAASA. A film that deals with a similar theme. Where a great poet isn't appreciated until his death. IKIRU suffers a bit because of it's pacing. It is pretty long and takes it's time. However it does accomplish it's goals. It's touching and thoughtful. Even insightful.",
            "review_date": "2011-06-19",
            "source": "rt"
        },
        {
            "content": "Watch this one before it's too late.  And by that I mean: before you die and before June 21st when you can no longer stream it on Netflix.",
            "review_date": "2011-06-16",
            "source": "rt"
        },
        {
            "content": "It's a very existential piece, a search for what means \"living\". It's also a treatise on public employment and how apathy is maintained in a swirl that sucks all productivity and meaningful work. I was cracking up all the time... =P   More than that, it's a hallmark on fighting the system from within the system. The more I watch Kurosawa, the more I think \"Seven Samurai\", a very good movie, was his less impressive work.",
            "review_date": "2011-06-15",
            "source": "rt"
        },
        {
            "content": "This was a very well-done movie about a man questioning his life and finding purpose before he dies. It's emotionally driven and the movie tells the story right by showing how the people in his life were affected by his death. Some movies have done this, but not alot come to mind",
            "review_date": "2011-06-15",
            "source": "rt"
        },
        {
            "content": "Watched this for a Philosophy course, it really stayed with me.",
            "review_date": "2011-06-14",
            "source": "rt"
        },
        {
            "content": "One of the most beautiful, emotional, and heartwarming films I have ever seen. Takashi Shimura gives one of the best performances I have ever seen",
            "review_date": "2011-06-07",
            "source": "rt"
        },
        {
            "content": "Ikiru - 10/10\r\n\r\nA terminally ill civil worker lives out his last 6 months as a changed man, with a new found urge to live as he realises his life has been wasting away for the past 30 years. In other words, he was a mummy; a corpse. Sitting on the same desk everyday, looking busy but not accomplishing anything of substance. This film really touched a nerve with me although you'd have to be made of stone not to be moved by it. I could especially relate to Watanabe sacrificing his own life for his motherless son, something my dad had to do when my mother passed. One scene that especially moved me was when he requested a song at a bar, and to everyone's surprise he started singing it himself. Similarly, the scene near the end where he was on a swing, singing the same haunting song, was heart wrenching. For the last quarter of the film, after Watanabe has died, we witness his wake as various co-workers discuss his life and piece together what made him change so drastically. Through the scenes at the wake, Kurosawa manages to provide an excellent critique of bureaucracy in post-war Japan but we also get to see how others viewed Watanabe through their rose tinted glasses. A masterpiece, and quite possibly, Kurosawa's best film.",
            "review_date": "2011-05-27",
            "source": "rt"
        },
        {
            "content": "Akira Kurosawa is an extremely classical filmmaker in that he's able to see the death in everything. \"Ikiru\" isn't the exception to disprove that -- it opens blatant enough on an X-ray of a cancer-ridden stomach, as a narrator tells us the scan belongs to our protagonist, civil worker Kanji Watanabe. Kurosawa might also be saying something in how Watanabe the person isn't introduced onscreen until later in the movie. Could it be that there isn't much of a person to appreciate in Watanabe before realizing he has the ailment? And, true, it's the existential man in Kanji we see of the most, himself gripping the fact he has only six months left to live. Doctors choose not to tell him; he's forced to hear the worst from experience by way of his bureaucratic friends. \n\nOkay, maybe \"friends\" is too strong an assumption in Watanabe's case. He's void of virtually all human activity outside of children Mitsuo (Nobuo Kaneko) and Kazue (Kyoko Seki), and the public complaints of messengers he passes from department to department. But Kanji is prone to live in his own dogged aftermath, and he'd be the first to show signs of his grief if he didn't spend the rest of his days in that very state. He admits: \"I've wasted my life.\" So? There's still six months. Why not populate the eleventh hour with babe Toyo (Miki Odagiri), the office secretary? She's the only one with a personality as polar opposite to Kanji's to haunt him with further ghosts, and he gives her the whole disturbed treatment, at her side to contrast his pain. Man up, she says. The more time of hers he absorbs, though, the less he weighs her words as they float away.\n\nThe last gripe at public affairs comes courtesy of stepford wives claiming the city's water is handing out skin rashes like candy. Watanabe (played by the hypnotizing Takashi Shimura, a staple of director Kurosawa's many fames) takes up their challenge when it lands on his desk. \"He's always busy, but never gets anything done,\" the narration bleeds. It's just part of the new parallel reality hanging off Kanji's language as both his nature and the one over which he no longer has control lead to the same bitter end. Kanji slumps around like he's bearing the world on his back, even when he's basically been granted a free pass out. He's not pitied because he's invisible in the grand picture of space; simply walked past and ignored. It's what life has done to Kanji, and will do to everyone. In the impetuous final scene of \"Ikuru\", Kurosawa uses his notorious judicial strengths to seduce the city's recreation offices to come at each other's throats, arguing the significance of Kanji's passing and the verdict of the ladies' new septic tank proposition. Because it's the little people who wind their fates. The cycle chugs along. A masterpiece? A masterpiece.",
            "review_date": "2011-05-22",
            "source": "rt"
        },
        {
            "content": "An incredible achievement!  Watching \"Ikiru\" is like reading the greatest unpublished novel that Dostoyevsky ever wrote, despite it's modern setting.",
            "review_date": "2011-05-21",
            "source": "rt"
        },
        {
            "content": "After being lied to by his doctor, a bureaucrat discovers that he has inoperable stomach cancer, and he searches hedonism, a co-worker, and his work for fulfillment before he meets his end.\nThis film is simply marvelous.  The performance by Takashi Shimura as the dying man is remarkable for his quiet sadness and determination.  The scenes in which he sings on the swing and in the bar are nearly magical in their ability to draw the audience in to Watanabe's mental state.  His outbursts to Toyo are passionate and riveting.  \nKurosawa's direction is at top form.  I think my favorite shot is the foregrounding of the dying man and his co-worker at a restaurant while in the background there is a joyous birthday celebration.  It is pure visual poetry, as the background action carries on, each of its participants doomed to one day be in the foreground.\nWhat is Kurosawa saying with this film?  It can't simply be reduced to another \"carpe diem\" anthem, though there are elements of this.  Rather, I think Kurosawa realizes that we've all heard \"carpe diem\" before, but the tragedy of life is that we fail to recognize its exigence until it's too late.  We see this both in Watanabe's reaction to his impending death and the wake scene in the third act.\nOverall, this is undoubtedly Kurosawa's best film, focusing on the frailty of the human condition and the temporal limitations of life.",
            "review_date": "2011-05-20",
            "source": "rt"
        },
        {
            "content": "I'm not even sure where to begin to review this deeply moving piece of art. I can't describe to you the story without revealing parts that you really should discover for yourself. You take this journey with this man which seems so familiar, and yet I know very few who can say that they have been where he was. It is the main themes of the story which really make it relatable. They are themes that we don't necessarily like to think about but I would argue, and I think Kurosawa would argue, that we should. They are issues which are too large to push under the rug. If you want to get out from under the weight of them then you have to face them head on. That is the most vivid portrait of what this film is about that I dare to give to those who have not seen it.\n\nAs a whole, you cannot deny the magnitude of what this film brings to the table. You have Kurosawa's brilliant camerawork, one of the most moving carpe diem stories ever told, and acting that is truly remarkable. It is one the most deserving masterpieces I've ever seen.",
            "review_date": "2011-05-16",
            "source": "rt"
        },
        {
            "content": "One of the few films that may actually change someones life, and the way they view it.",
            "review_date": "2011-05-14",
            "source": "rt"
        },
        {
            "content": "Beautiful piece from the master Kurosawa. Eloquent use of flashback and cutaways to build up a portrait of a man who realises too late that he has wasted his life.",
            "review_date": "2011-05-11",
            "source": "rt"
        },
        {
            "content": "Does this film gave me a big lesson to me, yes, a lot, and did it inspired me, yes, a lot. Well, I don't need to say more to this movie. \"Ikiru\", is truly the one movie that I felt maybe someday this character will be the same as me, in other words like Mr. Watanabe, he worked in his whole life doing nothing whatsoever, and does his son and daughter-in-law cares him, not at all. At the first time we meet this old man, we already know that he has a cancer but our guy don't know it yet, and we also see that he works all day and nothing to celebrate at night. This is true not to this old man, but to other people that I know so well, they have family, but do they love them? They also have friends but do they trust them? That's one of the things that comes in my head, about the future and life when you get old. Then towards the middle, he spends his time on bars and with women, that he didn't do when he's still young. We also get to meet his son and his wife that tells us about how they care on his father's pension and their inheritance to him. Next thing is that, Mr. Watanabe builds a playground for children as he wishes before he dies. Then as we know what will happen next, he dies, yes he dies, of course then his love ones came to visit him. And so, that's the story of this old sad and lost man.\nSo, there you have it, I want to watch it again but I think it would really make me cry this time for sure. And, what else to say, oh! Kurosawa is always a great director, but this one is not about his signature Samurai style, but about a lost Samurai that doesn't become who he is until he realizes those things. Once again, this movie is the only film that I can relate to and inspire as well.",
            "review_date": "2011-04-21",
            "source": "rt"
        },
        {
            "content": "I believe this is his best work of art.",
            "review_date": "2011-04-19",
            "source": "rt"
        },
        {
            "content": "A beautiful, yet sad story of a man who has done nothing in his life and yet strives in his final months to do something great while he contemplates his life.",
            "review_date": "2011-04-19",
            "source": "rt"
        },
        {
            "content": "Another compelling masterwork from Akira Kurosawa, Ikiru is a thoughtful meditation on both the meaning of life and what it means to be alive. Takashi Shimura's revelatory lead performance as a man dying of cancer will keep you engrossed despite the fairly slow pace.",
            "review_date": "2011-04-18",
            "source": "rt"
        },
        {
            "content": "Undoubtedly one of the most beautiful films ever made, graced with one of the best performances of all time by Takashi Shimura.",
            "review_date": "2011-04-13",
            "source": "rt"
        },
        {
            "content": "What a MASTERPIECE!!...this one teaches you one of the basic truths of life.. :)",
            "review_date": "2011-04-12",
            "source": "rt"
        },
        {
            "content": "Most excellent film from Japan.",
            "review_date": "2011-04-10",
            "source": "rt"
        },
        {
            "content": "If you're not emotionally moved by this film, then there's something terribly wrong with you.",
            "review_date": "2011-04-08",
            "source": "rt"
        },
        {
            "content": "Truly effecting, poetic and exisential story of a man who, having been diagnosed with a terminal illness, seeks to do something meaningful with his miserable life. Again crafted with a magic wand by Kurosawa, but this time set in a modern and urban Japanese landscape. Possibly one of his most personal films you would encounter and a wonderful insight to the man in a way...Ikiru means 'to live'.",
            "review_date": "2011-04-04",
            "source": "rt"
        },
        {
            "content": "This is, in my opinion, Akira Kurosawa's most over-rated film. It has good things to say, but it seems like it's not sure how to say them. On one end, this is the story of a man who's done very little with his life, and now finds he's going to die; on the other, we have a critique of the bureaucracy in government offices. While both ideas are connected, they really only connect in the film at the beginning. Then we follow watanabe trying to live, and then trying to make something, anything to feel he has accomplished something. I feel like it was a mistake to cut ahead to his funeral the moment he decided to do something. If the film hadn't spent so long addressing his learning to live, it would have felt natural, but as is, this method of story-telling felt disjointed, almost like two separate movies connected loosely at the waist",
            "review_date": "2011-04-03",
            "source": "rt"
        },
        {
            "content": "Movies carrying a 'carpe diem' message are nothing new, even in 1952 such tales had been seen and heard for many years, but rarely do we get to witness one as convincing and poignant as Akira Kurosawa's Ikiru.\r\n\r\nFollowing the recent events in Japan, it's difficult to imagine its workforce is as complacent and aimless as Kurosawa paints them here, especially considering how quickly and rigorously the nation has bounced back from such devastation. However in the early fifties it seems that the working men of Japan had some serious motivational issues. Ikiru tells the story of one such man, who after many years of pointless service to his town council where he and his colleagues waste away the days pretending to look busy and achieving very little, he is diagnosed with cancer and realises that time is much more precious that he had previously treated it.\r\n\r\nIn search of meaning and purpose to his final days, our hero Watanabe (played brilliantly by Takashi Shimura) learns to spend his hard-earned money, finding pleasure in a new friendship with a young female colleague. However it's not until he realises he must achieve something of worth, that he feels ready to succumb to the disease threatening his life. Yes, the moral is heavy and quite blatant from the outset, but thanks to the delicate guiding hands of director Kurosawa the message in Ikiru is amazingly just as valid today as it was almost sixty years ago.\r\n\r\nKurosawa guides the viewer expertly through Watanabe's experiences, managing to create a life that almost any viewer can relate to. This is truly one of those films that has the rare capacity to make its audience reassess their own lives in light of the characters they're viewing; a sure sign of great filmmaking. On top of this Ikiru is a hugely moving film. The final act which sees Watanabe's bereaved colleagues discuss his final days is expertly written and directed, and really sums up everything this movie is about; living a life that impacts those around you. It's a brief glimpse of hope amidst a largely cheerless story, however Kurosawa is not blind to the weaknesses of the human psyche as the film's final moments show.\r\n\r\nThough it's often overlooked in favour of Kurosawa's samurai epics, Ikiru remains one of his finest movies. More personal and approachable than his other works, this is a wonderful film with a message that we can all benefit from heeding.",
            "review_date": "2011-03-31",
            "source": "rt"
        },
        {
            "content": "Very sweet film and directing was top notch, not as much fun as Seven Samurai perhaps but probably more meaningful",
            "review_date": "2011-03-28",
            "source": "rt"
        },
        {
            "content": "One of the best films... ever. A brilliant document on what it means to be alive and what it means to live. Superb.",
            "review_date": "2011-03-19",
            "source": "rt"
        },
        {
            "content": "Cultural mockery, kicking the ass of bureaucracy and a slap in the face of life... all of this in 1952!",
            "review_date": "2011-03-15",
            "source": "rt"
        },
        {
            "content": "If I were to break down a film and grade every aspect of it, I would give Ikiru a perfect score in every category.  This is a film that I am excited to revisit many times through the years and one of the few movies that may truly change how I live.",
            "review_date": "2011-02-25",
            "source": "rt"
        },
        {
            "content": "\"I never felt so bad for anybody\"",
            "review_date": "2011-02-24",
            "source": "rt"
        },
        {
            "content": "Akira Kurosawa created one of the best films ever! Takashi Shimura performs his GREATEST PERFORMANCE in a delicate, childish,depressing, powerful, extraordinary and moving way.( And I thought Toshiro Mifune was the greatest japanese actor; maybe I will have to reconsider.)Critics have claim that this is Kurosawa´s greatest work, Personally- I won´t say is it is, only because this is just one of many other Masterpieces from Kurosawa. The meaning is simple... DON´T WASTE YOUR LIFE- YOU HAVE TO LIVE.\nLife is brief. Fall in love, maidens, Before the crimson bloom fades from your lips, Before the tides of passion cool within you, For those of you who know no tomorrow. With powerful performances, imagery, and songs... IKIRU is a phenomenon when speaking of excellent filmmaking! I was crying at times..\nLife is brief. Fall in love, maidens, Before his hands take up his boat, Before the flush of his cheeks fades, For those of you who will never return here. Not a film for everyone, just film-lovers.",
            "review_date": "2011-02-17",
            "source": "rt"
        },
        {
            "content": "Too damn slow.  The movie was okay till the funeral scene, then it was so boring with a bunch of guys yapping away for the past hour or so!  This movie is a classic but movies, beyond anything else, should be at least halfway entertaining!",
            "review_date": "2011-02-14",
            "source": "rt"
        },
        {
            "content": "IKIRU (1952)\nDirector: Akira Kurosawa\nCast: Takeshi Shimura\n\nFilm is about a man who spent his whole life working in a company having no free days at all for almost 50 years. He finds out that he is suffering from a terminal illness, and realize that he did nothing for his whole life. it is like he never exist. \nHero of the movie, Kanji Watanabe (Takashi Shimura), wants do do something that was actually worth of living. Kanji put his strength to build a park in undeveloped part of the city. \nEventually, Kanji watanabe dies, however, on his funeral all his co-workers speak about the park he built.\n\nCOMMENTS: Film shows importance of life. Especially after death, because, image of Kanji, starts to be more clearly just after his death, where is truth about how park has been built, discovered. \nit is also good moment that tells how he didn't do anything for whole his life, until he realized that he'll die soon, when he actually place strong mark of his life.",
            "review_date": "2011-02-14",
            "source": "rt"
        },
        {
            "content": "1001 movies to see before you die.",
            "review_date": "2011-02-11",
            "source": "rt"
        },
        {
            "content": "The third Kurosawa I've seen and I think I'm finally starting to understand his films (at least a little bit). I almost think of this as a Japanese \"It's a Wonderful Life.\" A melodramatic tale about a dying man who decides he has to do something with his life before his disease takes it. Indulgent partying and a young girlfriend fail to satisfy before he decides he will use the soul-sucking job he's wasted away at for 30 years to do his last good deed. There are some big surprises in the story structure and sympathetic performances, not to mention strong visuals and reflections on life, family and bureaucracy. Unfortunately the film drags at points, mostly in the final act when there isn't enough story to fill the hour. Still, the universal themes make this a fairly accessible movie and it's my favorite Kurosawa so far.",
            "review_date": "2011-02-08",
            "source": "rt"
        },
        {
            "content": "The third Kurosawa I've seen and I think I'm finally starting to understand his films (at least a little bit). I almost think of this as a Japanese \"It's a Wonderful Life.\" A melodramatic tale about a dying man who decides he has to do something with his life before his disease takes it. Indulgent partying and a young girlfriend fail to satisfy before he decides he will use the soul-sucking job he's wasted away at for 30 years to do his last good deed. There are some big surprises in the story structure and sympathetic performances, not to mention strong visuals and reflections on life, family and bureaucracy. Unfortunately the film drags at points, mostly in the final act when there isn't enough story to fill the hour. Still, the universal themes make this a fairly accessible movie and it's my favorite Kurosawa so far.",
            "review_date": "2011-02-08",
            "source": "rt"
        },
        {
            "content": "One of the greatest films I have ever seen. I highly recommend this film.",
            "review_date": "2011-02-06",
            "source": "rt"
        },
        {
            "content": "Time Magazine's All-Time Top 100 Movies",
            "review_date": "2011-01-31",
            "source": "rt"
        },
        {
            "content": "Clearly one of the most humane views on the what life is and can be Uncompromising in its storytelling eye, it becomes a kind of redemption for mankind.",
            "review_date": "2011-01-24",
            "source": "rt"
        },
        {
            "content": "This is one of the best films I've seen in quite awhile.  Emotional, profound, and well done in every way.  Kirosawa shows Watanabe in all his phases of calm, desperation, creepiness, and inspiration superbly.  The Life is Brief song along with the swing conveys a powerful and haunting image.  While slowly paced, it is at the same time perfect.",
            "review_date": "2011-01-14",
            "source": "rt"
        },
        {
            "content": "Another masterpiece from Akira Kurosawa!!!\n\nThis film is very profound and touching. It asks us what's the essence of \"Ikiru\" (living/ to live) and how one manages to live their own life with the time they have (left) in this world.\n\nThe relationship between characters are also interesting such as Watanabe with his ignorant son along with his daughter in law, Watanabe and the young girl from the office, Watanabe and his colleagues and other officers. \n\nPeople tend to judge others from their own perspectives despite the fact that they know nothing about them. They don't even take a time to ask what's going on with others' lives even though they sense that there's a problem going on ... they'd never know it hurts some people's feeling and that might be their last chance to do so. \n\nThe film also criticizes bureaucracy which is very alike what's going on in my country (Thailand). How can good-willed and determined people survive the shark tank filled with corruption, patronage system and stubborn big people who dare not to change? One exploits others and those who suffer are the poor citizen. That's a real tragic of all human beings.  \n\nMy favorite scene is whenever Watanabe sings that \"Life is short\" song and also the scene where he's alone in the swing at HIS park. Shimura does a terrific job in portraying Watanabe. Whenever the camera closes up to his face and eyes, you can see clearly what's on Watanabe's mind without any words said.  \n\nI've learned a lot from this movie. And like what Watanabe says \"There's nothing we can't do if we're determined,\" then why don't we start making a difference and live our life the way we want now? :)",
            "review_date": "2011-01-13",
            "source": "rt"
        },
        {
            "content": "Moving, involving movie.",
            "review_date": "2011-01-08",
            "source": "rt"
        },
        {
            "content": "Another classic from Akira Kurosawa!!\nA must watch...",
            "review_date": "2011-01-04",
            "source": "rt"
        },
        {
            "content": "Esta magnifica licao de vida, critica do modo de vida maçante e repleta de sequencias emocionantes deve ser vista pelo menos uma vez na vida.",
            "review_date": "2010-12-31",
            "source": "rt"
        },
        {
            "content": "What a profoundly-moving film this is!",
            "review_date": "2010-12-26",
            "source": "rt"
        },
        {
            "content": "\"This stomach belongs to the protaganist of our story.  At this point he has no idea he has this cancer\".  So says the narration over the beginning of Ikiru, the 1952 film from Akira Kurosawa.  It then goes on to show \"the protaganist\", a public relations section chief (of his local government) hunched over a desk in front of a wall of bundled papers.  \"It would be tiresome to meet him now, after all he's simply passing time without actually living his life.  In other words, he's not even really alive.\"  If he's not really alive, neither are his co-workers, who play bureaucratic hot potato with a group of citizens (\"passing the buck\" seems to be the natural state of government, or so the film says).  Besides skewering government bureaucracy, Ikiru also draws parallels to Ingmar Bergman's 1957 film, \"Wild Strawberries\": with the looming specter of death at hand, a single father ponders the relationship he has with his son (and also his own mortality) while trying to cling to the vibrancy of life he finds in a younger girl.  What's sad about this movie isn't necessarily that the old man is dying, but how everyone around him is barely living.  The prostitutes, the writer, the mafia, his governmental co-workers, his family, even the doctors who tell him he's dying, none of them are honest or happy (or honest and happy, apparently you can't be both).  Only his frivolous young female co-worker makes the most of the life she has.  She doesn't waste a second of her time being in unhappy situations, and points out false sacrifice of dedicating his life for his son.  The story of the old man who finds out he's dying and then has a change of heart may not be revolutionary, but the style and perspective in which it's told is more unique than similar stories.  \"To live\", is what the film's title translates into, but \"life without purpose is meaningless\" is the message.  Those without purpose are simply living to die.  But if you do something good for others because you have nothing to lose and you know you're going to die, is that as morally good as doing something for others when you have something to lose? (Aren't we all dying in the long run, and shouldn't we live our lives accordingly?)  Is it cynical to even ask?  It's a discussion raised in the film, where the old man's co-workers decide to honor his memory by living as he did at the end.  Kurosawa plays on the audience's emotions, especially our sense of outrage, quite effectively at the end.  Whether it's a shot at politicians and bureaucrats or whether it's a shot at the human race in general is up for debate.",
            "review_date": "2010-12-12",
            "source": "rt"
        },
        {
            "content": "\"This stomach belongs to the protaganist of our story.  At this point he has no idea he has this cancer\".  So says the narration over the beginning of Ikiru, the 1952 film from Akira Kurosawa.  It then goes on to show \"the protaganist\", a public relations section chief (of his local government) hunched over a desk in front of a wall of bundled papers.  \"It would be tiresome to meet him now, after all he's simply passing time without actually living his life.  In other words, he's not even really alive.\"  If he's not really alive, neither are his co-workers, who play bureaucratic hot potato with a group of citizens (\"passing the buck\" seems to be the natural state of government, or so the film says).  Besides skewering government bureaucracy, Ikiru also draws parallels to Ingmar Bergman's 1957 film, \"Wild Strawberries\": with the looming specter of death at hand, a single father ponders the relationship he has with his son (and also his own mortality) while trying to cling to the vibrancy of life he finds in a younger girl.  What's sad about this movie isn't necessarily that the old man is dying, but how everyone around him is barely living.  The prostitutes, the writer, the mafia, his governmental co-workers, his family, even the doctors who tell him he's dying, none of them are honest or happy (or honest and happy, apparently you can't be both).  Only his frivolous young female co-worker makes the most of the life she has.  She doesn't waste a second of her time being in unhappy situations, and points out false sacrifice of dedicating his life for his son.  The story of the old man who finds out he's dying and then has a change of heart may not be revolutionary, but the style and perspective in which it's told is more unique than similar stories.  \"To live\", is what the film's title translates into, but \"life without purpose is meaningless\" is the message.  Those without purpose are simply living to die.  But if you do something good for others because you have nothing to lose and you know you're going to die, is that as morally good as doing something for others when you have something to lose? (Aren't we all dying in the long run, and shouldn't we live our lives accordingly?)  Is it cynical to even ask?  It's a discussion raised in the film, where the old man's co-workers decide to honor his memory by living as he did at the end.  Kurosawa plays on the audience's emotions, especially our sense of outrage, quite effectively at the end.  Whether it's a shot at politicians and bureaucrats or whether it's a shot at the human race in general is up for debate.",
            "review_date": "2010-12-12",
            "source": "rt"
        },
        {
            "content": "First act is kind of slow, but second act is super awesome. About a humble man who tries to make a small difference.",
            "review_date": "2010-12-10",
            "source": "rt"
        },
        {
            "content": "Another Kurosawa Classic.\n\nHe is master of both the Samurai and the Modern film.",
            "review_date": "2010-12-08",
            "source": "rt"
        },
        {
            "content": "Watching films under director Akiro Kurosawa is definately a suggestion. \"Ikuru,\" which was released between his breathtaking works \"Rashomon\" and \"The Seven Samurai,\" is about a man who discovers he has stomach cancer (or what the doctors called an ulcer). He is given months to live and for the first while, he is utterly depressed that his death will be pre-mature. However, he sees a small light that influences him to take on a major project before he succumbs to his illness, in which he will build a park. The film demonstrates that Kurosawa could take on other projects in addition to his fabulous fighting films. The film is heartbraking, and will easily cause tears to develop within your eyes. It is indeed lovely. One small thing is the length, and that is the last 40 minutes. Perhaps it could have been trimmed about 10 minutes, that's all. However, that does not effect that overall power of this film. It is indeed, another great one from the Japanese master, Kurosawa.",
            "review_date": "2010-12-02",
            "source": "rt"
        },
        {
            "content": "Another great Kurosawa film. Such a touching and life affirming subject and message, which will surely reach any kind of audience. Always loved Shimura in Kurosawa's other stuff, so it's great to see him be given centre stage here, and he does a phenomenal job. My only complaint is that it doesn't really take the story in the right direction after a point - once he dies, all of this discussion and flashback stuff, though prescient to delivering the message, is a tad dull compared to what came before and the direction in which they could have taken it. I would have rather seen the him learn new things about life up until his dying day, than view how he affected his colleagues after his death. Among my top few Kurosawa films.",
            "review_date": "2010-11-26",
            "source": "rt"
        },
        {
            "content": "10 Ã 1/4zerinden 100",
            "review_date": "2010-11-24",
            "source": "rt"
        },
        {
            "content": "A sort of movie that I find not many people know about because it isn't in English and another being not well known to my generation. They may rave about films like crazy bit do they have the emotional depth, poignancy, and life affirming no not likely. \n\nIkiru is about an ordinary man's struggle to find a purpose in his life ., compound on the fact that he is dying of stomach cancer and has less than a year to live. What makes this film poignant is that people in every day life refuse to think about this part of life... facing the bitter end and finding a meaning to it all or trying to leave the world a little better place than you found it. That is what struck me story wise.\n\nBut aside from its age I find that the film is finely crafted and its pacing goes along and enhances the story being told.\n\nYears later I still enjoy this film..",
            "review_date": "2010-11-21",
            "source": "rt"
        },
        {
            "content": "A powerful movie... A film that made me put my own life into perspective after viewing.",
            "review_date": "2010-11-16",
            "source": "rt"
        },
        {
            "content": "I cannot give this less than 100.\r\n\r\nIt's such a moving piece of cinema, and so seemingly before it's time. Purely inspirational. \r\n\r\nKurosawa is a genius for telling the story the way he did. I haven't seen much like it in modern cinema. So well crafted, the film just flows well. It's begging to be remade in America, but I hope it doesn't happen. Other words that come to mind are: profound, beautiful, moving, relevant. The pace was not bad at all, people who complain about that really don't know what story telling is all about. The way the story is told in the last act (third) of the film is awesome. \r\n\r\nThe film sat really deep with me because I am currently stuck in a job that I hate and I felt I was wasting my life...now I gotta quit and do something amazing (or just great).",
            "review_date": "2010-11-06",
            "source": "rt"
        },
        {
            "content": "One of my all time favorite films. This story about a dying man who tries to find meaning in his life is far superior to anything that Hallmark and Lifetime puts out, and many sentimental films to shame.  It also contains one of the best shots ever put on film showing Watanabe's last moments: sitting on a swing in the park he helped make, singing with the snow falling around him.  Watanabe sings this song twice at two very different moments in the film: the first he's in a bar at his absolute lowest and the second is when he is about to die and at the height of his joy.  This film is not just about death, it's also about what it means to truly be alive.",
            "review_date": "2010-10-28",
            "source": "rt"
        },
        {
            "content": "Truly Inspirational Film. It will leave you wanting to challenge yourself. Immediately one of my favorites.",
            "review_date": "2010-10-27",
            "source": "rt"
        },
        {
            "content": "Almost 60 years after it was made, \"Ikiru\" is a film that feels both far removed from and heads and shoulders above virtually all contemporary films.  It's about a man who discovers two important things simultaneously: 1) he's dying, and 2) he's wasted his life on petty bureaucracy.  One of these things is impossible to change; the other may not be.  He is afraid to die -- but has always been even more afraid to live.  Every moment, every shot, every frame of \"Ikiru\" has been deliberately crafted by Akira Kurosawa, and while some of it feels slow by today's standards, none of it is extraneous.\n\nShot in black-and-white, it features a genuinely remarkable Takashi Shimuro and an equally brave one by Miki Odagiri as an office girl in whom he confides. Though it was made more than a half-century ago, \"Ikiru\" is more than relevant today, and has some powerfully unsettling, often harsh and angry observations to make about the way we live, the way we work and the way we treat each other.  Anyone interested in film should see and seriously study the way \"Ikiru\" is so artfully constructed; anyone interested in human nature should see it, too.\n\nYes, it takes patience -- sometimes a lot of patience, especially for modern audiences spoiled by Cuisinart-style digital editing and visually enhanced eye-candy.  But it offers huge rewards.  \"Ikiru\" may be about Japanese bureaucrats in the early 1950s, but it's astonishingly akin to many American workers living in the 21st century.  \"Ikiru\" presents a beautiful, moving, stunningly sad and at times overwhelmingly disheartening view of the world.  But then there's that famous image (one that even people unfamiliar with the film may have seen) of an old man on a swing in the snow.  It's not just an extraordinary cinematic moment, it's one that may well have you contemplating how you've spent your own life ... and how you might find your own swing on which you can softly sing a song in the middle of the night.",
            "review_date": "2010-10-20",
            "source": "rt"
        },
        {
            "content": "Watching Ikiru once will change your life forever!",
            "review_date": "2010-10-16",
            "source": "rt"
        },
        {
            "content": "A five-star classic. Touching and emotionally potent.",
            "review_date": "2010-10-13",
            "source": "rt"
        },
        {
            "content": "In the hands of most directors, stories similar to Ikiru would seem dull and recycled: a man realizes his death is close and finds a new grasp on life. He discovers there is more after a closer look and it is never too late to start living. However, give legendary filmmaker Akira Kurosawa the reins and youâre in for something masterful.\n\nIkiru follows Kanji Watanabe (Takashi Shimura), the section chief of public affairs for the city council. After holding his painfully boring job for almost thirty years, he discovers he has stomach cancer. At first he is struck with grief, but then decides to seize the opportunity to try new things. After a night out with a failed writer and spending time with a spritely young lady, Watanabe decides he must build something to give his life meaning. He believes building a park for a small community with a cesspool problem will do the trick, but he must go through city council, which has no intention of giving in to his proposal.\n\nThis movie belongs to Kurosawa. He moves through each scene with such grace and flow that the 143-minute film about death hardly seems its length. Kurosawaâs shots serve every bit of purpose as the dialogue, expressing moods and meaning. In one such scene, Watanabe is winding his clock before going to bed, signaling his time is slowly ticking away. As he throws the clock aside to grieve, the camera moves to Watanabeâs certificate for working his job for 25 years, signaling the time he has wasted. Kurosawaâs ability to take minor details to their full potential makes the movie all the more meaningful and real.\n\nMusic also plays a small and important role in Ikiru. One may find the score to be monumental and overdone, but the full orchestra normally found in an epic drama fits nicely. Although Watanabe is pitiful and insignificant, his problem is life-changing and noteworthy. The music shows the problems facing men everyday are worthy of mention. In addition to the music, Watanabe sings a song called âLife is Briefâ at two different points in the film. The first time is when he has just discovered his illness and is beginning to grasp his life will soon end. As he sings of finding love before you die, he cries. The second time he sings, he has found a new outlook on life and the song no longer pains him, but comforts him. The difference between the moods of the scenes shows Watanabeâs progression as a human being and his outlook on death.\n\nEmotional scenes, such as Watanabe singing, are another specialty of Kurosawaâs. The emotion never feels forced or overdone, but instead pressed heavily enough on the audience to stir the mind. Some credit must also be given to long-time Kurosawa actor Takashi Shimura, who gives his usual outstanding performance. He never forces viewers to feel sorry for Watanabe, but also clearly lays out the grief plaguing the character. Most of the work is done with his eyes, which pulse with emotion in scene after scene. Shimura creates an entirely different character by the end of the movie and takes the viewer on an emotional character journey.\n\nKurosawa took an unoriginal idea and turned it into something completely different. His unique way of storytelling and filmmaking create for an interesting character study of a man finding his purpose. Whether or not his death has an effect on those around him, Watanabe discovers he must only worry about those who will see his true beauty and what he strives to leave behind. While most people live and wait for death, Kurosawa shows that sometimes it takes death to start living.\n\nRead more reviews at http://cinemabeans.blogspot.com/",
            "review_date": "2010-10-11",
            "source": "rt"
        },
        {
            "content": "Kurosawa's masterpiece.",
            "review_date": "2010-10-08",
            "source": "rt"
        },
        {
            "content": "This is my faviorte movie of all time. Not only did this movie amazed me. It made me think how I should rethink my life or how to move forward. I can't describe in words how this movie as effiect me as a person and to becoming a filmaker. Kurosawa has doin it again. Making another classic that never dissapointes.",
            "review_date": "2010-10-07",
            "source": "rt"
        },
        {
            "content": "Ikiru might be a bit slow at times (for modern, but still good watchers) but it is perfect by all means.  Amazing cinematography, great acting (Shimura must be one of the best and charming actors of all time), great directing and a fucking awesome plot and script.  This is the second film by the master Akira Kurosawa I watch, and he still amazes me.  R.I.P Akira, R.I.P Takashi Shimura.",
            "review_date": "2010-09-19",
            "source": "rt"
        },
        {
            "content": "A man diagnosed with stomach cancer decides to do the ultimate good deed by converting a swamp land into a kids playground. A beautiful masterpiece from Akira Kurosawa.",
            "review_date": "2010-09-11",
            "source": "rt"
        },
        {
            "content": "Fantastic how very abruptly the film's structure shifts gears two thirds of the way through the film.  The final 50 minutes jet along but would not work nearly as well were it not for the film's initial, deliberately paced hour and a half.  I have three new stunningly beautiful shots for the Potential Desktop Wallpaper file.",
            "review_date": "2010-08-30",
            "source": "rt"
        },
        {
            "content": "A master didnt always talk about weird story, but rather putting a big issue into a fantastic lecture of moving picture.",
            "review_date": "2010-08-29",
            "source": "rt"
        },
        {
            "content": "This is where true film making takes over and petty technique gets left behind. Sure it could be trimmed a little bit, or a little more tightly edited, or a little better acted (though Takashi Shimura performance ranks as his career best!) but every single complaint that could be raised against this film just comes across as so shallow. Emperor Joseph in Amadeus tells Mozart his latest masterpiece has \"too many notes\". Ikiru rises above all petty criticism by capturing the meaning of Life like no other film has. Rising above it's very medium, Ikiru transcends into high art by capturing and reflecting the very nature of man. Kurosawa tells us not to waste our lives, and compels us to take the lessons of his protagonist to heart, the way that his coworkers pledge to, but then mostly ignore. We are better than they!",
            "review_date": "2010-08-25",
            "source": "rt"
        },
        {
            "content": "The message itself worths a five star. Finds it dragging a bit otherwise. Live every day like your remaining days of your life.",
            "review_date": "2010-08-25",
            "source": "rt"
        },
        {
            "content": "Instantly jumps onto my list of greatest films of all time. Ikiru is a devastating and inspirational work of art.",
            "review_date": "2010-08-24",
            "source": "rt"
        },
        {
            "content": "A profound film about life and death, pessimism and optimism, and accepting ones fate along with ones ability to do what they can with what they have.",
            "review_date": "2010-08-22",
            "source": "rt"
        }
    ]
}