{
    "rating": 9.5,
    "release_date": "1956-06-05",
    "num_reviews": 150,
    "genres": [
        "French(Canada)"
    ],
    "summary": "Out of prison after a five-year stretch, jewel thief Tony (Jean Servais) turns down a quick job his friend Jo (Carl Mohner) offers him, until he discovers that his old girlfriend Mado (Marie Sabouret) has become the lover of local gangster Pierre Grutter (Marcel Lupovici) during Tony's absence. Expanding a minor smash-and-grab into a full-scale jewel heist, Tony and his crew appear to get away clean, but their actions after the job is completed threaten the lives of everyone involved.",
    "reviews": [
        {
            "content": "Rififi is a unique movie that highlights a few ex cons doing a diamond heist for financial reasons. I love the performances, the direction, the writing and the plot twists. I also enjoyed the 30 minute silent scene. Overall, Rififi defines the combination of noir and crime movies to another level.",
            "review_date": "2022-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't find the movie to watch it:(\nAny suggestions..?",
            "review_date": "2022-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A decent noir film with plenty of suspense, Quirky characters and drama. Either way you are guaranteed plenty of entertainment. The reason I wont give it a full 5 star rating is due to the fact its only good for one viewing. Once you watched it all the way until the end its a one time only experience , at least for me. The english dubbed version looses alot of dialogue in translation. Therefore Id highly recommend the original french version with subtitles instead.All in all it was a riveting movie adventure.",
            "review_date": "2022-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As one of the great works of noir, Rififi reaches stunning heights of suspense and innovation, surprising us with a wholly original plot structure that confounds all traditional expectations. From the outset, we know that we are in rough company as our grizzled protagonist introduces us to the sultry world of gambling, night clubs and underworld scheming. While we might feel tempted to regard the famously meticulous heist sequence as the film's climax, we will find that many gripping surprises still await us as we follow the key players through the logic and the consequences of their ambitious crime. The film's ingenuity rests in the way that new and unforeseeable sources of tension lurch forward just as we're catching our breath, creating a hectic and disorienting sense of where we stand in relation to the story's unfolding. At every level, the mood of pure classic noir lights our way through an unpredictable labyrinth of crime, passion and betrayal that we're happy get lost in again and again.",
            "review_date": "2022-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Obviously much has deservedly been written about the brilliance of it's wordless heist sequence but the rest of the movie is filled with brilliant little character observations, which is why the tragic ending plays so well.",
            "review_date": "2022-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Hatton Garden job done without flair. If only the French had a translation for film noir, I'd know what to describe this as. The heist is the most fun part but the story has enough legs for some subsequent twists, turns and tragedy.",
            "review_date": "2021-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The bold narrative and style are something really worth a shot. Being a neo-noir fan I think it carries most of the elements of a neo-noir classic.",
            "review_date": "2021-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A pretty impressive crime thriller for its time with the heist being so detailed you'd think the makers of the film were actual bank robbers and the movie delivers some genuine suspense nearing the climax.",
            "review_date": "2021-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "America's loss was Europe's gain. With a shoestring budget and having to cast himself in a decent role, Dassin managed to craft one of the most influential films of the heist genre. Yes, some of the elements have aged poorly (particularly the sexualization of all but woman with more than five lines) and would be panned today, but I was able to look past that. Even though the protagonists are seedy people, it is impossible not to really care about their predicaments and final fates. The heist scene is brilliantly executed, and the fallout wonderfully gripping. Perhaps the likes of Mission Impossible have taken the technical aspect of heist films to new heights, but this really is one of the best films for its means that could have been made. The audience receives the groundwork for almost every heist film to come as well as a wonderful noir atmosphere simply not replicated outside of its era. What a film.",
            "review_date": "2021-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "they filmed the best heist in the history with a realistic ending",
            "review_date": "2021-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cleverly shot and led by an exceptionally capable performance from Servais, Rififi is a rather unique blending of conventional noir themes and more dynamic, engaging elements; this isn't a '40s Bogart noir where a wise-cracking private dick cruises from room to room trying to piece together a convoluted conspiracy, but a three-act narrative that sews together story elements that could have easily been jarring. An atmospheric noir opening, a clever heist flick, and finally,the undoing of a criminal conspiracy brought about by a single loose thread. The cinematography is constantly creating engaging moments, particularly César's murder and the final frenzied drive through Paris. Servais brings to life an exceptional portrait of a gangster - at once capable and intimidating but beaten down, displaying empathetic qualtiies but reinforcing that he is not at all a good person (particularly through his abuse of Mado). However, nitpicking the story a bit: what was the point of the police officers recognizing the gang's license plate outside of the jewelers during the heist? t didn't really seem to play a role in their undoing, and seems out of place, unless I missed some context. Overall still quite a take on the noir genre, refusing to lean on atmosphere alone and instead innovating. (4.5/5)",
            "review_date": "2020-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This basically felt like one long poem, in the form of an amazing heist film, and I absolutely loved it. Each character brought a unique flavor to the group and the film overall, while Dassin showed excellent touch, and at times restraint, to create an appealing blend of tension and introspection. This film should be viewed for the famous heist scene, if nothing else, and the scene somehow still exceeded the hype for me.\n\nSide note: One of my biggest movie pet peeves are during gambling scenes where inevitably money that was never on the table to start a hand ends up being tossed in along with car keys, house deeds, first born kids, etc which for anyone who has ever sat a poker table knows, isnt how it works. Good will was established quickly for me here when the opening scene featured a card game mid hand and a player was finally, and correctly, told that he could only bet what he had at the table.",
            "review_date": "2020-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'If elements of it seem overly familiar now, that's only because they were done first here'.",
            "review_date": "2020-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know if it is due that most of the resources have been employed in later movies, or that characters lack any expression that you can neither feel anything, the point is that the movie does not attract me the way it should to be one of the first ones about heists.",
            "review_date": "2020-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent crime drama or heist movie: the genre appellation not matters in the case of such a movie: it's too complex for a single genre to hold it within itself. Everything is top notch in this drama, from acting to production to execution; it's uncompromising and bleak, and it depicts the criminal life in the strongest shadows of grey color, black-and-white cinematography being perfect for this purpose. The technical brilliance of the robbery sequence, I assume, is legendary, but the subsequent consequences of it are not less spectacular with Jean Servais delivering a truly compelling performance of an experienced tough guy.",
            "review_date": "2019-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have a conditional love for heist movies. I can only get on board with them if the movie makes me like some of the characters. The easy way of doing this is getting me to side with the cops who are trying to figure out the crime and catch the bad guys. The more precarious balance is what Rififi manages to accomplish, where they establish crooks and somehow make me care about them. I’m not sure why I was invested in the guys involved in this robbery, but I was holding my breath a number of times because I didn’t want them to get caught. The actual scene that showed the heist was my favorite part of the film because it felt authentic, and had my heart racing with excitement. Building up to this moment was also a treat because they have a lot of little moments where we see them planning for the crime and problem-solving the obstacles they would find along the way. This section of Rififi also builds up the different characters so we could see what each person added to the team. The final act was the only aspect of Rififi that I didn’t enjoy as much. After getting me on board with these characters, the last thing I wanted was to watch as things start to fall apart for them. It’s kind of inevitable in a film like this, particularly one that feels more realistic, that it’s not going to be so easy for the crooks to live happily-ever-after, but it didn’t make it easy to swallow. I still enjoyed the tension in these scenes, and I liked how the protagonists matched wits with their opponents. The ending certainly didn’t ruin Rififi for me, but it was a downer after I had enjoyed the first two acts so much. The cast is marvelous, and they all deliver great performances. However, Jean Servais was the real star of the show. Every time he was on screen I felt like I knew what he was thinking, and I loved how he was a few steps ahead of everyone else. Rififi should be included on every list of great heist movies, and is one that I would gladly watch again. In fact, I’d probably enjoy it even more the next time because I already know how it will end.",
            "review_date": "2019-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The criminal heist movie that influenced so many.  It's not perfect, but it's really a true classic.",
            "review_date": "2018-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic in every sense: black-&-white, French, 1950s, the first true heist film, the expertly done 30min robbery with no talking or score. Worth it just for that scene, with so much tension and excellent camerawork/editing. But it's great because you get to know the four characters first: Tony, fresh out of jail (the brains), Jo (the brawn), & his son, Mario (the ditz) & Cesar (the safe-cracker) and the set-up is done well. After the robbery, we learn that crime doesn't pay, as it all spectacularly unravels. Great score, cinematography, acting and plot - not much more you can ask for!",
            "review_date": "2017-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rififi is pretty much a perfect film. The mostly silent centerpiece of the heist is flawless, and you will find yourself holding your breath despite yourself.",
            "review_date": "2017-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This joins the ranks of Brighton Rock as one of the few great noirs made outside America.",
            "review_date": "2017-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truimph of visual storytelling, featuring an unbearably tense (and famously silent) heist scene, even if it doesn't live up to the reputation it has built over the years.",
            "review_date": "2017-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I got a little bored in the beginning, to be honest. But as the movie went on, it got more and more entertaining and in the end, I couldn't sit still!",
            "review_date": "2016-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cool French Noir heist thriller. Great use for an umbrella.",
            "review_date": "2016-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Waited a long time to watch this movie and the wait was worth it! 10/10",
            "review_date": "2016-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I absolutely loved this film as a Gallic-noir crime thriller \u0097 the plot is taught and engaging, the acting is superb, and the script is well-written both when it's menacing, thrilling, funny, and scary. But the misogyny in this film is so blatant \u0097 way beyond even what's expected in films of this era \u0097 that it kind of overshadowed the whole experience for me, and took the film from 5 stars to 3.5 in my estimation. So that's what I'm gonna focus on here.\n\nThere is misogyny, big and small, throughout the film, and there is no female character who is spared. The worst though is when our 'hero', Tony, viciously beats his former lover and sends her back to her new man covered in welts, as a challenge to his 'ownership'. \n\n\"She didn't have to tell him,\" Tony says to his friend, \"it's stamped across her back\" \u0097 her voice in the matter is not even relevant, her body and who has power over it is all that's at issue.\n\nWhat's striking is the way he uses her body as a piece of meat, quite literally \u0097 he brands her just as a farmer would do stolen cattle. But actually less than that, because he sends her back to his enemy. She is just a scrap of paper he scrawls on heedlessly; a note passed between schoolboys organising a fight after class.\n\nThis was the most obvious, but far from the only, example. Other female characters seem to be there only to be insulted, ogled, or slapped around. The way the men in this film treat the women around then made me hate them all so much that *spoiler alert* their tragic ends felt like the only thing redeeming the film by the end.",
            "review_date": "2016-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This smart and gritty French film about a heist does not disappoint.   Jean Servais plays a tough guy who has just gotten out of prison and gets an offer to knock off a high-end jewelry store.   The opening scenes that establish the four thieves are memorable - Tony (Servais) running out of money while playing cards, Jo (Carl Möhner) and his young family, who will figure prominently in the film, Mario (Robert Manuel) getting bathed by his buxom wife (Claude Sylvain), and Cesar (director Jules Dassin), the expert safecracker who falls for Viviane (Magali Noel) as she sings the playful title song in a nightclub.   The club is owned by Grutter, the leader of a gang, and rival for Tony's old girlfriend Mado (Marie Sabouret), and it's these two guys, Grutter and Tony, who will ultimately have to square off.  I have to say the early scene in which Tony tracks Mado down and then forces her to completely strip before beating her with a belt (off-screen) is very disturbing, particularly as we're going to find ourselves rooting for him later in the film.  It does establish him as a heavy though, loyal to the gang but if betrayed, merciless, which is consistent how he acts later.   I can't recall Servais cracking a smile in the entire film, and he plays the role beautifully.\n\nThe robbery itself is shown masterfully by Dassin.  In the planning stages, only a couple of the ways in which the thieves will pull it off are shown, an example of which is figuring out how to use a fire extinguisher to muffle the then state-of-the-art alarm system.   The execution of the crime is highly realistic, and I love how he used minimal dialog and music, so that the actions and facial expressions of the actors tell the story.   If only there were more films today that took a lesson from him!    We also see a flaw that will lead to problems for them, and the film is far from over after the crime - further drama and real tension await, but I won't spoil it.   \n\nIf you're looking for a caper film that among a few others set the blueprint for the genre, this is it.  I found out later Dassin had been blacklisted by Hollywood, and was even happier for the triumph of his fantastic direction here.  The script is taut, there are no wasted scenes, and on top of it all there are great shots outdoors in Paris.   Don't be frightened by the subtitles or by the fact it's black and white and was made in 1955 - it all holds up very well, and is superior to most of the action films of today.",
            "review_date": "2016-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great French film.  Film noir. Definitely seen by many modern directors.",
            "review_date": "2016-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rififi is an entertaining but dated crime thriller. While gritty (and at times misogynistic), the film lacks in noir feeling. Recommended to anyone that enjoys a good heist film, but don't expect Rififi to be of the same caliber as The Wages of Fear.",
            "review_date": "2015-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the best noir ever made, surely among the top five.",
            "review_date": "2015-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hard hitting french crime set in the streets of Paris. A hungry villain just released from prison aiming to reclaim wealth once again. Dassin must be the predecessor for the great Melville, as Rififi provides the beautiful french touch of details. A robbery planned down to the smallest of moves, though when not sticking directly to your plan, your welcoming problems. The dark nature of the crime underground.. come forth.",
            "review_date": "2015-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the heist film that set the blueprint for all heist films made since",
            "review_date": "2015-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very sluggish pace set at the beginning which you can't brush off for quite sometime even though the heist itself is good. There is no music or dialogue during the heist which make a sensory affair but there are many implausible plays the thieves employ and the tension every heist movie needs makes its presence known too late in the film.",
            "review_date": "2015-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's a funny irony in the fact that Rififi was made in Montmartre while American director Jules Dassin, one of Hitchcock's protégés, was on the Hollywood blacklist, as this striking crime-masterpiece has exerted a heavy influence on virtually every Hollywood heist movie since. Dealing with the set-up, execution and fall-out after a diamond-store safe-break in '50s Paris, it may sound conventional, but with a virtuoso near half-hour - the heist itself - playing out with no dialogue or score in near silence, it's anything but. Dassin's noir is an interesting amalgam of the zeal of American films, and the patience of French cinema. It's quiet, clever and wry in a way that 99.9% of American films have never managed to muster. Perhaps it was these dueling influences, but Rififi (French slang for a burly gentleman's show of force) Ushered in an era of elaborately scripted, shiny on the outside/rotten on the inside noirs that, for many, is still the ultimate in hyper stylish gloom.",
            "review_date": "2015-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rififi is a masterful French crime caper with a gorgeous noir style, engaging players and a wordless heist sequence that to this day delivers unparallelled tension and beautiful realism, beating the more glamorous, action heavy set pieces of its Hollywood peers with raw simplicity.",
            "review_date": "2014-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you are serious about heist films or film noir this is an absolute MUST SEE!",
            "review_date": "2014-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nice Noir heist film that is full of suspense and humor.",
            "review_date": "2014-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A cracking French heist flick that has you gripped from beginning to end. The blu-ray version is breath-taking.",
            "review_date": "2013-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rififi is a man just out of prison who, being without the woman he loves and without a dime in his pockets, rounds up his old crime buddies for one last robbery; but what should have been an ordinary job triggers bloody warfare in the crime scene of 1950's Paris. While initially this French film seems to mimick standard American production, it soon becomes clear that Rififi dared more with added grit and violence. In many way, this was the work many robbery films mimicked for a long time. The film also has one of the most intense scenes ever filmed, the silent, gripping and suspenseful execution of the robbery itself, that is nothing short of praiseworthy.It also defied language barriers this film also became a worldwide success.",
            "review_date": "2013-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A stunning film centres on an incredible jewellery thief & his immaculate job in Paris & the consequences that follow.\n\nThe key scene 'the robbery' goes for 22 minutes in detail with no dialogue & music & keeps you breathless. Directed with incredible precision & acted perfectly this is truly a fantastic film.\n\nThe locales of Paris are perfect in this film & it's a great film that keeps you guessing ...a true French Classic.",
            "review_date": "2013-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best heist movie ever? \nQuite possibly yes!\n\nThis belongs on (if not at the top of) a list of movies made before their time. From the painstakingly created low-tech but inventive heist to the brilliantly brutal events that follow, Jules Dassin, created a classic crime drama here that clearly inspired countless writers and directors in the decades since it first appeared.",
            "review_date": "2013-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent film. One of the first heist movies. Every film buff should watch this. The robbery scene is superbly intense.",
            "review_date": "2013-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not very often that I feel compelled to write a review for a film immediately after seeing it for the first time, so that really speaks for how powerful and effective Rififi really is.  After nearly 60 years, Rififi doesn't feel like it's aged a day (other than the fact that security systems are a great deal more complicated now).  The cast here is perfect, led by the incredibly charismatic (and Humphrey Bogart-esque in some way) Jean Servais.   The was my first exposure to the works of Jules Dassin (Best Director winner at the 1955 Cannes Film Festival), and this film really shows just how incredible a director he was.  The actual heist scene that the film is centered around might be the most tense scene ever captured on film.  I found myself literally holding my breath at times.  The use of sound (or lack thereof) during that scene was particularly effective, adding a great deal to the atmosphere and lets the audience know that one wrong move could spell the end for these four men.  Rififi is a film that I feel every fan of films should see at some point during their lives.  It's an excruciatingly tense, perfectly paced crime film, and one I'll be revisiting over and over for the rest of my life.  9.5/10",
            "review_date": "2013-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic heist movie. It's good as a whole, but the 30 minute robbery scene is exquisite. The tension is deliciously smothering.",
            "review_date": "2013-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Four men, three French and one Italian, plot a jewel heist of store within the downtown part of Paris. The leader Tony (Jean Servais), who initially did not want to take part in the scheme, has just been released from prison and took out part of his madness on an ex by beating her after she went off to be with someone else. Before they rob the store, the crew of four meticulously plan the heist by using an alarm that would be associated with the protection of the jewels in the store, which includes analyzing its sensitivity as well as its location to where they would enter the building. As such, they eventually conduct their plan, but the end result is anything but satisfying (even if they had successfully obtained the loot).  During the same era, two other heists film was released from France: \"Touchez Pas au Grisbi\" (1954) and \"Bob the Gambler\" (1955). Neither film comes close to the greatness of this movie, not nearly obtaining the same level of suspense, storyline quality, nor stage presence of the actors that \"Rififi\" unleashes to the viewers. The heist, which is pretty much the mid-point of the movie, spawns an ending hour that is completely unforgettable. For the time released, the deaths depicted within are graphic and shocking. Amazing, superb work!",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfect crime committed in an even more perfect way. Those 25 minutes when the heist stakes place shows how masterful Jules Dassin's direction is. Not even a word is spoken in that particular scene but its impact is very deep.",
            "review_date": "2012-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jules Dassin - the French Orson Welles and the forerunner to Jean-Pierre Melville.  A timeless classic this one.",
            "review_date": "2012-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great black and white photography in this heist movie from the 50's.watch the blu ray and watch the extras 1st.",
            "review_date": "2012-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Upon its original release, film critic and future director FranÃ§ois Truffaut praised the film, stating that \"Out of the worst crime novels I ever read, Jules Dassin has made the best crime film I've ever seen\"",
            "review_date": "2012-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most detailed and thrilling heist movies ever. Great noir atmosphere and remarkably believable performances by the whole cast. The 200-minute stealing sequence is one of the history's finest.",
            "review_date": "2012-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can definitely see the inspiration for Tarantino's Reservoir Dogs, but that aside, this just may be the greatest heist film, ever. A crew is gathered to plan a robbery of a very high end jewelry shop, which leads to easily the most compelling and intense heist sequence I have ever seen (there is NO music and NO dialogue for the entire scene). And all this can be said for only the first half! If you are a fan of Jules Dassin's past work (Brute Force, The Naked City) or not, you are in for a cinematic treat.",
            "review_date": "2012-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic noir heist film from Jules Dassin is clearly the inspiration behind epic movie robberies from the Pink Panther to Ocean's Eleven. The no-dialogue no-music robbery puts them all into the shade, however. And as for the final horror scene as our hero brings the kidnapped child to safety - mortally wounded, leaking blood from his trouser-leg, swerving through Paris in one of those gorgeous curvy Citroens as the impeccably made-up and corseted mother weeps from a balcony... OMG, I dug holes in my own sofa.",
            "review_date": "2012-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another gorgeous looking film from the Criterion collection that I should have just bought instead of renting.\n\nThis noir thriller is as bleak as anything you'd get in the US, but the French really run with the ball on this one and give us a great caper with a recently paroled con trying to pull that one last heist that will allow him to retire, and all the various complications that come along to derail this idea.  \n\nGreat stuff, well worth a look.",
            "review_date": "2012-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Noir + Heist movies I just love them. This is the best, topped 'The Killing' (my earlier favorite).",
            "review_date": "2012-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good caper/heist pic",
            "review_date": "2012-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A cool French film noir about a safe cracking heist.  Theres a 32 min. sequence  during the robbery thats' commited in total silence.  Very cool!",
            "review_date": "2012-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent. Classic French \"crime never pays\" movie full of nasty characters and breathtaking scenes. The fifteen minutes of complete silence really is impressive. Even if it does copy Melville's already written Le Cercle Rouge script.",
            "review_date": "2012-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riveting. An anecdote says it all: Georges Auric, who wrote the excellent music score, asked what he should put on the crucial heist scene; Dassin said he wasn't going to use music. Auric was aghast: he insisted on composing a score, in case Dassin needed one. Dassin screened the heist with and without score, after which the composer approached the director and said to Dassin: \"Get rid of the music.\" Just sayin.",
            "review_date": "2012-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The actual heist is some of the most poetic work you will ever see and is reason enough to watch.",
            "review_date": "2012-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A dark and unsentimental heist film, most memorable for its 26 minute silent robbery sequence.  The suspense is ratcheted up throughout the film, to its expected conclusion.",
            "review_date": "2012-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such an excellent caper.",
            "review_date": "2012-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A descent heist movie that's sadly aged insanely poor.",
            "review_date": "2011-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It drags in parts but that bank robbery scene is mind blowing! I love how Rififi doesn't shy away from the grittier aspects of the story, especially after the heist.",
            "review_date": "2011-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The legendary wordless heist is pretty good. The silence isn't driven by any need within the story for most of its duration, but it's cool nonetheless. The characters are well defined and the story plugs along well until the end with a final segment that doesn't fit the tone of the movie at all and seems stylistically out of place.",
            "review_date": "2011-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest heist films ever made.",
            "review_date": "2011-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "- Watched again, in Blu-ray this time.  This movie might be on my top 10 all-time.  It also might be one of the films I'd take if on a desert island.  It's a crime film, and is just done perfectly.  This film is a MUST watch!\n\n- Just watched this one again, and in my opinion it is the all-time greatest heist film.  There is one stretch in the film during the heist where there isn't a word of dialogue spoken for nearly 30minutes, but you stay totally captivated.  Highly recommended.",
            "review_date": "2011-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An interesting film that has all the elements of a good caper, but unlike Hollywood, no one walks away unscathed.",
            "review_date": "2011-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautifully crafted and a cornerstone to heist films. I may write a full review later...",
            "review_date": "2011-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great French film noir heist thriller.",
            "review_date": "2011-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film noir classic! Tony (Servais) has finally been released from prison, and decides it would be fun if he and his friends pulled one last heist. It all goes well, but like in all heist movies, everybody ends up getting greedy, involving killing and theft. Who will be the last one standing? \"Rififi\" is widely considered THE BEST heist film, as well as being a highlight in the foreign movie genre. I love Italian movies, so I guess I can say I was nervous to see a French one. This film was in my favorite movie guide \"501 Must-See Movies\", and with my trust in the book, I knew this one had to be good. Was I surprised that I loved it? Heck no. Jules Dassin is a director I know is reliable, and this could possibly be his best film. He not only does a great job acting in a leading role, but every moment that he directs is tense and scary. And that 30- minute heist scene in silence? Need I say more? I found a very good reason to see this is Jean Servais' performance. Usually it's pretty hard to tell if a foreign actor is good or not, but every time he even speaks, I feel like I'm in the presence in one of the most evil men who ever lived. Just seeing this one proved that there are actually actors that are just as good as Marcello Mastroianni. Besides the heist scene, he is definitely a reason to watch, he is such a highlight in his work. \"Rififi\" is a must-see. Highly recommended.",
            "review_date": "2011-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Similar in scope to Kubrick's The Killing, Rififi explores how fallible human beings are in the act of drawing up the perfect plan, in this case the robbery of a jewel vault.  Communication is a major theme here, with one of the characters unable to speak French, relying on his Italian friend to communicate to the rest of the group.  Also featuring a dialogue-less robbery scene which is as stunning as its post-war Parisian backdrop, this is gem of a film, which apart from being gripping and edge of the seat stuff, offers profound ruminations about communication, dialogue and, ultimately, the way in which people engage with the world.",
            "review_date": "2011-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rififi is a very loud and boring film. It does not work because it is very easy to look away, but if you do look away, you miss something. For a heist movie it is not very exciting, you can watch it in fast forward and you wont miss anything because there is about a half hour with no dialogue and loud sounds. I honestly had to mute it a couple of times because I could not handle it. Overall it's not as enthralling as it needs to be, and it really starts to drag.",
            "review_date": "2011-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All the reviews I've read about this film all mention how influential it is... and Iâ(TM)ve no doubt that's the case. Its taunt and well crafted and Iâ(TM)m sure many a scene has been plagiarized in other films (the pin drop silence of the heist was lifted in the last movie I saw before this, Le Cercle Rouge, for example)... however that level of mimicry over the years has made this type of film, edgy bank heist, feel formulaic and repetitive. I've never been a fan of this sub genre to begin with so maybe I am biased  but for me I've just seen this too many times in too many variants and regardless of wether this came first I was frankly a little bored.",
            "review_date": "2011-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the original heist movie that's been shamelessly imitated for decades, and to ill effect in comparison to this masterpiece of noire. Contemporary writers, producers, and directors should look back to this film when considering their scripts, set designs, effects, and budgets ... and be both shamed and awed. Paris never looks so beautiful as it does in this film, shrouded in shadow and gloom, and the characters are a sympathetic gamut ranging from the flippantly jocular Mario to the desperate and half-crazed junkie Rémi to the stern Tony, and the black-and-white cinematography is perhaps the very best out of all films shot in the beautiful medium - especially Paris at night and during the jewlry store heist, also known for its thirty-three-minute silence wherein you could hear your own pulse rise with the mounting tension.",
            "review_date": "2011-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ah, the Parisian gangster flick -- so many great ones.  Here, the aging Jean Servais masterminds a (soundless) jewel heist.  His world-weariness is impressive but underneath that tough cynical exterior, he is loyal and even affectionate (except when he beats his girlfriend -- not good).  Generally, I prefer Melville over Dassin (but I won't forget Touchez Pas Au Grisbi by Becker in my list of greats either).",
            "review_date": "2011-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic caper flick, the heist scene especially well done",
            "review_date": "2011-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inspired by L.A. Noire I had to watch this great movie which is one the greatest \"Film Noir\" to come out of France. It's a truly great caper movie. One of the best I've seen. Highly recommended ;-)",
            "review_date": "2011-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After being blacklisted from Hollywood, Dassin came to France to do what he thought he could not. Make a good film out of a extremely crappy book. Well I'm pleased to tell you he did succeed in his endeavor, and on a low budget. This stands out of the heist film crowd (Asphalt Jungle, the Ocean's series, The Killing,) for many reasons, the first and foremost reason is the heist scene itself. For almost thirty minutes the thieves work in silence with no music, dialogue, or effects to interrupt the intensity. With Tony looking out the window every couple of minutes just to increase the tension. Of course like all other heist films, the scenes that follow the heist are just trying to keep everything done before together (some films deal exclusively in this area. See Reservoir Dogs). This part of the film, while interesting, brutal, and suspenseful. Just didn't make my heart almost stop like the heist itself. It was a bit of a let down compared to the mastery of tension shown before by Dassin. The picture would have been a full five stars if the events that followed the heist were condensed. It just felt too long and drawn out. Other than that I would recommend this picture to anyone.",
            "review_date": "2011-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gritty, human, French, crime story set in 1954 Paris. Great final driving scene. Seat belts? We don't need no stinking seat belts.",
            "review_date": "2011-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dynamic and engaging.  Plenty of aspects to be applauded by film makers.",
            "review_date": "2011-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic French film noir remains one of the best and most influential heist movies ever made - most famous for its intense, dialogue- and music-less 32-minute robbery scene. Masterfully and stylishly crafted by director Jules Dassin, with a sharp script and a top-notch cast. A true classic.",
            "review_date": "2011-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Du Rififi Chez les Hommes (1955)\n\nThe director Jules Dassin was one of the communist blacklisted Hollywood stars of the 50s.  He turns around and makes one of the best film noir caper movies ever made.  Yes, even better than the master, Jean Pierre Melville.  Dassin made this classic with a bare bones budget.\n\nThis film is always compared to Huston's \"Asphalt Jungle\", Kubricks, \"The Killing\", and Tarantino's \"Reservoir Dogs\".  But, Rififi is a movie that you must see if you like film noir.  America may have invented film noir, but the French definitely perfected it and made it their own.  There have been talks of a Hollywood remake of this with Al Pacino, but so far, it hasn't come to pass.\n\nTony le Stéphanois (Jean Servais) is down in the dumps having just got out after a five year stint in prison.  His girlfriend, Mado les Grands (Marie Sabouret) is now shacked up with a nightclub owner, Louis le Tatoué (Pierre Grasset), which aggravates him even more.  So, Tony takes up the offer to go in on a jewelry heist with his old pals, Jo le Suedois (Carl Möhner) and Mario Ferrati (Robert Manuel).  \n\nInstead of a penny-anti snatch and grab, Tony suggests going all out and breaking into the Jewelry store's safe.  Mario calls in a fellow Italian safe cracker, Cesar le Milanais (Jules Dassin) to join the team, and together, they plan the perfect heist.  \n\nBut, as we all know; crime doesn't pay!  Ladies-man, Cesar gives a stolen diamond ring to one of Louis's nightclub singers and it gets back to him.  Louis captures Cesar and he tells him the accomplices.  In an underhanded knock at ex-colleague, Edward Dmytryk, in Dassin's movie, Tony shoots Cesar for being a rat.\n\nTony tries to make everything right, but...",
            "review_date": "2011-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There was an expression we used in the 80's to describe something cool.  That expression was: \"Deadly\"  This movie is deadly in more ways than one.",
            "review_date": "2011-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The legendary wordless heist is pretty good - the silence isn't driven by any need within the story for most of its duration but it's cool nonetheless. The characters are well defined and the story plugs along well until the end with a final driving segment that doesn't fit the tone of the movie at all and seems stylistically out of place.",
            "review_date": "2011-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great old French caper film, very similar to an American film \"the Asphalt jungle\". The movie has sub-titles, however the jewel heist itself ,is done in silence. If you like caper films you'll like this great old film!!!",
            "review_date": "2011-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hate calling something the best because I always second guess my labeling but this has to be the best heist film ever made. I can't think of one other than Heat that even comes close. It features a 28 min heist sequence with no dialog and is brilliant, and amazing to watch. From start to finish the film is the perfect blend of gangster flick, film noir, Heist flick, and even kidnapping and betrayal flick. Great film.",
            "review_date": "2011-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This tops The Asphalt Jungle, and I went into this with almost no expectations.  The heist sequence is just as cool as everyone says it is.",
            "review_date": "2011-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nobody does noir like the French.  They invented it, and although American and Japanese directors have made exceptional entries in the genre, the French still do it best.  For evidence, I present exhibit A, Rififi, one of the greatest gangster/heist movies ever made. \r\nAging gangster Tony, just out of prison, gathers his friends for one last job; cracking the safe at Paris's finest jeweler.  It will be the most ambitious job of their careers, with an incredible payoff.  And it doesn't end with the heist either.  When rival gangster Pierre realizes what they've done and decides he wants in, everything they've accomplished is put in jeopardy. \r\nRififi doesn't waste much time establishing the characters or the setup.  Back-story isn't a major concern here.  Each man has his own life and personality, but the important thing is that when it comes to business, Tony, Jo, Mario and Caesar are dead serious.  They know the rules, and the stakes, and are the absolute best at what they do. Their preparations are complex and painstaking.  Casing the joint, memorizing the opening times of the surrounding businesses, finding a way to defeat the alarm system, all are done with the utmost care.\r\nAll of this leads up to one of the tensest scenes in all cinema; the heist itself.  Over half an hour, with no music or dialogue, only the (very quiet) sounds of the men at work.  And what work it is.  Watching these four men chisel their way through the roof, disable the alarm, and crack the safe is like watching Michelangelo sculpt or Arnold Palmer play a round of golf.  It is pure precision, with no margin for even the slightest error.  And what creativity they bring to their trade!  I have never seen such ingenious uses for a tube of caulk or an umbrella.\r\nMost films would have difficulty going this long without sound, but here the silence is an asset.  The lack of sound underscores the fact that their work relies on near-total silence.  Because there is no music or other background noise, we are keenly aware of every clink of the hammer, every rattle of loose concrete, and the fall of every footstep. The silence creates tension more effectively than any ominous music could.  And all the while the clock is, quite literally, ticking.  Time itself is their enemy. \r\nIf Rififi ended with the successful conclusion of their daring burglary, it would be a very good movie.  But it does not satisfy itself with a simple happy ending.  As in so many of the best noirs, the second half tells how the best plans go awry, and everything begins to fall apart.  A minor act of carelessness makes them targets of the most ruthless crime boss in Paris.  The body count rises alarmingly, and the bad guys soon gain what is arguably the ultimate leverage.\r\nThe last act is a masterwork or growing tension, sudden reversals, and hard decisions.  And the final scene, which I will not give away, is probably the best of all.  The pounding, ominous music, the rapid series of cuts, and the gravity of the situation contrast with the innocence of a young child in a way that is simply incredible.  Rififi is fully equal- and perhaps superior to- Chinatown, The Big Heat, or Le Samourai.  If you are a fan of classic noir, I highly urge to see this film.",
            "review_date": "2011-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quelle fatalisme! I could barely believe the ending with all protagonists dying. A very well directed movie which is absorbing and the heist sequence with no dialogue and limited score is brilliant.",
            "review_date": "2010-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest heist films ever made.",
            "review_date": "2010-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great heist movie by Jules Dassin. Everything is more than perfect in the movie except the heist that the protagonist plans. Jean Servais was mind blowing. The heist scenes were damn good. Less dialogues and apt background score. Excellent use of shadows and hence a great Noir.",
            "review_date": "2010-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "15 min. silent burglary, amazing stuff.",
            "review_date": "2010-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly great French crime thriller worthy of all the critical success it's received over the years. An obvious influence on so many films to follow and yet the main heist sequence is set in almost complete silence setting it apart from all it's imitators. A well constructed plot with several scenes that must have been quite risqué for the day.",
            "review_date": "2010-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb film and some incredible performances - lends so much to films in the 60's onwards - the robbery scene is exquisite and beautifully worked, acted and filmed. A great movie and I would reccomend to anyone",
            "review_date": "2010-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest heist films ever made, and for more than just the heist itself (a half-hour long sequence shot with no music and dialogue). An excellent example of how sometimes foreign countries can do film noir just as well as Hollywood.",
            "review_date": "2010-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After watching this, I still have no idea what â\u0080\u009cRififiâ\u0080\u009d is but having seen a hot Italian woman sing about it, Iâ\u0080\u0099m pretty sure I need to find out more.  Sure, this one scene in the movie is about four minutes long and serves as the only time the title of the movie comes into play but it was enough to make a believer out of me.  Itâ\u0080\u0099s been called the ultimate heist movie and that is actually a pretty fair moniker to crown this with being that everyone always goes right into the ultimate scene in this: the 33-minute robbery scene done in almost complete silence.  It really makes you wonder why more crooks didnâ\u0080\u0099t care more after watching this team of bit-time criminals carry off the break of a lifetime (involving a rope ladder, an umbrella, a fire extinguisher and more).  Nonetheless there is no â\u0080\u009cperfect crimeâ\u0080\u009d and it isnâ\u0080\u0099t long before the third act starts up and our team of thieves starts meeting the business end of other people who want what they took.  Dassin makes his players behave in ways that are not uncommon (Iâ\u0080\u0099m not saying Iâ\u0080\u0099ve participated in a two-story break-in but this is at least more realistic than watching someone use a bazooka to blow open a safe vault) and Servais as Tony puts more out through his facial movements and expressions than the rest of the cast in their vocal delivery.  The only negative here is that after the introduction of the players and the grandiosity of the heist, weâ\u0080\u0099re left with a final act that seems to want to wrap this whole picture up fast and in as convenient a way as possible.  Thieves are killed, rival thieves with scores to settle are killed, family members are killed and when the whole thing finally comes to a (literally) screeching halt, you canâ\u0080\u0099t help but feel there had to be a better way to go about all of this.  Yeah, itâ\u0080\u0099s an ending that really does make the most sense given the circumstances but I would have preferred to see it extend itself out a bit longer as opposed to a hyperactive exercise in thinning out the cast for the sake of ending the picture.  But even still, this film has been duplicated time and time again but as far as my knowledge goes (which isnâ\u0080\u0099t too far), it has never been bettered.",
            "review_date": "2010-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Rififi\" is often considered the landmark film that modernized heist movies, and it shines brilliantly as a suave, sexy crime noir (that happens to be French). There are flashes of expressionism throughout - the tantalizing 'Rififi' nightclub song sequence and the shadowy night shots, but the classic quick-slung dialogue and refined criminal setting really give the movie its stride.\n\nOf course, it would be impossible to review this movie without mentioning the heist - a complex suspense sequence that takes up a full 28 minutes of running time and has no audio other than the slightest tap of a hammer or patter of a footstep. You can hear your own heartbeat race as each new step of their setup is revealed, bringing a new fear that it won't work or they may be discovered. Even though they carry the stride of first-class cons (they break into the jewelry store wearing complete suits), the characters express both confidence and doubt in their maneuvers, making every second of the continuity exhilarating. When it is finally over, you breathe a sigh of relief for these guys.\n\nEven though the heist is the pinnacle of the film, it only takes place halfway through. The second half is a moralist plug that chronicles the downfall of the cons after their perfect crime. Though it has some great scenes and completes the circle of development of each of the characters, it feels like the movie blew off most of its steam by the end. Even though the tension has all but left, there is a strange sense of loss seeing all the characters you cheered for in the first half take their inevitable fall. It's a classic tale, but told with complexity and craft that was completely new for its time, and served as a basis for every other heist-crime movie, from \"Reservoir Dogs\" to \"Ocean's Eleven.\"",
            "review_date": "2010-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The grandfather of all heist movies sits atop the mountain quite elegantly.  Justifiably famous heist sequence plays out sans dialogue.  Director Jules Dassin displays a sure hand behind the camera.  Stunningly acted, written, shot, and directed.",
            "review_date": "2010-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie. One of the best films of the 1950's for sure, this super-intelligent, absorbing and complex vintage caper picture is one of, if not the best of its kind- a masterpiece in every right. Jules Dassin was one of the great filmmakers of his era. The burglary scene deserves a spot on the pantheon of the all-time great sequences ever put on film, and the best part is that it is the centerpiece of the film- not the climax.",
            "review_date": "2010-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was my first Dassin film and it is one of the best heist film I have ever seen. I look forward to renting more of Dassin's films.",
            "review_date": "2010-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the few heist films that makes a point and finds completion in making that point.  Painted with stunning detail and gritty realistic performances, Rififi doesn't play that much different from an American heist thriller.  It's not wildly stylistic, it's not confusing, and it tells a direct story with a certain amount of conventionalism.  The un-American qualities are the lack of sensationalism or glorification, a flawed trait common amongst the American heist thrillers.  If you like painstaking suspense (the kind that makes you sweat) I fully recommend this film.  Screenings are available this month and the next at the Jacob Burns Film Center as part of their heist-thriller theme of the month.",
            "review_date": "2010-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent French heist film noir classic.",
            "review_date": "2010-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "French gangsters deal with dangerous nightclub owner while attempting to rob jewelry store. Dassin's comeback after being blacklisted by Hollywood is a good movie, but I still can't help but think that it would have been even better if Melville had made it.",
            "review_date": "2010-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very well crafted thriller, the heist scene in this, which is 30 min without any dialogue is great stuff, all the characters are good, as is the story, reminded me a lot of kubricks the killing",
            "review_date": "2010-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an unlikely French film noir, directed by Hollywood exile, Jules Dassin.   Rififi is known as the inspiration for all \"Heist Movies\" that followed, from Oceans 11 to Cercle Rouge to Inception.\r\n\r\nNo Spoilers:\r\nThe plot is familiar to anyone who has seen more than a handful of movies.  A crew of the greatest burglars, safecrackers and other specialist criminals, is assembled for the \"Big Heist\", which is usually a big enough job that they can all afford to retire.  Of course every heist is going to hit a snag, as this particular one also does, and that's where the intrigue begins.\r\n\r\nDassin uses the familiar elements of film noir to frame this heist story.  The heist itself is easily one of the most famous - and most perfect - scenes ever put on film.  It has been copied so often, both in other films and in real life heists, that it may actually give the viewer deja vu.\r\n\r\nThe acting is pure noir.  The tough guys give each other deadly looks and the women are all femmes fatale.  All the performances are much better in the subtitled French version rather than the badly dubbed English one.\r\n\r\nRififi's only weakness is the Hollywood influenced theme of morality.  It's bad to be a criminal!  Within 5 years, Godard would mock this morality in Breathless.  More recently, like in Tarantino's heist-homage Reservoir Dogs, the question of morality is examined on a much deeper level.  And now Chris Nolan has introduced us to the heist of our own thoughts - just imagine the moral implications of that kind of theft!\r\n\r\nI can safely say this movie would entertain pretty much anybody.  The suspense is masterful, since you just know something has to go wrong, but you don't know what.  Rififi's slightly dated view of right and wrong may seem simplistic by modern standards, but like Inception, the process of the heist itself is more interesting than the motives behind it, and even most of the characters participating in it.",
            "review_date": "2010-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sad story with the moral that criminals are doomed to ill fate...",
            "review_date": "2010-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A stylistic, gorgeously shot, totally badass, and tense noir heist film, featuring probably the most effectively constructed jewel theft scene ever applied to film emulsion.  Rififi does dissolve in the third act as heist turns to kidnapping recovery, and the cause and effect morals of the story play out with the backdrop that this isn't the worlds least sexist film.  Nonetheless, it's an engaging, well written, and edge of your seat one.",
            "review_date": "2010-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stunning early French heist movie.",
            "review_date": "2010-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It took me three viewings to come to the conclusion that this is undeniably a five-star movie. Granted, â\u0080\u009cRififiâ\u0080\u009d (aka â\u0080\u009cDu rififi chez les hommesâ\u0080\u009d) has a reputation of being a masterpiece, but I always find it difficult with older movies to allow my brain to accept that status of overwhelming grandeur a five-star production is supposed to possess. But well, â\u0080\u009cRififiâ\u0080\u009d definitely fits into that category, not only for the famously amazing 30-minute heist scene almost devoid of any dialogue (containing the inevitable unrealistic or even totally impossible elements many a heist scene tends to have and which at the same time contribute to the sheer amusement value of the scene â\u0080\u0093 the heist scene in â\u0080\u009cRififiâ\u0080\u009d must have served as an example for many more such scenes in French gangster films â\u0080\u0093 â\u0080\u009cLe cercle rougeâ\u0080\u009d (1970) and â\u0080\u009cLe casseâ\u0080\u009d (1971) are only two examples that spring to mind right now). â\u0080\u009cRififiâ\u0080\u009d has so many more commendable features than just the abovementioned jewellery theft. Take, for instance, the title song so beautifully performed by Magali NoÃ«l. In a nutshell, it illustrates, in a playful way, the sort of milieu we are faced with in this film: tough gangsters with their women standing on the sideline, in which position they can do little more than accept the risky actions of their men. At the same time, women do play a crucial part in their lives: without them certain scenarios could have been totally different. Thanks to Madoâ\u0080\u0099s intervention, the innocent can be spared and as a result of Vivianeâ\u0080\u0099s (Magali NoÃ«l) mesmerizing effect on Cesar le Milanais (played by the director, Jules Dassin, who is listed in the cast under the name â\u0080\u009cPerlo Vitaâ\u0080\u009d), the film reaches the germ of its turning point. In this respect, Mario Ferratiâ\u0080\u0099s (Robert Manuel) words must be regarded as prophetic: allegedly, there is no safe that can resist Cesar and there are no women Cesar can resist. The heist goes splendidly due to Cesarâ\u0080\u0099s technical knowledge of safes, but his crush on Viviane causes the s*** to hit the fan. The doubtful moral of many criminal milieu movies (the gangster group led by Tony le StÃ©phanois (Jean Servais) is supposed to be morally preferable to that of a creep like Pierre Grutter (Marcel Lupovici), but given the actions of both, one tends to wonder why) is put into perspective by the ending (who survives and who doesnâ\u0080\u0099t?) and the words of Louise le Suedois (Janine Darcey) spoken to (and about) her husband Jo (Carl MÃ¶hner): there were so many poor guys out there who did not turn into crooks, so why did you? A repeated-viewing experience of this movie prompt one to speak volumes of it (watch out for subtle details, like why and when does Grutter allow his younger brother Remi (Robert Hossein) to use drugs), but I had best refrain from that and end by paying the director a compliment about the beautifully filmed final scene (car ride back home with the child) and about â\u0080\u009cRififiâ\u0080\u009d as a whole. This is one of the crown jewels of Franceâ\u0080\u0099s cinematographic history.",
            "review_date": "2010-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's an entire sequence where they rob a jewelry store which has no dialogue at all. That's cinema my friends, that's cinema.",
            "review_date": "2010-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "French heist film involving four thieves each with their own skills and personalities.  The one dude that just got out of jail to save one of the others is reluctant at first, but then suggests instead of simply robbing the store front, to go for the whole ball of wax in what seems to be his last big score.  Interesting ending....well worth a watch",
            "review_date": "2010-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best heist film, only because it was the predecessor to every heist film today. Not to mention the brilliant song 'rififi'. Rififi is just Mesmerizing & fantastic!",
            "review_date": "2010-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The proto-heist movie hundreds of imitators.  A lousy title hides the prototype heist noir peopled by dames (though not many), bad guys and worse guys killing and kidnapping in pursuit of a fortune in jewels.  Little known deceased actor Jean Servais plays the anti-hero who dying of tuberculosis after a five year prison stretch decides to get the gang back together for the jewelry haul of a lifetime.  The movie is widely imitated in using a prolonged, intricate, robbery sequence which I find to be the dullest part of these types of films (e.g., the \"Mission:  Impossible\" or \"Ocean's Eleven\" series).  I'm willing to spot the director the conclusion that the robberies are a miracle of planning without the do-it-yourself step by step instructions.  Servais' gang winds up shooting it out with the \"Grutter\" gang with \"Untouchables\"-level brutality who prove to be the worse set of bad guys because of their willingness to kidnap the child of one of the gang.  The double-crosses elevate the level of suspense and Servais' dour, nothing-to-lose demeanor makes for some very dark passages that never rise above the charcoal grays which dominate the cinematography.  The movie is definitely foreign (the gang comes into the apartment of one of the plotters and watches him being bathed by his wife(?)) but gunplay translates easily in any language.  If you are a fan of modern noir heist remakes like \"The Italian Job\" or \"The Thomas Crown Affair\" or their originals incarnations, this is the predecessor of them all.",
            "review_date": "2010-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest French crime thrillers",
            "review_date": "2010-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No doubt a lot of heist movies borrow from this one.  Love the silence during the heist-great suspense!",
            "review_date": "2010-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If I thought the Asphalt Jungle was my favourite noir was because I hadn't seen Rififi! What a perfect Noir this is. Nail biting, groundbreaking and it has Jean Servais as possible the most charismatic antiheroe in any films of this genre. An absoulte masterpiece.",
            "review_date": "2010-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best heist movie ever. It's a first rate thriller that explores the unintended consequences of the perfect crime.",
            "review_date": "2010-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Se magnifique - the half hour silent heist scene in particular",
            "review_date": "2010-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first third of the movie is a little on the mediocre side but the rest is so brilliant and tense that it makes up for it completely. Because of such a terrible start to a film it does throw it off balance, and towards the end you start to realize that this movie should be over by now.",
            "review_date": "2009-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superior heist film, but why must Dassin end it in such a typical fashion even when not shackled by the US Motion Picture Code?",
            "review_date": "2009-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully shot. Gorgeous noir images everywhere you turn, all different kinds of visuals and they're always really interesting. 55 years later, we've seen every permutation of heists, tough talk, junkies, hookers, double crosses, and criminal decision-making that there is to put on the screen. This had to be one of the first ones to mix all the facades, social climbing, and duels of wits with all the other gritty caper elements. Dozens of movies have followed in these footsteps in the decades since this was made. Very fun to watch.",
            "review_date": "2009-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredibly effective and stylish crime movie.  The best \"heist film\" I've seen, no contest.",
            "review_date": "2009-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a (French) film noir heist thriller....could it really get any better than that? No, not really. Aside from the fact that it was difficult to read the subtitles at times (black and white film with white/gray lettering), this is a top notch film, and I can see why it is regarded as one of the best and most influential heist films. It's also one of the more artful films of its type too, mostly with how it is constructed and executed.\n\nThe plot is pretty standard for this type of film: criminal gets out of jail, gets involved in a lucrative score. All seems perfect, and starts off that way, but thigns fall apart, and all hell breaks loose. Much of this film (either plot or certain elements) has turned up in places such as Heat, Mission: Impossible, and the Ocean's trilogy, among others. Sometimes it is just as homage or reference, other times it seems like theft *cue rimshot*.\n\nThis is just some incredibly thrilling and well done stuff. One sequence that is often mentioned is the film's centerpiece: the heist scene. It is roughly a half hour long, and nearly silent (no talking or music, but some occasional sound). Doing things this way really adds to the atmosphere and builds up the suspense and tension to an almost unbearable level. \n\nThe final portion of the film involves the fallout of the job, and, for its time, some of this must have seemed rather violent and shocking. Nowadays, not so much, but it's still pretty engaging stuff. \n\nA remake of this has been planend for quite some time, and, if it ever gets made, it could be good, but regardless, do yourself a favor and check this one out. It's truly a marvelous and masterful film.",
            "review_date": "2009-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant plotting.  Beautifully shot.  Great noir dialog.  Excellent use of hand tools.",
            "review_date": "2009-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "well, after having lauded kubrick's 'the killing' as one of the best heist-noirs i've seen, here's 'rififi,' which was clearly a heavy influence on 'the killing.' it follows four men as they plot the perfect robbery, and then shows, in a stunning 40 minutes of silence, how they work together in perfect synchronicity to pull it off. the third act shows how one tiny misjudgment unravels the entire affair, with dire consequences. mamet's too-twisty 'heist' is also an homage to this film.",
            "review_date": "2009-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true heist film.  It is more entertaining and well put together than a lot of modern films.",
            "review_date": "2009-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "dark movie depicting the last heist of a band of four bank robbers intent on retiring on an infamous high.. somewhat one dimensional plot with little real characterisation; though enjoyable and at times engaging. french police are either consumate professionals [in most crime dramas the villians are caught by a dogged detective who needs redeeming from some percievedly flawed career] or incompetant because the police walk past the robbers at least 3x during the robbery; and for that matter, dont seem to interested in the theft of 240m francs anyway. some attention to the search for the loot might not have gone amiss",
            "review_date": "2009-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just watched this one again, and in my opinion it is the all-time greatest heist film.  There is on strecth in the film during the heist where there isn't a word of dialogue spoken for nearly 30minutes, but you stay totally captivated.  Highly recommended.",
            "review_date": "2009-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the heist centerpiece of this movie is Filmmaking with a capital F.",
            "review_date": "2009-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "French noir classic and the first great heist film.",
            "review_date": "2009-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is this noir?  not sure, but  has that feel about it - brilliant movie - almost Graham Greene like in its characters especially Jean Servais reminiscent of Richard Attenbouroughs \"Pinkie Brown\" in Brighton Rock - utterly free of consience or remorse - gripping stuff more than driven on by the black and white format that adds menace.",
            "review_date": "2009-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first act kind of drags, but the second act features a spectacular 33-minute dialogue-free heist sequence. The third act again drags a bit at first, but works up to a tense and thrilling end.",
            "review_date": "2009-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best heist films of all time.",
            "review_date": "2009-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film.\n\nThe heist is ingenious and tense, and made more so by the complete absence of words. Apparently it set off a series of copycat robberies.\n\nAnother French film where the \"hero\" beats his woman and she comes backt to help him, what is it with them?",
            "review_date": "2009-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most other heist films have some amount of suspense and intrigue.  You always arrive at that feeling because of the editing, cinematography and use of music . . . \n\n\"RIFIFI\" contains the single most engaging and nerve-wracking 30 minutes I've ever seen. It was the ultimate heist scene, and like no heist sequence you've seen before. Elevated by zero dialog and no music, it captures the stress and lack of patience four men on a crew feel during a robbery.",
            "review_date": "2009-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good French noir heist film and is one of the best I have ever seen. The film was shot on a low budget in Paris locations that were picked by director Dassin as he wandered around Paris unemployed. He was blacklisted in Hollywood and was out of work 4 years.\n\nThe film was shot in the winter. This added effectively to the criminality depicted in the story. The heist story is told at the start of the movie and then you get to watch the characters basically destroy themselves as they pay for their sins.\n\nThe film revolves around a sad looking, ex-con named Tony who dotes on his godson who is later kidnapped by some other criminal types. Tony is very cruel to a former mistress and is definitely capable of committing cold-blooded murder. His character believes in honor even among thieves and his solo acts of vengeance against his godson's kidnappers is what gives this film its punch.\n\nGood noir.",
            "review_date": "2009-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "October 2009 - Another interesting attempt by Dassin to mix the crime and noir genera. I find it weaker than his earlier works and rather than a good mixture of the two genera, it splits the movie in two parts which don't match so well with each other.",
            "review_date": "2009-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rififi is a truly absorbing, brilliantly executed film by French filmmaker Jules Dassin. In it, a group of four thieves plan the perfect heist, but are ultimately betrayed by their passions and impulses. It is a very pessimistic, dark masterpiece.\r\n\r\nJean Servais plays the brooding, lonely main character. He brings the brilliance into the scheme; he's a tortured, experienced criminal who is just out of jail. He is constantly quiet, keeps his motives secret, and conceals with zeal his weak points. Above all, he is the anti hero who redeems himself at the end, if such word as \"redemption\" can apply. He and his French friend, whose son is his godson, and two Italian thieves -one of which is an expert safebox breaker- begin to plan a 20 million Francs robbery at a jewelry store. During the first half of the film, the group is shown in painstaking observation and evaluation of the routine in and an around the store. Finally, the night comes to execute the plan, and this develops into one of the most fascinating, maybe even exquisite, robbery scenes I have ever seen. For many minutes there is hardly a sound, except perhaps that of the rest of the audience in the theater, hearts beating or nervous breathing. It is wonderfully hypnotizing and mortifying, filmed with such precision and style that it immediately produces admiration. I think that to any film lover this will be close to an ecstatic experience.\r\n\r\nTechnical perfection is not the sole, dominant aspect of Rififi. The four main characters are very well outlined and very well acted; Jean Servais is as archtypical a noir leading man as there ever was in American cinema. Together they embody the carelessness of having nothing to lose, the fierceness of wanting to win everything, and the sadness that such emptiness must helplessly imply. There are also the gloomy, atmospheric shots in the streets of Paris to set the mood, and provide background for the twists and turns of the plot. With a clear narrative style, Rififi successfuly incorporates fragmented scenes, composed of angular takes against the sky and roads of Paris, in a way that reminded me very much of later New Wave films.\r\n\r\nIt is not only a thrilling, suspenseful \"action\" film, but Du Rififi Chez les Hommes is also a complex drama and styllistic gem. It has violence, humor, sex, and crimes that do not go unpunished. One of those films that really seem to come full circle and satisfy not only us, but themselves.",
            "review_date": "2009-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "MAN this movie is so awesome.  Completely engrossing.",
            "review_date": "2009-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A near perfect film noir: stylish, tense, brutal, and bad-ass.  Dassin gives us another classic in the history of the genre that tops his previous film noir entries like The Naked City and Night and the City.  Brilliant performances and beautiful black and white cinematography that achieves the true chiaroscuro effect necessary for great noir blend together with Dassin's expert direction to create a film that rivals the best of the genre.  Riffi, which means rough and tumble according to the lounge song in the film, concerns the inability of criminals and convicts to escape from their lives of crime.  Instead, Rififi follows the classic noir plotline of examining the inevitable destruction to which criminal life leads.  But it is also about the forces of fate or evironment or society that drive us to our tragic destinies, the fates we can't escape once we have made our choices, and the tragedy that can occur even when we try to do good.",
            "review_date": "2009-08-06",
            "source": "rt",
            "lang": "en"
        }
    ]
}