{
    "rating": 0.0,
    "release_date": "2001-08-10",
    "num_reviews": 130,
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "Never seen a Bollywood film? then DCH is the best place to start.",
            "content": "DCH is like a breath of fresh air. It shows how bringing youth into an industry is always a good thing. Just compare this film with Yaadein, from Bollywood veteran Subash Ghai.Where as Yaadein is probably one of the worst things to come out of a camera, DCH is one the best. It's just one of those films you'll find hard not to like, basically because it's exactly how the medium of Indian films should be used.Rather than just cut and paste a song into the film, the filmmakers have done very well to make each song feel wanted, visually interesting, and they never drag. The result is a near 3hr film that just flies by. Comedy, Drama, Great Songs, love stories that work, and some truly excellent casting. Everyone carries the film, and the 3 guys, Safi, Akshay and Aamir are too good together!Hopefully this film is a wake up call to the rest of Bollywood, who seem to be obsessed with unoriginality. Technically DCH can easily stand up against anything from the West. Editing, Directing, Cinematography, lighting, set design -- everything just works so well.Sometimes Bollywood can produce some truly great films, and this is most definately one of them!! You must watch it.",
            "review_date": "2001-09-19",
            "lang": "en"
        },
        {
            "review_title": "AAMIR- the best actor in bollywood",
            "content": "Without a doubt this movie is probably the best coming of age flick around, it has terrific acting and an incredibly touching plot that keeps you going throughout the whole film. I think the reason I love this film so much is because, everyone in some way could relate to it. When you're a pre-teen and have a close group of friends and face something so intense together, there's that special bond that no matter how much you loose touch with each other, one day, you just think of them and that one incident. The acting is just phenomenal. All-star cast. All-good film. The story is great - plenty of laughs to be had here, with sad moments, too. The acting is A-Grade",
            "review_date": "2013-11-05",
            "lang": "en"
        },
        {
            "review_title": "the most realistic depiction of Indian youth in Bollywood",
            "content": "After a string of Bollywood stinkers, this film was a breath of fresh air! Upon first glance, it might seem like the story has been rehashed from the plotlines of several other Indian films. But the presentation blew me away! Yes, I agree that Dil Chahta Hai has been heavily influenced by the Hollywood style of filmmaking. But it still retains the same passion and romanticism that has become a Bollywood staple ever since the beginning, thus making DCH a thousand times better than other \"Hollywood-wannabees\".Another thing that you might notice while watching the film is that there is not much of a plot. It just... floats along. But that's what makes it great; you never know where the next scene might lead you. What ties the story together is the bond of friendship shared by the three main leads. All the performances were terrific, especially Aamir Khan, who is probably the most respected actor of his generation.Ultimately, what's great about the film is that it connects to the youth. The depiction of youth is so dead-on and realistic that you would be disgusted at the way youth is treated in other Bollywood films, where every college student aside from the hero/heroine are party-going idiots or jittery nerds! In DCH, however, the people talk like how they're supposed to talk, and nothing seems unrealistic about their personality. While watching the film, it becomes quite evident that Farhan Akhtar belongs to a breed of young, talented directors. What they lack in experience, they make up with an ambitious vision and raw talent.If you haven't seen the film yet, go watch it. You'll be surprised at how much hope is still left in Bollywood.",
            "review_date": "2001-11-24",
            "lang": "en"
        },
        {
            "review_title": "Dil Chata Hai - What the Heart Desires",
            "content": "I am not a fan on Hindi movies at all, but since I decided to study in India, learn a little Hindi and whatever else, I have expanded my Hindi film repertoire from just Lagaan and Amar Prem to include Dil Chata Hai.The story is simple \u0096 at first, and is largely interspersed with a lot of English. Even I could understand the story without any subtitles. (Although you might turn it on for intense moments of extreme speed Hindi) Three spoilt rich best friends grow up, and in doing so, learn that their relationships between themselves, women and their families becomes tense as they mature and travel.\"What the Heart Wants\" is a sort of theme that persists throughout the film. One friend is stuck to a girl he cannot get, another to an older woman, and the last one is just struggling with many girls he cannot choose between. For a Hindi film, the dance-music numbers are not terrible (but of course not great) and the music without the dance is quite nice, with a lot of meaning attached to it. So after a major fallout they realize many things separately, and learn about their own relationship in turn.I recommend this film to anyone as a primer to Bollywood films \u0096 I know I used it as one. High marks for this film since it beat the Bollywood standard of being completely incoherent and inane, although still sticking to the three plus hours.\"Can what the Heart Want be controlled?\" RATING: 9/10",
            "review_date": "2005-09-10",
            "lang": "en"
        },
        {
            "review_title": "Dil Chahta Hai - most appropriate title",
            "content": "This movie was released in the year 2001, the time when bollywood seemed to be in doldrums, producing one trash after another, the same year when another masterpiece \"Lagaan\" was released from bollywood and the year I finished my college and entered my first job and wow what an experience - it was just like a fresh breath of air.The first movie by an unknown young guy Farhan Akhtar (may be known earlier because of his famous parents Javed Akhtar - lyricist in this movie - and Honey Irani) and what a fantastic job he did both in direction and script writing. For me, he did a great job by experimenting with a novel idea, moving away from the well established norms of the bollywood industry and not presenting yet again melodramatic bollywood plot.The story revolves around three friends (supposedy born to very rich parents) - their relationship and their personal lifes - the guys with totally different natures and with their different meaning of life. However, the only thing that keeps them ever together is their never ending friendship.The story is not so great, doesn't convey any specific message but it keeps you glued and is refreshing as many times you watch it. In fact, many of the college going Indian youth (and even from other countries) would be able to relate themselves with the three main movie protagonists.All the actors have given very good performance. Aamir Khan simply reaffirmed his talent. He plays a prankster, who has knack of turning every thing into funny and the one who doesn't believe in the institution of love, but ultimately falls for it. For Saif Ali Khan this movie may even be called his re-birth. He plays a character who falls for every other girl, but is unable to express it when he really starts loving the one. Akhshay Khanna playing a bit mature and serious character may have seemed slightly weaker than the other two, but he played his character very well. This guy has a very different meaning for love and falls for an older woman. Preity Zinta looks amazing (as always) with an all different hair style. Sonali Kulkarni didn't seem so much at ease with the commercial cinema, but then too gave pretty good performance.Music by Shankar-Eshaan-Loy combination was also refreshing and different from all that mushy mushy Hindi film music. The great thing about songs that they didn't break the movie rhythm and seemed more to be part of the movie's story.In all, a must watch movie.",
            "review_date": "2005-11-25",
            "lang": "en"
        },
        {
            "review_title": "Fantastic fun and full of surprises",
            "content": "I stumbled over this film on late night TV and immediately ordered the DVD. It's a corker! Fresh, invigorating, romantic, bizarre even!They don't make films like this in the West - and more's the pity but hence the freshness. The three lead actors are gorgeous - so it hardly matters that they must be the oldest students in town. The cinematography is beautiful - especially in the Australian sequences. The song and dance routines are as welcome as they are surprising.As with all Hindi films, it is pure melodrama of course. The ability to suspend one's disbelief is a necessity. But that aside, it has all the attributes of a good old fashioned Hollywood romance. Boy meets girl, boy loses girl... etc., times three.The core theme of friendship is a delight - as are the subtle homo-erotic overtones of Akash and Sid's relationship. Intended or not, I wouldn't have minded if they'd ended up together - but this is Bollywood remember!All in all, fantastic fun which I plan to watch again and again. Highly recommended.",
            "review_date": "2005-11-27",
            "lang": "en"
        },
        {
            "review_title": "Well worth the time it takes to watch",
            "content": "Indian movies tend to have a reputation for (a) being musicals and (b) having overmodulated, distorted sound tracks, as if everyone was singing and playing through a guitar fuzzbox. Fuzz is fine in its place (heavy metal rock music, for example) but a surfeit of it can readily wear down the listener.Dil Chahta Hai is a welcome breath of fresh air in the genre. It does have musical numbers but they're very pleasant on the ear, as is the sound track in general - modern musical styles, in some cases mixed with more traditional musical instruments (even a didgeridoo, the presence of which is explained below).I have an absolute hatred of musicals so for me to find this movie likable it really has to be something special. The awards it has already won demonstrate that it IS something special.The storyline is a little convoluted (which may explain why it takes 3 hours to run its course - around twice as long as its western counterparts, although Indian audiences may prefer the much longer format) but the acting is excellent throughout and the viewer is kept interested as the multiple interwoven plots twist and turn.This movie demands concentration though, to get the whole picture. There is a good deal of spoken English mixed with Hindi, so the subtitles are a must for those who don't understand Hindi, but the English speech is not often mirrored in the subtitles, so one must both listen carefully and watch carefully in order not to miss a beat.The subtitles themselves are not perfect, using unusual punctuation at times to emphasize a point (a word bracketed by a plus or minus symbol on one side and a two thirds fraction on the other takes a little time to absorb, for example).But these are only minor niggles. This movie is richly textured and provides a visual a feast throughout, especially if, like me, you are not familiar with the sights and sounds of places like Bombay and Goa. A good part of the movie is also set in Sydney, Australia, providing plenty of material to keep the interest going (and hence the presence of the aboriginal instrument noted earlier).This is very much a westernised production, with characters and behaviours that are possibly harder for traditional Indian audiences to identify with; I had no difficulty though with identifying with the three main male characters - three guys who are firm friends and have been for some years, and who may separate but somehow always manage to come back together when circumstances demand it. This kind of theme is pretty universal - the British TV series \"Last of the Summer Wine\" operates along pretty much the same lines, albeit fifty years on.One of the themes is the conflict between traditionalist parents and modernist offspring (in particular the arranged marriage) and the author leaves the audience to make up their own mind about which is \"right\", but maybe with a slight nudge in the direction of the traditionalists.The only gripe I have is with the choice of the anglicised title \"Do Your Thing\" for the US market. I think that totally misses the point of the movie. From the subtitles, Dil Chahta Hai translates as \"The heart wants...\", which would be more accurately and pertinently translated as \"What The Heart Wants...\".In other words, the storyline is more about following your heart in love than it is about leading a self-indulgent life (which, obviously, these characters do most of the time - courtesy of being very well off and generally able to please themselves what they do; not quite the little rich kids, but verging on it).This movie is that rare beast, a guy flick that is also a chick flick. Guys will enjoy watching it for the macho moments, girls will enjoy it for the soulful scenes (and the fact that the women generally behave with more maturity than the guys) and the weepy bits.All in all a very enjoyable, watchable movie. If this is a new direction for the so-called Bollywood cinema, then it is very welcome and I would like to see more of the same.As a professional writer I'd even be interested in contributing to that new direction...",
            "review_date": "2004-10-23",
            "lang": "en"
        },
        {
            "review_title": "Bollywood 2.0",
            "content": "Less is more in Farhan Akhtar's 'Dil Chahta Hai'. Strip away melodramatic plots which always drag on longer than they are supposed to. Get rid of unbelievable protagonists who have all the answers and can fight off a horde of villains. Have no 'villains' to speak of, with the exception of the dude engaged to the girl you fancy, who acts like a bit of a prick.Build a story about the people you spend most of the time with - your friends, your dawgs, your posse, and ponder how you guys are going to sort out the really important things in your life. Like falling in love. Cracking on your friend who seems to fall for every girl he sees. Or your sensitive friend Sid who is in love with a much older woman - is he crazy? Wince as two of your best friends get into a very heated argument which splits them up and wonder what you will do now that you're caught in the middle. Hope for love and friendship to find a way through to reconciliation.Make a smart movie, without elaborate dance pieces set to a sweet soundtrack that remains in the top 10 a year after the film's release. In fact have a song that parodies the 'running around trees' segment that every other Hindi film since the 1950s has had and that the guys at school used to kid about. I mean, guys don't express their love for girls that way! Keep out guns, drugs, politics, strife, and family melodrama. Lace up your script with generous doses of humor which brings to light the hereunto underused Saif Ali Khan. Finally make sure the 'heroes' have shown some growth at the end of it. Of course it's been done to death in LA. That it could have been done so well in Mumbai is the astonishing thing.Finally, make reality cool again. Whatever your heroes wear, however they cut their hair, right down to the way they interact has to be believable. Make short hair and a goatee beard the national craze amongst guys. Put some real thought into color coding and matching outfits and give a laid-back style to the proceedings.Welcome \"Dil Chahta Hai\". The film that has had the largest influence of the look and hopefully the story of the biggest Bollywood films to follow it. A film that many people have been able to relate to. It seemed so obvious until Farhan Akhtar did it. Now watch how his ideas permeate through Bollywood.Here's looking forward to \"Don\" in 2006.",
            "review_date": "2005-08-01",
            "lang": "en"
        },
        {
            "review_title": "Beginning of a new generation of Bollywood films",
            "content": "Before getting into the details, I must admit that this is certainly one of the best and most entertaining films I have ever seen!RATING: ****1/2 out of *****Plot ---- The story is about three very good friends and their relationships with each other. Aamir Khan plays a sociable and mischievous Akash, Saif Ali Khan plays a confused, often 'love-struck' Sameer and Akshaye Khanna plays a mature, confident Siddharth or Sid. Preity Zinta plays Shalini - Akash's love interest, though throughout the film Akash claims that he does not believe in love. Sonali Kulkarni plays Pooja with whom Sameer finally (really) falls in love and Dimple Kapadia is Tara Jaiswal, a divorced middle-aged alcholic. Thats all one needs to know about the film because right from the first reel the viewer is absorbed into the story and learns about each character.Review ------ Full credit must go to the director Farhan Akhtar who has broken many of the Bollywood production norms in order to make a technically perfect and enjoyable film. It would be unfair to call Aamir Khan the life of the DCH though his popularity in India and abroad would have drawn a substantial part of the film's audience. He gives a brilliant performance as usual as Akash. His scenes with Akshaye Khanna and some scenes shot in Australia (Opera, phone call to Sid, etc) are mind-blowing! SAif Ali Khan is the surprise packet of Dil Chahta Hai and there is a lot of untapped talent in him especially where comedy roles are concerned. But I felt that the best performance came from Akshaye Khanna who plays the character of Sid to perfection. His mannerisms, thinking, behaviour is very authentic and makes us all identify with his character closely. Preity Zinta looks gorgeous and is her usual chirpy self. Sonali Kulkarni could have certainly looked better without all that makeup. Dimple Kapadia shows how a good role can bring out an elegant performance from a seasoned actress.The best aspect of Dil Chahta Hai other than the actors' performances was the music. This is hopefully the start of more non-run of the mill compositions in Bollywood. Ofcourse, I hope for a lot more compositions like these from the music directors Shankar-Eshaan-Loy. The title song was the best and gels really well with this trndy film. Other good songs are 'Jaane Kyon', 'Kaise HAi yeh Rut' and 'Tanhayee'. 'Woh ladki hai  kahan' - a parody of old Hindi songs is simply hillarious. The lyrics provided by the director's father, veteran Javed Akhtar are simply amazing and complement the story of the film to perfection!Overall, a very entertaining feature and I hope to see more films like these in the near future. Three cheers to Farhan Akhtar and his team!!!",
            "review_date": "2001-08-29",
            "lang": "en"
        },
        {
            "review_title": "A very fine and realistic depiction of modern urban India and its youth",
            "content": "Farhan Akhtar's Dil Chahta Hai is a true example of cutting-edge cinema. It is a groundbreaking film in that it realistically portrays the life of Indian upper-class youth and shows the urban and modern India in the most precise way through the story of three close friends and their experiences. The characters are real and very easy to relate to, the dialogues are simple and genuine, the proceedings are dramatic yet realistic, and the film is extremely interesting and entertaining. The film is emotional, but it never goes over-the-top. Farhan Akhtar makes an impressive directorial debut. His excellent direction is aided by extraordinary music, brilliant cinematography, effective editing, fantastic city locations and some very impressive performances by the ensemble cast. The camaraderie between the three friends looks most real and believable. I can't recall any other Indian film I've seen before or after Dil Chahta Hai which portrayed true friendship as well as this one.Aamir Khan, though initially seems to be miscast in the role of the completely cynical womaniser Akash, demonstrates a very fine versatility in this role and successfully shows the gradual growth in his character with depth and humour. Saif Ali Khan, in his best performance up until that point, is just brilliant as the insecure and very kindhearted Sameer. He displays confusion and fear with great conviction and a fantastic pinch of comedy. Akshaye Khanna is outstanding in this wonderful dramatic role of a serious and sensitive guy who falls for a woman much ahead of his age. Preity Zinta is marvelous as Shalini and skillfully sensitises her character. She plays the part with grace and restraint, and her inner feelings are perfectly understood thanks to her expressive eyes. Dimple Kapadia adds another accomplished performance to her vast repertoire. Sonali Kulkarni's real talent is unfortunately wasted, though she does try to do the best of what she is given.Overall, Dil Chahta Hai is a remarkable picture about life, and it should provide a great deal of quality entertainment to each and every viewer, whoever and wherever he is. A great film which is according to me the best Hindi film of 2001.",
            "review_date": "2009-08-30",
            "lang": "en"
        },
        {
            "review_title": "An Excellent movie with real life situations!!!",
            "content": "Dil Chahta Hai Starring: Aamir Khan, Saif Ali Khan, Akshaye Khanna, Preity Zinta, Sonali Kulkarni, Dimple Kapadia and Ayub Khan Director: Farhan Akhtar Music: Shankar-Eshan-Loy Released. Debutant director Farhan Akhtar's (son of Javed Akhtar and Honey Irani) Dil Chahta Hai is the story of three friends and their respective thinking of love. It has a new, trendy and youthful look, completely different from the standards norms of the Bollywood film.Akash (Aamir Khan), Sameer (Saif Ali Khan) and Siddharth aka Sid (Akshaye Khanna), three close friends, have completed their education and are on the threshold of life. Akash does not believe in love. He is a flirt and his love affairs do not last for more than a month. Sameer believes in love. He is always carrying his heart on his palm and falling in love every time. But he still has not found that special girl. Sid, a painter, is the most sensitive and mature among the three. He knows the true meaning of love. He finds love in everything, everywhere and everytime.All three are enjoying life. Then comes the twist when Sid falls in love with older woman Tara Jaiswal (Dimple Kapadia), an interior designer, who is a divorcee. Akash is not able to understand the depth of Sid's love and hurts his sentiments for which Sid slaps Akash, thus creating a rfit between the two friends. Sameer tries to bridge the gap but is unsuccessful.\nSid leaves for a painting workshop at Kaushali. Akash leaves for Australia for his dad's business. On the flight, he meets Shalini (Preity Zinta), who he had briefly known earlier. Their friendship slowly blossoms into love. Meanwhile Sameer also finds his special girl in Pooja (Sonali Kulkarni), whom he wants to marry. Time has passed. All three friends are again in the same town -- but things are different for them now.Full marks to director Farhan Akhtar for giving a completely new and fresh look to the film in his debut film. The storyline is different from the run-of-the-mill fares which we are used to seeing for such a long time. Farhan is a welcomed entry in the list of talented and young directors. He has also dared to be different. He has taken care of the minutest details in the film. Technically, the film is no way behind some of the best Hollywood movies.Now the performances -- all the three leads are fabulous. They all fit their roles to a T. Aamir Khan as expected is the best. He is too good in the comic scenes and is excellent in the emotional scenes also -- especially in the scene when he breaks down on the phone while talking to his father. He definitely is the best among the current lot who does his work with precision and utmost dedication. Saif Ali Khan is a wonderful surprise in this film. This is his career-best role and one cannot imagine anyone else playing Sameer's role. His sense of timing and facial expressions are very natural and makes Sameer a very adorable character in the film.The least significant role was of Sameer but Saif made it very important. Now comes the final winner -- Akshaye Khanna. An actor-par excellence and very natural in front of the camera, Akshaye has played the role of Sid to perfection. His emotions and expressive face say a lot. He has given a spell-binding performance. Preity looks great in her new look and has acted well. Sonali Kulkarni is wasted and Dimple Kapadia still looks gorgeous and plays her role well.Music and the picturisation of the songs flow with the mood of the film. The locales of Sydney and Goa have been brilliantly shot. The first half of the film has some of the light good moments. The second half is filled with emotion though the Aamir-Preity affair has been stretched a lot thus making the film a bit lengthy. But one thing is sure -- Bollywood has got one more talented director in Farhan Akhtar.",
            "review_date": "2001-08-25",
            "lang": "en"
        },
        {
            "review_title": "A lovely episode of three lives",
            "content": "Just pitifully, we have lots and lots Hindi speaking people in town and they have been here for a very long time, still the local Chinese don't really care to know their culture, let alone watch good Indian movies.  Perhaps there are more viewers in Tibet, Yunnan of China.There are tons of \"come of age\" movies and this is a wonderful one, it's like a fresh air enters into a stuffy room when I was watching it.  Unlike the Hollywood or Euro films, the difficulties that the three young men encounter are not presented in a realistic and sometimes brutal way but highly musical and artistic way.  Besides the stunning length, this is another feature of Indian movies.The boys are from middle class families, obviously, or even higher society. They have time and money to go to Goa to spend their holiday, go to chic places to spend their past time, have nothing to worry.  Just like any well-to-do Asian families, (I mean those in Singapore, Hong Kong, Taiwan, Korea, Japan....) the old man of the family would send their children to their own overseas company to receive \"wilderness training\" so that later they can take over the family business.  Akash just cannot escape this and stays in Sydney.Once again, the songs, the dances, the plot and the script are all marvellously put together.  Who is able to resist pretty and young faces, right?  Who wants to see the real McCoy of the true India?  Movie is always a dream.   Let's continue itBollywood is ushering itself into the world stage but it is still not a strong counterpart to Hollywood.  There are many good Indian people people behind the scene of many big movies, directors, editors, script writers.... Yet, I am just wondering it would take how many years for the mainstream (like Hollywood) center to \"digest\" Indians after taking in Chinese like Jacky Chan, Jet Li, Chow Yun-fat, Tony Leung.  Through Hollywood, the Indians actors would be more widely known because it is a place to rocket people's name over one night.The 1994 Miss World Aishwarya Rai caused a frenzy in Cannes in 2002.  I hope some male \"Khan\" would do so somewhere in Oscar or Cannes again because they do deserve it.",
            "review_date": "2003-12-05",
            "lang": "en"
        },
        {
            "review_title": "One good story (that was not developed properly), one bad story and one no story",
            "content": "The Akshaye Khanna/Dimple Kapadia story was fresh, as far as I can see. I do not remember a hero falling in love with an older woman in Bollywood. (The Assamese movie, Brishti, handled this issue way back in 1974; but that was an 'Art' movie.) If properly developed, it could have been a nice 90 minute movie, based on this segment alone.However, it was ruined by the million-times recycled Amir Khan story, not to mention the non-story of Saif Ali Khan. There is absolutely nothing new about the Amir Khan segment; no, actually the Opera was new! That segment is absurd; in real life that does not happen. And if it does, it is as rare as the life-style led by our heroes, at least in real life of real people in real India.",
            "review_date": "2010-08-07",
            "lang": "en"
        },
        {
            "review_title": "Childhood friends...",
            "content": "\"Dil Chahta Hai\" is a comedy - drama movie in which we watch three childhood friends who they just finished college and nothing can be between them. Although everything is going to change when they fall in love and become very different people because of the way they approach their relationships. These situations will make things difficult for all of them and they will change their friendship too.I liked this movie because it combines very well comedy with drama and from this combination we can see and observe the true meaning of love either is erotic or is between friends. I also liked this movie because it shows us how things change when people fall in love, how their personalities change and how this influence them. Once more Aamir Khan's interpretation played as Akash Malhotra was very good but equally food were the interpretations of Saif Ali Khan's who played as Sameer and Akshaye Khanna's who played as Siddharth Sinha.Finally I have to say that \"Dil Chahta Hai\" is a very good movie to watch and if you like movies that show the influence of love into relationships and what are the results of this then this is your movie. I also believe that this movie makes us understand many things about it and wants to shows us how we have to behave in difficult situations that maybe will come up in our lives.",
            "review_date": "2015-03-21",
            "lang": "en"
        },
        {
            "review_title": "Western-style modern Bollywood",
            "content": "Siddharth \"Sid\" Sinha is nervously waiting at the hospital for his love with a sick liver. The movie returns back to the days when Sid was best friends with Akash Malhotra and Sameer Mulchandani. This is a story of the labyrinth of their love lives ending with them growing apart in the present day.The characters party. They fall in love. They live modern lives. I don't want to sound ignorant but this is a very Western modern Bollywood movie. I do notice the high IMDb rating but I wonder if this broke some cultural barrier back in India. I don't know anything about that but I'm going to try to review this like any other Western movie.There is some bro acting going on here. I would prefer the opening first act to be only about the three friends by themselves. They need to establish their friendship as the opener. Their chemistry is the most important aspect of the movie. It's more important than the romances. They need to show that they're the drive-to-the-airport friends and even bury-a-dead-body friends. They need to open by explaining their friendship. Sometimes, movies do this by showing their first meetings. I don't feel that connection has been established.This is a long three hour movie. There is the regular Bollywood song-and-dance. It's still long even without the songs. I like the guys. They seem like really nice fun guys. The movie kinda works by hanging out with them. It's no masterpiece by any means.",
            "review_date": "2015-10-27",
            "lang": "en"
        },
        {
            "review_title": "3-hour soap opera",
            "content": "Three friends face the challenges of love, something which brings turmoil to their friendship and their relationship with their relatives.Stereotypical characters uttering pompous lines, contrived plot lines that rarely intermingle, all seen before in better movies, or even worse, your favourite soap operas. The movie aims to please exactly those audiences, low-educated peeps looking for light entertainment. Nothing wrong with that really - everyone should be entitled to a little entertainment, however limited the expectations. And yes, there are people out there who believe this movie is a cinematic masterpiece. Why not? This movie serves a very specific purpose, and for that alone, it should be respected. If you're looking for an intelligent movie, steer away. If you're looking for a long soap opera sprinkled with elaborate dance numbers, bingo, you found it.",
            "review_date": "2016-11-16",
            "lang": "en"
        },
        {
            "review_title": "you gotta see this movie!",
            "content": "Dil Chahta Hai, one word: excellent. If you've never seen a Bollywood film before, this is the best place you could start.Akash (Aamir), Siddharth or Sid (Akshaye), and Sameer (Saif) are best friends. They are all different; Akash is very critical and a prankster, he believes that love doesn't last more than a couple of weeks. Sid is the most serious and mature of the three, he is a little shy and often disappears in his own world of painting. Sameer, is desperately romantic and \"falls in love\" a lot. Often this ends in heartbreak...Nevertheless, despite their differences, the trio have something in common: their love for each other. Soon, the three find their own lives dragging them forward, forced to leave the others behind, and they realize the value and seriousness of life. They discover many things along the way, like true love, and true friendship. When their lives collide again, their individual worlds are shaken up once more, leaving them with the support they really need: each other.Aamir gives a very fun-filled, suave performance, he is comical and the audience will always love him, its brilliant. Saif Ali Khan does an awesome job, it's comedy, but it's a very strong performance too. Akshaye Khanna, gets full credit for the best performance in this movie. Not only did he get the best role, but he played it to perfection, the fight scene with Akash, was brilliant. I give him my full applause. The pretty Preity Zinta, also gives a noteworthy performance. Her cute smile and charming personality light up the screen and makes the movie refreshing. Sonali Kulkarni gives a gritty performance. She is forgettable, but she does play the role well. Dimple Kapadia plays the depressed alcoholic mom easily. Ayub Khan, Rajat Kapoor, and Suhasini Mulay give small, but important roles.The music is amazing. Certainly the best part about the film. Farhan Akhtar has done a fantastic job.I'd say 8 out of 10 stars...WATCH IT!",
            "review_date": "2007-02-14",
            "lang": "en"
        },
        {
            "review_title": "\"May we never have to be without our friends...\"",
            "content": "At present I've watched over a dozen Bollywood films, all recommended via the IMDb 'Top 250' lists over the past decade or so, and two things seem to stand out. Virtually all of them run an average of two and a half hours or more, and almost all of them feature Aamir Khan in a leading role. So I pretty much expected that with \"Dil Chatha Hai\", and on that score I wasn't surprised. Khan himself is part of a buddy trio that appears aimless during their young adulthood, living the good life with not much thought for the future. Each in their own way is confronted with the stirring pangs of love, and how they react to those feelings provides some resentment among the men, causing them to go their separate ways.The subject of arranged marriages is also broached, similar to the way it was handled in the film \"Swades\", with the modern day view of marrying for love taking precedence against a tradition of marrying to further business or extended family relationships. As typical with Hindi films, there are a fair number of musical interludes featuring song and dance led by the principal players, each in turn long enough to allow a wardrobe change as it plays out, which occurs quite vibrantly during the 'Love Brings Color Into Your Life' number. As a three part love story, the film manages to appeal to both men and women, and in a way, approaches it's goal of fulfilling the message of the movie's title, loosely translated as 'What the Heart Wants'.",
            "review_date": "2018-03-26",
            "lang": "en"
        },
        {
            "review_title": "A New Style of Hindi Movies",
            "content": "When I heard the fuss about this movie, all I could imagine was nothing except that typical melodramatic Bollywood's theme. And they say this is a good movie indeed. I must admit that they are right. But, surprisingly this movie (even has that common Bollywood theme) is bring a new sensibilities in Bollywood cinema. It's performs more natural style depending the others typical flick such K3G or Kahona Pyar Hai.... Compares with this one, those movie is nothing except trash. This is a serious drama, with realistic plot and fantastic sound track (worth for that MTV Asia Award). In short, this is really a good modern Hindi movies, and I highly recommended this to watch.8/10",
            "review_date": "2002-04-12",
            "lang": "en"
        },
        {
            "review_title": "Another classic",
            "content": "I started watching the IMDb top 250 a couple of years ago after I finished the AFI top 100 list of everything they had. One of the most pleasant surprises was my introduction to films from India. I don't believe they know how to make a bad film. This is another 10/10. I get so wrapped up in this movie. The lack of understanding the language is never felt. The actors do such a great job you may not understand the words but you feel the emotion and it seems like you are right there. I laughed out loud and cried like a small child. What a great story with great actors. Aamir Khan is one of my new favorite actors. The man has skills and talent that many others can't even come close to touching. The music fits. We make fun of it over here in America but once I opened up my eyes and saw how well it helps to tell the story. Man we Americans can be so judgmental. I believe it is because no American studio can pull it off so they make fun of it out of jealousy. Aamir Khan provides another unbelievable performance. If he doesn't have a president for his fan club sign me up to do it. The man can flat out act.",
            "review_date": "2015-02-21",
            "lang": "en"
        },
        {
            "review_title": "a roller-coaster of a movie excellence",
            "content": "Ain't any run of the mill movie that keep on coming out every other Fridays.. Its a milestone, an epic of a movie which keeps you entertained even after more than 10 years of its first getting released... A cult classic, the concept & execution of which was unheard of in our film history.. Writing anything about it can never explain the greatness & artistic work, one got to see it.. I still laugh,cry & marvel at the cinematic excellence put by the débutante director .. Pepped up with one of the greatest compositions by the trio of Shankar ehsaan & loy ,so beautifully penned down by javed saab... A story about three best friends & their respective takes on life.. It winds up through their fun college days & takes us through the turmoils one faces as far as that great feeling called love is encountered.. Mind you it ain't just another romantic flick but thanks to the crisp editing & direction ,every emotion in the book is dolled out in equal proportions..though one may feel that best portrayed was one between the lead pairs... Its the camaraderie & the emotional quotient that the trio have in between them ,sharing everything & inspite of differences coming between them, coming together & reconciling.. The goa part is very aesthetically captured .. Getting some not so known actors together & giving them the roles of their lives is an uphill task & the director has so very rightfully succeeded in doing just that.. Roles that changed life for many.. All three have been able to carve out a niche for themselves , Akshay in his serious thinking man character gives a very good praiseworthy & restrained act.. Saif as a happy carefree ,a not so smart guy gives a decent performance but the star of the show is undoubtedly amir Khan who even amongst so many characters has given a spellbinding performance.. Had it not been his other outing as the patriotic hero the same year, he would have got the best actor for his meaty role... He has lived his character virtually , what with his histrionics, antics, goofups, confidence , friendship & his chemistry with the lead actress, one tends to love him.. Watch him utter his lines or proposing his girl in someone else marriage, he indeed is the captain of the ship, a link by which all are connected... Not to forget the perfect casting & works of other actors.. Preity in her subdued role torn between her allegiance to her proxy parents & her love of life gives a controlled performance & looks so adoring in those curly hair.. Even the music lost out that year , but that does not mean it ain't good.. It was & still looks n feels fresh & ruled the charts .. Especial mention should be made of extremely heart rendering composition with soulful wordings by Javed saab & sung by none other but the versatile Sonu who gives the song such melancholic feel & effectively captures the mood of the movie... Sir, I really feel privileged & grateful to you for giving us such a fine piece of work.. What I wish is more of such movies from your hands... ..",
            "review_date": "2013-11-24",
            "lang": "en"
        },
        {
            "review_title": "Awfully Pretentious",
            "content": "This is my first review on IMDb, and I am doing this just because this pathetic movie does not at all deserve the status it has been accorded. I was almost sure this movie would be fawned over by so-called Indian cinema fans, so I wanted to do my bit to pull this movie from its exalted state. 8.6? That's utterly ridiculous.I was amazed and bowled over by \"Lagaan\", and was expecting more fireworks on such lines from Aamir Khan. And then I got this. I can go and on, but I will just say this - this is a movie for snobs, for the newly rich and the \"affluenza\" class, because only they can relate to the movie's atrocious premise and contrived situations. Not ordinary middle-class people like me,Loud, Annoying, Pretentious. Ultimately Crap.They should make an app that lets you throw rotten tomatoes to express your revulsion. And I will be more than happy to lob more than one at that wannabe director Farhan Akhtar's mug.",
            "review_date": "2014-03-26",
            "lang": "en"
        },
        {
            "review_title": "Thought-Provoking and Artistic.",
            "content": "This was the second Bollywood film I saw, and it remains at the top. It is a very basic storyline, but with amazing depth. It is the story of three friends, just graduated from college. Akash does not believe in love, and seems to facy himself a player. Throughout the film, you can almost see through him... he is afraid of being hurt. Sameer wants nothing more than to love and be loved. However, he is just as foolish as Akash, as he throws himself at all the wrong girls. Siddharth is the shy one, who seems to comprehend the complexity of love. When he falls for an older woman, he brings a new aspect to the story: love is selfless and asks nothing in return. Throughout this movie, you see these three stories develop, causing the audience to wonder, 'What is love?' It has been hailed as a hip movie with modern clothes and hairstyles. While this is true, it is also a highly artistic movie that never misses a beat or an opportunity for depth. An actor once said that an actor should be a person who holds a mirror, so the audience can see themselves. I hardly think it possible to watch this movie without seeing a little bit of Akash's cynicism, Sameer's naivete, and Siddharth's willingness to fight for love in ourselves. This is a must-see not only for Bollywood fans, but for hopeless romantics and cynics alike. This one will make you think.",
            "review_date": "2006-09-06",
            "lang": "en"
        },
        {
            "review_title": "breath of fresh air to Indian cinema",
            "content": "when I first saw this movie,I was 11 and today it gives me immense pleasure to write a review on this.the movie marks the entry of one among bollywood giants FARHAN AKHTHAR as a director.the screenplay of this movie is so beautiful that one seldom feels bored,after watching this over 100 times.the movie has taken the film making to next level and this one was certainly a wake up call for all directors of bollywood. friendship is that special thing without which one cannot survive.the movie signifies the value of true friendship and full credits to all the characters for making movie much more effective!!there is no item song,action sequence,vulgar dialogues,and any such nowadays film strategy..the narration of friendship of two generations makes the movie stand apart..!the film bagged a national award.after watching this movie one truly craves for such friendship which is hard to find...the humor in this movie is an added flavour.I wonder how many books farhan would have referred to make such a good movie which is not possible for even younger generation directors...thank you farhan akhthar....i feel blessed to see movies like this..!",
            "review_date": "2013-12-12",
            "lang": "en"
        },
        {
            "review_title": "great movie",
            "content": "Dil Chahta Hai was an amazing movie for me when I first saw it...and it's still one of my favorites. It deals with the youth in India, the transitions they go through, their love lives and most of all, friendship. Farhan Akhtar is brilliant, and this will always be one of his master pieces, no matter how many movies he makes in the future. The movie starts with the present, with Dimple Kapadia being admitted in the hospital, and then a flashback sets in. Farhan Akhtar has created the characters of the three main protagonists with a lot attention to detail and thus, has created characters that the youth in India can relate to. The protagonists are not extra-ordinary heroes, nor are they spoilt brats. They are just normal young Indians with new ideas raised in affluent families. They have the right blend of traditions and modernity. The movie consists of a strong plot, good characters who are believable and yet, interesting. The songs of the movie are excellent too. The picturizations and script is great. Overall, a well done movie with good acting from all the main actors - Aamir Khan, Saif Ali Khan, Akshaye Khanna, Preity Zinta, Sonali Kulkarni and the ever beautiful Dimple Kapadia. A must watch for anyone.",
            "review_date": "2005-02-26",
            "lang": "en"
        },
        {
            "review_title": "another Indian orgasm",
            "content": "This movie is so charming and beautiful I could be speaking hours about it. As always in Barcelon, Spain, we were looking for hours in Pakistan supermarkets until we found a spectacular pirate copy in widescreen and glorious sound.Indians are decidedly devoted not to show their movies in Spain as they premiere us to buy this movies in pirate copies and don't giving us the rights for distribution here. The Pakistan people can't understand why we prefer the copies in widescreen! The music is astonishing and the only problem with the movie is that it has only two real musical numbers.As always, all the actors are superb but specially mention to Akshaye Khanna, who is not a superstar but his acting in this movie is spellbound. Also the girl who makes the \"mature\" girl who drunks makes a great job.This movie attacks completely to your heart!",
            "review_date": "2006-05-13",
            "lang": "en"
        },
        {
            "review_title": "Disgustingly Overrated Movie",
            "content": "Three inseparable childhood friends are just out of college. Nothing comes between them - until they each fall in love, and their wildly different approaches to relationships creates tension.Dear Aamir Khan, everything you touch does not turn to gold. Exactly how your films have appeared on the IMDb Top 250 is beyond me. At this point, I think seven of your titles have made the list, and how can this be? Is the acting and signing of Khan superior to the directing of Hitchcock or Kubrick? I do not think so.All I can determine is that there must be some sort of \"Indian pride\" that makes the people of India go on IMDb and rate this a 10 in order to cancel out all the rational votes from everyone else.",
            "review_date": "2015-07-06",
            "lang": "en"
        },
        {
            "review_title": "Absolutely Fabulous!",
            "content": "I first saw this film 5 years ago as a University student when it originally came out. I still remember how impressed I was afterward. I told my sister who was with me at the time, \"I think that is the BEST Bollywood film I have seen so far\". I recently saw this film again, and I remembered again why I loved it SO much the first time. This movie is a credit to Farhan Akhtar who has since directed the spectacular movie \"Lakshya\".He is a true talent to contend with in Bollywood,and certain more experienced directors, can take a leaf off his book. \"Dil Chata Hain\" works on SO many levels. It's an attempt at telling a mature story. NOT the same old plot exhausted to death, and no \"over blown\" Bhangra numbers either! The movie was content and script driven. It explores the many faces of love, and the changes that occur in friendships as people mature and move on with life. But what it shows also is that true friendship can overcome many an adversity, misunderstanding, and even time.The first movie about \"Male-bonding\" to come out of Bollywood!So beautifully told, this story captures the lives and loves of Akash, Sameer and Sidhart (Sid). Played brilliantly by Aamir Khan, Saif Ali Khan, and Akshay Khanna.They are supported by Dimple Kapadia, Preity Zinta & Sonali Kulkarni. All the main actors give their best in this movie, and I cannot say one thing negative about any of their performances. (Except maybe that Sonali didn't have enough to do). The movie also includes a few characters that have only a few scenes to play but they play them well, and they ALL add value to the story. This movie was the turning point in Saif's career. Since DCH, he has gone from strength to strength, and his versatility as an actor has finally been recognized. As for Aamir Khan... what can I say? His performances are always stellar,as he is a \"thinking\" actor who gives his all to a character he plays.I have yet to see a \"bad performance\" given by Aamir. He never does things by half. Akshay is great and he too has always given fine performances in all his movies to date! Preity and Dimple play the next most prominent characters in the movie. Preity gave a very controlled performance, and Dimple was superb. She gave this movie that extra bit of \"Oommf\". I also love the way the story did not portray a clichéd relationship between an older women, and younger man, and how they kept both the characters dignity in tact. The Akash-Shalini love story was touching too,as these are two people who never intended to fall in love with each other,but did.Akash,who does not believe in love, and Shalini, who is engaged to her surrogate parent's son.The scene in which her father tells Akash, \"please look after her, as she is my daughter\" was very emotional.But the best part was that it was not \"over-dramatized\".The emotions of the moment created it's own drama. All in all, this was a \"coming of age\" story.In the end, we see the three characters two years later, in the same place in Goa where they spend that last summer of youth together.At this point though,they have come full circle, and have moved on from \"boys to men\".We feel their maturity come through as they sit their talking,even though non of them say anything profound. In conclusion,all I can say is PLEASE make more intelligent and enlightening movies like this one!Farhan,very well done indeed!All the best!",
            "review_date": "2006-09-02",
            "lang": "en"
        },
        {
            "review_title": "Wonderful!",
            "content": "Dil Chahta Hai is the story of three best-friends, so close that they could be brothers and how love and life changes them on the last summer they spend together before they go about their adult lives. These three friends are played by Aamir Khan, Saif Ali Khan, and Akshaye Khanna! Those names are Stellar enough Yaar?! But add the combination of Dimple Kapadia who plays an older woman whom Khanna's character falls for, and the delightful Preity Zinta (whom Khan's character almost misses out on) and you've got such a brilliant film that definitely deserves a chapter in the book of Bollywood great films! Add to that the exotic locales, the great sceneries, the hot and happening music, song and dance numbers and you just can't go wrong with Dil Chahtai Hai!",
            "review_date": "2006-03-13",
            "lang": "en"
        },
        {
            "review_title": "The classiness and realism are truly over-hyped!",
            "content": "True. DCH released in the new millennium was refreshing change from the melodramatic movies of the 90s - characters are real life-like and their relationships and dialogues identifiable, especially by the younger generation of the time. The array of suave stars and popular songs that are situationally placed, add to this allure. The direction is deft and the script is tightly paced. What's not to like?While I enjoyed all of the above and the breeziness - as the movie ended I was struck by a sense of disappointment, that for a cult classic hailed as a turning point in urban cinema, something was missing and unabashedly gone unnoticed.For one, the whole obsession with marriage. The movie centers around the coming of age of 3 friends (played by Aamir, Saif, Akshaye) - fresh out of college. The Aamir and Saif characters have no achievement monies or passions and the only growing up is that in the 1-2 years spanned by the movie they go from chasing all and sundry girls to finding a wife!Akshaye's understated romance with the older woman, and his sensitiveness, especially when he vouches that not all deep relationships in life can be given a name, form the most refreshing part of the movie. Yet here too, the director falters and badly. While the older woman is perceptive enough to give a deeper meaning to his paintings, the way she handles the situation on discovering his feelings for her is inane and disappointing. Add to this how quickly after her death Akshaye finds a perfect girlfriend and plummeting of this refreshing track into triteness is complete!The classiness and realism are truly over-hyped!",
            "review_date": "2020-07-20",
            "lang": "en"
        },
        {
            "review_title": "An excellent movie that portrays the youth",
            "content": "This is one of the first Bollywood movies I saw, and I loved it. This film perfectly portrays the youth and shows their lives really well. A lot of the scenarios shown are relatable and have happened to many people in real life. Everything about this movie is great, starting with Farhan Akhtar's direction. He did majority of the writing and screenplay for this movie, and he did great. He also directed it very well. What a way to debut as a director. Second, the performances. Everyone did great. Saif Ali Khan and Akshaye Khanna did great and fit their roles nicely; Saif did great as the helpless flirt and he gave a good natural performance. This performance revived his career. Akshaye Khanna played the quiet Sidd very well, he handled emotions well and his performance was also very good. Preity Zinta also impressed. But it was Aamir Khan who stole the show. He portrayed Akash very well, to the point where you could not even imagine that it was originally Akshaye Khanna who was supposed to do that role. Aamir became the character himself. He showed everything from perfect comic timing to excellent emotional display. Another thing I really liked was the entire cast's chemistry. It made everything look so real and natural. You really thought that Akash, Sameer and Sidd were real friends. The music is also great, with classic songs like \"Jaane Kyon\" and \"Who Ladki Hain Kahaan\". The story was gripping and nice, even with some small clichés. It was also however extremely relatable and enjoyable. Im sure many, especially the youth would really love this great new age film.",
            "review_date": "2015-03-13",
            "lang": "en"
        },
        {
            "review_title": "Three times the angst and three times the usual numbers of fools in love.",
            "content": "A typical Bollywood romance involves a man and a woman who are in love but there, of course, are obstacles in their way that must be overcome by the end of the film. \"Dil Chahta Hai\" is different because instead of the usual couple there are three couples--and the obstacles seem larger than ever--so large that it drives three close friends apart.When the movie begins, Siddhartha (Akshaye Khanna) is at the hospital. His love, Tara, is dying and Sid hopes that his two old friends join him. Then, the film jumps back to the past--when the three guys had just graduated from school and were looking forward to their lives.Sid's relationship with Tara is first in the film. He's an artist and is hopelessly in love with her but Tara is damaged goods. She's lost her daughter to her ex-husband and while she blames him for this, it's clear she's an alcoholic. Sid's falling for her is NOT healthy and this leads to a falling out with his friends-- particularly Akash.Sameer (Saif Ali Khan) is a complete failure at love--so much so that his friends joke about this. However, this lovable loser falls even harder in love with a woman his parents are trying to arrange a marriage with--and he foolishly says he didn't want it before he met this beautiful lady. She hears him say this and feels free to marry a man she's already in love with...so what is Sameer to do?As for Akash (Aamir Khan), he's a cynic about love. He gets girls all the time but it means nothing to him. So why is it so important that he be with Shalini--particularly when Shalini has a very jealous fiancé already?!How these stories all work together is very nice--even if the audience already knows that somehow it will all work out....well, at least for Akash and Sameer. We already know that Sid is screwed! Overall, this is much better than the typical Indian romance-- particularly the wonderful portion where Akash pledges his heart to Shalini (it will make your heart melt--so be sure to have some Kleenex nearby!). Well worth seeing and a much more complex love story than usual!",
            "review_date": "2015-11-04",
            "lang": "en"
        },
        {
            "review_title": "3 dreadfully boring hours",
            "content": "This drama has very mild drama, which is easily the biggest problem. The cinematography is very cookie cutter. The background music has way too little variation, and it hits too on-the-nose trying to get the viewer to pay attention to the \"important\" scenes, even though they're never that important since the drama is so mild. Plus there's 30 minutes of Bollywood musicals that don't move the plot at all. It's also easy to tell that this is one of Aamir Khan's early films because his movements are so forced that he looks like a bird or a robot. Overall, this movie ranges from bad to bland, and you're better off skipping it.",
            "review_date": "2019-10-15",
            "lang": "en"
        },
        {
            "review_title": "An extremely unpopular movie, but somehow popular on Imdb",
            "content": "So what does a typical friendship film look like? There are three(mostly), two of them have a fight ,never talked for years, meet each other after a long time and after an adventurous outing, become friends again. This is what happens in a film film, always, be it Kai Po Che or ZNMGD or any other. But Dil Chahta Hai has one thing which other didn't have, Aamir Khan. Indians rate it 10/10 before watching and that's how it's one of the most voted Indian film on Imdb.Usually, every Indian films contains one love story, this one has three. And all of them have a problem. So first they unite ,then each of them completes his love story. And we have to watch this boring film just because it has Aamir Khan.Dil Chahta Hai is an extremely unpopular film. A common moviegoer might have never heard about it. I too, came to know about this one only after joining IMDb. But the IMDb world is different from the real world. And I am happy that this movie is not very popular, off course, in real world.",
            "review_date": "2020-05-11",
            "lang": "en"
        },
        {
            "review_title": "A 3 hour film that is worth every second of your time.",
            "content": "How often do you see a three-hour film and no get bored? This is one of those films. It explores the relationship between three friends and how life takes them into different directions.This is a must watch for all. The film is shot beautifully and has wonderful songs.The film was released in 2001 and I watched it in 2016 and I loved it. That's how great the film is. This is a timeless classic, one that is not to be missed. One of those evergreen films that you can watch again and again. Watch it and you won't be sorry.",
            "review_date": "2016-05-27",
            "lang": "en"
        },
        {
            "review_title": "The actors- especially Aamir Khan; the screenplay- very comedic, but serious in nature; the cinematography- I wanted to visit Goa; and the music all made this movie a wonderful viewing experience.",
            "content": "My university held an Indian Film Festival this past spring. My friends and I decided to be adventurous and try a Bollywood film. I could to say my initially low expectations were the main reason i left very satisfied, but that wouldn't be giving this movie credit. For the first time in a few months, I left this movie theatre feeling I had been entertained. I now consider this movie one of my favorite foreign films. As a testament to its greatness, I was able to show this movie to an entire suite of twenty-something American guys and they absolutely loved it. They found the club dance scene hilarious and were taken with the friendship and camaraderie that the three main characters shared. I would highly recommend this movie to anyone looking for a superior comedy, a heartfelt story of friends or a glimpse of some of Bollywood's better exports.",
            "review_date": "2004-05-05",
            "lang": "en"
        },
        {
            "review_title": "Facade of Friendship",
            "content": "This movie is fallen flat behind the pre tense of being a friendship related movie, i understand the time period matters a lot in it's success. One must also remember the reason for it to exist, only to entertain audience. However once you start with the movie you realise there is no depth to the story. It felt like a coming of age but murdered that plot even before it started. Story is a lot centralised aver Amir Khan. Unrealistic Scenarios. Overall i would not recommend this movie to anyone from this decade, even in the name of a classic.",
            "review_date": "2021-05-25",
            "lang": "en"
        },
        {
            "review_title": "Surprisingly fun, well-done Bollywood film",
            "content": "This was a huge hit in India, seen as an important step towards hipper, less cliché Bollywood film-making, that combined the strength of western films (more low key and subtle story and acting, better technical values) with the Indian use of musical numbers, big themes and epic running times. The story is about 3 young men graduating from university, their friendship, and how each deals with love and women. There's plenty to criticize. That 3 hour running time for one thing (a cultural difference – that's a common length in India). Casting actors who are clearly in their mid-30s to play kids just graduating from college. A score that sounds like a Giorgio Moroder cast off from the 1980s, and 'happy' montages that look like something Richard Lester would have done in the early 1960s. So why did I like it so much? Maybe it just caught me at the right moment... it's just pretty damn infectious; the few musical numbers feel slyly integrated (fantasies, performing in a night club) and cleverly staged, instead of just stuck on. The songs are good, with catchy melodies and clever wordplay. While the actors are too old they're charming and natural in their roles. A lot of clever, funny lines manage to translate across cultures, and while the dramatic side could be attacked as hackneyed, and a more than a little paternalistic, I still found myself caught up. In short, I found myself enjoying this way more than I 'should' have, and maybe on re-seeing it I'll downgrade it. But the bottom line was, I had a fun, involved 3 hours I was glad to spend with this film. I smiled a lot. I cared about what happened and how things turned out, and I was charmed, not turned off by the seeming anachronisms.",
            "review_date": "2010-11-21",
            "lang": "en"
        },
        {
            "review_title": "One of my favorite movies!",
            "content": "This was possibly the first Hindi movie where the young generation of India was so realistically depicted and because of that I can relate to this very much as a young man. Three friends with three different personalities ... incredibly funny at times! ... yet it also has some very sad moments which genuinely touches the heart! I love this movie very much. I can watch it a hundred times and never get bored. All the characters were great! Aamir Khan, Akshay Khanna, Saif Ali Khan, Preity Zinta, Dimple Kapadia, Sonali Kulkarni ... each one of them had unique roles. As a huge fan of Aamir Khan, I can't help but be biased in saying that this certainly was one of Aamir Khan's finest performances ... and to me personally, I think this was his best performance after Lagaan! I also became a fan of Dimple Kapadia after watching this movie. Her role in this movie and her performance was simply amazing!",
            "review_date": "2006-06-05",
            "lang": "en"
        },
        {
            "review_title": "Old wine in new jazzified bottle",
            "content": "A word to those who feel this movie is a \"revolution\" of sorts. Wake up and smell the coffee, or alternately go and watch Lagaan(that can be called a different film).Gimme a break. Its only a \"good looking\" movie:lots of goodlooking people, great colours,great clothes,snazzy visuals.True it does have its moments: light hearted camaraderie and male bonding. The music is good too. But thats it. Ultimately it strays towards the usual love story where the bad guys lose and our hero wins the woman. The older woman-young man romance is shown but, come on, who are we kidding. She gets conveniently bumped off in the end.The comedy sometimes is too deliberate and artificial and that gets on your nerves.Apart from that,it has the same boring happy ending. 3 friends bond-comedy happens, seperate, fall in love, reunite. There, thats the story in one line for you...yawn.",
            "review_date": "2001-10-04",
            "lang": "en"
        },
        {
            "review_title": "Yuppie India - a different picture of Indian Life",
            "content": "This is not the India of poverty stricken millions which we are accustomed to seeing. This is upscale affluent yuppie India where the characters live in spacious luxury, chatting on their cell phones and doing the Indian equivelant of drinking coffee at Starbucks. The romantic comedy was a throwback to the Rock Hudson/Doris Day era.  All the men were handsome, all the girls were drop dead gorgeous, everyone wore stylish clothes, everyone was rich and lived in a lovely home.I was somewhat daunted by the length of the film, especially as I was watching it at night.  Either Indian directors don't have a cutting machine or they never saw a take they could not use.  Whichever, the film could have done with some cutting, especially of the musical numbers which seemed out of place and slowed the action even more. For me the only musical scenes which worked were the scene at the opera and the Busby Berkley style number featuring a tap dancing Sameer.The only other fault I found was that the male characters seemed somewhat older than one would expect for bride hunting, especially as they lived at home with their parents.  It may be different in India, and I don't know the age at which young men marry, but maybe that was the point, that they had left it a bit late and were afraid of missing out.",
            "review_date": "2003-06-14",
            "lang": "en"
        },
        {
            "review_title": "The best friendship film and a trendsetter",
            "content": "Friendship films have been done to death in Bwood From DOSTANA(1980), YAARANA(1981) being one of the bestDIL CHAHTA HAI changed the friendship trend and the film shwoed friends in a more realistic urban wayThe film starts off in a nice way, the scenes between the friends are a big highlight, and can be watched 2000 timesThe interval spat too is brilliant The second half gets a bit slow and the stories go on different tracks showing each person's love story but there are several brilliant scenes The finale is excellent and one of the most brilliant scenesDirection by Farhan Akhtar is brilliant, he was a whif of fresh air Music is very goodAamir Khan is a natural and unbeatable as the young Akash he overflows with energy and his comic scenes and also dramatic scenes are a delight Saif too excels in his part and this film was a turning point for him and he kept playing a similar role again n again Akshaye Khanna too got a turning point and he is brilliant as the mature Siddharth,his interval scene is fabulous and also his emotional scenes throughout Hope he does such films now Amongst heroines Preity is good, Dimple is adequate while Sonali Kulkarni is good too Ayub Khan is okay Rajat Kapoor is likable rest are all good",
            "review_date": "2010-01-11",
            "lang": "en"
        },
        {
            "review_title": "Arguably the best Hindi movie of all time",
            "content": "The only movie which touches all aspects of real life so closely, you forget you are watching a movie. Therez a Sameer, Sid or Akaash in all of us. Some even have a little bit of Subooth and Rohit in them. Its a story about three friends and their journey into the real life and how it affects their life and their friendship. Akash is the \"Know it all\" kindda guy who doesn't believe in love or steady relationships. Then there is Sameer (Sam) who believes that there is no get-to-know stage between a \"hi\" and \"i love you\". Thats the reason all his relationships fail and since he is so sure that all of them were \"true love\", it affects him adversely every time. And then there is Sid, the intellectual one, who knows what love is but doesn't know what it can do to you. I think its the best Hindi movie ever made. Its an instant 10 out of 10 for me.",
            "review_date": "2005-01-28",
            "lang": "en"
        },
        {
            "review_title": "Cute and Fresh",
            "content": "I happened upon this movie on the Turner Classic Movies station, of all places. The plot is not terribly original but it was fun, fresh, and held my attention the entire time.  It focuses on the value of friendships and not being afraid to claim love when it's right there in your face.  You come away from the movie with a nice, delightful feeling of time well spent.",
            "review_date": "2003-06-13",
            "lang": "en"
        },
        {
            "review_title": "The heart wants...",
            "content": "..to watch this movie over and over again!! You can watch it 50 times and u won't get bored so i totally recommend this movie to anyone. It's very versatile, it has funny scenes as well as more serious ones, so that DIl CHAHTA HAI makes you laugh on the one hand and on the other hand you'll start to think about ur life. In my opinion love is a minor point in this movie, the main thing it deals with is friendship... In a way which is completely comprehensible... not like other movies , e.g. \"Dosti\" , where its totally exaggerated which makes the audience not try to identify with the main characters cause it seems to be so unrealistic. In DIL CHAHTA HAI this is not the case, you're gonna have fun watching Aamir Khan, Saif Ali Khan and Akshaye Khanna when they try to get their beloveds ... and you're gonna laugh! So, absolutely 10 outta 10 !",
            "review_date": "2006-03-11",
            "lang": "en"
        },
        {
            "review_title": "Worst movie ever",
            "content": "The movie is way tooo boring. Total wastage of 3 hr.",
            "review_date": "2020-08-21",
            "lang": "en"
        },
        {
            "review_title": "Possibly the most 2000s soup opera alike romance movie.",
            "content": "The title of this review may make it sound bad, but it's th best at what it tries to be. This film feels so 2000s - camera work, colour palette, song choice, music, storyline, script. Everything feel like from 2000s soup opera, but the only difference is that this is a movie and not tv-series. It's is not slow and it is not overlong or stretched out in any way unlike all soup opera tv-series. It does nkt have any filler, it just tells the story which is usually for the whole 100+ episodes, but here it fits just in 3 hours. Anyway, this film is about love and friendship and does that while cliche, but in an extremely charming and nostalgic way, that I absolutely loved it.",
            "review_date": "2021-01-19",
            "lang": "en"
        },
        {
            "review_title": "best travel movie",
            "content": "I watched this movie when i was just 7 year old. that time i don't understand this movie. when i grow up I watch this movie again then i realize this this is the bet movie . this movie contain all thing what audience what in movie love, friendship, drama,joking all.I can't tell you how great is this movie. story: is about three friends how there life changes by time and there ego problems . acting: amir's khan is the main focus point is this movie. all actor work done very good. said, pretty, snail . movies ending is also nice nice good ending . you can enjoy this movie again and again with friends . my last verdict about this movies is why this movie not get occur award . i give this movie 9 stars . this movie is must watch Bollywood movies",
            "review_date": "2015-07-07",
            "lang": "en"
        },
        {
            "review_title": "Chill out besties!!",
            "content": "Dil Chahta Hai review :Who could expect a film about three besties just chilling out together in Goa could achieve such cult status!! Farhan Akhtar's directorial debut - Dil Chahta Hai - was not just fresh in its approach but also gave the urban youth a movie to celebrate forever. It also ushered in a new sound through some awesome compositions by trio Shankar Ehsaan Loy. 'Jaane Kyun' is still popular in Australia as 'Johny Q'!!Aamir, Saif and Akshaye played the besties and each one of them has a distinct character of their own. More importantly, no one is a sidekick here as all three get equal importance in the screenplay. Right till the first half. Aamir is a richie rich brat who doesn't take life or love seriously. Saif is a hopeless emotional fool ever ready to fall for a girl while Akshaye is the brooding youngster too mature for his age which makes him fall for the much older Dimple Kapadia.The best moments of the film come in its first hour with all the mazaak masti. Saif's \"Christine\" episode is a laugh riot. Akshaye's sensitive conversation with Dimple is another memorable scene. The second half is dedicated to Aamir discovering love in Australia with his college acquaintance Preity Zinta. To be honest, that part could've been edited a bit. In a later interview, Farhan admitted that he had two scripts - one involving the buddies and other was Aamirs love angle - which he merged together as one Dil Chahta Hai.Coming straight after playing Bhuvan the villager in Lagaan (2001), Aamir's transformation in to the uber cool youngster indicated his terrific range as an actor. Saif benefited tremendously from the film playing his career best act ( I prefer this to his much celebrated Omkara (2006) also). You can say this film made his career. Akshaye was good as always. Of the heroines, Dimple overshadowed the other two ladies with her charming and dignified presence.I saw Dil Chahta Hai on first Saturday with my group of friends at then newly opened Cinemax at Kandivali. As we exited the theatre, we started planning a Goa trip. Pronto!!Regards,\nSumeet Nadkarni.",
            "review_date": "2021-08-06",
            "lang": "en"
        },
        {
            "review_title": "Dil Chahta Hai: Indeed!",
            "content": "Why can't there be more Bollywood films like this? Real people, real issues, technically competent, but undoubtedly genuine Bollywood, with songs and all (some standard situations too), but never insulting the intelligence or using cheap tricks? More, please!",
            "review_date": "2003-02-02",
            "lang": "en"
        },
        {
            "review_title": "Fresh and Original",
            "content": "I saw Dil Chahta Hai on August 10(opening night) at a theatre in Diamond Bar which is about 20 miles north of here.The pull for me,obviously, was Aamir Khan, in my view the best actor India has produced since Dilip Kumar. I was also attracted by 27-year old Farhan Akhtar who is making his directorial debut with this film and his father Javed Akhtar(currently the best lyricist in Bollywood after the demise of the all-time greatest lyricist Majrooh Sultanpuri) who has again come up with great lyrics in this film so soon after his recent triumph in Lagaan( I was already playing the songs from the movie in my car on the way to Diamond Bar).Well, I found the movie very refreshing and original. I felt engaged throughout, though the level of involvement was not as intense as in Lagaan.But why am I comparing this movie with Lagaan?Just because Aamir Khan and Javed Akhtar are a part of it, some comparison is inevitable. Lagaan is a many-splendored,multi-layered classic while Dil Chahta Hai is an enjoyable, hugely entertaining movie.Both are very very different from each other.And Akash of Dil Chahta Hai is very different from Bhuvan of Lagaan.Nobody can believe that both characters are played by one and the same Aamir. And therein lies the beauty of the film. The film, of course, works on many other levels but this is undoubtedly its most compelling element. With his new look and with this performance Aamir has added many years to his career at the top. In fact with this hit film he has joined the legendary Dilip Kumar and the great Amitabh Bachchan who also had two back to back hits in the same year. Dilip Kumar with Mughal-E-Azam and Kohinoor(for which he got the Best Actor award) in 1960 and Amitabh Bachchan with Deewar(He got the Best Actor award) and Sholay in 1975.And now Aamir with Lagaan and Dil Chahta Hai in this extraordinary year 2001.It's a great high for someone who loves movies, music, poetry and the arts. My only regret is that Farhan did not give the title of the movie in the credit titles also in Urdu ,the language that makes these great movies possible in the first place.",
            "review_date": "2001-08-28",
            "lang": "en"
        },
        {
            "review_title": "Movie Review Profits",
            "content": "Play Dil Chahta Hai! It is fast and easy to view! A good way to spend your time. Be the best!",
            "review_date": "2019-08-09",
            "lang": "en"
        },
        {
            "review_title": "Aamir Khan's Bollywood Renaissance",
            "content": "Unlike a million Bollywood flicks before d 2000s,Dil Chahta Hai has a story that can not only be found in movie but is equally likely to b found in the society of today.This movie changes Bollywood trends by appealing ONLY N ONLY to the youth of urban society,n even then it is a commercial n critical hit.Its this movie that sparks off Aamir Khan's trend of providing commercial hits to Bollywood,that also have us thinking about our own lives,relations and make us want to c that movie more than once.In all our friends we will always find someone akin to Aakash,Sidhharth n Sameer.N at the end of the day,10 years from now,we may all wonder how everyone of our friends is.N what makes this movie click,is the narrative style.This movie relates to youth as told by a 25year old,rather than someone with white hair on his temples...Truly a modern classic of Bollywood!!!",
            "review_date": "2013-07-17",
            "lang": "en"
        },
        {
            "review_title": "OUTSTANDING MOVIE",
            "content": "In my opinion one of the best movies ever made by the Hindi film industry. Everything about the movie was excellent",
            "review_date": "2020-04-22",
            "lang": "en"
        },
        {
            "review_title": "Worth",
            "content": "An old movie but makes me nostalgic whenever i come across and cant stop myself watching it again. This movie was a trendsetter in certain ways like Aamir's lower lip beard, crowd fast forward and the still of person as paused and photo shoots in a close cabinet. Moreover, even if the story was old, still it was equally refreshing and rejuvnating. And ofcourse actors acting and story flow was upto the mark.",
            "review_date": "2020-05-04",
            "lang": "en"
        },
        {
            "review_title": "Revolutionary",
            "content": "Every once in a while in the history of cinema, it happens that a young film aficionado sets out to actually make a film. He makes his first movie with good feelings, with no great ambition or pretentiousness of any sort, and yet with a great deal of care and intelligence. The actors, cinematographer, editor and all the other film people, believing in the young man's enthusiasm, themselves pour their best into the film. And then some kind of magic happens. The film turns out to be revolutionary; it defines a generation, both of filmmakers as well as avid film watchers. Such movies virtually spawn a new era of films....an age begins, and another one ends.DCH is just such a film; with this, Farhan Akhtar soared into unchartered territory and then somehow never made anything even remotely close. Anyway, that aside, this film came to my mind because I just saw Kontroll a few days back, as some of you know. Kontroll is another such revolutionary film, also by an immensely talented first-time director, the Hungarian-born Nimrod Antal.This film's technical standards stunned me when I had first seen it long ago. For a Bollywood film, it set the bar so high that even subsequent films never came close. Take Ravi K. Chandran's cinematography : in a word, unbelievable. The shots inside the discotheque are unlike anything I've ever seen, even in the most eye-boggling of American/European music videos.The same goes for the performances, the script, the music, the editing, the mise-en-scene....I could go on and on. Having lately revisited this, I still cannot believe that an Indian filmmaker managed to do this. This film is like a good dream, the kind where you know that its a dream, and you don't want to wake up.",
            "review_date": "2009-10-18",
            "lang": "en"
        },
        {
            "review_title": "A movie for Indians",
            "content": "This movie might have been a milestone for Bollywood, but definitely not for the rest of the world.If you, like me, is not used to Bollywood movies, this one will probably bore you to death before reaching 1/3 of the unnecessary 3h long final cut. If it had 1 hour I could probably have rated it 4.Weak, childish story, very predictable and badly acted. There are many unnecessary musical acts during the movie that make you feel second-hand embarrassment.Saying that this movie is overrated is an understatement.I'll never watch an Indian movie of this genre again.",
            "review_date": "2013-12-15",
            "lang": "en"
        },
        {
            "review_title": "Extremely Overrated",
            "content": "I don't know why there's so much hype about this movie. Super boring movie stretched for 3 long hours.Looks Nothing close to what the IMDb ratings say.",
            "review_date": "2022-05-14",
            "lang": "en"
        },
        {
            "review_title": "Dil Chahta is a redefining movie for all ages..",
            "content": "DIL CHAHTA HAI (2001) REVISITED\n.\n.\n📜 Plot: Three inseparable childhood friends are just out of college. Nothing comes between them - until they each fall in love, and their wildly different approaches to relationships creates mutual differences.\n.\n.\n👨‍⚖️ Review : Some movies impact us on levels of understanding of life in general. We consider aa good art as it when it confronts a viewer it changes their lives in a different course altogether. Dil Chahta Hai surely is one such example. It redefined our society , the culture of living the life rather than existing, giving goals to youngsters of importance of friendship, love and character.Its today August 10th, 2001 , 19 years to this release and still its fresh in the minds and helps us rejuvenate everytime you see it again. It was a game changer in the art of storytelling in Indian cinema, suddenly making Goa Plans with friends became common, and people started to view friendship from a different perspective.Aamir, Saif and Akshay took us into their world of urban culture , and highlighted the universal differences which occurs in relationships, frienships in life. All were exceptional in their roles and reason of which it won National Award for Best Feature Film.This Farhan Akhtar debut in Bollywood proved his mettle in writing and filmmaking and the movie went on to acquire a cult status due to above-mentioned reasons.\n.\n.\n.\n👍Goods :\n1. Redefined Storytelling\n2. All Performances\n3. Direction\n.\n.\n👎 Bads :\n1. A Longer Runtime\n.\n.\n🔥 Final Rating : 8.5/10\n.\n.\n✅ Verdict : Go and watch this movie if you haven't yet as you have missed the cherry while savouring the cake.\n.\n.\nFollow in Instagram for More : @RiteshReviews",
            "review_date": "2020-08-10",
            "lang": "en"
        },
        {
            "review_title": "Style over substance",
            "content": "A revisit to a much beloved film from 2001. I was 22 then and was most impressed by the music, the intelligent dialogues and Aamir Khan's portrayal of the central character Aakash.Over the years as my reading of cinema has changed, the dialogues and Aakash are too over the top. The music is still great and subtle performances by Saif Ali Khan (Sameer) and Akshaye Khanna (Sid) seem much better.This was Farhan Akhtar's first film and great things were expected of him but he has turned out to be a one dimensional figure. He knows his high society and nothing else.If in 2001 I had been on Letterboxd I would have given it a 5 star rating but now it is a 3.5 star film which is a more realistic ranking for this film.",
            "review_date": "2018-12-17",
            "lang": "en"
        },
        {
            "review_title": "An absolute film-making 1st for Indian Cinema",
            "content": "Vaguely translated as 'What the Heart Desires', will at first bring a smirk to your face as one of those typically made up Indian Film titles. But, the title in this case is cunningly disguised, as what will be I'm sure the most talked about film of this generation for this decade. I feel it's the first movie set a milestone in Indian Cinema since 'Sholay' (1975), and can classed as a funky Generation X movie to boot.Dil Chahta Hai explores the life of 3 friends Akaash (Aamir Khan), Sid (Akshaye Khanna), Sameer (Saif Ali Khan), and each of their ideas about love, and as a result how they affect each other throughout the movie. Nothing more needs to be known or explained about this film, except, that it contains some of the most well-timed comedy I have ever seen, best & original acting performances to date from all three actors and love interests Preity Zinta & Dimple, creative cinematography, vibrant and fresh imagery, a water-tight script, and all this from debut director, Farhan Akhtar, demonstrating he was firmly in control of his work at all times.I knew this film was going to be good when I saw the trailer, what I didn't know, it was going be Outstanding! Go see it, you will not be disappointed.",
            "review_date": "2001-08-27",
            "lang": "en"
        },
        {
            "review_title": "Not for me",
            "content": "Addressing the fact that it should not take 3 hours to tell that story, some time ago I read that Hindi movies were so long because moviegoers in India wouldn't go unless they felt that the value of their money was reflected in the final runtime of the film, I don't know if that's entirely true but surely I'd prefer to watch a film focused more in content that in runtime.The scene in the nightclub with the dancing was great, it was like watching a fancy music video, great dance moves, it was fun to watch. But my favorite was the scene were Sid is painting Tara. The acting is over the top for my taste, and I feel off in stating that the notions of stereotypical romance depicted in the film are outdated and sexist, but hey the whole industry in the world is just like it in terms of romantic comedies, right? It had a few good moments, I liked the relationship between Sid and Tara, they could definitely make a statement out of that plot but they chose to go safe on that.",
            "review_date": "2017-12-18",
            "lang": "en"
        },
        {
            "review_title": "One World",
            "content": "This film depicts an India I don't know much about -- a modern, prosperous and, yes, all too Western India. The clothes, dancing and attitudes could be any country. Manoj is a little unfair to this picture. Perhaps his/her standards (Sorry, I am not familiar with the name) and expectations are higher because this film is not exotic to him. I found it very interesting. This film is packed with gorgeous girls and lots of humor. The dance numbers and music are original and very well done.  The film is definetly worth seeing.",
            "review_date": "2003-06-12",
            "lang": "en"
        },
        {
            "review_title": "New to Bollywood",
            "content": "One day I thought I'd try a Bollywood film not expecting much, the movie Dil Chatha Hai was suggested and was I surprised. The cast, story lines, song's (which I kept humming over and over) made me say 'Oh Yeah' there's someone else just as good as Hollywood. I have since watch other films to see if DCH was a fluke but for me there still was that Bollywood magic. I am also glad to see that some of the film companies are starting to expand into other more controversial subjects about the morays and tabu's because I find not only is the films entertaining but I have learned a lot more about the culture and it's people. The actors and actresses are diverse not cloned, that may be why I do not have a favorite each contributes to the Bollywood mystique. And I must not forget the song writers and singers whomever they are because to me they share as much credit as the cast. My movie library now has more Bollywood films than any other I am quite sure that I am just one of millions world wide that say 'thank you' to the Bollywood industry.",
            "review_date": "2006-09-07",
            "lang": "en"
        },
        {
            "review_title": "Most boring movie ever",
            "content": "There are better ways to waste 3 hrs of your life instead of watching this movie.",
            "review_date": "2020-08-21",
            "lang": "en"
        },
        {
            "review_title": "My early days with \"DIL CHAHATA HAI\" which was not so long ago",
            "content": "CAN THINGS BE EVERLASTINGLY BEAUTIFUL WITHOUT BEING GREAT! That is the answer which I am searching here through a movie, \"DIL CHAHATA HAI\". I have heard people saying the movie, \"DIL CHAHATA HAI\" is just another teen summer movie which just comes & goes by without leaving any substantial impact. I would say that is a disgrace. It certainly did on me; it left on me an ever-lasting impact that I can reminiscence forever. I still remember that evening when I first borrowed \"DIL CHAHATA HAI\" CD secretly on the way back from mathematics coaching & very excited to watch it because my sister watched it two days ago & highly praised. Though she did not reveal that until that day's morning or it accidentally slipped through her lips. Actually I was going through a very critical stage of my academic career. My exams were literally knocking at the door, only 10-12 days left. So my folks made me a promise to abandon watching it till the exams got over. But I can not hold that long if there is anything related with movies. If I could, I would not be writing about it now, would I?! Somehow I managed the whole thing out {don't ask me how} & I did watch it.So, without diverting any further with my past numerous hidden movie experiences, when I first watched it, I was simply dazzled by the beauty of the movie. It took me in such a state of ecstasy where I felt like I was doped. I was terribly sad when the movie actually ended. I was really hoping that it would go on forever, I really did. The movie had me in such an engrossing manner that after completing, I dreamed all the night about it, about the characters. On the next morning, I plugged \"DIL CHAHATA HAI\" again & then again. It seemed like going on forever. But after a while, I desperately felt an urge to get out from it & eventually it took quite a few days to get back to my normal system.By telling you all this nonsense childish stories, I'm trying convey here if one movie can create such a profound impact on a kid like me back then {I wasn't even the only one, after doing some personal survey back class, my friend-circle & the courtesy of some movie magazines}, It can not be just a movie; it has to be more than that.As time has passed, I have seen many more good movies. I have learned the true meaning of movie, enriching with such great films from where I have found the purpose of my life. I'm really grateful to those movies. If I had to say anything which changed my way of looking at life forever, I would definitely name those movies. No, I would not name \"DIL CHAHATA HAI\" but I just can't seem to forget those joyful moments it gave me. Yeah, it was my \"SUMMER OF '69\" & always will be.Cheerio.",
            "review_date": "2006-08-27",
            "lang": "en"
        },
        {
            "review_title": "A solid debut by Farhan",
            "content": "Direction--outstanding considering debut, writing- excellent, acting-- great, Music-- very good, cinematography-- great, editing-- adequate, costumes--good\nA trendsetting movie with a fresh approach that had never been explored in bollywood",
            "review_date": "2020-11-29",
            "lang": "en"
        },
        {
            "review_title": "Smiling right now",
            "content": "I have such a wide smile on my face right now as I finish watching this movie. This makes me so happy! Such an amazing movie. Thank the gods it's a happy ending!\nWe all deserve one. Now i know exactly which movie to go to when I need to make myself feel better. :D",
            "review_date": "2019-01-12",
            "lang": "en"
        },
        {
            "review_title": "Perfection!!! Loved everything about this movie.",
            "content": "Overall acting 9.5Aamir khans acting 10Saif Ali khans acting 9Akshay khannas acting 9Priety zintas acting 9Supporting cast acting 9Classic!!! One of the best movies of Bollywood. This movie was done perfectly. I wouldn't change anything. The cast and acting was perfect. The story was brilliant and the directing was excellent. Comedy and emotions were over the top. Farhan Akhtars vision has brought so much joy, emotion and inspiration to so many people. This movie is a must watch. Loved every parts of this movie. Great job guys!! Excellent!!!Highly recommended!!!",
            "review_date": "2022-06-24",
            "lang": "en"
        },
        {
            "review_title": "Good stuff",
            "content": "I really like that Aamir Khan. He was mostly the strong, silent hero in Lagaan, but here he's a goofy funny guy. The scene at the opera where he comes to many realizations is spectacular (if a little reminiscent of Moonstruck).I really liked this movie, and I probably would've really loved it if I spoke a word of Hindi (or if it had been subtitled).",
            "review_date": "2001-09-04",
            "lang": "en"
        },
        {
            "review_title": "its about love and friendship",
            "content": "This film shows the simplicity and the craziness about youth.",
            "review_date": "2021-06-24",
            "lang": "en"
        },
        {
            "review_title": "Lengthy",
            "content": "Its actual fun to watch, but later on it becomes lengthy and boring. The only best part I liked it their friendship, and ones they start falling in love I was bored.\nOverall a good one",
            "review_date": "2019-09-28",
            "lang": "en"
        },
        {
            "review_title": "Getting away from Bollywood, Staying away from Hollywood",
            "content": "Dil Chahata Hai is a wonderfully crafted film with an exceptional work in cinematography by Ravi Chandran.  I can't think of one moment in the film in which I was dissatisfied with the framing and the pixelation.  Also, I must call special attention to the song \"Tanhayee.\"  It is wonderfully filmed. Kudos to Chandran's craft. Dil Chahata Hai also has an incredible storyline of interweaving 3 different storylines into one big picture of life in progression. This films gets you away from Bollywood because it is not focussing on some stupid love story.  This film is not quite Hollywood because it has some principles of independent films going on within itself.  Although, love is not the strongest thought expressed in the film, it is definitely the motivation of the story's progression, or else the film would have ended at the intermission.  Also, the story of Sid is kept on the sidelines, while in the true essence of the film, that is the story which is the most honest and strongest one. The film's sound design is incredible.  It is probably the only film in Indian Cinema with SyncSound in it.  Also, Ehsaan, Loy, and Shankar's music is always a strong underscoring factor that triggers a heightening of emotions at the exact appropriate times.  The soundtrack is definitely worth buying thanks to this somewhat renaissance music in Indian Cinema by the trio. Aamir Khan's work is exceptional.  Saif Ali Khan and Akshaye Khanna have reinvented themselves in this film which is totally worth watching. Although, a little old to play their parts, I let out a suspension of disbelief because the film is just so much fun!",
            "review_date": "2004-03-26",
            "lang": "en"
        },
        {
            "review_title": "Ye Movie firse dekhne ko Dil Chahta Hai",
            "content": "This is such a beautiful movie.This movie has all the ingredients of a great film.It has comedy,romance,emotions,good story,etc.This is one of Aamir's best movies I would have to say being a Aamir Khan.The Acting is superb by the cast especially Aamir Khan and Akshaye Khanna.I watched this movie today.16 years later after the release date and I felt the magic of the old bollywood again.Truly a MasterPiece.",
            "review_date": "2017-11-12",
            "lang": "en"
        },
        {
            "review_title": "Listen to your heart",
            "content": "Certainly one of the best movie that i enjoyed. yes enjoyment all the way...very touching scenes from our daily life. The characters are so common in our life. I felt i am watching myself with my friends. I have always been a biggest fan of AAMIR KHAN and this is one of the finest performance by him.From his hunky funky flirto type to intense mature person in the end, you love him all the way. Both SAIF and AKSHAYE were perfect.Saif was so likable and played it to perfection. Akshaye did a real just with his character which i think was very difficult as well A lesser actor would have easily failed to bring the expression and mood to the character but he performed as this character was made for him. In fact the trio worked so well...the on screen chemistry between them was so great that the made it look so real. Preity showed why she is one of the best in Bollywood. Music is the high-lite and all the songs are hummable,well choreographed and picturized. \"DIL chahta hae\" still reminds me of inner me. \"Janay kiyon\" will mesmerise you and \"koi kahe\" is foot tapping number that ll sure bring you on the floor. The last one \"TANHAI\" was picturised superbly and expressions by AAMIR were tremendous. You cannot say that this is the debut movie for FARHAN AKHTAR. An excellent effort by him. Wish he ll be back with some more flicks like this.",
            "review_date": "2006-05-21",
            "lang": "en"
        },
        {
            "review_title": "A youthful nostalgia",
            "content": "For the umpteenth time I watched this movie. Never feels like some old movie. The trios acting always good. Obviously this being the feel good movie, their is happy ending. Theatre goers (if this movie is still being played) will come out feeling good for their life. Of course not everyone's life is that gorgeous, but we can make one if we like. This movie has clearly shown us that to be happy in life we don't need much (and iPhone or galaxy). And it never gets old no matter how many time I watch it.",
            "review_date": "2018-11-10",
            "lang": "en"
        },
        {
            "review_title": "17 years!",
            "content": "The only thing that saddens me about this movie is that it represents the passage of time, and how my life is going on in parallel to everything else.\nI revisit this film in detail and awe once every one or two years. The iconic title track has and always will be in my favorites playlist. Dil Chahta Hai represents this cluster of memories that can't be revived by any other nostalgic medium.\nIt will forever be fresh in the minds of 90s kids like me, and I can't imagine the emotions I'll go through when I'm re-watching DCH on its 25th anniversary!",
            "review_date": "2018-08-12",
            "lang": "en"
        },
        {
            "review_title": "The movie that reinvented Bollywood.",
            "content": "This movie was the turnaround for Bollywood,. This is when a fresh mind, young director, makes a urban chic movie.This was the beginning for youngsters planning their Dil chahta hai trip.",
            "review_date": "2021-05-03",
            "lang": "en"
        },
        {
            "review_title": "Good movie but could've been better.",
            "content": "Dil Chahta Hai is one of the most popular Bollywood films out there and with good reason. The movie follows the lives of 3 friends: Sid(Akshaye Khanna), Akash(Aamir Khan), and Sameer(Saif Ali Khan),who have recently graduated from college. They are from three different strata of society yet inseparable in friendship. But problems arise when Sid starts falling for a woman 10-15 years older to himself and subsequently falls out with Akash which leads to a series of events which changes their lives forever. While it is well taken and the characters relatable, this movie does have some flaws. For one, they spend the entire first half elaborating on the relationship between the friends, something which, in Hollywood, is normally done in half the time. This not only serves to annoy the less patient viewers but is also problematic as far as the plot goes. They spend so long introducing everyone that the fallout occurs shortly before the intermission at the end of the first half. Then when the movie comes back, the focus shifts to Akash and Sameer and their respective whirlwind romances which are played out in typical Bollywood style(complete with boring, arrogant, and overbearing rivals that the girls would gladly dump) which leaves little time for Sid. All he gets is a hasty fallout followed by him leaving Mumbai. This also is problematic as it provides no explanation as to how he got back to Mumbai, met Tara again and so on. If it was just a minor plot point, it would've been insignificant but this plot point should've rightfully been the focus of the story as it was the reason for the friction between the friends. Finally, the ending: The friends make their peace with each other, Sid moves on but it would've been better if they left it open ended and not shown that he had gotten together with Deepa. Overall, the movie was pretty good. Acting besides Aamir Khan and Akshaye Khanna was passable but I still don't regret taking 4 hours off my life to watch this. My score-7.5/10",
            "review_date": "2011-05-24",
            "lang": "en"
        },
        {
            "review_title": "Best bollywood film so far this year!!",
            "content": "Alas we have some Indian director who knows how to make a good film. Offcourse I exaggerate but lets face it bollywood releases a record breaking number of films week by week. Of those 8 or 9 movies perhaps you get one that is even worth a look, if you're lucky. So why is that? It's because films are aimed at lower/middle class traditionalist uneducated people who cling onto whats familiar. Offcourse we are all like that in a way. Slowly but surely Bollywood directors are realising that there is an even bigger market outside India. I must admit that at times Ive been frustrated by Bollywood film making antics. There is so much unique and beautiful material on which many great films can be made. Indeed there have been attempts with films such as Dil Se, however I have not been impressed with the execution of a potentially good film idea. Theres is too much of a temptation for these directors to turn the film into a media circus, cheesy songs are one medium for this. Why am I reviewing the state of Bollywood industry instead of the film, one might ask? Well after watching this movie and loving it, my intial thought was : was this film great because it was different and a break from the cheesy nonsense that bollywood has thrown my way before. Or was this film great because it was actually a great film. After scanning the film memory fresh in mind I decided it was the latter. Never have I seen such articulate cinematography. So much attention being paid to not only the materialistic side of the film but also the character depth. The three characters in the movie are great. As with all good films, the plot is simple. What makes a really good film i've always believed is the strength of the characters on film, How well they come across the screen and how believable they are. This film achieves all these factors and more. The film is about the changing lives of three college freinds, their relationships and how these relationships develope as they get older. The film doesn't actually deal with that many issues, two in the main, Love and adventure. How original is that you might say, well I'd say it is very original since the approach taken to handle these issues is very unique. Aamir Khan as always has done really well, and taken to the new style of character with ease, the two supporting actors Akshay Khanna and Saif Ali Khan are brilliant. The casting director has done well to cast these two in their particular roles, as it suits them perfectly; Akshay as a serious thoughtful character and Saif as bubbly and funny airhead (reminded me of Matt Le Blanc's Joey character in the US comedy sitcom Freinds) This film I have to say has very few flaws, and I'd like to think I can spot them, infact I canot remember even one at this particular moment in time. Even if there are the film overall is an absolute beauty. I strongly recommend you pay a visit to the nearest cinema that is showing it, sit back and enjoy you'll love it.",
            "review_date": "2001-09-26",
            "lang": "en"
        },
        {
            "review_title": "Sad Movie...",
            "content": "At first glance this move looks like the coming of age of Indian cinema but if you look closer you can see the sadness behind this movie. It is a story of three 30 year old boys who are passing out of college. And are faced by... hell hardcore partying and lying around like lazy bums doing nothing. This is a story of three 30 year old boys, who go to Goa and party, sans the booze, the drugs and sex. This is a story of three 30 year old boys who after being wastrels all their life finally get the girl and roll in money. Some say this was a great movie by Farhan Akhtar, I think otherwise, this was a childish attempt to make a movie on the youth of our country. The movie is an honest attempt to show utopia. Thats why the 2 stars.",
            "review_date": "2007-12-29",
            "lang": "en"
        },
        {
            "review_title": "one of d best films of bollywood",
            "content": "wonderful film reminds u of Ur college days or d days u spent with Ur frens :) direction is top notch this is aamir khan's coolest look ever and very nice acting by him too akshaye khanna was in top notch too saif ali khan got a nice role and is first rate too all the three heroines were strictly OKayub khan was irritatingstory is about life of 3 frens they thought that they wud b frens forever but some bitterful incident leads to a small quarrel its basically an urban India filmsongs are superb too go watch it now ;)",
            "review_date": "2008-07-19",
            "lang": "en"
        },
        {
            "review_title": "Fresh",
            "content": "Here is to hoping that DCH brings about a revolution in Bollywood filmmaking.  I have long been tired of the song-and-dance routines with poor plot development, and even less character evolutions ... but here comes a movie that has an aura of freshness in mainstream Indian movies not seen before.  The movie is technically excellent, has great visual imagery, and a well developed plot that is grounded on realities of everyday India.  A must see film.",
            "review_date": "2003-05-09",
            "lang": "en"
        },
        {
            "review_title": "A MUST SEE !!",
            "content": "Farhan Akhtars debut movie is definitely one of the best movies of 2001. The Acting is brilliant.The music superb.Art and Cinematography is brilliant. Aamir Khan shines in his role post ' Lagaan ' A definite 10/10.",
            "review_date": "2001-08-29",
            "lang": "en"
        },
        {
            "review_title": "Just to pass time",
            "content": "If you wanna pass free long time watch it .. otherwise this whole movie build on coincidences .. Its supposed to be dramatic but i find it rather funny ! Lol\nIts fun but don't expect high quality drama or romantic .. its a coincidence after another .. the whole story built on that .",
            "review_date": "2020-04-16",
            "lang": "en"
        },
        {
            "review_title": "wonderful",
            "content": "Last night (June 12, 2003) on Turner Classic Movies I had the good fortune to be able to watch Dil Chahta Hai. DCH is a film that portrays love so tenderly and innocently that it seems like a throwback to the classic Hollywood musicals of the forties, yet the visual and aural inventiveness in the movie leaves the viewer keenly aware that this is a contemporary creation. This happened to be my very first exposure to Bollywood filmmaking-in fact, I just happened to stumble upon the beginning of the film as I was channel surfing-but I was very impressed with the entire production. The writing is marvelous, as is the direction, the acting, and the cinematography. I also must say that I thoroughly enjoyed every musical number.Dil Chahta Hai is a triumph for writer-director Farhan Akhtar. If you are looking for deep socio-political meaning in a film you won't find it here. This is just a movie about three young men, their friendship with each other, and their relationships with women. But unless you are hopelessly cynical, you will find this a very engaging and entertaining movie. This is a film that draws the viewer into the world of the characters on the screen, and when the movie ends, you don't want to leave. I think that Dil Chahta Hai is the kind of film that melts away cynicism and reminds us that sometimes the world is a wonderful place.",
            "review_date": "2003-06-13",
            "lang": "en"
        },
        {
            "review_title": "One of the best movie made in Bollywood",
            "content": "Well written and directed. Didn't feel like it was director's first movie. Will always be one of the best movie made in Hindi cinema.",
            "review_date": "2019-09-06",
            "lang": "en"
        },
        {
            "review_title": "Delightful!",
            "content": "The title song is great and the rest of the track is not bad either. The take off on the older styles of bollywood is hilarious. The film is about three friends and how they experience love. Whether it's an everyday occurrence for one or once in a life time event for the other. The chemistry between the three leading actors is wonderful and Aamir Khan gives a very good performance. Saif Ali Khan does a great comic role. This film has wonderful comic moments (consider the scene with the Time Table Guy) and powerful serious moments (like the pre-interval confrontation). Overall it puts a great accent on friendship and its importance. Enjoy!!!",
            "review_date": "2005-02-20",
            "lang": "en"
        },
        {
            "review_title": "A perfect Date movie",
            "content": "Dil Chahta Hai is a perfect date movie.This movie is one of the freshest movies to come out this year. It is quite original, and the chemistry between the lead stars is tremendous.Aamir is at his usual best. And he really shows his histronics yet again.Saif Ali Khan really makes the most out of the comic situations and you really feel pity for the guy when every girl walks over him.Akshay has given his best performance to date. And I liked his performance the best out of the three.A must for the young crowd",
            "review_date": "2001-08-24",
            "lang": "en"
        },
        {
            "review_title": "I'm Amazed!!",
            "content": "Yes I'm Amazed at more than one things,so realistic and true to life figures and yet so funny.Being funny and being realistic don't often come in the same sentence as far as the film making is concerned.Then I'm Amazed with the maturity with which such a young director has created such a memorable film,a film which is hyper-stylized,original,realistic,funny and does'nt feel as if you are a viewer,it feels as if you are one of them(especially if you belong to the student class)and you laugh with them and you cry with them too,and that is such a rarity these days.All I have to say is that One of the best Indian movies ever made.",
            "review_date": "2002-12-30",
            "lang": "en"
        },
        {
            "review_title": "Ground-breaking work!!!",
            "content": "Dil Chahta Hai is truly a ground-breaking film in the history of Indian cinema! The camera-work, editing, music, sound effects, etc being amazing as they are; the costumes, the dialogues, the characters are what make this film so awesome! This film has changed the look of Indian cinema.",
            "review_date": "2003-11-26",
            "lang": "en"
        },
        {
            "review_title": "This great film is about the universality and the uniqueness of intimacy.",
            "content": "I was very glad to experience the quality of this Bollywood film.  The characters are so real, I felt like I knew them personally by the end of the film  perhaps I've known people like this in my own like.  This is excellent storytelling.  The music is moving.  The camera work is very sensitive and invisible yet totally revealing.  If you want to see a film that tells an everyman story in an Indian setting, this is the one. Don't miss it.",
            "review_date": "2003-06-27",
            "lang": "en"
        },
        {
            "review_title": "The Only World-Class Bollywood Film",
            "content": "Does this sound like an extravagant claim? It's not. Look at the dialogue; the narrative; the acting; the sound; the lighting; the cinematography; the editing. No melodrama. No unnecessary scenes. No useless lines. Just a crisp, engaging movie that flows like normal life -- people sitting around BS'ing, having an awkward dinner, taking naps during a road trip -- something Bollywood has just not managed to capture or reflect in almost a century of film-making. There can be awkward silences between friends in a scene, and the director does not feel compelled to break them with over-dramatized tension. They can sit around and share a joke, and we're allowed to sit among them and enjoy the company. This may seem like elementary stuff for Hollywood audiences; but it was a big accomplishment for Hindi cinema. It's an act that has yet to be followed.\"Dil Chahta Hai\" was Farhan Akhtar's debut film. In one sally, his technique blew away the work of all pop Hindi directors who preceded him -- and I include Raj Kapoor in this list.",
            "review_date": "2004-05-29",
            "lang": "en"
        },
        {
            "review_title": "Movie about friends, carefreeness",
            "content": "Intro:\nA movie at the start of new millenia by a young debutant director which somehow changed the canvas of Indian film industry a very now known Dil chahta hai. The Indian film industry never had a film like this which was so uncommon and yet so relatable to the youth. A movie about friends and there problems of life. A cult trend of trip to Goa made so famous that it is still in fashion among friends.PLOT:\nMovie about three friends Akash, Sid and Sameer each one different from the other and yet closely knitted in the bond of friendship. As the college has ended and everyone after college plans to go in there career direction. These 3 friends take a trip to Goa and Sid thinks that they will all go in different directions and it will not be possible for them to meet as they all will be busy in their own and this can be their last trip together. After returning Sameer's parents arrange a match for him with their family friend's daughter named Pooja. Sameer not ready for arrange marriage after seeing Pooja is awestruck but she already has a boyfriend and so, she denies. Akash and Sid have a misunderstanding and argument as they both have two different ideas on love. Akash jokes about Sid's feeling for a woman named Tara as just sexual and does not approve of their relationship as she is elder to him, divorcee and an alcoholic. Sid goes to Kasauli for his degree course in painting and Akash depatrts for Sydney to take care of his father's business. Sameer is left behind and is waiting for Pooja to leave his boyfriend. In Sydney by meeting Shalini, Akash has a change of heart and falls for her but she is already engaged to Rohit. Rohit and Shalini come back to India for marriage and Akash is left heartbroken. His father calls him back. So, he encouraged by everyone with Sameer goes where wedding functions are taking place and proposes to Shalini in front of whole crowd. Shalini is in dilemma as Rohit's parents raised her when her parents died. They asks her to listen to her heart and marry Akash. Sameer also gets his love in Pooja. Sid finds Tara in hospital on her deathbed with Sameer. Akash also reminisces about there friendship and college day. Finally, he calls Sid who is in hospital with Sameer and patches things with him. Atlast, the trio has a Goa trip with Shalini and Pooja joining and Sid meeting a new girl.Review:\nThe songs are evergreen as ever and you can tune into them after twenty years also. The cast is superb and everyone filling for their character perfectly. Finally, the director on his debut comes on top with his storyline and manages his cast perfectly.I go with 9 on 10.",
            "review_date": "2021-12-22",
            "lang": "en"
        },
        {
            "review_title": "Realistic and Funny",
            "content": "When people ask me why Dil Chahta Hai is on my list of great Hindi movies, i ask myself \"What did i love the most about this movie?\" Well, It's not the script or the acting or the direction, locations, songs and cinematography. All that stuff was really great, but what i loved the most about this movie was how REAL it was. The three guys were just like any other three guys i know...but thats what makes this movie great. You feel like you know the characters. A brilliant movie with brilliant acting and direction. More movies like this, and Bollywood would be producing movies that are actually worth watching. Go, DCH!9/10",
            "review_date": "2004-08-11",
            "lang": "en"
        },
        {
            "review_title": "A refreshing departure from the cliche...",
            "content": "What is refreshing about this movie is that it is a departure from the tired cliche of rich-girl-falls-in-love-with-dirt-poor-boy routine which usually leads to family feuds and ends in one extreme or the other; either in tragedy or a happily-ever-after fate.This is a non-apologetic look at the story of rich, urban kids who, while representing a minute fraction of the society, are still a real aspect of Indian life.Also, the non-traditional unorthodox romance between Sid and an older women with problems of her own is daring, considering the culture this movie comes from.",
            "review_date": "2003-02-04",
            "lang": "en"
        },
        {
            "review_title": "Great Plot, Great Cast, Great Movie!",
            "content": "\"Dil Chahta Hai\" is definitely up there as one of my all-time favorite movies, and is arguably one of the best movies of the year. As usual, Aamir Khan and Saif Ali Khan act amazingly well. Akshay Khanna does an amazing job as well. Preity Zinta looked amazing and acted well too... all in all with the amazing cast and the great plot - its a movie i highly recommend. The soundtrack to the movie is pretty impressive as well, and fit in with the plot of the movie at appropriate times - not like a lot of the movies i see nowadays where some songs are put in the movie simply either for the sake of having a song, or to take up time. the songs were good, relevant, suited the mood, and contributed to the modern style of the movie. Comedy, Drama, Great Songs, love stories that work - and everything is very realistic, so hopefully this film is a wake up call to the rest of Bollywood, who seem to be obsessed with unoriginality. - If you haven't seen this movie, you are seriously missing out!",
            "review_date": "2005-02-09",
            "lang": "en"
        },
        {
            "review_title": "Must watch",
            "content": "Movie is full of life and soothing songs 😍loved it",
            "review_date": "2021-02-19",
            "lang": "en"
        },
        {
            "review_title": "Unarguably the most stylish movie from India",
            "content": "This is the first Indian movie which truly defines 'style'. I'll compare this movie to movies of guy Ritchie or Tarantino though the subjects are vastly different, the common point between these three brilliant directors is that the style it is made by. Apart from that, the movie offers great art direction, costumes, visual effects, and an amazingly well-told story and a brilliant screenplay.Its funny, slick, contemporary and yet being commercial cinema, comes close to a great artistry. Scintillating performances by the lead actors viz. Aamir Khan, Saif Ali Khan, Akshaye Khanna and the gorgeous Priety Zinta makes DCH a full 10 pointer package...",
            "review_date": "2007-06-26",
            "lang": "en"
        },
        {
            "review_title": "Indian cinema needed a 'Dil Chahta Hai",
            "content": "Indian cinema needed a 'Dil Chahta Hai'. Desperately.  The movies were losing younger audiences to TV and bowling alleys. Also Hindi film writers seemed to have nothing new to add.And then here came a film, a decidedly simple film, about three friends - and it changed everything. The youngsters loved the film. They identified with the cast, the clothes, the haircuts, the songs, the emotions, the dances and the humour. It wasn't obvious, it wasn't repetitive, it didn't insult their intelligence. It spoke their language.In fact, DCH was one film where even the actors got a new lease of life. With hip haircuts and cool gear, the cast looked fab.Farhan Akhtar the director (whose father Javed Akhtar created the angry young Amitabh Bachchan), had made his point. This was a Hindi movie, with all the curry to suit the Indian palate, but it was served just right. Watch this movie for its attitude and its energy. Its youthfulness and its never say die attitude. That's what it's all about.",
            "review_date": "2002-11-14",
            "lang": "en"
        },
        {
            "review_title": "DIL CHAHTA HAI to watch it again and again",
            "content": "After watching decades of clichés this was one movie that shattered it all. I remember when i watched it just to see aamir khan playing a modern young guy after lagaan, where he played a villager as good as a villager, and i came out with respect not just to him but the entire cast, specially the man behind it, Farhan Akhtar. Modestly speaking this movie was a revelation in Indian Cinema and for the movie goers, who were just tired of watching heroines wearing schiffon sarees, showing cheap cleavages and acting like the ideal Indian girl waiting for their lovers to fight for them to complete a full on romantic story. The most interesting thing that this movie did is to satisfy the audiences with what they always desired out of a good movie without even knowing what to desire after watching all those years of crap. Since 2001 I have watched it countless times because of its freshness, absorbing emotions, and most of all friendship that i have with this movie. For someone who still hasn't watched it, watch it if u like great cinema. IMDb please put this movie in your top 250 list, none of the movies deserve it more.",
            "review_date": "2010-07-26",
            "lang": "en"
        },
        {
            "review_title": "The movie is all about understanding love and friendship.",
            "content": "Dil Chahta Hai film will inspire you to reach out for the one you're in love with doesn't matter what the circumstances are. It showed the importance of friendship, it's power, fun & entertainment, understanding between each other and the limits. The film tells that you cannot find your love, one day or another, you'll automatically fall in love. It will inspire you to fall in love and respect each others' feelings no matter what. Overall, it's a wholesome entertainment one can enjoy watching with his/her friends or the loved ones.",
            "review_date": "2017-05-02",
            "lang": "en"
        },
        {
            "review_title": "The Best Hindi Film of 2001!!",
            "content": "This movie changed bollywood forever. From the iconic dialogues to quite possibly one of the smartest screenplays to be put on a hindi film to great acting especially from Akshaye Khanna, to a storyline that takes a an age old cliched story and turned it into a timeless tale of modern friendship. This film has everything you need from a good/great film. Also has one of the best music albums and background score in bollywood history. What more do we need?",
            "review_date": "2022-08-04",
            "lang": "en"
        },
        {
            "review_title": "Movie Feedback after 10 years",
            "content": "Seriously i think its the best movie Bollywood has ever come with. Very nice story with good emotions and lessons. The best part of the movie is definitely the extensive level of friendship among the 3 lead characters of the movie, and the fun stuff they have shown in movie probably takes every single human being back in that era. There is a brilliant blend of good acting and good dialog in this movie that makes it a perfect comedy romantic movie. As for me i am watching this movie for like 4th time and still it is so much fun to watch. I would say that it is definitely a 10/10. Two thumbs up",
            "review_date": "2012-02-12",
            "lang": "en"
        },
        {
            "review_title": "Not aged with dignity",
            "content": "When you try to see this movie in 2023 you quickly realize that it has not aged with dignity, it feels old and not in a good way. The world has evolved but the this movie will not be a timeless classic.At 3 hours long it is a stretch, it involve some of the greatest actors in Bollywood but unfortunately the movie is hardly bearable to watch.22 years has taken its toll on the movie and it might be a good example on how tacky things were around the millennium, all from interior design, styles of clothes and hairstyles and how much technology has advanced in these years.Sorry all but I can´t recommend this movie.",
            "review_date": "2023-01-10",
            "lang": "en"
        },
        {
            "review_title": "Movie which never gets old, ahead of time, can't believe it's been 20 years since this movie got released.",
            "content": "Everyone will easily relate to this movie, specially if you are in your 20's. Story is fabulous and all of the cast gave their best work, songs are amazing. I feel this movie is still little bit underrated because when i search for top Bollywood movie list then this movie is not even in the first 10 list.. i mean Come-on this movie deserve to be in the top 10 list, some websites are listing not so deserving movies in the top 10 list & i just can't believe that.",
            "review_date": "2021-05-11",
            "lang": "en"
        },
        {
            "review_title": "Great Piece Of art",
            "content": "Farhan U deserve full congrats and that the 3 actors are absoluty exellent and that its an excellent change for movie goers and that the director of photography must be thanked for his effots to entertain us he is none other than creative ravi k chanrdan. :) absolute entertainer",
            "review_date": "2001-08-30",
            "lang": "en"
        },
        {
            "review_title": "brilliant",
            "content": "dil chahta hai are a brilliant movie, different style, theme, act, story,..it's so cool, great..akash character are good take of aamir..so either sameer with saif ali khan and siddhart with akhsaye khanna..the directors so great..this is one of movie which have pawer and unique side of lagaan",
            "review_date": "2003-05-19",
            "lang": "en"
        },
        {
            "review_title": "Dil chaahta hai..awesomeness",
            "content": "Morals of Movie - Dil Chahta Hai! Things u can learn from Dil Chahta Hai (Bollywood Movie).. *Freaking out and enjoying life doesn't need drugs or cigarettes. *There are relationships apart from bf/gf, marriage, siblings, friendship that can be very emotional and true. This is beyond the understanding of many people. *And yeah even though u may be the best of friends there is always a limit which shud never never be crossed. Then it starts hurting........... *Improving ur imperfections after you realize it, always take some time. *You always don't need to show or prove your gf how much u love or care about her, which can sound very boring and finally u r dumped. *Believe in Love, true love will never let you down *Never be ashamed to go back to your old friends, friends are there to understand your mistakes. *Do not be afraid of others, always think that othersr afraid of you. (Australian Beggar ) *Whenever you need your friend, remember that he is just a phone call away... distances can't separate friends *What a woman wants in life is some one who can make her smile. Be true in all your relationships, be friend, wife, or a stranger. *In the end, we will remember not the words of our enemies, but the silence of our friends. *It's the friends you can call up at 4 A. M. that matter. *The only unchangeable certainty is that nothing is certain or unchangeable. *The best kind of friend is the kind you can sit on a porch and swing with - never say a word, and then walk away feeling like it was the best conversation you've ever had.",
            "review_date": "2011-12-31",
            "lang": "en"
        },
        {
            "review_title": "True friends stay with u forever.........................",
            "content": "I was very young when i saw d movie 4 d first time, i loved it then but as d years passed by i understood its actual meaning. Basically d plot of movie is very simple but d story unfolds interestingly n explaining d deep bond of friendship between three college friends.they all belong to d higher class of d society,having different ambitions n different understandings of love n life.'Dil Chahta Hai' has got many wonderful moments which get stuck in your mind for a long time. It said hat u can enjoy your life without drinking, smoking or doping. It also touched many matured issues like a man loving some woman who is older then him in age............ which were never told before with such maturity.This is my Favorite movie as you can easily relate to d characters. the star of d movie is Farhan Akhtar who wrote such a beautiful movie about life n gave it a topnotch direction. Acting is done superbly by everyone esp. Aamir, Dimple Kapadia & d background score is excellent tuning with d mood of movie.",
            "review_date": "2009-11-02",
            "lang": "en"
        },
        {
            "review_title": "A near perfect entertainer",
            "content": "This was a movie that rekindled my interest in Hindi movies again after horrid few years (2000-2001) of generally bad movies out of Bombay. This movie felt like a breath of fresh air in film making in India. This was perhaps the first time that I really connected at an intellectual level with a masala Indian movie. I liked the dialog/interaction, the emotions, the melodious songs (I usually hate the dance/songs sequences in Indian movies), the simple story telling with normal everyday life events. There was a perfect harmony and balance in all aspects of cinema and character development. Even though there were many chance events (e.g. Akaash meeting shalini on airplane, etc.) which moved forward the story but it didn't feel like any artificially created sequences. Overall I loved this movie and perhaps have already watched 6-7 times in past 7 years!.",
            "review_date": "2007-12-29",
            "lang": "en"
        },
        {
            "review_title": "Walking in the past watching a worst Movie...DIL CHAHTA HAIN",
            "content": "Today I wanted to fly in the past, today I wanted to really feel how the Bollywood movie was look alike but got slapped at my own face when I choose to watch for my first time, the so-called MR Perfectionist's (but in reality not) Movie \"DIL CHAHTA HAIN\" ...ROLF, what an idiotic movie and much more idiotic ending I would have never expected, MR Perfectionist proposing his girlfriend in front of more than 300 people in her marriage when it was already fixed with somebody, don't you realize sometimes Sacrifice wins the race, out of 3 characters AAmir was worst, my big thanks to AKSHAYE KHANNA and SAIF whose role was at least not shameful like Aamir:ROLF...And as usual the bollywood style idiotic ending, Akshaye KHanna must have found somebody at GOA , otherwise , it does not sound at all good.., isn't it FARHAN AKHTAR, I am proud of you till today but not now!But still you people never stop telling Aamir , You are MR perfectionist ...wHAT a joke...like it..HAHA..HEHE...HOOHOOO!!!!!",
            "review_date": "2012-11-26",
            "lang": "en"
        },
        {
            "review_title": "PRAY!!!!!",
            "content": "As a confirmed hater of the formulaic Hindi flick (Wife dragged me to it), it is an encouraging sign to see that Dil Chatha Hai was made.... and appreciated by the box office.Maybe now our betelnut-chewing producers will be forced to sit up and notice the fact that Indian audiences do have the intelligence; they so far failed to acknowledge.Dil Chatha Hai is not the best Bollywood movie yet, not by a far mile. But it is an important milestone and it's importance will grow in the years ahead when we see the new breed of Bollywood flicks it will undoubtedly inspire.Unless of course our betelnut-chewing friends turn it into another formula and kill it to death.PRAY!!!!!",
            "review_date": "2002-02-15",
            "lang": "en"
        },
        {
            "review_title": "Fun if goofy at times",
            "content": "It was fun.  In the same way that Flashdance, Footloose, and any other Teen Musical/Drama are fun to watch. You can expect some outright hilarious takes from early teen movies. Even a nod to the beach party movies of the 50's and early 60's.  I agree that the plotline is thin and the actors are too far beyond the portrayed ages to be believable. Still, don't expect perfection but do expect to be entertained.",
            "review_date": "2003-06-12",
            "lang": "en"
        },
        {
            "review_title": "Simply Marvelous, A Masterpiece",
            "content": "Even after 19 years of its release, (goin to be 2 decades soon) we all especilly youth can relate. One of the finest n entertaining movie. DCH rocks ✌🏻",
            "review_date": "2020-06-10",
            "lang": "en"
        },
        {
            "review_title": "An example of perfect bonding",
            "content": "These last few seconds of the film, without a word between Sid & the girl, conveyed a message very deep and meaningful.Even though you cared for and loved the person you lost with all your heart and cannot get passed them, after awhile you learn to do so. No matter how difficult it may seem in that moment to get out of that situation, with time you eventually put it behind you and move on, like Siddharth did there.It may take you some time, how long depends completely on you. However, you'll be ready when it's time. How do you know when it's time? You'll just know. So just hang in there!\nA perfect example of friendship & mutual understanding between the three friends, who are individually realized that even in tough times, your friends will be there for you.",
            "review_date": "2020-04-15",
            "lang": "en"
        },
        {
            "review_title": "THE Best Damn Hindi Film Period",
            "content": "THe best Hindi film ever made, excellent casting, directing, everything is good. There is nothing wrong with this movie and it just makes you feel good. Aamir Khan is amazing as a very funny character at first who later becomes a more emotional character. Saif Ali Khan gives one of the best performances of his life, no doubt it is a very funny role. Akshay khanna gives the most emotionally deep performance of the film proving his range as a character actor. The script is very funny but at the same time can be emotional and challenging. THe punchlines are excellent and prove that a movie can do all. NO one can touch this film as far as Hindi films go it is just superb.",
            "review_date": "2008-02-24",
            "lang": "en"
        },
        {
            "review_title": "Excellent - funny and orginal ! We want more of this !!!",
            "content": "Great movie, some say its slow but I think it ads to the real life situations, makes the jokes stand out more (which are all original). EVERYONE has acted superbly, with many CLASSIC scenes. Preity Zinta looks FANTASTIC, the songs are ALL very very listenable, and you dont get bored with them as you do with other movie songs. Young, hip-hop movie - everything we expect from movies. I am not a big indian movie fan I admit, but WE WANT DIL CHAHTA HAI 2 !!!!!!!!!!!!!!!!!!",
            "review_date": "2003-08-15",
            "lang": "en"
        },
        {
            "review_title": "The best of bollywood!",
            "content": "This has got to be the finest movie of all times!.. Bollywood seriously could use more of these! The way characters were played by the actors was really brilliant though the story of Dimple as the love interest of young painter was a bit of a drag. Saif really was at his best as was aamir khan and preity zinta.It actually portrays what the youth is like in India today with a comic grasp. Music is well done, the songs are shot in an incredibly original manner and lyrics is good. If you are looking for something fresh ..this is it. Fantastic direction and great comedy! A MUST!! :)",
            "review_date": "2004-06-02",
            "lang": "en"
        },
        {
            "review_title": "Perhaps the best movie bollywood has produced ever",
            "content": "This is the first time I am writing a review for a movie... the reason I never wrote is my bad english.. But this movie compelled me to have courage to write for the first time. The most important thing about DCH is its sheer simplicity... I can relate to every single scene of this great(perhaps greatest) bollywood movie....\nFriendship is the most beautiful and powerful relationship and every person who believes and feels the depth of friendship will love it..... AT the time I am writing this I am listening DCH's BGM.....",
            "review_date": "2019-09-17",
            "lang": "en"
        },
        {
            "review_title": "Breeze of fresh air in rotting hell",
            "content": "The arrival and onset of such never ending Classics is what our country needs to revive and astound the cinema to evolve into.\nIt is a favourite one for all those people who can connect to the eccentricities as well as traits of the characters,and make it a timeless saga to savor upon.\nI really wish makers of today get a lesson from it and keep working on characters more as Farhan did in this film.Kudos to people who made such a gem for us to relinquish upon happily ever after till date.",
            "review_date": "2020-06-20",
            "lang": "en"
        },
        {
            "review_title": "Absolutely fantabulous",
            "content": "Absolutely fantastic movie way ahead of its time. Hope they make these kinds of movies more. Pure gem.",
            "review_date": "2019-07-18",
            "lang": "en"
        },
        {
            "review_title": "refreshingly new and easily the best romantic hindi movie i have seen till date",
            "content": "Well for one, this movie reminded me of the subtle love of \"you got mail\", anyway with the kind of emotions Amir Khan potrays he could well be India's Tom Hanks. refreshingly new and easily the best romantic hindi movie i have seen till date,",
            "review_date": "2002-02-28",
            "lang": "en"
        },
        {
            "review_title": "plot soundtrack and acting",
            "content": "I'm not a great fan of Indian movies, so I was pleasantly surprised when i came across dil chahta hai. Youthfully exuberant, it is one of the best Indian movies of the recent past. Noteworthy performances by aamir khan (great actor) and preity zinta. unlike many indian movies the rest of the cast put up a decent show as well. all in all a highly enjoyable movie with a good story and soundtrack.",
            "review_date": "2001-09-01",
            "lang": "en"
        }
    ]
}