{
  "title": "Invasion of the Body Snatchers",
  "rating": 6.9,
  "release_date": "1978-12-22",
  "summary": "In San Francisco, a group of people discover the human race is being replaced one by one with clones devoid of emotion.",
  "critic_reviews": [
    "Easily among the greatest remakes ever made, Philip Kaufman updates Don Siegel's McCarthy-era classic to 1978 San Francisco. Kaufman proves singularly adept at keeping multiple genres and tones in play, from noirish mystery to heady paranormal thriller to face-squishing sci-fi horror. There's truly no recovering from the film's final the enemy-is-us parting shot.",
    "Set at the intersection of post-Vietnam paranoia and the myopic introspection that became hippiedom's most lasting cultural contribution, the Philip Kaufman-directed Invasion alternates social commentary with impeccably crafted scares. As much an echo of Don Siegel's 1956 original as a remake, it does little to change a formula that worked fine the first time around.",
    "Invasion of the Body Snatchers validates the entire concept of remakes. This new version of Don Siegel’s 1956 cult classic not only matches the original in horrific tone and effect, but exceeds it in both conception and execution. Sutherland has his best role since Klute. He gets excellent support from Adams, who projects a touching vulnerability.",
    "One of the subtlest and most extraordinarily fluid of American horror films, Kaufman crafts textured scenes, rich in emotional and object-centric tactility, that cause our heads to casually spin with expectation and dread.",
    "Though it lacks the awesome allegorical ambiguousness of the 1956 classic of sci-fi/political paranoia (here paid homage in cameo appearances by Kevin McCarthy and Don Siegel), Kaufman and screenwriter WD Richter's update and San Francisco transposition of Jack Finney's novel is a far from redundant remake.",
    "For once, a great remake, smartly executed. Great performances and a killing ending that will stay with you forever can't hurt, either.",
    "An unusually imaginative and adroit but also self-conscious remake, which transposes the setting from a disarmingly serene small town called Santa Mira to a systematically ominous, threatening San Francisco.",
    "Phil Kaufman's version of the Don Siegel SF classic is good as remakes go, but not as good as the original. Where Siegel was swift, compact, and efficient Kaufman tends to be slow, garrulous, and needlessly baroque. Ideas that Siegel knocked off in a few shots are expanded to fill entire sequences—but they're good ideas, and can stand a little stretching. Good allegories never die; they just expand and contract to fit the times.",
    "The screenplay, by W. D. Richter, remains bright and lively throughout, but the plot just isn't full enough to carry a feature film. The characters are vivid, and uniformly well-played, and their pre-pod lives are fairly well established. But an hour into the film, once the menace is identified, the few remaining humans begin fleeing for their lives, and after that it's just run, run, run.",
    "If there is a hero in the new film, it is Donald Sutherland, who gives an energetic, intelligent, emotionally rangy performance as the public health officer working on the case. There is nothing wrong, either, with Brooke Adams as his colleague and lover. But, sadly, they can not compensate for all the other mistakes in a film that lingers too long and too soberly over material that, as the original showed, must be quickly, even superficially handled, if it is to be accepted at all.",
    "The film collapses midway--because of unsure and sloppy direction, splintered story continuity, and the overacting of Adams, Cartwright, and others. The battle between Sutherland and the aliens in the \"pod factory\" at the end is simply absurd and sophomoric."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Definitely one of the best sci-fi/horror movies of it's time. With great acting, impressive practical effects and a very atmospheric soundtrack, Invasion of the Body Snatchers delivers and gives much more than what you would expect.",
      "review_date": "2017-10-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Nothing but sexist belittlement of women characters. Dialogue is unoriginal and annoying.",
      "review_date": "2019-06-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "+Excellent cast+Interesting sci fi premise -Camera work and lighting have aged poorly-Screenplay hasnt aged well either\n\nIOTBS uses a fascinating concept of the creeping takeover of the human population in san Francisco with alien human+Excellent cast+Interesting sci fi premise -Camera work and lighting have aged poorly-Screenplay hasnt aged well eitherIOTBS uses a fascinating concept of the creeping takeover of the human population in san Francisco with alien human hybrids(and presumably the world!). As a piece of movie history it has aged poorly however. There is little artistic merit to be found in the cinematography although it looks clean in uhd format. Sadly the majority of the film is shot at night but the lighting is virtually non existent so there is little benefit to that choice as everyone and everything is simply swamped in darkness. Cast performances are erratic with little logical reasoning in the screenplay to really sell the sometimes bizarre reactions. The visual effects are possibly the strongest area of the film as they are practical effects and seeing them in uhd was quite intriguing especially the homeless guy face on the dog!Soundtrack performs its function with some odd moments of synth throughout no doubt very edgy back in 1978 but in 2020's feels campy. The hilariously sexist screenplay has also aged terribly but if you dont mind quirky campy sci-fi this may entertain you.",
      "review_date": "2021-11-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I say this as a big fan of the 1956 film. I have nothing against remakes, some are great, some are good, some are bad, some are downright awful. Fortunately Invasion of the Body Snatchers(1978) is one of the truly great ones, one of thoseI say this as a big fan of the 1956 film. I have nothing against remakes, some are great, some are good, some are bad, some are downright awful. Fortunately Invasion of the Body Snatchers(1978) is one of the truly great ones, one of those rarities that not just lives up to the original film but almost beats it.The only reason why it doesn't quite is because the 1956 film does more with the change of the townsfolk. That said, it is a very well made film, with the special effects enhancing the mood rather than distracting from it and the scenery and cinematography striking. The make up is also outstanding.Invasion of the Body Snatchers also has a strong score that just adds to the tension and suspense, a compelling story especially the ending, in fact for me I marginally preferred the ending here, the dialogue is intelligent and well-delivered and the direction is very fine.There is some great acting too. Donald Sutherland and Brooke Adams are strong leads, while Jeff Goldblum steals the scenes he appears in. Overall, a great film and worthy remake. Anybody who has not seen the Invasion with Craig and Kidman, it may be a good idea to keep it that way. 9/10 Bethany Cox",
      "review_date": "2022-03-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The first update of the 50s classic for a few moments manages to duplicate the ingenuity of the original, raising the levels of fear and paranoia and above all, with a pessimistic and chilling ending. To note the participation of KevinThe first update of the 50s classic for a few moments manages to duplicate the ingenuity of the original, raising the levels of fear and paranoia and above all, with a pessimistic and chilling ending. To note the participation of Kevin McCarthy, the same as the original version. If you notice any suspicious attitude in a neighbor, or the newspaper delivery boy, watch out!",
      "review_date": "2022-05-22",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 17,
  "genres": [
    "Sci-Fi",
    "Horror"
  ]
}