{
  "title": "North by Northwest",
  "rating": 8.0,
  "release_date": "1959-08-06",
  "summary": "A hapless New York advertising executive is mistaken for a government agent by a group of foreign spies, and is pursued across the country while he looks for a way to survive.",
  "critic_reviews": [
    "There’s a superabundance of sparkling, often marvellously terse one-liners (when asked what the “O” stands for, Thornhill’s resigned and emotionally relevant answer is, “Nothing”) – and, my, how wittily Grant delivers them.",
    "This is Hitchcock's longest film and also his most self-referential. Little jokes abound about art and artifice, role play and reality, duty and duplicity and each viewing reveals something new to enhance the pleasure of watching the Master of Suspense at his most mischievous and assured.",
    "This film is pure entertainment.",
    "The picture is hugely pleased with itself, but it’s too funny and expertly calibrated to mind in the least. Both Hitchcock and Grant raise relaxed confidence to masterpiece level here.",
    "[A] sublime classic.",
    "North by Northwest is the Alfred Hitchcock mixture - suspense, intrigue, comedy, humor. Seldom has the concoction been served up so delectably.",
    "NORTH BY NORTHWEST has everything--thrills, suspense, mystery, and black humor, as well as dark undertones of sexual exploitation and covert political machination.",
    "A great film, and certainly one of the most entertaining movies ever made, directed by Alfred Hitchcock at his peak.",
    "As though North by Northwest boasts some of Hitchcock’s most ambitious and memorable set pieces it is also one his most terrifically funny, playful moving pictures, cutting just the right line between suspense and belly laughs.",
    "Hitch's masterpiece.",
    "One of Hitchcock's very best comic thrillers, North by Northwest features scene after unforgettable scene.",
    "The lines and the expert manipulation of the principals are tributes to the outstanding talents of Messrs. Lehman and Hitchcock.",
    "Smoothly troweled and thoroughly entertaining, North by Northwest wears its implausibilities lightly, bobs swiftly past colored picture postcard backgrounds from Madison Avenue to South Dakota's Mount Rushmore, the U.N. Secretariat to George Washington's wattles.",
    "North by Northwest is also surprisingly forthright when it comes to sexual matters. There aren't many euphemisms or double entendres in the interaction between Thornhill and Eve.",
    "Hitchcock breezes through a tongue-in-cheek, nightmarish plot with a lightness of touch that’s equalled by a charming performance from Grant (below), who copes effortlessly with the script’s dash between claustrophobia and intrigue on one hand and romance and comedy on the other."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "The best, GREATEST thrilling mystery movie ever made! With the best movie character ever portrayed: James Mason as Phillip Vandamm! And the best movie score ever composed!",
      "review_date": "2019-08-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not only a commercial success, Hitch used his family of technicians - Robert Burks on camera, Bernard Herrmann soundtrack and George Tomasini cutting - to create one of cinema's greatest chase movies of all time.",
      "review_date": "2018-04-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is how they should make thrillers nowadays instead of the shoot em up style stuff, but really great, interesting story, which makes you think along throughout. One of the classics and I like that it had some unpredictability to it. MustThis is how they should make thrillers nowadays instead of the shoot em up style stuff, but really great, interesting story, which makes you think along throughout. One of the classics and I like that it had some unpredictability to it. Must watch if you are a fan of Hitchcock.",
      "review_date": "2018-02-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Cary Grant gets whisked away from his everyday life as an advertising executive into a complex and secretive world of lust, action and espionage.  All created before James Bond was a thing, at least on the big screen.",
      "review_date": "2018-02-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Hitchcock's risky and briskly adventure is the apt catalyst to this complex espionage thrillerNorth By Northwest\n\nHitchcock's risky and briskly adventure is the apt catalyst to this complex espionage thriller. As much as simply enthrallingHitchcock's risky and briskly adventure is the apt catalyst to this complex espionage thrillerNorth By NorthwestHitchcock's risky and briskly adventure is the apt catalyst to this complex espionage thriller. As much as simply enthralling its first half is, that follows a linear singular path collecting its plot points like a reward the film moves with ferocious pace and nail biting close calls. But the second half is the one with the real meat. Its complex and at times overstuffed characters with their own agendas and schemes does work since the man behind the camera is Hitchcock. He never lets the content go damp which often happens in such husky script. There is a sense of similarity in here to Polanski's Chinatown, starring Nicholson. And similar to it, the uncertainty is the key to its success.The makers are consistently revealing cards in order to keep the audience tangled in the whirls of these flips and turns that can be difficult to swallow. It is a mature script that always chooses over leaving the room with a cutthroat message rather than an explosion. The euphoric energy of the ping pong that the writers play of who is with whom theories, with Hitchcock's sharp execution it never wears off. Also, there is real ruggedness in here, the characters have the range to look elegant and also pull out the most sinister deed of all.Grant as the real victim proving his innocence isn't always in his A game, his performance isn't persistent in its tone. But what saves the day is both Saint's performance and her character, her alluring suave nature and guns blazing unflinchingly puts her on top of the list. Armed with a smart and meticulous adaptation, Hitchcock takes his time, he is milking out the best from each moment. North By Northwest is less Hitchcock-ish than usual, and it is certainly refreshing.",
      "review_date": "2018-12-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "While it doesn't quite reach Rear Window/Vertigo levels of greatness, there is still plenty to be enjoyed from this one. Its definitely more on the comedic side than most of Hitchcock's work, including some great dialogue, a hilarious auctionWhile it doesn't quite reach Rear Window/Vertigo levels of greatness, there is still plenty to be enjoyed from this one. Its definitely more on the comedic side than most of Hitchcock's work, including some great dialogue, a hilarious auction scene and my soft spot for unwilling protagonists. Add a couple of the most thrilling and iconic sequences in cinema at the middle and end of the film respectively and I'd say its a solid 9/10.Viewed 25/05/2018",
      "review_date": "2018-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ok, I'll be a hater. I didn't really care for it. I felt the story was too predictable and the pacing uneven. It was a rather boring watch for me and I had a hard time finishing it, let alone actually being interested in what I was watching.",
      "review_date": "2019-03-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Some romance scenes can look cliche but even so Hitchcock could make thriller as no one",
      "review_date": "2018-11-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "While it drags in the third act, \"North by Northwest\" is nevertheless a tense, thrilling and exciting thriller.",
      "review_date": "2020-01-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My favourite director, Alfred Hitchcock has directed many classics like Psycho, Rear Window and Vertigo, and I will say that this deserves to be up there among his best. I absolutely loved it! The best aspect of this movie is the alwaysMy favourite director, Alfred Hitchcock has directed many classics like Psycho, Rear Window and Vertigo, and I will say that this deserves to be up there among his best. I absolutely loved it! The best aspect of this movie is the always charming Cary Grant in a brooding and entertaining performance as Roger Thornhill, a man wanted for the murder of a diplomat. Solidly supporting him all the way are the lovely Eva Marie Saint as Eve Kendell and oily James Mason as the villainous Vandamme. They are further advantaged by some excellent camera-work and a wonderfully atmospheric music score. The script is focused and suspenseful, and Hitchcock's direction ensures the film rarely slips, even if some of the complicated plot does fly over people's heads. The climax though is simply the icing on the cake. Overall, a hugely enjoyable film, which I will give a 9.5/10. Bethany Cox",
      "review_date": "2022-03-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "North by Northwest is one of the first spy thrillers. North by Northwest is the protector of the genre, appeared before the first part about agent 007. The whole film is built on nervous suspense, which is difficult to see in modern films ofNorth by Northwest is one of the first spy thrillers. North by Northwest is the protector of the genre, appeared before the first part about agent 007. The whole film is built on nervous suspense, which is difficult to see in modern films of the genre. The disadvantages include only a long chronometer, due to which the dynamics of the narrative in the second half of the film subsides and the fact that the film was shot mainly in pavilions, and not in wildlife.",
      "review_date": "2022-04-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Another excellent film by Alfred Hitchcock.Personally, this is not one of my favorite Alfred Hitchcock films, although it is one of the most acclaimed and one of the most interesting. The script revolves around a confusion of identities,Another excellent film by Alfred Hitchcock.Personally, this is not one of my favorite Alfred Hitchcock films, although it is one of the most acclaimed and one of the most interesting. The script revolves around a confusion of identities, where an ordinary citizen is mistaken for a spy and ends up in a tremendous confusion with gigantic repercussions on his personal life and national security.The script is quite good and the story has no dead moments. It entertains the audience in a perfect way until the end and makes us curious to know what is really going on, curiosity being an important part of what keeps us stuck in the film (and one of the reasons I prefer to hardly talk about the plot). The main character, played by Cary Grant, was so well thought out that we quickly established an affective and sympathetic link with her, caring about what will happen to her. It goes without saying that, although the cast is very good, it is really Cary Grant who stands out here. Eva Marie Saint is good, but she never leaves the shadow of the male protagonist. Another actor that deserves a positive note is Martin Landau.Technically, it is an impeccable film, to the taste of director Hitchcock. It is full of symbolic scenes or with more than one meaning, some of them bordering on the dreamlike. Some of the scenes are truly striking, like those that were shot on Mount Rushmore. The camera and film work is excellent and cinematography perfectly harmonizes color, light, shadow and contrast, resulting in a visually elegant film, although with the characteristics of a film of its time, of course. The soundtrack is also quite good, as are the sets and costumes.",
      "review_date": "2020-08-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is a rollercoaster thriller. One of Hitchcock's best masterpiece.",
      "review_date": "2019-01-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis is a film with a fairly slow moving plot but its nevertheless quite intriguing. There's a definite sense of mystery present. There's the female character, Eve, who all but swoons for the main character, Roger Thornhill (its relatively cheesy at times, I think its fair to say) but of course its hardly a new film. I quite liked that what was really going on wasn't made clear from the get go - seeing things through Roger's eyes was quite intriguing. I could certainly understand his frustration, given the situations he found himself in. I liked that there had clearly been some thought put into the script and there were some instances of amusing and sharp-witted dialogue, such as when a ticket seller at a train starion asks if there's something wrong with his eyes (he's wearing sunglasses to conceal who he is) and he replies 'their sensitive to questions'.This film features a decent cast with Cary Grant as Roger and James Mason as Phillip Vandamm, among others. Plus there's the usual Hitchcock cameo at the very start of the film. If your a fan of mystery thrillers and/or Hitchcock films then yes, I would certainly recommend it.",
      "review_date": "2021-11-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "No one should miss this delightful film that showcases the best of the director and the leads.",
      "review_date": "2022-12-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the Hitchcock`s best greatest films.But there are still couple i consider  as better films than this one.",
      "review_date": "2020-05-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film noir portrait of corruption and morally-compromised obsessions stars Welles as Hank Quinlan, a crooked police chief who frames a Mexican youth as part of an intricate criminal plot. Charlton Heston plays an honorable MexicanThis film noir portrait of corruption and morally-compromised obsessions stars Welles as Hank Quinlan, a crooked police chief who frames a Mexican youth as part of an intricate criminal plot. Charlton Heston plays an honorable Mexican narcotics investigator who clashes with the bigoted Quinlan after probing into his dark past. A memorable",
      "review_date": "2022-09-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Absolutely thrilling and hilarious, one of the most entertaining films ever made.",
      "review_date": "2021-05-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Another Hitchcock masterpiece. Love the pace. Love the ending. Ahead of its time.",
      "review_date": "2021-11-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "007 made by Alfred Hitchcock if he ever made one. A thrilling ride that keeps you on the edge until the final.",
      "review_date": "2023-01-09",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 37,
  "genres": [
    "Action",
    "Adventure",
    "Mystery",
    "Thriller"
  ]
}