{
    "title": "Some Like It Hot",
    "rating": 8.3,
    "release_date": "1959-03-29",
    "genre": [
        "Comedy",
        "Romance"
    ],
    "summary": "When two male musicians witness a mob hit, they flee the state in an all-female band disguised as women, but further complications set in.",
    "critic_reviews": [
        "Wilder's 1959 comedy is one of the enduring treasures of the movies, a film of inspiration and meticulous craft, a movie that's about nothing but sex and yet pretends it's about crime and greed.",
        "Key to its success - along with its vivid characters and brilliant performances - is the snappy pace throughout. Non-stop gags, invention, twists and comic incident flow, as Joe and Jerry - sexy Curtis and screamingly funny Lemmon - elude mob boss George Raft by wriggling into an all-girl jazz band, with Josephine and Daphne’s legendary drag act taking in amorous adventures, seductive deceptions and madcap pursuits.",
        "Some Like It Hot, directed in masterly style by Billy Wilder, is probably the funniest picture of recent memory. It's a whacky, clever, farcical comedy that starts off like a firecracker and keeps on throwing off lively sparks till the very end.",
        "Reinvented by Wilder and co-screenwriter co-writer IAL Diamond, Some Like It Hot is effortlessly fluent, joyous and buoyant: a high-concept comedy that stays as high as a kite, while other comedies flag. \"Nobody's perfect\" is the last line. Wilder, Lemmon, Curtis and Monroe come pretty close.",
        "Some Like It Hot is another supersonic, breakneck, belly-laugh comedy that should be a block-busting bonanza at the box office. It should be a proof that when the making of pictures is taken out of the bands of men-of-measured-merriment and handed over to men whose only purpose is to create amusement, they are still the world's best means of entertainment. Billy Wilder, who produced, directed and wrote the screenplay, with I.A.L. Diamond, was on the front burner all the way.",
        "The funniest comedy I’ve seen in years. There aren’t many of the hundred and four minutes of running time that doesn’t find the audience laughing its head off at the antics of Jack Lemmon, Tony Curtis and Marilyn Monroe.",
        "Billy Wilder’s 1959 comedy is still perfect all these years later.",
        "But it’s the precision-tooled plot fashioned by Wilder and I.A.L. Diamond that holds it together, creating the perfect farcical playground. Brilliant performances, wondrous comic timing and the greatest pay-off line ever written: this one’s still red hot.",
        "In many ways, the ultimate Billy Wilder film, replete with breathless pacing, transvestite humor, and unflinching cynicism. Most of it is hilarious, but there is something disquieting in the way Wilder dances around his sexual theme—the film never really says what it's about, which might be just as well",
        "If Some Like It Hot isn’t the funniest movie ever made, you can’t blame it for not trying. The first time you see Billy Wilder’s 1959 farce, you might not believe that anything can make you laugh so hard for so long. Where most comedies wear out their audience after an hour and a half, “Some Like It Hot” goes on for 122 minutes and leaves you ebullient.",
        "SOME LIKE IT HOT expands a one-joke premise with hysterical results, due in no small part to the contributions of the near-perfect ensemble, with each of the major characters shining like a perfect jewel. Lemmon and Curtis are marvelous as the men-turned-women, creating believable characters and generally eschewing the lower forms of camp.",
        "If Billy Wilder achieved nothing else in his entire career, he would still rank as one of the great masters of cinema for pulling off this comic tour de force.",
        "Arguably the best cross-dressing comedy of all time, it's also one of director Billy Wilder's most fluid, vibrant, laugh-out-loud accomplishments, rife with zippy one-liners delivered in Lemmon's impeccable style, and a rakishly outrageous Cary Grant impersonation from Curtis. Monroe is at her gooey, blonde best here as the pouty, hard-drinking Sugar.",
        "A large part of what makes Some Like It Hot a perennial favorite is that it has the go-for-broke commitment of an early Marx brothers farce, but it's harnessed by a well-structured script that keeps building on itself. It's no fluke that the capper is the most famous closing line in movie history.",
        "As for that famous last line, “Well, nobody’s perfect,” it’s best left uncontextualized for those who haven’t seen it. It’s Hollywood’s subtlest moment of compassion, a wink and a hug at the same time, and the reason why the movie will always be immortal.",
        "Magnificently paced and terrifically funny at nearly every turn, Some Like It Hot was imbued with an inherent distrust of capitalism and big business that Wilder regularly expressed in an only slightly covert manner.",
        "Let's face it. Two hours is too long a time to harp on one joke. But Billy Wilder, who produced, directed and collaborated with I. A. L. Diamond on this breeziest of scripts, proves once again that he is as professional as anyone in Hollywood. Mr. Wilder, abetted by such equally proficient operatives as Marilyn Monroe, Jack Lemmon and Tony Curtis, surprisingly has developed a completely unbelievable plot into a broad farce in which authentically comic action vies with snappy and sophisticated dialogue.",
        "Lipsticked, mascaraed and tilting at a precarious angle (\"How do they walk in these things?\"), Actor Lemmon digs out most of the laughs in the script. As for Marilyn, she's been trimmer, slimmer and sexier in earlier pictures."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "I can see the appeal of this movie, especially for its time. It is well executed and the acting is great. Many of the comedic scenes are original and it is remains light throughout. However, it pains me to say I just did not find myself beingI can see the appeal of this movie, especially for its time. It is well executed and the acting is great. Many of the comedic scenes are original and it is remains light throughout. However, it pains me to say I just did not find myself being immersed or laughing very often, perhaps it was too light for my taste. Even comedies have a level of tension, suspense, character development, intended to pull you in, be invested at what is at stake, but I did not feel that here so much.",
            "review_date": "2020-03-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Fairly funny film with really good acting but men acting like women is only funny for so long.",
            "review_date": "2019-04-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A solid first third, a slow saggy second, and magnificent third reel. The cross-dressing comedy is a bit meh in the 21st century but the satire and heart is still relevant. Tony Curtis' comedy chops are great. Jack Lemmon hams it up as theA solid first third, a slow saggy second, and magnificent third reel. The cross-dressing comedy is a bit meh in the 21st century but the satire and heart is still relevant. Tony Curtis' comedy chops are great. Jack Lemmon hams it up as the role demands. Marilyn Monroe as \"Sugar\" is perfectly cast, and is a very likeable character.",
            "review_date": "2022-03-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Some people still say this is the greatest comedy ever made in Hollywood. Who am I to argue? Even after 45 years, it's still very funny and not the least bit dated. It is one of the true classics in the history of film.I know one thing:Some people still say this is the greatest comedy ever made in Hollywood. Who am I to argue? Even after 45 years, it's still very funny and not the least bit dated. It is one of the true classics in the history of film.I know one thing: Marilyn Monroe never looked hotter!The film is a wonderful combination of comedy, action, suspense and romance with great old-time gangster scenes played out first in Chicago and then in Miami Beach. George Raft and Nehimiah Persoff are just great as gangsters.The stars, though, are Monroe, Jack Lemmon and Tony Curtis but you can also enjoy performances from famous known actors like Pat O'Brien and Joe E. Brown. The action scenes are in the beginning and end. In the middle, the bulk of the film, is the main story featuring comedy and romance. Lemmon has the best lines in the film and his facial expressions alone evoke lots of laughter.This film is so famous that there is no need going into detail, but for some younger person reading this, don't worry about this being an old-fashioned, boring black-and-white film your parents or grandparents liked but you would find boring. You'll have fun watching this, too, I guarantee it.",
            "review_date": "2017-09-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Omgosh...i am shocked how good this movie is. Its 2020 and this movie is NOT out dated at all. The acting and writing is so good, so natural. Jack Lemon is halarious, so many funny scenes....Tony Curtis is wonderful and he was HOT. TheOmgosh...i am shocked how good this movie is. Its 2020 and this movie is NOT out dated at all. The acting and writing is so good, so natural. Jack Lemon is halarious, so many funny scenes....Tony Curtis is wonderful and he was HOT. The dancing scene he has with Joe e Brown was cracking me up i had to keep rewinding it to see it again. I hope younger generation watches this movie. Its incredible. Gotta say i dont love Merylin Monroe, she is over acting and just not believable. But who cares Jack Lemon is Brilliant!",
            "review_date": "2020-01-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Some Like It Hot can be attributed to an immortal film. It will be relevant in the future, time does not affect it in any way. It looks on one sigh, the plot is simple and light. Acting is great. Yes, the black and white picture even goes toSome Like It Hot can be attributed to an immortal film. It will be relevant in the future, time does not affect it in any way. It looks on one sigh, the plot is simple and light. Acting is great. Yes, the black and white picture even goes to the artistic style of the film, although in 1959 almost everyone was shot on color film. Great comedy about easy love.",
            "review_date": "2021-05-10",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Some Like It Hot. Funny men in dresses. A truly comedic classic in which everything is perfect. 20's Gangster vibes, amazing music and I Wanna Be Loved by You.",
            "review_date": "2021-02-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "refresh my memory..Some Like It Hot\n\nThe comic sequences aren't just some hocus pocus but contains some concrete material that has witty humor and amusing characters that focuses on the crisp of it and not some lame one liners or doublerefresh my memory..Some Like It HotThe comic sequences aren't just some hocus pocus but contains some concrete material that has witty humor and amusing characters that focuses on the crisp of it and not some lame one liners or double entandre. I.A.L. Diamond and Billy Wilder; the screen writers, adapted the raw concept smartly and projected it onto various conversations that draws out laughs; especially the \"train\" sequence. Billy Wilder's brilliant execution is the key that helps keeping it to the ground and practical despite of having some sketchy scenes in it. Jack Lemmon and Tony Curtis are flat out hilarious in their parallel roles and are supported thoroughly by Marilyn Monroe. Some Like It Hot defines and preaches others on how to create such genre feature and that is by focusing onto its lead characters that should and does go in here the journey that is full of chaos and bold but still never leaves the fun out of it.",
            "review_date": "2018-05-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I watched this film at the age of 14-15, I liked it very much and wanted to watch it again and it was as nice as I remember.I think we laughed so much that almost everyone would be happy to watch this movie.Jack Lemmon fascinates you withI watched this film at the age of 14-15, I liked it very much and wanted to watch it again and it was as nice as I remember.I think we laughed so much that almost everyone would be happy to watch this movie.Jack Lemmon fascinates you with his acting really he plays the role and makes us feel it was one of the best acting I've seenMy favorite and most laughing scene was the dance scene of jack lemmon and Joe E.Brown duo,is probably one of the best scenes in the history of cinema.would definitely recommend to everyone.wonderful movie a masterpiece.but of course there are some bad aspects of ridiculous scenes, but you don't wear them too much.",
            "review_date": "2018-12-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a classic comedy film which I admit I'd never seen before but I'm glad I did, as I found it very amusing, quirky and I was glad it wasn't choc full of toilet/sex related humour, like a lot of modern 'comedies' have (there are mildThis is a classic comedy film which I admit I'd never seen before but I'm glad I did, as I found it very amusing, quirky and I was glad it wasn't choc full of toilet/sex related humour, like a lot of modern 'comedies' have (there are mild innuendos but nothing especially graphic). I liked the visual slapstick comedy element and I thought that the two main characters, Joe and Jerry played by Tony Curtis and Jack Lemmon respectively, did well in playing their parts, trying to keep their proverbial head above water while a number of different issues arise.Its all quite harmless and entertaining, with a nice soundtrack for the time it was made I suppose. Its certainly an easy watch and with solid performances and quite a number of laughs, its well worth a watch.",
            "review_date": "2021-11-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Ridiculous plot, but very enjoyable nonetheless.'Some Like It Hot' is good, unserious fun. Tony Curtis (Joe) and Jack Lemmon (Jerry) are the stars of the show, with amusing performances from start-to-finish. Marilyn Monroe is pleasant too,Ridiculous plot, but very enjoyable nonetheless.'Some Like It Hot' is good, unserious fun. Tony Curtis (Joe) and Jack Lemmon (Jerry) are the stars of the show, with amusing performances from start-to-finish. Marilyn Monroe is pleasant too, this is actually the first film of Monroe's I've seen. A good'un!The pacing isn't perfect but that doesn't hamper things at all really. It's a bonkers 122 minutes, filled with entertaining shenanigans - the ending is particularly wacky. Don't think I would've liked it as well without Curtis & Lemmon, admittedly.Worth watching, without question.",
            "review_date": "2021-01-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Although not all the jokes have aged well its a funny film. I also whacked it a lot waist growing up so I'm quite attached to it. its a great film that everyone should see.",
            "review_date": "2020-06-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A genuine joy to watch, can’t be missed! The vast majority of the humor is as hilarious today as it was then. Jack Lemmon is a treat, Tony Curtis was acting perfection, Marlyn Monroe was magical, and Joe E Brown delivered the greatest endingA genuine joy to watch, can’t be missed! The vast majority of the humor is as hilarious today as it was then. Jack Lemmon is a treat, Tony Curtis was acting perfection, Marlyn Monroe was magical, and Joe E Brown delivered the greatest ending line of all time!",
            "review_date": "2020-09-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A great movie and one of the best comedies in history, a very heartwarming and great story",
            "review_date": "2020-11-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "“Some like it hot” (1959) is a romantic comedy. It was written and directed by Billy Wilder, who was also the producer of the movie. The actors who played their roles are Marilyn Monroe, Tony Curtis, and Jack Lemmon among others. The jazz“Some like it hot” (1959) is a romantic comedy. It was written and directed by Billy Wilder, who was also the producer of the movie. The actors who played their roles are Marilyn Monroe, Tony Curtis, and Jack Lemmon among others. The jazz saxophone player and the jazz double bass player, whose names are Joe and Jerry, trying to escape from some gangsters. They dress as women and with an all-female band go to Florida by train. “Some like it hot” won three Golden Globe Awards: Best Actor in a Motion Picture for Jack Lemmon, Best Actress in a Motion Picture for Marilyn Monroe and Best Motion Picture. This movie is extremely enjoyable. It gives many positive vibes.Written by Anastasiia Shystovska",
            "review_date": "2021-03-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Great comedy. Monroe is great and gorgeus, Curtis is incredible portraying 3 different personalities and Lemmon's performance can't be any funnier.",
            "review_date": "2021-08-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This was thoroughly entertaining and well done start to finish. Honestly no notes. Felt like a fresh take on a style of movie that has been done a lot, but it was definitely the originator I think.",
            "review_date": "2023-02-07",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 36
}