{
  "title": "Bhaag Milkha Bhaag",
  "rating": 9.4,
  "release_date": "2013-07-12",
  "genre": [
    "Biography",
    "Drama",
    "History",
    "Sport"
  ],
  "summary": "The true story of world champion runner and Olympian Milkha Singh, the \"Flying Sikh\", who overcame the massacre of his family, civil war during the India-Pakistan partition, and homelessness to become one of India's most iconic athletes.",
  "critic_reviews": [
    "Along the way the movie strikes its chosen couple of notes resoundingly, making clear what makes Singh run.",
    "Often an engrossing example of the sweeping, stirring biography."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Who said life could ever be easy for those who aspire to fly higher than the rest? The beautiful irony of Milkha Singh's life that this consummate biopic captures so ably, is that he really didn't aspire to anything. He ran simply because heWho said life could ever be easy for those who aspire to fly higher than the rest? The beautiful irony of Milkha Singh's life that this consummate biopic captures so ably, is that he really didn't aspire to anything. He ran simply because he had to. History is created in several ways. One of them is cinema. And if Rakeysh Omprakash Mehra's Bhaag Milkha Bhaag seems like a near-flawless homage to the flying spirit of India's greatest runner, it is partly because the story, so nimbly woven into a pastiche of drama, emotion, humour and pathos by Prasoon Joshi, is in no hurry to keep pace with the onscreen Milkha's breathless sprint. The story of super-sprinter Milkha Singh unfolds in this exceptional biopic at its own volition. There's no effort here \"to tell a story\", to create an impression or to whip up a dramatic storm to captivate audiences. The synergy in the storytelling seems subliminal. Still, we the audience, fed week after week on mediocrity masquerading as cinema, are riveted to the story of Milkha Singh for over three hours of playing time. How come? Well, to begin with it is Milkha Singh's own powerful life as India's superstar sportsperson that sweeps us into the biopic. Milkha was so poor he couldn't afford running shoes, and when he got them, he didn't know how to run in them. When milk was offered in the army in exchange of running practice, he grabbed it (the run and the milk) with both hands. A victim of India's brutal partition, Milkha's story was waiting to be told. And thankfully, no one before Mehra saw cinematic potential in his story. If Milkha's story had to be told, the storyteller had to be a master craftsman, and one who doesn't waste space in self-congratulatory flourishes. With immense help from Prasoon Joshi, Mehra harnesses Milkha's life-story into an experience that is pure cinema and yet undiluted and uncompromised by the mandatory, often silly, illogical and idiotic semantics of mainstream commercial cinema. The absolutely seamless editing by P. Bharathi is impressive. The film is very stylishly cut, but not at the cost of losing the simplicity and the innate ascetism of the sportsman-hero. And yes, there are songs composed by Shankar-Ehsaan-Loy, but they are so effortlessly woven into Milkha's saga that we don't see them as \"song breaks\". This is as good a time as any to tell you that Farhan Akhtar does the Bhangra as well as any Punjabi. Actually, he doesn't dance. He just flows with the rhythm. I've never seen any actor dance with such rhapsodic abundance. Neither have I seen any actor run like Farhan. I don't know how fast Milka ran, but Farhan's Milkha doesn't fake it for even a second. When he runs, he really runs. When he stumbles and takes a fall, we flinch and wince in our seats. Farhan's body language and emotions and expression as Milkha is pitch-perfect.\rFarhan doesn't 'play' Milkha. The actor occupies Milkha's mind, body and soul. There are episodes in this astonishingly, well-structured biopic where Farhan's oneness with Milkha equals Ben Kingsley's empathy with Mahatma Gandhi in \"Gandhi\".\rThis isn't just a film about a sports person who brought untold glory to our country. Bhaag Milkha Bhaag is the story of an individual's journey from nullity to pinnacles of success in a world where politics and violence are constant reminders of how little an individual's aspirations matter in the larger, often murkier scheme.\rIn Prasoon Joshi's interpretation of Milkha's amazing success-story, yearning is the cornerstone to achievement. In 1947, when India became two nations, we see little Milkha (Jabtej Singh) run for his life to escape the savage butchery that snatches away almost his entire family. Only his dear sister, played wonderfully by Divya Dutta, remains. As we see it, Milkha never stopped running since the partition trauma.\rThe 'run' as a metaphor of life's expedient circumstances, runs through the narrative.\rHappily, the screen time is as much taken up with Milkha's record-breaking achievements on the field, as it is with vignettes from his personal life. There is a robust heartwarming romance between Milkha and the vessel-friendly 'kudi' Biro (Sonam Kapoor, looking prettier than ever). The writer and director invest inexpressible warmth in the protagonist's courtship scenes. We've seen this kind of love blossom on Punjab's soil before. But it still feels special and unique.\rFarhan does the rest. And he gets tremendous support from other actors, specially Divya Dutta, who is incomparably sincere in her role. Pavan Malhotra as Milkha's coach is as usual, first-rate.\rUnlike other period films in recent times which have conveniently and lazily resorted to antiques, artefacts and vintage songs, the 1950s in Bhaag Milkha Bhaag simply and effortlessly emerges from the character and his milieu.",
      "review_date": "2013-07-12"
    },
    {
      "review_title": null,
      "content": "BHAAG MILKHA BHAAG is outstanding!\rAfter a long time I saw a biopic like this and it inspired me a lot.\rLot to say but the reviwer before me very well expressed evrything.\r100% agreed.",
      "review_date": "2013-08-26"
    }
  ],
  "num_reviews": 4
}