{
  "title": "Captain Phillips",
  "rating": 8.1,
  "release_date": "2013-10-11",
  "summary": "The true story of Captain Richard Phillips and the 2009 hijacking by Somali pirates of the US-flagged MV Maersk Alabama, the first American cargo ship to be hijacked in two hundred years.",
  "critic_reviews": [
    "The piercingly realistic Captain Phillips will exceed your expectations.",
    "Captain Phillips is such an impressive dramatic achievement that it comes as a shock when it gets even better, during a devastating final scene in which Hanks single-handedly dismantles Hollywood notions of macho heroism in one shattering, virtually wordless sequence.",
    "Captain Phillips, a movie that insistently closes the distance between us and them, has a vital moral immediacy.",
    "Captain Phillips is harrowing, inspiring, a must-see piece of moviemaking.",
    "Even as Greengrass’ signature kinetic style renders us nearly seasick and emotionally spent from the action, it’s the work of Tom Hanks that makes this film unforgettable.",
    "This is an intense and complicated story, and the film doesn't rush it. It lets it unfold and build, methodically.",
    "As we bounce over rough seas on the Maersk, we know just what will be lost if the Somalis don’t keep their trembling fingers off their triggers. As the title suggests, this is not a movie about an incident: It’s a movie about a man who stays very real to us.",
    "At this point in his celebrated career, there shouldn't be much new that Hanks can show us. But there is, as the actor reaches deep inside to express the relief of dodging death as I've never seen it played before. He's in shock; we're awed.",
    "Both Greengrass and Hanks are on award-deserving form in a riveting, emotionally complex and hugely intelligent dramatisation of a real-life ordeal.",
    "It falls to Hanks and his movie-star presence to anchor this ambitious enterprise, and he does some of his most impressive acting without saying a word.",
    "The most gripping based-on-fact film so far this year.",
    "It’s a breathlessly told movie; both meticulous and frenetic, sweat-soaked and methodical. It will take hold and won’t let you go, and it’s one of the most engaging movies of the year.",
    "The pressure cooker atmosphere builds for almost too long, but when the resolution finally occurs, the sense of relief is that much more palpable.",
    "Hanks and Abdi are so compellingly matched that unlike with most thrillers, it won't be the action climax in Captain Phillips that'll stick with you. It'll be that aftermath, which gets at the emotional toll of terrorism in a way few movies have.",
    "Captain Phillips could have stopped at simply depicting what happened; it’s the steps it takes to examining why it happened that make it extraordinary.",
    "With Captain Phillips we get a viable thriller whose conclusion is already known, and a character who reacts to circumstances rather than a personal, heroic code. And now, it’s a story preserved in brine.",
    "While this is arguably Greengrass’ best film, it’s almost certainly his most urgent.",
    "It might have all been another Hollywood-formula flick with American might taking on the alien other. But Greengrass gives Phillips and Muse the time, aboard a covered lifeboat, to discover shared beliefs and fears.",
    "The climactic rescue by Navy SEALs is riveting. But it's Phillips' devastating after-the-fact shock that leaves the most haunting impression in this ambitious, taut and captivating thriller.",
    "Despite the obvious mismatches involved, this isn’t a simplistic smackdown. Freighted with weighty issues, Captain Phillips is a film worth debating.",
    "Captain Phillips manages to expose us to a few things that are unusual in a thriller, including sympathy for the enemy and, in Hanks’s performance, the frailty that is the other side of heroism.",
    "In Captain Phillips, director Paul Greengrass pulls off the same remarkable feat he accomplished with \"United 93\": He takes a true story in which the outcome is already known and transforms it into a gripping, wrenching, devastating thriller.",
    "Director Paul Greengrass creates an aura of urgency so compelling, so rooted in detail, that we temporarily forget what we know and hold our breaths for two-plus hours of tightening suspense.",
    "Mr. Hanks, in yet another in a long line of diverse character studies, does a beautiful job as the voice of reason and logic, trying to inspire bravery and maintain order amid the noise and panic. In the big emotional scenes, as well as the small, nerve-jangling scenes, he is an artist at the top of his skill.",
    "Captain Phillips works precisely because Hanks isn't a muscle-bound, gun-toting figure (nor does he turn into one during the course of the movie). Placed in an untenable position, he uses guile and intelligence instead of brawn and weapons to enhance his survival chances.",
    "The performances and Greengrass’s way with action immerse us and make Captain Phillips a tight, taut,edge of your seat thriller even if you remember the ending.",
    "Greengrass is an expert hijacker, too. He hijacks our good sense.",
    "A great many filmmakers — too many — use handheld cameras to evoke a sensation of raw, this is really happening immediacy. But director Paul Greengrass is unique. At a glance, his live-wire, ragged-camera method may seem overly familiar, but the way he employs it, that method is as expressive as the style of a superb novelist.",
    "Squeezing every drop of tension from wet-ink recent history, Phillips only falters when making its protagonists mouthpieces in a broader geopolitical debate. Otherwise, it’s full steam ahead to the Oscars.",
    "Captain Phillips is a voyage well-worth taking.",
    "This a quasi-war movie set in peacetime; these men are fighting to the death, but not for nation or principle or ideology — or at least, not a conscious ideology: they are caught in larger economic currents.",
    "The surprise is that Captain Phillips is a surprise in the first place, pitching and rolling tirelessly like the sea on which it is set and, in the process, becoming one of the most enjoyable and well-made movies to hit theaters this year.",
    "Captain Phillips is a triumph of solid, professional and sometimes inspired film crafts, deserving of all the plaudits that come its way.",
    "The film rips right along and never relinquishes its grip.",
    "It's one of the most emotionally draining climaxes of the year.",
    "It is, however, just about perfect in its wrenching emotion, expressed by an actor clearly up to the challenge of acting in a Paul Greengrass docudrama — which is to say, acting with as little capital-A Acting as possible.",
    "More often that not, however, Captain Phillips is riveting. Though he remains unfortunately convinced that violently shaking his camera is the best way to achieve visual urgency, Greengrass nevertheless excels at pressure-cooker scenarios.",
    "It's hard to imagine Captain Phillips in the hands of any other filmmaker -- and Captain Phillips in the hands of Greengrass looks exactly like anyone familiar with his work would expect. It does justice to the material even while playing too conscientiously by the book.",
    "And then comes that transcendent last scene, in which the man whose side we’ve barely left during this incredible ordeal is suddenly revealed as the best kind of hero, not super at all but ordinary and vulnerable and human.",
    "The film succeeds on its own terms — an exciting entertainment that makes us feel good about the outcome, and about the reach of American power, rather than its limits. Yet the narrative container is far from full. There isn't enough incident or complexity to sustain the entire length of this elaborately produced star vehicle.",
    "Even if Captain Phillips treads into some ideologically rough waters, there's one thing that's hard to find fault with: Hanks gives a performance that goes from good (through the first 124 minutes) to extraordinary (in the last 10).",
    "It’s when the Somalis spirit Phillips away in a closed lifeboat that Captain Phillips becomes a great thriller, in part because Barry Ackroyd’s camera is stuck inside with the characters and its jitters finally seem earned.",
    "It works too hard to keep matters on an even, we're-all-more-alike-than-different keel, which is just one part of its chief problem of forcefully conveying information and intent.",
    "Hanks has a wonderful scene, late in the film, that shows a strong man collapsing into frailty. It hints at the emotional depth the movie might have plundered. The rest of Captain Phillips must rely for its drive on the relentless mechanical agitation of Henry Jackman’s score. It can’t save an overly muscled docudrama that is more pounding that truly gripping.",
    "Director Paul Greengrass remains a genius of claustrophobia, yet his better films — \"Bloody Sunday,\" \"United 93\" and \"The Bourne Ultimatum\" — all beat with a stronger sense of central identification. He doesn’t have as much to work with this time, and his solution is to slow down the pace. The result is more clarity, but also more monotony.",
    "Why, then, do we not feel bullied by the result? Partly because the camera, as I say, tells a subtler tale than the dialogue does, and lures us into a grudging respect for the bravado of Muse and his men; but mainly because of Tom Hanks. This most likable of actors deliberately presents us with a character who makes no effort to be liked.",
    "Not far below the surface Captain Phillips is also an unpleasant and uncomfortable experience, a film that’s not entirely happy with itself.",
    "There is something too dry and austere about Greengrass and Ray’s telescoped vision, which touches only fleetingly on the pirates’ motives, the suffering of the Somali people and the collateral damage of global capitalism."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Captain Philips keeps you on the edge of your seat! You think it's intense when the pirates board the ship, but it takes you to a whole new level later on.  I could not look away for a second.  Tom Hanks delivers a breathtaking performanceCaptain Philips keeps you on the edge of your seat! You think it's intense when the pirates board the ship, but it takes you to a whole new level later on.  I could not look away for a second.  Tom Hanks delivers a breathtaking performance worthy of an Oscar nomination and possibly an Oscar.  One of the best films I've seen this year.  Captain Philips will make you rethink your ratings for other movies!",
      "review_date": "2013-10-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "CAPTAIN PHILLIPS is a perfect film. There is not one extraneous moment, one shot that is not needed, no scene too long or short, and every performance is insightful. Running over 2 hours, CAPTAIN PHILLIPS never feels long and director PaulCAPTAIN PHILLIPS is a perfect film. There is not one extraneous moment, one shot that is not needed, no scene too long or short, and every performance is insightful. Running over 2 hours, CAPTAIN PHILLIPS never feels long and director Paul Greengrass keeps you on the edge of your seat without ever exploiting the situation or going for easy thrills. This is adult Hollywood filmmaking at its finest. And the ending is sublime. The best moment in a very very good film. But is it possible to be too perfect? Yes! CAPTAIN PHILLIPS lacks the insight, depth or commentary that would really take it into the stratosphere.",
      "review_date": "2013-10-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Maybe in America, maybe in America\", says Somalian pirate leader Muse; when Captain Phillips asks if there isn’t more to their lives than fishing and kidnapping people. Such an exchange highlights the desperation of the underdeveloped, but\"Maybe in America, maybe in America\", says Somalian pirate leader Muse; when Captain Phillips asks if there isn’t more to their lives than fishing and kidnapping people. Such an exchange highlights the desperation of the underdeveloped, but does that make their actions justifiable? Such nuances are key in 'Captain Phillips', Paul Greengrass' new film about a group of Somalian pirates who hijack a container ship off the horn of Africa and hold the ship's captain hostage. I must commend screenwriter, Billy Ray, for not only blueprinting the details of this docu-drama but also creating a great character in Capt. Richard Phillips and giving humanity to the four antagonists; who were far more than just \"The Pirates\". With this, Tom Hanks is able to give his finest performance in over a decade as the genuine Capt. Phillips; and newcomer Barkhad Abdi is able to stand toe-to-toe with him; as Muse. This movie kept me on the edge of my seat the entire time. Paul Greengrass has built his career around procedural film making; relying on blunt realism and sharp kinetic thrills. He's in very fine form this time around, doing his best work since 'United 93'. Being ripped straight from the headlines; many may already know how it will all end (albeit, not in such grimy details); but that doesn't seem to matter. Greengrass and his usual editor of choice, Christopher Rouse, know how to construct the adrenaline induced action, the poignancy of the drama and the intensity of the thrills to great effect! “Captain Phillips” was a smart, effective and riveting film; and what else can I say, it was very well made.",
      "review_date": "2013-12-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A terrific film that is well paced with many edge of your seat moments.  Tom Hanks gives a fantastic performance that allows you to feel what a real life situation for a captain is like. A",
      "review_date": "2013-10-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best of the year with great performance by Tom Hanks, particularly the last few minutes of the film, and by the Somolian actor who played \"muse.\"  The technical details of a large cargo ship, the work of the Navy, including theOne of the best of the year with great performance by Tom Hanks, particularly the last few minutes of the film, and by the Somolian actor who played \"muse.\"  The technical details of a large cargo ship, the work of the Navy, including the Seals, and the rescue operations were well and realistically done.  A few critics complained about the opening 5 minutes when Hanks leaves his Vermont home and with wife goes to board his ship.  This small bit added nicely to the film, rather than detracted.",
      "review_date": "2013-10-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Captain Phillips is brilliantly acted and incredibly tense. It features one of Tom Hanks' finest performances and Paul Greengrass at his best behind the camera.",
      "review_date": "2014-11-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie was extremely well done with fantastic acting, solid pacing, and very engaging story. Tom Hanks is amazing as usual. No complaints. It is long but does not drag and there are some cool military scenes near the end. Highly recommend.",
      "review_date": "2013-10-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Finally, a truly great movie with perhaps \"The Prisoner\" the only other drama worth seeing in a year of stunning failures.    \"Captain Phillips\" is brilliant, and based on a true story I remember from 2009.    Of course, Tom Hanks is theFinally, a truly great movie with perhaps \"The Prisoner\" the only other drama worth seeing in a year of stunning failures.    \"Captain Phillips\" is brilliant, and based on a true story I remember from 2009.    Of course, Tom Hanks is the catalyst here, and once again shows the movie world why he is the greatest living actor today, although Joseph Gordon-Levitt will be a major force to reckon with  if he isn't already, and the great Jennifer Lawrence, probably the best actress out there, will be out in the \"Hunger Games\" sequel \"Catching Fire\" and a new movie with Bradley Cooper later.\rThe key to Hanks' greatness is his believability.    Regardless of his role, he can assimilate anything, making us really think he is what his role says he is.    Nobody could possibly have pulled off \"Forrest Gump\" or \"Saving Private Ryan\" except him.    Now, as a captain of a cargo vessel bound from Oman to Somalia, his ship is taken over by a bunch of unbelievably scraggly pirates, who all deserve praise for their authentic portrayals as well.\rI must ask  is the lead pirate called \"Mule\" an authentic Somalian who Hollywood rescued for this role?    If not, it's shocking how well they did making him especially gruesome and emaciated, almost making the viewer understand how starvation and the brutal regimes controlling that part of the world force people into desperate situations.\rWithout giving up the plot, which is predictable because it was a well covered news story, we see the workings of a cargo ship, the Navy SEALS and the plight of Phillips with alarming accuracy and not a shred of doubt.\rIt is my favorite movie of the year, and perhaps the most moving part is at the end of the film, with Phillips safely in sick bay, and suffering the hysteria of the ordeal as a Navy Corpswoman looks him over.    No silly ass tough guy theatrics here  his reaction is just what normal people would do, not make lame jokes like a Mark Wahlberg film.    In that briefest of times, Hanks puts himself in the top running for an Oscar, and makes you almost cry.    All hail Tom Hanks and the crew who put this masterpiece together.",
      "review_date": "2013-10-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Captain Phillips is a riveting, gripping, edge-of-your-seat thriller that doesn't let up on any level of suspense or emotion. Tom Hanks delivers one of his best performances in recent years, maybe ever, and definitely deserves an Oscar nodCaptain Phillips is a riveting, gripping, edge-of-your-seat thriller that doesn't let up on any level of suspense or emotion. Tom Hanks delivers one of his best performances in recent years, maybe ever, and definitely deserves an Oscar nod for it. The Somali pirates don't have a long filmography, but still delivered realistic and accurate performances. If you think what you've seen all of the what the movie has to offer in the trailers, you've got another thing coming. One of the best films of the year.",
      "review_date": "2013-11-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nNot for nothing are Americans accused of being \"isolationists\", men and women who willfully choose to live out of context with a world they deem insignificant and beside the point. Even in this post-9/11 era, stubbornly, Americans still believe they can live in a bubble, despite the pop heard around the world. Captain Phillips, however, serves as a sort of reorientation to the lessons we learned, albeit briefly, and then forgot, in regard to our blow-by-blow synchronous apposition with other nations as always having been a persistent reality, independent of public cognizance or lack thereof. Days after Islamic fundamentalists irrevocably transformed the Manhattan landscape, we asked ourselves aloud, \"Why do they hate us?\" The short answer: colonialism. And our collective forgetting. A film such as The Life Aquatic with Steve Zissou makes no apologies, or even, mention, about our bloody past. In the 2003 Wes Anderson film, the pirates who attack the Belafonte are Filipino, marauders with a century-old grievance, but because the narrative is ideologically naive, the specificity of their ethnicity is treated as a post-colonial joke. The fact that the American occupation set the Philippine Islands on a path towards catastrophic poverty, in which over 200,000 natives died(mostly from cholera) is not important. Nobody mourns the murdered southeastern pirate that Zissou guns down. The captain's revenge against the jaguar shark takes precedence over the more justifiable revenge. Interestingly enough, genre differences aside, the Danish import, A Hijacking, like the Anderson film, also sees the pirates purely as villains. We either laugh at them, or hate them, but we never understand these Third World ruffians.That's not fair. That's not telling the whole story. Captain Phillips, on the other hand, to its credit, shows both sides. At the outset, the filmmaker juxtaposes Muse's struggle for survival in arid Somalia with the captain's whiny middle-class Boston angst. The pirates, for some, become less villains than anti-heroes. According to Muse, the hijacking is just business, differentiating his organization's agenda from Al-Qaeda, when he first threatens Phillips at gunpoint. Muslim or no Muslim, it makes no difference. He doesn't understand that many Americans, even a decent man such as Richard Phillips, see dark-skinned foreigners as one monolithic race, especially to the navy that kills them all. Muse is simply the \"other\", not Somalian. Because thirteen years after the World Trade Center came crumbling down, reduced to rubble by Taliban anti-pilots, many people still live in a vacuum, still possess a blind faith towards our government, who propagandizes the very nature of its tyrannical foreign policy with doublespeak sugarcoating, using catchwords such as \"liberation\" and \"freedom\". Very subtly, the filmmaker evokes the history of Africa's colonization, in which Captain Phillips, presides over a map of the \"dark continent\"; his hands draped over the shipping route, connoting a sense of entitlement, as the co-captain plots their course from Salalah to the Somali Basin. Unilateral to the main narrative, through its subtext, the film concedes that Muse's people, as well as the whole world, have a case to express their anger with militant force against the United States. Ironically, like the Filipino restaurant workers gathered around the kitchen television, learning about the international currency that Zissou stores away on-board his ship, the Somalian pirates too are only thinking about the money, not the historical circumstances that landed them in the third world ghetto. But in the lifeboat, Muse's cohort, Bilal, despite his limited grasp of the English language, senses the captain's arrogance, as America's colonial past rolls off Phillips' tongue, when he tells Muse how Somalian waters are \"international waters\", which is analogous to saying that Liberia, albeit populated with Liberians, once belonged to the United States, who colonized the West African country in the 19th century. Phillips is silent, indifferent to the pirate's remonstrative explanation that \"the big ships\" leave nothing left for them to fish. Whereas the filmmaker understands that the pirate attack on a cargo vessel like the Maersk serves as a last resort to stave off poverty, the captain, as well as the audience, disregards the underlying causes of the conflict at hand.\"You're not a fisherman,\" hisses Phillips, when Muse points a gun at his temple. He, alas, forgets that his country plays a hand in hurting the local economy. Once again, the U.S. plays the innocent victim. As if 9/11 never happened, the captain, with appalling ignorance, ask Muse, \"There's got to be something other than being a fisherman and kidnapping people?\" Maybe, in the final scene, the captain recognizes that the collateral blood on him isn't merely literal. After all, there are no heroes in Captain Phillips.",
      "review_date": "2014-06-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "So overall I enjoyed Captain Phillips and it is one of the better films of the year. Good acting, engaging film, and nice cinematography. If you can get past its somewhat lengthy running time and shaky cam & close-ups I think you’ll enjoy the film.",
      "review_date": "2013-10-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Captain Phillips takes you into the emotional breakdown, playing well with the stress of a wonderful script, Tom Hanks deserves Oscar nomination for this role, you should also consider sound, editing, photography, script, editing, direction,Captain Phillips takes you into the emotional breakdown, playing well with the stress of a wonderful script, Tom Hanks deserves Oscar nomination for this role, you should also consider sound, editing, photography, script, editing, direction, and without doubt award for best film.",
      "review_date": "2013-12-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It starts off incredibly slow, but when things pick up shortly later the movie does not let up. It is constantly one of the most intense movies I have ever seen. I was always on the edge of my seat and constantly unsure of how things wouldIt starts off incredibly slow, but when things pick up shortly later the movie does not let up. It is constantly one of the most intense movies I have ever seen. I was always on the edge of my seat and constantly unsure of how things would turn out next. Tom Hanks is amazing here, but honestly it's Tom Hanks so that's what you would expect of him. The rest of the cast is also astounding. Just the way the main villain is interpreted made me feel sort of sorry for him. The movie feels real and human, which is made extra important because this is based off of a true story. This is an absolutely amazing movie and one that I HIGHLY recommend you watch ASAP. I give it a score of 9/10-Amazing.",
      "review_date": "2014-03-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was both entertaining and thought provoking. My family was talking about it well after the movie was over and that is almost always a sign it was very good. Even the most critical eye theoretically would call this movie good orThis movie was both entertaining and thought provoking. My family was talking about it well after the movie was over and that is almost always a sign it was very good. Even the most critical eye theoretically would call this movie good or very good. The few going negative on it either didn't actually see it or might be trolling.",
      "review_date": "2013-10-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "With a director like Paul Greengrass and a leading actor like Tom Hanks you can expect some action and drama. And it is delivered as expected.\r This movie is based on real events, the hijacking of a huge cargo ship Maersk Alabama by SomaliWith a director like Paul Greengrass and a leading actor like Tom Hanks you can expect some action and drama. And it is delivered as expected.\r This movie is based on real events, the hijacking of a huge cargo ship Maersk Alabama by Somali pirates in 2009.\r Many people question the historical accuracy of the script. I am not going to comment on it. The movie itself is extremely tense and well made.\rMaybe the music is at times a bit too \"dramatic\" to my liking. But performance is solid across the board, and Tom Hanks once again demonstrated that he is one of the very best. I am confident he will be nominated for Oscar and very well may win it (for the third time).",
      "review_date": "2013-10-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Captain Phillips is an absolute must see film! A stellar performance by the acting god that is Tom Hanks under the direction of the ever dependable Paul Greengrass makes for a highly watchable film. One of the best films you will see forCaptain Phillips is an absolute must see film! A stellar performance by the acting god that is Tom Hanks under the direction of the ever dependable Paul Greengrass makes for a highly watchable film. One of the best films you will see for sure. It doesn't disappoint! Based on a true story, Captain Phillips (Hanks) takes command of the MV Alabama under orders to sail it's cargo through the Gulf of Aden to Mumbasa. However, during their journey, Somali pirates board the ship and take him hostage. From their Greengrass excels in doing what he does best. Delivering a suspensful and incredibly tense experience  that will have on the edge of your seats wondering what waits round every corner. Barkhad Abdi's portrayal as the pirate leader Abduwali Muse was wonderful. But as the film heralds towards it's conclusions it's all about Tom Hanks. His performance is undoubtedly an Oscar worthy and he excels and steers the film over the finish line. The film exceeded all expectations I had, but then again it shouldn't have. Paul Greengrass has an impeccable track-record and Tom Hanks never lets you down, he's Hollywood gold! One of the films of the year. Definitely a must see!",
      "review_date": "2013-10-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Excellent and uncomfortably enjoyable. An initial sketch (not gratuitous as Salon.com claimed) gives a brief insight into who Phillips is, that he has regular domestic anxieties: in short, that he is not a hero, or even a hero in the making.Excellent and uncomfortably enjoyable. An initial sketch (not gratuitous as Salon.com claimed) gives a brief insight into who Phillips is, that he has regular domestic anxieties: in short, that he is not a hero, or even a hero in the making. Similarly, the introduction to the Somalis helps us see that they are not villains, but victims of the shocking inequalities in the world.\r Hanks, cast as Everyman once again, comes under increasing pressure as the ordeal unfolds, yet whilst you want him to be freed, you have more sympathy for the pirates than you might have anticipated. When the might of the US war machine swings into action, the ruthlessness of the resolution is neither admirable nor triumphant. Relief is tinged with regret, that we live in a world where the weak cannot survive against such odds.",
      "review_date": "2013-10-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I've wanted to see this movie since i first saw the trailer and I thought it was going to be the best of the year. While I can't honestly say i was disappointed I'd be lying if I said I wasn't expecting more. The main problem comes from theI've wanted to see this movie since i first saw the trailer and I thought it was going to be the best of the year. While I can't honestly say i was disappointed I'd be lying if I said I wasn't expecting more. The main problem comes from the fact that it's just too long and drawn out and Tom Hanks spends the entire movie talking like Mayor Quimby. Still, the acting is solid and there are enough thrills to keep you engaged until the end.",
      "review_date": "2013-10-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The biggest praise I have for \"Captain Phillips\" is that it tells a very dramatic true life story in a very honest fashion.  It doesn't feel exaggerated  the action and drama plays out in a very straightforward manner. Tom Hanks gives aThe biggest praise I have for \"Captain Phillips\" is that it tells a very dramatic true life story in a very honest fashion.  It doesn't feel exaggerated  the action and drama plays out in a very straightforward manner. Tom Hanks gives a tremendous performance, with enough hints of the Captain's ego to fight off claims he is being canonized in the film.  If you see an ad for this film and it appeals to you, then the film will deliver.  The acting is terrific, the action sequences tight and exciting, and as usual, Greengrass uses a \"documentary feel\" to his directing that makes it feel  as I said as the beginning  honest. And that is a great compliment to everyone involved.",
      "review_date": "2013-10-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "With crisp, invigorating direction, a sizable array of engrossing performances, a pulse-pounding score, and subtly profound thematic intrigue, Greengrass strikes thriller gold once again with \"Captain Phillips.\"",
      "review_date": "2013-10-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Outstanding acting! This movie is just must watch for everyone! Based on a true story, it delivers so much pain and pressure that it was hard to believe that this was just a movie! 10/10 For this masterpiece!",
      "review_date": "2014-07-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is a Paul Greengrass classic! It's an outstanding movie with fantastic acting, especially Tom Hanks. I haven't seen him this good in such a long time. The thrills are there and the adventure based on the true story is unbelievable.This movie is a Paul Greengrass classic! It's an outstanding movie with fantastic acting, especially Tom Hanks. I haven't seen him this good in such a long time. The thrills are there and the adventure based on the true story is unbelievable. This is worth learning about. Overall, it's another Paul Greengrass hit. Be sure to check out my YouTube channel \"TheMovieManLife\" for all things movies.",
      "review_date": "2013-10-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Superbly directed by Greengrass and led by Hanks and Abdi's powerful performances, 'Captain Phillips' is a tense and exhilarating film experience, that may lose its way in its second act, but is compensated for in it outstanding first and second.",
      "review_date": "2013-10-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The film is presented with a rather impressive hand-held camera style, and the plot engages the audience with a balanced pacing of thrills. Tom Hanks is somewhat banal, and his character is oddly superfluous, though not absolutely. The realThe film is presented with a rather impressive hand-held camera style, and the plot engages the audience with a balanced pacing of thrills. Tom Hanks is somewhat banal, and his character is oddly superfluous, though not absolutely. The real force is Barkhad Abdi, an amazing new talent. His character is both contemptible and sympathetic, and he brings a raw experience having grown up in Somalia. And I must add that his improvised line \"Look at me, I'm the captain now\", shows his capabilities. I support his Oscar buzz.",
      "review_date": "2013-10-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Captain Phillips is brilliant, captivating and \"direct hit.\" The film was a little bit slow in the beginning but picks up and leaves you holding tight on your seat. There are moments where you just want to turn away and holding your hands toCaptain Phillips is brilliant, captivating and \"direct hit.\" The film was a little bit slow in the beginning but picks up and leaves you holding tight on your seat. There are moments where you just want to turn away and holding your hands to your mouth. Tom Hanks shows time and time again why he is one of the best in the business. He played the character with so much depth it makes you think what would you do in his situation. The last few minutes of the movie is sure to earn him his award nominations for Best Actor.",
      "review_date": "2013-10-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I have to admit that this movie was absolutely stunning! I had absolutely no expectations what so ever before watching this movie. I have seen the Danish movie \"The Hijacking (Kapringen)\", which is about the same (Story loosely based on trueI have to admit that this movie was absolutely stunning! I had absolutely no expectations what so ever before watching this movie. I have seen the Danish movie \"The Hijacking (Kapringen)\", which is about the same (Story loosely based on true events).\rCaptain Phillips was great! I know you should take the story with a pinch of salt and I did.  The movie by it self was so exciting and the last 30 minutes of the game my Heart was literally beating nonstop, faster and faster! Great performance by Tom Hanks. This movie is a must see!",
      "review_date": "2013-10-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Being held hostage by a dangerous group of modern-day pirates as they wield automatic weapons is something nobody wants to experience, but Captain Phillips will probably be the closest you’ll get to knowing what it's like.  The film is basedBeing held hostage by a dangerous group of modern-day pirates as they wield automatic weapons is something nobody wants to experience, but Captain Phillips will probably be the closest you’ll get to knowing what it's like.  The film is based on the true story of the brave commander of the U.S. container ship Maersk Alabama, which was seized in 2009 by a crew of Somali pirates.  The gritty cinematography and the realism of the characters make Captain Phillips one of the best films of the year.\rDirector Paul Greengrass, who's works include the Bourne sequels and United 93,  once again used his infamous shaky-cam techniques to effectively give the feeling of disorientation and boost the intensity of the film.   The cinematographer was Barry Ackroyd, who chose to shoot with different film depending on which characters were in the shot. If Hanks or his crew members were in frame, they were shot on 35mm, which produced a higher quality picture with more vivid colors and less of a grainy look.  On the other hand, the pirates were shot with 16mm film, giving off a more grainy look with slightly duller color.  These contrasts, along with the hand-held camera look and close-up face shots all accumulated to intensify the already horrific situation.  Greengrass' cast consisted of almost all no-name actors besides Tom Hanks, who gave a possible oscar-nominating performance as he displayed the bravery of being Richard Phillips, captain of the Maersk Alabama. In order to add to the realism, Greengrass didn't let the pirates and Hanks meet each other until they were on set and about to film.  The fear expressed on Hank's face may have also been natural.\rThe first 20 minutes of the movie was the calm before the storm.  Hanks is packing his bags, getting ready to leave his house in Vermont.  His wife drives him to the airport, and you can't help but notice how worried and visibly scared she is.  Her tears and feelings of uncertainty foreshadow the horrific events that follow.  Viewers become emotionally invested knowing the captain has a loving wife back home.  Meanwhile, back on the shores of Somalia, a dream-team of pirates is being assembled.  Similar to the drafting process of a schoolyard football game,  about 8 men are selected from the group, based on strength and determination.  The Somalians grab their AK-47s, and climb into their motorized skiffs as they head to sea with only one objective  to bring home money. Even though the Somalians are embarking on a journey of crime, all they want is a better life.  The contrast of Phillips home-life versus life in Somalia is nothing but saddening.  A part of you almost roots for the pirates to return home with their ransom money.\rWhen Hanks first steps foot on the ship, he goes right into captain mode.  He immediately starts safety procedures and bosses around his lazy group crew workers. After finishing up his last safety drill, he spots 2 skiffs on his radar, headed his way quickly.  One skiff ends up turning around, but the inevitable happens, and the Maersk Alabama is boarded by 4 Somali pirates.  As Hanks sends the crew to hide out in the engine room, he does his best to distract the impatient pirates by offering them water and melon slices to snack on. But the leader of the hijackers, Muse (Barkhad Abdi), has had enough, and eventually takes the captain hostage on a small covered lifeboat, while demanding a ransom of millions in exchange for his return.\rThe claustrophobic lifeboat consisted of Captain Phillips, Muse, and his 3 other helpers  the right-hand man, the hothead, and the rookie.  While in the lifeboat, Hanks begins to form a relationship with the rookie pirate, who's only 16 years of age and displayed just as much fear as Hanks.  Hanks helps the youngster bandage his cut foot and tries to speak with him. He tells the Somalian that he is too young to be hijacking ships.  The dynamics of their relationship was interesting.  They both secretly helped each other, trying to avoid being caught by the hothead, who never hesitated to scream at Hanks and deliver a pistol-whip to his forehead. As the movie progresses, your concern for the safety and future of the young pirate is right there with your concerns for the captain.\rWhat follows is an intense cat-and-mouse game with the U.S. Navy and the little orange lifeboat, full of failed negotiations and uncertainties.  Once the lifeboat is surrounded, it is clear that all 5 men are unsure if they will make it out of there alive.  All 130 minutes accumulate to what is one of the most intense movie climaxes you'll see.  And Hank's brilliant acting in the last 4 minutes caps the movie with a real, heartfelt ending that everyone must see themselves.",
      "review_date": "2013-10-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The plot is very amazing. Climax keeps getting higher and higher! Very intense at very point of the movie. Tom Hank did a fantastic job in playing the role, to be honest it could get him an Oscar for this!",
      "review_date": "2013-12-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Captain Phillips is brilliantly acted and incredibly tense. It features one of Tom Hanks' finest performances and Paul Greengrass at his best behind the camera.",
      "review_date": "2014-05-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "For the first time in a while, I completely forgot I was in the cinema while watching this. An immersing plot that keeps you on the edge of your seat with a faultless performance from Hanks.",
      "review_date": "2013-11-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Paul Greengrass is a director who always focuses his attention on depicting on screen events as realistically as possible. He also knows how to deftly build momentum and a sense of impending urgency and doom, which makes his films alwaysPaul Greengrass is a director who always focuses his attention on depicting on screen events as realistically as possible. He also knows how to deftly build momentum and a sense of impending urgency and doom, which makes his films always riveting and thrilling. \"Captain Phillips\" is no exception  the film accompanies the process of the hijacking of the ship, and the ultimate kidnapping of the Captain almost in real time. The audience accompanies those individuals and is asked to embark on that little lifeboat and partake of the feeling of claustrophobia and fear that is created. The menace is presented in a very realistic way, as is the final part of the film, where the director stages the rescue attempts by the group of experts that are deployed. Tom Hanks is solid as the stoic and resourceful Captain, and the overall supporting group of actors depicting his kidnappers are equally strong in their performances. An overall entertaining film worth watching.",
      "review_date": "2013-10-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Tom Hanks single-handedly pulled off a realistic and touching real-life story. Such rescue operations is simply flirting with death. One missed shot from the snipers and your hostage's dead. I hope there'll be more security forces in theTom Hanks single-handedly pulled off a realistic and touching real-life story. Such rescue operations is simply flirting with death. One missed shot from the snipers and your hostage's dead. I hope there'll be more security forces in the waters and in the air protecting our merchant ships from pirates. This will prevent exhausting, resource-wasting and life-threatening situations as in Captain Phillips. I cried watching the shock portrayed by Tom Hanks at the end of the movie.",
      "review_date": "2013-12-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'd been looking forward to CP since the trailer, love adventure stories and this was a good one. I'm not a fan of jittery camera films, however, and this one was 90 percent on the jitter  even when it didn't need to be. So I have a littleI'd been looking forward to CP since the trailer, love adventure stories and this was a good one. I'm not a fan of jittery camera films, however, and this one was 90 percent on the jitter  even when it didn't need to be. So I have a little headache now.\rThe tactical dilemma that's at the core of the story is fascinating and I'm sure has led to a lot of second-guessing as to how the rescue should have been handled.\rThe pirates were really scary dudes, despite not having eye-patches or parrots or peglegs.\rClearly men wrote and directed this movie as they totally ditched the wife after the opening scene. It would have added another dramatic element to have her following the news and getting updates from the military. No doubt their sons also would have come home to support her. This would have been a good balance to Phillips thinking about his family. A massive military rescue at sea is great, but the old ball and chain clinging to the Kleenex would have been a nice, effective emotional touch.",
      "review_date": "2013-10-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Captain Phillips 2013\r Director: Paul Greengrass\r\n\r\nTom Hanks brings another spectacular, emotional, well presented, and inspirational movie to the big screen. The movie introduced new characters but all of them did their individual rolesCaptain Phillips 2013\r Director: Paul Greengrass\r Tom Hanks brings another spectacular, emotional, well presented, and inspirational movie to the big screen. The movie introduced new characters but all of them did their individual roles with excellence. The content of the movie is very new to viewers and successfully introduces  the life of pirates.\r When Captain Phillips leads this massive cargo ship from Jordan to Kenya, it was all supposed be a normal route. But, after several hours in the sea, Captain Philips and his crew faced the unexpected reality of pirates. The fear portrayed by Captain Phillips and his crew and the emotional rollercoaster and dramatic environment makes the movie very interesting to watch and enjoyable at the same time.\r As American, watching the Navy Seals plan and execute a successful mission to save a single American's life is a very inspiring moment and makes viewers proud. The last minutes of the rescue, the intense exchange between the pirates and the American rescue team and the situation inside the lifeboat was very dramatic and all characters performed their part with excellence.\r The movie is a masterpiece in all aspects and is a movie worth watching and a movie that will be remembered.\r Source:\r Captain Philips Movie 2013",
      "review_date": "2013-10-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Directed, written and pictures are not the only advantages of the film. Delight also raises impersonator title role of Tom Hanks. I can not imagine the upcoming Oscar ceremony without his name on the list of nominees for the statue's role.",
      "review_date": "2013-11-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Captain Phillips doesn't give its audience one moment to relax. The debate over how accurately the film depicts the events of April 2009 has not lessened the film's impact. With another stunning performance from Hanks, a clever screenplay andCaptain Phillips doesn't give its audience one moment to relax. The debate over how accurately the film depicts the events of April 2009 has not lessened the film's impact. With another stunning performance from Hanks, a clever screenplay and a gripping soundtrack, I guarantee you that throughout its runtime of over two hours, you will not be bored.",
      "review_date": "2017-11-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Starring in the title role of “Captain Phillips” Tom hanks will undoubtedly receive a well earned sixth nomination and possibly his third Oscar. For two hours he plays the Tom Hanks the audience knows and loves but in the last thirteenStarring in the title role of “Captain Phillips” Tom hanks will undoubtedly receive a well earned sixth nomination and possibly his third Oscar. For two hours he plays the Tom Hanks the audience knows and loves but in the last thirteen minutes tears your heart out as he once did in the AIDS movie “Philadelphia”.\r“Captain Phillips” is based on a true story that made worldwide news headlines in 2009 when 4 Somali pirates boarded the huge maritime container ship the Maersk Alabama  with Captain Richard Phillips in command of a crew of 20. The pirates are lead by Muse, played powerfully by newcomer Barkhad Abdi, who should come in for a lot of mentions during award season, consisting of Bilal (Barkhad Abdirahman) a 19 year old who has no idea what he is doing, Najee (Faysal Ahmed) seeing millions of dollars coming his way when he boards the ship and Elmi (Mahat M. Ali) perpetually frozen with fear. The four live in poverty, sometimes earning money as fishermen and all living on khat, a plant also known as jaad, that provides excitement and euphoria but most of all a loss of appetite that keeps them going for days keeping their mainly thin bodies on edge..\rThe first hour of the film sets up a cat and mouse game, mainly between the captain, crew and pirates, while the second half is the captain and the four pirates encased in an enclosed lifeboat and the attempt by Navy destroyers, helicopters and the Navy seals to rescue the captain without his being armed. This was a time when no one, captain, commercial ships or crew, carried arms of any kind so the pirates with their rifles and guns have the upper hand even against hundreds of men who want to get them.\rThe director, Paul Greengrass, and his cinematographer Barry Ackroyd, along with film editor Christopher Rouse make you feel the claustrophobia of the 5 men in the lifeboat and the power of the waves that an ocean can make.\rAs with most films today, except for the recent “Gravity”, this film, running at 2 hours and 14 minutes, is about 15 minutes too long with a few scenes that could easily been cut by the screenwriter Billy Ray which leisurely sets up the raid both by the pirates and the Navy.\rThe cast is uniformly fine but it is watching the two men, Abdi making his film debut, and the complete turnaround  of stoic, upright Hanks, facing off on tight screenshots that makes this a worthwhile movie to see.",
      "review_date": "2013-10-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Emotions run high in this piracy adventure which is gripping from beginning to end. It is also a much better film than the trailer marketing it suggests. I have always been rather irritated by the Tom Hanks' movie star persona, all saccharineEmotions run high in this piracy adventure which is gripping from beginning to end. It is also a much better film than the trailer marketing it suggests. I have always been rather irritated by the Tom Hanks' movie star persona, all saccharine and beaming smiles, and his choice of films are invariably of a very conventional or commercial nature (or both!) adding weight to one's off screen impression of him. In his roles, though, he is usually totally believable and rarely gives a bad performance. His Captain Phillips must rank as one of his best. For the most part it is understated and, unusually for a Hanks turn, he blends in to the ensemble rather than standing out as the obvious star.\rDirector Paul Greengrass keeps the action up close for the most part creating an atmosphere of claustrophobic desperation. He is aided no end by some stunning hand held camera shots with positioning and angles that truly add to the tension. Even when scenes are in darkness or low light the events happening on screen are clearly depicted, unlike in similar situations in many films where you just don't know what's going on because the cinematography is so poor. The editing too is just dazzlingly brilliant and provides the movie with its rapid heart beat.\r The screenplay raises issues on the age of the hijackers and the fac that these 'terrorists' are in fact  fishermen who have had to resort to piracy due to the fact that the western world have over fished the seas. However, it counter balances this particular comment by having Tom Hanks' character state at one point 'You're not a fisherman!' when one of the hijackers violently holds a gun to his forehead. The screenplay may have wanted to appear balanced but I personally know which side I'm on. In the end it is the responsibility of  individual governments to combat piracy. As they say prevention is better than cure. It is incredible to me that governments will do anything in any other situation to prevent acts of terrorism these days. However, in this known problematic area where the evil flourishes man made laws, I believe, don't allow ships to have the proper security and weaponry to defend themselves against such acts. This is not only costly in all ways, but demonstrates stupidity in an extreme form. Stupidity that should be curtailed now!",
      "review_date": "2013-10-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Captain Phillips is an astounding biopic that is executed with delicate precision to show the true human side of every character involved in the film, evoking pathos, joy and numerous other thoughts and emotions as the tension is expertlyCaptain Phillips is an astounding biopic that is executed with delicate precision to show the true human side of every character involved in the film, evoking pathos, joy and numerous other thoughts and emotions as the tension is expertly built throughout the film. Without a doubt, this is one of Tom Hanks's best performances of his entire career.",
      "review_date": "2013-10-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Captain Phillips is one of the best films I've seen this year with a all round great performance by Tom Hanks it kept me on the edge of my seat the same way Paul Greengrass did with United 93 suspenseful the moment the pirates get on the shipCaptain Phillips is one of the best films I've seen this year with a all round great performance by Tom Hanks it kept me on the edge of my seat the same way Paul Greengrass did with United 93 suspenseful the moment the pirates get on the ship and take over I was thinking  this is good enough but then it gets even better as the movie plays out. Tom Hanks will get an oscar nomination for his performance in this movie or even an Oscar which I think he should overall great movie. Acting A, Music A, Writing A, Movie 10 out of 10",
      "review_date": "2013-10-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Finally a good movie and maybe the best of 2013. Tom Hanks deserves an Oscar. The rest of the cast was excellent also. It's a must see movie if you love suspence.",
      "review_date": "2013-10-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "“Captain Phillips” is the true story of Captain Richard Phillips and his cargo ship Maersk Alabama which, in 2009,  became the first American cargo ship to be hijacked by pirates in over 200 years. The film stars Tom Hanks in the title role“Captain Phillips” is the true story of Captain Richard Phillips and his cargo ship Maersk Alabama which, in 2009,  became the first American cargo ship to be hijacked by pirates in over 200 years. The film stars Tom Hanks in the title role with Barkhad Abdi and Barkhard Addirahman playing 2 of the 4 Somalian pirates. Written by Billy Ray and based on the book by the Captain,, this is an intense, armchair gripping story of one man’s drive and ability to deal with his captors while at the same time seeking to protect his crew and his ship. Tom Hanks was never better and he proves here, as he has done so many times in the past,, that he is a versatile and extremely talented actor. This is action and drama at its best and rightfully deserves a 9.. 134 minutes of viewing time was never better spent.",
      "review_date": "2013-10-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is based on a true story about a cargo ship that's overtaken by Somali pirates. Tom Hanks plays the captain, who smartly handles the invasion, then bravely endures what comes next. His final scene is the most moving. The tensionThis film is based on a true story about a cargo ship that's overtaken by Somali pirates. Tom Hanks plays the captain, who smartly handles the invasion, then bravely endures what comes next. His final scene is the most moving. The tension holds steadily throughout and builds to an effective climax, although it does run a bit long.",
      "review_date": "2013-10-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "People will be talking about Tom Hanks' masterpiece for a long time!!! Absolutely stunning and well acted. A thriller that will never be forgotten!!! Awesome!!!",
      "review_date": "2013-10-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The most intense, atmospheric movie of 2013 so far (year I've seen Gravity and Prisoners). This is an outstanding adaptation of real story with top notch acting and great directing. \"Captain Phillips\" shoul be nominated for Best Picture atThe most intense, atmospheric movie of 2013 so far (year I've seen Gravity and Prisoners). This is an outstanding adaptation of real story with top notch acting and great directing. \"Captain Phillips\" shoul be nominated for Best Picture at Oscar's, Tom Hanks should be nominated for Best Lead Actor",
      "review_date": "2013-10-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's a funny and great movie. the best is that i was happy when i looked at it! Like when i was siting and looking at it in the cinema. i eated popcorn!",
      "review_date": "2013-10-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "According to Richard Phillips' \"A Captain Duty: Somali Pirates, Navy SEALS, And Dangerous Days At Sea,\" he tells his true story about a brave commander was kidnapped by pirates. Director, Paul Greengrass (The Bourne Supremacy, The BourneAccording to Richard Phillips' \"A Captain Duty: Somali Pirates, Navy SEALS, And Dangerous Days At Sea,\" he tells his true story about a brave commander was kidnapped by pirates. Director, Paul Greengrass (The Bourne Supremacy, The Bourne Ultimatum, and United 93) adapts Mr. Phillips' latest feature \"Captain Phillips\" about a naval officer who has been hijacked by four Somali pirates in a MV Maersk Alabama in 2009. Tom Hanks delivers a great performance who plays a strong captain and he acts very well to become a lost tragic person who was caught up by those nasty pirates. Mr. Greengrass had done  very well to make a realistic event with great suspense, very chilling, and tense of seriousness. This movie is unbelievable with terrific story, wonderful performances, and fascinate moments. I definitely enjoy watching \"Captain Phillips\" a strong commander who held hostage by Somali pirates and it's a marvelous film.",
      "review_date": "2013-10-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I saw Captain Phillips in a packed theater during Sneak Preview week. Let me start by saying the movie is outstanding.  But many of you are reporting this based on a true story?  It depends on your definition of the truth?  The NY Post hasI saw Captain Phillips in a packed theater during Sneak Preview week. Let me start by saying the movie is outstanding.  But many of you are reporting this based on a true story?  It depends on your definition of the truth?  The NY Post has reported, that 11 of his crew sued the ship company.  They blamed Captain Phillips for putting them in harms way and described him as aloof, not in touch with reality, and  not a good Captain.  So Hollywood gave us their spin which sounds much better just to sell tickets.  If you can accept that the truth lies somewhere in between, then this is a very good film; albeit, truthful or fiction.  The accolades this film has been receiving are richly deserved. Tom Hanks gives yet another outstanding performance. Even when Tom has nothing to say his acting chops are so brilliant, that his facial expression, says it all. Just about everyone sat on their edge of their seat as the tension during the hostage crisis is so thick, you can literally cut it with a knife. It's the last 15 minutes of this flick when Tom shows his best acting as he releases all the emotions the real Captain Phillips must have felt.   Without question, Mr. Hanks will be nominated for another Oscar. This is a must see movie for 2013.  Enjoy",
      "review_date": "2013-10-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An excellent movie with a good script, good screenplay, excellent direction and well-acted.  There is plenty of drama with Tom Hanks doing a terrific job.  Plenty to see about container ships, pirates, and the workings of the U.S. Navy.  AllAn excellent movie with a good script, good screenplay, excellent direction and well-acted.  There is plenty of drama with Tom Hanks doing a terrific job.  Plenty to see about container ships, pirates, and the workings of the U.S. Navy.  All in all, one of the better films of the year to date.",
      "review_date": "2013-10-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Captain Philips keeps you on the edge of your seat! You think it's intense when the pirates board the ship, but it takes you to a whole new level later on. I could not look away for a second. Tom Hanks delivers a breathtaking performanceCaptain Philips keeps you on the edge of your seat! You think it's intense when the pirates board the ship, but it takes you to a whole new level later on. I could not look away for a second. Tom Hanks delivers a breathtaking performance worthy of an Oscar nomination and possibly an Oscar. One of the best films I've seen this year.",
      "review_date": "2013-10-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Greengrass and Hanks succeed in Captain Phillips with an astute and exciting action-thriller/biopic. Moviegoers who are interested in seeing the real-life MV Maersk Alabama story recreated on the big screen will likely be satisfied with theGreengrass and Hanks succeed in Captain Phillips with an astute and exciting action-thriller/biopic. Moviegoers who are interested in seeing the real-life MV Maersk Alabama story recreated on the big screen will likely be satisfied with the assembled package of clever filmmaking choices and a phenomenal pair of star performances.",
      "review_date": "2013-10-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Captain Phillips keeps you on your toes from the second you step foot in the theater. Twists and many surprises will await you.\rHanks performance is worthy of a Oscar with the pirates having great acting themselves. The acting in all theCaptain Phillips keeps you on your toes from the second you step foot in the theater. Twists and many surprises will await you.\rHanks performance is worthy of a Oscar with the pirates having great acting themselves. The acting in all the characters felt as if this was truly happening.\rThis movie isn't much of an action movie but really captivated me on what a pirate invasion onboard would be like and just how scary it would be to be one of those crew members aboard.\rThe reason why I didn't give it a perfect 10 is for the lackluster beginning and execution of the drama. Many parts were filler that were unnecessary. Also, many cliches filled this movement throughout.",
      "review_date": "2013-11-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I think one of the main reasons I didn't give this movie a higher rating is because I thought the last third just sort of droned on and fizzled out.  Yes it ended with a bang, but the more interesting part of the story was when the captainI think one of the main reasons I didn't give this movie a higher rating is because I thought the last third just sort of droned on and fizzled out.  Yes it ended with a bang, but the more interesting part of the story was when the captain was trying to outsmart the pirates and save his ship and crew.  The last third of the story seemed as confined and limited as the actual physical space it took place in.  They did do a good job characterizing the pirates, not making them likable, but making them human, instead of caricatures, simple violent thugs.  A decent flick, but not sure why it is getting all the glowing critic reviews, the Halo that surrounds Mr, Hanks and all his works (since Joe vs. the Volcano anyway), perhaps?",
      "review_date": "2013-10-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The well was poisoned for me. 1. Capt Phillips story is totally fabricated by Hollywood. The crew hated him and have filed lawsuits against the movie's story. To please his bosses Phillips ventured to within 250 miles of the coast even thoughThe well was poisoned for me. 1. Capt Phillips story is totally fabricated by Hollywood. The crew hated him and have filed lawsuits against the movie's story. To please his bosses Phillips ventured to within 250 miles of the coast even though he had incessant advance warnings to stay beyond 600 miles! 2.  Helpless non-armed million dollar ships deserve whatever they get if they don't arm themselves in any way and choose to cower like scared church mice in a dark corner when danger threatens. Phillips fired flares at the approaching pirates. No, not joking, that's how pathetic this is. Only thing acceptable about the movie were the production values and Tom Hanks' actual performance as fantastically made up as it was.",
      "review_date": "2013-10-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "someone great said this movie is full of pro US propaganda and crap and if they havent yet they should as this is exactly what it feels like when watching this film. Its main characters from scene to scene dash from coward to stone cold herosomeone great said this movie is full of pro US propaganda and crap and if they havent yet they should as this is exactly what it feels like when watching this film. Its main characters from scene to scene dash from coward to stone cold hero personalities, every US person in the film is positive and all Somalis are portrait like village people who just climbed down from banana trees.",
      "review_date": "2013-11-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I didn't like this film, not because there was anything wrong with it.  It was well made.  The acting and script are good.  However, I ultimately found myself rooting for the bad guys.  The story itself is too much a \"might makes right\"I didn't like this film, not because there was anything wrong with it.  It was well made.  The acting and script are good.  However, I ultimately found myself rooting for the bad guys.  The story itself is too much a \"might makes right\" story.  ...the smug Navy putting the Captain's life in jeopardy  justified only by the positive end result.  The story itself is completely embellished.  Read the real life accounts from former crew about who the \"real\" Captain Richard Phillips is.  Altogether this reeked of Hollywood BS.  The producers made a film that is designed only to make Americans feel good about themselves, and that this one delivers in that regard is entirely depressing to me.",
      "review_date": "2013-10-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I’m not sure if there is some sort of unwritten rule in Hollywood to pump out glorified films of American icons or a quota for the “Based On A True Story: American Hero” genre. With the likes of Olympus Has Fallen, White House Down, and G.II’m not sure if there is some sort of unwritten rule in Hollywood to pump out glorified films of American icons or a quota for the “Based On A True Story: American Hero” genre. With the likes of Olympus Has Fallen, White House Down, and G.I Joe: Retaliation, there is only one way to distinguish these films from the likes of Captain Phillips, and that’s the talent behind, and in front of the screen.\r Captain Phillips is a clever, beautiful and meticulous piece of American propaganda. Brought out by its studios Columbia Pictures and Sony, it tells the story of a Captain of an American cargo ship being taken over by a small and young band of inexperienced Somali pirates.\r Think of it like this; the film is directed by Paul Greengrass, the same director of United 93, a film that recounts the efforts of average American passengers foiling the plans of foreign terrorist plans during 9/11; it stars our generation’s own Humphrey Bogart, and arguably the most recognizable American actor right now, Tom Hanks, and its produced by the team behind other contemporary American classics like The Social Network. So why is Captain Phillips sinking right out of the water?\r I know that, for the most part, I will be in the vast minority with my viewpoint on the film, already gaining critical praise and reception from early festival screenings and talk, most noticeably for Hanks’ performance. But what about the performances of the practically unknown, amateur and first time Somali actors who, not only hold their own beside the masterful Hanks, but at times tower over time like a freighter ship beside a life vessel. Pirates Muse (Barkhad Abdi) and Bilal (Barkhad Abdirahman) stand out more than the other two pirates, but as the award season nears closer, I am sure neither of these names will be announced as serious award contenders when the time comes.\r What is most disappointing about Captain Phillips is its massive potential. The film starts off, giving the audience [somewhat] equal screen time to both the protagonist and antagonist, showing the lives of these two very different men and the ‘jobs’ they must perform in order to survive. One individual is a captain of a cargo ship who steers heavy waters to get shipments into port on time; the other is a fisherman who is violently forced to become a Somali pirate for a larger, more corrupt entity. Greengrass and screenwriter Billy Ray briefly touch upon the incongruencies of both men’s worlds and different upbringings as well as viewpoints, but, shortly after, is drowned with scenes of unapologetic American patriotism.\r As for Tom Hanks, well, Hanks does what he does best throughout the course of the film. There is no denying Hanks as a powerhouse actor and fine entertainer, just not with the presence of other actors. Some of Hanks’ most memorable and recognized performances (Cast Away, The Terminal, Cloud Atlas) are ones when he is interacting with only himself. Captain Phillips is a testament to that notion; delivering his best and most emotional scenes in either a lifeless life vessel or disoriented and unresponsive to an aiding nurse, Hanks delivers his signature Tom Hanks characteristic, just with a different accent.\r Unfortunately for Greengrass and company, Captain Phillips is an unaware, self-reflexive, continuing practice of the “home of the brave and land of the free” stretching its muscles. Just last year, making its premiere at the Venice and Toronto film festival circuit, a Danish film, titled A Hijacking made its rounds internationally, and then shortly after, in a limited theatre bout. The film never found footing after its critical praise and strong reception from audiences. The trailer is also oddly familiar to the style and narrative of Captain Phillips. Yet again, the Hollywood studio system just goes to show that with the right actor and precise director, no idea is safe of Hollywood’s ongoing obsession of being uncreative.\r Emotionally charged, suspenseful and paced brilliantly, it is hard to ignore Captain Phillips as one’s familiar, unsteady first boat ride–it may be a bit nauseating, rough, and hard. Making you reconsidering jumping on again.",
      "review_date": "2013-11-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Stupid made up movie that has no basis in fact. The real Capt Philips was an **** and it was his fault the ship was boarded by pirates in the first place.",
      "review_date": "2014-10-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "As purely an action/drama film it was very good and Tom Hanks was as good as he consistently is. One drawback is some of the after-story blowback where certain crew members have criticized over-heroization of Phillips (as Hollywood oftenAs purely an action/drama film it was very good and Tom Hanks was as good as he consistently is. One drawback is some of the after-story blowback where certain crew members have criticized over-heroization of Phillips (as Hollywood often does) and claims that the path he routed close to the Somali border in order to speed delivery is actually what put them in harm's way in the first place.\rBut the biggest problem with this as with some of the other Navy SEAL-related films lately, is that it is horribly wrong to allow a movie to reveal our special forces tactics. Even the slightest reveal has the potential for putting our troops in greater danger and I have no patience for this sloppy exposure.",
      "review_date": "2014-03-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ripping yarn and not the first time a sailor has \"remembered things a bit more heroically\" than they actually happened. Barkhad Abdi nearly steals the show as well as the ship... with a great performance.",
      "review_date": "2013-11-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Many critics described this film as the Argo this year (only without the same opportunities for prizes) in my my opinion he is the closest Zero Dark Third, being a real story treated extremely realistic (striking merits Career Paul G.) atMany critics described this film as the Argo this year (only without the same opportunities for prizes) in my my opinion he is the closest Zero Dark Third, being a real story treated extremely realistic (striking merits Career Paul G.) at first he tries to highlight all forms of the discrepancy of the two worlds, that of the captain and crew, who have their homes comfortaveis and enough food, and the pirates who sleep on the hard ground and wear clothes insignificant, the performances all of them are very good because they do not speak much but make many facial expressions and gestures, logically Tom H. steals but that only happens in the final 15 minutes, because the script helps, after the end we get the latent print that the great leaders never give evil in his works but his underlings certainly a film that will be fighting seriously by awards.",
      "review_date": "2013-11-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a well-made film! Although based on an actual event, there is no doubt in my mind that the embellishments of the story make it so much more theatrical.Yes, I know that that is the nature of a film based on fact. In other words, don'tThis is a well-made film! Although based on an actual event, there is no doubt in my mind that the embellishments of the story make it so much more theatrical.Yes, I know that that is the nature of a film based on fact. In other words, don't expect reality in a true-based event. However, for some reason, this did not connect with me. Tom is fine as are the cast but this is not anything that I would want to see again, ever and I found it grueling to see it once. Actually, I'm glad that I went to it and now see that most who saw it do not agree with my perspective. Obviously, my standards for a film of this nature are quite different. Perhaps the fact that I  drifted off after about 10 minutes for about 15 minutes and then watched the rest of the film colours my perspective? C' est la vie! ",
      "review_date": "2013-10-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not only is this one of the best movies of 2013, this is one of the best movies Tom Hanks has starred in in a long time. The commercials lead you to believe that the ship takeover is the majority of the movie, but it gets much better after that.",
      "review_date": "2013-11-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This really is the best movie of the year. The acting from all the characters is on top and the Somali pirates are absolutely incredible. Even though most people know what happens to Captain Phillips due to it being a true story, I was on theThis really is the best movie of the year. The acting from all the characters is on top and the Somali pirates are absolutely incredible. Even though most people know what happens to Captain Phillips due to it being a true story, I was on the edge of my seat the whole time. This is a theater experience not because of visuals but because of how amazing this film really is.",
      "review_date": "2013-11-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Bravo!  Hanks is back and in fine form, as usual the man put me to sleep in about 5 minutes.  Only problem is Julia Roberts is nowhere to be seen, if she was in it I would have been asleep before the opening credits finished.  Hanks deserve aBravo!  Hanks is back and in fine form, as usual the man put me to sleep in about 5 minutes.  Only problem is Julia Roberts is nowhere to be seen, if she was in it I would have been asleep before the opening credits finished.  Hanks deserve a lifetime award of some sort for being the most bland boring man in Hollowood.",
      "review_date": "2013-12-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A very nice and interesting movie with good acting. I enjoyed it, it kept me interested and wanting more.\rAlso the plot is very original and I haven't seen any similiar movie before. Recommended.",
      "review_date": "2014-01-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Tom Hanks stars in Paul Greengrass' thriller based on a true story called 'Captain Phillips' which tells the story of a man named Captain Richard Phillips whose ship is under attack from Somalian pirates.\r This is a well-made, fast pacedTom Hanks stars in Paul Greengrass' thriller based on a true story called 'Captain Phillips' which tells the story of a man named Captain Richard Phillips whose ship is under attack from Somalian pirates.\r This is a well-made, fast paced and intense thriller that keeps you on the edge of your seat the entire time, and Tom Hanks gives one of the best performances in his career since his last Oscar nominated work in 'Cast Away' (2000) or 'Road to Perdition' (2002).\r The real star of the show though is Barkhad Abdi, who plays the lead pirate named Muse, and he did receive the \"Best Supporting Actor\" nomination at the Oscars. He teases Richard an awful lot and comes across as demanding, if not, sadistic, most of the times. He takes over the ship and treats Captain Phillips as his slave and plans to kidnap him.\r The way this film moves is fascinating and it is one of the best biopic thrillers I've ever experienced at the cinema, it's actually my number 1 movie of 2013. Many people would vote 'Gravity' or '12 Years A Slave' and while they are great films in their own right, I choose 'Captain Phillips', I did not know what to expect before watching a movie based on a story I haven't heard of, but I did not expect to feel this tense.",
      "review_date": "2015-03-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Although it was very positively reviewed and Tom Hanks and Paul Greengrass have done some great films in their respective careers, there was the uncertainty as to whether 'Captain Phillips' would be my cup of tea.The good news is it veryAlthough it was very positively reviewed and Tom Hanks and Paul Greengrass have done some great films in their respective careers, there was the uncertainty as to whether 'Captain Phillips' would be my cup of tea.The good news is it very much was. Although it does stray from the facts quite a bit, 'Captain Phillips' takes a remarkable and harrowing true story and tells it in a way that's utterly gripping and full of tension and emotion. It won't be for all taste-buds, especially for those who don't like shaky cam, but it is very easy to see why 'Captain Phillips' was and still is received so positively. It's not quite a masterpiece or flawless, it does go on a little longer than necessary which occasionally bogs down the pacing (15-20 minutes shorter would have made a difference) and, although there has been far worse abuse of the shaky cam technique, some of it does get excessive and leaves one feel a little sea-sick.However, 'Captain Phillips' does more right than it does wrong and boasts some of Greengrass's best directing in one of his best films and one of Hanks' best performances in recent years. Greengrass keeps the tension levels high, maintaining urgency and the more violent moments are explosively powerful. He is particularly good in showing the increasing desperation when things go wrong as well as the horrors of the situation. Hanks is at the height of his powers here, boasting some of the most powerful acting he has ever given, particularly in his very poignant final scenes.One mustn't overlook Barkhad Abdi, who brings intensity and vulnerability to a character who seems like a villain at first but turns out to be much more than that. The rest of the acting is fine, though Hanks and Abdi are the ones that dominate.'Captain Phillips' is well made, while some of it is excessive there are other instances where the shaky cam heightens the drama and dizzying intensity. There is an audacious grit throughout. The music pulsates thrillingly without being repetitive or overbearing. The script is thought-provoking and has tightness and also nuance that stops things from being patronising.Story-wise, 'Captain Phillips' is riveting, there is a heart-pumping urgency throughout and the tension, claustrophobia and desperation escalates and increases to nerve-shredding effect in its best moments. The emotion of the final act crescendos thrillingly and heart-wrenchingly and it is enough to bring tears to the eyes. So much its honesty, pathos and power, Hanks gives it everything to these scenes. The characters are hardly neatly black and white while motivations and character decisions are clear and logical.In conclusion, tense and powerful, highly recommended. 9/10 Bethany Cox",
      "review_date": "2022-03-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It comes as little surprise that Captain Phillips is a tightly wound thriller grounded in reality.  That has always been Greengrass' style.  What's new this time out is the surprising waves of emotion that hit like a tsunami at the film'sIt comes as little surprise that Captain Phillips is a tightly wound thriller grounded in reality.  That has always been Greengrass' style.  What's new this time out is the surprising waves of emotion that hit like a tsunami at the film's end.  The credit for that goes to Hanks whose subtle turn paints Phillips not as a hero, but an ordinary man caught in a scenario with no ideal outcome.",
      "review_date": "2013-11-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Tom Hanks's performance reminds me of Russell Crowe's in \"The Insider\" -- an average-looking guy, doing his job with no heroics, who goes through a period of very intense anxiety and makes you feel it.. So, Hanks is great as advertised, butTom Hanks's performance reminds me of Russell Crowe's in \"The Insider\" -- an average-looking guy, doing his job with no heroics, who goes through a period of very intense anxiety and makes you feel it.. So, Hanks is great as advertised, but somehow the movie is more interesting than it is entertaining. Slow stretches are not filled in with compelling supporting roles or complexity. In fairness, I followed the Somali pirates stuff closely when it happened, so I guess no amount of pounding music was going to make me forget for a while that I knew how it was going to end.",
      "review_date": "2014-01-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Captain Phillips is a flawless and intense drama that ratchets up the tension with every passing minute. Tom Hanks delivers a career-best performance as the wily and quick-thinking everyman who does his best before cracking under theCaptain Phillips is a flawless and intense drama that ratchets up the tension with every passing minute. Tom Hanks delivers a career-best performance as the wily and quick-thinking everyman who does his best before cracking under the pressure. The Somali pirates are also treated fairly and their motivation is convincing. 5/5, a must-see movie.",
      "review_date": "2014-01-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Captain Phillips is a nailbiter, and the action begins fairly quickly.  Tom Hanks is good throughout, although his accent was unrealistic at times.  The movie feels real and people react like you would expect them to.  There are a couple ofCaptain Phillips is a nailbiter, and the action begins fairly quickly.  Tom Hanks is good throughout, although his accent was unrealistic at times.  The movie feels real and people react like you would expect them to.  There are a couple of scenes that bothered me that didn't ring true, but overall a solid film.",
      "review_date": "2014-02-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Captain Phillips is an interesting true story which revolves around modern day pirates attacking an American cargo ship. Tom Hanks is absolutely fantastic as the titular captain (but then you wouldn't expect any less) and the rest of the castCaptain Phillips is an interesting true story which revolves around modern day pirates attacking an American cargo ship. Tom Hanks is absolutely fantastic as the titular captain (but then you wouldn't expect any less) and the rest of the cast is totally on point too. The movie is realistic in the extreme and holds no place for sentimentality. Basically, it's great all the way around. That said, I'm also not sure Captain Phillips is a movie that truly demands repeat viewings.",
      "review_date": "2014-04-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Excellent entertainment. Perfect acting from captain Philips (Tom Hanks) and the four pirates (Barkhad Abdi, Barkhad Abdirahman, Faysal Ahmed, and Mahout Ali), who appeared to be real pirates. Well crafted scenario, calculated talking, wellExcellent entertainment. Perfect acting from captain Philips (Tom Hanks) and the four pirates (Barkhad Abdi, Barkhad Abdirahman, Faysal Ahmed, and Mahout Ali), who appeared to be real pirates. Well crafted scenario, calculated talking, well taken shots, interpretive locations, indoor and outdoor, fast pace, tiring rhythm. Captain Philips, a family man,  was taken hostage after a failing attempt to kidnap a Maersk cargo ship. Four pirates are looking for a kidnaping reward, the ship crew and their captain Philips were trained for such ordeal, they did manage to overcome the kidnappers who had one choice left, escape in the life boat with captain Philips taken captive. The US navy and navy seals put an end to this breathtaking  movie, they free captain Philips, kill three pirates and capture their leader.",
      "review_date": "2013-11-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was already familiar with the storyline as I had seen a documentary of it, so the drama for me was minimized, but pretty much it's about a cargo ship that is traveling in waters that are known for piracy and sure enough the Captain's cargoI was already familiar with the storyline as I had seen a documentary of it, so the drama for me was minimized, but pretty much it's about a cargo ship that is traveling in waters that are known for piracy and sure enough the Captain's cargo ship is targeted for piracy and there the adventure begins.  Of course, we're supposed to root for Captain Phillips but it's hardly a fair fight, since behind the Captain is all the mighty power of the American military.\rDon't mess with America, I suppose, but hey how about a little love and support for those impoverished but enterprising buccaneers.",
      "review_date": "2014-01-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I have to admit, for a movie based on a true story. The movie grabs your attention!  But that's Hollywood for you. From what I read, the REAL story is alittle different",
      "review_date": "2014-02-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is well-directed and fairly compelling but ends up overlong and unrealistic in parts.",
      "review_date": "2019-09-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Captain Phillips kept me on the edge of the seat the first hour and a half, then I lose it and recovered it at the end. It's strange how this film manages a great level of tension with such a simple storyline like a cargo ship hijacked byCaptain Phillips kept me on the edge of the seat the first hour and a half, then I lose it and recovered it at the end. It's strange how this film manages a great level of tension with such a simple storyline like a cargo ship hijacked by pirates. The clue here is that the movie makes the viewer feel threaten by the pirates, as if he was part of the crew; and the is accomplish because of close camera shots, mainly to the faces of the characters; in contrast with wide camera shots, used for the ship, the life boat and the pirate skiff; and also is the constant massages that the captain sent to the crew by loudspeaker. The story decline when arrives the help for the cargo ship, and here is where all the American power is put on the table, the problem is that is so exaggerated, at the point the it becomes rejectable. Although the end compensate the previous part. Here the direction might not be so good, but Tom Hanks's performance is worthy of an Oscar nomination (too bad that didn't happen) and Barkhad Abdi definitely is the innovation here.",
      "review_date": "2014-02-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A Hollywood-produced, politically correct, big studio vehicle, helmed by a world-class action artisan Paul Greengrass, stars the most revered actor of his generation, Tom Hanks as the titular captain, whose screen image is a paragon of anA Hollywood-produced, politically correct, big studio vehicle, helmed by a world-class action artisan Paul Greengrass, stars the most revered actor of his generation, Tom Hanks as the titular captain, whose screen image is a paragon of an orthodox ordinary Joe alike American hero, in this seafaring hijack inspired by a true event in 2009 at Somali waters. It is a retaliation of the vicious circle from the poverty-stricken to the hegemony which sardonically offers them the alms and simultaneously capitalizes on their natural resources and weaponry merchandizing, so it is not easy to hold a phlegmatic perspective to watch the man-made terror without deploring the sad truth how things have ended up like this, for sure we should inveigh against the piracy felony, all the same we should also see through the phenomena and ferret out the nitty-gritty which induces the atrocious tragedies. We have both parties to blame and need a soul-searching examination on our own conscience.\r Greengrass adopts an engaging procedure to re-enact the white-knuckle happening of how the ship is seized by four Somali pirates (leading by a scrawny Muse, played by the first-time actor, now Oscar-nominee Abdi), parallels the narrative from both sides, playing mind games and a hide-and-seek inside the vessel, this is the first half, culminated with the pirates take captain Phillips as the hostage in a lifeboat, floating back the Somali. Apparently from the hindsight, it is a preventable incident, considering it is a US cargo ship, no one on board is equipped with any firearms at all? From a gun frenzy country where campus shooting is rampant, it is quite implausible, but sometimes the truth is as simple as that, the pirates’ boarding process is rough and ready, clearly the affluent corporate which owns the ship skimps on its defense system, although they are fully aware of the potential peril could happen anytime. Otherwise, there would be no big deal to defeat four sea marauders (one is barely a child) even they’re equipped with AK-18.\r Anyway, the second half, Captain Phillips is held captive within a lifeboat with the pirates on the billowy sea, since then, the film heavily hinges on Hank’s performance to emanate the brewing desperation during the so-called “negotiation” between US rescue team (SEAL, frogmen are all standby) and the cornered pirates four. It is a precious platform to let Hanks finally have something extraordinary to offer, he completes it with consummate precision and sublimates the predictable fallout of the false hope. Unfortunately due to a crammed year with sterling candidates, Hanks is left out of the nomination list, quite an upsetting snub, but he plays a real person who lacks for a distinctive character except he is under an extreme situation, not showy enough is the detrimental disadvantage. Abdi is the MVP among the pirates four, not as irritable and impatient as the hackneyed short-fuse Najee (Ahmed), he is a human being with flesh and blood, he is the one captain Phillips can relate to under such circumstances, all diversities aside, basically they both work for their respective bosses and want to finish their jobs with minimal casualties. His bold final move can be interpreted as a smart judgment call, his American dream ironically fulfills in a different way, at least he can be plumb free of his ill-destined fate.\r Nominated for 6 Oscars including BEST PICTURE (both Hanks and Greengrass are brutally snubbed here), CAPTAIN PHILLIPS is at best an unbiased recount of a man’s individual struggle during a hanging-by-a-thread ride, and at worst, it is an unimaginative hostage story with jejune perpetrators wield weapons and demand unrealistic ransom, no one can beat the principled USS army, do you get the message?",
      "review_date": "2014-01-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The two hour run time was sort of needless and while Tom Hanks was fantastic, Everyone else on the cast did not have much in terms of dialogue and even when they had it, It was the bare minimum. It was still a pretty solid movie overall andThe two hour run time was sort of needless and while Tom Hanks was fantastic, Everyone else on the cast did not have much in terms of dialogue and even when they had it, It was the bare minimum. It was still a pretty solid movie overall and worth checking out if you are a fan of Hanks, Just don't expect to get blown away by it. The film, at least in my opinion, failed to capture the seriousness of the situation and it was actually sort of laughable the way it was too over-dramatic at times.",
      "review_date": "2014-03-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a moderately dramatic movie that's largely harmed by the fact that, because it follows a real life event that was in the news for several days, you know the ending well in advance. The last third of the movie drags out a bit when theThis is a moderately dramatic movie that's largely harmed by the fact that, because it follows a real life event that was in the news for several days, you know the ending well in advance. The last third of the movie drags out a bit when the conclusion of everything becomes obvious (or you remember it from the news), and then you're waiting around for something to happen almost as much as everyone else is. Still, I liked a lot of the acting and the script, so it comes out average.",
      "review_date": "2014-08-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the greatest amazing acting films of the year is Captain Phillips. With amazing acting by Tom Hanks and newcomer Barkhad Abdi this film is gut wrenching and an amazing film to watch.",
      "review_date": "2014-01-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Entertaining and well-directed on the water, I was haunted by Barkhad Abdi's debut but left a little lukewarm from Tom Hanks. There's a reason he wasn't nominated by Oscar, and I agree with it.",
      "review_date": "2014-09-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "As much as I hate this movie for the false story it portrays which has been argued by the crew who had proven otherwise that Phillips was incompetent and who's actions nearly caused some of their deaths, the entertainment value made it worthAs much as I hate this movie for the false story it portrays which has been argued by the crew who had proven otherwise that Phillips was incompetent and who's actions nearly caused some of their deaths, the entertainment value made it worth the watch with Tom Hanks doing one of the best acting jobs I have seen in a long time.",
      "review_date": "2014-03-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Paul Greengrass is a director who always focuses his attention on depicting on screen events as realistically as possible and Captain Phillips is no exception. Its riveting and thrilling and the last 40 minutes are directed to near perfectionPaul Greengrass is a director who always focuses his attention on depicting on screen events as realistically as possible and Captain Phillips is no exception. Its riveting and thrilling and the last 40 minutes are directed to near perfection with a scene with Tom Hanks that is the best scene in a movie so far this year.",
      "review_date": "2013-11-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie ultimately works with Tom Hanks to thank. The problem is there isn't much story and the climax(while good) came way overdue. The first half of the film was quite exciting and unpredictable, but then it just meanders.",
      "review_date": "2013-12-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Honestly, this movie was a little overrated, but it was still worth watching. It had good action and a good storyu, but parts of it were pretty boring.",
      "review_date": "2014-03-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was  good flick that i didn't expect to see (but came up during a flight). Hanks doesn't wow on the screen but a rather vanilla. As is the supporting cast. However, the story is what saves this film. As the film progresses you can beginThis was  good flick that i didn't expect to see (but came up during a flight). Hanks doesn't wow on the screen but a rather vanilla. As is the supporting cast. However, the story is what saves this film. As the film progresses you can begin to really feel the tension which is probably 100% less than what it was really like.  You cetrainly find yourself rooting for Hank's character, and as this is based on a true story, makes for a cherry on top;.",
      "review_date": "2014-02-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Really really intense film, which made for a very exciting and satisfying experience. Tom Hanks is great in the lead role, as expected and throughout, the expected thrills and suspense are absolutely there as you find yourself virtually onReally really intense film, which made for a very exciting and satisfying experience. Tom Hanks is great in the lead role, as expected and throughout, the expected thrills and suspense are absolutely there as you find yourself virtually on the edge of your seat at times. What was unexpected, for sure, is the sympathy I personally felt for a couple of the pirates, in particular Barkhad Abdi's character. You certainly get the sense that he does not want to be doing this, but has no choice as it is the only way he can make any money in Somalia. In spite of that, director Paul Greengrass is still able to instill the sense of fear felt by Phillips as the pirates prove again and again that they are unpredictable and prone to rash decisions, which really makes you worry for Phillips and will become of him. Overall, Captain Phillips is a very entertaining film that is entirely straightforward (not a knock) and proves to certainly be another strong entry in what was a great year of film in 2013.",
      "review_date": "2014-04-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Captain Phillips is a great movie that was much beter than I expected. I am always skeptical about movies base on real events because you know how it ends. Plus the previews showed an awful lot of the movie;s story in it. But the movie wasCaptain Phillips is a great movie that was much beter than I expected. I am always skeptical about movies base on real events because you know how it ends. Plus the previews showed an awful lot of the movie;s story in it. But the movie was quite good and did an excellent job of creating suspense. My only problems with the movie were the weak character introductions. You realize Phillips is a father and that his family is in, what appears to be a minor crisis, but not much else is learned. Obviously the point of it was to show that Phillips had a family who depended on him, which increased our desires as viewers to see him live. But I feel with such a lack of developemt it was pointless to show. Other than that the movie is top notch.\rOnce Phillips is aboard the ship the movie keeps you on the edge of your seat. Hanks does an excellent job portraying Phillips and Greengrass's direction creates the tension and action neccessary for the film. Another plus, is the casting, which creates a very authentic feel to the movie. The actors playing the pirates do a terrific job. So, I definitely would recommend this movie, aside from the weak opening it is fantastic.",
      "review_date": "2013-11-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great movie! Captain Phillips kept my interest the whole time.This is a must see movie.It feels short even though it`s not, cause you just lose a track of time trying to see what happens next.",
      "review_date": "2014-06-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie is inspired by the American cargo ship called Maersk Alabama's hijacking that took place in 2009 on the eastern coast of Africa. For many who think it is similar to Danish movie 'A Hijacking' it is not. Both the movies are aboutThe movie is inspired by the American cargo ship called Maersk Alabama's hijacking that took place in 2009 on the eastern coast of Africa. For many who think it is similar to Danish movie 'A Hijacking' it is not. Both the movies are about Somalian pirates, but a totally different stories which were based on individual true events. One was very much realistic about ransom negotiation and the other one was a clean entertainer on the opposite.\r Maersk Alabama is the first American ship to be hijacked in over 200 years. Tom Hanks as captain Richard Phillip was brilliant. He continues to give his performances on the variety of roles in his movies compared to any other actors. That is why he's one of the rare actors in all fine movies of his.\r As a formality the movie begins with the story where the captain Phillips' journey commence from his residence in America. After he flee to Oman to take his ship back to his country, he encounters the threat from a small group of pirates. Once the ship was held by the Somalians pirates the series of incidents occurs before the captain is taken as a hostage in a lifeboat. Then after there's no drama, everything was remarkably shown in those crucial parts with a slightly drag in ending. But the tensions were very well captured and wonderfully exhibited to us.\r With an excellent direction from the director of the Bourne movie series, this movie came in his another top-notch. The movie had plenty of thrilling scenes takes you to the edge of your seat. One of those segments where I got stunned was when the ship was being held by pirates and when navy approaches to the lifeboat. In those parts I just said, wow!. Now my eyes on OSCAR, how many it will gain and lose is I must wait and watch.\r 8.5/10",
      "review_date": "2014-01-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Dragon Age II is the story told by Varric  to Cassandra and at times we see him change his tale to embellish his story and notably his own role in it.  Most stories are like Varric's tale: never exactly the truth, because even without intentDragon Age II is the story told by Varric  to Cassandra and at times we see him change his tale to embellish his story and notably his own role in it.  Most stories are like Varric's tale: never exactly the truth, because even without intent the story changes with the telling.\rSo one can  forget about the truth of the story of one Captain Phillips and his ship as it is impossible for us to know what 'really' happened.  At best one can say that it is based on a real incident.\rCaptain Phillips is mostly the movie of Tom Hanks, who plays a somewhat timid heavy set older commander of a cargo ship travelling from Oman to Kenya. This exposes the ship to attacks from Somalian pirates whose aim is to capture the ship so they can exchange it for money.  Since the ship and it's cargo are worth millions it looks like easy money for anyone with a gun and a vessel vast enough to overtake the lumbering ships.  Somalia itself is in anarchy can do nothing to stop so it is up to a coalition of nations to patrol the international waters and deal with the pirates.\rThe movie, despite being long, never bores as it keeps up the tension. The story follows both the pirates as the captain and his crew.  The final part leads to a shocking confrontation.\rThe problem with good movies is that there isn't much to complain... well almost not. There are a few gripes. For one I can never quite get to see the Somalian side of things. We are given to understand that their choice is limited to fishing or piracy. With the first having been made impossible due to over-fishing by foreigners(so one of them says) only piracy is left as an option. This is all told as in an afterthought and given the length of the whole movie feels like there is only lipservice being paid to make us understand the side of the pirates. It would have been a better movie if more time was spend to give some idea why these people do what they do.\rIn addition what I simply fail to understand is why nobody bothers to do anything after the ship escapes the first attack. A whole night passes without any naval vessels showing up. Nor does Phillips apparently call someone to notify them of the incident. I find it baffling that not even one airplane is send to reconnoiter  the area  to establish the location of the pirate ships, just one would have sunk their ambitions to the bottom of the ocean. And why is not  a team of soldiers dropped of at the ship when it was certain that it had been under attack the day before? Even two soldiers could have beaten off the attackers. In fact, probably one would have been enough.\rOtherwise a great movie with a great role for Tom Hanks, who makes the movie what it is. For better or worse.\r Merit",
      "review_date": "2016-01-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The master of shaky cam Paul Greengrass directs this tense, exciting version of Richard Phillips true story.\r It all gets off to a good start, the main characters Captain Phillips and the Somalian pirates are set up. We know why there doingThe master of shaky cam Paul Greengrass directs this tense, exciting version of Richard Phillips true story.\r It all gets off to a good start, the main characters Captain Phillips and the Somalian pirates are set up. We know why there doing what there doing and how there paths cross. But it's all just the build up to when the pirates get onto the ship, a very good build up though.\r One of my favorite things about the movie which I only noticed once it had finished, is that instead of the pirates killing crew members left, right and center and the crew members attacking the pirates with makeshift weapons (which is how the movie would have been if Michael Bay was the director)  the pirates gain access to the ship and try to find out where everyone is and let Captain Phillips know whose boss  realistic things. The whole movie has this tone, there aren't any huge explosions and bloody gunfights  with big body counts. It all stays realistic.\r However the main attraction of the movie which is why, I think, it's so memorable and being hailed as one of the best movies of the year so far  is Tom Hanks. He gives the performance of a lifetime (yes even better than Toy Story). I'm talking Heath Ledger as The Joker standard, now you understand how good he is. Every single second of screen time with him in it is amazing and masterfully acted. I would say that he deserves the Oscar for this year, but I haven't seen Gravity yet. Seriously though Tom Hanks acting in the last scene of the movie is phenomenal and I will buy the DVD just to see that again.\r Captain Phillips is one of my favorite movies of the year so far  a must see.",
      "review_date": "2014-01-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great and very solid film. Tense and thrilling with some realistic action. Good plot and acting on point. In fact the acting from Tom Hanks is near perfection, first because you don´t even notice he is acting, you just follow the story andGreat and very solid film. Tense and thrilling with some realistic action. Good plot and acting on point. In fact the acting from Tom Hanks is near perfection, first because you don´t even notice he is acting, you just follow the story and are in from the beginning, and then because towards the end of the film he shows what he´s capable of. Great performance. But the acting from the main pirate is outstanding too, especially for a person who has never acted before. The films does good at explaining the reasons why all these people are in this situation and it works. Only little flaws: it could have been slightly shorter (only a little bit) and the ending gets a little too melodramatic in a way that the rest of the movie was not. Still outstanding.",
      "review_date": "2014-04-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I really liked this movie.  It's tense, exciting, engaging, and ultimately very memorable.  Greengrass's direction is excellently gritty and authentic.  Under his control everything in the film seems impressively real.  I can't believe HanksI really liked this movie.  It's tense, exciting, engaging, and ultimately very memorable.  Greengrass's direction is excellently gritty and authentic.  Under his control everything in the film seems impressively real.  I can't believe Hanks was snubbed out of an Oscar nomination.  His performance was beyond first rate, especially towards the end of the film.  The script is also very well done, even to the point of giving a touch humanity to the vicious main villain.  I can't however shake the feeling that the film is somewhat limited.  It works great as an action film, as well as a drama, but I can't help but feel that it was lacking... something.  It also ends too abruptly.  Other than those very small disappointments though, this is definitely a must see movie.  I also highly recommend buying it.",
      "review_date": "2014-02-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A pretty thrilling and gripping story, but Tom Hanks isn't unleashed until the very end! His character appears, to me, at least, to be somewhat one dimensional emotionally for a good majority of the film. Still a fun movie, though.",
      "review_date": "2013-11-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Looks like a mix of everything we've seen in year, drama, suspense, action, everything, and well executed and directed, does not look like a \"based on true events\" empty, it seem who has a heart there, not only in Philips, but also, in theirLooks like a mix of everything we've seen in year, drama, suspense, action, everything, and well executed and directed, does not look like a \"based on true events\" empty, it seem who has a heart there, not only in Philips, but also, in their own \"villains\".\rIn the end, can be embraced as a horror movie, or even a documentary, because like most of the time, the stronger stands on end.",
      "review_date": "2014-03-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "2 words: Tom Hanks. No one could have played this part any better. This true story shows how captain Phillips risks everything to protect his ship and his crew. The ending is one of the bests I've ever seen. If this isn't nominated for Best2 words: Tom Hanks. No one could have played this part any better. This true story shows how captain Phillips risks everything to protect his ship and his crew. The ending is one of the bests I've ever seen. If this isn't nominated for Best Picture at the Oscars then I will be upset",
      "review_date": "2013-12-17",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 148,
  "genres": [
    "Action",
    "Adventure",
    "Biography",
    "Drama",
    "Thriller",
    "Crime"
  ]
}