{
    "title": "The Starving Games",
    "rating": 1.7,
    "release_date": "2013-11-08",
    "genre": [
        "Comedy"
    ],
    "summary": "Set in the most depressing corner of a post-apocalyptic future, our hero Kantmiss Evershot (Maiara Walsh) volunteers to take her manipulative younger sister's place in the 75th annual Starving Games. In doing so, she must leave behind her smoldering just-a-friend Dale (Brant Daugherty) and team up with the geeky baker's son Peter MalarkeySet in the most depressing corner of a post-apocalyptic future, our hero Kantmiss Evershot (Maiara Walsh) volunteers to take her manipulative younger sister's place in the 75th annual Starving Games. In doing so, she must leave behind her smoldering just-a-friend Dale (Brant Daugherty) and team up with the geeky baker's son Peter Malarkey (Cody Allen Christian) in a fight for her life. But wait, there's more! She could also win an old ham, a coupon for a footlong sub at a six-inch price, and a partially-eaten pickle! [Ketchup Entertainment]… Expand",
    "critic_reviews": [
        "It seems even more slapdash and desperately unfunny than their earlier work.",
        "The writing-directing team of Jason Friedberg and Aaron Seltzer now take aim at \"The Hunger Games\" with their latest effort, The Starving Games, and the fact that the title, as witless and uninspired as it may be, constitutes its humorous high-water mark should indicate just how ineptly they handle things this time around.",
        "The Starving Games is the sixth directorial effort from Jason Friedberg and Aaron Seltzer, and they are nothing if not consistent."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "Your lack of comedy is disturbing.\r This movie is a bust, after five months it will be forgotten with all the other meaningless parodies(Most were made by the same people, be original, guys!). Ever since the mainstream \"Scary Movie\" inYour lack of comedy is disturbing.\r This movie is a bust, after five months it will be forgotten with all the other meaningless parodies(Most were made by the same people, be original, guys!). Ever since the mainstream \"Scary Movie\" in 2000(Which was good, actually) parodies have been nothing original, same slapstick-turned-wired comedy and randomness that does not seem so random anymore. It seems like that overtime, the genre has been losing what sense is left in the plot and focusing on parts that will make you say \"What the f*ck?\" and then laugh with your friends. This movie(along with other parodies) are not meant to be watched alone, but with friends, then talk about the funny parts with other friends and so on. Overall this movie lies within all the other parodies of the 2000's- A conversation starter.",
            "review_date": "2013-11-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is one of the worst movies ever made. I have no problems with parodies but if they were done bearably, \"Scary Movie\" franchise got down the hell but for the most part it was passable. \"The Starving Games\" seems like those YoutubeThis is one of the worst movies ever made. I have no problems with parodies but if they were done bearably, \"Scary Movie\" franchise got down the hell but for the most part it was passable. \"The Starving Games\" seems like those Youtube parodies that are noticed when the movie goofed is forgotten.",
            "review_date": "2014-03-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Alright, I'm serious here. I found this funny at some parts. Some jokes reek of utter unfunnyness but some jokes make me laugh. If you're easily amused (like me) you might like this a little bit. If not, it seems like you'll despise this movie.",
            "review_date": "2014-07-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "if you dare to watch this, watch with absolute vodka to kill the pain because This movie is absolute garbage! probably the worst movie that has graced our eyes this year Scary Movie V was unfunny but the startwas pretty hilarious, movie 43if you dare to watch this, watch with absolute vodka to kill the pain because This movie is absolute garbage! probably the worst movie that has graced our eyes this year Scary Movie V was unfunny but the startwas pretty hilarious, movie 43 gave me a few laughs here and there..BUT THIS!? REALLY?! DONT WATCH THIS  DISASTROUS PILE OF GARBAGE!",
            "review_date": "2013-11-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I am sick of seeing this film!!!! My 8 year old thinks it's hilarious & has made me sit through it on numerous occasions. Personally I would rather gouge my eyes out with a rusty spoon, it really is that bad! Don't bother watching it, do theI am sick of seeing this film!!!! My 8 year old thinks it's hilarious & has made me sit through it on numerous occasions. Personally I would rather gouge my eyes out with a rusty spoon, it really is that bad! Don't bother watching it, do the dishes instead!",
            "review_date": "2014-01-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If you think the Starving Games is a great Hunger Games spoof, something's definitely wrong with you. At least take your time to watch it again to prove how bad this movie is.",
            "review_date": "2016-02-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is so terrible that it made me laugh at it. Does that count as a good movie?This is one of the worst movies i've ever seen, of course, but...that's why I love it.I can't rate it too high or too low. I'm so confused.",
            "review_date": "2021-04-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If you think this film might be alright, you might want to seek therapy, if you have friends that want to see this film, check them into an insane asylum, if you get tickets to this as a gift or a prize BURN THEM and post them on Twitter.If you think this film might be alright, you might want to seek therapy, if you have friends that want to see this film, check them into an insane asylum, if you get tickets to this as a gift or a prize BURN THEM and post them on Twitter.\r This film is an absolute abomination, its a cringeworthy fest from start to finish made by the same guys who did Date Movie, Epic Movie, Meet the Spartans and Disaster Movie who recycle the same jokes with pointless references and prop gags, and they haven't gotten any better with out of nowhere poorly animated Angry Birds and a pointless PSi appearence with no context whatsoever.",
            "review_date": "2013-11-08",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Poor CGI, poor acting says it all doesn't it? One would think that after a couple movies the directors would be better but boy was I wrong. Don't get me wrong though, the movie has it's moments such as when a bad spoof of the Annoying OrangePoor CGI, poor acting says it all doesn't it? One would think that after a couple movies the directors would be better but boy was I wrong. Don't get me wrong though, the movie has it's moments such as when a bad spoof of the Annoying Orange appears, would be much better with the original one. There were a few jokes that made me laugh but all together the movie was not fun.\r It's supposed to be a comedy movie but making poor jokes, poor spoofs is not the right way. When The Expandables crew appears it's just plain stupid as the guys playing the crew can't even act specially not \"Chuck Norris\". This movie is not worth the time and if you think you're gonna have a blast, think again.",
            "review_date": "2013-11-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I'm not going to lie, this is quite possibly my favorite low-budget parody film I've ever seen. Most of the jokes are on the money and catch you off guard just the way they're supposed to. And I'll be honest, even the acting was good. I'veI'm not going to lie, this is quite possibly my favorite low-budget parody film I've ever seen. Most of the jokes are on the money and catch you off guard just the way they're supposed to. And I'll be honest, even the acting was good. I've seen good actors try and act poorly before but this cast delivered. Speaking of the cast, Maiara Walsh is gorgeous. I hope she can break out of the low-budget niche film market and onto the big scene a bit because she's legit. If you're looking for a serious film, this obviously isn't for you but this is definitely a movie worth watching if you're looking for a cheap laugh or two or twelve.",
            "review_date": "2014-06-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Mildly funny, but I still strongly dislike it. Better than Disaster Movie, and that's, a step up.",
            "review_date": "2020-04-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "My review:\r Waste of money, time and breath.\rCalling this a comedy is dishonest for other good comedies.\r [I am just filling this area because Metacritic wants so.]\r [Thank you for your attention]",
            "review_date": "2014-11-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "i usually give this type of movies a try since you can get some cheap laughs in some of them. this is not the case. so give this one a pass and check out something else",
            "review_date": "2014-01-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Wow, this is literally the dumbest thing I've ever seen. After the first few minutes you can tell how bad it's going to be. Only 2-3 funny moments in an hour and a half long movie. Most of it was spent with my face in my palm.",
            "review_date": "2014-03-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "What has happened to movie parody's? Its gone from being a legitimate genre, thanks to movies like Airplane and Austin Powers, to this!\r In all honesty I am not quite sure how the creators get away with almost copying a movie scene forWhat has happened to movie parody's? Its gone from being a legitimate genre, thanks to movies like Airplane and Austin Powers, to this!\r In all honesty I am not quite sure how the creators get away with almost copying a movie scene for scene without infringing on some sort of copyright, unless the addition of random pop cultural references makes it OK.\r The only positive is the acting is better than other similar movies.",
            "review_date": "2014-07-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I watched for 25 minutes, i then threw the film in the trash, the acting is forced and terrible, the effects are extremely sub par, and overall it makes for a incredibly none funny film, it is just plain bad.",
            "review_date": "2013-11-23",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "In the 1970's, Mel Brooks and Monty Python made spoof films a fixture in American movie theaters. In the years that have followed, we've even seen franchises like, Scary Movie, Date Movie, Epic Movie, and Superhero Movie, but when was theIn the 1970's, Mel Brooks and Monty Python made spoof films a fixture in American movie theaters. In the years that have followed, we've even seen franchises like, Scary Movie, Date Movie, Epic Movie, and Superhero Movie, but when was the last time you saw a spoof that was actually any good? Because of my love of the Hunger Games, I actually gave it's spoof a chance and I'm sorry I did. There were a lot of things here that could have been made fun of, but they weren't. The film gets so desperate that they actually turn to Avatar, The Avengers, and the action star of the Expendables, to make the thing long enough to be a full length film. I understand that the purpose behind spoof films is to be so ridiculous, that people laugh at how stupid it is, but there is a point where it is so beyond stupid and childish, that no one finds it funny anymore. The Starving Games quickly crosses this line and doesn't go back. It's a comedy making fun of one of my favorite series of all-time, a series I know like the back of my hand, and I hardly laughed. The only thing this film does well is cast actors who closely resemble the cast of the Hunger Games franchise. Beyond that, the acting is terrible, the jokes wouldn't even make children laugh, and the story is so out there, that eventually you're not even sure what they are doing. While spoofing big movies has become big business, this one does nothing but annoy everyone who was dumb enough to watch it.",
            "review_date": "2014-03-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Aaron and Jason are two people who clearly don't know how to make a film. The Starving Games is a parody of The Hunger Games and a really bad one. It's like watching Katniss sh*t on Conan.  This film is horrible and made by the people whoAaron and Jason are two people who clearly don't know how to make a film. The Starving Games is a parody of The Hunger Games and a really bad one. It's like watching Katniss sh*t on Conan.  This film is horrible and made by the people who made Date Movie, so don't watch it period.",
            "review_date": "2013-11-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Usually, people on Metacritic with a review under 3 have a personal hatred and biased opinion towards what they review. But when a movie as bad as The Starving Games comes out, all the 0 and 1 reviews are shared. Only time will tell whenUsually, people on Metacritic with a review under 3 have a personal hatred and biased opinion towards what they review. But when a movie as bad as The Starving Games comes out, all the 0 and 1 reviews are shared. Only time will tell when Jason Friedberg and Aaron Seltzer decide to stop making awful parodies of great movies and kill themselves.",
            "review_date": "2013-11-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Essentially yet another Seltzerberg film (after Vampires Suck, which premiered in 2010). This, like all of their other films, manages to use the same, tired formula of referencing every film from the last 18 months with little to no satireEssentially yet another Seltzerberg film (after Vampires Suck, which premiered in 2010). This, like all of their other films, manages to use the same, tired formula of referencing every film from the last 18 months with little to no satire done whatsoever and whatever satire they try to do results in infinitely worse gags that only make the viewers realize how good whatever films and media being spoofed are thanks to lazy, nasty slapstick. You might think that in the 3 years between this and Vampires Suck their creativity and talent improved, but no, it just gets worse. To sum all o f this up. Seltzerberg is the Christian Weston Chandler of film, and their movies are their Sonichu, as they written with neither creativity nor talent. It seems that when they decided to direct a film, they looked over to Christian Weston Chandler for help and instructions on how to write and direct a film.",
            "review_date": "2013-12-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Actually, although one of the worst comedies ever, it tries hard to make you laugh, it doesn't technically succeed but you giggle a bit throughout, not because it is funny, but by how bad it is. The \"special\" effects are anything butActually, although one of the worst comedies ever, it tries hard to make you laugh, it doesn't technically succeed but you giggle a bit throughout, not because it is funny, but by how bad it is. The \"special\" effects are anything but \"special\", the characters are annoying and insulting to the protagonists of the spoofed movies. Is it recommended for everyone? No, it is hardly recommended for anyone, it is one of the worst, but if you are dying to watch it, it is only 69 minutes without the 7 minutes unnecessary bloopers. Avoid.",
            "review_date": "2014-03-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The sixth directorial effort from the serial killers of the spoof genre writer-directors Jason Friedberg and Aaron Seltzer, tackle a  sci-fi hit \"The Hunger games\" the title  \"The starving games\" is not clever it's witless, the acting isThe sixth directorial effort from the serial killers of the spoof genre writer-directors Jason Friedberg and Aaron Seltzer, tackle a  sci-fi hit \"The Hunger games\" the title  \"The starving games\" is not clever it's witless, the acting is terrible and the film is pointless. The humor in the film barely gives the  laughs, the filmmakers put effort in trashing it, instead of putting it into the script. Okay the film does have a few chuckles but it's replaced with dumb characters and it's one liners. Grade D-",
            "review_date": "2015-06-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Unwatchable. A mess of humor, acting, story, and everything cinema has worked an entire century for. I had to take a long, cold shower after watching this. And the worst thing is there will be more of these.",
            "review_date": "2014-07-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Nothing memorable, just complete stupidity.  Although it could be actually very funny at some points, nothing clicks and it's just a garbage film.  Easy to make fun of.Rating: F",
            "review_date": "2018-04-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Did you know that this movie was made by a teenager who won the lottery? That was a joke, a joke that I hope was funnier than this entire movie. Sure, there are a few genuine laughs, but those don’t make up for the sea of forced pop cultureDid you know that this movie was made by a teenager who won the lottery? That was a joke, a joke that I hope was funnier than this entire movie. Sure, there are a few genuine laughs, but those don’t make up for the sea of forced pop culture references and crude jokes that Cartoon Network would be above. If I can give the filmmakers props for anything, it would be that the sets and costume designs look very much like the ones from the original film that this one parodies, “The Hunger Games”. Bottom line don’t waste your time on watching this.",
            "review_date": "2021-11-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Honestly, this movie has some decent writing. Its so bad it’s good. It’s like Spaceballs in the sense that the jokes are so unfunny, that it’s funny. The CGI is so bad it’s funny. All in all, it’s a great parody",
            "review_date": "2023-01-30",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 29
}