{
  "title": "The Last Exorcism Part II",
  "rating": 3.8,
  "release_date": "2013-03-01",
  "genre": [
    "Thriller",
    "Horror"
  ],
  "summary": "At a New Orleans halfway house for girls, Nell Sweetzer attempts to recover from the trauma of the first film, but the demon that possessed her returns with an even more horrific plan.",
  "critic_reviews": [
    "Ashley Bell’s nuanced performance and a surprisingly pyrotechnic finale liven up a gloomy sequel. Title’s still nonsense, mind.",
    "Never mind the inherent titular redundancy: The Last Exorcism Part II is a generally effective sequel to the 2010 sleeper that injected at least a little new life into the heavily taxed found-footage-horror subgenre.",
    "At least this movie, like its predecessor, has Ashley Bell as Nell. An actress who suggests religious piety, carnal fire and satanic aggression with equal dexterity, Ms. Bell provides a pulse an audience can connect with amid the standard-issue atmospheric accouterments.",
    "The Last Exorcism Part II is an effectively unnerving, slow-burn supernatural horror tale. The film is smartly different enough from the original to survive on its own, though it lacks some of the first film's sense of surprise.",
    "Unfortunately, no one involved seems to have bent over backwards to make the movie either original or even all that scary.",
    "Once the “what is real, what is fantasy” questions are answered, and exorcism part deux commences, The Last Exorcism Part II abandons its half-intelligent, tender exploration of Nell’s vulnerability and desirability",
    "Somewhere inside The Last Exorcism Part II is a very good thriller — a genuinely unnerving movie about possession — struggling to get out. But then the sound drops out, the music shrieks, a figure jumps out, and we’re back to the same old, same old.",
    "At the end of the day, it’s a sure-handed sequel, but not a terribly thrilling one.",
    "It's competently made, but pointless.",
    "A stylistic departure from the shaky aesthetic of the first film. Sadly, most of its nervy shocks and creeping sense of unease go the same way.",
    "Now Bell can break out of the genre. She's served her time.",
    "Unfortunately, while director/co-writer Ed Gass-Donnelly displays an admirable restraint in his general eschewing of gratuitous gore, quick editing and flashy visuals, the results have a generally soporific feel.",
    "When the creators of The Last Exorcism Part II swapped pseudo-verité realism for psychological realism, they made it a lot harder to take their franchise seriously.",
    "Scenes of solemn importance drag on to the point of self-parody in an attempt at establishing mood, while dialogue reeks of connect-the-dots spoonfeeding.",
    "An abysmal sequel that abandons the found-footage concept, along with the pockets of wit and originality that made its predecessor salvageable.",
    "An ineffective excursion that maintains a few direct ties back to the original film but never moves the story forward.",
    "It’s the kind of garbage that does a disservice to the fearless possibilities of the horror genre and its knack for sly social commentary.",
    "Part II is every bit as cheap and far more generic, nothing more than a run of the mill ghost story masquerading as The Devil Made Her Do It.",
    "The actual exorcism sequence, involving three well-meaning cult members and a chicken, is strangely uneventful – and if there’s one thing a movie exorcism should never, ever be, it’s that.",
    "The film, however, is short on genuine scares and ingenuity."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "There is absolutely no reason to see this movie. It was clearly made just for money. Since the movie barely put any effort in entertaining the audience, I will barely put any effort into writing this review. Some say this movie should've goneThere is absolutely no reason to see this movie. It was clearly made just for money. Since the movie barely put any effort in entertaining the audience, I will barely put any effort into writing this review. Some say this movie should've gone straight to DVD. No. This movie should've gone straight up the directors ass so no one will ever be able to see this abomination.",
      "review_date": "2013-04-29"
    },
    {
      "review_title": null,
      "content": "This movie had no reason to be made. It really should've been straight to DVD, if not scrapped completely. If you want a better movie in the Exorcism genre, go watch The Exorcist.",
      "review_date": "2013-03-02"
    },
    {
      "review_title": null,
      "content": "Although it had no reason to be made, I enjoyed it more than the first one, but it doesn't mean it is better than the first, this one has some cliches, and a lot more jump scares than the first one, but the acting is very good and it is wayAlthough it had no reason to be made, I enjoyed it more than the first one, but it doesn't mean it is better than the first, this one has some cliches, and a lot more jump scares than the first one, but the acting is very good and it is way more entertaining, I enjoyed it very much, it wasn't great, but good as a sequel that resolves nothing",
      "review_date": "2013-06-01"
    },
    {
      "review_title": null,
      "content": "The Last Exorcism Part II is short on blood and gore, high on cliched and outdated ideas of jump scares that actually work! Despite that this is not a necessary sequel, it is fun with atmospheric mood and cold temperature to it, which everyThe Last Exorcism Part II is short on blood and gore, high on cliched and outdated ideas of jump scares that actually work! Despite that this is not a necessary sequel, it is fun with atmospheric mood and cold temperature to it, which every horror movie (especially ghost movies) need. The Last Exorcism Part II is sometimes uneven and sometimes predictable, cliched but fun horror movie to watch.",
      "review_date": "2013-07-25"
    },
    {
      "review_title": null,
      "content": "\"The Last Exorcism: Part II\" gives the devil plenty of space and time to show off his handiwork, but apart from making young women contort their bodies--that's about all he does. The film is short on genuine scares and any ingenuity. So many\"The Last Exorcism: Part II\" gives the devil plenty of space and time to show off his handiwork, but apart from making young women contort their bodies--that's about all he does. The film is short on genuine scares and any ingenuity. So many sequences are structured, that the pattern becomes predictable and tiresome. Especially since the first film at least set a standard for originality--this sequel--which reshapes it's creative team, delivers nothing ",
      "review_date": "2013-03-10"
    },
    {
      "review_title": null,
      "content": "After seeing the first movie I thought this would be okay but I was wrong. If it wasn't for Ashley Bell I wouldn't have seen this movie at all. The ending was different but still not good. The original was a much better movie then this. ThereAfter seeing the first movie I thought this would be okay but I was wrong. If it wasn't for Ashley Bell I wouldn't have seen this movie at all. The ending was different but still not good. The original was a much better movie then this. There was nothing that stood out about this movie and the special effects were mediocre at best. Not a good movie at all.",
      "review_date": "2013-03-03"
    },
    {
      "review_title": null,
      "content": "Nothing!!!!! Absolutely nothing!!!! Stay away from this............piece of......you know. No horror, no drama. Go somewhere else to spend your money!!! NONSENSE!!",
      "review_date": "2013-10-28"
    },
    {
      "review_title": null,
      "content": "Stupid. Horrific. And Stupid. The Last Exorcism Part 2 was just really fashionable. Or you think so? Tis film has Ashley Bell with a broken stupid role and the film has no compelling with the original. NOT EVEN A SINGLE COMPELLING. It has aStupid. Horrific. And Stupid. The Last Exorcism Part 2 was just really fashionable. Or you think so? Tis film has Ashley Bell with a broken stupid role and the film has no compelling with the original. NOT EVEN A SINGLE COMPELLING. It has a broken horror story and bad dialogues with the special effects used at the wrong time. Fans of the original might put up with it but IAM definitely sure this film will disappoint horror film lovers.",
      "review_date": "2013-03-01"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe Last Exorcism Part 2 is much better than the first one. It is more entertaining and scarier. It has some suspense and the girl is acting really good. The ending was a bit of strange and the plot had many gaps and it left you some questions about this movie. It was a good sequel though I expected to see Nael's brother who was in that kind of sorority in the end of the first one. However, it is entertaining despite the fact some things will not be easily understood or actually explained. Maybe the producers should have read again the script. I didn't understand the ending. she destroys the world or something like that? Not sure. HOWEVER, is is an enjoyable horror film and much better than the first one. It will scare you at some moments and make you stand up from your chair. Not a must-see but a good horror film just for fun if you want to be scared ",
      "review_date": "2013-07-11"
    },
    {
      "review_title": null,
      "content": "Though the first part of \"The Last Exorcism\" was relatively good except for the end, the second part was like a dart thrown thousand of kilometers far from the reveille. It's just simply LOATHSOME. The worst horror film that I have everThough the first part of \"The Last Exorcism\" was relatively good except for the end, the second part was like a dart thrown thousand of kilometers far from the reveille. It's just simply LOATHSOME. The worst horror film that I have ever watched in my entire life.",
      "review_date": "2014-01-18"
    },
    {
      "review_title": null,
      "content": "The story is not that bad but the execution and build up of the scary moments are not very good. Like, there is a scene when the girl is sleeping with the other girls and she gets a late night visit from Abalam. Well, just ignore everyoneThe story is not that bad but the execution and build up of the scary moments are not very good. Like, there is a scene when the girl is sleeping with the other girls and she gets a late night visit from Abalam. Well, just ignore everyone else...and just touch her? It felt like I was watching a censored or blocked version of the movie. Some of the acting was decent, but the supposded boyfriend was not very convincing to me. He at first was a random guy, and then turns out to be a stalker and then gets possessed? The sound effects and visual effects are solid for this movie, but these are the things that make horror movies the best. Unfortunately, this movie failed to get me have the feeling of being scared, either build up horror or sudden horror. Some characters were also a waste and not much story around them. Overall, a decent movie. But fell short on delivering the scary moments when it needed to. And too many boring, wasted scenes and characters.",
      "review_date": "2013-06-09"
    },
    {
      "review_title": null,
      "content": "It was kind of disappointing because the first one was so good. The biggest problem was that it answers no questions or completely resolves the ending of the first one. It wasn't all the scary either. It was pretty entertaining though.It was kind of disappointing because the first one was so good. The biggest problem was that it answers no questions or completely resolves the ending of the first one. It wasn't all the scary either. It was pretty entertaining though. Despite the stupid last minute of it.",
      "review_date": "2013-03-03"
    },
    {
      "review_title": null,
      "content": "A well directed, well acted pointless movie.  Ashley Bell is easily the best part of this movie, she needs to be in more films that matter.  Overall a decently made film that is just boring and didn't need to be made.",
      "review_date": "2013-06-04"
    },
    {
      "review_title": null,
      "content": "\"The Last Exorcism Part II\" had no reason to be made at all, it should have been straight to DVD, it resolves nothing, it is dull, stupid and really empty, just a nothing movie, but on the bright side it is creepy and scary delivering a good\"The Last Exorcism Part II\" had no reason to be made at all, it should have been straight to DVD, it resolves nothing, it is dull, stupid and really empty, just a nothing movie, but on the bright side it is creepy and scary delivering a good time just like the first, but this time, no luck at resolving anything from the first movie, it should have been a Director's Cut or Straight to DVD.",
      "review_date": "2013-06-20"
    },
    {
      "review_title": null,
      "content": "All the stuff that made the first one awesome was just thrown out the window for this one.  The acting is awful, the plot is messy, the story is pointless and it isn't even scary in the least.  The first one should have remained \"the last\"All the stuff that made the first one awesome was just thrown out the window for this one.  The acting is awful, the plot is messy, the story is pointless and it isn't even scary in the least.  The first one should have remained \"the last\" because this one wasted the potential it had and fumbled and failed after the great setup the first one gave it.",
      "review_date": "2013-08-15"
    },
    {
      "review_title": null,
      "content": "\" not scary but thrilling and tempting \". from producer  eli roth  ( cabin fever ) presents the second part of the the latest exorcism i have not seen the first one yet . i found this movie not scary but very entertaining to the demons super\" not scary but thrilling and tempting \". from producer  eli roth  ( cabin fever ) presents the second part of the the latest exorcism i have not seen the first one yet . i found this movie not scary but very entertaining to the demons super natural force to neil ( ashley bell).Grade A",
      "review_date": "2014-06-14"
    },
    {
      "review_title": null,
      "content": "not scary but thrilling and tempting \". from producer eli roth ( cabin fever ) presents the second part of the the latest exorcism i have not seen the first one yet . i found this movie not scary but very entertaining to the demons supernot scary but thrilling and tempting \". from producer eli roth ( cabin fever ) presents the second part of the the latest exorcism i have not seen the first one yet . i found this movie not scary but very entertaining to the demons super natural force to neil ( ashley bell).Grade A",
      "review_date": "2014-12-03"
    },
    {
      "review_title": null,
      "content": "\"The Last Exorcism Part II\" continues the story of Nell and the demon who wants her-Abalam. With a new director but the same actress as the first film, Ashley Bell. \"Part II\" is straight up horror story telling in a classic format. There is\"The Last Exorcism Part II\" continues the story of Nell and the demon who wants her-Abalam. With a new director but the same actress as the first film, Ashley Bell. \"Part II\" is straight up horror story telling in a classic format. There is no documentary style footage present save the internet shot of the footage from the first film so the opportunity to really utilize basic but brilliant gimmicks for shock and thrills are very well in hand for this film. Which I think the director managed to use quite well without being too obvious or any real \"fail\" issue for the most part.\r As far as the film's ability to bring the scares, I have to say that the film did it's job. There were moments that normally would not have been scary nor interesting in the film but because the director utilized the trick of closed in frame shots in most of the scenes random moments became thrilling. The story is more focused and open to the viewer with no real hidden plot which allows for more imagery and dogma that surround the whole possession culture and mystical icon-ism to play a big part in staging the story. It is a true classic horror story in all ways. That normally would seem like a bad thing but thankfully this director knew how to shoot the film and set up the moments that needed to be scary or exaggerated enough to make the movie work. Until the ending of course. That I have issue with. I appreciated the twist that says not every one gets a Hallmark moment but for me it came off cheesy and that boiled down to the use of CGI when more organic FX would have came off better for what the director was going for. \"The Last Exorcism Part II\" is a better story and movie than the first film but the first film had a way better ending.",
      "review_date": "2015-06-05"
    },
    {
      "review_title": null,
      "content": "More like 8.5. This doesn't deserve such a low rating. This is a great movie! It isn't particularly scary, but it's got it's scares, and some good tension. I loved this movie, same with the 1st. Well worth your time",
      "review_date": "2016-01-23"
    },
    {
      "review_title": null,
      "content": "Este filme é a continuação de \"Last Exorcism\" e mostra a vida de Nell após sobreviver aos acontecimentos do primeiro filme e ser encontrado vivo. No entanto, o passado voltará para assombrar a garota mais uma vez. Sendo uma sequela, raramenteEste filme é a continuação de \"Last Exorcism\" e mostra a vida de Nell após sobreviver aos acontecimentos do primeiro filme e ser encontrado vivo. No entanto, o passado voltará para assombrar a garota mais uma vez. Sendo uma sequela, raramente tenho expectativas positivas e, na verdade, acho o primeiro filme muito mais original e interessante. Este filme adota um registro mais canônico e cinematográfico, mas tem pouca história nesse roteiro. Mais da metade do filme é a jovem tentando reconstruir sua vida, em uma preparação excessivamente longa para eventos sobrenaturais. Aqui está faltando uma história, não há nenhuma trama principal real e esta é a maior falha do filme. O filme também não tenta nos assustar com as piadas provocadas pelos efeitos sonoros. Isso irrita mais do que assusta. Culpem o desafortunado e vergonhoso Ed Gass-Donnelly, diretor desta miséria, ou Damien Chazelle, que escreveu o roteiro, provavelmente, em um bloco de notas da cozinha. O que ainda mantém o filme minimamente coeso é o desempenho regular de Ashley Bell, a protagonista. Mesmo assim, ela não brilha como no primeiro filme por causa da falta de material para trabalhar.",
      "review_date": "2018-06-28"
    }
  ],
  "num_reviews": 40
}