{
    "title": "365 Days: This Day",
    "rating": 1.6,
    "release_date": "2022-04-27",
    "genre": [
        "Drama",
        "Romance"
    ],
    "summary": "Laura and Massimo are back and hotter than ever. But the reunited couple's new beginning is complicated by Massimo’s family ties and a mysterious man who enters Laura’s life to win her heart and trust, at any cost. [Netflix]",
    "critic_reviews": [
        "No, most audiences who tune into 365 Days: This Day are likely not seeking out female empowerment tales or coherent plots, but the disdain with which the film treats both its viewers and its star can’t help but grate.",
        "365 Days: This Day is barely a movie. It’s the emotionally bankrupt id of late capitalism, a braindead miasma of choreographed sex and nonsensical fighting driven by greed and violence masquerading as passion.",
        "There are no stakes, and there’s little that’s offensive, except to the art and craft of cinema. It’s funny. It’s glossy. It’s a fantasy. It’s safe. It’s soft.",
        "Frankly, this is the kind of soft-core smut where it’s the character development and dialogue that feel gratuitous.",
        "It’s piping hot trash."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "Now THIS is a movie. Hot bods, unaffordable cars, little bit of the bump n' grind, eh gov'na? But seriously folks, new Star Wars and Avengers movies churn out every few months and they all suck because its a total recycle job. Viewers giveNow THIS is a movie. Hot bods, unaffordable cars, little bit of the bump n' grind, eh gov'na? But seriously folks, new Star Wars and Avengers movies churn out every few months and they all suck because its a total recycle job. Viewers give them decent reviews because our society is devoid of ideas or too scared to take a risk on new things. 365 Days of hot sweaty garbage makes me pleased that this critic buttheads had to sit through it. I haven't seen it yet but I can GUARANTEE you it's bad enough to be funny.",
            "review_date": "2022-05-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Netflix cancels all their good shows for this monumentally bad sequel to a monumentally piece of crap softcore porn film",
            "review_date": "2022-05-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Well, since we already know where this movie is going on Netflix let's just close it off here and say this movie is garbage and move on, I don't even know how bad a 365 days movie could be to get an 8 on metacritic. That's unheard of lmfao",
            "review_date": "2022-05-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Nobody wanted this, nobody had been waiting for this, nobody care about this sh%t.",
            "review_date": "2022-05-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "As if a rating of a 0 from the first entry for it's sex trafficking content wasn't bad enough, this entry tries to be Fifty Shades of Grey, and is almost entirely a bad mixtape, and the sex scenes have no dialogue besides the music.ThisAs if a rating of a 0 from the first entry for it's sex trafficking content wasn't bad enough, this entry tries to be Fifty Shades of Grey, and is almost entirely a bad mixtape, and the sex scenes have no dialogue besides the music.This entry, and the original did not need to be made at all.",
            "review_date": "2022-05-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Can you stop fooling yourselves and watch a porno instead? I mean that's way easier.",
            "review_date": "2022-05-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's like a softcore p*rn. But even these typo of videos have better płot than this one.",
            "review_date": "2022-05-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nWorse sequel to be made, there’s no back story to the first movie just straight porn, and melodrama acting. This movie is has no back bone, no action, just straight porn, sex. Might as well go online and watch pornhub, you’d probably find better.",
            "review_date": "2022-05-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Undoubtedly still awful viewing, but... I found it a tiny bit more watchable than its predecessor.'365 Days: This Day' still has nothing that even closely resembles a plot, still has extremely limited actors and still shouldn't even exist.Undoubtedly still awful viewing, but... I found it a tiny bit more watchable than its predecessor.'365 Days: This Day' still has nothing that even closely resembles a plot, still has extremely limited actors and still shouldn't even exist. However, I'd be lying if I said I disliked it as much as the 2020 original. It's almost like taking out the sexual violence actually makes it more digestable, who'd a thunk it?!Unlike that other release, this falls into the more common category of just simply being rubbish. I will say, though, the music kinda slaps. The film is pretty much comprised of a series of sexual music videos placed back-to-back-to-back. Some of music used is well chosen I can't deny, I Shazam'd a couple... admittedly that probably says more about my taste in music than anything else! ¯_(ツ)_/¯There's even some minor neat cinematography, too. The positives I note are minimal, though, and don't overly help this 2022 production. I have more negatives, which also include an overlong run time and that shoddy ending. At least it marginally improves upon the film it follows, I wonder if its own sequel will do likewise? I plan to find out!",
            "review_date": "2023-01-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I think the second part is even worse than the previous one. As bad as the first one was, there was a little bit of something going on, and there's perhaps even more sex here, which may be fine with some people, but the thing is, for theI think the second part is even worse than the previous one. As bad as the first one was, there was a little bit of something going on, and there's perhaps even more sex here, which may be fine with some people, but the thing is, for the first half or so of the film, there's a sex scene every now and then. You're kind of watching sex all the time until about the second half of the movie, where it slows down a little bit with those scenes and a little bit of story comes in, which I think is just as weak. So what does this film have to offer? The first half is all sex, which we can find everywhere on unnamed sites these days, and the second half has some plot, but it's not the best. This film will probably please only the biggest fans of the first part. I would advise others to avoid this one. It has nothing to offer in my opinion. Unless you want a good dose of eroticism without a deeper plot. Otherwise, I don't know. For me, a bad film that I don't recommend.",
            "review_date": "2022-08-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Lies and Relationships... intimate, 365 Days could not become worse than the first part was, and still did.",
            "review_date": "2022-05-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I can't give it a 0, cuz theoretically there are \"actors\" in this film and events (at least in the first 15 minutes). I am a true masochist.",
            "review_date": "2022-06-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Terrible film, absolutely wasted 2h, bad acting, zero plot, laughable dialogues… horribe",
            "review_date": "2022-05-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The worst movie ever . Their acting is so bad and they only have s£x . That movie made me feel uncomfortable",
            "review_date": "2022-06-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "my first negative review is for this movie, so terrible and nobody treats it as a movie than porn, confused about the plot as well.",
            "review_date": "2022-06-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "such a good movie. it doesn’t have a GREAT plot but it is still very entertaining to watch.",
            "review_date": "2023-03-05",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 21
}