{
  "title": "K.G.F: Chapter 2",
  "rating": 4.5,
  "release_date": "2022-04-14",
  "summary": "Anand Ingalgi, a renowned journalist of his times would have written a book El Dorado on the biggest kept secret in Indian history - KGF. The government of India would not have permitted him to publish the book for various reasons. But Deepa Hegde accidentally gets her hands on a half-burnt book and listens to half the story from AnandAnand Ingalgi, a renowned journalist of his times would have written a book El Dorado on the biggest kept secret in Indian history - KGF. The government of India would not have permitted him to publish the book for various reasons. But Deepa Hegde accidentally gets her hands on a half-burnt book and listens to half the story from Anand which is KGF Chapter 1. Before Anand could narrate the remaining, he suffers a stroke and is in hospital. Deepa finds Vijayendra Ingalgi, Anand’s Son at the hospital who then narrates the remaining story from the research library of Anand Ingalgi. Why did the government burn down the copies of Anand’s Book El Dorado and not allow it to be published? Does Rocky, who at the end of KGF Chapter 1, survive? Does Rocky give a fresh ray of life to the people of KGF? Why does KGF become one of the biggest issues for the government? … Expand",
  "critic_reviews": [
    "With a big, domineering performance from Yash front and center, a love of bonkers action and unrelenting brutal violence, stunning camerawork from Bhuvan Gowda, and a director with flair to spare, crime and action lovers would do well to give it a chance."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nYash's and Sanjay Dutt's performance were okay..But the storyline is simple..And presentation isn't up to the mark.But the movie is good, full of action, Too much of noise!! And one thing Srindhi's acting was horrible!! Very irritating..The whole movie hammered me.. .Plot is okay...very overhyped film",
      "review_date": "2022-04-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nFeeling Proud of Being a Kannadiga For This Movie !!!! Masterpiece Of World CinemaGoosebumps Goosebumps Goosebumps Everywhere…",
      "review_date": "2022-08-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A larger-than-life, highly enjoyable rags to riches, urchin to overlord movie. The dialogue is cutting and immensely funny, the action is out of this world, and the emotional storyline is very moving. Kash plays Rocky brilliantly, and SanjayA larger-than-life, highly enjoyable rags to riches, urchin to overlord movie. The dialogue is cutting and immensely funny, the action is out of this world, and the emotional storyline is very moving. Kash plays Rocky brilliantly, and Sanjay Dutt is an amazing nemesis. The movie seems like a modern-day myth, or a lost city of El Dorado and its untold riches. Brilliant and definitely worth sitting through the epic 5-hour story.",
      "review_date": "2022-08-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nAh KGF2, this is a movie that is somehow embedded in the typical Indian moviegoer's mind as one of the best Indian movies of this year, with all guns blazing and a successful prequel this movie had a high bar to clear. Let's start with what the movie did good, the cinematography was absolutely wonderful, not very colorful but hey they did well with what they had to do. Yash, Dutt, and Tandon did extremely well with the roles they were handed and their acting was simply phenomenal. Unfortunately, that's pretty much the end to the positives.The movie was loud, insanely loud and so was the music, which makes at least a half of the film incredibly repulsive. The screenplay was awful, their efforts to make Rocky look like a likable protagonist came across as daft and silly to me. I'm not a fan of an outpour of violence but if you are, good for you, you may enjoy this film. The film at times contradicts itself on what is canon and what is not, and judging by its mind-blowing gross I wouldn't be surprised if the studio is inclined to make this a trilogy. Shetty's acting was questionable at best and I didn't really find myself even slightly attached to her character or anyone else's to be totally honest. The ending just seemed like a half-hearted rehash of James Bond's death in ''No Time To Die'' only a tiny bit more dramatised... I guess.To sum it up, if you like a crud ton of guns obliterating a bunch of one-dimensional faces, then this movie is for you!. I hope you enjoy this movie at least a little bit more than I did.",
      "review_date": "2022-05-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nFirst of all I wanna say that the storyline is simple... Acting level of Yash is good but showed some overhyped swag ( according to me) .Srinidhi is irritating , Insane, loud, noisy voice which hammered a lot.. KGF2 is considered as the most overhyped film,  but this KGF2 doesn't deserve!! An overhyped ,noisy , simple film",
      "review_date": "2022-05-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nI am rating 3/10 because :-  1. Neel's effort in perfect cinematography2. Yash's actingBut the tragedy is there are most of scenes which are quite overhyped.. Overhyped swag,  Srinidhi's horrible acting just irritated me..And also most importantly insane loud, shrill voice which hammered most of audiences...So much overhyped film..",
      "review_date": "2022-05-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nA typical fight scene!! No speciality.. Overhyped swags!! Reena I mean Srinidhi's acting was horrible!!! .. Loud insane voice!",
      "review_date": "2022-05-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nA typical monotonous fighting scenes are found with too much of noise and worst acting of srinidhi... Some Overhyped swags",
      "review_date": "2022-06-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nProbably the worst film of this yr.. Insane loud sound effects.. Poor casting of Srinidhi.. Simply cringe .. Overhyped swags .. Left theatre feeling nothing",
      "review_date": "2022-06-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nA disappointing film for me.. Continuous insane loud bgm, some nonsense overhyped swags of Yash.. Irritating acting of Srinidhi.. This film becomes hit because of hype . some objections1. Yash entered into Parliament without permissions and aimed the gun ..this seems very overhyping..2. Less relaxation time when Srinidhi found dead    PN must be careful over those matters.. I the most blunder is \" whose mother wants a child to be criminal??\" ..lacking of presentation.",
      "review_date": "2022-06-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nUtter Flop Dagara Kannadigay Movie Overrated **** Over the Top Buildup Logic Less Scenes Should Carry Aspirin Before Getting into Theatre Because Sound Will Bang From Start to End Of The Movie which would be So Irritating General Mass Making Typical Bulidup Old Kind Of South Indian Film Not Recommended for Overseas Audience .. Because it May Creates Bad Perception At Indian Movies",
      "review_date": "2022-06-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nRequest to all overseas audience not to watch as it is very cringy, masala , typical  insane loud film .. People are overhyping, becoming dumb about Yash aka Rocky .. He did okay but not so much great naah.. Grow up kids!! Its only old south typical no uniqueness.. And srinidhi's acting is hilarious to me ..nothing acting.  Better to play pubg and other war games and not to waste time to watch this film..",
      "review_date": "2022-06-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nBeing a Regular Reviewer Iam Saying that.. this movie is Master in Adding Fake Reviews in imdb Rotten Tomatoes and in other Movie Websites ,, Don’t Waste your time By watching this movie KGF Chapter 1 is Far Better than This KGF Crap 2",
      "review_date": "2022-06-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nIt’s Waste Of time to See and Discuss About This Cringy Film… Worst Overhyped Movie Of All Time.. KGF 1 is Good But This Movie will Make you lose Respect On KGF 1 Too",
      "review_date": "2022-06-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe Worst film.. insane loud bgm.. typical overhyping swags... an unnecessary overrated.. worst casting",
      "review_date": "2022-06-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nKGF2 is typical **** joking film , nothing is there.. I left theatre feeling nothing",
      "review_date": "2022-07-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nWorst movie I have ever watched.. **** (bad) mindset of this film makes me irritated.. People of India getting crazy abt Rocky who is nonsense crap.. Hilarious romanticism.. Parliament scene.. So joking.. What a loud bgm, left theater feeling nothing , wastage of money.. Worst casting",
      "review_date": "2022-07-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nAbsolutely a time waste movie.. Loud bgm  so called big dialogues make the film in next level.. yash was disgusting along with his Srinidhi et all.. Not the best film ever.. Rather it's an ear hammering movie",
      "review_date": "2022-07-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \n…….I am from South India and I am used to a lot of so-called 'mass commercial' movies which have a ton of illogical heroism and gravity-defying fights which I really hate. The thing that set apart KGF 1 from those sorts of movies was the fact that the movie made sense and it did not really feel out of the world.I cannot say the same with KGF 2. It was so disappointing. The movie is nothing but hero worship throughout the span of the movie.",
      "review_date": "2022-08-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \n… .Some scenes of this movie did not make any sense at all, they assumed that the viewers are of low IQ and not able to reason whatever they show in the movie.Some scenes like the hero using a helicopter as a fan for the heroine were so cringe! (BTW, who in the world dries pappad in front of a Bungalow!). Then there was this scene when the villain asks the doctor retrieving bullets from his body to keep a metal piece in his body to feel the pain! Bruh!",
      "review_date": "2022-08-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nWorst Movie Unbearable Crap BGM Not Recommended to Anyone Better to Avoid Watching This Movie ..................................................",
      "review_date": "2022-08-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nUtter sheetty Movie Dbdndhdkdoshdbd. Shsbsus. Susksgs. Sheksvs snak hsisfwyte hajafsvdus hakaishd ako hajagsvsvsbs",
      "review_date": "2022-08-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nSo a guy just walks into the parliament (the supreme legislative body of India) and blows a person sitting next to PM , we're used to watch Overaction and drama in tollywood but this stuff is on another level.. and what about that look of Yash which is making people go so mad about ... He just has grown beard .. Sanjay dutt had lit looks ",
      "review_date": "2022-08-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nCrap !!Average and overhyped due to being sequel.Overacting at many places.BGM is a headache. Complete movie has BGM. So much that at many places even dialogues are not audible.Story is most pathetic..",
      "review_date": "2022-08-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nUtter Crap ",
      "review_date": "2022-08-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nWorst film, worst cast, worst bgm.. Left theater feeling nothing ..PN has an ill mindset. Celebrating a criminal!! Entering into parliament without any permission,  shot instantly?? No.way to believe!!",
      "review_date": "2022-08-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nWorst Cringy Crap !!!!  Not Watching worthy….Better to Avoid Instead Of Getting Headache.Part 1 is Far Better than Chapter 2.That’s Why I’m giving 4/10 Otherwise it Won’t even Deserve 0 rating",
      "review_date": "2022-09-03",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 28,
  "genres": [
    "Action",
    "Drama",
    "Thriller",
    "Crime"
  ]
}