{
  "title": "The Banshees of Inisherin",
  "rating": 7.3,
  "release_date": "2022-10-21",
  "genre": [
    "Drama"
  ],
  "summary": "On a remote island off the west coast of Ireland, lifelong friends Padraic (Colin Farrell) and Colm (Brendan Gleeson) find themselves at an impasse when Colm unexpectedly puts an end to their friendship. A stunned Padraic, aided by his sister Siobhan (Kerry Condon) and troubled young islander Dominic (Barry Keoghan), endeavours to repairOn a remote island off the west coast of Ireland, lifelong friends Padraic (Colin Farrell) and Colm (Brendan Gleeson) find themselves at an impasse when Colm unexpectedly puts an end to their friendship. A stunned Padraic, aided by his sister Siobhan (Kerry Condon) and troubled young islander Dominic (Barry Keoghan), endeavours to repair the relationship, refusing to take no for an answer. But Padraic's repeated efforts only strengthen his former friend’s resolve and when Colm delivers a desperate ultimatum, events swiftly escalate, with shocking consequences.… Expand",
  "critic_reviews": [
    "The Banshees of Inisherin is a magnificent film telling a great, compelling story.",
    "In “Banshees,” Gleeson and Farrell once again are pure movie magic together, with Gleeson’s gruff and rugged and imposing persona the perfect counterpart to Farrell’s handsome and wide-eyed transparency, which at times borders on the, well, the not-too-bright. Earnest, but not too bright.",
    "Wickedly clever and unexpectedly touching.",
    "It’s an end-of-friendship breakup movie that swings between the hilarious, the horrifying and the heartbreaking in magnificent fashion.",
    "Its delicate blend of wryly observed humanity and thoughtful, understated visuals mean that the more dramatic beats hit harder. Even the occasional moments of gore feel shocking for the sparsity with which McDonagh chooses to deploy them.",
    "As it moves toward an ambiguous and haunting finale, The Banshees of Inisherin has the fanciful yet gruesome quality of a folk tale or fairytale, a mood enhanced by Carter Burwell’s harp-and-flute-heavy score and Ben Davis’ painterly widescreen cinematography.",
    "Mr. McDonogh’s keenly observed plot turns and his understated but meticulously chronicled dialogue, combined with shocks you don’t see coming, stark but beautiful cinematography by Ben Davis, and uniformly brilliant performances by a perfect cast add up to an exemplary film that will leave you stunned.",
    "Wounded but funny, quiet but resonant and resistant to anything like a Hollywood formula, The Banshees of Inisherin is a strangely profound little comedy. It’s one of the few true originals among movies this year.",
    "The Banshees of the Inisherin is really a beautiful work to behold.",
    "Writer-director Martin McDonagh’s soulful masterpiece offers a a windswept elegy on a camaraderie that has reached its inexplicable expiration, as well as melancholic rumination on mortality.",
    "The Banshees of Inisherin is a rich, soulful journey, full of agony, dry Irish wit and big, haunting questions. If it’s answers you’re looking for, however, you’re not going to find them on Inisherin.",
    "In Martin McDonagh's morbidly hilarious meditation on male friendship, Colin Farrell and Brendan Gleeson turn in performances every bit as powerful as in 'In Bruges' and paint a heartbreaking but comic look at one happens when one man doesn't want to be friends with another anymore.",
    "The Banshees of Inisherin is a beautifully-shot and deftly-played comedy. It is at once masterful, surprisingly poignant, and profound. Its portrait of a friendship faltering ultimately proves how vital friendship actually is: how vulnerable and naked we are without it.",
    "The result feels closer than any of his previous films to the barbed, intimate lyricism of McDonagh’s work as a playwright, and more deeply, sorrowfully felt to boot.",
    "This is an often shoulder-shudderingly funny film, whose comic dialogue is dazzlingly designed and performed. But McDonagh leaves fate itself with the last, black, bone-rattling laugh.",
    "In its unwavering devotion to the straightforward nature of its story, The Banshees of Inisherin has found something profound and universal, something that will leave you both laughing and shaken to your core. It’s the kind of film that crawls into your soul and stays there.",
    "It’s bleak and brutal—and deeply affecting.",
    "Within The Banshees of Inisherin, McDonagh manages to capture both the elemental resonance of folklore with the sophisticated weightiness of classic stage drama. This tragicomic tale nimbly balances both the personal and political dimensions of his richly developed characters and scenarios.",
    "The Banshees of Inisherin is lovely and disturbing in equal measure, turning its darkest urges and blackest humors into a touching and evocative portrait of a time, a place, a community and a pair of crazy men.",
    "The Irish have struggled to find peace on a road historically paved with war. The little village in The Banshees of Inisherin seems a microcosm of the complexity of maintaining that peace, even among ostensible friends.",
    "To be corny, which the film is decidedly not, it's about life: the brevity of it, the risks we do or don't take, who in the end we choose to share it with. And for all the pettiness, absurdity, and outright threats of violence, it's pretty feckin' wonderful.",
    "Like the sparse land of its setting, Inisherin is a film that reveals multitudes through observation and reflection. While I’m writing mostly of its emotional seriousness, it is also compassionate and humorous.",
    "Rich, layered, and full of beautiful shapeshifting emotional depth—at times laugh-out-loud funny, and then stopping on a dime to turn melancholy, heartrending, and or horrifying—The Banshee of Insherin will surely unsettle audiences trying to pinpoint blame or ascribe a hero or villain to the piece. Its morality and personal sympathies are purposefully opaque.",
    "The break between Colm and Pádraic works on its own terms, but it’s also a startlingly violent fight between men who are basically brothers, a fight that has a logic to it and yet is heartbreaking precisely because of the depth of history between them. It’s the conflict in microcosm.",
    "McDonagh also wants to give his actors a hell of a showcase, too, and it’s the two stars butting brows at the center of The Banshees of Inisherin that make this a masterpiece of men behaving very feckin’ badly.",
    "Both Colm’s initial rejection of Padraic and Padraic’s final crazed reaction are not the stuff of realism or reason but of fairy tales and nightmares, yet Gleeson and Farrell make the film a delight.",
    "One measure of the movie’s skill, and its generosity, is that it embraces the wisdom of both its protagonists. You’ll share Colm’s exasperation and defend his right to pursue an unimpeded life of music and the mind, but you’ll also concede Pádraic’s point that kindness and camaraderie leave behind their own indelible if often invisible legacies.",
    "Ignited by career-best performances from Farrell and Gleason,  this new classic from son of Ireland Martin McDonagh brims over with dark comic magic and jolts of bloody scary hell. Fasten your seatbelts for a spellbinder that stands high with the best movies of the year.",
    "The Banshees of Inisherin is like watching two cars slowly set out on a collision course ending in a crash that would be easily averted if one would just give way. But it’s also a caustic masterstroke of anti-romanticism, a counter to every starry-eyed screen portrait (often made by an American) of rural Ireland as a verdant sanctuary of close traditions, quirky characters, and a more authentic way of life.",
    "Farrell brings extra layers of depth and mournfulness to the classic McDonagh pattern. He’s the character you want to protect, and the one who sends your heart sinking when you see him harden, out of necessity, against the world. He gives The Banshees of Inisherin its soul and its beauty. To look at his face is to understand the half-welcoming, half-unforgiving place known as home.",
    "There’s more than a hint of other-worldly tragedy here, limned in parallel with the allusions to political conflict whose root causes no-one can quite remember.",
    "Like In Bruges, The Banshees of Inisherin is a dark movie that is often downright hilarious.",
    "For all its wit, its lively talk and deceptive lightness, this is arguably the writer-director’s most affecting work.",
    "Every laugh-out-loud line is punctuated by an ever-present sense of both despair and unpredictability.",
    "Banshees masterfully explores the complications of a platonic friendship – when old pals stop being polite and start getting real – with a sailor’s mouth and a mix of hilarity and tragedy in one wail of a tale.",
    "It’s Farrell who truly makes the dialogue sing, polishing off the punchlines (or responding to them) with facial reactions that add a few more laughs to every scene. Then, as the seriousness sets in, Farrell brings a deep sadness to the performance that’s staggering.",
    "The tapestry is large enough for the big screen and the overall experience will reward the movie-goer far more than something slick and superficial like Don’t Worry Darling.",
    "As dark as things get, the film never abandons its sly sense of humor.",
    "Banshees, reuniting Brendan Gleeson and Colin Farrell from “In Bruges,” is a scream from start to finish-erin.",
    "With 2008’s “In Bruges,” and now “The Banshees of Inisherin,” the Irish actors, under the writing and directing aegis of frequently pleasantly perverse Martin McDonagh, display a chemistry and virtuosic interplay that recalls nothing so much as the maestros of the early 20th-century Comedy of Exasperation.",
    "As an allegory to civil war, it’s well-worked and deeply thoughtful. But overall, the film leaves a slightly bitter taste, and — perhaps purposely — lacks some of the final third conviction that McDonagh has achieved so often in his stage and film work.",
    "Without his trademark vulgarity and narrative absurdity, McDonagh’s challenged himself to draw humor and meaning from the mundane. And he does.",
    "This isn’t a film that strives for big laughs — McDonagh seems more interested in putting you in a particular frame of mind, even when doing so requires a fair bit of downtime and dead air — but its constant undercurrent of humor affords the story’s most pressing questions an appropriately ridiculous context, one that speaks to the absurdities of all existence.",
    "The Banshees of Inisherin is that rare thing: a film that will have you chuckling one minute, gasping the next. A story about what matters more – your legacy or your life – McDonagh has created a work of feckin’ brilliance.",
    "It has the ring of a tall tale that has been told in pub after pub, gathering weird new details every time, until it has become a part of Irish folklore. It's a story that you'll want to hear – and tell – again and again.",
    "The movie is such a rich, emotionally detailed text that not sticking the landing is only a minor mark against it.",
    "Gleeson and Farrell play off one another in a perfect complement — sulky gorilla opposite enthusiastic puppy — that, as awards season kicks up a gear, has been entertaining premiere audiences on both red carpets and inside the auditorium.",
    "Colin Farrell plumbs emotional and comedic depths in Martin McDonagh’s witty and wistful period drama, with Brendan Gleeson and Barry Keoghan on solid supporting duty. Set against the stunning vistas of Ireland, The Banshees of Inisherin tells an effective and corrosive tale of friendship.",
    "Dark and violent at times, The Banshees of Inisherin's use of juxtaposition make for a compelling and simultaneously hysterical film for the ages.",
    "What makes it work so well, aside from a rollickingly funny but never smirky McDonagh script that arms every member of its small ensemble with killer moments, is the reuniting of In Bruges’s two leads, Colin Farrell and Brendan Gleeson.",
    "The film is engrossing and beautifully mounted, and is sure to not disappoint anyone who’s enjoyed McDonagh’s previous rough rides.",
    "McDonagh’s latest is a worthy In Bruges reunion: smart, funny, deeply felt.",
    "Those wary of McDonagh after the bulldozer that was Billboards should seek out this film; at its best, The Banshees of Inisherin whispers and laments and amuses the way McDonagh’s best stage writing does. And it offers the invaluable opportunity to see Farrell in his hangdog element, as Pádraic scrambles about trying to find purchase in the world, ever creaking and groaning in motion.",
    "There are plenty of genuine laughs in this movie, but each of them seems to dovetail into a banshee-wail of pain.",
    "Equal parts funny and forlorn, with a smattering of the violence that always been a sort of Emerald Isle background noise, The Banshees of Inisherin is Martin McDonagh’s most Irish film, because it’s a lot like Ireland itself.",
    "The result is McDonagh’s most fully realized work since his breakthrough play, “The Beauty Queen of Leenane,” a generation ago. “Banshees” has its limitations; it’s pretty glib, like everything McDonagh writes, in its mashup of blackhearted laughs and occasional sincerity. He’s akin to the Coen brothers in that regard. He’s also a formidable craftsman and his best lines are pearls.",
    "The Banshees of Inisherin might feel a little thin if you hold it to conventional standards of comedy or drama. It’s better thought of as a piece of village gossip, given a bit of literary polish and a handsome pastoral finish.",
    "What animates The Banshees of Inisherin and saves it from stiffness is the clout of the performances. Within the oxlike Colm, thanks to Gleeson, we glimpse a ruminative despair, and Farrell adds Pádraic to his gallery of heroes so hapless that they forfeit all claim to the heroic. The movie, however, belongs to Condon.",
    "It’s possible to see why McDonagh’s fans love his quirks and clever structural feints (the war of wills in “Banshees” often plays out like variations on a theme), as well as his characters’ willingness not to be liked. But what they find at the end of the filmmaker’s rainbow is less likely to be a pot of philosophical gold than prosaic self-satisfaction.",
    "Banshees is like a short story trying to be a novel. The extra pages get filled with the postcard views. There are bits of wit — again, this is Martin McDonagh we’re talking about — but overall “Banshees” is lugubrious and slow.",
    "The best thing about The Banshees of Inisherin is Kerry Condon as Pádraic’s sister, an intelligent woman with an even temperament and a good sense of humor who finds herself marooned in the wrong part of Ireland and in the wrong half of the 20th century.",
    "It's visually stunning, well written and the acting is top-notch. But without context, the plot falls flat, leaving behind an unsettling and bizarre film."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Writer-director Martin McDonagh’s dark comedy-drama is one of those films that leaves me (and probably many other viewers) scratching my head, making me sincerely wonder what all the fuss is about. In this fable-like Irish folk tale about twoWriter-director Martin McDonagh’s dark comedy-drama is one of those films that leaves me (and probably many other viewers) scratching my head, making me sincerely wonder what all the fuss is about. In this fable-like Irish folk tale about two longtime friends (Colin Farrell, Brendan Gleeson) whose relationship suddenly reaches an impasse, they struggle to come to terms of where things go from there in the aftermath of this scenario. There’s just one problem here: the picture’s razor-thin premise with its virtually nonexistent back story doesn’t provide enough basis for why the dissolution of this friendship occurs and then escalates to a tale of inexplicable desperation and truly bewildering retributive self-abuse. Indeed, we seem to know more about the setting of the story – a small island off the western Irish seacoast during the waning days of the new republic’s 1922-23 civil war – than we do about its characters, their relationship and their motivations. To compound matters, the narrative stretches out far too long, taking a seeming eternity to unfold with no particularly satisfying payoff, punctuated by lame attempts at humor that mostly fail to land. To its credit, this offering features fine performances by its two principals, as well as superb portrayals by Kerry Condon and Barry Keoghan in supporting roles, all of whom have garnered Golden Globe Award nominations in the acting categories. There’s also much to be said for its gorgeous cinematography and atmospheric Carter Burwell original score. However, it’s truly mind-boggling to understand how this film has earned eight total Globe nods and four National Board of Review awards, among numerous other inflated and questionable accolades. This tediously dull, slow-paced effort falls woefully short of the fine work the filmmaker achieved in previous films like “Three Billboards Outside Ebbing, Missouri” (2017) and “In Bruges” (2008) (not to mention its lack of the snappy on-screen chemistry that Farrell and Gleeson achieved in that off-beat comedy), accomplishments that make this release come across as a great disappointment by comparison. In fact, at the risk of overstatement, “Banshees” could have been edited down to a short, and it still likely would have been a letdown. Catch this one at your peril; at the very least, it’s now available for online streaming, so you shouldn’t have to venture out if you really want to watch it.",
      "review_date": "2022-12-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I loved \"In Bruges\"and \"Three Billboards,\"and watched them several times. So I was really looking forward to this one. But I found it far less satisfying, and even had a hard time getting through it.There just wasn't enough here. ForI loved \"In Bruges\"and \"Three Billboards,\"and watched them several times. So I was really looking forward to this one. But I found it far less satisfying, and even had a hard time getting through it.There just wasn't enough here. For starters, though it's billed as a comedy/drama, I only had a few chuckles over the dialogue; overall, it was far more sad. Yes, the acting was superb, the cinematography gorgeous. But I wanted more. More to the story, and to the characters. A sudden, out-of-the-blue decision like Colm's, involving scenes that are shockingly gross, needs exploration. But no. You keep waiting for something that never comes. It's just \"what it is.\" Maybe that's the point. And maybe I'm missing something else, though the reviews don't give me much to go on. They seem laudatory simply because it's McDonagh. But it doesn't feel earned.",
      "review_date": "2022-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Good as a metaphor for civil war, but dull to watch. In Bruges was memorable and hilarious, Three Billboards was excellent, but this is neither. Kerry Condon is the highlight, but the plot gets so preposterous and unrealistic it's impossibleGood as a metaphor for civil war, but dull to watch. In Bruges was memorable and hilarious, Three Billboards was excellent, but this is neither. Kerry Condon is the highlight, but the plot gets so preposterous and unrealistic it's impossible to take seriously by the end.",
      "review_date": "2022-12-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "First off, the landscape shots and the actors are absolutely awesome. Also the dialogues are pretty good with dark irish humour.So why only 7 points? The story was not believable for me. I understood that the older friend was going throughFirst off, the landscape shots and the actors are absolutely awesome. Also the dialogues are pretty good with dark irish humour.So why only 7 points? The story was not believable for me. I understood that the older friend was going through some kind of \"end life crisis\". But therefore ending a long lasting friendship and cutting off fingers? No way...it just feels constructed and not realistic at all.However, the weak story is somewhat compensated by the irish atmosphere on a small island which is conveyed very well. Also, the actors are really good and the landscape is beautiful. And yes, dialogues are sometimes really funny.",
      "review_date": "2023-01-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A movie about ... nothing?  Was this a Greek play that I had to study in high school?  In the words of Shakespeare, Much Ado About Nothing.",
      "review_date": "2023-01-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It is a rare, near forgotten pleasure when a movie gets beyond dark and gratuitous, hero and villain violence into the human heart in isolation. I felt deeply exposed through  these unfulfilled characters to our shared vulnerability andIt is a rare, near forgotten pleasure when a movie gets beyond dark and gratuitous, hero and villain violence into the human heart in isolation. I felt deeply exposed through  these unfulfilled characters to our shared vulnerability and limitations. Uncannily intimate acting by the 4 main characters, that I am beginning to believe after decades of watching good film, can only be accomplished by the Irish. My deep respect goes to the meticulous mind of Martin McDonagh.",
      "review_date": "2022-11-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nYou can get the whole plot of this movie from the trailer. I would not watch this again. I have no idea why such a simple boring plot would get such a high score. And parts of this movie are grotesque. I was looking for something new to watch and I got stuck with Banshees, and that is regretful.",
      "review_date": "2023-01-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Golden Globe award winner is typical award fare; well acted and shot but will leave normal viewers scratching their heads. Kudos to Farrell who is quite good in this flick. This and the Batman made him a force to be reckoned with in 2022.",
      "review_date": "2023-01-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Another BIZARRE movie.  It is getting to be a pandemic.  It seems as if the best way to get critics to love your film is to do something bizarre or nonsensical.  This movie was both.  The acting wasn't even as good as people claim.  I missAnother BIZARRE movie.  It is getting to be a pandemic.  It seems as if the best way to get critics to love your film is to do something bizarre or nonsensical.  This movie was both.  The acting wasn't even as good as people claim.  I miss the good old days of movies that told great (and believable) stories.",
      "review_date": "2023-01-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Franz Kafka`s \"The Castle\" isn`t a Coffeetable Book with tasteful pictures of Czech`s most beautiful castles and cutest animals and with a sideplot about a strong woman finding her own way. It`s impressive how \"The Banshees\" mixes an almostFranz Kafka`s \"The Castle\" isn`t a Coffeetable Book with tasteful pictures of Czech`s most beautiful castles and cutest animals and with a sideplot about a strong woman finding her own way. It`s impressive how \"The Banshees\" mixes an almost abstract parable (I don`t understand, btw - is Colm supposed to express the viewpoint of 1923`s IRA?) with luscious scenery, hypnotic music and a emphatic look at pets and their owners. It just doesn`t add up at all, in my opinion.",
      "review_date": "2023-01-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Greek tragedy set in Ireland, an allegory on the Irish Civil War, it's a meditation on fate, karma, isolation and detachment, superbly crafted and acted, but that pulls its punches at the end.",
      "review_date": "2022-12-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Shakespearean, maudlin, and with all the wit, charm, and nuance we expect from a Martin McDonough picture. The Banshees of Inisherin is a delightful trip to a less notable emerald isle and features a story straight out of a theater productionShakespearean, maudlin, and with all the wit, charm, and nuance we expect from a Martin McDonough picture. The Banshees of Inisherin is a delightful trip to a less notable emerald isle and features a story straight out of a theater production put to film (it seems). A black tragicomedy by definition, I found the film quite enjoyable. Colin Farrel and Brendan Gleeson, frequent McDonough collaborators, bring believable performances to their characters, though standout among the cadre is Kerry Condon, whom I want to see more of in the future. The narrative is quite simple, concise, smartly written, and delightfully macabre. Cinematography delights in showing us the landscapes of Inishmoor and Achill Island near Irelands coast thanks to the eyes of DP Ben Davis. Though not my personal favorite of McDonough's films (In Bruge will always take that cake), Banshees is an enjoyable film from beginning to end.",
      "review_date": "2022-12-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Rich characters, brilliantly realized with an intriguing plot that unfortunately is a little slight and doesn't develop significantly. Like a good short story that doesn't have the legs to be a novel. Is the falling out of Irish friendsRich characters, brilliantly realized with an intriguing plot that unfortunately is a little slight and doesn't develop significantly. Like a good short story that doesn't have the legs to be a novel. Is the falling out of Irish friends supposed to be an allegory for the 'troubles' carried out across the way?",
      "review_date": "2023-01-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nLarga y triste, aunque con bellos escenarios y tremendos actores. De comedia poco y las cosas se resuelven rápido y sin sentido. Lejos del brillo de Three Billboards. Tiene un buen comienzo pero falla en enganchar, al menos en mí caso.",
      "review_date": "2023-02-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Banshees of Insherin aspires to mean something, which in fact, it does, but it does a poor job of making me care. The two main characters suffer from dullness for 90% of the Film, which is no fault of the actor's Colin Ferrell and BrendanThe Banshees of Insherin aspires to mean something, which in fact, it does, but it does a poor job of making me care. The two main characters suffer from dullness for 90% of the Film, which is no fault of the actor's Colin Ferrell and Brendan Gleeson. And though the dullness may have been intended, it makes for dull viewing. The Film seems to be so proud of its symbolic elements that it's perfectly content not to work out the actual story in a meaningful way. Highlights acting wise goes to Kerry Condon and Barry Keoghan, who add some much-needed life to this tale. There are things to enjoy, such as beautiful cinematography and soaring landscapes, enough to make one wish to head to Ireland immediately! There are moments of humour and seriousness that make you think that the story may lead somewhere and move forward in a way you won't expect, but it somehow ends up being repetitive and not very satisfying. For film buffs and lovers of slow burn, there are metaphors and gems to uncover, but for casual viewing, this is frustrating and overly long at best and seems to lack an extra kick or spice to make it feel worth my time. With heightened expectations and promise of mastery, I found the Film lacking and found the comparison to Shakespeare laughable and saw nothing but a plastic shell of what the movie could have been.4.4 out of 10",
      "review_date": "2023-03-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Good movie. Strong acting with a very cool concept. It can be a little slow but I think it’s well worth it to see these once friends relationship dwindle because of some crazy circumstances.",
      "review_date": "2023-01-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's probably a good movie for Irish people, as they can relate to the characters and the way they express/speak, as well as their attitudes and general way of behaving. Unfortunately, from the point of view of an average Brazilian, it'sIt's probably a good movie for Irish people, as they can relate to the characters and the way they express/speak, as well as their attitudes and general way of behaving. Unfortunately, from the point of view of an average Brazilian, it's downright boring.",
      "review_date": "2023-01-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "First half is a 10, second half is like an 8. Some great humor, especially in the first half. Beautiful shot choices, perfect performances and writing. There's a deeply melancholic streak to the film, more pronounced tha In Bruges, but theFirst half is a 10, second half is like an 8. Some great humor, especially in the first half. Beautiful shot choices, perfect performances and writing. There's a deeply melancholic streak to the film, more pronounced tha In Bruges, but the film feels more mature and weightier for that.I found the pacing of the second half a little slow, and the darkness was relatively unleavened by humor. I thought it might not stick the landing, but ultimately the ending was well-judged.",
      "review_date": "2022-10-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I didn't like this movie. I like a good dark comedy. I really liked In Bruges. I have watched multiple times. I found this just consistently dark. The first thing physical that Colm did was darkly funny, but that was about it. I suppose theI didn't like this movie. I like a good dark comedy. I really liked In Bruges. I have watched multiple times. I found this just consistently dark. The first thing physical that Colm did was darkly funny, but that was about it. I suppose the cinematography was nice and the actors did their jobs well. I just didn't like the story that well.",
      "review_date": "2022-11-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I found this film hitting core memories! The characters are right off the cruel playground. However, they are adults and making emotional decisions carry great consequences. I was both laughing and dreading what was going to come next.I found this film hitting core memories! The characters are right off the cruel playground. However, they are adults and making emotional decisions carry great consequences. I was both laughing and dreading what was going to come next. Entertaining from start to finish.",
      "review_date": "2022-11-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Rubbish. The film, set in Ireland in 1923, opens with \"Polegnala E Todora\" from \"Le Mystère des Voix Bulgares\", a piece of Bulgarian music recorded in 1975, and continues its downhill slide thereafter.Very dark and depressing. Plot,Rubbish. The film, set in Ireland in 1923, opens with \"Polegnala E Todora\" from \"Le Mystère des Voix Bulgares\", a piece of Bulgarian music recorded in 1975, and continues its downhill slide thereafter.Very dark and depressing. Plot, characters, and dialogue unbelievable.Very clichéd picture of Ireland with every stereotype deployed: Guinness, musicians, clergy, a mad mystic woman. There are very vague references to the Civil War of 1923 (loud booms from the mainland) but not explored further or explained - could probably have been removed and the film wouldn't have suffered. And how the fighting, the vast majority of which took place in and around Dublin, could be heard from a small island off the West Coast of Ireland, is one of the many inconsistencies that the audience is required to ignore.My biggest criticism is that the audience is required to do too much work to help plug the leaking holes in the plot. It is just a story, at the end of the day, but you have to suspend too many critical faculties to help it limp along.The worst film I've seen this year, unfortunately.",
      "review_date": "2022-12-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "McDonagh’s script is transporting and transfixing. I was astonished by the well-executed twists and turns. Every cast member shone brightly.",
      "review_date": "2022-11-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I dare any Irish person to watch The Banshees of Inisherin and not recognise themselves or someone they know in this story. Director and writer Martin McDonagh has created another masterpiece.Set on the Island of Inisherin, lifelong friendsI dare any Irish person to watch The Banshees of Inisherin and not recognise themselves or someone they know in this story. Director and writer Martin McDonagh has created another masterpiece.Set on the Island of Inisherin, lifelong friends Pádraic (Colm Farrell) and Colm (Brendan Gleeson) find themselves in the centre of a dilemma when Colm abruptly ends the friendship, much to the shock of the entire Island. Pádraic refuses to accept that Colm could suddenly just decide not to be friends anymore and is determined to put an end to this childish feud. With the help of his sister Siobhan (Kerry Condon) and friend Dominic (Barry Keoghan) they try and repair the relationship. Yet the more Pádraic tries with Colm the worse it gets until Colm is pushed to give a rather dramatic ultimatum with shocking consequences. That’s more than enough on the plot, if you haven’t seen the trailer then keep it that way and just get to a cinema to see it for yourself.For all the Martin McDonagh fans you need to know that The Banshees of Inisherin is definitely more on the bleak side. Although classed as a black comedy, it’s far more dark and melancholic than comedy. Don’t expect the same amount of laughs compared to some of his other movies such as In Bruges and Three Billboards Outside Ebbing Missouri. As to be expected the story is balancing between humour and serious topics, in this case depression, despair and mental illness. You’ll be laughing one minute and disturbed the next. It’s not afraid to pull at the heart strings and will provoke a strong reaction from the audience. It’s definitely a unique story that will stay with you long after the credits has ended.The cast is small but makes an impact, each playing their part brilliantly. Colin Farrell particularly stands out and reminds us just how good of an actor he really is. Kerry Condon and Barry Keoghan are also giving hugely memorable performances so it’s no surprise the entire film has received so much awards buzz already. It’s honestly a relief to watch an Irish film that actually got Irish actors and not a bunch of actors sounding like leprechauns. It’s authentic for the time, especially the dialogue and doesn’t play too much into the stereotypes.McDonagh is the perfect choice for writing stories that tackle dark issues and inserting comedy among quite depressing topics. The Banshees of Inisherin is a brilliant film, hilarious and bleak. It’s one of a kind and definitely one of the best this year. Highly recommended for everyone.",
      "review_date": "2022-10-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Acting: 10, Cinematography 10, Story: 5Compelling at times but I really felt that some of the behavior of the two main characters was so farfetched as to be quite unbelievable. I loved aspects of the film but ultimately found it lackingActing: 10, Cinematography 10, Story: 5Compelling at times but I really felt that some of the behavior of the two main characters was so farfetched as to be quite unbelievable. I loved aspects of the film but ultimately found it lacking because for me the story went nowhere.",
      "review_date": "2023-01-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Martin McDonagh makes his return after a five year absence with The Banshees of Inisherin, and I must say it's his best work since In Bruges. The duo of Collin Ferrell and Brendan Gleeson each provide standout performances, as well as theMartin McDonagh makes his return after a five year absence with The Banshees of Inisherin, and I must say it's his best work since In Bruges. The duo of Collin Ferrell and Brendan Gleeson each provide standout performances, as well as the rest of the small cast of this film, while the plot is tightly told with none of the unnecessary pretension one usually finds out of an artsier film. McDonagh blends witty black comedy with a simple yet powerful story of the abrupt ending of a lifelong friendship that will leave you laughing at one moment and saddened in the next. Its themes regarding loneliness (specifically repressed loneliness amongst men), the nature of inter-social relationships, and greater meanings in life are truly phenomenal and expressed in a simple, melancholic way that will leave one thinking about where they are and who is in their life. The only flaw I can truly mention regarding this film is the fact the film is quite bleak, which makes it not much of a rewatch. However, for a one time viewing, The Banshees of Inisherin is 100% worth a watch and will certainly make you think, laugh, and cry.",
      "review_date": "2022-11-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A gentle character study set in a world totally foreign to Americans with excellent performances by Colin Farrell and Brendon Gleeson.",
      "review_date": "2022-11-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "“Maybe he just don’t like you no more.”The chemistry, even when the characters are not supposed to be on good terms is the most important magic explored in The Banshees of Inisherin.\n\nMartin McDonagh is the boss and creator, that's not in“Maybe he just don’t like you no more.”The chemistry, even when the characters are not supposed to be on good terms is the most important magic explored in The Banshees of Inisherin.Martin McDonagh is the boss and creator, that's not in dispute, but it's Colin Farrell and Brendan Gleeson who bring his world to life, which is both a metaphor and a sad tale of loneliness and vulnerability. One about a man who wants to be alone and another who can't tolerate being alone.And it's not an otherworldly and complicated story by any stretch of the imagination, but even for our times and in the era in which the events of this film take place it's clear that men don't talk about their feelings.McDonagh certainly doesn't choose a simplistic path and tackles a violence that at first may seem like a joke because you wouldn't think Gleeson's character would do it, but when it happens is when the story makes it clear to you that this tragicomedy is intended to be genuinely devastating, and it really is.You're not supposed to leave here with a smile on your face, but I assure you, you won't leave here without something to think about either.",
      "review_date": "2022-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I thought this movie was amazing. It watches like an Irish Folktale, a cautionary tale told over a pint. Acting was phenomenal.",
      "review_date": "2022-12-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Stacked with some of the best performances of 2022 this quite dark comedy is a haunting expression of loneliness: its various forms & consequences . When Colum begins ignoring his best friend it sets off an unexpected chain of events as hisStacked with some of the best performances of 2022 this quite dark comedy is a haunting expression of loneliness: its various forms & consequences . When Colum begins ignoring his best friend it sets off an unexpected chain of events as his efforts for isolation become more dire . It's smart,optimistic and heartbreaking. My no. 1 movie of the year",
      "review_date": "2022-12-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Martin McDonagh garantiu um lugar de honra na minha lista quando dirigiu e escreveu o excelente \"Three Billboards Outside Ebbing, Missouri\".Em \"The Banshees of Inisherin\" o Martin de finais em aberto está de volta, com mais perguntas do queMartin McDonagh garantiu um lugar de honra na minha lista quando dirigiu e escreveu o excelente \"Three Billboards Outside Ebbing, Missouri\".Em \"The Banshees of Inisherin\" o Martin de finais em aberto está de volta, com mais perguntas do que respostas dessa vez.Com um quarteto de atores impecáveis o apoiando, o filme passeia por vários significados, como os vários exemplos de solidão representados em seus personagens, e prende a nossa atenção do começo até a sua metade. Foi notório para mim onde acontece a emenda do filme. Após expor todas as cartas na mesa, ao invés de caminhar para a construção de uma conclusão, ele parece apenas correr atrás do próprio rabo.Felizmente, ainda assim você pode tirar boas lições dele.",
      "review_date": "2022-12-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don't know what the hype was about. It was a boring movie. The acting was good but the plot, nah. They don't have a solid foundation for the movie let alone the motive.",
      "review_date": "2023-01-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Open to interpretation, but (other than geo-political subtext) it exposes pre-Vatican 2 sexually repressed homosexual culture among closeted Irish men. Men who fiddle around! Big beefy hands with fat digits - Phallic symbols.",
      "review_date": "2022-10-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nDrab, dark, depressing, depraved and yet being marketed as a comedy. Stupid plot and despicable characters. Walked out  right after the donkey was killed. Shame on the writer, director and producer for this crap bucket.",
      "review_date": "2022-11-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "My movie of the year. This is because it is the funniest movie of the year and the saddest movie of the year.",
      "review_date": "2022-11-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Does a perfect job capturing the despair of living in 1920's Ireland and the wit that lives despite it.",
      "review_date": "2022-11-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Wow.This movie can be best summed up as a \"Grim Fairy Tale.\"I loved this movie and it's characters from start to finish.\nColin Ferrell's eyes and facial expressions say so much.\nGreat cast.\nGreat screenwriting, and I especially loved theWow.This movie can be best summed up as a \"Grim Fairy Tale.\"I loved this movie and it's characters from start to finish.Colin Ferrell's eyes and facial expressions say so much.Great cast.Great screenwriting, and I especially loved the shout out to being \"safely ensconced\" which is something I tell my best friend every time I go see a new movie.Run.Don't walk.But be prepared to be moved but this emotional heartfelt story.",
      "review_date": "2022-11-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"I'm not putting my donkey outside while I'm sad\"I can't believe a miniature donkey has become the modern standard for the best movie pet ever but here we are. The location filming was absolutely gorgeous. There was real strong humor\"I'm not putting my donkey outside while I'm sad\"I can't believe a miniature donkey has become the modern standard for the best movie pet ever but here we are. The location filming was absolutely gorgeous. There was real strong humor throughout but it is very much a sad story. Great title, great writing, great acting, has it all.",
      "review_date": "2022-11-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Another Martin McDonagh masterpiece. The humor is hilarious, the cinematography is amazing and the performances are all top notch especially from Colin Farrell.",
      "review_date": "2022-11-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Martin McDonagh's follow-up to the 2017 critical darling \"Three Billboards Outside Ebbing, Missouri\" is tight, relatable and — I think — an even better movie. Full stop. In fact, with Martin McDonagh being one of the few filmmakers whoseMartin McDonagh's follow-up to the 2017 critical darling \"Three Billboards Outside Ebbing, Missouri\" is tight, relatable and — I think — an even better movie. Full stop. In fact, with Martin McDonagh being one of the few filmmakers whose filmographies I've seen in its entirety, I'd say this is easily his best film since \"In Bruges,\" which says a whole lot. \"The Banshees Of Inisherin\" is simple, yet layered. Beautiful, yet ugly. Hilarious, yet horrific. If there's any work in this filmmaker's oeuvre that I think is the perfect, most simple distillation of his voice/tonal DNA, it has to be this. Beyond that, you have the acting, which is stupendous, the cinematography, which is magical and the overall experience, which is lasting and satisfying. Terrific work here from everyone involved.",
      "review_date": "2022-11-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Loved it. Strange movie but I woke up the next morning with lots of theories on various things. Want to watch it again. Pretty deep beneath the simplicity of rural personalities. Laughs were not frequent and my heart ached a few times. It isLoved it. Strange movie but I woke up the next morning with lots of theories on various things. Want to watch it again. Pretty deep beneath the simplicity of rural personalities. Laughs were not frequent and my heart ached a few times. It is a beautiful film with very strong acting and at least some escaped the accuracy of the banshee. But was it real?? Very good.",
      "review_date": "2022-10-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best Martin's movie so far! Colin farrell and bernard gleeson deserve at least nomination for this",
      "review_date": "2022-10-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was the simultaneous the most boring and most disturbing movie I've ever watched, and I honestly wish I'd never watched it.",
      "review_date": "2023-01-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "'The Banshees of Inisherin' is tragicomedy at its finest. Martin McDonagh is back with an intimate yet powerful tale about friendship, solitude and the irrationality that led to a civil war and a conflict still felt today.As a metaphor for'The Banshees of Inisherin' is tragicomedy at its finest. Martin McDonagh is back with an intimate yet powerful tale about friendship, solitude and the irrationality that led to a civil war and a conflict still felt today.As a metaphor for the long Irish conflict, the film manages to show the absurdity of both sides. Pádraic and Colm represent the arbitrariness that led to it and the violent results. This is a Martin McDonagh film, so expect characters presented with a darkly comedic touch that makes them as funny as bleak. The star of the show, of course, is Colin Farrell. Just look at the man's eyebrows; they show you his mood and emotions every damn time. This very well could be his best performance yet. But that's not it, because Barry Keoghan, Kerry Condon, and Brendan Gleeson are astounding in their roles, and even the smaller ones are great, giving you laughs, somber moments, and great lines equally.'Banshees...' is funny and sad; McDonagh's brilliant screenplay gives insight into the sentiment of a nation struggling and how that affected its society. I hope this wins at least one or two Oscars next month.",
      "review_date": "2023-01-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I wanted to love this. There are so many good things. Every performance is amazing. The setting outstanding. A wounded Colin Farrell is flat-out Academy Award worthy. BUT! The whole conceit of Gleason's response to Farrell talking to him isI wanted to love this. There are so many good things. Every performance is amazing. The setting outstanding. A wounded Colin Farrell is flat-out Academy Award worthy. BUT! The whole conceit of Gleason's response to Farrell talking to him is nonsensical and more importantly UNNECESSARY! You could have told the same story and not thrown this ridiculous plot point into the story. Kerry Condon and Barry Keoghan should also get Oscar nods.",
      "review_date": "2022-12-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Pádraic’s life is turned upside down when his longterm friend and drinking buddy Colm suddenly begins ignoring him for no apparent reason.What at first appears to be a straight comedy soon gives way to a thought provoking and emotionalPádraic’s life is turned upside down when his longterm friend and drinking buddy Colm suddenly begins ignoring him for no apparent reason.What at first appears to be a straight comedy soon gives way to a thought provoking and emotional reflection on depression, and the excellent script is further elevated by the stunning setting and a number of incredible performances.",
      "review_date": "2023-01-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A moving film that is easy enough to follow but not always easy to figure out.  The characters are all extremely honest with each other at the surface level, which is refreshing, and yet there is a pervasive melancholy to the whole affair.A moving film that is easy enough to follow but not always easy to figure out.  The characters are all extremely honest with each other at the surface level, which is refreshing, and yet there is a pervasive melancholy to the whole affair.  Why the bitterness, why the sadness in this idyllic seaside village?  I think everyone will find something in the film they can relate to in both a positive or negative way.  It's a real work of art.  The lighting, which seems mostly natural, is exquisite.  Many scenes have a painterly quality to them.  The claustrophobia in someone's small home, contrasted against the sweeping endless vistas of the coast create the impression of a world waiting to be explored...just out of reach.  An attempt has been made with this story to lift up an unusual rock and see what's underneath.  It's brave, assured storytelling by a filmmaker in command of the craft and the actors are up to the task.  The lead performances are masterful.  It's an exceptional film though highly unusual, so I can imagine it won't be everyone's cup of tea.  But I say see it for the amazing offbeat humor, fine performances, beautiful scenery, and you may walk away as I did with some rather profound questions about human nature.  Score: 9.25",
      "review_date": "2022-10-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Two longtime friends (Colin Farrell and Brendan Gleeson) find themselves at odds with each other when one of them abruptly ends their friendship and begins ignoring and avoiding them at all costs. Written and directed by Martin McDonough (Two longtime friends (Colin Farrell and Brendan Gleeson) find themselves at odds with each other when one of them abruptly ends their friendship and begins ignoring and avoiding them at all costs. Written and directed by Martin McDonough ( who famously first collaborated with Farrell and Gleeson in the 2008 dark comedy/crime film 'In Bruges') reunites here with the two stars to bring us this equally absurdist and darkly humorous tale set in early 1920s Ireland. The film is a dark, bold, and often somber yet sometimes funny look at changing times and the lengths some will go to fight for a friendship, as well as the lengths some will go to shun others. McDonough, who is known for his dark yet witty humor and dialogue in his stage plays, as well as in previous films such as the aforementioned 'In Bruges', 'Seven Psychopaths' and 'Three Billboards Outside Ebbing, Missouri' brings that signature style of his here as well with darkly fascinating results. As for the cast, Farrell and Gleeson are once again in top form alongside each other, and even Kerry Condon, who plays the sister to Farrell's character gives an often riotous, scene-stealing supporting turn. Whenever the film wasn't making me laugh, it would often hit me in the feels unexpectedly and throw me for a loop whenever I least expected it. Overall, this brilliantly acted film that's equal parts dark/dreary and oddly humorous is a true standout for me and one of the better films of this year.",
      "review_date": "2022-11-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What factor makes a friendship of years end for no logical reason? The presumed calm with which the plot unfolds explains everything without complications or intricacies, supported by a quite interesting cast and set design. One of the bestWhat factor makes a friendship of years end for no logical reason? The presumed calm with which the plot unfolds explains everything without complications or intricacies, supported by a quite interesting cast and set design. One of the best proposals of the year.",
      "review_date": "2023-02-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "THE BANSHEES OF INISHERIN from writer/director Martin McDonagh (In Bruges), re-teams Brendan Gleeson (Colm) & Colin Farrell (Pádraic) in a dark comedy set on an island off the coast of Ireland at the end of the Irish Civil War in 1923. Colm'sTHE BANSHEES OF INISHERIN from writer/director Martin McDonagh (In Bruges), re-teams Brendan Gleeson (Colm) & Colin Farrell (Pádraic) in a dark comedy set on an island off the coast of Ireland at the end of the Irish Civil War in 1923. Colm's abrupt decision to end his friendship with Pádraic creates upheaval in the ordinary lives of the islanders. Colin Farrell steals the film, brilliantly conveying BANSHEES themes of kindness, isolation, importance of human connection. Features cinematography by Ben Davis, shot along Ireland's west coast, equal parts bleak, ominous, breathtakingly beautiful.",
      "review_date": "2022-11-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What if the Forrest Gump and Lieutenant Dan scenes had been set in 1923 rural Ireland? Also I wonder if the director, on purpose, created one of the dullest and fakest Irish dialogue/plot -whose plot is about the dullness of life- just toWhat if the Forrest Gump and Lieutenant Dan scenes had been set in 1923 rural Ireland? Also I wonder if the director, on purpose, created one of the dullest and fakest Irish dialogue/plot -whose plot is about the dullness of life- just to take a piss at snobbish American movie critics and movie audience who would completely miss this \"Second degré\" as we say in French. For sure, the message is about \"guys, you should definitely read more and talk less, be less ...inert like you are right now watching this ****Even the acting feels suspicious. There is a hint of mischievious self-awareness in Colin Farrel and Gleeson slightly off delivery.3 points for the photography and Ireland.",
      "review_date": "2022-12-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "'Quirkiness' is not an attribute I usually appreciate. The track record is not great - from Benny and Joon to Napoleon Dynamite, movies that rely on charm and warmth instead of plot and impactful dialogue is an approach I simply dislike.'Quirkiness' is not an attribute I usually appreciate. The track record is not great - from Benny and Joon to Napoleon Dynamite, movies that rely on charm and warmth instead of plot and impactful dialogue is an approach I simply dislike. Banshees has no such warmth, as it's much closer to a lamentation on stoicism. Like In Bruges and Three Billboards, there's an air of hard cynicism permeating throughout the film. It's much less fleshed out than those films, and the dialogue is rather minimalist. It's not about that though, as it really is more a philosophical exploration on an array of oft uncomfortable subjects people tend to avoid. Isolation, friendship, death, time, interpersonal illusions, facile gossip, abuse, stoicism - it really goes on... Which is remarkable given how seemingly little there is on the surface, at times.Which can make the film a little slow. But the performances are all great (honestly, Colin Farrell has turned from kind of a joke to a legitimately decent actor), it's compelling, and the cinematography is also really good. Lastly, this film has an underspoken and underappreciated quality - the linger effect. Chances are you'll think about this film long after it's over. It's unique and thought provoking, and in this saturated and compromised artistic time we live in, it's refreshing.",
      "review_date": "2023-02-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Like In Bruges, in The Banshees of Inisherin Martin McDonagh delivers a sometimes somber, sometimes hilarious and consistently engaging cerebral exercise in the meaning of friendship and the metaphor it can be for the world around it. GleasonLike In Bruges, in The Banshees of Inisherin Martin McDonagh delivers a sometimes somber, sometimes hilarious and consistently engaging cerebral exercise in the meaning of friendship and the metaphor it can be for the world around it. Gleason and Farrell are once again at the top of their game, and their on screen chemistry, or in this case lack thereof, absolutely carry the film. A nest of excellent supporting actors then flesh out the story and all seem to fit perfectly balance each other’s performances. McDonagh is a masterful storyteller who can sometimes feather along the abstract but always provides just enough breadcrumbs that the viewer will still have the satisfaction of putting all the pieces together resulting in a truly exhilarating story. In a world of superficial comic book adaptations and corporate staunched creativity, The Banshees of Inisherin is a welcome reminder of what great filmmaking can be.",
      "review_date": "2022-12-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I liked this a lot. It's a very funny and dramatic film with excellent performances. Poor Jenny the miniature donkey.",
      "review_date": "2022-11-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I was privileged in seeing this movie early at the SCAD Film Festival and it was absolutely amazing. Martin McDonagh absolutely knocked it out of the park again. Martin McDonagh absolutely knocked it out of the park again. Colin Farrell is soI was privileged in seeing this movie early at the SCAD Film Festival and it was absolutely amazing. Martin McDonagh absolutely knocked it out of the park again. Martin McDonagh absolutely knocked it out of the park again. Colin Farrell is so far my pick for Best Actor this year. His performance here is absolutely amazing and heart wrenching at points as well. He does an amazing job at embodying this character and all his little quirks. Brendan Gleeson did an amazing job as well. He did a great job at being the foil to Colin Farrell’s character with his more serious attitude. Kerry Condon and Barry Keoghan did a great job as well with Barry Keoghan delivering probably the best performance of his career by a country mile. One scene from him in particular is heartbreaking. I keep mentioning how this film is heartbreaking and heart wrenching but this film is absolutely hilarious as well. Almost every joke here is very well written and incorporated into each scene and they are just funny in a dark way. This definitely falls under the black comedy genre. McDonagh does an amazing job at directing and incorporating the mix of dark comedy and drama tones together in a way that doesn’t feel jarring. The film starts out being funny but the end you’re definitely feeling emotional and sad as well. The story is really interesting. It’s fascinating watching Colin Farrell try to get back under the good graces of Gleeson’s character and all the incidents that follow that. The cinematography and music are both breathtaking and easily some of the best of the year. The cinematography and music are both breathtaking and easily some of the best of the year. As much as I love this movie, I would say that McDonagh’s previous film Three Billboards Outside Ebbing, Missouri is just slightly better than this. I would highly recommend watching this when you get the chance of you want a slow burn comedy/drama.",
      "review_date": "2022-11-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is the most close to perfect movie I have seen this year. I adored every moment of it, and Barry, Colin and Brendan each turn in fantastic central performances. For such a bleak movie, it's extremely funny.",
      "review_date": "2022-12-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A very entertaining dark comedy/drama. Most movies like this have bad pacing and get boring at parts, but this one stayed interesting the whole time. My only knock is that it's slightly less funny than In Bruges, but this movie is still great!",
      "review_date": "2022-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An outstanding picture! Beautiful shots, amazing locations. Highest level of acting. Inspiring and thought provoking film. Watch it!",
      "review_date": "2023-01-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Banshees of Inisherin é um excelente filme, quase chorei em determinado momento.",
      "review_date": "2023-03-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I think I just watched one of the most sad and beautiful movies there are. Colin Farrell really put an amazing performance. Music and landscapes of island really create an amazing atmosphere.",
      "review_date": "2023-01-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "THE GOOD: Flawless on mainly every single aspect. I really enjoyed the main trio of protagonists. I love the premise and the characters so much.THE BAD: It is a simple as it gets, which ain't necessarily a bad thing, but maybe left meTHE GOOD: Flawless on mainly every single aspect. I really enjoyed the main trio of protagonists. I love the premise and the characters so much.THE BAD: It is a simple as it gets, which ain't necessarily a bad thing, but maybe left me wanting something else.",
      "review_date": "2023-02-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "admirable[ ad-mer-uh-buhl ]adjectiveworthy of admiration; inspiring approval, reverence, or affection.",
      "review_date": "2022-12-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I found The Banshees Of Inisherin quite silly at the first 45 minutes because of you know, reason of the main story, but it's not bad at all, and i ended up found that The Banshees Of Inisherin as a really great dark comedy film withI found The Banshees Of Inisherin quite silly at the first 45 minutes because of you know, reason of the main story, but it's not bad at all, and i ended up found that The Banshees Of Inisherin as a really great dark comedy film with incredible performances by all the cast and the sillyness of the story ended up to be a really really great fascinating amazing story, i was really investedly growing to the story throughout the time, while not emotionally in the characters i still found it great, it is entertaining, engaging, partially funny and mostly depressing, The Banshees Of Inisherin was surely something special, it's nothing i've ever seen and it's incredible!",
      "review_date": "2023-01-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nSpoiler below the star icon. Genuinely went beyond my expectations with a great atmosphere that provoked genuine reaction from the audience and myself. The jokes are fantastic and the acting is praiseworthy in the sense it didn't patronise the Irish or island life very much tho some liberties were taken. As it progressed it really plucked at emotions and became something I didn't expect and honestly I'm surprised and delighted at the quality of this movie.*Personally, I believe it becomes far more sinister if you view the protagonist as the villain rather than the downtrodden hero.Consider this, an elderly man doesn't want to be friends anymore but the younger man begins to harrass him and force him to stay friends, with things escalating throughout the film.Excellent movie.",
      "review_date": "2022-10-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "As for the film itself, it has flawless photography and acting credits. The screenplay gives the two performers a lot to do with a few lines, and they answer the call with top-notch performances.",
      "review_date": "2022-12-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Padraig's disappointment, as well as his loving sister Shivon, serve as reminders of the significance of family and the ideals of friendship. There isn't much to say about a film that lacks a twisting, turning big premise, other than toPadraig's disappointment, as well as his loving sister Shivon, serve as reminders of the significance of family and the ideals of friendship. There isn't much to say about a film that lacks a twisting, turning big premise, other than to commend the dry humour that is contagious, give the joint protagonists your hat (not finger), and applaud McDonagh for another job well done.",
      "review_date": "2022-12-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of those strange movies that I enjoyed, but I’m not sure I could explain why.",
      "review_date": "2022-11-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A very splendid acting and script, weird movie that I actually am attracted to. Best picture that's for sure.",
      "review_date": "2022-12-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A slow but powerful movie on depression and trying to meaning in life.  The unique and strange script is boosted by excellent acting performances. Its another thought provoking dark comic/drama from Martin McDonagh who last wrote and directedA slow but powerful movie on depression and trying to meaning in life.  The unique and strange script is boosted by excellent acting performances. Its another thought provoking dark comic/drama from Martin McDonagh who last wrote and directed \"Three Billboards Outside Ebbing, Missouri\".",
      "review_date": "2023-01-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Well-made film with excellent cinematography! But empty! The best are the animals. Without the animals there is no movie!",
      "review_date": "2023-02-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Una buena historia, con un excelente guion, los personajes están bien desarrollados y se complementan con una dirección de arte maravillosa.",
      "review_date": "2023-01-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Martin McDonagh's latest movie, The Banshees of Inisherin, is an excellent exploration of friendship, anger, depression, rage, and sadness, all while maintaining a dark sense of humour. Featuring two remarkable performances by Colin FarrellMartin McDonagh's latest movie, The Banshees of Inisherin, is an excellent exploration of friendship, anger, depression, rage, and sadness, all while maintaining a dark sense of humour. Featuring two remarkable performances by Colin Farrell and Brendan Gleeson, the film follows a one-time best friends, Colm (Gleeson) and Pádraic (Farrell), as Colm's dislike for his friend leads them both down a dark path. Set against the backdrop of 1920s Ireland during the civil war, the rural island of Inisherin provides a stunning visual for the narrative. Along with the powerful performances, McDonagh's script and Kerry Condon's portrayal of Pádraic's sister, Siobhan, create a moving and poignant story of alienation and mortality. With strong performances, high emotion, and stunning visuals, The Banshees of Inisherin is one of the best films of the year.__________________La última película de Martin McDonagh, The Banshees of Inisherin, es una excelente exploración de la amistad, la ira, la depresión, la ira y la tristeza, todo ello manteniendo un oscuro sentido del humor. Con dos actuaciones notables de Colin Farrell y Brendan Gleeson, la película sigue a Colm (Gleeson) y Pádraic (Farrell), los mejores amigos de una vez, mientras la aversión de Colm por su amigo los lleva a ambos por un camino oscuro. Situada en el contexto de la década de 1920 en Irlanda durante la guerra civil, la isla rural de Inisherin proporciona una imagen impresionante para la narrativa. Junto con las poderosas actuaciones, el guión de McDonagh y la interpretación de Kerry Condon de la hermana de Pádraic, Siobhan, crean una conmovedora y conmovedora historia de alienación y mortalidad. Con actuaciones sólidas, mucha emoción y efectos visuales deslumbrantes, The Banshees of Inisherin es una de las mejores películas del año.",
      "review_date": "2023-01-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I’ve thought of this movie often in the weeks since viewing it. There’s a powerful lesson in the story, backed up by good acting—serious and funny. A bit slow at the start, but lovely once the narrative gets humming.",
      "review_date": "2023-01-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Un film che rappresenta la metafora di un qualsiasi conflitto umano (in questo caso la guerra civile del 1923 in Irlanda) visto però da due personaggi che \"fisicamente\" sono ben lontani dalla guerra ma mentalmente ne restano coinvolti.",
      "review_date": "2023-02-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe movie is utterly fantastic,  a brilliant metaphor of the Irish civil war this dark yet comedic movie finds a way to make you laugh and truly feel for the characters.",
      "review_date": "2023-02-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Why, oh why, do movie critics have such a fetish for ridiculous, emotionally manipulative films? Is it Artistic? I guess. If the definition of art includes a requirement for shocking plot twists and/or an achingly sad script. “Oooooo…I didn’tWhy, oh why, do movie critics have such a fetish for ridiculous, emotionally manipulative films? Is it Artistic? I guess. If the definition of art includes a requirement for shocking plot twists and/or an achingly sad script. “Oooooo…I didn’t see THAT coming” the smug movie critic mutters to the stranger sitting next to him. “So dark!  So fancy! Definitely 5 stars!” And, yes, I get the symbolism, the civil war, the foreshadowing bc I remember it from high school English class, in which, by the way, a 15 year old student would get an “A” but with the comment, “you clearly poured your heart into this short story. You’re on your way to becoming a great writer. Realize, however, that you don’t have to include every literary device in each story. Pace yourself.”",
      "review_date": "2023-03-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don't know what the hype was about. It was a boring movie... The acting was good but the plot, nah. They don't have a solid foundation for the movie let alone the motive.",
      "review_date": "2023-02-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "(Mauro Lanari)I take this opportunity to explain the matter (perhaps) once and for all. Nietzsche's anthropology is dualistic by contrasting the active nihilists to the passive ones: while the former accept the status quo for \"amor fati\",(Mauro Lanari)I take this opportunity to explain the matter (perhaps) once and for all. Nietzsche's anthropology is dualistic by contrasting the active nihilists to the passive ones: while the former accept the status quo for \"amor fati\", the latter fail to adapt to it as they do not possess a disposition that allows them to accept survivalism with its degenerative process until the extinction. Alternative dichotomies such as floats vs. drowned, integrated vs. apocalyptics, settled vs. marginalized, conformists vs. eccentrics are more imprecise. So far, humanity has shown that it falls within such a binary category, idem the entire planetary culture. Twentieth-century existentialism was a mass phenomenon that disappeared in the second half of the period. Earlier we find the Greek epic poems from Homer to Hesiod, the pre-Socratic philosophy, the Athenian tragedy that reached the point of no return with Sophocles' \"Oedipus at Colonus\" in 401. In the Jewish sphere, the further root of Western thought, we find the defeatism of Qohèlet. The problem lies in the fact that they have only ever known how to complain or protest, never suggesting anything constructive. The active nihilists are instead Epicureans, Horatians, Juvenalesques, cantors of the \"carpe diem\". Even art and therefore cinema can be traced back to the two Nietzschean typologies, and individual authors or single works can even oscillate unsteadily between one pole and another. \"Tertium datur\"? In effect, yes. In 524, the year before he was killed, Boethius exposes in the \"De consolatione philosophiae\" a dilemma that will find a more rigorous formula with Leibniz in the \"Essais de Théodicée\", written in 1705 and published in 1710: \"Si Deus est, unde malum? Si non est, unde bonum?\". For atheists, materialists and immanentists the opportunity opened up to analyze the second horn of the dilemma. How many took advantage of it? How many finally began to provide a proposal? To my knowledge, only one thinker: Ernst Bloch, starting with his main book released in '59. That is, our debut attempt beyond active and passive nihilisms dates back to only a few decades ago. Shocking and devastating. With this, even McDonagh cannot but refer to the \"despair of Kierkegaard\" (Federico Pontiggia), to the \"funereal twilight of Beckett\" (Enrico Azzano), \"not for nothing Samuel Beckett is Dubliner and certainly one of the strongest referents, [...] very skilled weaver of plots and dialogues mixed in the absurd\" (Emanuela Martini), \"it looks like a comedy of the absurd in costume written by Beckett\" (Carlo Valeri). And why not even 1938 Sartre's \"La Nausée\"? Stop with this rearguard, after decades and millennia I demand from culture something that at least [re]starts from Bloch.",
      "review_date": "2023-01-27",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Decent acting. More of a dark comedy, to me, but without the laughs. Simply a dark, and very stupid movie. I was expecting a revelation regarding how mad-eye moody was mentally handicapped. Didn’t come, despite my opinions about the character.",
      "review_date": "2023-02-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "i totally agree with your girlfriend. I am 71 and it is the worst movie i have ever seen. i am telling everyone i know not to see it. Why is so so awful?............I saw one reviewer who said his wife became physically ill and I could easilyi totally agree with your girlfriend. I am 71 and it is the worst movie i have ever seen. i am telling everyone i know not to see it. Why is so so awful?............I saw one reviewer who said his wife became physically ill and I could easily see that. What stood out for me was that every sentence that came out of someones mouth was a Klesha. What is a kleshas ? Mental states that cloud the mind and manifest in unwholesome action. (ie anger, fear, jealousy etc) Every word was dark, depressing, unkind, mean..........The movie just kept going downhill darker and darker.........I expected it would balance....that there would be some sparks of kindness but none.........Cutting off his fingers because the depressed guy spoke to him when his love in life was playing music is supposed to be art??? In whose world........plus made the Irish look stupid and mean. My ancestors are from the Irish Islands and this movie was really an insult to them............",
      "review_date": "2023-02-09",
      "source": "metacritic"
    }
  ],
  "num_reviews": 141
}