{
  "title": "Top Gun: Maverick",
  "rating": 7.4,
  "release_date": "2022-05-27",
  "summary": "After more than thirty years of service as one of the Navy’s top aviators, Pete “Maverick” Mitchell (Tom Cruise) is where he belongs, pushing the envelope as a courageous test pilot and dodging the advancement in rank that would ground him. When he finds himself training a detachment of Top Gun graduates for a specialized mission the likesAfter more than thirty years of service as one of the Navy’s top aviators, Pete “Maverick” Mitchell (Tom Cruise) is where he belongs, pushing the envelope as a courageous test pilot and dodging the advancement in rank that would ground him. When he finds himself training a detachment of Top Gun graduates for a specialized mission the likes of which no living pilot has ever seen, Maverick encounters Lt. Bradley Bradshaw (Miles Teller), call sign: “Rooster,” the son of Maverick’s late friend and Radar Intercept Officer Lt. Nick Bradshaw, aka “Goose.”  Facing an uncertain future and confronting the ghosts of his past, Maverick is drawn into a confrontation with his own deepest fears, culminating in a mission that demands the ultimate sacrifice from those who will be chosen to fly it.… Expand",
  "critic_reviews": [
    "Beyond the perfectly poised storytelling, awe-inspiring visuals and pulsing soundtrack, Maverick also possesses another important intangible. It brings out a feeling that’s arguably been missing from the multiplex for too long, where you will literally be able to hear a pin drop.",
    "This is how “blockbuster” movies should be done.",
    "As the jets cut through the atmosphere and brush their target soils in close-shave movements—all coherently edited by Eddie Hamilton—the sensation they generate feels miraculous and worthy of the biggest screen one can possibly find. Equally worthy of that big screen is the emotional strokes of “Maverick” that pack an unexpected punch. Sure, you might be prepared for a second sky-dance with “Maverick,” but perhaps not one that might require a tissue or two in its final stretch.",
    "Avoiding the danger zone of mere retread, Kosinski and co deliver all the Top Gun feels and then some: slick visuals, crew camaraderie, thrilling aerial action, a surprising emotional wallop and, in Tom Cruise, a magnetic movie-star performance as comforting as an old leather jacket. Punching the air is mandatory.",
    "The new film improves on the old one in every respect. The story is cleverer and more gripping, the dialogue is sharper and funnier, the relationships are richer, the aerial stunts are more likely to make you queasy.",
    "No cynicism, just on-point sentiment and scintillating set-pieces. Top Gun: Maverick scores a direct hit on its twin targets of nostalgia and adrenaline.",
    "When talking about Top Gun: Maverick, it’s hard not to sound hyperbolic, but this is the rare case where it absolutely deserves all the massive praise. Top Gun: Maverick improves upon the original in every conceivable way (well, the soundtrack doesn’t have Berlin, so that’s one strike against it), and does so in a way that might make this one of the greatest sequels ever made. It’s also hard not to say this might have some of the most exciting action scenes to ever hit the skies, and gives Cruise one of his best performances by returning to the role that made him a star. Top Gun: Maverick is a marvel of a film, one that will truly take your breath away.",
    "Thrilling, moving and gloriously Cruisey, Joseph Kosinski's sequel to the 1986 hit is unquestionably the best studio action film in years.",
    "As much as “Top Gun: Maverick” whips from a technical, visceral, thrill-making, supersonic-level, the entire endeavor and every little moment of introspection, suffering and determination is all the more accentuated, strengthened and fist-pumpingly good because you care so damn much about the story, the people and their very human concerns.",
    "Maverick works its wonders thanks to the perfect match of star power, source material ripe for retrofitting, and a director who knows how to wring the best out of his leading man and, more importantly, when to get the heck out of his way.",
    "The go-for-broke attitude with which Top Gun: Maverick asserts itself is key to its success. Evident in the visceral whiplash of the aerial extravaganza, and the tender earnestness of its more honest moments, Top Gun: Maverick is the kind of rare, all-encompassing, and finely-tuned blockbuster that––if you let it––will take your breath away.",
    "Stainless where the original was musty, neutered where the original was soft-core (there isn’t a single gratuitous shower scene in this sequel, let alone three of them), and structured like an immaculate pop song where the original moved like freeform jazz, “Maverick” sounds like a major regression from an age where summer movies didn’t always play safe.  But let’s not forget that Cruise is the only guy whose summer movies still vehemently refuse to do that.",
    "Joe Kosinski (Tron: Legacy) matches his well-established architectural precision with suitably nostalgic but never pandering emotionality, while Cruise commands the screen in a performance that leverages his multimillion-dollar star wattage to brighten the entire film.",
    "Hardly anything in Top Gun: Maverick will surprise you, except how well it does nearly all the things audiences want and expect it to do.",
    "This is the ideal example of a big summer blockbuster and one of the best legacy sequels we’ve ever gotten: a movie that knows how to move along and give you what you came for.",
    "The sequel is still unapologetically rah-rah about American imperialism, but who cares? Thirty-six years after the original, Tom Cruise is having the time of his life, the in-flight thrills are off the charts and—hot damn!—you won’t find more blazing action anywhere.",
    "And therein lies perhaps the only issue with the movie: Tom Cruise flies so close to the sun he blots out anything that might illuminate a hypothetically talented cast of characters. And that’s OK — it’s a Tom Cruise movie, and Tom Cruise isn’t really an ensemble actor.",
    "Like the hyper-competent aces at the story’s core, this is a movie that defines its lane early and sticks to it, with finesse, unfussy style and more than a few sneak attacks of emotion.",
    "Now that’s how you do a 1980s film sequel.",
    "The film handles Maverick’s personal stuff — wooing the barmaid, repairing his relationship with Goose’s kid — while also fulfilling its promise as an action movie. There are jets pulling 10Gs, the metal sound of cockpit sticks pulled in gear, epic dogfights and the whine of machinery balking at the demands put on it. The action even takes a few unexpected and thrilling turns.",
    "As insanely cool as the aerial dogfight scenes were in the original, the sequel’s action sequences levels them up with unreal camera angles and nonstop tension.",
    "Top Gun: Maverick soars higher than it has any right to, constructing a mostly terrific sequel 36 years later (including a Covid release delay), using a good movie, not a great one, as its jumping-off point. That might not be enough to take your breath away, but as brawny summer entertainment goes, it comes shockingly close.",
    "Clocking in at under two hours, virtually every word of prosaic bro dialogue, every dramatic exchange, every turn of events, is designed to do one thing: get us back in the sky twisting and turning at several times the speed of sound, narrowly avoiding crashes with other planes and with the ground.",
    "In a lot of ways, Top Gun: Maverick is the platonic ideal of a film sequel, constantly in dialogue with the original project, and committed to growing and expanding upon that source material.",
    "Director Joseph Kosinski (TRON: Legacy) revels in the sonic-boom rush of their many flight scenes, sending his jets swooping and spinning in impossible, equilibrium-rattling arcs. On the ground, too, his camera caresses every object in its view, almost as if he's making a rippling ad for America itself.",
    "Kosinski’s dogfights are pristine, incredible feats of filmmaking, economical and orbiting around recognizable space, but given to occasional, inexplicable shocks of pure chaos. Then quickly cohering again.",
    "A good two-thirds of Top Gun: Maverick is very solid, if unremarkable, but what really gets it off the ground are its top-drawer flight sequences, staged thrillingly by director Joseph Kosinski.",
    "Top Gun: Maverick offers exactly the kind of air-punching spectacle that reminds people why a trip to the cinema beats staying at home and watching Netflix.",
    "In short, Kosinski and his team have accomplished their odd, hybrid mission more impressively than should have been possible. Most importantly, they have, in an age of cartoon computer graphics, delivered action sequences that appear to be taking place in the real world.",
    "Top Gun: Maverick is a movie-star movie with great action pieces best seen on the biggest screen available. It’s a modern take on old-fashioned fun.",
    "Top Gun: Maverick, directed by Joseph Kosinski, is a much better film than its predecessor was, and much better than it needs to be overall.",
    "Cruise once referred to the '86 film as \"an amusement park ride ... a joy ride [which] shouldn't be looked at beyond that,\" and for audiences who can watch \"Top Gun: Maverick\" through that lens and appreciate it as a piece of propulsive action cinema, this could end up being one of the most crowd-pleasing and satisfying movie experiences of the year.",
    "Thanks to Cruise and Kosinski’s unfashionable insistence on practical filmmaking and their refusal to lean too heavily on computer-generated visual effects, their sequel plays like a throwback in more than one sense. But the era that produced the first film has shifted, and “Top Gun: Maverick” is especially poignant in the ways, both subtle and overt, that it acknowledges the passage of time, the fading of youth and the shifting of its own status as a pop cultural phenomenon.",
    "Top Gun: Maverick really isn’t packed with the kind of craven nostalgia that we’re used to these days. It’s smarter, subtler, and wholly more humanistic.",
    "Minor grumbles aside, few Hollywood reboots can boast this blend of nostalgia, freshness and adrenaline. You will want to high five someone on the way out.",
    "Top Gun: Maverick has so much fun flexing the might of its practical effects that issues like logic go right out the window. That’s the magic of the movies for you.",
    "Top Gun: Maverick is a rare sequel that is not only better than the original but retroactively makes Top Gun's story altogether deeper.",
    "It’s a slavish tribute to the first Top Gun. But it’s also a better film, and perhaps more importantly, a much nicer one: more grown-up, more generous, and more lighthearted, in line with its more mature star.",
    "Top Gun 2 reboots the original film's heart-pounding aerial action, infectiously cheesy character drama and don't-think-about-it-too-much military fetishism in a winning spectacle of cinematic escapism.",
    "There is still something to be said for skillful, old-fashioned filmmaking, and director Joseph Kosinski has done plenty of it here.  The result goes with popcorn like butter, and I liked it in spite of myself.",
    "Top Gun: Maverick is one of those rare breeds: a sequel that’s better than the original.",
    "Maverick is a movie made for “Top Gun” fans BY “Top Gun” fans, including director Joseph Kosinski, who wisely follows Scott’s directorial playbook nearly page for page and gives Cruise and the outstanding supporting cast breathing room to shine in alternating scenes of hotshot pilot banter and dramatic emotional impact.",
    "It’s a pretty good time, and often a pretty good movie for the nervous blur we’re in right now. It’s cozy.",
    "Just when I was about to nod off, Top Gun: Maverick jostled me awake with a fresh approach to the sort of blockbuster entertainment that the original movie managed so expertly. Faint praise? Maybe. But also higher praise than I ever expected to be giving.",
    "If you haven’t been to the movies in a while, Top Gun: Maverick is a way to get back in. It’s pretty much what “going to the movies” is all about.",
    "Even if you don’t harbor fond feelings for the 1986 Top Gun, a movie that upon its release was seen by many as a glamorized recruitment commercial for the Reagan-era military buildup, it’s hard not to appreciate the care that went into this lovingly tooled sequel—a far better film on the sheer level of craft than the original.",
    "What’s most impressive about Top Gun: Maverick is its speed—not the speed of the planes in flight but the speed with which the movie dashes in a straight line from its opening act to its conclusion. The flights at the center of the film are vertiginously twisty, but the drama is a bullet train on a rigid track.",
    "The plain fact is that Top Gun: Maverick works. Designed to coax a throng of viewers into a collective and involuntary fist pump, it far outflies the original, while retaining one old-fashioned virtue: the lofty action unfolds against real skies, rather than giant smears of C.G.I. The heroes may do super stuff, but they’re not superheroes.",
    "Top Gun: Maverick is an extremely enjoyable thrill ride, yet its focus on intense, immersive action doesn’t allow much room for lighter, steamier fun like its predecessor.",
    "The best thing this movie does is boost visceral analog action over the usual numbing bombardment of CG fakery, a choice fortified by having the actors in the airborne cockpits during shooting.",
    "Top Gun: Maverick is an out-of-bounds blast of afterburner fumes and thrillseeker highs that's sure to please audiences looking for a classic summer blockbuster.",
    "It’s all in good fun, even if you’re never really surprised by anything, even if your eyes roll with every barrel roll of a plot twist in the later acts. The stunts, the knock-you-around-in-your-seat dogfighting, still has “the need for speed” and a license to thrill.",
    "The editing of the action sequences — and let’s face it, they’re the heart of the movie — is terrifically effective. Speed is one thing. Clarity is another. Top Gun: Maverick has both.",
    "Had Tom Cruise not been in the cockpit, I suspect very little of that emotional component would be so effective. Maverick—loud and dumb and occasionally thrilling—is an act of arrogance, sure, a veteran movie star happily strutting onto the stage so lovingly set for him. (And which he helped design.) But that proves to be a clever reflection of the character he’s playing.",
    "The film fully surrenders to the grandiose fun that’s marked the best of Tom Cruise’s recent star vehicles and reaffirms Joseph Kosinski as a blockbuster craftsman par excellence.",
    "Top Gun: Maverick is a perfectly tolerable time-killer, and I enjoy popcorn as much as anyone, but I just hope these won’t be the only kinds of movies that bring audiences back to the theaters.",
    "Though you may hear otherwise, Top Gun: Maverick is not a great movie. It is a thin, over-strenuous and sometimes very enjoyable movie. But it is also, and perhaps more significantly, an earnest statement of the thesis that movies can and should be great.",
    "It’s a fresh-faced gloss on the original, in other words, powered, like the original, by a star who’ll simply never stop being a star. The big mission makes for the most exciting moment; the build-up is worthwhile. When Maverick goes its own way, it tends to lose itself.",
    "There’s plenty of rock’n’roll fighter-pilot action in this movie, but weirdly none of the homoerotic tension that back in the day had guys queueing up at the Navy recruitment booths set up in cinema foyers. Weirder still, it is actually less progressive on gender issues than the original film.",
    "In the end, Top Gun: Maverick counts as a worthy sequel in that it succeeds and fails in many of the same ways as the original. It’s another cornball male weepie and military recruitment ad that feels like every WWII movie got fed into an algorithm, and the flying sequences are breathtaking enough to make you forget that these guys and gals are engaging in the kind of combat scenarios that start wars.",
    "Featuring a rousing finale — two of them, actually — and substantial nostalgic pleasures, the new film can’t quite balance its desire to be both wistful and escapist, knowingly cheesy and surprisingly touching.",
    "Top Gun: Maverick does exactly what its intended audience wants it to do – pile on the airborne thrills and steely military heroics without knotting things up with too much moralising or complex character development.",
    "Top Gun: Maverick is not a dislikable movie, by any means: The cast is charming, the military stuff is convincing, the action sequences are, as intended, pretty astounding: In the proper theater (I saw it in IMAX) it will be a physical experience, literally, one that may lead to armrests being shredded by white-knuckling audiences in cinemas all over the world. But it’s also a little depressing, because of where it says movies are going, what it says about the lack of creativity making its way on screen, and what a precarious balance movie theaters are in."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Cruise control baby! I think this film is best described as the movie that was made in the 80s and I mean it in the best way possible. Apart from technology that was used to achieve beautiful shots of fighter planes action this film is aCruise control baby! I think this film is best described as the movie that was made in the 80s and I mean it in the best way possible. Apart from technology that was used to achieve beautiful shots of fighter planes action this film is a classic heroism tale. It's full of heart, badass moments, character drama and romance that's perhaps the only unnecessary part of the film.",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Many times the entertainment that doesn't seek to be complicated tends to be very relaxed and ends up being rather poor and, of course, completely forgettable.Top Gun: Maverick falls into the category of pure entertainment, but it's one thatMany times the entertainment that doesn't seek to be complicated tends to be very relaxed and ends up being rather poor and, of course, completely forgettable.Top Gun: Maverick falls into the category of pure entertainment, but it's one that makes the case of how to do it the right way. The story may seem simple yes, I'll give you that, but its strength is the action sequences and the film doesn't lie about it and gives it to you in abundance. Everything that happens with jets in this film is spectacular, especially that beautiful opening sequence with Maverick piloting that hypersonic plane. Does it rely on nostalgia? Of course, especially with that little Val Kilmer appearance, but it never feels like a gratuitous resource within the story. After all the movie makes it clear that it's a sequel, but it's not 100% vital for you to have seen the original.And even if you can question how necessary this sequel was after 36 years, this story proves its functionality in the blockbuster branch that should continue to invest in films like this one. Yes, it's a sequel and stars an ultra-famous name, but there's life for blockbusters outside of superheroes.Of course, that remains to be seen at the box office, after all, even with inflation, the original film cost just over $30 million, Top Gun: Maverick, not counting marketing, cost over $150 million.It sounds repetitive and perhaps for people who prefer streaming they won't even flinch, but as Cruise said it and as he fought for it, films like these are the ones that remind us why the theatrical experience will never be matched. Go see it, and have a good time.",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Top Gun: Maverick is as good if not better than the original movie from the 80s. The first and third acts keep in glued to the screen in anticipation to what will happen next. The nostalgia music sounds just as good 30 years later. All actorsTop Gun: Maverick is as good if not better than the original movie from the 80s. The first and third acts keep in glued to the screen in anticipation to what will happen next. The nostalgia music sounds just as good 30 years later. All actors from Tom Cruise to the younger crew do an exceptional job in their acting. The real jet fighter scenes really encapsulate the jaw dropping moments during several parts in the film. The revamped volleyball scene does not disappoint either. And the film ending with Gaga's epic ballad really seals the deal.",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A great sequel, better than the original easily. Absolutely awesome. Excellent cinematography. Best film I've seen in years!",
      "review_date": "2022-06-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is what you want from your entertainment—funny material to watch, without any BS or forced politics.One of the few movies in recent memory that genuinely kept me on the edge of my seat in the theatre, the action was great with eitherThis is what you want from your entertainment—funny material to watch, without any BS or forced politics.One of the few movies in recent memory that genuinely kept me on the edge of my seat in the theatre, the action was great with either no or very little cgi.",
      "review_date": "2022-08-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What did I just see? A movie respecting established characters. In the woke version, Maverick is a broken hobo called back to teach a team of lesbians who are already perfect in every way and teach him not to be a pathetic loser.",
      "review_date": "2022-08-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Firstly, the flying sequences are breathtaking and this is all because they did it practically. This is especially noticeable in the final act which is one of the best I've seen in recent memory. Additionally, the music score by HaroldFirstly, the flying sequences are breathtaking and this is all because they did it practically. This is especially noticeable in the final act which is one of the best I've seen in recent memory. Additionally, the music score by Harold Faltermeyer, Lady Gaga, Hans Zimmer, & Lorne Balfe is very good. I love how they incorporated those 80s tracks into the film while giving more modern and fitting music as well. Furthermore, their music score during the intense action scenes are well done and helps to make the scenes tenser.Tom Cruise is still great as Maverick even after almost 30 years. He still embodies the character perfectly and does feel like a natural evolution of his character from the first film. I genuinely believe that this is what Maverick would be like in 30 years. Miles Teller is also great as Rooster, Goose's son, and he has great synergy with Tom Cruise in their scenes together. Jennifer Connelly plays the new love interest for Maverick, Penny, and she is also great in her role thanks to her great chemistry with Tom. Glen Powell plays the rival to Miles and he is very good at being this overly cocky, hateable guy. Likewise, Jon Hamm plays the commander that is antagonistic to Maverick and he also does a good job at being hateable as well. Val Kilmer is one of the few actors from the original to return and I was interested to see how they would handle his throat cancer situation in real life. Thankfully, this film handles it respectfully and probably results in one of the most emotional scenes in the film. The rest of the supporting cast, including those who play the recruits, all do a good job as well.Moreover, the story itself is also surprisingly enjoyable. The first Top Gun was a cheesy action flick but this one is a very down to earth, character-driven story. Maverick is a lot wiser now thanks to the character arc he got from the first film when he was a student. However, now he has to be the teacher and this is a great antithesis to the story in the first film. The conflict between Maverick and Rooster is the heart and soul of this film. This family dynamic they have is the most engaging aspect of the story as Maverick now struggles with the possibility of letting the son of his once best friend die. Nevertheless, I do have some minor nitpicks with the film. I do find the dynamic of the recruits never does quite match the dynamic of the recruits from the first film. I never felt as strong of an attachment to the recruits and this is probably due to the film focusing on the teacher Maverick. There is also a romantic subplot with Maverick and Penny that just feels very superfluous. It never felt like the romance part was even connected to anything in the main plot. Heck, you could take this romance subplot and Penny out of the film and the main story is still the same. It just felt like the romance plot just took away screen time from the interesting stuff. I am also a little annoyed that there is no dialogue or line to explain why Maverick isn't with Charlie from the first film anymore. Especially, considering how relevant that character was in the first film.Overall, Top Gun: Maverick is better than the first movie in almost every aspect. It has more amazing action sequences and a more interesting character-driven story. In a world where CGI seems to always be the go-to solution, we then get a rare movie like this where the majority is practical and it is all the better for it. This is not only a worthy sequel but also an amazing accomplishment in movies.",
      "review_date": "2022-05-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great movie. Ive been there 9 times and may go again over the weekend. Such a relaxing American pie, feel good movie. Wish there were more movies like that.",
      "review_date": "2022-09-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It is really good I like the actions and the relations between maverick and the students.",
      "review_date": "2022-06-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Just a lot of fun with lots of nostalgic nods to the original. Highly recommended as an action film for some escapism.",
      "review_date": "2022-06-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Much better than expected. Certainly better than the first Top Gun.  My only real complaint was the love story w/Jennifer Connelly.  This is a movie made for the movie theater. I was entertained",
      "review_date": "2022-06-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A rare sequel - this one is actually better than the original. If this was a stand alone movie it would be a seven/eight of ten. But as a sequel navigating the modern outrage mobs and other cantankerous spoilers and wreckers waiting in theA rare sequel - this one is actually better than the original. If this was a stand alone movie it would be a seven/eight of ten. But as a sequel navigating the modern outrage mobs and other cantankerous spoilers and wreckers waiting in the wings to bring anything good down this thing is a solid ten. Tom Cruise doesn't look almost 60, he is in unreal shape for any age, but the work and dieting he must put in to look like this at 59 is nothing short of amazing. There is less cheese than was in the first movie, the music is great, and to see these people grunting and huffing while pulling real g-force maneuvers in real airplanes is so great. Tom Cruise had to take a huge amount of abuse to make this a reality - you can see the actors in planes sweating and suffering tunnel vision and black outs and redouts. One must have a healthy  respect for Tom Cruise for being one of the very very few in hollyweird that actually cares enough about his craft to put in the work. I hope this kicks off a new wave of serious remakes that can even outshine the original if done right and I hope this kicks off a new wave of movies that skip the idiotic computer generated trash and get back to practical effects like this movie. This is basically an 80's movie done right - take all the good music and good looking people, reduce the cheese and come up with an engaging multi-faceted multi-layered plot that develops emotion and take it to eleven on a scale of ten.",
      "review_date": "2022-06-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you watched TopGun as a kid and loved it, this sequel will bring you to your knees with tears. It brought my entire cinema down in a rollercoaster of HOOOOLY **** and NOOOOO and HELLYEAHHHs. It’s that good. I’m not a Tom Cruise fan,If you watched TopGun as a kid and loved it, this sequel will bring you to your knees with tears. It brought my entire cinema down in a rollercoaster of HOOOOLY **** and NOOOOO and HELLYEAHHHs. It’s that good. I’m not a Tom Cruise fan, actually the opposite. Have a hard separating his acting and his “religion”. But daaamn, that man brought his A game to this one. Easily the best flick 2022 so far (guess it should earn “best late movie of 2020 ",
      "review_date": "2022-05-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Epic. Amazing. I've seen it more than once and still want to see it again. Its better than I expected.",
      "review_date": "2022-08-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best cinema experience in years, It went into my top movie list.",
      "review_date": "2022-08-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Fantastic movie that takes everything good from the first one and improves on it. I can't fault it.",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I can NOT believe we got a shirtless and sweaty full on Tom Cruise running moment. And the movie pulled it off semi unironically.",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best cinema experience in years. Watch it in IMAX, you will not regret it!",
      "review_date": "2022-06-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The short review: This has the best jet fighter action scenes in a film, EVER. The human drama part, however, falls a bit short. Related media: I have seen the original Top Gun film on TV numerous times. That film likely had the best jetThe short review: This has the best jet fighter action scenes in a film, EVER. The human drama part, however, falls a bit short. Related media: I have seen the original Top Gun film on TV numerous times. That film likely had the best jet fighter action scenes in a film back then too, and the human drama part also fell a bit short back then too.Positives:1) All the jet fighter scenes are genuinely, top of the class! 2) The sound effects and the special effects are really top notch!3) The excuse used to feature the F-14 fighter in the film in a major way, when no F-14 is allowed to fly anymore, in the military or by the public, is CLEVER.Negatives: 1) (This is hinted at in the trailer, so it’s not spoiler.) It has been some 35 years since the events in the original film. Surely the grief over the death of Goose should be over by now? This part is rather unrealistic. I know there’s more to it, but still…2) The past relationship between Maverick and new flame was hinted at, but not covered much in this film. This coincided with a slow part of the film, thus making this part feel poor.3) The original film had two great original songs. The songs in this film are not great.4) (This is hinted at in the trailer, so it’s not a spoiler.) The top enemy fighter plane is obviously the Russian Su-57 (Felon), yet the film makes all attempts to call it the ‘fifth generation fighter’ rather than its real name, all the time, such that the film distributor can sell the film to the Russian market. That’s silly! Considering the banning of such sales following the Russo-Ukrainian war, that’s all for nought! Pilots would not use so many words to describe the fighter. As with the original Top Gun film, where the enemy fighter was given the fictitious name, Mig-28, here the fighter should also had been given a fictitious name, like ‘Firefox’.Children: Excellent.Teens: Excellent.Young adults: Excellent.Medium-age adults: ExcellentOlder adults: Good.    My rating: 4/5 (no half scores). Definitely watch it in the cinema.",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Miles better than the original 1986 film and one of my favorite sequels of all time. God this film is just awesome. That’s the best way to describe it; awesome. The flying is awesome, the characters are awesome, the music is awesome, and theMiles better than the original 1986 film and one of my favorite sequels of all time. God this film is just awesome. That’s the best way to describe it; awesome. The flying is awesome, the characters are awesome, the music is awesome, and the action is awesome. Tom Cruise’s dedication to making realistic action films with little to no visual effects has paid off incredibly well here. The flying scenes were filmed practically but they look amazing. Some of if not the best shot sequences of the year so far. I absolutely adore how they look and it’s amazing that the actors were able to act in those conditions. They all do a great job acting. Tom Cruise, Miles Teller, and Glen Powell are all standouts here and their respective characters and journeys were really well done and even compelling at points. Val Kilmer did a great job as well under his own personal circumstances. The film handles Kilmer’s medical condition and character incredibly respectfully. It’s a great handling of his character. The action here is awesome. It’s incredibly well thought out and intense. You could know or predict the outcome of a scene and you could still feel your heart beating out of your chest just because of how well done the action is. It’s genuinely some of the best action in a blockbuster that I’ve seen in a long time. The final action scene itself is probably my favorite action scene of the year. It’s absolutely amazing and so much better than the final fight in the original film because it’s actually set up. The music here from the original Top Gun composer, Lady Gaga, and Hans Zimmer is great! The soundtrack itself isn’t near as good as the original 86 film but it’s still great here. I can’t wait to see how Cruise breaks the mold with action again in the future. This is a must see from me for everyone. This film deserves to break $1 Billion at the box office so go see it now!",
      "review_date": "2022-06-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's probably the best movie this year,  better than the first top gun in every point",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Outstanding .If you didn't see the first part, see it first before experiencing this one ,this part just does what a sequel should do - which in this case means Doubling down on the Incredible Visuals ,Thrills and Emotions that made theOutstanding .If you didn't see the first part, see it first before experiencing this one ,this part just does what a sequel should do - which in this case means Doubling down on the Incredible Visuals ,Thrills and Emotions that made the topgun so much Fun!And you just can watch it for one man the maverick himself TomCruise ,he is keep finding ways to entertain to the highest level and this role he just done it with heartwarming emotions !Excellent making and directions and background score is perfect to the story pacing and all cast done terrific job !!",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I don't like movies.  I only saw this because I had a free ticket.  I don't care about f18's. I never saw Top Gun.  This was a great movie.  Don't sell short on Tom Cruise getting an Oscar nomination for this.  He pulled everything togetherI don't like movies.  I only saw this because I had a free ticket.  I don't care about f18's. I never saw Top Gun.  This was a great movie.  Don't sell short on Tom Cruise getting an Oscar nomination for this.  He pulled everything together very nicely.  The story is superficial, non-stop fun.  It's worth seeing.",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Outstanding. And I don’t write that lightly. This film really delivers. I wanted to watch it again immediately. Solid but simple story line.Great cast. Amazing flight sequences. Action.  Humour. Sadness. Love. Just a great blockbuster movieOutstanding. And I don’t write that lightly. This film really delivers. I wanted to watch it again immediately. Solid but simple story line.Great cast. Amazing flight sequences. Action.  Humour. Sadness. Love. Just a great blockbuster movie . To be honest, I’ve missed this sort of cinematic experience. This all being lead by the unbelievable , incredible Tom Cruise. Who truly puts himself on the line for the film goers. A true artist. One of the last real classic film stars. This film has all that you need. Will it win Oscars? Probably not. But will you get your money worth? Absolutely. In my humble opinion, This is such a better movie than the first, even though I still love that movie. I was gripped within the first opening minutes. My heart did not stop beating at high rates in anticipation of every moment. I was not disappointed. It’s been a long long time since I’ve experienced that rush and enjoyment watching a film.  I recommend anyone to go see this film. You will not leave disappointed. ( I hope). ⭐️⭐️⭐️⭐️⭐️",
      "review_date": "2022-06-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If 'Top Gun' is about Maverick coming into terms with his sexuality — as Tarantino explained in that hilarious video — then 'Top Gun Maverick' is about Tom Cruise saving the cinematic experience. When Ed Harris' character tells Maverick thatIf 'Top Gun' is about Maverick coming into terms with his sexuality — as Tarantino explained in that hilarious video — then 'Top Gun Maverick' is about Tom Cruise saving the cinematic experience. When Ed Harris' character tells Maverick that \"his kind it's headed for extinction\", Maverick's \"But not today, sir\" is Tom Cruise's war declaration to streaming services. As long as he's alive, no film of his will debut on any platform. Even if you hate the guy, you gotta praise his commitment to the good old habit of going to the cinema.",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's very rare for any movie to be worthy of a rating of 10. For an action drama sequel -- this was a 10. It hits all the right notes -- action, suspense, drama, nostalgia, love --and the story is a good one. It's a fun ride. Good way toIt's very rare for any movie to be worthy of a rating of 10. For an action drama sequel -- this was a 10. It hits all the right notes -- action, suspense, drama, nostalgia, love --and the story is a good one. It's a fun ride. Good way to kick off summer. Bravo to Cruise and team for making a good movie at a time when most everything else is crap.",
      "review_date": "2022-05-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Everything I wanted and more. I knew I was going to see this movie in theatres, but it was spur of the moment to see it tonight. I’m so glad I did. I intend to see it again in IMAX.I was starting to think movies would never be good againEverything I wanted and more. I knew I was going to see this movie in theatres, but it was spur of the moment to see it tonight. I’m so glad I did. I intend to see it again in IMAX.I was starting to think movies would never be good again but then Everything Everywhere All At Once and Top Gun Maverick back to back. Hell yeah movies are back baby",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Honestly, the hype this had coming out of Cannes had me a bit worried. If even that film festival's occasionally-fussy audience members managed to bestow this with near-universal acclaim, then that's a lot of damn pressure on me to like thisHonestly, the hype this had coming out of Cannes had me a bit worried. If even that film festival's occasionally-fussy audience members managed to bestow this with near-universal acclaim, then that's a lot of damn pressure on me to like this thing too. Christ alive did I nothing to worry about. Not only is \"Top Gun: Maverick\" at least a worthy companion piece to the seminal 80's classic, it's a disarmingly superior film and quite possibly one of the best sequels to a movie that's about as much of a cultural fixture as movies can get. Joseph Kosinski, Tom Cruise and the screenwriting and stunt teams needs to take a victory lap on this one. Potent emotionality, eminent likability on the part of Cruise and ripping soundtrack aside, the thing I loved the most about this one is how much the stakes and circumstances are ramped up this time around. I remember the set pieces in the original Tony Scott film being engaging and entertaining, but never quite as intense and menacing as they're presented here. There's almost a point in the film where you as an audience member are dreading the moment where this final mission has to take place. The action also scales in such a satisfying way throughout the course of the film, with the finale honestly constituting one of the best action sequences I've seen in a movie in a very, very long time. Doubtful that any summer movie's going to top this in the coming months. Completely floored with how much I absolutely loved nearly every minute of this.",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Same as Kobra Kai! THIS is how you make a sequel! It's better than the original. Scenes from the first movie are replicated the perfect way and that is how you pass the torch to a younger generation. The movie honors the characters and that'sSame as Kobra Kai! THIS is how you make a sequel! It's better than the original. Scenes from the first movie are replicated the perfect way and that is how you pass the torch to a younger generation. The movie honors the characters and that's exactly what I wanted. It brings out so many emotions I can't describe...it's a rollercoaster in every way. At some point you think the movie is over, but it keeps going and it only gets better. The original score completes this amazing movie.",
      "review_date": "2022-06-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was solid overall with a good opening and a great ending with a bunch of filler in the middle that hurt the pacing of the movie. All the action scenes are incredible. The romance between Maverick and the bartender didn't work forThis movie was solid overall with a good opening and a great ending with a bunch of filler in the middle that hurt the pacing of the movie. All the action scenes are incredible. The romance between Maverick and the bartender didn't work for me at all and all those scenes were bad. Maverick trains all these top gun fighters for a mission that's like something from Ace Combat 7. Ice man was in this too and there's some emotional scenes with him. Movie could have been amazing but it was just missing something in the middle that could have made it a little more interesting or entertaining. Honestly the middle of this movie dragged. If you like the romance stuff maybe you disagree but it didn't work for me. Also Goose's son is in this movie as a fighter pilot and there's a storyline involving him in Maverick that is interesting and it really works well. Some of this movie is incredible and better than the original. But I think in the original the romance worked more. In this one it didn't at all maybe because Tom Cruise is older and the actress playing the bartender is not that good looking and old",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best movie I've seen in recent times, currently there are only bad movies, this one was much better than expected. Congratulations!",
      "review_date": "2022-06-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best cinema experience i've ever had.Must see on cinemas absolutely.",
      "review_date": "2022-06-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Worth seeing in the theater. The flight scenes will leave you feeling affected.",
      "review_date": "2022-06-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "As someone who hasn't even seen the first TOP GUN movie, only knowing a few story details, I can honestly say that TOP GUN: MAVERICK is a very enjoyable and very well done film. The movie is worth watching, even if you haven't seen the firstAs someone who hasn't even seen the first TOP GUN movie, only knowing a few story details, I can honestly say that TOP GUN: MAVERICK is a very enjoyable and very well done film. The movie is worth watching, even if you haven't seen the first film. This movie may not do anything \"new\", but it does a lot right. I definitely recommend checking this blockbuster out.",
      "review_date": "2022-06-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis movie is just fantastic, the flight scenes are amazing, Tom Cruise is great as always, and the music is top-notch. Also, the use of Danger Zone at the beginning was so great for fans of the song and the original movie.",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I saw the original when I was 4 years old back in 1986. I cried through the whole opening scene of Maverick. Fast, loud and unapologetic. Pure visual poetry. A true and worthy sequel.",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best film I've seen in years and the best cinema experience I've had since The Dark Knight.",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Top Gun: Maverick is a phenomenal example of modern-age cinematography. The 3-year delay for this movie is justified by the final product we are fortunate to see. It is far too common that Sequels for Standalone films are produced purely forTop Gun: Maverick is a phenomenal example of modern-age cinematography. The 3-year delay for this movie is justified by the final product we are fortunate to see. It is far too common that Sequels for Standalone films are produced purely for 'nostalgia money' but Top Gun: Maverick is an anomaly of modern-age filmmaking. My respect for the cast and crew was further enhanced by the knowledge that they used practical effects and put the actors in actual Military-grade fighter aircraft. Too often are films quickly made and rushed with the use of CGI and it is incredibly refreshing to see a movie created with sheer passion and commitment to creating this sequel. I was not born to witness the original, but my Mother and her Friend's enjoyment in the cinema proved to me that this movie whilst bringing a new plot, could also pay homage to the feeling of the original.The story is told in a manner that is neither boring nor underplayed, and the return of iconic actors in a realistic way further enhances the respect given to the original. Although there are elements of the plot that are bland, the feeling of the movie suits the narrative. The actors all deserve huge credit, not only for their performance but also for their dedication with flight-training to partake in their roles to the best of their capabilities.This is a great movie in a time of over-saturation and CGI, I am so refreshed to see a movie that does not rely on the use of CGI and soleless storytelling, more like this, please.",
      "review_date": "2022-06-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's a good movie overall, but the 3rd act is utterly breathtaking in every way and carries it several steps up.",
      "review_date": "2022-05-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Much better than expected. Certainly better than the first Top Gun. My only real complaint was the love story w/Jennifer Connelly. This is a movie made for the movie theater. I was entertained",
      "review_date": "2022-06-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was impeccably filmed, had great music, awesome sound and an engaging story. It didn't seem to have a slow moment in it.  The military hardware was great to see in motion and everything just \"felt\" right with a lot of throwbacks toThis movie was impeccably filmed, had great music, awesome sound and an engaging story. It didn't seem to have a slow moment in it.  The military hardware was great to see in motion and everything just \"felt\" right with a lot of throwbacks to the earlier film as well as this one forging its own path.  Fun, poignant and great action. A review score seems almost arbitrary as I'll buy this on 4 k when released. So if you liked the first Top Gun you'll like this one.  9.9/10. Go see it then go and buy it on your favourite format when it's released. 25/5/2022.",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Excellent movie! It honored the work of Tony Scott and even made me remember the good movies of the 80's and 90's.",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Just created account to rate this movie...Absolutely stunning, simply epic sequel. I'm speechless.",
      "review_date": "2022-06-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is a combination of steroids, adrenaline, testosterone, endearing positivity and bottled nostalgia that gave feelings that I haven’t felt since childhood. I left the cinema feeling.. alive.Tom Cruise is spectacular, both on andThis film is a combination of steroids, adrenaline, testosterone, endearing positivity and bottled nostalgia that gave feelings that I haven’t felt since childhood. I left the cinema feeling.. alive.Tom Cruise is spectacular, both on and off screen.",
      "review_date": "2022-06-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I've seen this 3 times. In short, it's a top 5 best I've watched in the theaters in my life. Perfection. Mission accomplished, Tom.",
      "review_date": "2022-06-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Absolutely fantastic movie. Fun story, great characters and incredible in cockpit camera angles.",
      "review_date": "2022-06-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An excellent sequel to a classic. Full of the franchise's signature high octane scenes, the movie nevertheless manages to have many emotional and poignant scenes, especially between Maverick and Rooster. The movie also has an incrediblyAn excellent sequel to a classic. Full of the franchise's signature high octane scenes, the movie nevertheless manages to have many emotional and poignant scenes, especially between Maverick and Rooster. The movie also has an incredibly touching moment paying tribute to Val Kilmer that had everyone in the theater with me tearing up. I definitely recommend it.",
      "review_date": "2022-05-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Top Gun 2 delivers that 80s cheese you want with a striking coat of modern paint.  While I wasn’t moved by the film’s paint-by-number emotional subplots, they were in service of a well rounded story that pays off marvelously in its finalTop Gun 2 delivers that 80s cheese you want with a striking coat of modern paint.  While I wasn’t moved by the film’s paint-by-number emotional subplots, they were in service of a well rounded story that pays off marvelously in its final stretch.  The last 30 minutes of this film are among the best stretches of any action film I’ve seen.  It becomes a full on roller coaster that deserves to be seen in IMAX.",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I would call this movie a theater only experience. I feel like watching this movie at home just wouldn’t be the same. That’s the only deducted point. This does the first movie justice, and goes beyond that.",
      "review_date": "2022-06-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "real good legacy sequel, definetly better than the first top gun movie, airborne action scenes like  never seen before",
      "review_date": "2022-06-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I saw this movie yesterday and I can't stop thinking about it. I thought the original Top Gun was a great movie and it was a big surprise that 35+ years later, a sequel was made.The sequel is based on the original Top Gun and takes theI saw this movie yesterday and I can't stop thinking about it. I thought the original Top Gun was a great movie and it was a big surprise that 35+ years later, a sequel was made.The sequel is based on the original Top Gun and takes the movie to new levels that are astonishing in many different ways. Obviously, the action scenes are completely amazing. Beyond that, this is a movie very much about relationships. Relationships about teams and relationships focusing on 1-1 dynamics. Painful history with a lot of hope and suspense to see how it unfolds.In the end, the most significant aspect of this movie is Tom Cruise’s performance. He truly inhabits the character Maverick. Tom Cruise is one of the best actors of the 20th and 21st century and he proves it again and again in this movie.Hint: Watch/Re-watch the original Top Gun, then run out to see this movie.",
      "review_date": "2022-06-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Everyone showed up with their movie star performances, and I mean that in the best way. This movie was put together so well. This is worth a few views in the theater.",
      "review_date": "2022-05-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie feels like the end and the beginning at the same time oh my gooooood what an experience, was on the edge of seat the whole time. Tom cruise is truly the last real movie star. An epic movie and one hell of an experience.",
      "review_date": "2022-05-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Non stop action. Yes the movie might not be for everyone, yes the movie doesn't have major plot twists and the cinematography is great amazing shots and almost no CGI.  Seriously great movie, watch it twice and would like to watch it again onNon stop action. Yes the movie might not be for everyone, yes the movie doesn't have major plot twists and the cinematography is great amazing shots and almost no CGI.  Seriously great movie, watch it twice and would like to watch it again on a larger screen now :) sadly not IMAX around. Have fun enjoy the movie , completely recommended.",
      "review_date": "2022-06-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An incredible tour de force of quality movie writing, directing, acting, and pacing. I'm shocked how much I liked this movie. No workness, social justice, alternate lifestyle pushing etc. Just a good fashioned american movie. LOVED IT! BestAn incredible tour de force of quality movie writing, directing, acting, and pacing. I'm shocked how much I liked this movie. No workness, social justice, alternate lifestyle pushing etc. Just a good fashioned american movie. LOVED IT! Best movie in the last 3-5 years.",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Top Gun: Maverick is one of the most gripping action movies I've ever seen. Moments that you are literally on the edge of your seat don't happen often anymore. Yet this film manages to amaze in 2022 with breathtaking shots in which you almostTop Gun: Maverick is one of the most gripping action movies I've ever seen. Moments that you are literally on the edge of your seat don't happen often anymore. Yet this film manages to amaze in 2022 with breathtaking shots in which you almost feel the g-forces, a fantastic soundtrack and a story that has taken the time to tell it at the right pace. This film is one to remember!",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I had absolutely 0 expectations coming to this movie - I didn’t really know what it is going to be about and neither did I see the previous movie. Nevertheless, I was absolutely stunned by an amalgamation of visual, auditory and 4D experienceI had absolutely 0 expectations coming to this movie - I didn’t really know what it is going to be about and neither did I see the previous movie. Nevertheless, I was absolutely stunned by an amalgamation of visual, auditory and 4D experience of the movie, it really drove my adrenaline up. But what was more surprising is how human the movie is - it conveys emotions, hopes, ups and downs so good that it’s not possible not to care about every single character in the movie. Moreover, even though I didn’t see the first movie, I still got a great sense of nostalgia that is done just right to bring context to the movie, not just cash on peoples memories. All in all, I’m just mesmerized by it and might go for the 2nd run.",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of those rare instances in cinema where a sequel somehow manages to outdo the original in just about every single way.",
      "review_date": "2022-06-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I am a huge fan of the original, which hit theaters when I was 8. This sequel was everything I could have hoped for - and then some. Not only was reverence and homage paid to the story of the original movie, but the sequel also had its ownI am a huge fan of the original, which hit theaters when I was 8. This sequel was everything I could have hoped for - and then some. Not only was reverence and homage paid to the story of the original movie, but the sequel also had its own unique narrative and deeper themes than just the cinematic spectacle of the aerial action. I had tears in so many moments while my heart was going at Mach speeds and pulling massive Gs. The work in the planes was also real and that meant a lot. See it on as big a screen as you can.",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best movie of the year, great to see this in 2022, Tom Cruise show to us the",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What a great movie it was. One of the best in years. No forced politics or anything like that. It's a must watch.",
      "review_date": "2022-06-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "excellent[ ek-suh-luhnt ]adjectivepossessing outstanding quality or superior merit; remarkably good.[Watched in Cinema]",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Excellent movie overall, great story, great acting. It is the first time we see actors flying those amazing machines and it is certainly an amazing experience.",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is about as close to perfect as any sequel can get. Great action, FX and writing. While it is Mavrick's movie. All the supporting cast help make this movie a great watch.",
      "review_date": "2022-05-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This Movie made me smile so often it was really a pleasure to watch.I strongly recommend this Movie and i think to watch it in a Cinema is a must with all this great scenes and the incredible sound of this Film. Great Story with greatThis Movie made me smile so often it was really a pleasure to watch.I strongly recommend this Movie and i think to watch it in a Cinema is a must with all this great scenes and the incredible sound of this Film. Great Story with great Characters 10/10 !",
      "review_date": "2022-05-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Sometimes it just feels like I watched an entirely different movie than everyone else. The characters were paper thin, the dialogue was barebones, and the film was obsessed with callbacks to the original. I couldn't take the plot seriously,Sometimes it just feels like I watched an entirely different movie than everyone else. The characters were paper thin, the dialogue was barebones, and the film was obsessed with callbacks to the original. I couldn't take the plot seriously, the mission they're training for is psychotically suicidal, and I couldn't even enjoy the aerial sequences since they ignored the laws of physics and just followed Anime-logic. I dunno, I must've just seen a different movie than everyone else.",
      "review_date": "2022-07-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The 2nd half kind of saves it, kind of, but this was a HUGE disappointment, especially after all the gushing reviews.  Maybe Cruise is working his Scientology crap on them.  Some of the WORST directing, acting and script I have ever seen, andThe 2nd half kind of saves it, kind of, but this was a HUGE disappointment, especially after all the gushing reviews.  Maybe Cruise is working his Scientology crap on them.  Some of the WORST directing, acting and script I have ever seen, and I'm a huge movie buff.  LOVE the original, it was fun, this is almost an embarrassment. I've never seen a poor Jon Hamm performance until this, and Cruise is obviously in cruise mode lately as he hasn't made a decent film since MI3 and is now just riding the mediocrity train to the bank.  I have really gotten sick of these check the box films now too that ensure every race, creed, nationality and sex is equally represented for no artistic reason other than to appeal to everyone.  I have NO idea what the woman pilot was doing there, and she could've easily been replaced by a mannequin.  Connolly was boring and wooden.  The flight scenes ranged from meh to good, the music was bland, poorly used, and NOWHERE as emotion stirring as the original. The Val Kilmer treatment was a saving grace, but come on viewers and critics. There's no way you're keeping it real, or maybe you saw a different film. Maybe after a long theater absence you've lowered your standards and expectations and are just to eager for a great theater experience.  I get that, we all need that fun again. For me, this just wasn't it",
      "review_date": "2022-06-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "tacky, boring, horribly acted, annoying, we left half way, couldn't stand it anymore",
      "review_date": "2022-08-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What a piece of garbage. Looks good in a cinema, but the story line is so unbelievably bad and predictable. Lost some brain cells whilst watching. The original Top Gun wasn't that good to begin with, but this was the cheapest re-make TomWhat a piece of garbage. Looks good in a cinema, but the story line is so unbelievably bad and predictable. Lost some brain cells whilst watching. The original Top Gun wasn't that good to begin with, but this was the cheapest re-make Tom Cruise could come up with.",
      "review_date": "2022-06-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie teaches you two lessons.1) It´s cool to use your motorbike with your jacket and no helmet. Go as fast as possible, you can do the f*k you want in America.\n\n2) Kids, \"don´t think, just act\" that should be your motto in life. (yes,This movie teaches you two lessons.1) It´s cool to use your motorbike with your jacket and no helmet. Go as fast as possible, you can do the f*k you want in America.2) Kids, \"don´t think, just act\" that should be your motto in life. (yes, my review is pure sarcasm.)",
      "review_date": "2022-06-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Blatant propaganda film, and the actual mission is just a retreaded Star Wars Death Star assault, but still handled fairly well.I appreciate that they continue the tradition of not identifying the antagonist faction/OPFOR, and actually gotBlatant propaganda film, and the actual mission is just a retreaded Star Wars Death Star assault, but still handled fairly well.I appreciate that they continue the tradition of not identifying the antagonist faction/OPFOR, and actually got to fly the jets thanks to Cruise's demands.The only cons I have with it are that it's a bit of a nostalgia trip, they think F/A-16s can somehow compete against SU-35s. (You are horribly mistaken if you think this is the case), and that once again America thinks they are liberator and goes to unnamed country to bomb them because \"they aren't allowed their own nuclear deterrence\"...but sure, good propaganda film.",
      "review_date": "2022-08-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In the original Top Gun, Pete \"Maverick\" Mitchell wasn't perfect. In this movie, he is.This movie relentlessly builds the character up into an infallible, extremely boring superhero, who gets second chances for anything and everything. TheIn the original Top Gun, Pete \"Maverick\" Mitchell wasn't perfect. In this movie, he is.This movie relentlessly builds the character up into an infallible, extremely boring superhero, who gets second chances for anything and everything. The new generation of pilots that should surpass and replace a man past his physical prime isn't even allowed to come close to him. Also, nepotism is OK when it benefits Maverick, for some reason.The original movie, so often dismissed as \"dumb Reaganite bombast\", had characters who were at least human. Interesting at times. Definitely not fit for real military service, but good for a story. Top Gun Maverick is much sillier and less believable than its forebear.",
      "review_date": "2022-05-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A solid follow up to the original but lacks the charisma of the original cast, and while the aviation scenes are spectacular, everything on the ground kind of drags.",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was slow and predictable. Bad script, with short sentences and small words, delivered badly. A total propaganda piece to drum up support for our over priced military. The only thing lacking was a sound track of our most patrioticThis movie was slow and predictable. Bad script, with short sentences and small words, delivered badly. A total propaganda piece to drum up support for our over priced military. The only thing lacking was a sound track of our most patriotic songs sung by Toby Keith.",
      "review_date": "2022-08-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Positive: fighter jets scenesNegative: everything else from every character, scenario, script, ending",
      "review_date": "2022-05-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'm not sure what movie others were watching but this is not even close to bettering the original. It lacks the soul of the original. From the  one liners that people still remember today the cast of over the top egotistical characters whoI'm not sure what movie others were watching but this is not even close to bettering the original. It lacks the soul of the original. From the  one liners that people still remember today the cast of over the top egotistical characters who are larger than life. The great soundtrack that strikes up at the right time. This movie has none of it. It try's to ride on the coat tails of nostalgia and falls flat. It won't take your breath away. Infact if anything it's lost that loving feeling.",
      "review_date": "2022-05-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "To be fair, this movie does one thing extremely well. The jet flying sequences in this movie is top notch cinema, and it was extremely real and authentic without use of CGI. However, the greatness of the jet flying cannot overcome theTo be fair, this movie does one thing extremely well. The jet flying sequences in this movie is top notch cinema, and it was extremely real and authentic without use of CGI. However, the greatness of the jet flying cannot overcome the ridiculousness of everything else in the movie. The dialogue was weird and cringe. Nothing about it seemed real and authentic unlike the jet flying. The love story was completely useless, and the plot is nonsense. It made me feel like the protagonists were the bad guys. Why would I root for someone who is going to other countries and dropping bombs on them unprovoked? This movie is nothing but a military propaganda film. Huge action and explosions with a weak plot and no substance. That's Hollywood for you.",
      "review_date": "2022-07-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Saw this in 4DX. The scenes in the air are are brilliant. Its so great they shot it in-camera and not like a Marvel CGI video game. It is worth watching the film just for the spectacular aerial sequences. Everything else is a bit ridiculous.Saw this in 4DX. The scenes in the air are are brilliant. Its so great they shot it in-camera and not like a Marvel CGI video game. It is worth watching the film just for the spectacular aerial sequences. Everything else is a bit ridiculous. The dialogue could have been written by a 15-year-old who had recently watched the original film. Close up's Jennifer Connelly's over-smoothed face and distant delivery garnered the loudest laughs from the audience. The overall message of the film is: Tom Cruise is the saviour of the universe, kneel before Tom, then go pay to see another Mission Impossible.",
      "review_date": "2022-05-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I haven't seen such a lazy piece of mainstream garbage since the adaptation of the board game Battleship. They basically just remade the first movie, but way worse. The only redeeming thing about the film is the hot airplane action, but evenI haven't seen such a lazy piece of mainstream garbage since the adaptation of the board game Battleship. They basically just remade the first movie, but way worse. The only redeeming thing about the film is the hot airplane action, but even that becomes boring after a while. Just because it's a mainstream film doesn't mean it can't be creative or different in some way, Top Gun Maverick feels like it was phoned in. You can do better, Hollywood, I know you can.",
      "review_date": "2022-06-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Machines for war and an unexpressive main character. Also, the main theme is terrible.",
      "review_date": "2022-06-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is purely for movie theater profits. It will fade into obscurity before winter, as it has nothing the original brought to the screen. Music is terrible, the hero is completely unbelievable 60 year old man, that is somehow betterThis movie is purely for movie theater profits. It will fade into obscurity before winter, as it has nothing the original brought to the screen. Music is terrible, the hero is completely unbelievable 60 year old man, that is somehow better than the best in the world cadets. Moral of this movie, is go see little Tom Cruise show you his degrading body. Disgusting.",
      "review_date": "2022-05-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "AWESOME!!! A must see movie. 30 years later but still the same Maverick. Tom Cruise rules!!",
      "review_date": "2022-09-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best blockbuster ever!! after the coronavirus and cinema's lack of quality, this movie wakes up the cinema. top gun maverick one of best in 2022. movie came out imay but still getting top 5 place in the august. dominate box office. tomBest blockbuster ever!! after the coronavirus and cinema's lack of quality, this movie wakes up the cinema. top gun maverick one of best in 2022. movie came out imay but still getting top 5 place in the august. dominate box office. tom cruise's most money win movie. what else do you want? everything was perfect in this movie.",
      "review_date": "2022-09-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Tom cruise on point again, fantastic movie,Hollywood needs to take notes on why this movie is so awesome and start making great movies again",
      "review_date": "2022-09-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "nice review bomb indians, rrr fans really review bombed this movie for being better than their overrated trash lol.",
      "review_date": "2022-09-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Excellent popcorn flick made for the fans.  Excellent characterization and Easter Eggs along with homages to the previous movie.  I saw the original in the theater and glad Tom held out for this to be in the theater and a must see on a bigExcellent popcorn flick made for the fans.  Excellent characterization and Easter Eggs along with homages to the previous movie.  I saw the original in the theater and glad Tom held out for this to be in the theater and a must see on a big screen with great sound.  My kids also enjoyed the movie and one had only just seen Top Gun recently and the other not at all.  Glad there was no hidden agenda.  Great to see all the practical filming aspects vs green screen.   I highly recommend this.",
      "review_date": "2022-05-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Top Gun: Maverick is an extremely entertaining, fun, and engaging movie. This is the best sequel to a movie in decades, vastly improving upon a popular classic, while paying homage to the original. The cinematography, sound effects, andTop Gun: Maverick is an extremely entertaining, fun, and engaging movie. This is the best sequel to a movie in decades, vastly improving upon a popular classic, while paying homage to the original. The cinematography, sound effects, and acting are all top-notch. It's so good to see a movie that's made with love and care again, using as much practical effects as possible, not overloaded with CGI. Best movie of 2022 by far and my favorite movie in many years.",
      "review_date": "2022-09-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'll admit that I never cared for the first film, but after all the hype around this one, I decided to see it. It's about as formulaic as a movie can be. And it really wasn't much different than the original.",
      "review_date": "2023-02-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I watched the sequel to the 80s classic film Top Gun in the IMAX theater and was pleasantly surprised. The film starts off with suspense and continues to do so throughout the rest of the film. The story isn't important, it's all about pureI watched the sequel to the 80s classic film Top Gun in the IMAX theater and was pleasantly surprised. The film starts off with suspense and continues to do so throughout the rest of the film. The story isn't important, it's all about pure nostalgia and Tom Cruise's outstanding acting. A declaration of love to the 80s. That's how I wish for future films. Exciting story, top acting performances and a well thought-out, technically well-written screenplay. Bravo!",
      "review_date": "2022-09-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Patriotic, Well acted, Fan service, No Agenda... but most important... GOOD MOVIE!!!",
      "review_date": "2022-07-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe third act is stolen directly from Star Wars. A nearly impossible attack run in a trench in hopes of striking a small exhaust port, causing a chain reaction that will destroy the enemy installation? Check. Automated gun turrets along the way? Check. Better equipped enemy defenders with blacked out face shields? Check. A wise old pilot instructing a younger flyer to use the force (Don’t think. Do). A last minute loss of a targeting system at a critical moment. The hero in the enemy’s sites and doomed before an unexpected rescue strike by an ally? Check, check, check. Tom Cruise is as reliable an actor and entertainer as they come. He does a good job here. Probably should have exercised more control over the script.Seeing it in the theater was a good time, mostly due to the massive visuals and sound and the nostalgia surrounding the franchise. But rewatching it makes you realize how lazy, dumb, uninspired and mediocre it is.",
      "review_date": "2022-09-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wow, they literally copy paste first movie, so BAD! Worst acting, worst directing, worst writing i have ever seen",
      "review_date": "2023-01-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My god was this movie amazing honestly, I am a token away from how amazing it was. I think what really gets me when it comes to this movie, was that its visuals look amazing, it looks stunning. I also feel like the plot itself was great asMy god was this movie amazing honestly, I am a token away from how amazing it was. I think what really gets me when it comes to this movie, was that its visuals look amazing, it looks stunning. I also feel like the plot itself was great as well, I know a lot of people dislike it, but I think it was really great, I'll be it a little simple. But this movie was just another experience that I will never forget.",
      "review_date": "2022-07-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Like Ford vs Ferrari. Very immersive. Showing that people can develop a perfect skills.",
      "review_date": "2022-07-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I loved the original, but this is just an embarrassing retread, mixed in with woke starwars. Terrible acting, plot...Seeing the new recruits & Hearing 'talk to me goose' constantly was about as cringe worthy theatre experience as I've everI loved the original, but this is just an embarrassing retread, mixed in with woke starwars. Terrible acting, plot...Seeing the new recruits & Hearing 'talk to me goose' constantly was about as cringe worthy theatre experience as I've ever experienced.",
      "review_date": "2022-09-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not sure if you need to be some kind of “all american” person to give it 10 or if you must have a US military background yourself. Other that that, as a movie it’s pretty bad and full of real cheap scenes. It’s like watching some extraNot sure if you need to be some kind of “all american” person to give it 10 or if you must have a US military background yourself. Other that that, as a movie it’s pretty bad and full of real cheap scenes. It’s like watching some extra agitated ads booklet and not a movie.",
      "review_date": "2022-10-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A great summertime movie. I'm surprised Tom Cruise can pull it off still after 36 years. The supporting cast did a great job as well.",
      "review_date": "2022-05-28",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 163,
  "genres": [
    "Action",
    "Drama"
  ]
}