{
    "rating": 8.6,
    "release_date": "2007-09-07",
    "num_reviews": 430,
    "genres": [
        "Western",
        "Drama"
    ],
    "summary": "Outlaw Ben Wade (Russell Crowe) terrorizes 1800s Arizona, especially the Southern Railroad, until he is finally captured. Wade must be brought to trial, so Dan Evans (Christian Bale), the owner of a drought-stricken ranch, volunteers to escort him to the train. Along the trail, a grudging respect forms between the men, but danger looms at every turn, and the criminal's men are in pursuit.",
    "reviews": [
        {
            "content": "I loved it, a must see.",
            "review_date": "2023-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great western with brilliant performances by Christian Bale and Russell Crowe. It's up there with Tombstone in my opinion. Also a strong supporting role by Ben Foster.",
            "review_date": "2023-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing work of Bale and Crowe! I enjoyed every minute of this unique duet. Put these diamonds together again in any new movie I'll be watching! even though Russell hasn't been a cake for a long time. 3.10 to yuma - fire",
            "review_date": "2023-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film is a classic Western, with plenty of shootouts and horseback chases. However, it also delves into the psychological aspects of the characters and their motivations. The film is both exciting and thought-provoking, and the two lead actors are both excellent in their roles.\n\n3:10 to Yuma is a well-made film that is sure to appeal to fans of the Western genre. It's a tense, thrilling, and thought-provoking movie that is definitely worth a watch.",
            "review_date": "2023-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outstanding.  Terrific performances across the board, and a depth to the characters and conflicts between them.  One of the best westerns all time.",
            "review_date": "2023-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie and a a good western \nHowever I notice one giant loophole in the plot, as soon as Ben Wade is caught they could of just killed him and drove his corpse to Yuma \nIf his  wanted poster was wanted dead or alive this movie would of been done as soon as Ben wade was caught",
            "review_date": "2023-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite western. Amazing oerformances",
            "review_date": "2022-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wild-wild west drama with decent bullets action...",
            "review_date": "2022-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "2 years ago- Sharp direction that feeds into the the genre, the film exceeds with fiery performances from Bale, Crowe, and Lehrman, though the film's climatic final shootout eclipses the rest of the film.",
            "review_date": "2022-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Personal favorite! Excellent action and great performances by Bale, Crowe, and Ben Foster.",
            "review_date": "2022-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest 2 hours of Western fights and discussions!!!!!!!!!!!!!!",
            "review_date": "2022-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This new western from director James Mangold ('Walk the Line') is entertaining, well-shot, exciting, and has two strong performances at the center of it. But if it does fail, at least it does it with a little panache. Bale and Crowe seem so perfect working opposite each other you wonder why they haven't worked together before. Character actors Ben Foster, Alan Tudyk, and legendary Peter Fonda perfectly fill their supporting roles. But the whole affair has a been there-done that feel to it. It's a derivative western, with wagon chases, horse chases, gun battles, and an epic shoot-out set piece at the train station where that train is coming at 3:10. All well-done, if flashy and unoriginal. Crowe's character seems too carefully crafted--he draws, he's literate-minded, and shows flashes of a caring heart. Crowe can pull it off smoothly, being cold-blooded when called upon and philosophical when needed. But it robs his arc of impact, and ends up being glib and unsatisfying. As modern westerns go, 'No Country for Old Men' and 'The Three Burials of Melquiades Estrada' still hold the crown as classics. This one, for all its fine acting and thrilling action beats, can't match the frontier sweep and deep, psychological morality that IS the western",
            "review_date": "2022-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great acting on the part of Christian Bale, but not my cup of tea. Russell Crowe is a good actor, but it annoys me when he is cast as the antagonist.",
            "review_date": "2022-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice movie about the cowboy era and the crime everywhere and the unjustifiable status",
            "review_date": "2022-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie! not a dull moment. Theyre gonna hang me in the mornin.",
            "review_date": "2022-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma is one of those movies that is highly rewatchable. Both performances from Crowe and Bale are phenomenal. The dynamic and stark contrast between the two main characters is remarkable. Highly recommend it. Love the soundtrack as well. A classic Western.",
            "review_date": "2022-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not the most memorable western I've seen, but I liked it.",
            "review_date": "2022-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "88%. Love films from this time period - western with some Native American conflict. Fun to watch the Bale and Crowe dynamic. Didn't really get why Crowe's character was so willing to go to jail at the end but overall a very good film.",
            "review_date": "2022-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great actors doing great acting, and the scenery is top notch.  The story itself has so much potential, but when you're head is constantly taken out of the movie by pure disbelief and a sustained lack of logic, Yuma ends up failing overall.  This movie is the western equivalent of Star Wars.  The best storm troopers suddenly can't hit the side of a barn when called upon to shoot the good guys.  And all Crowe's character Ben Wade has to do if he's suddenly grown so attached to Bale's Evans is to call his men off, as if he didn't know they'd kill him! And knowing so well that they would, why would he then kill his own men rather than walk away??  You mean to tell me, he grew such an amazing conscience in 10 minutes that his loyal men must die too? Come on....",
            "review_date": "2022-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma exhilarates the viewer with a gripping and thoroughly original story that always leaves one enticingly uncertain about the next turn of events. This is a laudable quality for a genre generally characterized by stereotypes and cliches. Of particular interest is the unique dynamic which permeates the relationship between protagonist Dan Evans and the outlaw Ben Wade, enabling the film to consistently impress the viewer with its willingness to permit its characters the gift of true depth and complexity. There are no simple archetypes here; as a result, we grow to care about the outcomes of the film's central conflicts on a more deeply human level. Among the one or two developments which stretch the viewer's credulity, I must include the Fonda character's unlikely ability to stoically recuperate from a shot in the gut at near point-blank range, essentially shrugging the injury off following an improbably laid back experience of 19th century bullet-removal surgery. Petty qualms aside, 3:10 to Yuma presents the Western in a refreshingly unique light, achieving a level of depth uncharacteristic of the simple morality tales which the genre typically embodies.",
            "review_date": "2022-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has everything you want in a good western movie: A hero, a villain, a great message about morality, and lots of shooting.",
            "review_date": "2022-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining but predictable. The plot felt messy due to the basic mistakes the characters kept making and the weird dynamic later on between Ben Wade and his crew. It was inevitable that everyone would be killed off one by one, including the main character as he stupidly turned his back with no cover as if the shooting was over.  However, the messaging about right and wrong wasn't bad. There were quite a few characters, but the main ones did get sufficient attention. The pacing was acceptable, the acting was strong, there was a good mix of action, the cinematography and visual effects were above average, the sets/props/costumes looked good, and the soundtrack fit.",
            "review_date": "2022-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fantastic remake of an otherwise classic western, \"3:10 To Yuma\" has Mangold once again directing a phenomenal film, with Bale and Crowe each giving fantastic performances to shape this wild western film into an emotional rollercoaster with a bittersweet ending. The action is done spectacularly, the cinematography is superb, and the story is compelling. My main issue is that sometimes the film can feel a bit generic and dull. However, I still really loved this movie in the end and it stands as one of my favourite western films made.",
            "review_date": "2022-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The dichotomy between the two lead characters is palpable throughout. It truly shows the two sides of the same coin with what it means to be a man in the wild west. I've watched this film multiple times since and have enjoyed every viewing.",
            "review_date": "2021-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It took me a while to get into this movie, but by the end it turns into a fairly entertaining western. It's a bit preachy at times, even a bit macho, but not bad at all. If you are looking for an action packed cowboy movie with morals, this one's for you.",
            "review_date": "2021-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A western about a downtrodden rancher who seizes his opportunity to turn in a notoriously dangerous bandit and save his family's livelihood. Bale and Crowe take turns chewing up scenery, but the real stand-out performance is from Ben Foster, who plays the captured bandit's right hand man. It's thrilling, dramatic and paced perfectly.",
            "review_date": "2021-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In a time of reboot saturation and redo's this movie had very exceptional boots to fill albeit Crowe is a good pick for this modern rendition, its difficult to compare the experience with that of Glenn Ford, but mostly due to how westerns were viewed in the late 50's.  Remake's usually apply more emphasis to drama but the violence in this redo is a little much.  Entertainment feels like a word that should stimulate enjoyment rather that glorify the worst of mankind.  My opinion is likely not shared by all but then it wouldn't be an opinion then, would it?",
            "review_date": "2021-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Action PACKED! Casting was fantastic in this film! Ben Foster is scary as hell in this film. He is an amazing actor.",
            "review_date": "2021-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great western film that feels like it could have been made in the 1960s but looks like it was made in the present day.\n9.5/10",
            "review_date": "2021-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Russell Crowe and Christian Bale played intriguing characters and superbly well made this shot em up very enjoyable.",
            "review_date": "2021-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, Russel Crowe at his best, as was Ben Foster and a young Logan Lerman",
            "review_date": "2021-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A dreadful, gore-worshipping dungpile of a movie. For a while I thought some kernel of storytelling would prevail, but the plot becomes increasingly ludicrous, assuming you can decipher it at all between the mumbled dialog and mostly indistinguishable characters. As near as I could tell, this movie exists only to demonstrate as many different ways as possible how to murder people. Shameful, I regret wasting my time watching it.",
            "review_date": "2021-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If Bale's kids weren't in it I could maybe somewhat enjoy this movie",
            "review_date": "2021-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I will have to get around to watching the original movie this is based on but I loved the story, the characters, westerns are one of my favorite genres. Christian Bale was great.",
            "review_date": "2021-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't usually enjoy westerns but this one hooked me. Crowe and Bale are both fantastic and the relationship they forge over the course of the story was gripping, all building to a great final few minutes.",
            "review_date": "2021-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've seen it before. I enjoy Westerns across the range from old school through to modern, as well as remakes, and this is one of those. The colourful characters, the excellent writing, and the brilliant performances really make this something",
            "review_date": "2021-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Trash. When this rubbish scores over 80% it makes you question your entire life, friends, family and pets. If my pets ever had me surrounded and I pulled a single gun on them, they wouldn't disarm. That happened in this film, pretty much.",
            "review_date": "2021-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining and well-acted, with the requisite number of modern special effects, but not up to the gritty, claustrophobic and dramatic realism of the original 1957 version with Glenn Ford and Van Heflin.",
            "review_date": "2021-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A much grittier and somber take on the story, this one won't leave you feeling good, but it'll leave you with plenty to chew on afterwards. Crowe and Bale share a chemistry, that when matched with the thrills served up here make for an electric Western.",
            "review_date": "2021-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think it's about how a system of true justice only works if people uphold it. Unless everyone contributes, individual weaknesses like greed and selfishness corrupts the entire system and leads us into an animal kingdom... or should I say, a wild west.",
            "review_date": "2021-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The good father wants to be respected and admired by his family, regarded as a model of integrity and competence by his children, and seen as a devoted provider by his partner. But what if his body is damaged by war, his property threatened by corrupt men, and his means of providing has strict limits? Then that wish strays further from his grasp. It would take a unique opportunity to turn things around, to allow him to become the leader he yearns to be.\n     Christian Bale as Dan Evans is a marvel of restraint in his portrayal of a decent, but frustrated rancher, trying to keep his property from being taken by the railroad company. In this post-civil war era western, Evans gets his chance to reverse his fortune by escorting a dangerous, captured outlaw, Ben Wade (Cameron Crowe) on the 3:10 train to Yuma to stand trial. His reward money for this feat would be enough to clear him of all debts and, more importantly, allow him to reclaim his spot as the respected head of his family instead of being seen as a lame war veteran, lacking the means to stake his claim to his homestead. \n     I'm not especially drawn to the western genre, but this modern remake by James Mangold is thoroughly entertaining as it balances well-paced plotting, intriguing characterization, and fantastic acting by the two leads. I've never enjoyed Crowe more in a role than this one. He is perfect as the charismatic criminal, drawing out equal parts admiration and disgust from those around him, including Evans' oldest son who, on the threshold of manhood, seeks to succeed where his father has failed and wonders whether Wade may have more valuable life lessons than his own dad. Wade unapologetically follows his own bliss, whether that means deep diving into literature and the bible, or remorselessly snuffing out lives to gain advantage for himself. \n     Once the pistols are holstered and the story concludes, the one thing that lingers is the relationship between the two leads. There is grudging admiration by each for the other's talents. While Crowe's character seduces with his plainspoken views about whether a person deserves respect or deserves to die, there is also a part of him that longs to be the stalwart, committed and disciplined man represented by Evans (Bale). This is a perfectly realized film, that fires on all cylinders: story, action, conflict, theme, acting, and cinematic splendour. Whether you love the western genre or not, this is an absorbing morality tale, cloaked in tense action sequences and top notch acting. I rate it required viewing!",
            "review_date": "2021-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As much as I wanted to like this film, it does little to improve on the original. The women (Gretchen Mol and Vinessa Shaw) and Apache Indians (depicted as savages in the dark) are little more than props used by white men to bond with each other and exert their masculine authority. Meanwhile, Ben Foster's character is punished for his \"irrational\" homosexual love, an all-too-common theme in Hollywood movies, both past and present.",
            "review_date": "2020-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An Aussie and a Brit walk in to Hollywood, overflowing with talent, a really good script and direction – not that they need much –to flesh out the scripts vision. Of course this movie is awesome!",
            "review_date": "2020-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had seen this movie many years ago. I had forgotten the details yet I remember one thing: the effect it had on me at the end. It was unforgettable, the feeling. I chose to watch it again more than 10 yrs later to see what it was that left an indelible mark in my memory.\nRussell Crowe as Ben Wade: complex, brilliant, courageous and absolutely uncompromising in his own inner compass. He cuts through all the pretenses of those around him since he was not blind to his own, or better said, he did NOT allow himself to have any for himself. In his ever encounter, from the bar maid to Will Evans (Dan Evan's son), his incisive and laser awareness of their psychology gives the viewer a hint at the depth of the hidden sensitivity and intelligence of his character. Perhaps the most admirable quality about Ben Wade is his no B.S. authenticity to himself and then to others. He makes no excuses for his way of being and is fully aware of the entirety of how he fits with broad picture of society. Becaue of this, he has no need to make embelishments for who and what he is and neither does he have false humility. He is an outlaw and lives it fully and with no compromise or excuses. \nI find this aspect of Ben Wade as quite refreshing when seen in the context of the average man who is beset with endless guilt and self-doubt in EVERYTHING they do. Ben Wade is like the vulture or the ants in the forest floor. He knows his role in the great circle of life and fulfills it with no fuss or muss. \nThe movie is actually a bromance between Ben Wade and Dan Evans. Their encounter with each other brings out the deepest, perhaps tenderest, aspect of themselves which heretofore had been dormant. The many scenes of their short conversations with each other are filled with nuances of the trust/intimacy they began to experience in each other's company. It is safe to say, specially with the way the movie ended, there has not been anyone in each of their lives with whom they had been willing to expose so much of themselves to the other. It may very well be how it is when we know death is just around the corner -- it heightens every experience and encounter.\nWhen I asked my BF if he had seen this movie and if he did, if he remembers it. He says, \"Yeah, it's about a guy who turns on his whole posse.\" I can see, on the surface how this can be seen as such. As for me, I saw it quite the opposite -- the time in which Ben spent with Dan and his son Will so changed his perspective, his whole being, that by the time Charlie Prince, his right hand man, shoots Dan in front of him, this made it glaringly clear he (Ben) no longer belonged to the same band of brothers and therefore had to end it.\nAn amazingly beautiful and unpredictable story done to perfection by superb actors, directing and editing.",
            "review_date": "2020-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Action Movie Showing Family and Morals Rule The Day!",
            "review_date": "2020-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am not usually a western watcher but this had Bale and Crowe so I gave it a try. So glad I did",
            "review_date": "2020-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The script makes no sense at so many levels. They guy could scape on so many occasions but he decide not to do it and even kill his own gang. Not a smart movie. The cast is awesome bit the script is too absurd.",
            "review_date": "2020-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A rock-solid western buoyed with good acting and music. Slightly ridiculous how Crowe's character was so much smarter than all of his captors, which came off a little unbelievable.",
            "review_date": "2020-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Impossible plot. Absurd action in many scenes. Over the top maniacal psychopathic bad guy (Russel Crowe), who  has superpowers of persuasion, encyclopedic, knowledge of the Bible (after reading it once at 8 y.o.), an uncanny ability to kill people while under heavy guard, while espousing contemporary sensitivities about \nthe maltreatment of native Americans ( no impediment to his killing of 3 exceptionally clumsy noisy Apaches attackers). What a mess. What a waste of good actors. Pretentious idiocy.",
            "review_date": "2020-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good western with a story that matters less about whose good or whose bad, as those lines get blurred, and instead the focus is on who can earn whose respect.",
            "review_date": "2020-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a sharp direction and impressive lead performances, it's a great improvement on the original, although it's not as iconic.",
            "review_date": "2020-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the ultimate story of a rancher, Dan Evans (Christian Bale), who ultimately guides a notorious outlaw, Ben Wade (Russell Crowe), to the righteous path inadvertently. The ultimate story of redemption comes from a helpless Dan the Rancher who simply took on challenges to defend his family from the powerful forces pitted against him in this Western, which ultimately inspires everyone around him, even the one who was being brought to justice through this process.",
            "review_date": "2020-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well made but every change it made from the original found a way to make things worse.",
            "review_date": "2020-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Director James Mangold upped his directorial style when remaking the supposed western classic with stunning filmmaking production that rejuvenated the genre's revived old-fashioned rough energy to sprint as the decade's best western. Without having seen the original, this remake is surprisingly a reassurance that there's no need by its exhilarating spirit captivatingly fueled, and probably defined, by Bale and Crowe's performances that displays opposing views of differed radiative honor before unexpected depths begin unfolding. (A-)",
            "review_date": "2020-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Remakes are hard to make because the movie can be either a big hit or miss. But this 3:10 To Yuma was a big hit with audiences and critics. And I do agree. I love the performances of Christian Bale and Russell Crowe, James Mangold's direction, the action sequences and the story. I also love how this remake improved the 1957 version. Overall, 3:10 To Yuma had make this review on time.",
            "review_date": "2020-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really wish they would make some good westerns like they use to back in the day. This is a remake and is one of the best westerns of the 2000s",
            "review_date": "2020-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite the fact that the ending is lukewarm and unbelievable, this movie has excellent visuals, action sequences, and performances from Christian Bale and Russell Crowe.",
            "review_date": "2020-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have little experience with westerns but I really liked this one. A lot of character development by both of the leads. And an interesting story that kept me invested and eager to see what happened.",
            "review_date": "2020-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrific Western all around, with a thought provoking twist as Crowe’s jaded-outlaw comes to admire Bale’s father-searching-for-redemption. ",
            "review_date": "2020-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sharp direction that feeds into the the genre, the film exceeds with fiery performances from Bale, Crowe, and Lehrman, though the film's climatic final shootout eclipses the rest of the film.",
            "review_date": "2020-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wasn't into it at first, but it got more intriguing as it went on to watch the developing relationship between the main characters. It finishes strong. (First and only viewing - 3/27/2020)",
            "review_date": "2020-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very poor this film has good direction but makes zero sense. Wasn't impressed",
            "review_date": "2020-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am not familiar with the original story of material but the ending just simply doesn't make much sense which leaves me disappointed",
            "review_date": "2020-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very well made story in the far west. But most of that story does not jibe with the reality. Just like I was thinking, the extras had one of the makers compare it to science fiction. So, I was constantly waking out of the film thinking that was not likely at all. But it's well made and watchable like a spiderman.",
            "review_date": "2020-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved some of the one liners. Story wasn’t really comprehensive, a bit discombobulated. Still, pressed on and watched it through. ",
            "review_date": "2019-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 To Yuma (2006) Pros: Fantastic Acting Great Directing Amazing Screenplay Phenomenal Cinematography Magnificent Editing Terrific Set and Costume Design Brilliant Musical Score and Sound Design Good Action Scenes Cons: Weak Pacing Underwhelming Story Overall Grade: B+ (8/10)",
            "review_date": "2019-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the best remakes ever done.",
            "review_date": "2019-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma is a great remake with great performances by Christian bale and Russell Crowe and great cinematography with a great story with good directing from James mangold ",
            "review_date": "2019-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma is a 2007 remake of the 1957 western by the same name. The film was directed by James Mangold, and stars Christian Bale as Dan Evans and Russell Crowe as Ben Wade.\n\nThe story, acting and characters were all done very well, especially the character of Ben Wade.\n\nThe sets, costumes and visuals both practical and special were also very strong, especially with the set designs and practical explosions.\n\nThe atmosphere in the film was really strong, especially at the end of the third act. \n\nThe film was also enjoyable and intriguing, and I hope to watch it again soon.\n\nOver all I give it a\n6/10",
            "review_date": "2019-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best western action movies I've seen so far!",
            "review_date": "2019-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this movie in the theater when it came out. I remember I didn't like it but could not remember why. I just watched it on TV and the whole way through thinking \"This is pretty good, why did I not like it before?\"\nAnd then the ending.... Russell Crowe's motivation at the end makes not sense. I mean, it is explained, but it is soooo out of character it makes no sense. ",
            "review_date": "2019-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This remake of the 1950s Western of the same name is the critical anomaly of paint by number. We do have nice directing by James Mangold to its impressive scenery along with a cast that looks great on paper. But, it also mangles incoherently with other directing styles. Which coincide with a very basic story, stale characters, and an extremely predictable screenplay and conclusion. Looks great in all, but its something you have seen done many times before. An incredibly boring viewing experience is what I got out of this. ",
            "review_date": "2019-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This has everything a Western should have.",
            "review_date": "2019-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Few better a western made - amazingly it gets even better with time, my 2019 viewing exuded even more emotion & pondering than the year it was released. Brilliant casting, Crowe’s best ever performance, Bale was strong but not over the top. A great viewing pleasure!",
            "review_date": "2019-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A killer modern Western!\n\nJames Mangold's Western crime drama 3:10 to Yuma (2007) is a blistering race to a train station to bring a criminal to jail. It pits a desperate farmer against a clever gang leader and his insanely devoted thugs.\n\nMangold's direction has never looked better or felt so grounded. Mangold updated the Western genre with a quicker pace and tense scenes in order to keep the audience engaged. 3:10 to Yuma is as entertaining as Westerns get.\n\nChristian Bale is so relatable and sympathetic as the lead Dan Evans. Russell Crowe is a charming villain and terrifying killer as Ben Wade. Ben Foster is a scene stealing killer without a conscious as Charlie Prince. These 3 leads complete 3:10 to Yuma powerhouse cast of actors in their prime all commanding each scene with their notable presence.\n\nLogan Lerman is really good as the belligerent teenager William Evans and gets some interesting moments. Peter Fonda is a tough Pinkerton Byron McElroy with an axe to grind. Dallas Roberts is perfect as the cowardly Grayson Butterfield.\n\nThe shootouts and violent and thrilling that keep you glued to the screen. But, the best scenes are Bale and Crowe exchanging insults, comebacks, and pasts with their respective ethos in life on full display. It's like they develop a respect for each other on screen before our eyes. 3:10 to Yuma delivers one of cinema's most ponderous friendships with its blistering finale. The last conversation between Bale and Crowe while they hide out in the station is fascinating and moving. Their acting prowess coupled with Macro Beltrami's touching and enchanting Western score culminate in cinematic euphoria. Bale and Crowe give nuanced performances, while they tear up the screen with a slash of bullets.\n\nLastly, I really liked Gretchen Mol as Alice Evans. Her scenes opposite Bale draw out the best and most sincere lines from Bale. When he admits he is embarrassed at how everyone looks down on him to her, I was just silenced by his aura. Mol plays the uncertain and worried wife with a stern realism and a quiet grace.\n\n3:10 to Yuma is as cool as Western films get. It has all the drama and character development of a great character study, while never leaving you bored like many bloated Westerns. 3:10 to Yuma is not a slow burn, but rather a fast flame.",
            "review_date": "2019-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some of the most intense and competently directed western moments on film, 3:10 to Yuma rivals the original and sneaks in two of the best performances from two prominent actor's careers. Stellar performances from everyone in this movie. Particularly Russell Crowe, who is easily the highlight of the movie. The soundtrack is something else to note, particularly how sparse it's used making the choice of music come to the forefront of a scene. All of these attributes makes this one of my favorite depictions of the wild west ever.",
            "review_date": "2019-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm uncertain how realistic it could be (primarily the ending), but it makes for a good movie.",
            "review_date": "2018-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Literally a perfect movie and one of my favorites. Outstanding performances from Crowe, Bale, and Foster. Amazing narrative driven by the complex relationship between Bale and Crowe. One of the few movies that has intense shootouts without sacrificing character development or story progression. Also, has one of the greatest climaxes and endings to a movie ever. I recommend this to any movie lover.",
            "review_date": "2018-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The style of 3:10 to Yuma is amazing, and I’m starting to think I need to catch up on more of James Mangold’s filmography. He knows how to capture stunning visuals and thrilling action. I was riveted by most of this movie simply because he utilized all the tools in his arsenal to keep the intensity cranked up. One of the most vital aspects of this story is that there is always a sense of impending doom because the odds are stacked against our heroes. That’s how it felt throughout the film, and even the calmer moments were presented in a way that allowed us to sense the possible danger. I liked the characters in the film as well, because even though they were filling traditional roles they all had nuance to make them more complex than the stereotypes we’d typically see in a Western. Unfortunately, there are two big problems with 3:10 to Yuma that kept me from loving it, despite all the amazing elements that went into the film. The first issue is related to the plot. I have always struggled with films that start to feel pointlessly repetitive. It’s tedious to watch when the characters keep making the same stupid choices and seeing the same consequences played out in a slightly different fashion each time. The number of times that Ben Wade is left without a gun pointed at him so that he can attack one of his captors or escape them is ludicrous. At a certain point I was yelling at the screen trying to figure out how they could let it happen again. It was like an endless cycle of ineptitude, and the fact that it kept repeating got boring at a certain point. There’s one other thing that just doesn’t work in 3:10 to Yuma, and this is something I’ve been proclaiming for years...Russell Crowe cannot act. His role in this film requires a lot of subtlety because he is a complex character who puts on a rough exterior while having more complicated thoughts inside. A strong actor would be able to pull this off so that we’d see the inner conflict in his performance. But with Crowe we have a guy who appears to act erratically because we have no sense that he’s making choices based on anything he’s feeling (he appears to feel nothing.) It’s a shame because the rest of the cast is crushing it, and the story has potential for brilliance, but there are a few choices that hold it back from achieving greatness.",
            "review_date": "2018-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma is a very good western film. It is high on themes and high on chase sequences and shootouts. The story concerns a small-time rancher who agrees to escort a captured outlaw to court in Yuma. Both the principal actors Christian Bale and Russell Crowe play off each other really well and in the end they have mutual respect for one another. Ben Foster, Peter Fonda and Gretchen Mol are good support. James Mangold has a unique style- all his films the character development trumps action and 3:10 to Yuma has just that. Of course the action- especially the last 30 minutes is amazing.   (Bale and Crowe are awesome in this movie).",
            "review_date": "2018-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma is a very good western film. It is high on themes and high on chase sequences and shootouts. The story concerns a small-time rancher who agrees to escort a captured outlaw to court in Yuma. Both the principal actors Christian Bale and Russell Crowe play off each other really well and in the end they have mutual respect for one another. Ben Foster, Peter Fonda and Gretchen Mol are good support. James Mangold has a unique style- all his films the character development trumps action and 3:10 to Yuma has just that. Of course the action- especially the last 30 minutes is amazing.  (Amazing western by the underrated James Mangold).",
            "review_date": "2018-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed this one. Solid action and character development. Great ending.",
            "review_date": "2018-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mangold harnesses the skills of Bale and Crowe to remake a classic Western into a stylistic modernist one--whether or not he pulls it off is up to the audience.",
            "review_date": "2018-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma is a very good western film. It is high on themes and high on chase sequences and shootouts. The story concerns a small-time rancher who agrees to escort a captured outlaw to court in Yuma. Both the principal actors Christian Bale and Russell Crowe play off each other really well and in the end they have mutual respect for one another. Ben Foster, Peter Fonda and Gretchen Mol are good support. James Mangold has a unique style- all his films the character development trumps action and 3:10 to Yuma has just that. Of course the action- especially the last 30 minutes is amazing.",
            "review_date": "2018-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma is a very good western film. It is high on themes and high on chase sequences and shootouts. The story concerns a small-time rancher who agrees to escort a captured outlaw to court in Yuma. Both the principal actors Christian Bale and Russell Crowe play off each other really well and in the end they have mutual respect for one another. Ben Foster, Peter Fonda and Gretchen Mol are good support. James Mangold has a unique style- all his films the character development trumps action and 3:10 to Yuma has just that. Of course the action- especially the last 30 minutes is amazing.",
            "review_date": "2018-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very exciting western by James Mangold. Crowe and Bale give outstanding performances in the lead role.",
            "review_date": "2018-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma is a very good western film. It is high on themes and high on chase sequences and shootouts. The story concerns a small-time rancher who agrees to escort a captured outlaw to court in Yuma. Both the principal actors Christian Bale and Russell Crowe play off each other really well and in the end they have mutual respect for one another. Ben Foster, Peter Fonda and Gretchen Mol are good support. James Mangold has a unique style- all his films the character development trumps action and 3:10 to Yuma has just that. Of course the action- especially the last 30 minutes is amazing.",
            "review_date": "2018-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie! It has a great story line that is different from the typical western. Crow & Bale don't disappoint in this movie. This is one of my favorites!",
            "review_date": "2018-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A possibly great movie ruined by the nonsensical ending.\n\nOK, so as we watch a movie, we get to know the characters, their motivations, how they'd behave in certain situations, etc.\n\nBen Wade does something that is completely out of character at the end of the movie concerning his gang. *Maybe* I can believe about Charlie Prince, but *not* the rest of his gang. On second thought, not Charlie Prince either. Not believable at all. Ruined the movie for me.\n\nI loved how his pistol was named, \"the Hand of God\". There is some really pretty cool stuff here. Ben Foster's Charlie Prince character was awesome along with Russell Crowe as Ben Wade. I'm not even a big Russell Crowe fan, but this was a great role for him. That's why the ending was so disappointing for me. A typical \"feel good\" Hollywood ending, whereas this movie deserved better.",
            "review_date": "2018-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma is a very good western film. It is high on themes and high on chase sequences and shootouts. The story concerns a small-time rancher who agrees to escort a captured outlaw to court in Yuma. Both the principal actors Christian Bale and Russell Crowe play off each other really well and in the end they have mutual respect for one another. Ben Foster, Peter Fonda and Gretchen Mol are good support. James Mangold has a unique style- all his films the character development trumps action and 3:10 to Yuma has just that. Of course the action- especially the last 30 minutes is amazing.  \n(Bale and Crowe in top form, unmissable film).",
            "review_date": "2018-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow! I thought it was going to be good based on reading other reviews, but it was really good. Best Russell Crowe performance I can remember since Gladiator. Christian Bale was excellent. Dialogue between Crowe and Bale was well written. Loved the feel and look of the western towns. Landscapes were gorgeously filmed and the gun fights were awesome.  I was on the edge of my seat for the final third of the movie. One of the best western movies I've seen.",
            "review_date": "2018-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing western and one of the rare remakes that's apparently better than the original, although I never saw it. It's supported by two superb gastly and heroic performances from Russel Crowe and Christian Bale. The film shows us how far a man would go to save his family from starvation, as well as the relationship between two very different characters. And on top of that, we get of bunch of classic western shoot-outs. It's a great story and it'll obviously go down as of the best of the genre. Recommended !!",
            "review_date": "2018-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "western night at the hobbit den... with this strong new mexico made film  if ya feel like a western with modern sensibilities...and a strong cast....well.... ya know .",
            "review_date": "2018-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strangely unrealistic. The bad guy never tries to escape. A one-legged man runs around like a decathlete. Excellent acting destroyed by idiotic plot. ",
            "review_date": "2018-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an honest and captivating western.\n\nThis one was a treat through and through with Bale's and Crowe's performances. The colourful supporting cast only added to the great experience this was. Not necessarily through talent like the two stars, but with flavor and solid acting.\n\nThe story is straight to the point with great pacing and a rising crescendo, and while doing that it still manages to illustrate fascinating characters and complex interactions that keep you guessing till the very last gunshot. Honestly, it's been a long time since a movie kept me guessing this much about what the characters will end up doing in the end. This especially surprised me considering this is a western where characters are usually flat as a board.\n\nThe themes of the movie were well trodden, but the movie brought them up in very elegant and honestly beautiful ways. I just felt it was much more poignant than what you'd usually expect out of a western.\n\nThe production of this movie was also great. Everything looked the way I expected it to. Nothing felt cheap. Technically the movie was also incredibly solid and cohesive. Not outstanding, but still good enough to seal the deal.\n\nThe fact that I started off telling myself \"I bet this is going to be the most predictable plot...\" and quickly changed my tune to coming up with wild theories about what's going to happen is what really sold me on the experience of this movie.",
            "review_date": "2018-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hate westerns, but this film won me over from the first scene and got progressively more compelling and entertaining with each new turn. Bale and Crowe's ability to act and sound like the historical and mythical American Westerners of my imagination was entirely convincing. I loved this movie..!",
            "review_date": "2018-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 To Yuma is a fiery remake of an insignificant original western, delivering all the gunfire action in a classic shootout alongside two great performances from Christian Bale and Russell Crowe.",
            "review_date": "2018-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best westerns I can remember ",
            "review_date": "2018-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The more I watch this movie, the better it gets. For those confused by the ending, here are my thoughts: Crowe both admires Bale's bravery and in another sense, will essentially rob the railway company one more time by watching Bale's character win a massive reward without the rail company getting the prize they paid for (since Crowe can escape, anyway). Brilliant film. ",
            "review_date": "2018-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best western movie I've seen this decade, right up there with \"In a Valley of Violence\".",
            "review_date": "2018-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've never seen the first film, but before watching this version I decided to read Elmore Leonard's short story by which this movie is based on. In the short story, Russell Crowe's character is taken to Contention in the opening lines. We find out he is awaiting the 3:10 to Yuma to take him to prison. \nIn the movie, Russell Crowe couldn't have done a better job as Jim Kidd in the story and Ben Wade in the film. Also, Christian Bale is outstanding as Paul Scallen in the book and Dan Evans in the movie. \nOverall, this movie was outstanding and certainly has become one of my all-time favorite Westerns. It is filled with plenty of action and fully developed characters that blend together to form a suspenseful plot.",
            "review_date": "2018-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film by Mangold, good performances, an enjoyable return to the west.",
            "review_date": "2017-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is definitely my favourite western. Russel Crowe is on top form as always, Christian Bale gives a great performance also. The storyline is brilliant it keeps you watching from start to finish. I love Ben Foster I\u0092m pretty much everything I\u0092ve seen him in but I\u0092d say this is his best role, he\u0092s incredibly menacing!",
            "review_date": "2017-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A worthy western about the power of a promise ",
            "review_date": "2017-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest movies of all time in the history of cinema.... ",
            "review_date": "2017-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hate cowboy movies but this was a great story.",
            "review_date": "2017-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 To Yuma: A western masterpeice. 3:10 To Yuma is fast paced, well acted, vehemently directed and thoroughly entertaining.",
            "review_date": "2017-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Instantly one of my favorite movies let alone favorite western. The cohesiveness between Bale and Crowe makes for a truly immersive experience to the viewer. They could not have castes the film any better, all the feels from Bale's character, trying to show his son what's right and provide for his family. Crowe's character who is \"bad\" but has some good in him, then the character Charlie, the true outlaw.",
            "review_date": "2017-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best of the more recent westerns. Enjoyed it more than the original",
            "review_date": "2017-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Plot is ridiculous and makes no sense, literally and figuratively",
            "review_date": "2017-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "more westerns need to be made like this one",
            "review_date": "2017-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this movie with my flatmates and we were bitterly disappointed. We enjoyed the beginning and the beautiful scenery the movie shows again and again. The Set has been carefully selected and felt real. We all felt the music supported the movie very well (one of us writes music for movies for a living). Also we liked the Acting and the developing Relationship between Crowe, Bale&Son. All in all very good BUT The Story line is completely implausable. \n\nThe twists and turns the movie takes are far-fetched and you cannot relate to the decisions the main characters makes. There are so many (too many) situations where we could not enjoy the movie just because its so implausable people would behave that way... \n\nExample:\n\n1.) \nAs a traindriver would you make a halt at a station when you hear there is a gunfight in the city? \nIf Yes: Would you still halt there if all the rifles are pointed directly at your station?\nIf Yes: Would you still stand there if they are shooting at your train?\nIf Yes: You should not be a traindriver....\n\n2.)\nAs a laborer who has to load boxes onto a train. If your trainstation is surrounded and everyone is pointing their rifles at your direction and obviously there will be a major shootout any second from now. Would you:\n\na) fear for your life, hide and hope you don't get shot\nb) think its more important to put these boxes onto the train right now! \n\n3.)\nAs a guard of one of the most feared criminals in the US. Hunted by his Gang and deep in territory of the Apache tribe known for killing all intruders. At night would you:\n\na) stay as invisible as possible\nb) light up a major campfire to warm yourself up a bit.\n\nIt's the little things I wrote here - and there are a lot more of them. They make the movie unrelatable - especially because the Story line is super strange as well. The ending is weird, out of this world, complete fantasy and a culmination of all the bad things in this movie.",
            "review_date": "2017-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "in short , lots of guns and emotions",
            "review_date": "2017-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma is quietly one of the best western re-makes around. I would say it is the best western I've seen. Crowe and Bale both dig into their roles and make this movie fun to watch.",
            "review_date": "2017-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was such a brilliant film. I enjoyed it through and through. Christian Bale and Russell Crowe were inspiring. I have always found Logan Lerman to be such a talented young actor and he has proved himself once again in this film. All in all, it well worth seeing.",
            "review_date": "2017-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An engaging western that has two great performances from both Christian Bale and Russell Crowe, even though it sticks too closely to the mold of previous westerns.",
            "review_date": "2017-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THE way a westerns should look, feel, and sound.",
            "review_date": "2017-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It honestly is one of the more boring westerns I've seen lately. The ending also didn't make much sense. I prefer the original ending.",
            "review_date": "2017-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The main characters could not be more moronic in their decision making.",
            "review_date": "2017-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Engaging lead performances and a smart pervasive intensity, James Mangold's update of the original Western features enough originality and skill to make it more than recommendable.",
            "review_date": "2017-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a beautifully directed movie, the cast was fantastic, it kept my attention for the full duration.",
            "review_date": "2016-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The decent cast keeps you watching and thinking there might be something to this film.  But, in the end it's just a confused mess with the characters throughout acting in ways that just don't make any sense.",
            "review_date": "2016-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "James Mangold's best work to date, 3:10 to Yuma is a modern Western remake that brings out the best from the genre along with an excelente cast - led by powerful performances from Christian Bale and Russell Crowe.",
            "review_date": "2016-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A swashbuckling quintessential western that's both exhilarating and emotional; all held up by excellent characters and performances.",
            "review_date": "2016-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ben foster boosts this",
            "review_date": "2016-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely gorgeous and brutal western.",
            "review_date": "2016-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4.5/5.  A really excellent western with outstanding performances all around.  The train itself isn't in the film much, and I was really hoping for an action scene involving the train, but apart from that, 3:10 to Yuma delivers more than one would expect.",
            "review_date": "2016-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is extremely rare that any remake in American cinema is as good as the original but this can be said for this updated version of the classic western from 1957 which starred Glenn Ford and Van Heflin.\n\nHere, Christian Bale gives a very good performance in his role as Dan Evans, a hard-up rancher trying to earn money and his family's respect by escorting an outlaw (Russell Crowe) on his way to jail. Crowe is also good in his role as Ben Wade, the man who terrorizes 1800s Arizona until he is captured.\n\nThe direction from James Mangold (his first film since the absolutely superb Walk the Line) is very good because he keeps a tense atmosphere going from start to finish and also allows good action sequences, some of these are well-filmed and there is excellent cinematography to be provided thanks to the glorious sunny weather. The script is well written by Michael Brandt, Derek Haas and Halsted Welles because it makes the story easy to follow.\n\nSome of the violence can be a little uncomfortable to view in places but this is part of the story so therefore it has to be included. Westerns are now quite rare on the screen so it does create anticipation when they appear, unlike the Golden Age of Hollywood.\n\nThis western remake is one that is enjoyable as the original because it works very well due to the gripping action sequences and the terrific performances from Bale and Crowe. Mangold can be very proud of himself.",
            "review_date": "2016-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good movie to watch!!",
            "review_date": "2016-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good Western led by great Russell Crowe and Christian Bale performances",
            "review_date": "2016-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Might take a more action-oriented route than most westerns before, but it still is able to achieve most of the high points from the original and is able to echo the more gritty, violent aspects of the modern western soundly.",
            "review_date": "2016-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film with fantastic acting and sharp directing. Better than the original, that's for sure.",
            "review_date": "2016-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good in many ways, but the psychological groundwork behind Wade's final sequence of choices - needed far more work imo.  And it's a key feature.",
            "review_date": "2016-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "some serious acting and character study without a plot or dialogue which can hold your attention for the entire run-time.",
            "review_date": "2016-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fine remake. I'm a sucker for a good Western, and yes, I actually thought this was better than the original.",
            "review_date": "2016-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie! Two hotties, Russell Crowe & Christian Bale cowboying it out, love. Russell Crowe played an amazing asshole, fantastic gun fights, love, love, love",
            "review_date": "2016-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best westerns I've seen in awhile!",
            "review_date": "2016-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good remake. Bale and Crowe shine",
            "review_date": "2016-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's not a lot of originality, bit there's plenty of good old western atmosphere and action.",
            "review_date": "2016-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrific remake of one of the greatest western movies.",
            "review_date": "2016-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma isn't perfect, but in a world where the western is all but dead, it's pretty enjoyable. Perhaps the most refreshing thing about the movie is its focus on characters over action scenes. There's plenty of the latter of course, especially in the third act, but it's primarily a character driven story revolving around troubled rancher Dan Evans and fierce outlaw Ben Wade. The relationship is really fascinating, but takes a hit during an abrupt change of character in the third act that is completely unnecessary. It's not enough to truly ruin the film, but it definitely makes an impression.\n\nEvans and Wade are played by Christian Bale and Russell Crowe, respectively, and they're expectedly great coming from such talent: in particular, their banter back and forth really drives the film. Logan Lerman does solid work in a supporting role, and Ben Foster nearly steals the show with a delightfully crazy performance. Director James Mangold really seems to understand the western, as he nails the atmosphere in this one. The sets and costumes fit, and Marco Beltrami's score is subdued yet stunning.\n\nWith a few touch ups in the final act and maybe some reworked pacing, 3:10 to Yuma might be a superb western, but as it stands, it's not a bad time. At the very least, it's one of the few remakes that isn't completely horrible, which is always admirable.",
            "review_date": "2016-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent western- awesome performances and a great ending",
            "review_date": "2016-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not being a fan of western movies this movie has burrowed a special space in my heart! This is one of my ALL-TIME FAVORITE movies. This movie is great, even for those who are not huge fans of western films.",
            "review_date": "2016-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much better than the original, because the actors are so much. The ending was changed, too, which I liked. Usually re-makes are abysmal, but this one was a refreshing change from the rule..",
            "review_date": "2016-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was ok for a bit, interesting to see the period, costumes, the chinese railroad builders, etc. But near the end the plot just got silly. The Ben Wade guy just murders his whole posse after they spent a week risking their lives to save him? For what? To give some rancher guy his pride back? Didn't understand how this movie ended at all.",
            "review_date": "2016-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good ol western classic",
            "review_date": "2016-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have not seen the original, so there is no question of comparison. But this movie has taken me by pleasant surprise for it's powerful performances and breakneck speed for a western. Crowe looks very charismatic as required, would have been a masterpiece in my list had there been more mind games between the main protagonists.",
            "review_date": "2016-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this right after watching the original, and the remake seems pretty pointless.  If they had kept less of the original story in there, it might make a decent action movie.",
            "review_date": "2016-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dense and thrilling story, great characters, decent acting. my favourite neo western.",
            "review_date": "2016-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After a slow start, the plot and story picks up which leads to a very intense and satisfying climax",
            "review_date": "2016-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film represents most of the elements that make westerns great. The action, the scope, the grizzly performances, and even a thought provoking conclusion.",
            "review_date": "2016-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma is an awesome entry to the Western genre. Featuring thrilling scenes, great performances and an overall well made premise, 3:10 to Yuma is great entertainment!",
            "review_date": "2016-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Director James Mangold delivers a sturdy, vivid western in \"3:10 To Yuma\", a superior film remake with magnetic performances from Christian Bale and Russell Crowe.",
            "review_date": "2016-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When what is above takes what is below when it's the law who go after the unlawful. When what is below takes from what is above the law when they are unlawful. When what is above are those who can take what is below and above when they live unlawfully to how they see it. \n\n\n******************************************\nLiving according to the law, living according to be unlawful. Those caught in the middle living by and by, have another living they have abide, follow, that's dignity. Out in the west, it's kill or be killed, unless you have a little dignity as a unlawful legend. Dignity is only for those whom make us who we are. Other dignity we see immediately in others whom we idealize, whether a respectable family man. Regardless, you the fastest gun slinger out here, you make the rules once old rules are broken. Out here your known by your family, your known by whose shoes you have walked in, whose shoes you are going to walk in, and whose shoes you knocked right off their foot. Your legacy remains, cause you survived, stayed out of trouble, danger, kept your nose clean. Some legacy remains when your good at what you do, and your more dirtier then what your family proceeds you.  Some legacy dies when you get mixed up in it. \nWe follow this group, when it leads us to riches, has the greatest mind to plan a job, can follow what's right and mix it with what's wrong, and justify that the cause is justified. Not all unlawful man have the blood thirst, just good man, doing right, that follow the wrong path when cruel life's fate takes a wrongful turn. \nThere is more to the unlawful man then meets the eye. You never know what will turn up with every path we cross. \n \"Come to wake some snakes\"\nLiving life according to dignity, getting paid for honest days work. Accepting payment from a dishonest man for being honest to you, is only fair between you too, but not when you have moral code to follow for the town and law (Wrong Legends & Rightful heroes). Your town is filled with law man, that you can't cheat. \nWe all live according to some moral code, a man whom defends his family's honour, providing for their family, and some being loyal and following the right path. Sometimes those whom are good, and don't follow their word or yours and are disloyal and not listening, you cant help but being honest to others and dishonest to those who are dishonest (God & Man).\nWhatever we follow in this God forsaken town, whether it's laws, codes, money, morality, it's always comes down to life or death. What we consider justice, we take in our own hands, trial, or something unforseeable.\n\nSome paths we take for money more harder to earn then others. whether these paths are moral or immoral, it gets even crueller in every town you go. When we live according to some dignity in towns where ungodly ways are bred, where undignified men live we live according to a life we know, born into, can't help ourselves bu t fall victim to temptation. When being in the wrong place and time can either be life or death, it can be rewarding and unrewarding. We don't know what dangers loom, some more familiar with the dangers, as they live among them their whole life, living according to a dignified life is harder to comeby.  \nWhen dignity is no longer an option, and we do everything for money when we are desperate, pays for our life town to town, pays for lifestyle, pays for loyalty, pays for our way out of prison, we live according to a life that made us the legend we are, and the victims it has claimed. When dignity is insignificant, when we have revenge on our mind to care. When we can talk our way through anything, charms, wit, knowledge and it's insignificant, when we have rewards to think about. When we go from town to town, we have law and order to abide to, that makes it peaceful for a reason, that no money, no life, no reason matters when we must uphold what our duty is. We don't always know what we get into, or what dangers lurk from town to town, when different paths come through those doors all the time, and time is money, when we got business on our mind. When living according to dignity doesn't matter when we got an army or out numbered, out gunned and all that matters is living.\nWhen no duty is worth our life, and we are playing the Devils hand and gambling with our life. There is nothing we live according to when your faced with death, and all you have to do is be just like the thing your not. When living according to the gun, there is no dignity in the lives we have taken, for the actions we have done, when we live according to something deeper, the love for your family, being known for something that puts his family on the right path to something greater then a child of a someone whom has to settle for less, that one last sense of dignity that puts those shame to rest from town to town, and you can live either for your family, or live in your children. \n\nWhen we have to live according to something we follow, but not by its teachings, but as a reminder when life changed and went all wrong. When we had to decide which path to take on our own. \n\nWhen we can't change what we have done, and correct what we did wrong,  but we have a chance to do what's right, because we see eye to eye on one thing that is good in our life whether it's a good man having to die for his family when the government, people and a unlawful man is responsible for when everything went wrong in his life to take his life. \nWhen the last bit of dignity we have to follow is putting everything back as right, living the life we are intended to live, paying for the life we lived from the lives we have taken, and earning the life we worked hard for because someone handed his life unto us. The one right path we cross in our entire life we restore ones dignity. \n\nOr is giving back worth it, when your undignified your whole life to put a stop to it. When in the it is what we do our entire life that catches up with us. If we live according to life from town to town, we live on, our legend lives on, we never pay, and we live the life we intended because we did it on our own thanks to some helpful chumps along the way. Who is watching us, when there is no god, no man, no law, rule, code, money, family, life that holds us down or stops us when we are just that damn good.",
            "review_date": "2016-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "*Wow* I've struggled to get into Westerns before, but \"3:10 to Yuma\" is engaging like no other Western I've seen thanks to standout performances by Bale and Crowe, intense action and a marvelous script. The characters make the film, as Crowe's Lucifer-like outlaw tests the morality and resolve of Bale. Armed with an outstanding cast of characters, director Mangold embraces Western conventions while twisting expectations at almost every turn, culminating in a truly compelling climax. A must-watch.",
            "review_date": "2016-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm probably being to harsh on this movie because I was kinda sleepy when I watched it, besides me not really liking Russell Crowe for no particular reason, and not being that much of western movies enthusiast either. I guess there's plenty of cool shoot outs that are a must in westerns, but it hardly stands out to me from anything else I've seen.",
            "review_date": "2016-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fam dis movie is perfect for lil kiddos",
            "review_date": "2016-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great movie. one of the rare westerns i like. great acting. lots of intense scenes. (3 viewings)\n\n\nSPOILERS\n\n\ni thought the movie concluded perfectly and other more obvious endings would have been unsatisfying or lame",
            "review_date": "2016-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intense film, although flawed, powered by the great performances from Crowe and Bale.",
            "review_date": "2016-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Russel Crowe and Christian Bale are great in this one, as well as the supporting cast including Logan Lellerman and even Luke Wilson has a role. 3:10 to Yuma is a great western lead by outstanding acting and a excellent script, making it the rare remake  that works.",
            "review_date": "2016-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great acting, lots of tension and plenty of action but unfortunately dragged down by nonsensical character motivations",
            "review_date": "2016-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great cast and overall good movie.",
            "review_date": "2015-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The performances are fierce and passionate. The environment is harsh and stunning. The score is dramatic and fitting. The plot is entertaining and anything but predictable. One of the greatest westerns of all time.",
            "review_date": "2015-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great remake that captures the essence of an older western ever now.",
            "review_date": "2015-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A thoroughly entertaining movie that includes plenty of exciting action pieces without sacrificing character development or interesting dialogue. While it has its share of questionable narrative moments, none of them are severe enough to harm its overall quality. The 2 leads, particularly Crowe, are what really drive the movie. They play off each other brilliantly, and each time they're together we learn a little more about each of them, and witness how their vastly discrepant lives don't mean they can't see something in the other that they can respect. On the surface it may be a rather typical Western, but behind the ten gallon hats and six shooters is a tale of family, morality and honour.",
            "review_date": "2015-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A modern remake of a 1950's western favorite. This film is loaded with a great cast that is carried by Russell Crowe, Christian Bale and Ben Foster. I have always felt that Russell Crowe is best in a villainous role and this supports that statement. Christian Bale once again proves he's one of the best this era. I really really really enjoyed Ben Foster in this. He was a perfect balance in a right hand man to Crowe's dark Ben Wade character. The set design and costumes were perfect, and the cinematography was great.",
            "review_date": "2015-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A self and family values based western produced in the XXI century.\nOne of the most graceful westerns that I ever saw and the best from the last decade!",
            "review_date": "2015-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "****\nWith good performances from both Russel Crowe and Christian Bale, 3:10 to Yuma succeeds in being a fun, classic-esque western.",
            "review_date": "2015-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Performance is great. The whole cast is incredible. Characters are interesting and well-written. The tension is great. The execution is great. Story is kinda simple yet still interesting.\n3:10 to Yuma is a great anti-hero western film with a satisfying ending. This is one of those films that you ended up loving it. In the end, I would say 3:10 to Yuma is a great film and it is a great remake.",
            "review_date": "2015-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma is the greatest western I've ever seen, with strong performances by Russell Crowe and Christian Bale any movie can be great, especially this one.",
            "review_date": "2015-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best western of the century so far. Crowe and Bale are fantastic as the leads, but its the electrifying turn from Ben Foster that really makes this movie shine.",
            "review_date": "2015-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This action-packed western delivers in what you'd hope for, but earns its rating for strong performances and direction. Crowe and Bale are marvelous (though I'd be interested in seeing how this film would've been with their roles reversed). (86%)",
            "review_date": "2015-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to yuma is very much a western movie.  The basic premise is that a farmer has to help some lawmen get a notorious bandit to a train to Yuma where there is a prison.  Along the way some complications arise.  There is definitely a lot to like in this film.  The acting is well done and the action is good when it happens.  However, there are some slower parts that can drag on in my opinion.  If you are a fan of westerns give this one a watch.  If you don't care for westerns this will not change your mind.",
            "review_date": "2015-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thanks to a terrific lead of Bale and Crowe, James Mangold crafts an engaging western story with 3:10 to Yuma, proving to the audience that the genre's still alive and well!",
            "review_date": "2015-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Holds it's own right up with Young Guns, The Unforgiven, and Tombstone despite this one being a remake. It almost felt Spaghetti in nature which I'm stating as a compliment. Nice storyline, somewhat emotional, and a happening body count!",
            "review_date": "2015-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really cool movie with an old spirit. As someone who loves the western genre I'm glad not many get made anymore because when one does come along it gets a lot of respect and it's always an admirable experience. New westerns sometimes suffer from style over substance, but this one balances the two just right. Crowe and Bale have great chemistry together. I hope they do more movies. Good character actors.",
            "review_date": "2015-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing great films wow,this is good movie not part 2?the end is open ð~ð~",
            "review_date": "2015-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "...post civil war America... though place.",
            "review_date": "2015-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just for a little bit of love and respect, we do so much... sometimes stupidity",
            "review_date": "2015-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great remake of western classic.  Very good performances by both Bale and Crowe along with great direction by Mangold.",
            "review_date": "2015-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Russell Crowe and Christian Bale are absolutely fantastic in this thanks to James Mangold's superb direction",
            "review_date": "2015-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know much about western, in particular any western that are relatively new. But from watching this movie I can guess that it is one of the better ones, and it was a really enjoyable movie.  It has some great actors, all who when put in cowboy suits, hats, and wield handguns are very badass and satisfying to watch.  It's a basic plot, and I belive a remake of the 1950s original which I haven't seen.  It has a good pace, not all shootouts but with good characters, and the war of the film slowly diminishes as the film goes on.  I love the main character, and his gang and hoped throughout the movie that he wouldn't pull something to save the guys who are trying to take him to the prison train.  To me the worst thing that could have happened was if the farmers kid became the hero and killed one of the bad guys that i like so much.  The ending wasn't what I was expecting luckly, and I wasn't disappointed.  The action was good, fast paced shootouts, and the most obvious thing is the incredibly over exaggerated accuracy of all the weapons and their users.  It dosen't really effect the movie itself too much luckly, but it could have created problems.  Anyway really good western, my fav at the moment, and has me inspired to look more into the genre.",
            "review_date": "2015-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing movie. strong cast.",
            "review_date": "2015-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Liked it more than the original.",
            "review_date": "2015-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love Westerns.\nThis one pits \"Gladiator\" Russell Crowe against \"Batman\" Christian Bale;  with \"Percy Jackson\" Logan Lerman, Peter Fonda and Firefly/Serenity's Alan Tudyk. Nice cameo by Luke Wilson. This is a great cast in a beautifully shot film. The story is great: Father's and sons.",
            "review_date": "2015-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Russell Crowe and Christian Bale add to a classic western, and provide a vision that is truly superior to the source material.",
            "review_date": "2014-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"3:10 to Yuma\" tells a great story through talented writing and precise editing, and helms great performances from both Russell Crowe and Christian Bale, although strewn with many Hollywood clichés.",
            "review_date": "2014-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Western remake second to True Grit",
            "review_date": "2014-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With great acting, intense shootouts, and a fantastic script 3:10 to Yuma rises to be one of the best modern westerns",
            "review_date": "2014-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you don't like this film, then you do not know what it's about.",
            "review_date": "2014-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A genre-defining epic thanks to one of the best duos in film history, crisp directing, and incredible action.",
            "review_date": "2014-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it isn't deeply artistic or emotional like other modern westerns, it still deserves a nod as being both action packed and exciting while still keeping an intelligent edge.",
            "review_date": "2014-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bolstered by powerful performances from Bale and Crowe, 3:10 to Yuma delivers a fantastic remake helmed brilliantly by director James Mangold.",
            "review_date": "2014-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What sticks out to me in this western film is the acting, because there is a ton of suberb actors with great talent in this film. Russell Crowe is amazing as outlaw Ben Wade. He is nasty and a stone-cold killer and yet so charismatic. He plays alongside the protagonist, Christain Bale. Now although Bale's Dan Evans doesn't really have any interesting character traits that make him different than many other heroes in Western movies, but Christain Bale always brings a great level or dedication and heart to his roles that he makes it work. The rest of the cast including Ben Foster, Peter Fonda, Alan Tudyk, Logan Lerman and Dallas Roberts all do an excellent job too. Now with lots of movies I've seen, either you get great acting, or great action. It's hard to find a film with both. This film has both. Bullets fly, and when they hit, you feel it. I also love how the wild west is shot in this film. In reality, I just love the aesthetic of Western films. If you are new to the Western Genre, this is a great one to start with  because this film is fantastic!",
            "review_date": "2014-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Russell Crowe and Christian Bale are absolutely fantastic in this thanks to James Mangold's superb direction",
            "review_date": "2014-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic.A study in the psychology of friendships and the human conscience. One of the best western movies I've watched.",
            "review_date": "2014-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its hard to find a good old west movie.  Good movie, good story line and script; ending is far fetched....",
            "review_date": "2014-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma Is One Of The Best Western Movies I Ever Seen.This Was One Of The Best Western Movie I Seen Since Unforgiven.Russell Crowe And Christian Bale Deliver A Great Performance.They Should Have Been Nominated For A Oscar,Well Again.It Had A Lot Of Western Action,Lot Of Shooting,And A Lot Of Crazy Outlaws.3:10 to Yuma Is A Western Movie You Won't Forget.A",
            "review_date": "2014-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 To Yuma is probably the second best Western movie I've viewed thus far.  I'm not big into Westerns though there are some I enjoy fine.  Compared to other major Western I've seen I'd say I like this more than Tombstone, but I still think the remake of True Grit is the best.  Aside from two minor aspects and the fact that Westerns aren't my genre this film really has no issues.  The film looks great, has some thrilling action, has a great cast, and has some enjoyable characters.\nThe story is as follows.  You have a man named Dan Evans (Christian Bale) who is heavy in debt and has to leave his farm with his family if he doesn't pay them off.  Meanwhile you have a desperado named Ben Wade (Russell Crowe) and his men who rob a stage coach owned by McElroy (Peter Fonda) and nearly kill him.  Wade is arrested but they need to get him on the train to Yuma.  However, his men are still on the loose including his most loyal follower, Prince (Ben Foster), and will try to stop them.  The sheriff of the town, the doctor, Evans, McElroy, and even Evan's son, William (Logan Lerman), ban together to take Wade to justice while fending off his gang and other threats they encounter along the way.\nAs I said the film looks good and has some enjoyable action, but what stole the film was the cast and characters.  Russell Crowe and Christian Bale were excellent in the film and they played off each other great.  This would not be half the movie without them considering that most of this film is the relationship between Evans and Wade.  Crowe plays an excellent villain.  He is definitely bad and deceitful but also has some good in him which is showcased at the end.  He also has excellent charisma.  Ben Foster also plays another intimidation villain.  Logan Lerman does a fine job as the son.  I'm not too familiar with this actor.  The only other film I've seen him in (I think) in Noah and I didn't care for him there.  However, he does a decent job here.  \nPeter Fonda was good as well, though he was underused.  They kept him alive in the beginning just to kill him off in a bit of a distasteful way, which I didn't care for.  The pacing could have been a bit faster too.  There were a couple scenes that could've been cut out.  Those are really my only problems.\nOverall, definitely give this look if you love Westerns, action movies, or just want to see Russell Crowe or Bale give great performances.  It's my second favorite Western after True Grit, though that can change.  I haven't seen that many Westerns really.  It's not a film I'd watch regularly because, as I said, I am not a big fan of Westerns, but I can't deny that it's still a great movie from a critical standpoint and I did have fun with the dichotomy between the characters and some of the action.",
            "review_date": "2014-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Films like this always require a the right frame of mind to get the most out of them but it's worth the investment - emotionally rich and action packed throughout and for me personally, among the best of the modern westerns.",
            "review_date": "2014-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two awesome performances by Christian Bale and Russell Crowe, with the first hour and twelve minutes of character development/build-up, and a really intense last fifty minutes! Not perfect, but still great!!!",
            "review_date": "2014-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Phenomenal characters",
            "review_date": "2014-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strong on character development and twisting plot, 3:10 to Yuma is an amazing western from the likes of one of Hollywood's finest directors, James Mangold. Bale and Crowe contribute excellent performances and their chemistry together builds a large amount of wordplay, leading to a large amount of depth to both characters. Barry Pepper is surprisingly good as well.",
            "review_date": "2014-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A solid western great cast solid direction. If you get a chance to watch it do so.",
            "review_date": "2014-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the end, what makes 3:10 to Yuma work despite a rather preposterous final act, is that it refuses to see anything in terms of moral simplicity, despite the presence of black and white hats.",
            "review_date": "2014-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Russell crowe and Christian bale are so awesome in this.",
            "review_date": "2014-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Along with True Grit, a rare commodity which is a western remake which improves upon the original.",
            "review_date": "2014-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With amazing performances, 3:10 to Yuma is dark, exhilarating, and emotional. A fast paced story and great action, this film doesn't fail at being another fantastic western remake.",
            "review_date": "2014-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great movie. loved the actors.",
            "review_date": "2014-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Im not usually a western watcher but I absolutely love this movie. Russell Crowe and Christian Bale are simply fantastic. They are blessed with two wonderful characters who are the focal point of the whole movie. Most of the time its a battle of their understanding for each other rather than an action movie but in the end they get the mutual appreciation they fought for and a ending the movie deserved. 3:10 to Yuma is a wonderful action drama and one which anyone can enjoy because it is just that mesmerising to watch.",
            "review_date": "2014-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma is a film I'd heard so much about, how it was the best remake ever. I finally saw it and it's pretty good but I wouldn't go so far as calling it great. Russell Crowe and Christian Bale are excellent and their 'friendship' drives the film. The film has a great sense of tension and you have absolutely no clue wether to like or hate Russell Crowe's character. Ben Foster is a great villain and Logan Lerman was pretty good. Unfortunately though the film is very slow and honestly the first act is quite boring. Luckily though the last third is excellent and the film has a very good ending. Overall I would recommend this movie, it's not anything that special but it's pretty decent. B",
            "review_date": "2014-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a big western fan but liked this one.",
            "review_date": "2014-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A thrilling Western that thrives on perfect performances by Christian Bale and Russell Crowe as two men on two different sides of morality.",
            "review_date": "2014-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "interesting, interesting show.very good \"western\" with kind of an edge, sticking with you as being a good movie to watch even years later. Kind of like True Grit in that sense (just a straight up story) but I really liked this one.  Just a stupid little story so probably a 7.8 sounds about right. four stars is a little much for just a fun, different, storytelling type of flick. It wasn't the greatest movie ever made or the greatest western in the last decade.",
            "review_date": "2014-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best western since Unforgiven !",
            "review_date": "2014-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Often forgotten in the discussion, this is one of the better remakes of a classic film.",
            "review_date": "2014-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was just amazing, very well written, beautifully shot, and the chemistry between Crowe and Bale, it goes without saying, 2 of the greatest actors in my book, teamed with a brilliant director and production team, everything about this film was addictive, I can officially say I've fallen in love with Russell Crowe, what a human being, what an unbelievably awesome specimen! He made this film for me",
            "review_date": "2014-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best westerns of the 2000s. 3:10 to Yuma is a very good western that has great performances by Christian Bale and Russell Crowe, great direction by James Mangold, good moral themes, great character development, and some awesome action scenes.",
            "review_date": "2014-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant performances from Bale and Crowe in this gritty Western remake.",
            "review_date": "2014-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's hard to find a good Western movie these days, and 3:10 to Yuma delivers. Russell Crowe plays a great villain in Ben Wade who becomes more of an anti-hero that you find yourself rooting for by the end of the movie. Christian Bale is always great and doesn't disappoint in this one either. This movie made me appreciate what a great actor Ben Foster is as well, as Crowe's psychotic right-hand-man. This movie helped me regain my faith in Westerns after the many flops over the past few years.",
            "review_date": "2014-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma is all on timing about disgrace. A pitch-perfect tone for a remake centered on its characters and their facing on the hards of man, not life.",
            "review_date": "2014-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Russell Crowe, plays a perfect western bad ass",
            "review_date": "2014-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "brilliant movie - one of the best in many years",
            "review_date": "2014-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Westerns must be really hard to make or something, there's so many bad ones, this is the exception to the rule.",
            "review_date": "2014-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent acting by crowe. Great plot, and finishes with a strong, surprising ending.",
            "review_date": "2014-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best film of the director, with a full story of intrigue with outstanding performances.",
            "review_date": "2014-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exciting, entertaining and amazing",
            "review_date": "2014-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched this again after a least a year break. The moral themes and yet questioning ambiguity are all the more apparent...clever in its simplicity and yet wise in its complexities....it's also a rip roaring action yarn that harks back to the glory westerns of a few dollars more",
            "review_date": "2014-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only movie I have seen a horse explode in. worth it for that alone.",
            "review_date": "2014-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful western in which the good guys can be bad and the bad guys can be good; both the hero and villain are relatable, admirable and worth cheering for. It makes for a great ending.",
            "review_date": "2014-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If There was ever a movie that deserves the title of best modern day Western 3:10 to Yuma takes the cake. Boasting Oscar worthy performances from Christian Bale and Russell Crowe this movie exceeds the more of the moral complex High ground it presents to the screen and exudes a great and true travesty, in a hard and dirty but yet beautiful way.",
            "review_date": "2014-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This remake exceeds the original, becoming an instant classic.",
            "review_date": "2014-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Packing in tense western action and a pair of strong lead performances, 3:10 to Yuma is an exciting modern western that is let down by an implausible finale.",
            "review_date": "2014-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ending is predictable.",
            "review_date": "2014-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps a little ott in places, but overall a gripping western of a classic nature.",
            "review_date": "2014-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crowe and Bale top a great cast in a stylish yet harsh story of empathy for the strong and weak.. A good mix of classic western themes and realisms of the day. Ben Foster is also fantastic in a lesser role.",
            "review_date": "2014-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite slow but eventually gets you interested enough to enjoy the climax",
            "review_date": "2014-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite enjoyable with tons of action! Russell Crowe gives a great performance. Christian Bale was good, but I expected a little more from him. My biggest problem is that it's too unbelievable. Why does Russell Crowe's character cooperate so much? Does he want to go to jail in Yuma? Regardless, it's still an entertaining present day western!",
            "review_date": "2014-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good western. Not much else to report.",
            "review_date": "2014-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite westerns of all time. Strong acting throughout, moving ending, and enough action to maintain interest start to finish.",
            "review_date": "2014-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best cowboy films i have ever seen. A must watch.",
            "review_date": "2014-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fierce performances from Christian Bale and Russell Crowe and a great script make this film tense and exciting.",
            "review_date": "2014-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best Western movies I have ever seen.  It stands right at the top of the genre along with Unforgiven, True Grit, and The Good, The Bad, The Ugly.  Russell Crowe and Christian Bale give incredible strong performances in the lead roles and serve as perfect opposites that neutralize each other in almost every way.  This movie accomplishes the rare feat of being a remake that outshines the original.",
            "review_date": "2014-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well directed and thrilling, just not entirely that interesting.",
            "review_date": "2014-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great remake to a great classic.  The second adaptation of Elmore Leonard's short story \"Three-Ten to Yuma\" and remade from the 1957 classic of the same name, the film follows Dan Evans, a one-legged rancher struggling with money and under the threat of losing his land, takes the offer to bring gang leader Ben Wade to Yuma Prison on the 3:10 train.  The film follows most of the events of the original, with some major and minor additions and changes, including one of Dan's boys a young man who surprisingly tags on the dangerous journey, and is a good shot, and changing some of the ending, but is still a great modern Western.  The worthwhile new additions are grit, and more and ramped up action that though it can change pace sometimes, but the pace remains even throughout.  The film has smart writing from Halsted Welles (who wrote the original), Michael Brandt, and Derek Haas, which is brought to life by James Mangold's smart direction.  The film measures up to and surpasses the original thanks to the additions and changes, as well as amazing performances, especially Russell Crowe, Christian Bale, and even Logan Lerman, who had a bigger role than I expected, and even though he was starting, he is convincing enough to carry a portion of the picture.  This film also focuses how the events affect the characters, nailing the execution.  This is a must-see remake that shows that even changes can still make this a modern classic, another example being the True Grit remake.",
            "review_date": "2014-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'd never heard of this film but saw in at the library and liked the cast so we grabbed it.  Great movie!  I was pleasantly surprised. Bale and Crowe delivered some of their best performances IMO.",
            "review_date": "2014-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite revisionist western. Some strong casting meets even stronger direction for a fantastic remake.",
            "review_date": "2014-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the best modern western of the 2000's. great cast, cinematography, music score, and directing.",
            "review_date": "2014-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly my favorite Western movie.",
            "review_date": "2014-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Russell Crowe does a good job that's about it",
            "review_date": "2014-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a good western that showcases some high-quality performances. The story is simple enough and I got on board with it quickly. I enjoyed the complexity of both of the main characters and thought their exchanges in dialogue was always interesting. The movie does have some pacing issues and can be pretty slow in places. However, the finale is a truly enjoyable one and one that truly resonates. I'm not personally the biggest fan of the western genre, but I do feel this is probably one of the better ones I've seen.",
            "review_date": "2014-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma - 3:10 to Horse Shit\r\n(Be Advised - Spoilers)\r\n\r\nOn Monday, midday, I thought I'd treat myself to what in my family was termed a \"funkie.\" That would be the movie you'd turn on on weekend afternoons, in the midst of the heat, that would usually be a gun opera or involve oversized lizards.\r\n\r\nSo my choice what a neuvo Western called \"3:10 to Yuma,\" starring Russel Crowe and Christian Bale as the antagonist and protagonist, the charming sociopath and the frumpy one and one-half legged ex-Massachusetts militia man turned Arizona cow farmer. And then there's Ben Foster, the young actor who keeps getting case as quasi-psychotic weirdos or psychopaths, a la the boyfriend in Six Feet Under, or the creepy criminal in Bruce Willis' hostage movie, who burns himself to death at the denouement. And some miscellaneous bad guys, my favorite of which being the silent sharpshooter Mexican.\r\n\r\nThe thing I really didn't like about the film was not the improbabilities--why was the stage coach robbery so badly planned. I mean, they're running behind a coach loaded up with a backward-facing Gatling gun. Well, and for that matter, why doesn't that early machine gun hit more of them? It isn't that Ben Wade (Crowe) stays inexplicably in town after \"taking\" the comely frontier town bar wench (could they really have been that attractive and worked in a bar for long). It was the faux psychology. The last time I'd seen such a psychologically shallow film parading itself as something deep was Clint Eastwood's \"The Unforgiven.\" That one won some award. Apparently there's a prize for most self-deluded.\r\n\r\nI mean, how hard is it to make a Western? The template is already there, either in Eastwood's early films of the great operas of Sergio Leonne (\"Once Upon a Time in the West\" is about as good as it gets). You take archetypally exaggerated characters, pit them against each other in archetypally charged situations, and bring them to an archetypally loaded climax and conclusion. You don't need to fuss around with real motivation, with complexity of psychology and relationship. Unless you do, and then you have GOT to get it right.\r\n\r\nIf you're going to tell a story of human psyches, for God's sake, know what you're talking about. Don't get your information from other shallow movies that are pretending to be deep. Or maybe being as deep as they can, because they've never looked inside for their source material.\r\n\r\n3:10 to Yuma was, I guess, as story of fathers and sons and redemption. In Wilberian terms, it's the story of the \"red,\" self centered, ego-centric level of development maturing into an \"blue,\" family/village-centric level of development, the story of the transition from the social form of the strong man to that of the strong law. Ok, fair enough. Deadwood, David Milch and HBO's fantastic ballad of civilization, did it for three years. It's a great subject, rich and deep.\r\n\r\nExcept for in this film. Just as in \"The Unforgiven,\" human motivation is presented with the form of depth--yes, fathers and sons have complex relationships, and sons have to choose their idealized figures and then come to grips with their real world men; darkness must be struggled with and brought to the light, socially, interpersonally, and intrapsychically--but it doesn't actually have the substance. It's like someone quoting Shakespeare, and at first it seems they are taking those pieces that are meaningful, yet pretty soon you realize they are spouting those parts that they believe are deep, because of what they've heard or read. But not what they have felt.\r\n\r\nThat's this film: callow, un-heart felt, bleak in its confused morality, shallow in its understanding of human nature and minds. Blah.\r\n\r\n(This review and others at http://www.deepmoviereviews.blogspot.com).",
            "review_date": "2014-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic movie. One of the finest modern westerns, Great acting, action, and plot. Very great movie.",
            "review_date": "2014-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good action and a nice plot set up. The film never really bores and there are some satisfying stand offs and dialogue between the characters, but certain developments in the plot seem forced and unnatural, particularly the ending, which didn't please me.",
            "review_date": "2013-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some fine performances from its superb cast make this a modern day crack at the western genre that is both highly entertaining and most definitely recommended.",
            "review_date": "2013-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is an interesting new angle on the classic American Western. There's ample character development in the backstories of both Crowe and Bale's characters, and regardless of Ben Foster's appearance as a borderline archetypical character, he still makes the sociopathic sidekick to Ben Wade more enjoyable than one might expect. Came at a time when I was unfamiliar and uninterested in the genre itself and gave me a good modern introduction and motivation to delve deeper into the classics that inspired it.",
            "review_date": "2013-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Upon second time of watching I realised just how good this film is. An attempt to make a gritty western completely pulled off by Mangold and his cast, especially the two leads, Crowe and Bale, as well as a sterling sadistic performance from Crowe's second-in-command Ben Foster. Cinematography is really incredible, and the direction and editing keep the film moving along at a break-neck speed.",
            "review_date": "2013-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(****)  This movie is simply a two-hour explanation of why I wish more westerns were made these days, and I don't mean those in the vein of Lone Ranger.  I want good, emotional, dramatic westerns, and 3:10 to Yuma has been the best one since Unforgiven.  I don't even understand why it's considered a dying genre even though there's still nothing cooler than gunslinging action.  Sorry to start the review with an aside, but I felt like it had to be said.\r\n\r\nI saw this film several years ago when it was released, but never reviewed it.  I finally bought a copy out of the bargain bin and rewatched it.  In other words, my day was made.  If you like gunfights and explosions, there's something for you.  If you like good plots and sensible character motivations, there's something for you.  And if you just like watching two actors give amazing performances, there's something for you as well.\r\n\r\n3:10 to Yuma tells the story of a rancher who is about to lose his farm, so he agrees to escort an infamous outlaw to the next town so he can put him on the 3:10 train to Yuma prison.  However, the journey proves to have many surprises and requires more tough decisions than he ever suspected.  Neither of these characters are flat.  They both have complex psychologies, and like in real life, their inner feelings affect their actions more than simple logic.  This is especially true of the rancher, who has a family to think about, and is constantly fighting a moral war with the outlaw where the fate of his son's future could be at stake.\r\n\r\nChristian Bale does some of his best acting in this movie, and Russel Crowe gets a chance to show off his chops in a non-actiony role.  He also did this in A Beautiful Mind, and once again he kills it.  All the other actors seem very well fit for their roles, with the exception of an out of place Luke Wilson, whose part is mercifully short.\r\n\r\nThis story is very well fleshed out with very few pieces out of place.  There is a choice near the end which I can't discuss due to spoilers, but it is probably the only reason I docked 10% on this one. Nonetheless it leads to such a tits ending that it's very hard to complain.  If you are a fan of the western genre, see this film then show it to everyone you know, so hopefully the power of this genre can return to its place on the silver screen.",
            "review_date": "2013-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strong performances from Christian Bale and Russell Crowe and some sweet western gunfights, 3:10 to Yuma is a rare example of the remake outdoing the original.",
            "review_date": "2013-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie. Warning to any people with dad issues- could be a year jurking ending to the dad issue people. I loved it though. More fathers/dads should be more willing to risk it all for their family's wellbeing. I know I would.",
            "review_date": "2013-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I put off watching this because every time I was about to start, I thought \"Oh yeah, it's a Western. Ugh.\" However it is excellently done, and if nothing else, the performances of Crowe and Bale make it worth watching.",
            "review_date": "2013-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The final chase and fight to catch the 3:10 train to Yuma momentarily derails this excellent film.  The entire cast is top notch and I really enjoyed the characters and the story.",
            "review_date": "2013-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fast-paced and exhilarating western that packs a punch.",
            "review_date": "2013-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than the original",
            "review_date": "2013-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have to confess I am not usually into Westerners. However it was hard not to enjoy a film that features both Russell Crowe and Christian Bale. The on-screen chemistry between the two was electric and it is hard to pick a winner when both set the bar so high. Russell Crowe has started to develop a penchant for excelling at playing the bad guy role. Christan Bale has the unique talent of drawing in the audience and evoking sympathy for each character he plays. Another one to look out for is Ben Foster who pulls off his role as Russell Crowe's sidekick to perfection. Even if you aren't into Westerners, there is no reason why you won't love this one.",
            "review_date": "2013-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "forgot how good this movie was",
            "review_date": "2013-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The relationship between Ben Wade and Dan Evans should be \"worked\" a bit more, so the ending would be more persuasive. Intense performance by Russell Crowe.",
            "review_date": "2013-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all time favorite westerns!",
            "review_date": "2013-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good actors. such movies really does remind one how \"the west was won\", thru a lot of hard work, and questionable power struggles. I did enjoy the young girl in True Grit better than the teen boy in this one.",
            "review_date": "2013-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thanks to it's masterful directing, memorable acting, and epic action, this defines the entire western genre!",
            "review_date": "2013-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The theme of man's dignity, morality and friendship might sound cliche and naff if the plots are badly constructed. However, this remaking film definitely succeed in convincing us with its new interpretation on these topics.  This is even true with the two great actors(Christine Bale and Russell Crowe)' performances. If there is anything to criticize, it would be that the beginning part could be cut to make the storyline more concise. However, this is a kind of films that make you feel worthy your patience until the climax at the end.",
            "review_date": "2013-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed the movie but I got kinda irritated at Christian Bales choices in the movie like take the damn money lol!!",
            "review_date": "2013-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is probably one of Crowes best acted pieces, but how could you possibly top that off, simple, just chuck in a young, Hollywood hungry Bale and POW! You have yourself a real western classic!",
            "review_date": "2013-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not having seen the original I can only comment on what I saw in the 2007 version.  What a shame, I really enjoyed the first half of the film, the bad guys are pretty ruthless, Bale plays a convincing struggling rancher who happens to get caught up accidentally in the transportation of a wanted criminal.   The music is good and there are signs of a dark gritty western that start to draw you in, however there are only so many times in a story when what is happening is inconceivable,  the story throughout has more holes than a polo mint factory and as time goes on whatever I was drawn into, slowly took me out again and then there is the ridiculous way the film comes to an end.  Disappointing after a fairly promising start.",
            "review_date": "2013-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rancher Dan Evans agrees to help transport captured outlaw Ben Wade to the nearest rail station, where they'll board a train to court. But all the while, Wade's henchmen are plotting their next move. This movie is strongly directed and never anything other than watchable galloping along at a heart racing rate and not losing momentum even after a detour to exchange gunshots with some Apaches and a grisly encounter with some old enemies of Wade's among a gang of workers clearing land for the allimportant railroad. It is the railroad, that is itself both a force for good and bad. \r\n\r\nThe heartless rail company wants to buy Wade's poor scrap of land, which is why the banks are trying to force him out, but it is the train the implacable iron horse, invulnerable to the desperadoes attacks on which the embattled forces of good are relying to bring Wade to justice and, arguably, to bring civilization and the rule of law out to the west.\r\n\r\n\r\nTraditionally the western is a genre in which elemental human drama of good versus evil can be staged in the vast arena of the frontier. For all this, 3.10 To Yuma is an enjoyable yarn and Fonda in particular strengthens the movie some, as the grizzled warrior and survivor of many such battles in the unending war of the American west. I highly recommend this movie to all.",
            "review_date": "2013-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good old fashioned western!",
            "review_date": "2013-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good one... christiane bale and russell crowe lol",
            "review_date": "2013-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the great western films I've seen. Crowe and Bale are at their finest performance. With an ending that you'll always remember.",
            "review_date": "2013-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The word remake differ in tone depending on the genre of films. In horror it's very common to expect nothing that'll match the original with the remake failing to understand what worked and what didn't the first time around. In the action genre it's obligatory that the remake will either be a rehashed, worse than the original, and at times overshadow a good film due to its poor reputation. For Western the word remake is a more positive phrase as \"The Magnificent Seven\" and \"True Grit\" match their original counterpart. The difference with \"3:10 To Yuma\" being it's one of the rare occasion where many believe the remake surpasses the original.\r\n\r\n3:10 To Yuma is about a small-time rancher agreeing to escort a captured outlaw who's awaiting a train to go to court in Yuma. Driven by it characters rather than a conventional goal. The plot is traditionally simple and with modern complexity presented in the characters. It two central characters analyze not only each other, but the depiction of the old west. Both the lawmen and outlaws take liberty in action to get what their job done. Dealing with the ideas of honor, respect, pride, and the ultimate question what is good and what is bad or what is right and what is wrong. It doesn't pick a side rather it more explores the depth of morality. Portrayal of the old West remains realistic until the final act becoming over the top for an appropriate reason. While it is established (or predicted by the viewers) that nothing would be gained if the destination was met for either central characters it doesn't take away anything from the character's arc. \r\n\r\nUnfortunately despite having compelling villain he is sadly a plot device. Not bad in a traditional sense he serves nothing, but in the way he can't suffer negative consequences while being held captive. Upon killing one of his captors he must remained unharmded because the plot needs him in good condition for the climax. Our heroes morality is tackled when debating to kill the criminal on the spot; however, the heroes make several bad decisions during their journey you know they won't turn against the law. You'll never feel the lawmen will become an outlaw nor the fear for a second care for the outlaw life in risk given how well he's treated by his lawmen. The ending can garner mixed results. It's an ending that is wholly satisfying and nonsensical. Closing the film two central character arc in manner that makes a reflection on one man life as lie and one man life as the truth. Nonsensical thinking upon it as nothing was accomplished by our central character and that each seal their fate knowing the outcome of their action. As a character study it succeeds in area you wouldn't expect it too, but the narrative never makes it come full circle.\r\n\r\nChristian Bale plays his role quiet low key, controlled, and generates considerable sympathy for him. Russell Crowe is equally match Bale as a clever and ruthless leader of his gang of robbers, but his very subtle take that his character is getting tired of his life, and his gradual bonding to Bale worth watching. Ben Foster portrays a borderline psychotic in a manner that also avoids stereotyping in good performance. These actors are supported by good supporting actors by Peter Fonda, Alan Tudyk, Dallas Roberts, and Logan Lerman. In fact it is the character interplay is the driving heart of the film, and keeps you transfixed throughout. This interplay is brilliantly facilitated by writer-director Mangold, who sets it in a spectacular environment and embellishes the story well-handled complexities.\r\n\r\n3:10 To Yuma is an intelligent character studied even if the story it tells is not on the level of wit as the characters we analyze. It's a Western that is founded by its actor interplay and character interactions under James Mangold direction that give it great success. No matter if you're a die hard Western fan or not one in favor of the genre \"3:10 To Yuma\" contains strong characters and equally powerful cast that complements an intelligent look at the old west.",
            "review_date": "2013-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ok lets see i wasnt mad about russell crowe as the villian i taught it could have been better also defo not 1 of christian bale's better roles, this film was good all the way up to the last 15 minutes which was totally unbelievable (ben wade the most dangerous murderous bastard around who spends the whole movie waiting for his gang to free him and in the mean time killing the people garding him has a sudden change of heart and goes hey fuck it maybe i deserved to be hanged lets get to that train lets get me on that train) i cant compare this to other westerns because i havn't really seen many westerns",
            "review_date": "2013-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best westerns of the last two decades. Bale and Crowe are fantastic as hero and anti-hero.",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfectly-acted and well-directed remake with a superb and fascinating climax.",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really good Western that manages to be a satisfying character study as well. We follow the story of a down on his luck rancher who takes the opportunity to make some money by acting as an escort for a captured outlaw in order to get him to a prison train so he can face trial for his crimes. The rancher is played by Christian Bale while the outlaw is Russell Crowe, both of whom are excellent. As the story unfolds, we learn about both men's flaws and failings and indeed those of the others who accompany them. There's all the things you need in a Western, with plenty of shootouts and sweeping landscapes. However, it is the smaller, more intimate moments that make this film stand out as they are brilliantly acted and directed. Crowe's character is darkly fascinating and complex while Bale's manages to be simultaneously stoic and fragile. There's a really high body count and a few grisly moments but this is a classy, well done movie that I found hugely enjoyable",
            "review_date": "2013-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not only a fantastic Western, but also an incredible drama in its own right. Once the story pulls you in, you won't be able to let go of the suspense. This feels like a pure cinematic popcorn flick with all of the right actors, plot twists, and over-dramatic moments that feel so right. This film starts strong and ends stronger. This is a movie for movie-lovers of all kinds.",
            "review_date": "2013-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a good remake...who would of thunk it! Ben Foster stole the show",
            "review_date": "2013-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best western ever made! Christian Bale and Russell Crowe give amazing performances.",
            "review_date": "2013-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best contemporary westerns I've seen in a while.",
            "review_date": "2013-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "best western movie I've ever. Yep, I said it.. Christian Bale and Russell Crowe are awesome together in this movie.",
            "review_date": "2013-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok... My new favorite Western!\n\nThanks to brother Johnson and Tommy P for convincing me to see this!!",
            "review_date": "2013-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, until the ending...",
            "review_date": "2013-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie it's really well done, everywhere except the ending.  It could have been one of the best western movies. Instead its just ok. I may watch it again and stop before the ending.",
            "review_date": "2013-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tense, thrilling, amazing and unpredictable  3:10 to Yuma is a great example of how a Western movie should be; featuring a strong cast, sharply written and tensely directed.",
            "review_date": "2013-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, the plot does not make any sense whatsoever. If you don't mind the aforementioned though, it might be even an enjoyable piece to watch",
            "review_date": "2013-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A morality tale of great weight and depth is boosted by a fantastic performance by Crowe and a perfect helping on Western fun.",
            "review_date": "2013-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Russell Crowe and Christian Bale are great on screen together, and the final chase scene is expertly done.",
            "review_date": "2013-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma is easily one of the best Westerns in recent years because it is able to perfectly balance some of the most incredible old west style gunfights I have ever seen with such fascinating character personas thanks to Crowe and especially Bale, who I would say gives the best performance of his career.",
            "review_date": "2013-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best Western I've seen and it has a good moral lesson. Great performances by Christian Bale and Russell Crowe too.",
            "review_date": "2013-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I ain't no fan of western movies. but its 1 hell of a movie",
            "review_date": "2013-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nowadays you don't really see that much westerns coming out and I think that's a shame. Personally I love westerns and there have been many great westerns over the course of the genre's existence. One of the most recent westerns is James Mangold's remake of 3:10 to Yuma, a film that I think is great. Now I have not seen the original so I can not compare them, what I can tell you is how great this film is. Let me start out by talking about this film's writing which I thought was brilliant. The writing to this movie was just so good, the writers created such an amazing story that had me invested for the whole running time. One of the things that make the story so interesting is the film's two main characters. What I mean by that is the two main characters, Ben Wade and Dan Evans, are written so well. Each of them have back stories that tell you quite a bit about them and they both have motivations for what they are doing, to be honest I actually cared about both characters even though one was a good guy and the other was a bad guy. James Mangold's direction helps bring the story to life, he just does an incredible job at directing the actors and putting the camera in the right place. Speaking of cameras the cinematography for this movie was beautiful, the camera just made the open landscapes look incredible. The score for this movie was also great and fit the film perfectly. If I had to choose one thing in this movie that stood out the most it would probably be the performances. All the performances in this movie were amazing, especially the two main performances. Russell Crowe and Christian Bale are just phenomenal in this film, both give one of the best performances of their career's. Ben Foster is also great in this film and I'd even say he's up there with Crowe and Bale. In the end 3:10 to Yuma is a fantastic film that I would highly recommend!",
            "review_date": "2013-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some really good performances in this film, great remake in a classic Western film. 3:10 to Yuma was a fun ride.",
            "review_date": "2013-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not usually a fan of westerns but I quite enjoyed this.",
            "review_date": "2013-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good remake. Good cast. Great movie.",
            "review_date": "2013-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is one of the best westerns I have ever seen. The ending is absolutely amazing.",
            "review_date": "2013-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hollywood seems to have more success remaking Westerns more than anything else, 2007's 3:10 To Yuma proves that.  Thanks to the great performances of Bale and Crowe, this remake is actually quite tolerable.  Now I didn't really think the original was all that special and the same goes for here.  The story is decent, but isn't spectacular.  Some nicely done western elements are mixed in, but falls in to the category of typical western at times.  The writing is well done and the dialogue is very great, especially between Bale and Crowe.  James Mangold directs this film and does a pretty good job at making every scene worth while even if the story really doesn't make it sound to special.  Thanks to Bale, Crowe, and Mangold, the 2007 3:10 to Yuma is successful and a nicely done western to watch.",
            "review_date": "2013-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bale and Crowe's performances, the violence and accurate interpretation of the setting make this worth watching.",
            "review_date": "2013-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Modern day western done right. Bale and Crowe's performances are the driving force that helps the film build to its jaw dropping conclusion. Hats of to James Mangold for a well crafted, ol' fashion western.",
            "review_date": "2013-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You go to the beach and look at the sand. You're looking at the individual grains and become amazed by their shapes, variety, assortment, and... forgetting there's a bigger ocean out there filled with all sorts of undiscovered wonders. This best describes my 3:10 to Yuma experience. It's a good Western but you're merely stepping on the shore of good Westerns. Which suddenly reminds me that I should be watching the likes of True Grit.",
            "review_date": "2013-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Haven't seen the 1957 one, but this one is a classic too. Superb acting by all. Crowe & Bale are just amazing. The \"hand of God\" is too good.",
            "review_date": "2013-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Holds it's own right up with Young Guns, The Unforgiven, and Tombstone despite this one being a remake. It almost felt Speghetti in nature which I'm stating as a compliment. Nice storyline, somewhat emotional, and a happening body count!",
            "review_date": "2013-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite performance is from Ben Foster as villain Charlie Prince. He is like a psychotic, live-action Yosemite Sam.",
            "review_date": "2013-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While beautifully produced and acted, the simplistic plot, spaghetti shoot outs and non-sensical ending really ends up holding this film back at the station.",
            "review_date": "2013-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crowe and Bale are excellent, and their characters/dynamic are well written and great to witness. Unfortunately, almost no other character gets their own justice of ever being fleshed out, or stuck with almost nothing to say (Alan Tudyk and Peter Fonda are reduced to a disgracefully small amount of screen-time). Ben Foster (Angel from X3) makes a breakout performance as one of the best Western badasses of this age. A cameo by Luke Wilson, more or less, threw me off for a moment, but it was a neat turn for him. Not the best Western, but pretty clever. Now I need to go see the original and compare.",
            "review_date": "2013-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watch this movie right about every year or so",
            "review_date": "2013-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing interesting to keep us move.",
            "review_date": "2013-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was absolutely superb.  Just plain perfect.  It was heart wrenching, and had you the moment it introduced it's two main characters.  Russell Crowe and Christian Bale are absolutely fantastic, and in my opinion, they both deserve Oscars for their roles, as does the movie as a whole.  The score is beautiful, it brings everything together with that perfect final touch.  Completely amazing.  Yeah, it's my favorite movie ever.  And what?",
            "review_date": "2013-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazingly paced and involved. Great filmography. Great character development.",
            "review_date": "2013-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma, a remake of the movie made 50 years earlier, is a classic Western in every sense, and I mean that in the best and worst way. Christian Bale plays a man who joins a posse to take Russell Crowe's character, Ben Wade, an infamous outlaw, to a train set to depart at 3:10 to Yuma in a town 3 days away. The story is not highly developed, but Westerns have never relied on complex stories, rather straightforward ones that are done well, and this fits that bill quite well. Christian Bale does an okay job, but most of the time he lacks emotion in his role, which makes the relationship with his son hard for me to care a lot about, and that makes the whole premise of why he's doing all this falter. Russell Crowe does a fantastic job in his role, and was easily the best part of this movie. No other characters are particularly remarkable, which again is a trademark of Westerns, and the action is top notch for what it tries to do. But Bale's failure to engage his role in the capacity it requires makes this movie not as good as it should be, but it's still a good movie that I would recommend.\n\n3.5 stars: Good, not great",
            "review_date": "2013-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best western in a very long time,it's got all the players (Bale Crowe Foster etc) all on form delivers some great set pieces enjoyed it a lot ,on point with the original.",
            "review_date": "2013-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good western. simple. good stuff.",
            "review_date": "2013-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "my favorite western!",
            "review_date": "2013-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an awesome movie.",
            "review_date": "2013-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The thrill in this movie is watching two mega stars engage with one another and did it so utterly brilliantly. Christian Bale played Dan Evans, a crippled war veteran trying to put food on the table for his family under hostile conditions. Towards the end, he knew he couldn't succeed in bringing  Russell Crowe the villain named Ben Wade to the train at 3:10 to Yuma. But Dan did succeed in in tugging at heart strings of Russell Crowe with stories of hardship and illness in the family and having a hospitable and beautiful wife who fed Ben well. In the final act, Ben and Dan became a team to fulfill Dan's mission so that he will be a hero in the eyes of his eldest son William Evans, played brilliantly by Logan Lerman. It is heartwarming to see Russell Crowe showing compassion on the crippled Christian Bale. Perhaps things would have been different if Ben Wade didn't read the bible from cover to cover that his mother gave him when he was 8 years old at the railway station.",
            "review_date": "2013-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The thrill in this movie is watching two mega stars engage with one another and did it so utterly brilliantly. Christian Bale played Dan Evans, a crippled war veteran trying to put food on the table for his family under hostile conditions. Towards the end, he knew he couldn't succeed in bringing  Russell Crowe the villain named Ben Wade to the train at 3:10 to Yuma. But Dan did succeed in in tugging at heart strings of Russell Crowe with stories of hardship and illness in the family and having a hospitable and beautiful wife who fed Ben well. In the final act, Ben and Dan became a team to fulfill Dan's mission so that he will be a hero in the eyes of his eldest son William Evans, played brilliantly by Logan Lerman. It is heartwarming to see Russell Crowe showing compassion on the crippled Christian Bale. Perhaps things would have been different if Ben Wade didn't read the bible from cover to cover that his mother gave him when he was 8 years old at the railway station.",
            "review_date": "2013-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The thrill in this movie is watching two mega stars engage with one another and did it so utterly brilliantly. Christian Bale played Dan Evans, a crippled war veteran trying to put food on the table for his family under hostile conditions. Towards the end, he knew he couldn't succeed in bringing  Russell Crowe the villain named Ben Wade to the train at 3:10 to Yuma. But Dan did succeed in in tugging at heart strings of Russell Crowe with stories of hardship and illness in the family and having a hospitable and beautiful wife who fed Ben well. In the final act, Ben and Dan became a team to fulfill Dan's mission so that he will be a hero in the eyes of his eldest son William Evans, played brilliantly by Logan Lerman. It is heartwarming to see Russell Crowe showing compassion on the crippled Christian Bale. Perhaps things would have been different if Ben Wade didn't read the bible from cover to cover that his mother gave him when he was 8 years old at the railway station.",
            "review_date": "2013-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really enjoyed this and perfect for a Bank Holiday Monday, takes me back to those days when there were quite a lot of westerns on TV!",
            "review_date": "2013-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic of the Western genre, ranking up there with that other recent Western masteripiece, The Proposition.  Mangold directs Christian Bale and Russell Crowe to stellar performances.",
            "review_date": "2013-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A decent addition to the Western genre!",
            "review_date": "2013-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well-made western, good acting and likeable characters.",
            "review_date": "2013-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am not really into Westerns, but this one got Christian Bale, Logan Lerman, Ben Foster...",
            "review_date": "2013-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Movie. i still get amassed every time i watch it. which is a lot!",
            "review_date": "2013-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The WORST...so bad you have to watch to the end to see if it is REALLY as bad as you thought it would.  Unfortunately it is even worse than one could fathom. Rya, it  is ala John Boy movie!",
            "review_date": "2013-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is by far one of the greatest westerns of all time. With Oscar worthy performances by Bale and Crowe, and a fantastic eye for scenery this is refreshing and wonderful.",
            "review_date": "2013-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hated it. The writing is sloppy, and the acting is okay - but should have been better given the cast. Christian Bale's character was annoying as well, due to him being a pussy/coward.\n\nThe ending is laughable, to top it all off.",
            "review_date": "2013-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of those films with a satisfying conclusion. Can't believe I missed this movie.",
            "review_date": "2013-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful action and plot development. I was enthralled the whole time.",
            "review_date": "2013-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 To Yuma is now and will always be one of the best western movies made in ages.\n\nRancher Dan Evans heads into Bisbee to clear up issues concerning the sale of his land when he witnesses the closing events of a stagecoach robbery led by famed outlaw Ben Wade. Shortly thereafter, Wade is captured by the law in Bisbee and Evans finds himself one of the escorts who will take Wade to the 3:10 to Yuma train in Contention for the reward of $200. Evans's effort to take Wade to the station is in part an effort to save his land but also part of an inner battle to determine whether he can be more than just a naive rancher in the eyes of his impetuous and gun-slinging son William Evans. The transport to Contention is hazardous and filled with ambushes by Indians, pursuits by Wade's vengeful gang and Wade's own conniving and surreptitious demeanor that makes the ride all the more intense. \n\nI can't believe it took this long for my favorite western movie to be made. Of course there are the classic ones with John Wayne and Clint Eastwood. No one can argue that those will remain classics for a lifetime. Western movies now just usually don't seem to work, but with this film it really breaks down the behaviors of an old western movie. It's well executed, well directed, well written and has tremendous acting. The shootouts are groundbreaking, and the sound effects are truly spectacular.\n\nTwo of the worlds greatest actors are in this which makes the movie whole. Who knew Christian Bale could be fantastic and especially in a western movie? Russell Crowe plays such a dark role that I couldn't look away from him in any scene you would see him in.  I have to congratulate Ben Foster because he had to be the best thing out of the movie. He's one of the few villains in any movie that knows how to play such a terrifying character. Director James Mangold has never disappointed me and this is without a doubt his best and most brilliant work ever. \n\nHands down this is one of my favorite movies of all time. It's very fast paced, it has a great script, awesome tone and amazing set of characters. Would I recommend this movie for anybody? Absolutely.",
            "review_date": "2013-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favourite Westerns of the past decade.",
            "review_date": "2013-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Performance by Russell Crowe was amazing . Worth it",
            "review_date": "2013-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The central story of a young boy torn between two father figures is nicely developed for most of the run time, but any thematic coherence that had been built up crumbles underneath the confused, tragic ending. The trappings of the action genre are also a hindrance, bringing in some complicated and unrecognized moral issues that would have been better served by a slower and more deliberate approach. But, \"3:10 to Yuma\" is still entertaining and features truly great set pieces. The cast is also excellent: Bale as a lonesome ex-soldier, Logan Lerman as the rebellious son, Crowe (Clearly enjoying himself) as a calculating outlaw, and Ben Foster as a wild sociopath. They're larger-than-life character types, but they work.",
            "review_date": "2013-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was kind of disappointed.  C. Bale did well.  R. Crowe doesn't do much for me.  but the plot was the worst thing about this movie.  How many times was crowe's character able to get away despite being under constant supervision?  and it seemed like the first hour and a half of the movie was just there so that they could make the last scene.  and the end was ridiculous as well.  [PLOT SPOILER] not the bit where crowe shoots the guys (which was kind of cool).  why did bale turn his back in the middle of a gunfight and decide to have a conversation with crowe?!?!  if you want a good western you still have to stick with tombstone or silverado!",
            "review_date": "2013-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A magnificently preformed, incredibly directed and fully thrilling as well as touching old American thriller, 3:10 to Yuma is a picture perfect remake to a film that was originally so-so for me.",
            "review_date": "2013-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best modern Westerns (and probably the best remake) thanks to great leads, a fitting score and excellent direction.",
            "review_date": "2013-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well-acted and engaging modern Western.",
            "review_date": "2013-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good western. Did not have strong emotional feelings towards story, or ending - but was extremly entertaining.",
            "review_date": "2013-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Westerns are cool, and the remake of 1957's 3:10 to Yuma is just the movie to remind America of that.* Just check out the fantastic cast. Russell Crowe is at his absolute best in the role that all actors dream of playing sometime in their career; that of the effortlessly cool anti-hero. He's a rockstar, suave and dangerous as the notorious outlaw Ben Wade. Christian Bale is just as good, if more reserved, as the humble and reluctant hero and family man Dan Evans. He's brilliant, as always, and together the two actors are dynamite. There's also a handful of great supporting performances: the underrated Ben Foster is creepy and cool as Wade's right-hand man, old-pro Peter Fonda also elicits cool as a rough and jaded bounty hunter, Gretchen Mol is beautiful and understated in her small role as Dan's wife. Dallas Roberts as the guy with the money surpasses the limits of his role, he's a character actor to look out for, and it's always good to see Serenity's pilot Alan Tudyk. Hmm...so did I mention I enjoyed the performances? The directing isn't the most imaginative, but Mangold can tell a decent story. The film is a little slow at times, and there are some momentary lapses in plausibility (How does Dan run so fast with one leg?), but it's a thoroughly entertaining film with plenty to admire.\r\n\r\n*(Actually, \"The Proposition\", \"Seraphim Falls\", \"The Assassination of Jessie James...\" and about a half dozen other great movies that have come out since \"Unforgiven\" could have been that movie, but nobody saw those.)",
            "review_date": "2013-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you haven't seen this movie you should. My top five favorite movies.",
            "review_date": "2013-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Chemistry between Christian Bale and Russell Crowe is great. Two serious actors bring out thriller like no other movies can. I did not see the original movie, so I cannot make a comparison. However, I liked it alot. Ben Foster is amazing in his supporting role. Music is memorable. Must-see.",
            "review_date": "2013-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The James Mangold's film is a tense and traditional Western, based on the 1957 movie with the same title. Mangold simply brings back the good old Western of old full of points needed to make it radiant.\nIn the story we see Dan Evans (Christian Bale) and Ben Wade (Russell Crowe). Evans is an alleged farmer whose family is suffering from a drought and a ruthless landlord. Evans and his son intersect with the notorious outlaw Ben Wade and his gang on his way to town to face his landlord, and Wade just let it go. But the connection between these two men and the older son of Dan, it's far from over. Dan eventually accept an offer made by an agent of the railroad to help escort Wade to a train headed to Yuma prison, while the dangerous gang of Wade follows them at every step. With great action scenes, with the Western style, with several twists that anyone, even I wasn't waiting for, with lush landscapes, and we see the relationship of the characters grow throughout the film, a relationship of hatred, respect and friendship. With two fantastic actors.\nChristian Bale and Russell Crowe simply kill their roles in making them so real and true Western Mans.\n3:10 to Yuma is a movie with the old Western, with all the elements necessary, an Badass shotter (check); a man loocking for justice and redemption (check); an outlaw gang with blood dirsty (check); badass and epic old western gunfight in a city with the clock chinking (check, check and check)!",
            "review_date": "2013-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A prime example of a remake done right, 3:10 to Yuma is a carefully paced western that is a step above most of it's genre due to it's layer of emotional depth created between Russell Crowe and Christian Bale and it's appropriately paced action that satisfies the action appetite and never lingers too long to grow tired of.",
            "review_date": "2013-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thought this was great .. am a big fan of the original so watched with trepidation but was very pleasantly surprised, homage to the original and still fresh and its own movie e.. xcellent",
            "review_date": "2013-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It wasn't bad by any means, but I just didn't care for it. I thought the movie seemed poorly casted and this was Christian Bale's worst performance I've seen. Worth a watch, but that's about it.",
            "review_date": "2013-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome modern western. The boys did a good acting job and seemed to work well together.",
            "review_date": "2013-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If I were teaching an acting class I would make everyone of my students study this movie. Russell Crowe and Christian Bale once again give us a clinic on subtlety. Peter Fonda can still bring it too. And Ben Foster continues to impress with another in a long line of supporting performances. Beautifully shot and scored, this movie misses few beats.",
            "review_date": "2013-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Modern day westerns are as retarded as the old ones.",
            "review_date": "2013-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best westerns ever",
            "review_date": "2013-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was a great western, the acting in this movie is top notch. Someone will win an oscar for their performance",
            "review_date": "2013-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Holds it's own right up with Young Guns, The Unforgiven, and Tombstone despite this one being a remake. It almost felt Speghetti in nature which I'm stating as a compliment. Nice storyline, somewhat emotional, and a happening body count!",
            "review_date": "2013-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good Western remake!! Russall Crowe and Christain Bale did some awesome acting!!",
            "review_date": "2013-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm a very big fan of this movie. It is entertaining. The first western that I have ever really loved.",
            "review_date": "2013-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Western drama that puts you right into the heart of the old west and has all the typical trinkets for a film of his kind, good, bad, and ugly.",
            "review_date": "2013-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I want to 0WN it when it comes out on DVD!!!!",
            "review_date": "2013-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not usually a westerns fan. But..wow.",
            "review_date": "2013-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really good unlikely western with good performances.",
            "review_date": "2013-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant modern western",
            "review_date": "2013-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty fun for a western movie. Though I loved Russell Crowe and Christian Bale, Ben Foster stole the show for me.\n\nB+",
            "review_date": "2013-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the Great Modern Westerns",
            "review_date": "2013-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was fucking amazing.",
            "review_date": "2013-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma bites off more than it can chew: the settings looked fake, the performances were unremarkable, and the cheaply rehashed plot didn't buy into the physics of its own universe. It's also bloody long for what it is.  Stock western fun, but not much more than that.",
            "review_date": "2013-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was awesome!! Great story.",
            "review_date": "2013-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent plot, I like how the end justified the means",
            "review_date": "2013-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It rivals the climax of Eastwood's Unforgiven. That's no easy feat.",
            "review_date": "2013-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great remake, stayed true to the original. The dinner table scene was word for word. Loved it.",
            "review_date": "2013-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Proof that the spaghetti western genre is neither dead nor boring. 3:10 to Yuma is an excellent and entertaining remake.",
            "review_date": "2013-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie. While I haven't seen the original, and therefore can't compare it to the original, this is still a very well-done remake, with a strong plot, thrilling action, and great performances from its cast, especially Bale and Crowe.",
            "review_date": "2013-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Damn good.  Old school style western with a fantastic cast and some great tension.  Crowe and Bale are incredible when they're on screen together, and that's what really drives the film.  I also got to give it up to Ben Foster who's played the sociopath before but he has a lot more fun with it in this one.  This movie will suck you in to its characters and suspense.  Go see this bitch next Friday.  Long live the Hollywood western.",
            "review_date": "2013-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crowe is lethargic and insignificant, and Mangold masterfully fails to capture the grit and unpolished allure of the wild west.  More importantly, he fails to take advantage of a timeless central theme by (at times) ignoring it all together.  This should have been given to Eastwood.  To hire Mangold as a director was to waste boundless potential.",
            "review_date": "2013-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing terribly original happens. but everything happens smoothly and with grace",
            "review_date": "2013-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good indeed. Christian Bale is good but this is Russel Crowe's film and he continues to impress. Ben Foster also shines in a quirky villain role.",
            "review_date": "2013-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good modern western, a quality cast  and great direction to bring the western back to screens.",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes...Russell Crow is all Rotten and i love it...",
            "review_date": "2013-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Totally my kind of Cowboy",
            "review_date": "2013-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Russel Crowe is as always great, he fantastically portrays this ruthless and dangerous outlaw. Not to say that the other members of the cast are any less great. In my opinion Logan Lerman was very good and of course so was Christian Bale. I have noticed that western remakes tend to be better than the original, though i haven't seen the original 3:10 to Yuma, i can't imagine it being better than this.",
            "review_date": "2013-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i am probably the only person that would cry in a western and russell crowe very hot of course",
            "review_date": "2013-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As unexpected of an ending that it is, I just doesn't fit the movie type.",
            "review_date": "2013-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great, great movie.  One of my favorite modern western films",
            "review_date": "2013-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Film of the Year. Great especially if you love westerns.",
            "review_date": "2013-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent Movie, I love Russell Crow, and Christian Bale... Great Western..check it out!!",
            "review_date": "2013-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma was a equally well written story along with a well spread out action film. It was much like the speed of Bourne Ultimatum where it filled you in on what was going on and bringing the characters to light on who they really were. Christian Bale and Russell Crowe make for a great duo that work against eachother, for eachother. Bales character doesnt like Crowes character but they feed off of eachother to get through to the next challenge. This deffanitely brought back to mind watching the old westerns with The Duke and those spaghetti westerns with Eastwood. It was a wonderful ride that I would take into the sunset time and time again.",
            "review_date": "2013-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best westerns in YEARS. you have good guys, and bad guys. Very rarely do we get a film so clear cut on what is the right thing to do and what is wrong. Bale's character is willing to sacrifice life and limb for his family, but beside that is a willingness to sacrifice himself for the sake of his word and honor. Much like the Magnificent Seven/the Seven Samurai, it would not be a stretch to imagine this in feudal Japan in a setting of samurai. The parallels are quite astounding.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is great. But the real hero (in regards to acting) is Crowe's second-in-command, whose glances tell his entire story.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Movie  is Good as Russel and Chrstian is Great.... you must watch....",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What the hell was I smoking when I wrote my comment? Forgetting that, there's something about these types of hyper-westerns about good and evil I like. However, sadly, I have but \"Pitch Black\" to compare it to and that film is much slicker than this. Still, fun film, runs a bit long with at least one subplot too many, Crowe still doesn't use all the range he has, but fun. I still don't see the \"rebirth\" of westerns my peers do, but all the more power to them.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hate westerns, I love this movie, that's how much I recommend it.",
            "review_date": "2013-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not a big western fan, but this was excellent. The performances elevate this movie. You actually care for both characters.",
            "review_date": "2013-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well directed western film including great performances from the entire cast and a great soundtrack.",
            "review_date": "2013-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i was very impressed with this movie, it didn't follow the hollywood norm and both russell crowe and christian bale were excellent.",
            "review_date": "2013-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very good movie. i have always been a fan of classic western movies and i think the people that made the film did a very good job of trying to capture the raw energy and excitement as well as danger that surrounded the people of western towns everyday lives and the difficult choices they had to make just to survive. christian i am sure did not want to get involved in escorting russell crowe by train to the prison he was to go to but he was doing what he had to for his family. after all he could make a good amount of money  doing that job. at the same time russell was not to pleased with christian because he wanted to remain an outlaw and not be sent to prison. everyone was doing what they could to survive.",
            "review_date": "2013-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RUSSEL CROWE IS AMAZING",
            "review_date": "2013-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just wonder one thing about this movie-why was he crippled at the beginning then leaping all over the place like spiderman at the end?  why were gunshot wounds to the abdomen like a scraped knee?  ok that's two things.   Note: you cannot see rain clouds 80 miles away.  the horizon is 5 miles distant, 80 miles would be hidden by the curvature of the Earth.  Christian Bale is a bully-he once yelled at an crew member for 20 minutes calling him every name in the book because he knew if the guy defended himself he would never work again.  A real ass.",
            "review_date": "2013-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the beat remakes I have ever seen",
            "review_date": "2013-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma is neat and classy with the impeccable performances of Russell Crowe and Christian Bale.",
            "review_date": "2013-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "awesome movie. Crowe, Bale, and Foster put on great performances. Best western I've seen.",
            "review_date": "2013-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie with terrific acting. You will not disappointed!",
            "review_date": "2013-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Disappointingly old-fashioned.",
            "review_date": "2013-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow! The best western I've seen in years!",
            "review_date": "2013-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good action, and a good character by russel crowe",
            "review_date": "2013-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie of 2007 starring two of the most talented actors Crowe and Bale.  Every character was perfectly cast in this film.  Ben Foster deserves an oscar nomination for his performance",
            "review_date": "2013-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3:10 to Yuma didn't move me as much as I had hoped it would. Christian Bale's character doesn't really progress through the film, and what begins as righteousness becomes more like stubbornness. Russell Crowe's character is confusing and seems to fluctuate as it pleases without obvious reason - is he bad? Is he good? Is he having some kind of redemption? It is definitely hard to discern his motives for ignoring his entire gang in the final scenes - which, to give them credit, were well-done - and then shooting them all.  Confusing, or just lacking explanation.\nAnother point, which is more of personal preference, was that I thought there was too much shooting. Pistols and shotguns are a staple of Westerns - but when they're happily and endlessly fired off at each other throughout the film they lose their impact. Old pistols and shotguns are incredibly loud and modern films really have the technological capability to show us that. I prefer the approach taken by the modern reboot of True Grit, where the pistols are used sparingly and after the half-way mark - we've been waiting for someone to fire a shot, and when they do, it's incredibly loud.",
            "review_date": "2013-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love a good modern western well this is a modern western remake. 310 to Yuma is a must see for western fans.",
            "review_date": "2013-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nowhere near as good as the original.",
            "review_date": "2013-01-02",
            "source": "rt",
            "lang": "en"
        }
    ]
}