{
    "rating": 8.9,
    "release_date": "2007-03-09",
    "num_reviews": 670,
    "genres": [
        "Action",
        "Adventure",
        "Drama"
    ],
    "summary": "In 480 B.C. a state of war exists between Persia, led by King Xerxes (Rodrigo Santoro), and Greece. At the Battle of Thermopylae, Leonidas (Gerard Butler), king of the Greek city state of Sparta, leads his badly outnumbered warriors against the massive Persian army. Though certain death awaits the Spartans, their sacrifice inspires all of Greece to unite against their common enemy.",
    "reviews": [
        {
            "content": "I biasedly love Greek history, graphic, novels, period pieces, and blood and gore, so for me I'll always love this movie.",
            "review_date": "2023-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest action-packed, and graphic novel-based 01 hour: and 57 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2023-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outstanding visuals and  toxic violence. Stunning",
            "review_date": "2023-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite the predictably sniffy critical reviews from some quarters, if this doesn't stir something inside then you must be near clinically dead. This got my pulse pounding like few movies have. Having been a fan of the comic, I personally loved the stylistic directorial choices made and the accompanying score is fantastically rousing. Its well acted and Butler especially really commits to proceedings delivering a fantastic central performance. Something both hugely enjoyable and strikingly different in the overcrowded historical action genre.",
            "review_date": "2023-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched 300 for the first time recently and It was very entertaining. I loved the way it had been filmed and its artistic style. I thought the action scenes were great. I enjoyed the soundtrack. It does has some flaws especially with it's depiction of ancient Greece and at times the Spartans don't come across as real characters from ancient times. Overall, I really enjoyed this film. Time to watch the sequel.",
            "review_date": "2023-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe the movie isnt that good, but i cant say i didnt enjoyed it. Actually I loved it, It's definitely worth checking even in 2023",
            "review_date": "2023-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If yoy think that this is only a holywood unreal hype think again. Inspired by a true historic battle and based on a comic this is a superb movie and the combat scenes are simply poetry in motion. Courage, masculinity, freedom values, military superiority, everything is there. And the spartan way of fighting is 100% accurate. I guarantee that your heartrate will increase several times in the movie. Naf said, just watch it. It's a must see!",
            "review_date": "2023-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zack Snyder adapts Frank Miller's seminal graphic novel with absolute precision and gives us an epic that will never truly age. Beautiful film",
            "review_date": "2023-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A strong, heavy, dark and epic piece by Zack Snyder. The only aspect I dislike is that it doesn't want to give up the tension almost in its full runtime which can be sometimes overwhelming.",
            "review_date": "2023-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It may be historically inaccurate but it sure brings out excellent fight scenes and visuals.",
            "review_date": "2023-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very stylised and visually excellent. The violence might not be to everyone's taste, but those people who aren't into this kind of film won't find it pretending to be anything other than what it is.\nI read some other reviews where people compared it to sin city, and remarked at how it doesn't measure up to the visuals of sin city.\nI agree with this but the graphic novels are quite different, so to compare them like this has no place.\nFrank Miller is a genius when it comes to his Interpretations, I am extremely grateful to live in a time that has the camera and editing technology able to create the movies we get to enjoy nowadays.\nFantasy stories are definitely benefiting from the advanced techniques available.\nI recommend anyone interested in anything I have mentioned here to watch 300 (and 300 'rise of an empire').\nAnd I wait eagerly to see what other books / comics / ideas get given a slick, polished and technically achieved movie makeover in the coming years,,, 🎥",
            "review_date": "2022-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all-time favorite moves, even though this is based on a comic book about what happened in Spart, the Cinnamontography was awesome, and Gerard Butler did a great job portraying King Leonidas.",
            "review_date": "2022-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun but over the top. Great effects and action",
            "review_date": "2022-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stylistic, action-packed and quotable, 300 shrugs through unemotional storytelling and stiff approaches but stands simultaneously firmly on its own legs.",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is spartan ! This line make me powerful",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty solid film. Lots of masculinity that you wouldn't see today. There is a fair amount of sexualising that the film could definitely do without, but it is rated R, so I can't say I'm surprised.",
            "review_date": "2022-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies I've ever seen!",
            "review_date": "2022-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best historical movie. \n300 is a visually stunning movie from zack synder.",
            "review_date": "2022-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best historical movie I've ever seen, would recommend this to anyone who wants to learn about King Leonidus and his Roman Empire and the battle of Troy",
            "review_date": "2022-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Original and unique, violent, and well choreographed. Real good flick. Feels like watching a comic book.",
            "review_date": "2022-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zack Snyder's second feat is the apparent, bloody birth of his defining style that's carried through his films. Visually tasked as a faithful adaptation to Frank Miller's gritty panels spiritedly uplifted by the strong performances, particularly Gerald Butler's recognized strength, fulfilling a simple warrior narrative of honor-fueled battles with incomprehensible subtextual politicism. Admirable nondiegetically but the basic storytelling doesn't offer much when seemingly tried to replicate the previously acclaimed honors that praised \"Gladiator\" amplified unbalanced leaving such a larger void between story and scope. (B)",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A triumph of style over substance, 300 left me wishing for a more subtle script and better historical accuracy.  And there's something immoral about celebrating Spartans as heroes, considering how brutally they enslaved their neighbors and killed them for sport, while demonizing the Persians who often freed enslaved peoples in the lands they conquered from more brutal empires.",
            "review_date": "2022-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As long as you suspend your sense of realism then this is an entertaining watch with great visuals.",
            "review_date": "2022-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very fun to watch the smelly invaders get chopped to bits but lose a star for absurdity and massive historical innaccuracies",
            "review_date": "2022-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is by far one of the greatest movies I have seen in a while.",
            "review_date": "2022-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining and visually compelling.  To me, this put Gerard Butler on the map.  It's not surprising that this testosterone fest has antsy critics up in arms.  The action sequences are good.  The characters are interesting.  I've come back to this one a few times because it's special.  Some might be right to call it a masterpiece.  I like this work and I may come back to view it again some day.  Lena Headey is nice in it too. Great cast.  Well done.",
            "review_date": "2022-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Violence and bloody. 300 tells the bloody story of Spartan's myth of stopping the Persians that changed the course of the war.",
            "review_date": "2022-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's really not that great of a movie. But the fight scenes are awesome and the main actor does a fantastic job playing Leonidas. I do own the movie and I do watch it again from time to time.",
            "review_date": "2022-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An ancient Greek legend rendered in epic strokes and amped up on comic-book steroids, this film adaptation of Frank Miller's graphic novel is a most thrilling popcorn film, Zack Snyder's magnum opus of men and honor and freedom. He starts things off with a vivid prologue--the grueling training of Spartan boys to become Spartan men, warriors, and even the Spartan King. As King Leonidas, Gerard Butler gives a career-making performance, growling and shouting his lines (spittle and all) and chewing threw the scenery with a savage gusto. He and his chiseled cohorts leap and lunge across the screen in slo-mo balletic battles of steel meeting flesh. The action is assaultive, and Snyder kills off friend and foe alike, with no details of the carnage spared. Lena Headley makes an impression as the Spartan Queen, a woman as flinty as the men in her orbit. Rodrigo Santoro makes the villain Xerxes a towering pierced demi-god with fey tendencies. Miller's wonderful hard-bitten dialogue, sometimes ripped from the real events (according to historians), makes it to the screen intact. It's not textbook history, more like a legend filtered through a comic book, so history a few times removed. But from it's engrossing opening to its inspiring finale, Snyder's film is striking and downright thrilling, one of the best comic-to-screen adaptations ever made",
            "review_date": "2022-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie, the acting right down to the narrator was epic.",
            "review_date": "2022-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even if you look past the leather speedos and other ridiculous inaccuracies, still an excruciatingly paced mid 00s edgy teen's idea of cool that didn't hold up at all. Cgi was good but could have been more enjoyable if everything didn't look like the lens were smeared with some brown substance.",
            "review_date": "2022-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a pretty cool movie. This! Is! Sparta!!",
            "review_date": "2022-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"300\" is, admittedly, not perfect. It's flashy at times with its slo-mo shots of Spartans and Persians shedding blood. It is also rather cheesy at times with its sexual scenes and sometimes (forgivably) dated effects. And it takes its manliness to quite an extreme (you have to be completely hard and cannot show weakness at all to be a man), but in the words of Leonidas, \"This...is...SPARTA!!!!\". We are dealing with a tough ancient Greek civilization here, so of course many of their practices, values, and beliefs would be outdated; however, it is not the most historically accurate film, to say the least. But from what I see, it's not aiming to be a historically accurate film.\n\nIn the end, Dilios's speech makes it is made clear what \"300\" is: a tale of courage and triumph. Butler's performance as Leonidas easily takes the cake as the best in the film. There's a sense of pride, strength, brotherhood, and courage in his own words and actions. He manifests who the Spartans truly are (at least in the film). And Bates's musical score is honestly pretty darn sick.\n\n\"300\" is a pretty cool and fun movie, and a bit more than that with its themes. I'd recommend it.",
            "review_date": "2022-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Far from perfect but my favourite movie from Zack Snyder. I hear a lot of flack over the \"fantasy\" elements involved but it is a representation of rumoured storytelling between Spartans. You will probably enjoy this movie.",
            "review_date": "2022-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Old classic that completely destroyed it's competition.",
            "review_date": "2022-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Full of racism, ableism, xenophobia, machism, white-washing... It is not historically accurate. Everything bad you can imagine, this movie has it. \nIt's a Zack Snyder movie so you cannot expect much.",
            "review_date": "2022-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolute gorefest that tells a surprisingly emotional story, \"300\" stands as one of the best of these modern epic tale films (such as Troy or Kingdom of Heaven). The powerhouse cast and the fantastic directing style of Snyder help this movie to soar in its visual appeal. Story did feel a bit lacking, however, and like many other films similar to this, the characters feel very one-dimensional. Still, though, the action has you hooked and the worldbuilding leaves audiences desiring to see more. I also thought that the film shockingly hit a lot of the epic notes that it tried to hit, which is not something many movies accomplish. CGI felt outdated, though it is excusable considering when it came out. Overall, really loved this film and want to see more like it.",
            "review_date": "2022-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my all time favorite movie. The most epic war film ever made.",
            "review_date": "2022-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you don't like the Zack Synder style that's understandable. But it's just one of the best magic-real stylized action films there has been. It's a kind of movie which was overdone and and worn thin, but this is one of the best.",
            "review_date": "2022-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was cool until they pulled out ogres and pig mfs",
            "review_date": "2022-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If the Spartans told their tale, this is what it would have sounded like.",
            "review_date": "2022-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 is just about what you might expect. Lots of uniquely colored cinematography, a plot that is slightly above average, and some battle sequences that are stylish and engulfing. This is pure Zack Snyder. It’s not a prefect film, but hearing Gerard Butler readying his men for battle should send shivers down anyone’s spine",
            "review_date": "2022-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm sorry but it was horrible.",
            "review_date": "2022-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's not exactly the best movie, mainly do to the amount of slow-mo. I think it got a bad rap do to the amount of fantasy elements to it, but you got to remember that its being told by a Spartan as propaganda, I mean Herodotus the greek historian exaggerated some of the things in his telling of the wars because he was a greek.",
            "review_date": "2022-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zack Snyder's vision and style of directing was beautifully demonstrated in this film! The camera shots and coloring, the grand battle scenes, the dialogue and narration, all of it stood out!! While I am not normally into studying this time period or location, one does not need to be to like this movie! This and Gladiator are the best swords and sandals movies there are and no other movie has been shot like this!",
            "review_date": "2022-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot is simple but that's a 300 strong point, as are the stunning visuals and thrilling fights. It's the first one I'm surprised by Zack Snyder's direction. (8.5/10)",
            "review_date": "2022-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've had this on my watchlist for like a decade at this point. Finally saw it in 4K and was disappointed. I didn't expect a great story but I at least wanted cool action and dope visuals. Sadly, almost every aspect of this peaked at just being pretty good",
            "review_date": "2021-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good docudrama on Sparta.  It is also great if you like men glistening wearing leather shorts.  I wonder what market that was aimed at?",
            "review_date": "2021-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Historically inaccurate, bad acting, cheap visual effects. waste of money and time",
            "review_date": "2021-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 is with no doubt one of the most epic movies of all time. Gerald batler gives an excellent performance and delivers Leonidas as a true warrior and king with a lot of sarcasm, and its perfect. I know that a lot of people rae saying that the movie was historicly incorrect,and yeah in a lot of things it was but for me thiw is not the point. They weren't making a documentary but a movie with actors. The battles of the movie were awesome and the slowmotion that zack snyder is using flawless.",
            "review_date": "2021-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't remember, is this Sparta?",
            "review_date": "2021-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One hella awesome movie. Story is incredibly good, script is amazing, same thing for the acting. Definitely one of Zack Snyder's best movies he's directed. 4/5",
            "review_date": "2021-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only movie that will give you the true meaning of the glory.",
            "review_date": "2021-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The visuals are extraordinary! I'm not sure why but I love this movie.",
            "review_date": "2021-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'300' is pretty much a perfect movie at doing what it does -- the caveat is that it doesn't really attempt much except be a unique and entertaining moviegoing experience.  The story is well-enough written but is ultimately very shallow, the themes are that of the most basic pulp comic or genre movie, the characters are charismatic but largely one-note and the world is oddly bleak yet gorgeous to look at.  This movie is, I believe, only the fourth movie to adopt the \"Only the actors and what they touch is real\" approach, previously only done in Casshern, Sky Captain and Sin City (in that order), and it makes EXCELLENT use of this.  The ability to combine performers into a large setpiece, via Post Production trickery, into a physical space that does not actually exist, is something that is always wonderful to look at when done correctly and done in service of the narrative, and 300 is still a great looking movie today.  It's also immensely satisfying from a Cathartic Action Movie perspective, as there are many moments you want to cheer the heroes on when the going gets tough.  And it ends on a fantastic note that goes from bleak to outright inspirational.  The problem, really, is that the movie is ultimately surface-level -- it's fun as hell, it's stunning from both technical and artistic perspectives, and it's emotionally satisfying, but it's also very basic, and if you aren't into this kind of (Ultra) Larger Than Life action movie, then I recommend you stay away.",
            "review_date": "2021-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Gerard butler performance on a great movie that tells a true story, the fights well excuted , memorable dialog, recommended.",
            "review_date": "2021-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest movies ever, Zack's got balls for making this.",
            "review_date": "2021-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw this movie in theaters and I will always remember seeing this in theaters because it made such an impact on me at the time. Zack Snyder never disappoints! Such an amazing director and the casting was also great. Snyder is always putting out really good films. Definitely one of my favorite directors.",
            "review_date": "2021-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's got style, I'll give it that much. Unfortunately, the film isn't as action packed as it should be and suffers from fairly dull, simple plotting that's not nearly as engaging as it could be.",
            "review_date": "2021-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best war movies ever, in par with Gladiator.",
            "review_date": "2021-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Way too slow, too boring and too gory, too much slo-mo. Good cinematography though.",
            "review_date": "2021-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THIS IS SPAAAARTAA! Its on of my favourite movies, always a good choice for a lazy Sunday afternoon.",
            "review_date": "2021-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Put the man on the map, but sadly, other than \"Law Abiding Citizen\" , it's been a pile of utter shit since.",
            "review_date": "2021-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect.... Just it.",
            "review_date": "2021-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THIS IS SPARTA!!! Yeah, must watch film.",
            "review_date": "2021-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is ageing well. An audience now more accustomed to CGI is better able to recognise there's true beauty and art to the scenes in this movie.\nThere is a sense of watching a different epoch of man, before any glimpse of our current civilisation emerged.\nGerard Butler is the man who can with or without the critics approval, just look across the board at the audience ratings on his films. He has good range and is a very convincing and charismatic performer.\nOne thing that has really struck me is how unusually deep the scenes imprinted on my memory. I saw it once 15 years ago yet remembered every scene, visual detail and character's conversation. That's odd! It may be a result of the memorable visual style.",
            "review_date": "2021-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie does not portray any historical facts, all fictional characters and events.\n\nIt could be a mediocre comedy movie.",
            "review_date": "2021-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is the defintion of awsome",
            "review_date": "2021-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stylish to a fault and occasionally stirring, 300's emphasis of style over substance unfortunately can't help but make it feel fake.",
            "review_date": "2021-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its good but not great",
            "review_date": "2021-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "FANTASTIC movie for its time, largely due to its the stylistic choices and cinematography.\n\nSet in a time when the sword was far more important than the pen, this movie captures the essence of brutal, bloody combat thousands of years ago.\n\nThere is enough character element for you to feel connected to the 300 in their fight for survival. \n\nThe CGI is now dated, but nonetheless a cracking, easy-to-follow watch.",
            "review_date": "2021-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very cool story, artistry, and action.  Very violent.  Excellent comic book style movie, based on a Frank Miller graphic novel, similar style to Sin City.",
            "review_date": "2021-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A touchstone of cinematography.",
            "review_date": "2021-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm really glad I watched this movie after growing up. I learnt about this movie as a kid when I watched the Deadliest Warrior episode, Spartan vs Ninja. They told about how Spartans were made famous with 300, so I thought I should definitely give it a try. I didn't even start watching it as a kid, since I found it so boring in the first five minutes. And I'm glad that I did, because this movie has a lot of things the 10 year old me would have hated to see. And as an adult those very things are what I like to see in this.\n\nSimple review: This movie is metal. Yeah, that's all I could say about it. The grim tone, the bleak colour palette, the narration going on in the background which made it sound so melodramatic, the whole depiction of Persia in itself, the amount of slow motion violence - all of this is too much to handle for simple audience. For someone like me who is a big fan of Zack Snyder's style of cinematography, this is fantastic. Such movies give the feeling of those grim looking paintings which I love to see and feel nostalgic.\n\nThe thing about this movie is, it's not relying on the storytelling. The story is absolutely simple - The Spartan king Leonidas refused to bow before Persia and even killed their messengers. So now Persia is coming to crush them with their 10000 soldiers and beasts. Leonidas fights them back by handpicking 300 of his men. That's it. This is the story. And now they fight, which is the epic part. Like I said, as a kid I'd have hated it, and that's exactly what I'm talking about - the Spartans are completely naked and wearing red capes while the Persian Immortals are wearing black, and the Spartans kill them. They also kill the animals like rhinos, elephants and horses. These are why I'd have hated this movie as a kid.\n\nThere are many other things that this movie showed that I'd have hated as a kid, and these reasons are the same as any other family audience (I mentioned the reasons which were only specific to me before). The sex scenes, the slow pacing, the handicapped man whom Leonidas didn't let fight (I forgot his name), Xerxes and his army's camp with a goat man and weird stuff happening (people may not hate it, they'll just not get it). In the end it's told that all of this was just a story to motivate the soldiers. This is the reason why the story was demonising the Persians and portraying the Spartans as the heroes.\n\nThe thing about Zack Snyder's movies is that you can really enjoy them if you rewatch them. Because then you'd already know the story and you can just focus on how cool everything is looking. It's a pity everyone I know whom I can recommend this movie has already watched it, but at the same time it makes me feel nice about how popular this movie is. It literally made Spartans into a pop culture icon. If Leonidas were to somehow come back and see how this movie has portrayed him, he'd be really proud.",
            "review_date": "2021-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My first touch on Zack Snyder uncredible visuals. And the way he was able to draw Franck Miller graphic novels.",
            "review_date": "2021-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies! Must Watch",
            "review_date": "2021-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Let's be honest - this is Snyder's best movie for sure. It's not the best thing in the world, but it's a perfectly serviceable adaptation of the history of this era.",
            "review_date": "2021-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too much fun and a simple and great premise.",
            "review_date": "2021-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 - 8/10. Zach Snyder's visually based war film is his career defining film, which helped launch his career to the next level, is a movie that is designed mainly for visual viewing. 300 is not historically accurate, or even meant to be. What it is is a movie that is purely meant to showcase the carnage and graphic nature of the Spartans fighting in the respective war that is presented in the film. Based on the iconic graphic novel by Frank Miller, the movie follows the Spartans as they prepare their 300 soldiers to fight in their last war. As they do so, we see the tensions and mentality of the warriors. Snyder showcases his soon to be iconic visual style through this film. Though he debuted with Dawn Of The Dead, this film is the one that really showed the director that he would end up becoming. His flair and ability to get some really great shots is fully showcased in this movie. Gerard Butler is iconic in the role as the leader of the Spartans. Its quite sad that he never was able to sustain his popularity after this film, as he had great screen presence and poise as the lead in the film. Definitely one of the better graphic novel adaptations in recent years, and quite possibly Snyder's best film.",
            "review_date": "2021-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed this movie even if it was mostly just because how god damn epic it was. The fight scenes are really cool and don't involve a million little jump cuts so you can actually tell what is happening in the battle. There is a lot of slo mo in this movie, I think I saw that there's almost 30 minutes in total, it didn't bother me while I was watching but have seen criticism about that. Good acting and story, even if the writer and director took a lot of liberty to add weird elements. Gerald Butler having a Scottish accent in Sparta is weird but oddly works super well and just makes his speeches more epic. Just an epic movie that does more right than wrong.",
            "review_date": "2021-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have this soooooo many times!!!!",
            "review_date": "2021-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect film in its genre. ",
            "review_date": "2021-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yay violent cartoon movies are a thing now",
            "review_date": "2021-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By far Gerard Butler's best movie, Michael Fassbender and David Wenham are also magnificent!\nProbably along with his unedited version of Justice League this is Zack Snyder's best movie.",
            "review_date": "2021-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece in visuals and style. The story is not complex but then it is based on real events in ancient times. When was the last time you gave the ancient greeks a thought? Zac Snyder reminds us where our stories originate from in a masterful way.",
            "review_date": "2021-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a story of strong proud European men fighting off the hoards of Arabic and desert forces,. A good symbol or allegory for what we should be doing today to take our lands back.",
            "review_date": "2021-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Story telling, color grading, visual, cfi, vfx, cinematography in this movie is like the all pictures of 300 comic book of Frank Miller in wide screen of cinema.",
            "review_date": "2021-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all time favourite films, I've seen this 30+ times and still love watching it.\nIts a classic good versus evil tale of 300 Spartan soldiers taking on the invading Persian army. \nShot in a comic book style, its full of violence guts and gore.\nNo Oscar winning performances but who cares with a body count like this.\nGerard Butler is the ultimate hero as king Leonidis,  who's motivational speeches to his soldiers would make me pick up a sword and kick some Persian ass.",
            "review_date": "2021-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The non stop action, the cinamatography, and Gerard & Zack . An awsome movie!!!!",
            "review_date": "2021-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Lots of action and violence. Also, the way this movie was made with the mix of slow motion & CGI really worked well. Great acting too!",
            "review_date": "2021-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "INCREDIBLE!!!\n\nI RECOMMEND TO YOU...",
            "review_date": "2021-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not at all bad! If the film was shorter it could be considered the best 'short film' ever made. but only so much CGI scenery can be taken for so long....",
            "review_date": "2021-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THIS IS SPARTA!!!!!!!!\nAmazing movie.\nLeonidas and his 300 are legends!Forever remembered from their ultimate sacrifice!\nOutstanding performance by Gerard Butler!!!!!",
            "review_date": "2021-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Every frame of this fil is worth hanging in yoir walls. Great visual story telling",
            "review_date": "2021-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gerard Butler was worried this movie would suck. Well it does.",
            "review_date": "2021-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overall a great film ,save for a few moments that seem to jump past plausibility,even in a semi fantasy film of this nature.",
            "review_date": "2021-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most fulfilling film experiences ever.",
            "review_date": "2021-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually stunning in every way you could think.",
            "review_date": "2021-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 is a fantastical interpretation of a fantastical point in history, and I see no reason why it can't be just that, it's important to know the motivation behind a film and what it wants to be - and for what it wants to be, 300 passes with flying colours; the colour red to be precise, and lots of it!",
            "review_date": "2021-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie full of action & bravery. When I left the theater I was full of adrenaline.",
            "review_date": "2021-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you are looking for a natural testosterone boost, then look no further. Although not historically accurate, the movie pays homage to Frank Miller's graphic novel beautifully. Great dialogue and a stellar performance from Gerald Buttler.",
            "review_date": "2021-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excellent and faithful adaptation of the graphic novel. 300 is a visually stunning and action packed adventure that is just straight up cool! Butler's performance along with all the other characters make this an awesome watch!! Dramatic! Mythic! 300 is awesome!",
            "review_date": "2021-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie, excellent direction of Zack Snider.",
            "review_date": "2021-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's just not my kind of movie. There's some neat ideas here but the story is paper thin. I think it's geared toward teenagers more than anyone else. I made it about 3/4 of the way through and realized I no longer really even cared what happened. It's pretty dramatic and just too over the top for me.",
            "review_date": "2021-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Special Effects: 1,0/Sound Effects: 1,0/Acting: 1,0/Story: 1,5",
            "review_date": "2021-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you want to get into a kind of meaning you could perceive the movie as a cautionary tale about the subjectivity of history. The story is told entirely through a recount by Dilios (the only surviving spartan) to many other greeks, so it makes sense he'd embellish the story to inspire his countrymen, but as he was apparently the only survivor his exaggerated story is taken as fact. In essence it's a warning not to take everyone's account of history at face value, or you may end up believing something just as ridiculous as this movie without even knowing it. or you could see it as a fantastic action movie and nothing more, still awesome either way.",
            "review_date": "2021-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is jot a comic. It is most certainly  not a documentary. Yet it's a movie of glory for you and the boys to watch before you serve your country in the next World War.",
            "review_date": "2021-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a mindless, revisionist movie. Utter crap.",
            "review_date": "2021-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie. One of my two favorites. I've watched it several times with different people. My other favorite is Braveheart. I've watched that one 4 times.\nGuys, gather your buddies and watch it, or your wife if she is tough like mine lol.",
            "review_date": "2020-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film is about 300 Spartans against the overwhelming odds of the Persian Empire. Persians want to take over the Greek lands, led by God-King Xerxes. They started to land on the Greek beaches, but, King Leonidas of Sparta met them with his best 300 warriors. The reason for this is that the Oracle said that Sparta could not go to war during a religious festival. So the 300 warriors were classed as Leonidas personal bodyguards.\nWhen the Spartans meet the Persians in the first fight no Spartan died, they slaughtered the Persians and the survivors were forced to go off the cliff, as quoted, \"they were thirsty for water\". The massive Persian army used archers to \"block out the sun\", original information from Herodotus rendition of the battle. The Persians also used their elite troops called \"immortals\", which King Leonidas said ‘\"let's put that to the test\", these troops cause Spartan deaths. The Persians also used their, magic, elephants and rhinos, and mutant humans to try and kill the Spartans. Xerxes was not pleased with his generals and killed them by cutting their heads off.\nEphialites betrayed his country for gold by telling God-King Xerxes of a path around the Spartans to trap them. The Persians surround the Spartans, King Leonidas first of all kneeled down to Xerxes, but Leonidas got up and threw his spear which grazed Xerxes mouth. Xerces couldn't believe that his blood was spilt and it was red like a normal man's blood not golden like a God. All of the Spartans got slaughtered by the Persian archer's arrows. However, before the fight King Leonidas let Herodotus go back Sparta so he could tell the story.\nLike in Herodotus tale the film is the same, bigging up the story of the 300 Spartans. The film does this by making the animals and the beats from the east considerably larger then in real life. It also does this by, making Xerxes being taller then he actually he is, they made him out to be a massive seven foot God King. The immortal elite Persian soldiers were actually mortal but they looked like goblins and mutants to make them bad. Ephialites is shown as a very goblin like Voldemort (from Harry Potter) turtle back man, when really he was potentially a man who betrayed the Greeks. This is how the film represents Herodotus story. \nIn my opinion, it was good but there was not enough battle scenes, it waffled on too much. It could have had longer and more gory battles, were you actually get to see intestines come out. I rate the film six out of ten. I would recommend people who are in to history to watch it, as I think it follows the story that Herodotus told. I don't think we'll ever know the complete true story of what happened.",
            "review_date": "2020-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overhyped and overrated, 300 is a microcosm of the worst aspects of both Zack Snyder and Frank Miller.  Yes, it's visually striking; to the point of being able to pull the wool over the eyes of the audience in regards to its one-note characterizations, poor writing, and frighteningly blatant fascist, homophobic, and racist undertones.",
            "review_date": "2020-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was awesome. We'll fight until the end.",
            "review_date": "2020-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "AMAZING!!! The adaptation to the graphic novels to the film is spectacular ",
            "review_date": "2020-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A visually striking, 2-hour rush of cinematic testosterone.",
            "review_date": "2020-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "as a great man once said \n\"don t let facts get in the way of a great story\"\n-someone, idk i think he killed like 10 people\nthe movie is extremly unrealistic but it s not like it is saying otherwise, it doesn t start with \"based on a true story\" because it knows, it just knows but tbh the cinematography, story, characters AND ESPECIALLY THE ENVIRONEMENT and the colors is great and that is something they couldn t have done if they tried to stay true to actual evenements",
            "review_date": "2020-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super fun action movie with plent violency and cool fighting for you to enjoy.\nHistory is just war history, negotiation, preparation, fighting to the end.\nVery manly movie with a lot of action.",
            "review_date": "2020-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An insanely wild and awesome ride that is entertaining, violent, and amazing to watch from start to finish.",
            "review_date": "2020-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Arguably the best of Snyder's films and perfectly illustrates what he is best suited for: adapting an established IP and staying away from original stories, (see Suckerpunch for further clarification). What works exceptionally well is the portions of 300 directly ripped from Frank Miller's visceral graphic novel and extreme bouts of violence. What doesn't is all of the additions. The added subplot that's virtually missing from the original source is bland and unnecessary, severely slowing down it's pacing and ultimately feels like padding.",
            "review_date": "2020-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing visually and a really fun watch.",
            "review_date": "2020-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What is your profession",
            "review_date": "2020-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A reasonable watch telling an epic tale...cant go wrong with gerard butler in this situation",
            "review_date": "2020-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The battles throughout this movie are very bloody and there's some amazing fight scenes not going to lie.",
            "review_date": "2020-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorites, great movie.",
            "review_date": "2020-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a great war film with a powerful true story, turned into comic-book fun. It is visually stunning.",
            "review_date": "2020-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great stylish action film",
            "review_date": "2020-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another massively overrated film by the audience - in this case the critics score is far more accurate. My biggest complaint with 300 would be the terrible visual effects that are present in every scene. Almost nothing is real and none of the effects look good. The edits in post to the colouration/contrast ruin the otherwise decent cinematography. In places the cinematography is actually solid  - such as the zooming in and out using two cameras with different lenses for some of the fighting shots. However, the visual effects and editing unfortunately make this film feel like it was done on a very tight budget. Some of the props look fake as well. There was even more botched editing with the villain's voice that was blatantly tweaked to make it sound deeper. The cast was impressive, but the acting was average although Gerard Butler, Michael Fassbender, and some of the other Spartan soliders did a decent job. The plot was fine although I didn't like the introduction or any of the narration - the introduction could have been much better, and narration shouldn't have been used. Some of the dialogue wasn't great, and the film could have been shorter. It didn't come across as historically accurate, but it probably got some things right. I really didn't get the use of the deformed people and why King Xerxes was portrayed the way he was. 300 has a lot of problems and frankly deserves a lower rating than 3/5.",
            "review_date": "2020-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was and still is my favorite fighting movie",
            "review_date": "2020-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it is true that the movie is not very historically accurate, if you were expecting a documentary you are watching the wrong movie.  The movie is very stylized, that is expected from the makers of Sin City.  Again, what should have been expected going into the movie.  At its core, it is a very entertaining movie, with lots of quality action and violence that is highly appropriate for the subject matter.  The performances, while not particularly impressive, are certainly sufficient for the movie.",
            "review_date": "2020-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The look, feel, and combat make 300 a really cool movie.",
            "review_date": "2020-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is NOT A KIDS MOVIE VIEWER DISCRETION IS ADVISED may contain some scary scenes",
            "review_date": "2020-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun action movie based on a comic. This movie was iconic in the 2000s and still is fun to watch. Not the greatest movie ever but worth seeing.",
            "review_date": "2020-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bloody, violent, visually impressive, and insanely quotable, albeit historically inaccurate and narratively dissonant historical action drama of epic proportions.",
            "review_date": "2020-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best Epic movie ever made.. Leonidas was portrayed in the perfect way!",
            "review_date": "2020-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved the fact that It'sbased on a true war. Everytime I'm done watching it I want to pick up a spear and sword and kill some enemies.",
            "review_date": "2020-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super awesome battle scenes and an epic story.",
            "review_date": "2020-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Lots of adventure and action!",
            "review_date": "2020-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think it's safe to call 300 a future war classic. While it is inferior to the previous Frank Miller comic book adaptation of Sin City (2005), it's still a good movie. It isn't the most historically accurate pic out there, and it even incorporates some elements of fantasy and Greek mythology. But that actually gives the movie a nice little spin to it. And while the characters are pretty thinly written, Gerald Butler from the future Law Abiding Citizen (2009) gives a memorable lead performance. And you can obviously tell that it's based off shot for shot of a comic book, the green screen gives it a certain, original and even artistic looking style. And you can't forget to mention the brutal, gritty and violent action scenes of its battlefields. Overall, 300 is an interesting look at ancient Greek society and a historically big battle, and especially for war film fans, this one is recommended!!",
            "review_date": "2020-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is perfection.",
            "review_date": "2020-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "zero stars. 300 is an insult to all things great and movie.",
            "review_date": "2020-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"This is SPARTA!!!\"\nThat line is probably one of the most well written lines in all of movie history. This line single handedly makes the movie great.",
            "review_date": "2020-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not saying its good. But it will be remembered, because the impact the movie made was felt far beyond its initial box office run.",
            "review_date": "2020-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic and perfect.",
            "review_date": "2020-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My teenage self was entertained back in 2007.",
            "review_date": "2020-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "excellent adaptation  of the frank miller graphic novel Snyder translates the comic to the big screen perfectly",
            "review_date": "2020-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Way better than Meet the Spartans!",
            "review_date": "2020-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptional thrilling emotions and the sense of greatness thread their way to the front, it's a must watch epic journey.",
            "review_date": "2020-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superficially watchable, the movie takes so many liberties with fairly commonly-known facts about this pivotal battle that it leads anyone with any care of history feeling somewhat contemptuous towards the film-maker. Zack Snyder is portraying a barely-concealed piece of anti-Iranian/Persian propaganda and belittles the achievement of the Greek defenders by denigrating The Immortals and implying that they're no more than drug-hazed zombies. I say Greek because the 300 Spartans were far from alone, much outnumbered by Greek allies from other city-states, those that Gerard Butler's Leonidas condemns as farmers, potters and blacksmiths. Those same Greeks would beat the Spartans as often as they lost during Greece's frequent internecine wars. Not recommended for anyone out of their teenage years.",
            "review_date": "2020-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like to re-watch this movie every few years, as I find it highly entertaining.",
            "review_date": "2019-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It should not be taken as a historically accurate depiction of the actual event. It's not. It's an adaptation of a graphic novel  but it's a good film. Abit over the top, as you would expect it to be. Its exciting, exhilarating, and graphic. Some stylish fight scenes and great commentary. Its basically a graphic novel on the screen. The historical inaccuracies dont really take anything away from the story. Like the depiction of the Persians as being more monster then man. The immortals as wearing black and face masks. Which isnt accurate. The immortals look like they use Japanese Wakasashi. Which is a type of steel age sword that hasn't even been invented yet. All in all, it's a good film. Give it a watch. \n\nPersian emissary- \"Our arrows will blot out the sun!\" \n\nSpartan warrior: Then we will fight in the shade",
            "review_date": "2019-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An epic story. This is Sparta!!",
            "review_date": "2019-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Real direction of Zack Snyder",
            "review_date": "2019-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When i watch a action movie about a underdog i usually want him or somthing to go well the only good thing about his movie is that there is great action but who cares the guy your rooting for sees his own son die his wife gets raped by his \"friend\" its honestly such a stupid ass movie. Nothing he does in the end was worth it. it was as meaningless and sad as my own existence. honestly disappointed.",
            "review_date": "2019-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On this occasion my rating does not reflect how good this movie is, rather how much i enjoyed watching it. Monstrously violent combined with insane amounts of slow motion, 300 will never pass as a great film but possibly as a guilty pleasure kind of picture.",
            "review_date": "2019-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Movie Is Great , Great Ending , Plot , Characters , Fights and The ENDING",
            "review_date": "2019-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic and groundbreaking, a must see",
            "review_date": "2019-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For Sparta of course",
            "review_date": "2019-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A dramatic and entertaining film about one of the most interesting battles in world history. The 300 delivers a bloody story about the 300 Spartans that is well worth the watch. The film is shot well and looks fantastic throughout.",
            "review_date": "2019-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Manly. Utterly manly and triumphant in its defense of Europa against the unwashed hordes beyond",
            "review_date": "2019-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie. Well directed. Excellent story line. Extremely disappointing ending.",
            "review_date": "2019-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Total guy movie, love the vision and presentation, not to mention the action",
            "review_date": "2019-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The visuals in this film are an orgiastic feast for the senses.",
            "review_date": "2019-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don`t know how many times I saw this movie, and I think its like wine...when older, its getting better.\n",
            "review_date": "2019-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining movie with great graphical cinema and a great performance by Gerard Butler who really uplifts the movie with his performance.",
            "review_date": "2019-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie that show again the critics just need to write for other critics and can be ignored. This movie is action packed and if you are a fan of graphic novels, it pays the appropriate homage.",
            "review_date": "2019-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "violent film about the 300 Spartans at the thermopylones who faced the Excito of Xerxes. Deep motion film and fairly linear plot very similar to a video game with increasing difficulty levels",
            "review_date": "2019-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring one dimensional movie with terrible acting. I've seen better acting on porn hub",
            "review_date": "2019-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of Zac Snyder's Memorable and moving greats in Narrations, war sequences and cinematography. Not for the faint of heart, gripping war movie for Spartan Freedom. Excellent dialog through and through of Greek politics and a challenge of belief systems in their own country as well as Persia. ",
            "review_date": "2019-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't dig too deep into the acting and simply appreciate it for the outrageous styles, action and violence........This is Sparta!",
            "review_date": "2019-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everything about the movie is so flawlessly dumb. They try to be epic, but it just crashes and burns. I bet if you've seen it, you already quote: \"This is Sparta\" and that seems to be the only saving grace from it. The fights are abhorrently dumb in slow motion. The characters costumes don't look right. Everything is just bland with people arch's. It was filtered with CGI and it makes it pandering to audiences. If this is what 300 looks like in history, someone needs a textbook instead of something made up. It seemed scripted with only sixteen year old's minds. Everyone raved about it. I saw it, and I found it crummy and bland. That sums it up. It's just a bland movie.",
            "review_date": "2019-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie will definatly grab your attention throughout. its loud, action packed, and will get your eyes locked onto the TV. ",
            "review_date": "2019-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all time favs!!",
            "review_date": "2019-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "surprisingly good, lots of blood and great visual effects.",
            "review_date": "2019-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing action with a easy to follow story that results in an inspired mythmaking.",
            "review_date": "2019-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love zack's directing",
            "review_date": "2019-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'd say this goes under the definition of a \"man movie\". It has shredded guys with swords, violence, battles, blood, all that good stuff. The Spartan army was known to be an indestructible force that never gives up, and they really stretched that idea in this film, to the fact that it was pure enjoyment. The action was fun, the dialogue was good, and the CGI was classic comic-book style. Now, this isn't completely accurate, Spartans didn't have six packs or were completely hairless from the neck down. And you can clearly tell that some of them had British accents. Aside from that, the movie did bring joy to my dad and I which was nice, and there was definitely memorable dialogue choices and action scenes. Most questions weren't answered so I did leave off with a question mark hovering in my head but it wasn't a total letdown.",
            "review_date": "2019-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched it again, today. Fantastic how CGI and action scenes are maded in 2007!",
            "review_date": "2019-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This quote-heavy historical action epic may have visual flare and bloody violence to spare, but isn't nearly as polished as it could be and often likes slow motion over smooth camerawork and historical accuracy.",
            "review_date": "2019-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well adapted telling of the Frank Miller classic graphic novel. Shots are stylized to look like a live-action comic.",
            "review_date": "2019-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think it's funny that all of the critic reviews dislike this movie and yet almost all of the audience reviews loved it but isn't that how it goes most of the time. I for one loved and still love this movie even though I'm a girl who usually can't handle this type of movie. The violence and the fighting is not my cup of tea and still I couldn't get enough of 300. I think that says something about just how good this movie really is. It's not all fighting either and has a really interesting side story going on. Even the fighting scenes I loved because how can you not love something that badass?! I loved the bits of humor they incorporated into such a serious situation. Gerard Butler was meant to play this role and it shows in a big way. His wife the queen was brilliant as well I'm not sure what the actresses name is but she was great. It just all comes together and works in a big, spectacular and ridiculously entertaining way! In my opinion the critics who dissed this film must be total squares.",
            "review_date": "2019-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Presents Frank Miller's graphic novel in cinematic form !00% faithfully. Some may say it's historically inaccurate and somewhat offensive but remember, it's based on a comic book. Plus, the story's told from the Greek perspective, who saw the Persians as foreign barbarians (or anyone else for that matter).",
            "review_date": "2019-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie. the visuals are spectacular. The action scenes are incredible. This movie is a perverse hedonistic thrill ride.",
            "review_date": "2019-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everyone seems to love this movie. I found it a tad better than terrible ",
            "review_date": "2019-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was a bit disappointed by this, I followed the hype, yet I was disappointed. Was hard to care for the characters to me. The movie had some cool scenes, but not much substance in my opinion",
            "review_date": "2019-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 was as pathetically puerile as I had expected.",
            "review_date": "2018-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie never sets out to be anything other than a fun visceral gore fest so watch it as one. It's a fun visually stunning action film of macho men doing macho things in a macho way. Anything else in the film isn't great but it isn't awful either. Watch this movie how it was meant to be watched and you will have one hell of a time.",
            "review_date": "2018-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best Zack Snyder movie besides Watchmen",
            "review_date": "2018-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bunch of metrosexuals walking in the dessert...It was good for 15 minutes, after that, it becomes unbearable...",
            "review_date": "2018-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best in the action/adventure genre, a masterpiece in its own right. nothing could be improved upon.\n\npeople giving this a negative score should revisit their reasons for watching it.",
            "review_date": "2018-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily Zach Snyder's best film. The cinematography is absolutely incredible, the fight scenes are breathtaking, and Gerard Butler makes me want to run to the gym and bench press eight-thousand pounds.",
            "review_date": "2018-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It felt really artificial...like a cheap impersonation of Lord of The Rings.",
            "review_date": "2018-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Zack Snyder movie of all time. Much more better then his new DC projects.",
            "review_date": "2018-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How are the ratings not at least to 95%?  Best movie",
            "review_date": "2018-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely an awesome Movie in Movie History!",
            "review_date": "2018-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my opinion its not only a violent movie but a historical . If any one want to make a historical movie like this they shoul first search and read both countries history. In Iran we say its racism. This movie aint right so me and my people about 80 million people hate it!! Persian armies were the moat powerfull armies in that time.we had a thing which no empire has;we had \"Tradition\" like Egyptions. We had Darius and Cyrus. Cyrus wrote the very first human rights law named \"Cyrus Cylinder\". How come an empire who has noticed human rights and they never ever attacked  innocent people and wives and children can be called monster? Why persian army are like the winter in game of thrones!?? We werent monsters or wizards we were the ones who taught people how to be great.maybe nowadays we have some politic problems and I completly accept the fact that Qajar dynasty was the worst dynasty ever and they lost half of our country because of their laziness and lust or any other damn reasons. I think the movie shouldnt have said its Persian army. Thats just a vilainious army that faught against th other army. We respect and love those days of persia and we cant just bear the best years of our country get introduced the worst possible way.",
            "review_date": "2018-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So stupid, but fun and pretty... kinda.",
            "review_date": "2018-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this movie. \nZero fucks given to your ratings. Peace out.",
            "review_date": "2018-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 is one of my favorite movies and being surprised by zack synder who knew that this would be an film that nobody would forget unless your thrown into a hole.",
            "review_date": "2018-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is definitely reminiscent of that story your mate tells down the pub about him battling of 12 large blokes single handedly",
            "review_date": "2018-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lots of blood and guts. This is generally a good thing. A bit slow in places and some of the acting is wooden, but different and visually appealing. Worth a go.",
            "review_date": "2018-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Title: 300\nStory/Writing/Message/Plot:\t3\nCharacter/Acting:\t\t3\nMusic/Sound:\t\t\t4\nCinematography/Editing:\t5\nAge/Originality:\t\t\t4\nTotal:\t\t\t19/25",
            "review_date": "2018-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unique for its time, the style was something of a fresh look in film initiated by Zack Snyder. It has plenty of entertaining moments despite the fight choreography resembling a video game, and the look of the film has video game quality of its own. Butler's King Leonidas has a commanding presence as roaring leader, while him and his ultra macho soldiers explore the cultural significance of what its like to be a Spartan soldier, an intriguing element to the narrative.",
            "review_date": "2018-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You need to understand that this is not a smart movie. In fact, this movie is not only dumb, but also cheesy, over-the-top and unquestionably ridicullous.\n\nThat said, it is also 2 hours of non-stop, visually stunning, and above all fun ass-kicking. And sometimes... that's all you can ask for.",
            "review_date": "2018-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie can be summed up in one word:  IDIOTIC.  no stars",
            "review_date": "2017-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This should be a cult classic for gays. I first saw this movie when I was 15, It's soft core, gay fantasy eye candy. With CGI abs included.",
            "review_date": "2017-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Initially I had no interest in watching this movie at all. When I was 10 years old I watched about the first half hour of the movie and then wandered elsewhere in the house because I thought that it was stupid. So, coming back and watching this movie 7 years later I was extremely surprised by the fact that I actually enjoyed watching this movie. The jokes in the movie actually had me laughing, and the honor that the Greeks possessed had me flabbergasted. The characters were brutal, and the movie was extremely gory, but the fighting was amazing. The first ten minutes of the movie may have been a little slow, but afterwards the movie picked up and never really slowed down again. I was never bored and I would definitely recommend the movie to anyone looking for a good fighting movie, as long as they don't mind watching people lose their heads every ten minutes.",
            "review_date": "2017-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Actually I found out that its more accurate than I assumed.  Enjoy the violence and realize that many of the battle scenes are just for fun and not what really happened.  But the portrayal of Sparta and its warriors is very well done!  If you don't like graphic violence don't watch it!",
            "review_date": "2017-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good movie it's showed a lot of violence and really brought you into the movie by showing i?t all.",
            "review_date": "2017-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this was a good movie and seemed to be pretty accurate. Really got the point across of how life was if you had to be a Spartan Warrior. Great acting and picture looked pretty Amazing. 4/5 stars would recommend if you don't mind bloody action. -Maggie S",
            "review_date": "2017-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 tells the story of the 300 Spartans who defended their homes against the Persian army. The movie is a phenomenal action packed story that sticks pretty close to the actual events. The movie is done in a style similar to a graphic novel which adds high contrast and beautiful slow motion scenes. Overall, the movie is incredibly entertaining and tells a fascinating story.",
            "review_date": "2017-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A visual feast! Very over the top, I'm a fan of greek history and this isn't the most accurate account of the events leading up to and the battle of Thermopylae, but its a super cool, visual feast with Gerard Butler looking amazing and haming it up to perfection as King Leonidas.",
            "review_date": "2017-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not for the thinking crowd. it is what it is: total carnage, comic book style hand-to-hand combat. it's kind of cool to see Lena Headey before GOT and Michael Fassbender before X-Men. 300 just doesn't really build to anything.",
            "review_date": "2017-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More style than substance, but nonetheless a visually exhilarating war epic. The fantasy elements do detract, but  there is a strong message for the preservation of culture and identity as well as the threat to it, which makes 300 ever more worthwhile in the current climate. Solid.",
            "review_date": "2017-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "what a good action movie!!!\ngreat bad-ass actionð???",
            "review_date": "2017-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good film. Good story, great acting and directing. However, could do with a bit less violence and blood. \nThere are quite a few parts that are historically inaccurate, such as the way the gladiators were dressed during battle and the political way Sparta worked.",
            "review_date": "2017-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the bests....needs more women.  I hope they fixed it in the next 300....",
            "review_date": "2017-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not historically accurate at all but it is extremely enjoyable, nice visuals, strong characters, and a decent story.",
            "review_date": "2017-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't approve the technical way it is done, it's absolutely the wrong way to present historical events for the youth, but thematically it's on the right track: we all must remember how the Western culture was preserved and had faced the threat of obliteration from foreign invasions.",
            "review_date": "2017-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly, I thought this movie would be entertaining, but not very memorable. But, I was honestly blown away. The best word I can use to describe 300 is just BAD-ASS! It is so cool and awesome. The acting is really good. The critics got this one all wrong, way too low of a rating.",
            "review_date": "2017-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still to this day love it....and liberals hate it.;)",
            "review_date": "2017-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Since I'm apparently one of very few who know that this is based on a Frank Miller comic which fictionalized what happened at Thermopylae rather than a history lesson with occasional fantasy elements rendering it immune to the \"Pocahontas curse\", I enjoyed this film a lot more than I maybe should've. Plus, it's easier to enjoy a Zack Snyder film if you're not in it for complexity and anyway, this was back during his glory days before \"MARTHA\". With quotable lines, well-conducted music, visual thrills, awesome battle sequences and stylishly made, 300 kept me so thrilled throughout that I forgave its racist depictions of Persians in 480 B.C.. Gerard Butler is perfect for the role of King Leonidas who guides his men to battle and offers encouraging advice for their battles. And there's also that killer remix which constantly appears on YouTube. Anyone remember the This is Sparta remix from a couple of years ago? I miss those days. So, as long as you aren't easily disgusted by the sight of blood, can manage to look past its somewhat racist approach and are in it for a fun action-packed ride with tons of visual splendor and aren't expecting a history lesson, 300 is a thrilling experience that just might go down in history as director Zack Snyder's best film to date...although the only other movies of his I've seen are Man of Steel and BvS. 300 is not a bad movie, just relax, sit back and enjoy the show.",
            "review_date": "2017-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched this on Sky as part of the 'Historically Innacurate' package. I'd like to believe aspects of this film were correct but all the monsters/demon people whatever they are...kind of put the downer on the film. Too much green screen in this film they could of put more effort into it but other than that it's a decent film.",
            "review_date": "2017-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stunning visuals, bloody, action packed, and a very entertaining exciting movie.",
            "review_date": "2017-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly this is manifest of \"Spartan\" and all of the word's essence. Not in the slightest overdone or exaggerated. One for the ages.",
            "review_date": "2017-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 is that rare convention breaker that proves a movie doesn't need to be intelligent. Its mission was to deliver on gorgeous visuals and plentiful action, which it does so masterfully.",
            "review_date": "2017-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never seen it but heard the end when I was waiting for some girl to come out the pictures in me cab, sounded good! HOW MAD IS THAT?!",
            "review_date": "2017-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very enjoyable war movie that I have found eminently re-watchable. There is witty dialogue and some memorable scenes. The story is loosely accurate historically and my pet peeves with it revolve around how accurate. The Spartans in reality would have been wearing chest and leg armor which is what made them so hard to kill against lightly armed  Persians. But of course armor gets in the way of physique. There were 5000 Greek forces by all accounts, including 100 Spartan slaves,  of which 300 were the elite Spartan core that stayed and sacrificed itself on the last day as a final delaying action. Not including the slaves is a missed opportunity meant to glorify the Spartans more than they deserved. While the immortals were the Persian elite forces, they were called that due to the fact that whenever a division got destroyed in battle the Persian King would immediately reconstitute it back home. If you like a thrilling action movie done in an epic style, good memorable dialogue, a war movie with lots of graphic violence, immersion into an ancient historical setting, and a reasonable plot with some thought provoking content then I strongly recommend this movie.",
            "review_date": "2017-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Marvelously bloody experience",
            "review_date": "2017-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Spartans! What is your profession?!\" *Spartans emit war chants*",
            "review_date": "2017-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THIS IS SPARTA!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2017-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good, full of action and extremely good acting skills by the likes of Gerard Butler. Not to be missed! ??",
            "review_date": "2017-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as everyone says it is but is still an entertaining action movie that is great to look at.",
            "review_date": "2017-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really beautiful ending",
            "review_date": "2017-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300, is from the director Zack Snyder. First off, this is a visually exciting experience which is flawlessly amazing, full of blood action and violence and ready made dialogue. However, it does go too much over style rather than substance, telling a cohesive story. As the film progresses, it is very repetitive, with repetitive action and heavy exposition scenes which kept me bored and having the desire to see a lot more bloody action and uninterested at the central story and characters, conflict. Overall, 300 is all about great visuals and bloody action, definitely not heavily historically inspired and expelling certain plots and story lines.",
            "review_date": "2017-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intense, violent, and fun, 300 benefits heavily from its r-rating and a strong leading performance from Gerard Butler. Historical inaccuracies aside, this is, in the words of Craig Ferguson, \"A great f*cking movie\".",
            "review_date": "2017-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As every Snyder movie, 300 is a beautiful show of technic stuff, as slow motion and especial effects, with a great dark atmosphere.\nBut  lacks of coherence and it seems you are watching a fantasy movie instead of a historical movie (i can say the same for Miller's graphic novel)\nAlthough is a great adaptation of the mentioned Miller's work, fails in telling the story to the people, watching the spartans fight for a weak purpose and the persians portrayed as the bad guys fighting the \"heroes\"  whose purpose is even more weak.\nA movie to entertain, nothing else.",
            "review_date": "2017-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It should be 301 because it was 300 spartans and him",
            "review_date": "2017-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really nice cinematography and story telling. I love the detail in the battle scenes too",
            "review_date": "2017-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really liked the way this film was done visually. I don't know if I've ever seen another film that was done in that same way... It was a bit bloody for me though. Great action film though.",
            "review_date": "2017-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I believe the film is set up to stand the test of time.  It's a film you will catch yourself watching if it's on and remember how ground breaking it was as it lead to a spartan frenzy of shows on Stars and the History Channel.  It is a stand alone that should have been left that way, but instead now has it's name tarnished by it successor that is not even worth calling a movie.  300 could arguably be Gerard Butlers launching point.  Sure he had other movies before this however his role here will truly be hard to forget.  As for Zack Snyder I'd say the film was his ticket to having his control on the world of DC comics.  Granted the DC movies movies he's done are....questionable, however 300 displays the strengths and capabilities Snyder has as a director.",
            "review_date": "2017-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With great visuals 300 is a really good action movie. Gerald Butler was born to play a Spartan warrior. Snyder does a good job of adapting the 300 comic book into a solid film. The choreography on some of the action scenes are great. A very epic story. The plot is a little weak but I don't think it effects the film all that much. You still get your great action and beautiful style.",
            "review_date": "2017-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film with great action scenes and even better visuals.  Great story from start to finish.",
            "review_date": "2017-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exploitation and objectification, done right ;every is character thoroughly stereotyped and exploited. Nearly naked white men with thoroughly shaved bodies and un-shaven faces battle Arabs, monsters, ninjas, gays, and more monsters.",
            "review_date": "2017-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Artistically shot, but bloody mindless violence. The story is epic though the pacing hurts it some. There are some good moments, but the movie didn't really work for me.",
            "review_date": "2016-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fighting scenes are cool but the film couldn't really keep me hooked",
            "review_date": "2016-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrible, horrible movie.  Nothing but a crappy CGIfest with no plot.  There was this amazing historical plot they could have followed, but nope.  Let's put monsters and mutants and general crap in it.  Not following reality is not why it is terrible though, it is just a bad movie.  Neglecting the historical truth is just the craptastic cherry on the top.",
            "review_date": "2016-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's fun and stylish before Snyder became the Snyder we all know and fear.",
            "review_date": "2016-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stylish to a fault and occasionally stirring, 300's emphasis of style over substance unfortunately can't help but make it feel fake.",
            "review_date": "2016-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, was this boring.  I do not understand why this was so popular.  It was like half cartoon, and the rest just shirtless guys stabbing each other.  Had absolutely no interest in the plot whatsoever.",
            "review_date": "2016-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wresting with swords and fake body parts.",
            "review_date": "2016-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In recognition of me getting my 300th Facebook friend...I thought I'd try to watch this film again. Wow...2007...has it been that long since it came out?! It's a better film than I remembered...despite it's sepia-toned CGI. A testament to courage and holding to principle until the end.",
            "review_date": "2016-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bigest BS story that ever been told. This movie is total BS. Make believe.",
            "review_date": "2016-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Guy flick. No story line. Greased up men fighting.",
            "review_date": "2016-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super intense action in a fictionalized version of the Battle of Thermopylae (told from the point of view of a Greek warrior after the battle).  Really good movie",
            "review_date": "2016-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great performance by Gerard butler, maybe the best of his career. Really good movie. Good action and all.",
            "review_date": "2016-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "let's see scantily clad attractive muscular sweating guys, who might want to see that?  ok, let's say it was not intended for gays ut it was intended for gays nevertheless.  i started laughing out loud when that dawned on me somewhere near the end of the film. it also occurred to the makers of \"welcome to sparta\" obviously.",
            "review_date": "2016-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stimulating visuals, with much action and violence. Easy to follow plot, makes the movie easy to follow. Butler was a tremendous pick for the lead role. He portrays Leonidas I in a strong way, with his scowl and powerful voice. \"This is Sparta!\" will be remembered as one of the all-time great movie quotes.",
            "review_date": "2016-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful aesthetics but the story drags. Still had a blast watching it though!",
            "review_date": "2016-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies growing up.  It was the first of its kind never been done before.   Great plot.",
            "review_date": "2016-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4.25*\nGreat movie with incredible action sequences, great cinematography (backgrounds) and a very well laid out plot.  The film keeps you guessing even though we all know the outcome (bc it's very loosely based on the actual battle).  You have to be a fan of the graphic novel visual effects ie Sin City (another film I highly rec) to really enjoy this movie.",
            "review_date": "2016-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A visually exciting epic experience! Gerard Butler, David Wenham, Lena Hedley and Rodrigo Santoro are great as they entertain you!",
            "review_date": "2016-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked this. Cheesy but awesome action and visuals.",
            "review_date": "2016-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most Homo Erotic movie ever. I have a thing for historical bloody action movies. This was badass in so many levels. I have total respect for Gerald Butler, and the abs he had in this movie.",
            "review_date": "2016-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A visually impressive film that has enough slow motion and Zach Snyder magic to keep you entertained for its run time.",
            "review_date": "2016-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Over the top, plodding, bad characterization, unintelligent.",
            "review_date": "2016-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the action in this movie and Gerard Butlers performance, the only dull moment for me is the story telling but overall I think this is a well shot action packed film that I could watch again many times",
            "review_date": "2016-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Por me this movie will be remembered forever because at the same time has cenar strong , a lot of action and violence , but at the same time brings to fight an army of only 300 Spartan men who fought bravely against the domination of their lands for thousands of Persians that despite acabarrem dying, they became heroes . The movie was amazing because of the visual and sound effects that made the very real battles and lead us to the time that the story takes place.\nI love!",
            "review_date": "2016-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In 479 BC, one year after the famed Battle of Thermopylae, Dilios, a hoplite in the Spartan Army, begins his story by depicting the life of Leonidas (Gerard Butler) I from childhood to kingship via Spartan doctrine. Dilios's story continues and Persian messengers arrive at the gates of Sparta demanding \"earth and water\" as a token of submission to King Xerxes (Rodrigo Santoro); the Spartans reply by killing and kicking the messengers into a well. Leonidas then visits the Ephors, proposing a strategy to drive back the numerically superior Persians through the Hot Gates; his plan involves building a wall in order to funnel the Persians into a narrow pass between the rocks and the sea. The Ephors consult the Oracle, who decrees that Sparta will not go to war during the Carneia. As Leonidas angrily departs, a messenger from Xerxes appears, rewarding the Ephors for their covert support. Although the Ephors have denied him permission to mobilize Sparta's army, Leonidas gathers three hundred of his best soldiers in the guise of his personal bodyguard; they are joined along the way by Arcadians. At Thermopylae, they construct the wall made up of stones and slain Persian scouts as mortar, angering the Persian Emissary. Stelios, an elite Spartan soldier, orders him to go back to the Persian lines and warn Xerxes after cutting off his whipping arm. Meanwhile, Leonidas encounters Ephialtes, a deformed Spartan whose parents fled Sparta to spare him certain infanticide. Ephialtes asks to redeem his father's name by joining Leonidas' army, warning him of a secret (goat) path the Persians could use to outflank and surround the Spartans. Though sympathetic, Leonidas rejects him since his deformity physically prevents him from holding his shield high enough; potentially compromising the phalanx formation, and Ephialtes is enraged. The battle begins soon after the Spartans' refusal to lay down their weapons. Using the Hot Gates to their advantage, plus their superior fighting skills, the Spartans repel wave upon wave of the advancing Persian army. During a lull in the battle, Xerxes personally approaches Leonidas to persuade him to surrender, offering him wealth and power in exchange for his allegiance; Leonidas declines and mocks Xerxes for the inferior quality of his fanatical warriors. In response, Xerxes sends in his elite guard, the Immortals, later that night. Despite some Spartans being killed, they heroically defeat the Immortals (with slight help from the Arcadians). On the second day, Xerxes sends in new waves of armies from Asia and other Persian city-states, including war elephants, to crush the Spartans once and for all, but to no avail. Meanwhile, Ephialtes defects to Xerxes to whom he reveals the secret path in exchange for wealth, luxury, and (especially) a uniform. The Arcadians retreat upon learning of Ephialtes' betrayal, but the Spartans stay. Leonidas orders an injured but reluctant Dilios to return to Sparta and tell them of what has happened, a \"tale of victory\"...\n\nSince its world premiere at the Berlin International Film Festival on February 14, 2007, in front of 1,700 audience members, 300 has received generally mixed reviews. While it received a standing ovation at the public premiere, it was panned at a press screening hours earlier, where many attendees left during the showing and those who remained booed at the end. Some of the most unfavorable reviews came from major American newspapers. A.O. Scott of The New York Times describes 300 as \"about as violent as Apocalypto and twice as stupid,\" while criticizing its color scheme and suggesting that its plot includes racist undertones; Scott also poked fun at the buffed bodies of the actors portraying the Spartans, declaring that the Persian characters are \"pioneers in the art of face-piercing\", but that the Spartans had access to \"superior health clubs and electrolysis facilities\". Kenneth Turan writes in the Los Angeles Times that \"unless you love violence as much as a Spartan, Quentin Tarantino or a video-game-playing teenage boy, you will not be endlessly fascinated.\" Roger Ebert, in his review, gave the film a two-star rating, writing, \"300 has one-dimensional caricatures who talk like professional wrestlers plugging their next feud.\" Some critics employed at Greek newspapers have been particularly critical, such as film critic Robby Eksiel, who said that moviegoers would be dazzled by the \"digital action\" but irritated by the \"pompous interpretations and one-dimensional characters.\" Variety's Todd McCarthy describes the film as \"visually arresting\" although \"bombastic\" while Kirk Honeycutt, writing in The Hollywood Reporter, praises the \"beauty of its topography, colors and forms.\" Writing in the Chicago Sun Times, Richard Roeper acclaims 300 as \"the Citizen Kane of cinematic graphic novels.\" Empire gave the film 3/5 having a verdict of \"Visually stunning, thoroughly belligerent and as shallow as a pygmy's paddling pool, this is a whole heap of style tinged with just a smidgen of substance.\" 300 was also warmly received by websites focusing on comics and video games. Comic Book Resources' Mark Cronan found the film compelling, leaving him \"with a feeling of power, from having been witness to something grand.\" IGN's Todd Gilchrist acclaimed Zack Snyder as a cinematic visionary and \"a possible redeemer of modern moviemaking.\" With \"300\" Zack Snyder began his journey into visionary filmmaking where he used green screens and effects in a very efficient and stunning ways. In some cases if really works (\"Watchmen\", \"Man of Steel\", \"Batman vs Superman\") while in other cases it doesn´t (\"300\", \"Sucker Punch\"). \"300\" was built from Frank Miller´s graphic novel with historic events as the base and Zack Snyder has tried to put you as a viewer literally into the cartoon frames within the graphic novel and visually it works for the most. But, when Snyder has a less fleshed out script with very one-dimensional caricatures and characters he simply can´t manage to engage you and everything becomes pompous, over acted with ridiculous and silly cliché phrases as the red thread throughout the movie. You cringe when Gerard Butler screams \"This is Sparta!\"... Yes, it is based on something cartoony, but as Snyder showed in his adaptation of the fantastic graphic novel \"Watchmen\" if he has a solid storyline with depth he can succeed into making a graphic novel into something truly enjoyable and fantastic. \"300\" is a visual feast with great art direction and cinematography, but as said with such a bland script and development this can only be a disappointment. Trivia: The movie never claims to be historically correct, something which is addressed at length in the documentary The 300: Fact or Fiction? (2007) on the 2-Disc Special Edition DVD. The movie is based heavily on Frank Miller's 1998 comic book mini-series, also entitled \"300\". In the documentary Miller openly admits that he made many radical changes to the history and director Zack Snyder admits to making further changes. Snyder states that he was more concerned with making a film which would appeal to a wider audience, and creating an exciting and visually stunning action movie rather than a typical historical epic. Indeed, he further points out that the film is a subjective narration by Dillios (David Wenham) in an effort to spur his men, and as such, the narrative cannot be trusted as historically accurate or wholly objective. Snyder acknowledges that Dillios is not a man to allow truth get in the way of a good story, and that the point of the depiction is that it is specifically the Spartan perspective of the battle. In particular, Snyder cites the depiction of the Immortals. The Immortals were a real battalion, but they weren't demons, they were just ordinary men. However, in Dillios' narration, it is much more dramatic and heroic if the 300 fought off the attack of 10,000 demons rather than 10,000 men. As both Miller and Snyder argue, the film is not a realist piece. In an effort to get the studio executives to commit to making the movie, Zack Snyder and his team scanned every image from Frank Miller's graphic novel into a computer. They then removed all of the dialogue and descriptive prose, and added simple animation to each frame (such as burning fire, moving clouds, sparkling eyes etc.). They then edited these shots together into what amounted to an animated comic strip, and Snyder hired his friend Scott Glenn to record a voice-over narration for the piece. Snyder brought the film to Warner Bros., but they said they needed more to convince them that the movie could work. As such, he decided to shoot a live-action 'test' - a 90-second 360-degree continuous shot featuring a single Spartan killing several Persians. The combination of the animated comic images and the test convinced Warner Bros. that Snyder and his team were capable of making the movie. An extract from the animation as well as the entire test can be found as an Easter egg on disc 1 of the 2-Disc special edition DVD of the film.",
            "review_date": "2016-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You like pecs right?  Pecs brought you here?  There's pecs.",
            "review_date": "2016-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great adaptation of Frank Miller's graphic novel. Some of the cells from the novel are taken and put directly on the screen. Gerard Butler does an excellent job as Leonidas and the rest of the 300 cast were also built like and acted like imposing Greek gods. Great stylistic action sequences and camera work by Zack Snyder. Not to be missed!",
            "review_date": "2016-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mindless action with style over substance, still quite some fun",
            "review_date": "2016-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though 300 is silly, it's awesomely silly and when you go deeper into the film you begin to realize that that's the point a simple minded, but visually dazzling movie that exist only to give you one hell of a thrill ride and it definately does deliver.",
            "review_date": "2016-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally saw this in its entirety, well worth it.  Amazing visual effects and when I'm tuned in to a movie throughout I know it's a good one.",
            "review_date": "2016-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "with a cast of quality, dramatic story-telling, bloody, gore filled action, and an outstanding script 300 represents more of what hollywood can accomplish.",
            "review_date": "2016-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Little heft to the narrative, but it's hard not to be entertained by this action and CGI filled epic.",
            "review_date": "2016-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing visuals from top to bottom. Did for ancient battles what \"The Matrix\" did for guns and martial arts fights.",
            "review_date": "2016-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "no one can match the strength of Sparta.",
            "review_date": "2016-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 is directed and co-written by Zack Snyder, and it stars Gerard Butler in a comic book adaptation about the history of Spartans going up in a war against the Persians with 300,000 soldiers. Everybody knows about this film, whether it be the visuals, and the action scenes, and of course, that famous meme. So as for Zack Snyder's first comic book adaptation, 300 is really pretty sweet to watch. It feels like an epic film that's going all out and make it grand, which it really works. The acting is great, with Gerard Butler acting the most intimidating out there that convinces me that he's definitely the leader of the Spartans. The visual effects look really cool, and it's something that I never seen like that. The score by Tyler Bates sounds bad *bleep* that it brings in more of the epic tone to this film. The action scenes are exciting to watch, and the writing by Zack Snyder, Kurt Johnstad, and Michael B. Gordon definitely makes it feel like a man's film, but it's makes them get excited and start making war cry too. The only aspect that didn't make this film a five star, is the characterization of it. While I know enough about Gerard Butler's character, I didn't get to know about the other characters that when some of them die, they make it a big deal which didn't affect me as I barely knew anything the people who die. With that said, I surprisingly enjoyed 300 a lot more than I thought, and would watch the sequel if I got the chance to see it.",
            "review_date": "2016-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you ask me whether Zack Snyder is the new Robert Rodriguez? I may say, it definitely looks like. There is not much to boast about the movie if not for it's splendid visual effects and action choreography not to mention it's over the top bad guy. The director definitely looks like he has a lot to offer.",
            "review_date": "2016-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not very historically accurate nor realistic but still a very griping and exhilarating movie with a mix of epic battle scenes and scenery.",
            "review_date": "2016-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've always seen Zack Snyder as someone who relies on visuals as opposed to dialogue to tell his story. Gerard Butler is iconically over the top and so is the action. Say what you want about Zack Snyder but his unique style is on fully display here. \n\nB+",
            "review_date": "2016-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I laughed out loud.  It was supposed to be a comedy, right?  Oh... it wasn't?  Then it's really a bit of an overwrought, overacted mess, isn't it?",
            "review_date": "2016-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The hype is real in this film. Zach Snyder proves that the average viewer will not only see, but LOVE a movie filled with roided up dbags shouting and kicking each other as long as there is plenty of blood, nudity, and death to hold it all together. \n\nIt would be more than enough for that alone to have this video be seen as a success by the average (read: easily entertained) viewer, but Snyder goes on to blow critics away as well. He proves that the average critic will enjoy a time period piece comic book adaptation with above average cinematography and a sepia filter in post processing.\n\nIn many ways this is Snyder's masterpiece: High viewership, critic appeal, box office success. But the best thing Snyder achieved here is not that he made money, got good ratings, nor was it people overlooking the dangers of heavy steroid, HGH, and testosterone use by the actors, nay. His greatest achievement is getting people to say that their favorite movie is this ham-fisted hyper-violent \"film\" featuring grown men in diapers.",
            "review_date": "2016-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Look. At the time, the effects were great. I was like in high school and remembered thinking I was a badass for seeing this before i turned 17.Also history. THis movie has history things. I like history things.",
            "review_date": "2016-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually stunning, action packed, revolutionary and loyal adaptation to its source material. Snyder is an underrated director. He creates pure fun. He's not a Coppola for sure but he's a product of our era and i'm thankful for it.",
            "review_date": "2016-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie that set the bar Snyder has been reaching for ever since.",
            "review_date": "2016-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "historically inaccurate, brutally violent, violently gory - the only thing working for this movie is he stylistic videography - that has later been used to death in other movies.\nOk watch.",
            "review_date": "2016-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Butler portrays beautifully the masculine legend of the Spartans. Bold, fearless and dominating the 300 were an example of Spartan culture and courage. The honor given to the comic is so well-translated, it is hard to believe when reading the comic and then watching the movie. Snyder hit this one out of the park.",
            "review_date": "2016-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautiful movie every nook and cranny beautiful",
            "review_date": "2016-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 has very bloody good action with a surprisingly good premise. 300 is exciting and a recommended watch, THIS IS SPARTA!!",
            "review_date": "2016-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hey, it's stupid. Everyone knows it's stupid. However, this film proves that Zack Snyder understands what makes good action; which is something admirable. Good action needs to be admired more, and 300 demonstrates that. It's epic, the visuals are absolute eye-candy, it's shot pretty well, and the speed-ramping technique is used very appropriately here. Again, stupid movie, but entertaining and admirable in the effort put into it.",
            "review_date": "2016-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Action packed, visually stunning and full of blood. Great memorable moments, definitely worth the watch.",
            "review_date": "2016-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A visual spectacle like no other; this film is beautiful and wonderfully stylised. But sometimes the director makes simple scenes overly dramatic which damages the pace of this movie. I also think story fails to complete a whole narrative arc and so is marginally unsatisfying as viewer. Bloody good fun though.",
            "review_date": "2016-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually thrilling. However, 300 has one-dimensional caricatures who talk like professional wrestlers plugging their next feud.",
            "review_date": "2016-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 might not be able to keep its tone throughout its 2h runtime, but it is definitely a great movie, and very quoteable. It reached cult-status in no time, and is very entertaining. Yes, you might have to get over some Zach Snyder Goatman bullshit, but the movie is still great.",
            "review_date": "2016-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fine entertainment, even if it could have packed more action into the conclusion.",
            "review_date": "2016-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Looks like a comic than a movie...great",
            "review_date": "2016-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie and uniquely animated.  Borrowing from predecessor film Troy and animation style from Sin City, this Frank Miller graphic comic adaption is enthralling from beginning to end.  This is largely a \"man's\" movie, and the great TV series Spartacus largely borrowed its style and followed the film's success.  It's difficult to dislike this film.  It is an original.  Unfortunately, attempts to carry on the franchise failed miserably with its sequel.",
            "review_date": "2016-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is as close as I'll ever get to watching gay porn.",
            "review_date": "2016-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ignore the \"critics\" on this one, as it likely doesn't appeal to their SJW sensibilities. This movie delivers. Though a bit too stylized for my taste, and lacking in some historical details, it is a compelling rendition of one of the most significant events in western history.",
            "review_date": "2016-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie so much. Thank you Zack Snyder. This movie can be summed up in two words: stylized violence.",
            "review_date": "2016-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brutally gory and violent. This film doesn't disappoint in offering a unique film of an epic battle. My main complaint is with the unnecessary nudity and sex only incorporated to get more males in the theater which means more mula for the studio.",
            "review_date": "2016-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A groundbreaking film and joy to watch. Great score, special effects, and characters you eagerly root for and against. Time will count this as one of the great neo-Art films!",
            "review_date": "2016-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It serves it's purpose of being an action movie perfectly.",
            "review_date": "2016-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 is visually striking, but it doesn't have a lot of substance and the writing is quite weak.",
            "review_date": "2016-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun as hell. I loved the fighting and the slow motion didn't seem to force and actually work. A great story with a bad ass ending and a bad ass protagonist.",
            "review_date": "2016-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very fun adrenaline pumping lowkey homosexual movie about guys thrusting each other",
            "review_date": "2016-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better then expected. Don't take it too seriously.",
            "review_date": "2016-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most action fans will love this one, while many others may only be mildly amused. You gotta admit, whatever you think of it, the slo-mo scenes and special effects are pretty darn good",
            "review_date": "2015-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps the height of the mini movement of the mid 2000s to mix thematic scope with the style of the graphic novel, 300 is one of the better action films of the last decade, leaving the viewer pleased with the experience.  Highly provocative and making no time for nonsense, this film is a highly fictionalized version of the tale of the 300 spartans who stalled the march of Xerxe's army at in ancient Greece.  With themes of sacrifice and loyalty to one's family and home, with a unique visual style, 300 triumph as a piece of action cinema, also boasting a provocative sense of sexuality rare in its ability to not destroy a film.",
            "review_date": "2015-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most realized high style mainstream films, an important benchmark in graphic novel-esque filmmaking, and a solid action flick, boasting quite the exploration of ridiculous masculinity and duty.",
            "review_date": "2015-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "slow motion is cool.",
            "review_date": "2015-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed this movie. It's not the best movie but it's different. You don't usually get ancient comic book movies. The acting was fine but the action sequences are epic.",
            "review_date": "2015-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A decent action movie with great cinematography, and a interesting plot.",
            "review_date": "2015-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it can have its moments, with doctrinaire but stirring one-liners or some digitally refined images. but it's as much a video-game cutscene as it is a visually drab canvas of brainless, slowed-down close-ups. it lacks the creative drive to divagate from the comic's exact illustrations, thus the locus on primal brutality doesn't quite hit the mark as it should. nor does the speechifying form anything close to a coherent message or sensation.",
            "review_date": "2015-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Did you know that THIS IS SPARTA!?  Well, now you do.  This film is like flipping through the pages of the graphic novel, you'll get a stream of black and white and red colors with men and their big spears.\n\nTagline:  CGI abs, you know, for men.",
            "review_date": "2015-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gritty tale of 300 Spartans is gripping and intense but lacks historical accuracy.",
            "review_date": "2015-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "what an awful piece of sh..!",
            "review_date": "2015-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This may be Gerald Butler's best performance. 300 is beautifully shot with  great performances from all around. The story may be simple but it's the way that it's told through the epic action scenes.",
            "review_date": "2015-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A pure violent popcorn thrill ride where there is no fair ducking.",
            "review_date": "2015-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good, action packed and beautifully shot. 300 is epic in scale and big budget entertainment done well",
            "review_date": "2015-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually stunning with beautiful language and charismatic, larger than life characters. Something that will have you yelling at the screen and raising your arms with delight. Queen Gorgo continues to be one of my favorite female characters in cinema history.",
            "review_date": "2015-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "JUST PERFECT movie to see if you are little strecefull and you want to have a real energetic movie with all the action scenes and the thrilling quotes when i first see it at the end i was relaxed all the next day after all the action and the battles i've seen is a great movie mostly for men but is nice to see it anyway",
            "review_date": "2015-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spartans are awesome!",
            "review_date": "2015-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you like your men covered in sweat with awesome airbrushed abs, then this is for the sure the movie for you. 300 (2006) is an extremely action packed film which probably has more CGI and make-up in it than most of the animated movies out. Now don't get me wrong 300 (2006) is a GREAT Movie, it has just got so much cosmetic work in the movie that you cannot hide it. The story is nicely put together, the narratives are dark and filling, the costumes are for sure on point, and for the most part the acting was very well performed.\n\n300 (2006) is a movie in which sits in my personal dvd collection and I have enjoyed watching it repeatedly over time; great action movie!",
            "review_date": "2015-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I like fighting, treachery, monsters, boobs, and a little blood & guts!  This is what a comic book movie is supposed to look like! Why don't they take a chance with a little creativity on some main stream superheroes?  A bit more blood and banter and maybe the next DC film won't be so Green Lantern-y",
            "review_date": "2015-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good, lots of blood and guts. But remarkably holds to the historical side of things.",
            "review_date": "2015-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good fantasy war flick. Besides this is Sparta, all that is worth watching is the battle. But hell, that part's excellent.",
            "review_date": "2015-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I actually found this so boring. I didn't even make it halfway.",
            "review_date": "2015-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its style and quotability are the only redeeming factors in an otherwise narrow minded hack-and-slash period piece.",
            "review_date": "2015-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie seemed a little overwrought for me. I did like the depictions of the Persian freaks which made the movie seem like a documentary. Lot's of yelling and dying.",
            "review_date": "2015-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not a super deep movie but the epitome of a great action movie",
            "review_date": "2015-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good adaptation of the comic from visionary director Zack Snyder, even though it's not perfect. Never even read the comic, but maybe I will one of these days.",
            "review_date": "2015-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a under rated movie, Snyder uses stylized violence of war. By staying true to the frank miller graphic novel the sequences of battle are intense and the characters are weird.",
            "review_date": "2015-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has great acting and great action sequences, but it uses too much CGI which makes the movie look a bit weird. But it is a fun action movie about the Spartans.",
            "review_date": "2015-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Hollywood gang affiliated effort to do the Greeks again! This time its the Jocks doing the show! I was expecting to see a few drunks and a Bagpiper in the show but no, when you screw up a good story, you make are real good job of the screwing!",
            "review_date": "2015-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie 5/5 stars for me.",
            "review_date": "2015-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story epic battles what more could you ask for",
            "review_date": "2015-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This marks the directing debut of Zack Snyder as well as his trademark of making films. This made Gerard Butler more famous as his performance as Leonidas marks the Sparta world into our minds and into our history. A very well made and visually awesome film with thunderous slow motion fights that we can't forget. 3.5 out of 5",
            "review_date": "2015-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome though not great. The ultimate testosterone movie.",
            "review_date": "2015-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the   movie is  the  best",
            "review_date": "2015-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is pretty and it can also be slated as introducing a new style visually to the action flick, with the speed up and slow down fighting.",
            "review_date": "2015-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As I like to call it chewing the scenery the musical is a visual experience that's a lot of fun to watch. This is your typical man movie with good writing and directing from Zach Snyder.  Oh and magneto is in the movie which is actually interesting to wrap your brain around.  Overall it's a silly and somewhat dumb movie that's has nothing to do with actual Greek mythology, however this movie's harmless",
            "review_date": "2015-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A simple-minded but visually exciting experience, full of blood, violence, and ready-made movie quotes by Sin City author Frank Miller. Plus it's a history lesson, nice to see a film not marketed at kids...",
            "review_date": "2015-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If anything this movie is worth a watch for its unique visual approach. The movie doesn't have the greatest plot but the visuals are amazing and it feels like a Frank Miller graphic novel should.",
            "review_date": "2015-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 is a fun popcorn flick that shouldn't be taken serious and just have fun with it.The movie is extremely stylish and cheerfully violent.This movie is extremely entertaining and it has great direction of action scenes.Overall 300 is a mindless fun entertaining popcorn flick that's worth seeing.\nGrade B",
            "review_date": "2015-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a fun stupid movie, with great action",
            "review_date": "2015-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly I wish this was the only movie I ever seen Gerard Butler in, because he is such a bada*s in it.  I was captivated for the entire movie.  A lot of other movies have used similar stylistic filming techniques, but this one used it in a seamless way in which it wasn't a distraction. As far as action movies go, this is one of my favorites.",
            "review_date": "2015-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great direction, photography and art direction. Interesting film about the Battle of Thermopylae.",
            "review_date": "2015-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This recreation of the Battle of Thermopylae could be too fantasist, but I think that a film based in a graphic novel can take some liberties.",
            "review_date": "2015-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good film..recommend it.",
            "review_date": "2015-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this retelling/revamped version of the movie, how it's filmed, the action sequences and freeze frame/slow-motion work. Visually engaging & everyone's abs were en pointe! I won't lie, it's gory, but it's part of the story. 300 Spartans against the Persian army of thousands...it was a blood bath.  Loved it so much, I bought the collectors boxed set. Nothing says happiness like flying abs... paused for admiration... lol.",
            "review_date": "2015-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was never that interested in watching this movie, but on a whim I decided to. This was an epic film. Gerard Butler is an amazing actor. The freedom that the '300' fought for was truly inspiring. Well worth seeing.",
            "review_date": "2015-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seemingly prejudice from its historical inaccuracy, but well-acted and violent to keep the audience entertained. Some of the set pieces and wardrobe are over-the-top which lends to more inaccuracies, yet keeps the movie interesting. Don't knit-pick it; just see it as an enjoyable action flick.",
            "review_date": "2015-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If We Faught With Such Passion and Vission in our Own Lives. Our Children would want Nothing Less Than Success and Freedom for Themselves!! #Commit2Urself #StrengthenNextGen #Shoulder2Shoulder",
            "review_date": "2015-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300: Directed by Zack Snyder who puts together a masterpiece of stunning visual art and a great cast. Gerard Butler, Lena Headey, Dominic West and David Wenham. \nKing Leonidas of Sparta and a force of 300 men fight an outnumbering Persian army at Thermopylae. \nThe casting is great, the visual effects are stunning and the quotes will go down as some of the best movie quotes in the history of filmmaking. The director was really able to find that center between gory violence and realism also finding a balance between mythology and history. It was entertaining from beginning to end.",
            "review_date": "2015-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing fanboy action from the Frank Miller graphic novel.  Visually stunning and exciting but there is not much story.",
            "review_date": "2015-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 is an amazing film with a great story. people and critics that rate this less than 5 stars \njust don't get it.",
            "review_date": "2015-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie for both men and women. Blood, gore and guts for the men and hot, fit studs running around for the women.  Whoo!",
            "review_date": "2015-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kids Shouldn't be watchin' 300 because it's scary the movie is violent THE RATING OF 300 IS R for restuidcded",
            "review_date": "2015-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unless you're at least 48 years old, a woman and chronically single, do not under any circumstances watch \"The 300.\"\nI had to view the entire piece of dung in order to give you a full review. I puked eleven times.\nHad it been labelled properly (\"Gay Porn\") I probably wouldn't have bothered watching it. Others would be better prepared to review it.",
            "review_date": "2015-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very Intense, amazing war scenes.",
            "review_date": "2015-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I consider this movie to be a masterpiece it's a film that's a testament to how far men will go to protect their love ones and for what they believe to me honor. Combine that with great stylized violence and you get something that is absolutely amazing.",
            "review_date": "2015-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's stylish and laudably nuts but there's nothing behind the glossy surface. Full review later.",
            "review_date": "2015-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zack Snyder shows in \"300\" what his biggest talent is: Shooting visually brilliant action scenes. Obviously this movie isn't smart and historically incorrect, but its quotable and the slow-mo action is just .. just satisfying.",
            "review_date": "2015-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although most captivating for its visual style than for the characterization of his characters, Zack Snyder's unique direction and Gerard Butler's gritty performance make \"300\" an unforgettable film.",
            "review_date": "2015-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite interesting; quite ethereal.",
            "review_date": "2015-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film has an enthralling narration perfectly blended with its awesome special effects, unforgettable fight scenes, and its mind-blowing sound effects. The movie itself is a fascinating piece of picture that has a quite deserving reputation.",
            "review_date": "2015-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A men's movie, for men, that is watched by men. Enough said.",
            "review_date": "2015-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This had less story and more blood and guts. How many ways can u get speared?  This was meant to draw in all men: straights for blood and guts and gays with hot bodies",
            "review_date": "2015-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gerard butler is a woeful actor and he is in this, a lot",
            "review_date": "2015-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Action, a pompuous aesthetic, but nothing more...",
            "review_date": "2015-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have always been fascinated by the ancient tales and myths of the Greek culture.  They were talented, sophisticated story-tellers, who knew how to use humor, drama, moral lessons, and irony to craft interesting stories.  Among these is the Battle of Thermopylae, which is not a myth, but a true story of the Persian invasion of Greece, and how 300 Spartans fought off a significant portion of the Persian army before ultimately dying.  This is the basis of \"300\".\n\nUnfortunately, \"300\" takes very few cues from the actual story.  \"300\" is a complete reimagining of the Battle of Thermopylae.  These are not the historical Spartans.  Director Zack Snyder is so concerned with making the Spartans out to be bad asses that he completely mischaracterizes the Greeks, turning them into arrogant, muscle-bound warriors.  Likewise, the depiction of the Persians is not accurate.  The Greeks described the Persians as barbaric heathens, and the film's idea of a barbarian is kind of racist.  Additionally, there are many supernatural elements, transforming this Greek legend into a gritty, B-action movie.\n\nBut I suppose that is all a part of Zack Snyder's style.  Also part of Snyder's style are the excessive use of slow motion, over-the-top action, and lots of violence and gore.  While all of these do nothing to help the film, Snyder's unique use of lighting and visuals is one the redeeming qualities of this film.  This is a very cool-looking and visually pleasing film, if nothing else.\n\nAs I said before, the Greeks were talented story-tellers.  Zack Snyder, on the other hand, is a so-so story-teller.  Though most of the film is slow-mo action and shirtless hunks, the impressive visuals, a passable performance by Gerard Butler, and a decent amount of good drama make \"300\" an alright watch.",
            "review_date": "2014-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This... is... awesome! That's what I think of \"300,\" awesome. It has great bloody and gory action, amazing visuals, and it's a great turn your brain off, and have a fun time movie! I love it!",
            "review_date": "2014-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great movie!!!  Better the the second one. This was a brand new kind of cinema when it came out.",
            "review_date": "2014-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shame the chaps had draw on their six packs they should have called\nMe into the team I have got a real 8 pack bla bla bla",
            "review_date": "2014-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sometimes people just read too much into it.   Great movie.  One of my all time favorites.",
            "review_date": "2014-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Full of blood, gore and violence. 300 delivers quotes and battles in exciting sequences loyal to its source material despite having too much slow motions, sometimes being too loud and men doing absurd things together.",
            "review_date": "2014-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based on Frank Miller's graphic novel and directed by the newcomer Zack Snyder, we have 300, a story about King Leonidas who leads an army of 300 Spartans to prevent the fall his kingdom, well now that I have just written the summary of the plot it sounds so simple, I still can't get how Zack did for making the story work for almost two hours, yes the story works, it has problems with the finale I feklt that it was a simple ending but leaving us with a desire of more, it gives lots of blood, enjoyable violance and smart screenplay.\nThe visuals are beautiful and impressive, it makes you feel that the comic book really came to life, but Snyder has to work more on the characters because unlike Leonidas we will always remember him \"THIS IS SPARTA\" the other characters are uninteresting and forgettable. However fans from the comic book will be pleased with the film.",
            "review_date": "2014-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "based on the big lie story I'm so sorry for anyone that could believe this story without researching in history.",
            "review_date": "2014-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The definition of a \"guy - movie\"",
            "review_date": "2014-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film resembles a video game.",
            "review_date": "2014-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cool cgi, but absolutely childish plot.",
            "review_date": "2014-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can't argue with how cool and fun it is.",
            "review_date": "2014-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As an expert of Greek history I have to say that I absolutely love 300! Okay it takes a few liberties with history but it is a worthy tribute to Leonidas and his 300 Spartans. Gerard Butlers performance is superb!",
            "review_date": "2014-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 is that kind of a movie where you enjoy the visuals of violence and gore, almost like a scenic. With a distinguished performance from Gerald Butler and exciting battles throughout, enjoyment is 300% guaranteed.",
            "review_date": "2014-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you like action with no purpose, then this movie is for you. It is awesome. But you have to be drunk and pumped up!",
            "review_date": "2014-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfectly mixing gorgeous visuals, beautifully stylized violence, and too many quotable lines to count 300 may not technically be a good film but its just such a manly satisfying movie I just got to love it.",
            "review_date": "2014-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 gives you the battle of Thermopylae in 480 B.C., with King Leonidas of the Spartans battling against thousands of Persians to defeat Xerxes.300 is a great graphic novel adaptation filled with blood and gore, cool actual spartan fighting techniques, lots and lots of slow-mo, some yelling and general awesomeness.",
            "review_date": "2014-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't Butler's abs look amazing?",
            "review_date": "2014-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "can't go wrong with Gerard Butler",
            "review_date": "2014-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good and loyal adaptation of Frank Miller's graphic novel 300. Gerard Butler finally has a good roll and he performs it well. Yeah, there is a lot of VFX, blood, nudity and violence, but the story requires of all of those elements. There is a lot of predictable lines, and some chroma effects looks fake, but all the action redeems that. 300 is attractive, inspiring and exciting.",
            "review_date": "2014-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THIS...IS...SHITTTTTT!!! Horrible orange color tint that makes me puke orange, too many WTF scenes that don't make any sense, and Gerard Fuckler's giant naked butt. The only good thing is the battle scenes, which are also, unfortunately, really historically inaccurate. And there is actually 302 guys, if you pay attention.\n\nCAST OF 302!!!!\nTHIS........... IS........... GETTING OLDDDDDD!!!!!!!-Played by Gerard Fuckler\nAlmost Naked Giant-Played by that one guy\nPlease have sex with me-Played by Lena Headey",
            "review_date": "2014-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid film. I really enjoyed it and Im not usually an action film guy.",
            "review_date": "2014-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You know what to expect, but at the\r end you get the double and better.",
            "review_date": "2014-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What can I say? It's a bloody good time from start to finish. 10/10 I would watch it again.",
            "review_date": "2014-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"300\" is beautiful and incredibly well directed, it's a fact. But the plot is stupid and uninterresting.",
            "review_date": "2014-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now critically this is \"amazing\" but to me I just love it. I remember watching it when it first came out and just loving every action scenes it had and caring and liking the characters. Now to me this is just plain awesome and it's fun to watch it every once a while. Yes story isn't a strong suit but that's the only flaw I found, but over the year that doesn't even bother me because I like the simple story. Now this film is like the matrix, not saying it's \"like\" it but it's a very memorable film. Just as the matrix spawned many unforgettable scenes I think 300 does that as well. Anything from the fighting sequences, the slow motion, badass leonidas, the awesome lines or just the \"this is Sparta\" scene. Overall from its action to its non stop action this is an amazing film.",
            "review_date": "2014-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A CGI batttle of  ancient times!",
            "review_date": "2014-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 gives you the battle of Thermopylae in 480 B.C., with King Leonidas of the Spartans battling against thousands of Persians to defeat Xerxes.300 is a great graphic novel adaptation filled with blood and gore, cool actual spartan fighting techniques, lots and lots of slow-mo, some yelling and general awesomeness.",
            "review_date": "2014-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This, is, Awesome! Now I am one for buying the hype of a movie then go and see it then end up disappointed but not with this film. It contained some pretty good storyline which to me never got boring and to me, contained the best fighting sequences ever with amazing sgi. Overall, it is a must see",
            "review_date": "2014-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "75%\nShort on substance but grand in storytelling, 300 is atmospheric pleasure.",
            "review_date": "2014-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At first while watching this movie, I couldn't focus on anything other than how fake the backgrounds looked and how dark the mood was set but as the movie progressed its concept of 'fight to the death' accompanied by its epic battle scenes and masterful CG art, I have to say I was won over.  \"300\" is a delight.",
            "review_date": "2014-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually unique, capturing the look of a comic book successfully on screen. Other than that it's just a torrent of endlessly quotable, yet terrible dialogue and mindless slow-mo stab stab kick action.",
            "review_date": "2014-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "typical zack snyder uninspirational crap",
            "review_date": "2014-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An astonishing account of ancient fantasy portrayed brilliantly in scenes of blood thirsty battles and limbless enemies.",
            "review_date": "2014-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I tried not to groan audibly through this farcical adaptation of history.  About as near a shambles as it could be.  Yeah, great visuals, manly men, villainous villains and some good looking ladies, but the story is perposterous.   The should have thrown Batman in for a few laughs.  No interest in seeing this again, ever.",
            "review_date": "2014-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is purely for spectacle and succeeds at that tremendously.  Viewers should be aware of what they will be getting before watching this.",
            "review_date": "2014-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The action's good, the story's bearable. That's all there is to it.",
            "review_date": "2014-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid but nothing special. Good fight scenes.",
            "review_date": "2014-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two hours of watching hot guys kicking fools down a bottomless pit. The level of testosterone is too damn high!!!",
            "review_date": "2014-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shallow and overbearingly homoerotic, 300 is all style and no substance. Only worth watching for a couple of cool speeches and so you can go \"Wait... is that Michael Fassbender? It totally is!\"",
            "review_date": "2014-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LOVE Frank Miller!!  LOVE Robert Rodriguez!! Should have let HIM direct instead of Snyder! \nDecent film, but Snyder was out of his element and would have been better had the \"Sin City\" crew developed it.\nB",
            "review_date": "2014-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A ton of limbs and blood coming at you during most of the scenes, specialty of Leonidas and the 300 Spartans.",
            "review_date": "2014-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"This is Sparta!\"  300 is a testosterone filled male fantasy war epic from director Zack Snyder.  Based on a Frank Miller graphic novel, the story is a fictional account of an ancient battle in which three hundred Spartan warriors fought to hold off the Persian army from conquering Greece.  In the mist of the blood and the carnage, with the music pumping, it's hard not to get swept up by the action.  And, the rousing speeches about fighting for freedom and honor are inspiring.  Also, the powerhouse performances of Gerard Butler and Lena Headey bring a lot of charisma to the film.  But Miller screws things up by mixing fantasy creatures into this gritty war tale; and the makeup effects are rather gruesome.  There's also some needless sexual gratuity.  While 300 is amazingly powerful, it's also uneven and overproduced at times.",
            "review_date": "2014-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bloody and violent, just what you'd want I a movie like this",
            "review_date": "2014-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this film well it was shot on digital camera so its technically not a film so ill stop being pretentious and just call it a movie ok so this movie isn't trying to be historically correct its trying to be a fun action-epic and it is indeed epic it succeeds on everything it trys to accomplish and in thats why I consider it perfect not because its as good as fight club but because its flawless",
            "review_date": "2014-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shit shit shit shit, deserves no stars, such a CGI homo-erotic piece of trash",
            "review_date": "2014-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, it was a glorious blood bath...not to mention the amount of nude scene I will see in my entire lifetime.",
            "review_date": "2014-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's sometimes pretty good looking, but always totally mindless.",
            "review_date": "2014-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic! Blood thirsty...",
            "review_date": "2014-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not too bad. slow mo was annoying as hell",
            "review_date": "2014-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This marks the directing debut of Zack Snyder as well as his trademark of making films. This made Gerard Butler more famous as his performance as Leonidas marks the Sparta world into our minds and into our history. A very well made and visually awesome film with thunderous slow motion fights that we can't forget. 3.5 out of 5",
            "review_date": "2014-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually exciting, gory, horrific and overall it's a very satisfying movie to watch.",
            "review_date": "2014-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing. If you have a weak stomach it if you are a pacifist, don't watch.",
            "review_date": "2014-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gerard butler shouts a lot. Still don't know what they were fighting for and why dhalsim from streetfighter had the last say on everything.",
            "review_date": "2014-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A visually pleasing and exciting film that is probably the manliest man film in creation. The quotes are as epic as the super slow motion twirly wirily ninja fight scenes.",
            "review_date": "2014-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thoroughly bloody and entertaining.",
            "review_date": "2014-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simple-minded and visually good made film. This is Sparta!",
            "review_date": "2014-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simple? Yes. But entertaining? Hell yes. Amazing computer graphics and special effects make 300 one of the most entertaining and graphically advanced motion pictures of its time. Macho and gory, 300 is the essential male movie, equipped fully with one-liners and iconic scenes. Iconic filmmaking makes for Zack Snyder's best film.",
            "review_date": "2014-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The cinematography was spectacular, with an amazing feel. But the movie as a movie was horrible. And even though there were many quotable lines and more than many slow motion sequences, it was still kinda stupid.",
            "review_date": "2014-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one of those movies I hate that others love. I realize this is an adaptation of a graphic novel and that it's not meant to be historically accurate, but that's not my biggest beef with this movie. My biggest beef is that it feel more like a surreal blend of cartoons and video games, and it doesn't look great at all. Plus, the depiction of Xerxes is absolutely ridiculous!!! 1/10.",
            "review_date": "2014-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A visual treat that's not shameful to enjoy, 300 doesn't deliver a well-written story but it does deliver a lot of decapitations. I'd like to think that's close enough.",
            "review_date": "2014-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They used waaaaaay too much slo-mo. But I liked this one it was cool.",
            "review_date": "2014-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 is quotable and overall a great experience. \r\n\r\nThe movie is based on Frank Miller's graphic novel of the same name, which took some liberties with the actual story of one of the most famous suicide missions in history. In fact, the allusions to this story from the Sin City comic book were removed from its movie version no doubt because this film was coming down the pike. But regardless, we're not here to discuss how well the movie holds up to history, since it was obviously never anybody's intention to tell an accurate story. Miller's work is very stylized and the movie grabs some of that, and just as Sin City was a hyper-noir in a stylized world, Zack Snyder and his crew make a similar bit with this film. It's not real. It's not meant to be real. It's supposed to be a sort of hyper-fantastical sword and sandals piece, so you can believe in giant ogres with axes and crazed war rhinos and shit. If you can buy into the world, you can roll with the story.\r\n\r\nThe good news is that the world is pretty well executed, apart from some glaring Gladiator references--and I can't for the life of me decide if they were homages or ripoffs. What is it with wheat, anyway? Regardless, with the addition of a CG wolf at the beginning that doesn't look quite like a wolf should, it's fairly obvious we're in story-land, or some very violent county of it, so pretty much anything odd can be chucked out the window as long as the story keeps our attention. And it does, though I'll be perfectly frank: there's not a lot of story to be had here. I mean, let's face it: it's The Perfect Storm with spears. If you know your history, you know what's going to happen, so there's an added handicap (how do we care about characters when we know from jump-start that they're going to bite it?) And let's face something else to that once the attack starts, it's pretty much wave after wave of attackers and blood flying and shit like that. And...that's all. Granted, they try and step up the attacks so there's always something interesting to watch happening on the screen, but it's easy to see why a B-story of what's happening back home was added in to try and give us something between gory smackdowns. Still, the smackdowns are not just gory, but gorgeous. They're operatic in scale and treatment and the battle scenes are balletic in how the Spartans disembowel folks. I know that sounds nuts, but it works. It's hard to bring to mind a violent film like this where the violence was so stylized. It seems perfectly natural to watch heads and limbs soar through the air. \r\n\r\nIt's a film that's full of violence and testosterone, but that is what we were promised. You should know what you are getting into.",
            "review_date": "2014-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very effective film, especially in the visuals, and while the storyline is thin, it's still an exciting experience.",
            "review_date": "2014-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very overrated movie that cares more about slow-motion fight and sex scenes than good acting or storytelling.",
            "review_date": "2014-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i was duped.  i watched to the end and then realized the movie was sooooooo gay.",
            "review_date": "2014-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A stylized visuals that influenced the many Photoshoppers out there.\n\nHey, I liked it, too!",
            "review_date": "2014-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(Sorry for my bad english) The adaptation of a graphic novel does not excuse the poorness of a script. In fact, I liked the first time I saw it. But then you realise the special effects cannot support a movie based in ridiculous quotes and an exhibition of steroids and abs, which happens to convince everyone who only wants violence and CGI.",
            "review_date": "2014-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "love this movie one of the better of the time period movies. besides others that are great..",
            "review_date": "2014-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Could have been better. But by no means was it bad. \n\nActing 8/10\nAction 8/10\nStory 7/10 \nCast 5/10",
            "review_date": "2014-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the graphic nature of this film may turn heads but if you can stomach alot of gore this is quite the experience. with superb action, lots of power, a good cast, and more than adequate performances 300 is a very worthy adaptation of its source material.",
            "review_date": "2014-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good action, a lot of blood.",
            "review_date": "2014-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Turn off your brain, and watch homoerotic, sword fighting blood shed.",
            "review_date": "2014-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 is a visually entertaining movie with some really good quality action scenes. While some parts of the movie may come off as weird and unusual, 300 is nevertheless a really fun movie with a simple goal... To entertain.",
            "review_date": "2014-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Silly fun, a lot of homoeroticism and a surprise ending that is o not Hollywood I really like this movie.",
            "review_date": "2014-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although historically inaccurate, Zach Snyder does an amazing job and Gerard Butler truly captures Leonidas",
            "review_date": "2014-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly beautiful film in both story and visuals.",
            "review_date": "2014-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing. Plenty of blood to spare!",
            "review_date": "2014-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THIS IS SPARTA!!! This is just one of many memorable quotes. Zack Snyder's 300 is visually striking, and has exciting slow-mo bloody action.",
            "review_date": "2014-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It gets really exhausting how much fake gore and violence there is",
            "review_date": "2014-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Meh. Probably what you'd expect. Entertaining, pretty cool in parts.",
            "review_date": "2014-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's an exciting war movie for me to have some idea how Spartan soldiers were like.  I know Sparta by name but do not know so much about their training system nor how Spartan soldiers were like. The war movie directly projects the essence of Spartan soldiers in an entertaining and easy-to-understand way. Some people say it is not precise to the history but to justify how it is precisely based on the historical facts is not the only way to enjoy the war movie. We should rather appreciate an general idea of Spartan soldiers which the war movie projects. I have no idea how much we can trace the history in that era but it is a step forward for me to have the projection.",
            "review_date": "2014-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was just fun to watch. Not really great in anything, just entertaining.",
            "review_date": "2014-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 is a purely made for men epic, with a barely existent plot and a lot of slow motion action shots. It benefits heavily however from its historical base and the intensity of the action, which is equal to many of the great war epics. The positives of Snyder's film style are on full display here as well, with all the stunning visual effects that accompany them. An entertaining watch at the very least and a really solid film throughout.",
            "review_date": "2014-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Manly-Man's movie, '300' is visceral, over the top macho violence at its finest. Of course, a distinct visual style with careful slow-mo usage, an epic, chorus heavy score, and a commanding screen presence in Butler's Leonidas go a way to help.",
            "review_date": "2014-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Then we will fight in the shade.\"\n\nSlow mo graphics, lines, and characters all mixed into one. The storyline is influenced by history which makes the story overall much more credible, Leonidas's performance as well as his connection with his fellow brothers, gave the audience compassion during the longest video game cut-scenes and buckets of blood upon the mountain of corpses that laid in their wake which gave finesse to the characters almost gracefulness. Overall, one of the better gory movies I've seen, if your into core, it's here.",
            "review_date": "2014-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the graphic is good, so does the strategies used.",
            "review_date": "2014-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kinda dull if you prefer relatable characters instead of cardboard cutouts, but the film looks so good and the violent scenes are so well-staged that the film still manages to entertain throughout.",
            "review_date": "2014-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its fun, exciting, gory, action packed, suspenseful, strong feel of adventure, simple crazy characters though very dark an all out silly movie I like it.",
            "review_date": "2014-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Blood, gore and boobs. Frank Miller all over.",
            "review_date": "2014-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw this in theaters",
            "review_date": "2014-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes, the action is fantastic but the film's story is too disjointed.",
            "review_date": "2014-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that revolutionised epic war films. Very underrated.",
            "review_date": "2014-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this movie ended up being greater than imagined by the producers. It seems to accidentally become one of the most entertaining battle movies ever. Very poetic in its metaphorical undertones and well executed. Gerard Butler is awesome.",
            "review_date": "2014-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bad - ass and epic this is one hell of a movie , YOU ARE AN IDIOT IF YOU HAVEN'T SEEN IT .",
            "review_date": "2014-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seemingly based of of the \"make every scene a work of art, and every sentence quotable,\" it creates a sense style though often weird is so incredible, it more than makes up for the lack of plot.",
            "review_date": "2014-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually striking and when at its best very entertaining. Unfortunately, for the bulk of the movie 300 barely overcomes its shallow plot. Gerard Butler helps by having a more than stellar performance.",
            "review_date": "2014-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Plenty of action, gore and well muscled men. What's not to like?",
            "review_date": "2014-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is insane so much action and gore. Leonadis was a badass one my personal favorites",
            "review_date": "2014-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zack Snyder continues to establish himself as a visual director with no ability to construct an interesting story.  Yes, '300' is bloody and the slow motion shots are sometimes entertaining, but when you have almost two hours of film, it gets old pretty fast.  Gerard Butler as Leonidas is probably the meathead that Snyder wanted, but he certainly is not a character you can get behind.  Butler's charisma and commitment is not enough to overcome the lame events around him.  Still, most viewers will find some entertainment in this action hack and slash flick.",
            "review_date": "2014-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very action packed, but was disappointed with the historical accuracy.",
            "review_date": "2014-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fight scenes were epic.",
            "review_date": "2014-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow is all i can say this movie is amazing and the ending is fantastic.",
            "review_date": "2014-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yayyyyyyyy. Slow motion the movie",
            "review_date": "2014-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was the FUCKING SHIT!!! The action is intense and there's a shitload of limbs flying EVERYWHERE and SEX, RAPE, and SEX!!! The story kicks major ASS so watch it right FUCKING NOW!!!!!!!!!",
            "review_date": "2014-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you were ever a kid and thought that an action movie would be so much more fun if you took out all the plot and made it nothing but fight scenes, this movie will teach you otherwise. The fight scenes are ridiculously repetitive. Slow motion adds about twenty minutes to the movie. There are moments when it more or less rips off the Lord of the Rings franchise.\nI spent my time pointing out historical inaccuracies because I was so bored.",
            "review_date": "2014-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It may be more boyish than mannish, but 300 is a groundbreaking entry into visual filmography and is, who am I kidding, pretty freakin' awesome.",
            "review_date": "2014-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just one word to describe this... EPIC!",
            "review_date": "2014-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spectacularly intriguing and breathtaking. Sure, it's not accurate, and at times has an excessive amount of slow-motions, but I gotta say I enjoyed the hell out of \"300\".",
            "review_date": "2014-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is top grade:  Big action movie but done with such a visual style, it propels it above the generic, big budget, Hollywood-style action movie (like a Troy, which failed much and isn't worth watching unless you're really bored).\n\nI notice the critics pooed the film while the audience here at Rotten Tomatoes gave it much higher marks.  That was to be expected:\n\nCritics are not macho people.  They talk like they are when they belittle a film mercilessly, but 300 is a guy movie, and critics are not big fans of \"guys\".\n\nBut, again, what makes 300 special is that it is a typical guy flick with a very well done visual style.  It is based on a graphic novel, and the people who put this together did an excellent job of capturing that graphic novel style in moving pictures.  Well done...",
            "review_date": "2014-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Being historically inaccurate has no bearings on how amazing this film is.",
            "review_date": "2014-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "6 out of 10\nToo humorous for what I was expecting..",
            "review_date": "2014-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "best greek Mythologic movie",
            "review_date": "2014-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "visually stunning in every frame",
            "review_date": "2014-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While stylish and violent, this film should never be taken seriously.",
            "review_date": "2014-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really like this movie. Visually it's beautiful. Every shot looks like a graphic novel drawing done perfectly. Maybe some of these big time movie reviewer's can't see it but I can see the care Zack Snyder took with each shot. The simplicity of the script adds to the dream like quality of the film. If you've ever imagined what it would've been to exist in some far ancient time, too many words would spoil the fantasy. Well done.",
            "review_date": "2014-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One word (Epic)! Gerrard Buttler stars as King Leonidas in this ultimate CGI action remake of the original 300 Spartans. The movie features amazing dialogue, beautiful scenery and blood thirsty violence. Perfection!",
            "review_date": "2014-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies ever made! I loved it! The action is incredible and the actors are charismatics! This is SPARTA! Frank Miller's Comic Book-Zack Snyder adaptation! He did a great, great job! 10 out 10!",
            "review_date": "2014-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The writing is more fitting of a WWE event than a greek epic!",
            "review_date": "2014-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked the second one a little more",
            "review_date": "2014-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely a guy movie.  It's a war movie with fantasy tossed in.  It's a good watch, even if I didn't like the background political messages they attempted.",
            "review_date": "2014-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a rather racist and sexist spectacle that is faithful to historical record only in it's rough outline.  The depiction of Xerxes, and the Persians, generally, is particularly ridiculous--Xerxes is effeminate, wears make-up and has strange, futuristic looking piercings.  The Persians, generally, are all people of color and are depicted as monsters who are sexually perverse and diseased. This is orientalist racism as it's finest.  There are no girls or older women.  No woman appearing in this film was allowed to keep her clothes on--there is a display of nubile breasts on a regular basis throughout the film.  Gorgo (the wife of Leonidas) is known throughout history for her strength and wisdom, but in this film, the director imagines her getting raped.  That she gets her (again imaginary) revenge on the perp is no remedy and has nothing to do with the plot at all.  As a fan of Zizek, it's embarrassing to me that he saw fit to write two whole pages about this film--in order to make it something other than dumb, you really have to squint and do some mental origami (which is something Zizek is good at, I allow).",
            "review_date": "2014-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very impressive visuals for the most part, but too much slow motion and not enough going on for it's bloated run time.  For all the gore and action I was extremely bored.",
            "review_date": "2014-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was good. It has an amazing storyline. But the effects were a bit cheesy at times. There was a lot of CG technology used, including green screens and other types of effects. The acting was great, the cinematography was good and the direction was perfect. Telling a story about Gladiators is never easy. But this film should take everyone by surprise. Yes, things get cheesy and predictable at times. But it isn't to bad of a movie. 300 tells the story of a a Lord/ King who goes to war against the  Persians who have taken over other kingdoms and have captured some of the citizens and they're now slaves. The Spartans fight to keep their freedom. Their saying goes: Never surrender, never retreat, show no softness (weakness) and if it comes down to it, die for your kingdom.",
            "review_date": "2014-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ultra-violent and blunt in the telling, Snyder never-the-less manages to create a visually engaging picture.  The movie is filled with creative imagery and some interesting ideas.  Despite the great visuals, the film may have limited value for a second viewing.",
            "review_date": "2014-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300\nDirected by Zack Snyder \nThe film star is Gerard Blutler\nThe main chracter is the King Leonidas who is the King of Sparte play by Gerard Butler\nThis is a Drama and action film\nThis is a story of the King Leonidas who want to protect Sparte because the God Perse Xerses.For this Leonidas rally 300 wariors to face the warriors of Xerses \n\nThis is my favorite movie because this is an action and epic film,and the actors are very cool.The differents caracters are so epic and courageous  and the graphique are just wonderful and the dialogue are so epic,violentand entertaining ! But this is not very realistic.\n\nGenerally I find this film absolutely fascinating .I recommend this film to anyone who loves.If you haven't seen it yet,you don't know what you have been missing",
            "review_date": "2014-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, I'm not a big fan of such artificial pathetic movies. I know it's a comic book adaptation but sometimes its historic inaccuracy hurts, the dialogue is pure dripping cheese and the acting lacks seriousness. However I have to admit that the well choreographed slow motion fight scenes will stay in your mind with all their bloodiness.",
            "review_date": "2014-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well it isn't the most ingenious movie ever... but it is filled to the brim with some fantastic stylized action and testosterone and in the case of 300 that was all it needed.",
            "review_date": "2014-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The style is fantastic but it's just not enough of story. The action is so sick though.",
            "review_date": "2014-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just the cinematography alone is worth seeing.",
            "review_date": "2014-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great blood and guts movie. Fun to watch!",
            "review_date": "2014-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "gr8 story action EFX i liked this one",
            "review_date": "2014-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Go tell the Spartans, passerby..that here by Spartan law we lie\" , words fail to describe this true masterpiece seriously Officially one of my top favorite movies!",
            "review_date": "2014-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An action masterpiece, this is such a motivating, empowering movie, not heavy on plot lines but that is not expected of it, in spite of that it is still spectacular",
            "review_date": "2014-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This sublime script and cinematography had great acting to match. This humourless war film strikes me as more of a man show, and I am one man who finds this a more memorable film than most I have seen.",
            "review_date": "2014-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie makes me want to go to gym !!!! this is Sparta!!!!",
            "review_date": "2014-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bloody but good story",
            "review_date": "2014-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "awesome flick.. critics need to get laid",
            "review_date": "2014-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "May be a bit overly stylized, but 300 is a riveting and just plain awesome action flick that never stops astonishing the viewer with its beautiful visuals, committed performances, and ready-made movie quotes.\nFull Review: http://tylerdscreation.wordpress.com/2014/03/22/300-2007-review/",
            "review_date": "2014-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I decided I ought to see the first 300 before I saw the second. \n\n300 is based off of events that occurred in Ancient Greece. Basically, the Persian Empire is threatening to conquer Greece, so King Leonidas of the Spartans chooses his 300 best men to accompany him to fight the Persians. You should know that all of the 300 die in the end. It's not much of a spoiler. The point of the sacrifice was to show the rest of Greece that the only way to stop the Persians was to unite all of Greece. \n\nI thought that 300 was a good action movie that is entertaining and has a good script. Many people complain about the unrealistic monsters in it, but the events are being shown as they were told on the account of Spartans in an exaggerated way. \n\nThis movie was shot mostly behind a green screen, which for the most part looked fine. It has a lot of special effects added. \n\nThe acting is also very good. Gerard Butler is awesome as Leonidas, and all of the 300 are great.\n\nThis is not for kids. There is a lot of violence, blood, and bodies. There is also some female nudity in it.\n\nOverall, 300 was a fun movie that did what it was made to do and entertained audiences.",
            "review_date": "2014-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it.  I really dig the graphic, stylized frame by frame look of the movie, and just the whole super fantasy world created by Frank Miller.  They need to make all the Frank Miller graphic novels into movies.  They need to make more graphic novels in general into movies.  The visuals are amazing.",
            "review_date": "2014-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is where I first fell in love with Gerard Butler",
            "review_date": "2014-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Furious 300\n\tHistory of the Spartans tells a story who guarded their land by the Persians from conquering. The Persians had an outrageous number of warriors fighting a few hundred Spartans. These Spartans were able to fight until it resulted in their own death. One Spartan can kill five to ten Persians. This was an extraordinary story of how the Spartans defend their people and homeland. This story was created into a movie called 300 that was released in March 9 2007. 300 is a well develop sensational movie that uses specific details in different areas to help craft the movie which is the animation, violence, time, voice, appearance and color.\n\tThe animation in the movie 300 looked very realistic, creatures that were created through a computer. These creatures having human body parts except for their faces that look devilish. There is even a giant that didn't look human. This giant that stand seven to eight feet tall, scars on his body that human bodies couldn't survive from. There was bumps coming out on different sides of his head, as if it look like he was beaten with a metal bar. I thought it was very impressive on their skills on these fictional characters being brought in to the story, to bring as much entertainment to the audience watching this movie. This brought my attention to the creative and detail characters they made in the movie. \n\tViolence was the most important part of the movie for me, showing the events of war. They show amazing fighting skills, when the Spartans use their spears to pierce the Persians in their chest and limbs. The blood was very little in my opinion throughout the whole movie. I think the movie could have showed more blood for the body parts that was being lost in the fight scenes. I was expecting to see the floor filled with blood with the amounts of dead bodies that was piling up. There is a scene where there is a wall of dead bodies but doesn't show blood falling down from them. I think they should have at least put more red paint on the bodies, it would have seem more realistic. The scars on the Spartans should of have seen like dry blood with a lot of air it had been exposed to, but it all look like clean cuts. \n\tThe length of the movie that I was expecting was about two and half to three hours long. This can explain every detail of the movie and won't rush this extraordinary historical story. The actual length of the movie is exactly 117 minutes, about two hours long. The movie was rush in certain areas of the movies, like the expressions on the citizens faces in Sparta finding out what has happened to their warriors. This movie could have been expanded around forty minutes covering the expressions and emotions with the people reactions to the dramatic disaster in a bloody war.  They could have shown the reactions to all the Spartan wife's, finding out their husbands have died in war. The movie could have been longer, to show how the Spartans was able to eat on their long trip. The Spartans hunting down animals to survive their trip to war against the Persians.\n\tVoice of the Spartans and Persians were very noticeable throughout the whole movie. I was looking for the tone of their voice and loudness. The Spartans spoke the loudest with a deep tone that sounds like a lion's roar. This showed their aggressiveness and confidence, making it seem like they will destroy the Persians with their army. The Spartans was not scared and showed their courage against an enormous army that can determine their faith. It felt like the Persians were little ants and the Spartans were the tide waves of the deep ocean that are going to wipe the Persians away from land ending them in death.  The voice of the Spartans was very clear and loud compared to the Persians. The Persians voice sounds like whispers, as if they were frightened of the dark. I thought the voice was excellent and was exactly what I was expecting from the movie.\n\tI was looking at the appearance of the Spartans and Persians clothing. The swords, shields, helmets, and body armors is what I was looking for. This shows how fierce the battle is going to be. The clothing of the Spartans was only a spear, shield, and a helmet with no body armor. This showed me their confidence in fighting against to the Persians, it seem like they didn't wear armor with their great fighting skills. The Spartans confidence showed that they didn't feel intimidated. The Persians had a full load of armor on their entire body, covering almost every piece of skin. They had every piece of great quality equipment compared to the Spartans. I look at this as if the Persians were scared, even with the large amounts of warriors.\n\tDifferent colors have many different meanings; I think the movie 300 showed this a lot with the characters.  The two main colors that were mostly shown throughout the movie were red, and gold. Red means anger, danger, and much more. This represents the Spartans with their red clothing, they were very deadly, sending death to numerous of Persians. The Spartans were filled with anger with the Persians trying to conquer Sparta. Gold means quality, wealth, and have much more meaning. The king of Persia wears lots of gold covering his body. This represent the king living wealthy, having everything he wanted. The quality of his army weapons and shields was excellent, looking like the metal can't be pierce so easily. The colors meaning of the movie 300 was perfect in representing the characters.\n\tI think overall the movie 300 should be seen by everyone who is interested in history. I think this movie is a must see, It received great ratings from the critics. This movie shows excellent animations and violence throughout the entire movie. The voice and appearance of these Spartan warriors is outrageous and shows a huge difference compared to the Persians. The colors were very great in what the characters symbolize. The time of the movie was a little short, which should have been extended longer. This movie overall is incredible. You will be amazed and surprised after seeing this remarkable movie.",
            "review_date": "2014-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 is just strong bloody violence as the certificate suggests and one battle after another (I mean the first act started off interesting but then it got a little boring and unwatchable), with only a typical medieval plot. Let's hope the sequel is a step up and not a step down from it's predecessor.",
            "review_date": "2014-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hollywood does not have to be historically accurate they just need to give us a good movie. The action scenes are good, the visuals are stunning, but I got pretty sick of the slow motions.",
            "review_date": "2014-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "...a full-bloodied epic filled with stylized action and gleaming thematic violence to a satisfactory movie experience.",
            "review_date": "2014-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "awesomeness can't wait for the next one!",
            "review_date": "2014-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great awesome movie with great gory action and a good story.",
            "review_date": "2014-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 I found to be an entertaining timewaster, as well as fun eye-candy.  Zach Snyder may not be the best in terms of story and plot but I can always count on him when it comes to great action and great visuals.  He also does some great music here and there.  While he is not good at coming up with his own unique stories, he is great when it comes to adapting other people's work.  I am not familiar with the comic by Frank Millar, but from what I hear the movies follows it fairly accurately.  For what 300 was I was entertained.  \nThe story is fairly simple.  It takes place at the time of ancient Greece.  The Persians have declared war on Greece.  A messenger is sent to Sparta to join them but they refuse.  Now a group of 300 Spartans led by their king, Leonidas (Gerard Butler), must fend off the Persian army to prevent them from reaching Sparta.\nThe style and the action is what drives this film.  If you are looking for a deep film with deep character then look elsewhere.  If you are looking for a historically accurate film then look elsewhere.  Even though this was a historical event this film is based on a comic first-of-all.  This film relies on its mindless action, special effects, and style to carry it.  I found the style enjoyable because I had not seen many films with this style before this.  The action scenes were really good as well.  I even like the slow motion.  Many people dislike slow motion but I did not mind it too much.  The film also gets very bloody.  If you do not like bloody films then do not see this.\nThe problem is that most of the cast is easily forgettable.  The only somewhat likable character that you remember is Leonidas.  He is definitely the character everyone is drawn to and Gerard Butler does a good job performance-wise.  However, I did not care for any of the other characters which is a problem.  Another thing that got on my nerves was the fake CGI blood.  None of the gore in this is practical and it takes me out of the film.  Also, the villains are very one-dimensional.\nOverall, 300 is style over substance but I found myself entertained.  If you are looking more an entertaining action film with good visuals then you should enjoy this.  If you are looking for more than you could probably skip this.  Also, If you hate slow motion or CGI gore you should not see this either.",
            "review_date": "2014-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 is one of those manly movies you can't get enough of. Its has nudity, violence, and even more incredibly bad-ass, stylized violence. 300 set the bar for special effects and countless movies have tried to copy the incredibly entertaining fight sequences in the film. A simple-enough story to follow (that works effectively) along with some jaw-dropping fight sequences, 300 is a one gory and glorious hell of a time.",
            "review_date": "2014-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a piece of art!",
            "review_date": "2014-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What would happen if you threw CGI at wrestlers? This.",
            "review_date": "2014-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nowadays we get a lot of movies that remind us that war is terrible and that ultimately, it is just an exercise in futility. Not Zack Snyder's \"300\" though. This film, based on the graphic novel by Frank Miller and Lynn Varley tells us that war is awesome and that there is no greater glory than to die on the battlefield, waist-deep in the blood and severed limbs of your fallen opponents. The story begins in 480 B.C., in tiny Greece, the birthplace of democracy and the one true example of freedom and justice is the Sparta, the city where the world's greatest warriors are not trained, they're bred. Witness the glory of ancient Greece's Sparta; where children are taken from their mothers and turned into ruthless warriors, where women are just as tough as men, where there is no greater glory than to die on the battlefield, and anyone who thinks otherwise is a spineless coward. The people of Sparta are proud and arrogant, but skilled tacticians and warriors. It's no surprise then, that when the \"god-King\" Xerxes (Rodrigo Santoro) approaches the king of Sparta, Leonidas (Gerard Butler) and demands his surrender, the Greek lord refuses. Forbidden to wage war because of ancient traditions, Leonidas leads a small regiment of 300 \"bodyguards\" to a strategic location where they stand a chance against the army of Xerxes, who brings with him innumerable soldiers.\nPeople criticize this movie for all kinds reasons, some of which legitimate, some of which I say are uncalled for because they're intentional. The lack of historical accuracy, the cartoonish characters, the demonization of the Persian people are put in the film because of the context in which the story is told. This film is based on a graphic novel, inspired by another movie, based on a monument, which is itself a replacement for an even older moment, written by the victors of an epic battle. On top of that, the story, within itself is told from the viewpoint of a storyteller who saw firsthand the vicious battles and is now informing the audience (within the film and in the theatre) of the glory of Sparta, of the 300 and of Leonidas to encourage them to fight. The heroic Leonidas is depicted as a master tactician, a ruthless warrior, a gentle father and a loving husband. He is capable of scaling cliffs with only his bare hands and sandals, capable of single-handedly butchering hundreds of Persian warriors and answers to no one, while still remaining within the constraints of the sacred laws of his country. Who is he opposed against? Xerxes, the complete opposite. Xerxes is a man who forcefully distances himself from the rest of the people by clothing himself in gold and proclaiming himself a god. Xerxes is a tyrant, looking to burn tiny Greece to the ground with an army of slaves he sends into battle by force or fear. The warriors Xerxes sends are either amateurish brawlers, reliant on mysticism and \"cowardly tactics\" (like using projectile weapons) or grotesque monstrosities, raised out of hell to combat against their noble opponents. In fact, anyone who opposes Leonidas, his wife Queen Gorgo (Leana Heady) or the noble Spartans are all the most obvious, slimy and disgusting villains you will see on screen. There is little subtlety in this film, but it's a piece of ancient propaganda, what else do you expect? The characters are either developed only at the barest minimum or painted with the broadest strokes. The good guys are good and can only do wrong when their actions would serve the plot, while the villains are truly despicable. \nThis movie bears only the faintest bit of historical accuracy. Think of the film more like the battle between the noble people of Rohan and the fearsome Uruk-hai in \"The Lord of the Rings: The Two Towers\" than something out of a museum. This is historical fantasy, a violent exercise in masculinity that screams \"War is awesome!\" So, on that note, where does it stand? Well visually, the film is really spectacular. Every shot in the film has been enhanced to show off the earthy tones of stones and fields or the gushing blood as it is spilled. During nightime, the moon is enormous, filling half the sky so that we can have Leonidas dramatically poses in front of it as he reflects on the battle to come. When it rains, there is always clapping thunder and crackling lightning to show that even while his other warriors cheer, King Leonidas keeps his mind focussed on the war to come. There are always dramatic shadows and loving shots of the characters in action so that the audience can see all of their epic battle moves. The film uses tons of visual effects and it shows. Even if you're not familiar with the colour theory at work here, with the denaturisation of some scenes and the different tints and uses of contrast to create moods, it's still impressive. Often, the battle scenes are in slow motion, lavishly displaying limbs being hacked off, Persians being skewered and crimson splashes of blood flying at the camera. The choreography is excellent and the camera catches every bit of wanton violence. The film is extremely gratuitous in its violence and even in its few moments of sex.\nThis is a man's movie and it takes itself dead serious, sometimes to a fault. There are some moments where Leonidas and the other Spartans crack jokes, but this is a movie that is actually kind of silly. It's just so over-the-top that I find it hard to understand why people get upset over it. I mean sure the Persians depicted in the film employ grotesque ogres, fanged ninja warriors and a slew of deformed or simply bizarre concubines in order to satisfy any and every perverse fantasy Xerxes, but the Greeks aren't that much better. The Greek villains are shown as cowardly or just as despicable as the Persian generals and our heroes are so arrogant that they come off more as bullies than heroes and it's only because we are naturally drawn to the underdog that we actually end up cheering for them. I don't want to spoil the developments towards the end, but really take a look at the villainous Greeks and tell me if they are not just as vile as the Persians. Anyone who isn't Leonidas and his 300 Spartans are simply the worst people ever. Even the other Greeks who join them in their fight end up looking like real amateurs when it comes to the combat and are frequently made fun of. Once again, this film wants you to believe that Spartans are awesome and anyone else is else going to end up on the wrong end of their spear of quietly awing them in the distance. That's what it wants to do, that's what it does.\nWhen I first saw this film, I was 19 years old and it blew my teenage mind. This was everything I wanted because you know what? It HAD dawned on me that in a world where anyone can just pick up a gun, point and pull a trigger, that war just isn't what it used to be, when good guys were noble and the villains were invading barbarians bent on razing temples to the ground and pillaging noble examples of classic architecture. Wouldn't it be much better if we could all go back to the days where you had to thrust a sword into somebody's gut and watch their life slowly drain from their eyes, rather than just press buttons on a computer and watch monitors tell us that the targets were dead? This was exactly what I wanted; a hardcore, live-action cartoon where the bad guys were monsters and the good guys cut them into tiny pieces, despite overwhelming odds. Now that I've \"matured\" a bit and that some of the razamataz of the storyline has faded, I admit that the movie really could have used stronger characters and a deeper plot. I liked the fact that Queen Gorgo gets more screen time and they show what was going on in the city politics while Leonidas is out (something that is not in the original graphic novel). I also thought that while the character development of Leonidas and some of the more stand-out Spartans was small, it did get me to actually like them. I did wish there was more, but I was shocked to see that this movie was already 2 hrs long considering the thin plot so I guess there just wasn't much room for that. Despite the story that can be summarized in just a few sentences, the movie has many memorable moments and lines (probably the most iconic being near the beginning with the \"pit of doom\") and the film is so visually striking that it really sticks with you once it's over. This is not a great film, but it is a stylish film that manages to wrap you up and get really excited. It has a set of goals it wants to accomplish and because it doles exactly what it wants and because this is one of those movies that will be remembered for a long time, I am awarding it a 4 / 5. If you want a film that's ridiculously violent, bloody, filled with shinning heroes, despicable villains and so manly it almost becomes homo-erotic at times, there's nothing that can beat \"300\". (On Blu-ray, March 9, 2014)",
            "review_date": "2014-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thoroughly enjoyed this. I actually feel silly for not seeing it in theatres so many years ago.",
            "review_date": "2014-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually appealing high-concept blood porn. As compelling as it is absurd.",
            "review_date": "2014-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't really understand all of the love this universally receives. Definitely not a memorable film by any means, at least for me. This mostly came off to me as just a dumb exercise in blood and guts that, while entertaining to a degree, ends up not really leaving a huge impact. Obviously I'm in the minority here, as many apparently loved it, but frankly, I just don't see what all the fuss is about.",
            "review_date": "2014-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While not the kind of movie I typically enjoy, 300 is, entertainingly, no more than you would expect: camera-splattering blood, dismemberment, and all-out ancient carnage. Additionally stocked with impressive visuals, coloring, and costume design, this is a true guilty pleasure.",
            "review_date": "2014-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A refreshing dose of flashy carnage.... felt like I was watching a sport.",
            "review_date": "2014-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Keep in mind, this is an adaptation of a graphic novel, which in turn is very loosely based on a true story. That should tell you enough as to the historical accuracy of this film. However, historical accuracy is clearly not the end game here. This is graphic novel that moves! It's an exercise in over the top stylish violence, and a bloody good one too.\n\nAs a purely visual spectacle, it doesn't get much better than this. Every scene looks like it was cast in polished bronze. It also moves well, using just the right amount slow motion during the battle scenes to highlight a killing strike or defensive move. The story is simple enough, but it also feels important. That's despite the fact most of the 'uber-buff' cast are half-naked for most of the film! But this isn't all muscle and no brains. If it was, 300 could have easily been unintentional hilarious! Fine performances from the cast, especially from Gerard Butler, bring an emotional weight to the film. This in turn makes it possible to look beyond the visuals, because you'll find this film has more to offer.\n\nMovie Prep:\n\nThis is very violent, but in a cartoonish way. More style than raw blood thirsty gore. That style inspired other productions such as the Spartacus TV series and the more recent (though terrible) Legend of Hercules. The plot is pretty simple and easy enough to process. This is mostly style over substance. But it's not totally devoid of substance. So if you are okay with that - enjoy!\n\nBest Format:\n\nIf a theater near you were screening this I'd certainly recommended you watch this on the big screen. At home, a HD showing is the way to go.\n\nBest moment for me: >\n\nThe 'This is SPARTA!' moment. Right before King Leonidas (Gerald Butler) kicks a Persian messenger into a deep dark pit.\n\n-> http://www.TalkieGazette.com\n\n-> http://www.facebook.com/talkiegazette\n\n-> http://www.twitter.com/talkiegazette",
            "review_date": "2014-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfect telling of a legend.",
            "review_date": "2014-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this shit !!!!",
            "review_date": "2014-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Greco-Persian badassery!",
            "review_date": "2014-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The effects are beautiful,  and the narration is dark and gritty. The fight scenes stand out, and Butler gives a commending performance.  The actors prepared nice for this movie and it pays off.",
            "review_date": "2014-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What it lacks in subtlety, 300 more than makes up in brutality and sheer awesomeness. Zack Snyder is a great visual director, and there's an undeniable elegance to the film's stylized violence. Add a strong performance from Gerard Butler, an epic score, and many unforgettable quotes, and you have a simple-minded, but exhilarating film about honor, victory, and courage.",
            "review_date": "2014-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Climactic! Just when I thought it had ended in an anti-climactic way, here comes the armies! Impressed.",
            "review_date": "2014-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I especially liked the visuals, the characters and the editing.",
            "review_date": "2014-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It isn't a movie for people who love to analyze every little detail. It was a dumb fun movie to watch badass people killing others. 8.1/10.",
            "review_date": "2014-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gerard Butler brings life to the character of Leonidas. Zack Snyder's direction is impressive.",
            "review_date": "2014-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "attractive muscle bound sweaty guys in scant costumes.  i'm so naive that it only hit me after i watched it who would love this movie.  gay gay gay.",
            "review_date": "2014-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "best movie ever wish i had it again",
            "review_date": "2014-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ABSOLUTELY LOVED THIS MOVIE!!!",
            "review_date": "2014-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Regardless of the historical liberties it took in telling the story, it was an action packed, well filmed, in your face guy's movie. I'd take Gerard Butler like this any day of the week.",
            "review_date": "2014-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overrated. The trailer was better than the movie.",
            "review_date": "2014-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I seem to have enjoyed this more, the first time I watched it, long ago...",
            "review_date": "2014-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I unapologetically love this film a lot and I'm sticking with that opinion.",
            "review_date": "2014-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A massive movie with brutal, intense, and thrilling non-stop action!",
            "review_date": "2014-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid comic book adaptation! The movie is an action fest! Non-stop really! The film is about the brave 300 Spartan warriors who held off thousand of invading Persians. The cast really makes the movie. Gerard Butler is awesome as King Leonidas. His fiery passion makes you actually care about what happens. Overall, a high recommendation!",
            "review_date": "2014-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wish i could sit through a double feature.",
            "review_date": "2014-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a way of life back then and still applies to the way of life now. Stand up and fight for your family , your people and your good beliefs. It's a highly motivating movie to better yourself physically and mentally and people who think bad or other wise , well I guess they fall short.",
            "review_date": "2014-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cool movie! Awesome battle scenes too!",
            "review_date": "2014-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 is one of the most bad ass movie experiences of all time. From its intense slow motion action, to its goriness, 300 has become a standard for epic sword films.",
            "review_date": "2014-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that's simplistic and ultimately emotionless, but is still an amazing visual experience. Some of the most beautifully orchestrated fight sequences I've ever seen.",
            "review_date": "2014-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The beautiful people vs the odd and strange. I was routing for the Persians by the end.",
            "review_date": "2014-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stylishly entertaining and visually delightful. \"300\" May lack in substance, but it's slow-motion fights, dazzling scenery and relentless screaming dialogue, keep it interesting enough.",
            "review_date": "2014-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great guilty pleasure movie with exciting violence and just the right amount of backstory to justify calling it a movie. Certain liberties taken with the truth, but its made for entertainment and thats the job it does well.",
            "review_date": "2014-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"LEONIDAS, KING OF THE SPARTANS\"  \n\n- '300' is a 2006 fantasy action movie from director Zack Snyder (Man of Steel, Watchmen, based on the comic books by Frank Miller and Lynn Valery who were inspired by the historical Battle of Thermopylae. The story is (too?) simple: 300 half naked six-packed Spartan soldiers go to war against the invading and much larger army of the Persian king Xerxes. The whole film has a very likeable comic book feeling: the slow-motion fight scenes and the CGI blood spatters are cool. I also like the monstrous adversaries. In its cast we see Gerard Butler (Law Abiding Citizen), Lena Headey (Game of Thrones) and Rodrigo Santaro (I Love You Philip Morris). A sequel is momentary playing in the theatres. '300' is a guaranteed popcorn movie.  \n\nWhen the giant Persian king Xerxes (Santaro) invades Greece with his large army, Leonidas (Butler) who is king of Sparta assembles 300 of his well trained soldiers to join him into battle. Leaving his wife Gorgo (Headey) and son behind, Leonidas and his men head to the shore. There they meet Ephialtes, a hunchbacked exiled Spartan, who wants to join them, but is considered not fit enough. While the Spartans battle against the monstrous troops of Xerxes army, Ephialtes who feels hurt goes to the camp of the enemy to offer them his help...",
            "review_date": "2014-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing story on how the Spartans go to war with the god king with the persian empire",
            "review_date": "2014-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cool battle scenes that's about it",
            "review_date": "2014-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very fast paced movie with very few dull moments and proves that violence does solve somethings.",
            "review_date": "2014-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I honestly think that no thought was put into this film",
            "review_date": "2014-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solidly directed film and the style and slow motion really works here, All though their is too much style over substance - 7.5/10",
            "review_date": "2014-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was pretty good, but it had two huge letdowns for me. One was just how animated it looked. This movie was mostly CGI I know but it was to obvious and that was a real letdown for me. Another thing was although the action scenes were pretty good, why the heck do they bring in the mythical creatures, like the giant, and the other wierd animal people. It seemed really uneasesary and that was a nother problem I had.  But the movie was pretty good and the ending was very good too. It's nice to have a movie where the good guys don't live happily ever after and are victorious, it's a good change. Not as violent or gory as the second 300 but problably the better movie.",
            "review_date": "2014-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exhilarating, Fantastical Cinema Epic in all of its Glory! Memorable 1 liners for us to use and abuse, Abs to die for, balls to the wall battle sequences, monstrous mythical creatures, Slow Motion sequences to make the cool look even cooler! A cinematic smorgasbord that has something for everyone!\n\nEntertainment with an attitude! Pure Eye Candy!",
            "review_date": "2014-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All I have to say about this movie is THIS IS SPARTA!!",
            "review_date": "2014-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To the right a mountainous wall, To the left a deep sea, and in front 400,000 Persians. 300 is the story of Leonidas and the 300. It is how the Greeks defend their country from the invading Persians who come to enslave the Greeks. Xerxes the Persian king wants to own the world, but Leonidas believes in the free man. And so began a war with the Greeks and the Persians. \n\nI Recommend this one. it's a good history lesson if nothing else.",
            "review_date": "2014-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie boasts an original look, but that is nowhere near enough to make up for bland rehashed action scenes, and muscles standing in for a script.",
            "review_date": "2014-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Greek historical movie I've ever seen! It's also educational to school kids in middle school! I DO NOT RECOMMEND THIS MOVIE TO ELEMENTARY STUDENTS AND LOWER!",
            "review_date": "2014-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's not much to say for this shot by shot adaptation of the comicbook. The book already proved worthy of excellence and incorporating that on film with minor changes, it's simply a blockbuster. Snyder's eye-poppin' visual effects also did the trick to imagine the last stand of the Spartans in a glorious way that the comicbook can't.",
            "review_date": "2014-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great film. I really like Snyder's direction and the way he films things, as well as the golden tone the film has - which really sets the movie's mood. The acting was really great and both the visuals and score really brought life to the film. 300 is also great if you're into the Greek mythology or if you like comic books.",
            "review_date": "2014-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I recently sat down to watch this for the first time because of the upcoming sequel. The movie gets off to a slow start, but beginning with the appearance of Xerces, wow. I'm eager to see how the Xerces character develops in the sequel.",
            "review_date": "2014-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic, loved the movie.",
            "review_date": "2014-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing film. It's shot with pure class, and the battle scenes are immense.",
            "review_date": "2014-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Very Fantastic visualization film that in every way makes it very stunning including a terrific direction by Zach Snyder.",
            "review_date": "2014-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Should have been rated this",
            "review_date": "2014-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie. A must see war movie. I am going to see 300 raise of an army.",
            "review_date": "2014-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best movies i've ever seen",
            "review_date": "2014-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A cool action movie that kinda makes parts of this true story fake and real but it's a hugely entraining movie with the action sequences about honor, glory and war.",
            "review_date": "2014-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is cheesy and simple minded, but you will remember likely the 80% of the quotes of this film, you will hang to your seat with the visuals and you will even felt bad for Leonidas and his army at the end.",
            "review_date": "2014-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "because its ancient history. and a fresh way to look at spartans",
            "review_date": "2014-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 is an interesting movie, but contain weird, boring and slow scenes which made it boring, not to mention the irritating yellowish environment. The story in 300 is okay, and I really enjoyed the fighting, because it was so cool. The music in this movie is great, the actors are awesome and I really liked the ending, compared to the awful opening scene. The beginning was also to slow, and it continued to have a low tempo through the first part of the movie.\nGenerally is 300 an okay movie, but there was nothing unique or spectacular in this movie, and it felt boring at several occasions.\n\n300 gets a 6/10",
            "review_date": "2014-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If I could give this movie 0 stars I would",
            "review_date": "2014-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "61%\nNothing more than a boring spectacle. But what spectacle it is!",
            "review_date": "2014-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing action, acting not bad, amazing graphics style and the music has a good edge.  Even though this film just doesn't hold together very well it still satisfies.",
            "review_date": "2014-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Violence, blood, gore and sex. In something like this, you can't ask for much more. In other words, I enjoyed it.",
            "review_date": "2014-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite storytelling promise, the choice of visualization over strong matter lead to the fall of this take on Sparta.",
            "review_date": "2014-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is awesome in my favorite action movies",
            "review_date": "2014-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really nice fillm based on the Greek hero LEONIDAS...",
            "review_date": "2014-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 was a much better watch the second time round. A great adaptation and dramatisation of an exhilarating piece of history. 300 is a blood bath, a feast of masculinity and pure action. King Leonidas is a born leader, a stubborn but likeable character played well by Gerald Butler.I find Zack Snyder movies can be very hit and miss however this is a great action flick and is worth a watch ahead of the upcoming sequel.",
            "review_date": "2014-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the critics sum it up nicely. The cinematography, acting, script, gore, and soundtrack are all top-notch.",
            "review_date": "2014-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4 1/2 stars!\n\nI was hooked from the beginning to the end! The visual effects are out of this world and the film truly is captivating, making you want to watch it more and more! \nIt was also nice to see 300 men running around with washboard abs including Gerard Butler! ;) \nWould watch again and again!",
            "review_date": "2014-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really fun and badass but kinda bad at the same time",
            "review_date": "2014-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The battles scenes are amazing... Thats all it takes, for this to be my favorite movie",
            "review_date": "2014-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story and great effects",
            "review_date": "2014-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome action. I love the way it was filmed",
            "review_date": "2014-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A guilty JOYFUL pleasure! It's not your usual movie going experience, but we make exceptions because that is what the directors mission was, we know the arty style he was creating. A bloody, gory load of fun and guts. This is SPARTA!",
            "review_date": "2014-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not enough of a plot for film that nears 2 hours but relatively watchable. But having said that the best thing about it was the cinematography!",
            "review_date": "2014-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely entertaining, brutal, violent, bloody & gory.",
            "review_date": "2014-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"300\": A visually unique and stimulating action/fantasy flick that is endlessly quotable and good, popcorn fun.",
            "review_date": "2014-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The action is ludacris, the lines are adrenaline inducing. 300 is an action classic. Enough said.",
            "review_date": "2014-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this movie. So surprised it didn't perform better at the box office.",
            "review_date": "2014-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this movie really captured the battle of Thermopily and the way the Spartans used there tactics of fighting including the phalanx",
            "review_date": "2014-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Following his adequate debut, the 2004 \"Dawn of the Dead\" remake, Zack Snyder gave audiences an adaptation of Frank Miller´s graphic novel, 300, with a Sin City like visual style.\nLeonidas is king of the glorious Ancient Greece city Sparta but one day a Persian messenger arrives at the gates of Sparta with a demand of summation to the Persian King/God Xerxes. Offended, Leonidas kills the messenger thus starting a war between Sparta and Persia, but Leonidas is negated to take the Spartan army to battle so he takes his best 300 soldiers to battle the gigantic Persian army. \nFrank Miller´s works have been the source material for numerous comic book films but almost all of them were executed terribly like \"Daredevil\" and the \"The Spirit\", to say some examples, but there a handful of enjoyable adaptations of his works like \"Sin City\" but \"300\" is right there in the middle. It counts with a fantastic choreography, a pretty interesting visual style, good looking battles, impressive, but obvious, CGI; good performances, some awesome and memorable moments, and provides a fun and entertaining experience. But 300 also counts with more than just a handful of problems: The story is straightforward but is nothing more than an excuse for the battles to happen (I know that an action film is not about story but knowing that Frank Miller served as the source material, I expected 300´s graphic novel would count with one of his typical dark and over the top stories), the dialog falls into absurdity in certain moments, it counts with one dimensional characters,  an annoying overuse of slow motion, it has the machismo vibe from the 80´s action films, the editing is confusing in the action scenes, the \"shot for shot\" idea for an adaptation is brilliant but the execution isn't as exciting as it sounded on paper because at times it's fun to watch and others its unnecessary and annoying; and while Snyder´s  heavy on special effects visual style is what makes 300 a memorable film, after some time becomes a distraction. \nZack Snyder managed to make another adequate film, 300 is a visually intriguing and entertaining film that despite its big failures, it still worth watching. Action and Frank Miller´s fans will definitely like it.",
            "review_date": "2014-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie from beginning to end,  action packed, very entertaining, amazing fighting scenes.",
            "review_date": "2014-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With the sequel soon upon us I thought I'd have another look at this.  Gerard Butlers finest film even though he was a bit WWE with his quotes and calling out the opposition.",
            "review_date": "2014-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An entertaining, brutal full out guy's movie. Not much brains but good fun.",
            "review_date": "2014-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Braveheart meets Lord of the Rings with a cameo from The Hunchback of Notre Dame and a villain ( Xerxes) that looks like a character from \" Priscilla, Queen of Desert\".... A average movie saved by spectacular special effects",
            "review_date": "2014-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's stylish, but that's all it can brag, 300 certainly takes its liberties with history and tries so hard to be memorable that it just comes across as cheesy. The movie is just non-stop bloody violence with absolutely no point and it falls short on almost every level except for the visuals.",
            "review_date": "2014-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300, is one of those really simple easy to follow movies. It navigates from perspective to shift things up a little, yet this film is a beefy bloody cool movie, that really deserves to be watched with popcorn",
            "review_date": "2014-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Innovative special effects, that make it worth a watch.",
            "review_date": "2014-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brutal, stylish tale that is as relentless as it is artistic.",
            "review_date": "2014-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can't wait to see the next movie.",
            "review_date": "2014-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i like this Cain of movies",
            "review_date": "2014-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although it may be mindless and corny,300 is so much fun it's hard to resist.",
            "review_date": "2014-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An orgy of violence and gore and over abundance of CGI make 300 feel like a movie-game crossover. However it is a very entertaining movie.",
            "review_date": "2014-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films of the 2000s.. Visually stunning and breathtaking history!",
            "review_date": "2014-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300's glorified violence and cheesy atmosphere make it as recommendable as it is unrecommendable.",
            "review_date": "2014-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An over the top poem of the real battle in Thermopylae that as hard as it may seem borrows from many of the facts as stated by the Greek historian Herodotus. The common thread of the plot is that of courage, independence, honor, loyalty and fighting for freedom regardless of rank or status... all a rarity in the Hollywood mindset.",
            "review_date": "2014-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Many people will say things at school like \"300 is a great movie!\" or \"it is extremely entertaining.\"  I will say, it is entertaining.  It can have some great action sequences.  However, on almost every other level, it falls flat.  The dialogue is completely corny, it has bad acting, and a messy script.",
            "review_date": "2014-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zack Snyder's dark approach really works for me and Gerald Butler is great.",
            "review_date": "2013-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Visually stunning, but carries with it, the inaccuracies that Frank Miller's graphic novel portrayed.",
            "review_date": "2013-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome film with some great lines and an original plot. The fight scenes are some of the best I've seen in any film.",
            "review_date": "2013-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I tried to count the number of deaths but I lost count after a bazillion.",
            "review_date": "2013-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, nothing more need to be said",
            "review_date": "2013-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie, it may not be my all time number one but its close. Real close. I loved the fight scenes, the characters, and the whole artsy comic book feel too it. It really worked for the movie. I know this movie is way off compared to the actual story but its still awesome nonetheless and it's an instant classic. If you haven't seen it, do me and you both a favor and go rent it tonight.",
            "review_date": "2013-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "B-\n82%\n\n     A visually striking yet plot-thin gorefest, 300 should provide enough thrills with its above-average battle sequences and impressive cinematography. \n     However, history buffs will be disappointed with the fantasy elements added that rob this medieval action film of its historical accuracy. Plus, the thinly-drawn characters and stiff acting slightly disappoint. Still, the average filmgoer probably will either not notice or not care.\n     With action-packed thrills and well done direction and visuals from Director/Screenwriter Zack Snyder, this film provides everything a slightly-above-average action movie can offer.",
            "review_date": "2013-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very simple and basic, but the visual style, cheesy quotes and epic battle sequences make up for the movie's flaws.",
            "review_date": "2013-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "300 is a not-so-accurate account of the three hundred spartan soldiers who fought the entire Persian army at Thermopylae. That being said, 300 is the most quotable and epic battle movie I have ever seen. Zack Snyder directs the CGI filled action packed film with riveting passion. 300 takes the violence to a whole new level, but it is backed up by such iconic dialogue to keep you entertained throughout the whole film",
            "review_date": "2013-12-12",
            "source": "rt",
            "lang": "en"
        }
    ]
}