{
    "rating": 8.0,
    "release_date": "2007-12-07",
    "num_reviews": 270,
    "genres": [
        "Drama",
        "Romance"
    ],
    "summary": "This sweeping English drama, based on the book by Ian McEwan, follows the lives of young lovers Cecilia Tallis (Keira Knightley) and Robbie Turner (James McAvoy). When the couple are torn apart by a lie constructed by Cecilia's jealous younger sister, Briony (Saoirse Ronan), all three of them must deal with the consequences. Robbie is the hardest hit, since Briony's deception results in his imprisonment, but hope for Cecilia and her beau increases when their paths cross during World War II.",
    "reviews": [
        {
            "content": "Very slow, and a lot of the film doesn't feel realistic. Come to find out in the end, it wasn't anything but the young girl trying to right a wrong by rewriting what actually happened. The scene at the beach with the English militaire in world War 2 was extremely unrealistic.",
            "review_date": "2023-04-23",
            "source": "rt"
        },
        {
            "content": "god..god..god...oh my",
            "review_date": "2023-04-19",
            "source": "rt"
        },
        {
            "content": "Wow, such an amazing movie. It's really sad and depressing...but such an amazing and powerful movie. Great story, plot, acting, and cinematography. Bravo.",
            "review_date": "2023-02-21",
            "source": "rt"
        },
        {
            "content": "O. M. G. THIS. MOVIE. Left me in TEARS. I was utterly amazed and destroyed by the movie; it left me absolutely speechless, I felt empty. It's everything from envy, to jealousy to spite, to love, everything. I'm not sure why this movie is not discussed more often, the storyline was just amazing, let alone the acting. James McAvoy and Keira Knightley absolutely made this movie, their performances were perfection. I cannot fault the making of the movie. \n\nI would absolutely rate this 100%, even more if I could and would indefinitely recommend watching this film.",
            "review_date": "2023-02-01",
            "source": "rt"
        },
        {
            "content": "I absolutely loved the first 45 minutes, the build up. It was smart and interesting and nuanced. And I really wanted to see these characters interact in a drama manner. Everything after \"the break\" felt so schmaltzy, melodramatic, and predictable, that it became a snooze fest.",
            "review_date": "2023-01-26",
            "source": "rt"
        },
        {
            "content": "A truly emotion journey. The actors project every emotion with complete sincerity and you're taken on an amazing journey.",
            "review_date": "2022-12-21",
            "source": "rt"
        },
        {
            "content": "The best acting performance from Saoirse Ronan!",
            "review_date": "2022-11-26",
            "source": "rt"
        },
        {
            "content": "A sexy romance and a lifelong quest to return to it. I can't help but be disappointed by this plot. Worth watching, but the young lead is too icy and distant to earn our sympathy, something the story very much needs to justify her transgression which sets in motion the second half of the film. Beautiful locations, and period design, and one of the steamiest sex scenes of all time. Keira Knightley and James MacAvoy are great, as does Benedict Cumberbatch play his role well. Unfortunately the latter, wartime half of the movie doesn't balance out with the comfort and beauty of the first part. If an effect might be created by this contrast, it doesn't feel justified, or that it contributes to an overall sense in the film.",
            "review_date": "2022-09-18",
            "source": "rt"
        },
        {
            "content": "A movie that easily goes on my top ten or twenty OF ALL TIME lists. This is an incredible movie with astounding performances and wonderful direction. Don't miss this.",
            "review_date": "2022-08-31",
            "source": "rt"
        },
        {
            "content": "One of the very best films of 2007. An epic romance that instantly becomes a brilliant classic among the great screen romances of the cinema. This is a film that showcases the maturation in leads Kiera Knightly and James McAvoy, as well as director Joe Wright. Everything is perfect here--from the emotional writing, to the gorgeous cinematography (a single long take of the evacuation of Dunkirk is one of film history's best), to the typewriter-laced score that finds just the right tone, to the exquisitely-timed editing. This is simply a great classic among modern movies",
            "review_date": "2022-07-22",
            "source": "rt"
        },
        {
            "content": "Had heard about this being one of the top performances in the career of James McAvoy early on, and I'm a big fan of his, so I really wanted to watch this and now it's checked off my list!\n\nThe movie requires patience but is driven by a well-created dynamic and honest story, and actually shows the journey of Briony as she learns from the mistakes of her past and tries to atone. I'm glad the ending wasn't a predictable one and they changed it up a little. Keira was good in this too and I was happy to see (even if just a little bit of) Benedict Cumberbatch in this one.",
            "review_date": "2022-06-09",
            "source": "rt"
        },
        {
            "content": "It's an elegantly shot movie, teeming of sentiment, passion and sorrow. Full of melodious, at times unorthodox, visual poetry. Bolstered by a perfect cast, and admirable performances from James McAvoy and our sensuous Keira Knightly.",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "James and Keira was great! Story was great too. It was  like 19th literature which is a pure love story with heartbreaking end. The Typewriter sound(as BGM) was little bit too loud though.",
            "review_date": "2022-04-10",
            "source": "rt"
        },
        {
            "content": "Meeeeeeeeeeeeeeeeeeeh",
            "review_date": "2022-01-25",
            "source": "rt"
        },
        {
            "content": "Only partway through at the time of this review. Exceedingly slow and it has about 15 mins before it gets put on the bottom shelf if forgettable videos. Will update this review if any thing changes. Otherwise assume I killed myself with boredom!",
            "review_date": "2022-01-21",
            "source": "rt"
        },
        {
            "content": "Wonderful movie. James McAvoy looks as sweet as an angel.",
            "review_date": "2022-01-15",
            "source": "rt"
        },
        {
            "content": "Great movie until it suddenly ends with a skip of 50+/- years to a TV interview with the (within the story) writer's confession and writer's illogical atonement by somehow giving the victims (the two lovers) joy by writing in a (in-story) false ending that, according to the story, didn't happen, which is ridiculous logic.  Very disappointed  and regretted wasting my time watching it.  Could have been a great chick flick if the story had continued.",
            "review_date": "2021-12-06",
            "source": "rt"
        },
        {
            "content": "Great heart warming movie, be prepared for many tears. 10/10",
            "review_date": "2021-11-11",
            "source": "rt"
        },
        {
            "content": "After a solid set-up, the second half of Atonement is a mess, with too many time jumps and thematic shifts that distract from a worthy story. In particular, Wright is so eager to tell the story of Dunkirk that he can't stay focused on McEwen's themes of guilt and atonement. The unique ending, however, is so haunting and thought-provoking it makes the entire film worth watching.",
            "review_date": "2021-10-26",
            "source": "rt"
        },
        {
            "content": "Heartbreaking, very sad, impactful, and most of all, it has a raw and romantic soundtrack, outstanding performances, excellent directing, and incredible cinematography that I can't even imagine. For me it is the best job and the best Joe Wright movie.",
            "review_date": "2021-10-10",
            "source": "rt"
        },
        {
            "content": "For me a first-rate movie with a very original story, captivating characters and very well developed during the film. It left me stuck with the story for the entire two hours and three minutes and left me simply shaken by the end of the movie. This is my favorite movie! I highly recommend it if you like romance and drama.",
            "review_date": "2021-10-07",
            "source": "rt"
        },
        {
            "content": "It's definitely one of the most haunting films I ever watched. Although it's somehow not easy to put yourself in their shoes in the beginning, it felt very real all the time, and in the end it justifies perfectly the placement in the high society. The final scenes can be applied to any film to turn it in to a confession and it's quite revolutionary. Even if it will not haunt you, it will make you think at the consequences of your deeds at least.",
            "review_date": "2021-09-24",
            "source": "rt"
        },
        {
            "content": "Full of unforgettable, beautifully-filmed scenes and stand out performances from Knightley, McAvoy and Ronan.",
            "review_date": "2021-07-10",
            "source": "rt"
        },
        {
            "content": "Devastating, romantic, and all around fantastic, Atonement is an absolutely gripping film from beginning to end. The film follows Saoirse Ronan’s bratty Briony Tallis as she blames James Macavoy’s Robbie Turner for a crime he did commit, separating him from Briony’s older sister Cecilia, played by Keira Knightly, who Robbie is in a relationship with. This film is not the easiest to sit through and has some devastating moments, particularly the end. The film is also beautiful, the cinematography is absolutely amazing. My only complaint is that I honestly found the film to be a bit too rushed and also the movie lacks a bit of focus in the second half. Also Keira Knightly sorta disappears halfway through and doesn’t really show up again until the end. However this is only a minor complaint and aside from that there are very few problems that I have with this film.",
            "review_date": "2021-06-28",
            "source": "rt"
        },
        {
            "content": "Except Brionny, the characters lack development, altought the film makes us care about them.",
            "review_date": "2021-06-16",
            "source": "rt"
        },
        {
            "content": "I plead with audiences to watch this one again: it's not nearly as spectacular as it thinks it is. And boy, is there an ego on this film!",
            "review_date": "2021-05-15",
            "source": "rt"
        },
        {
            "content": "Fantastic. Good Plot .The acting and the score are extremely awesome .It is really romantic and touching .I must give it A 5.",
            "review_date": "2021-05-11",
            "source": "rt"
        },
        {
            "content": "What initially starts as just another iteration of one of the most tired and bankable premises in modern film and TV - scandal among elites with British accents - actually takes a turn for the functionally dramatic in Atonement, delivering not only a hard-hitting romantic tragedy but one of the most sweeping and impressive depictions of Dunkirk not directed by Christopher Nolan (and it comes out of nowhere, too). The film is probably a little imbalanced as a result of its willingness to quickly leave its domestic English setting and substitute it with a sweeping war sequence (and probably could have been functional letting itself stand on the localized fallout of a single lie), but the film is certainly more distinctive and compelling for it. The pacing is a bit erratic as well (it's difficult to appropriately address a film as a 60-year epic when 95% of the runtime is dedicated to the first ten years or so), but the acting and production values are solid. Given his placement in predominantly charismatic and heroic roles (or somewhat antiheroic, in the case of Sherlock), it is certainly bizarre to see Cumberbatch as a pedophile rapist, surprised that divergence doesn't get brought up more often. (3.5/5)",
            "review_date": "2021-04-18",
            "source": "rt"
        },
        {
            "content": "The story of the impossible love talk about two guys, a man, and a girl that won't ever meet again because of a misunderstanding on the part of the sister.\nThe trama is spectacular, the love is unbreakable and the actors are able to show the feelings.",
            "review_date": "2021-03-11",
            "source": "rt"
        },
        {
            "content": "It's a pretty good wartime tale. Not much else to say about it. Pretty good film, not going to blow you away.",
            "review_date": "2021-03-06",
            "source": "rt"
        },
        {
            "content": "The book is better but the movie is still very good. Its a great story overall.",
            "review_date": "2021-02-24",
            "source": "rt"
        },
        {
            "content": "4/5.  Though it doesn't stick the landing, Atonement is an enraging and emotional film with excellent performances across the board.",
            "review_date": "2021-01-09",
            "source": "rt"
        },
        {
            "content": "Interesting movie that was made special by the unexpected ending. It was a period piece movie that stayed true to it's historical time frame. Very fine acting by the entire crew.",
            "review_date": "2020-12-25",
            "source": "rt"
        },
        {
            "content": "James McAvoy and Keira Knightley star in this film about two different status of people who fall in love, but are torn apart when McAvoy is wrongly accused of a crime by a young girl payed by Saoirse Ronan, who later in life realizes the error of her ways and the strife it's caused.  Interesting story that is acted well. McAvoy always seems to deliver great performances and Knightley, whom I can take or leave is very good.",
            "review_date": "2020-12-22",
            "source": "rt"
        },
        {
            "content": "This movie is so great, the characters, the plot and even the costumes are in place to tell smoothly a sad yet beautiful story. The acting are on point, Keira and James are so great together with natural chemistry to portray the couple. Very pleasant time to spend watching the movie!",
            "review_date": "2020-12-18",
            "source": "rt"
        },
        {
            "content": "La prima metà del film è molto interessante, gli equivoci sono utilizzati in maniera molto intelligente, e la trama racconta in maniera molto delicata il dramma che va profilandosi.\nNella seconda metà del film, si perde leggermente in scorrevolezza a causa dei tanti spezzoni di immaginazione.\nFinale da pugno nello stomaco.",
            "review_date": "2020-12-09",
            "source": "rt"
        },
        {
            "content": "RATING: B+   Director: Joe Wright \nAtonement is the Beautifully staged Story about a Girl that says something she shouldn't have said. The Movie is so well written that you think this is a True Story. The Cinematography looks so good and the Score is brilliantly composed as well.",
            "review_date": "2020-12-06",
            "source": "rt"
        },
        {
            "content": "great actors, not a bad story, an absolutely bad directing and editing",
            "review_date": "2020-11-26",
            "source": "rt"
        },
        {
            "content": "Boring, long, commonplace, fake, oh. and really boring",
            "review_date": "2020-11-21",
            "source": "rt"
        },
        {
            "content": "Cinematography: music, scene, costume, atm, rythm, everything is very nice except pace is sometimes kinda lagging; Content: absolutely awesome.",
            "review_date": "2020-10-26",
            "source": "rt"
        },
        {
            "content": "British author Ian McEwan may be the most cinematic of literary novelists.  His words paint stark images and Atonement is about nothing if not the power of words.  In this period piece, a single false statement by one of the characters irrevocably alters the lives of all of those within her circle.  The movie itself is a pleasure to watch.  It juxtaposes time, even within individual scenes, to show alternative perspectives and interpretations of events. It turns left when you expect a right turn and zigs with no zag.  The music score is interesting as the clacking of typewriter keys is used as a percussion instrument, again acknowledging the power of words.  The one-shot beach scene of soldiers waiting to evacuate a French beach is worth repeated viewings.",
            "review_date": "2020-09-07",
            "source": "rt"
        },
        {
            "content": "The sequence shot of Dunkirk beach was amazing, probably my favourite between all. Also, I think this movie really is different from the other romantic films.",
            "review_date": "2020-08-16",
            "source": "rt"
        },
        {
            "content": "i like the realism the movie portrays and strangely the hopes and dreams too. I have never seen reality and imagination collide so perfectly before in any movie. The acting is astonishing. The imagery and directing choices are beyond beyond beautiful. I would really recommend people watch this movie. I swear you will be left with a lingering feel of hope but also despair.",
            "review_date": "2020-07-20",
            "source": "rt"
        },
        {
            "content": "The film is one of the most melodramatic downers in history, but the performances are great especially from Saoirse Ronan.",
            "review_date": "2020-06-23",
            "source": "rt"
        },
        {
            "content": "i think this was a brilliant movie, a big tearjerker. Kiera Knightley and James McAvoy did an outstanding performance through out and i thought they were bloody brilliant. great family movie, amazing",
            "review_date": "2020-06-19",
            "source": "rt"
        },
        {
            "content": "Good acting in a nice period film but not too memorable.",
            "review_date": "2020-06-16",
            "source": "rt"
        },
        {
            "content": "It's rare that a movie's ending shocks me the way this one did. First and foremost it's a masterpiece of screenwriting, followed shortly by being a masterpiece of direction and acting. It deserved every Oscar it was nominated for.",
            "review_date": "2020-01-27",
            "source": "rt"
        },
        {
            "content": "Amazing, tear jerker, an adventure. But at the same time changes you and makes you a more mature person.",
            "review_date": "2020-01-17",
            "source": "rt"
        },
        {
            "content": "Over rated star launcher vehicle. The story was threadbare and taught nothing of love. Clearly inspired by The Go-Between and Brideshead but not being as classy as either drowned in an over-bearing soundtrack substituting a story with little real substance. The Dunkirk sequence was a mini-masterpiece but do we really have to sit through 1 hour bookends either side of such faff.",
            "review_date": "2019-10-31",
            "source": "rt"
        },
        {
            "content": "Uh so heartbreaking but beautiful ",
            "review_date": "2019-09-15",
            "source": "rt"
        },
        {
            "content": "James McAvoy SHINES in this film and his performance is once-in-a-lifetime. Despite the incredibly sad overall tone and ending of the movie, this is easily one of the most well-made films I've ever seen. A beautiful romance, with great chemistry between McAvoy and Knightley, a melancholy, cautionary tale about lying and jealousy, and a hell of a story that will move you to tears, \"Atonement\" is unforgettable.",
            "review_date": "2019-09-09",
            "source": "rt"
        },
        {
            "content": "Amazing acting, storytelling, and ability to make the heart wrench",
            "review_date": "2019-08-29",
            "source": "rt"
        },
        {
            "content": "The romantic epic is a genre that hasn't been brought to the screen particularly well in the 21st century as it seems as though there hasn't been a classic example of the genre since Out of Africa (1985). One film that was released in 2007 did manage to pull together some of the classic elements of the genre and adapt a complex, interesting novel with distinction and that film was Atonement. I really adore it because it feels like a throwback to that era when it seemed like Merchant Ivory could do no wrong while also featuring modern trappings that appeal to a younger audience member like myself. \n\nThe film concerns the wealthy Briony Tallis, Saoirse Ronan, who witnesses her childhood crush, the lower class Robbie Turner, James McAvoy, having a sexually charged encounter with her older sister Cecilia, Keira Knightley. Her jealousy and youthful impetuosity later causes her to accuse him of having molested her cousin Lola Quincey, Juno Temple, when it was in fact family friend Paul Marshall, Benedict Cumberbatch, who was involved in the encounter. Due to his low class Turner is imprisoned for his actions before being sent overseas to fight in World War II all the while he remains in love with Cecilia. Throughout her adult life Tallis feels immense guilt for her actions as a child and attempts to atone for her guilt by documenting the story of their love and providing them with a happy ending.\n\nThe tragedy of the drama is effecting as we two beautiful, intelligent young lovers separated by actions that were not malicious but misguided and misinformed. Tallis is tortured by her actions into adulthood as we see the tragic death of Turner and the quiet, understanding anger of Cecilia as they cannot fully blame her for actions she took when she was just a child but have had their lives destroyed by radical accusations. We as an audience want to be sympathetic to her character as we can see how a child with fiery emotions would be riled up by the sight of the man whom she has projected her hopes and dreams onto engaging in behavior that would be shocking to a child. In the end we feel such a sadness for all involved as we want to see Turner and Cecilia together in an idealized future as much as she does.\n\nThe direction of the film, as much as it borrows from other films, is impressive as Wright has an eye for period detail and stitches together various plot threads with skill. The battle sequences appear realistic and after seeing these men barraged with gunfire and gory sights we are compelled to shed a tear at the sight of a young, dying man imagining his comforting mother before he dies. The jumps between Tallis at different periods of her life also work fairly well as the actresses have clearly modulated their performances to appear similar but Wright is also careful to ensure that the cuts are not jarring and we establish how much time has passed between each major event. I think that Wright should have earned a Best Director nomination for his work, as much as I loathe Darkest Hour (2017), and I would happily remove Paul Thomas Anderson from the category to make room for Wright.\n\nObviously the biggest story of the film, acting wise, was a young Ronan who gives a stunning breakout performance as the complex main character. When we see her angrily, defiantly accuse Turner of his ‘crimes' her passionate conviction is so clear but Ronan's innocent appearance betrays her character's naiveté and this gives the character a necessary softness that explains her catastrophic decision. Knightley is lovely as always in the role of the romantic lead and while she isn't given the opportunities to show depth that she receives in Pride & Prejudice (2005) and Never Let Me Go (2010) she is quite affecting in her most emotional scene. McAvoy and Romola Garai as a slightly older Tallis are effective in smaller roles but it is the respected Vanessa Redgrave who brings pathos and sensitivity to Tallis when we last see her and her talents as an actress are all evident in the final moments of the film.\n\nI think that this film was the best of the films nominated in 2007 and while I do have a love for this genre that I am aware is not held by everybody I think this is a wonderful picture.",
            "review_date": "2019-07-17",
            "source": "rt"
        },
        {
            "content": "Great cinematography (the long shot on the beach is exceptional), and great score by Dario Marianelli",
            "review_date": "2019-05-04",
            "source": "rt"
        },
        {
            "content": "Jesus christ this movie hits you hard. Once you get over the jumping between timelines, it grips you with its amazing storytelling and mainly McAvoys and Knightleys acting. Brilliant and sad movie.",
            "review_date": "2019-05-03",
            "source": "rt"
        },
        {
            "content": "Extremely well done, staying true to the source material. Easily in the 4* to 4.5* range and maybe higher, which is why I don't like to rate movies based on books I have previously read, as my movie rating will usually be lower as a result.",
            "review_date": "2019-03-01",
            "source": "rt"
        },
        {
            "content": "Lovely pace, strong storytelling.",
            "review_date": "2019-02-12",
            "source": "rt"
        },
        {
            "content": "Better late then never",
            "review_date": "2019-01-30",
            "source": "rt"
        },
        {
            "content": "A crushing war film with a tragic romance.\n\nAtonement (2007) is still one of the most heartbreaking romance films ever made. It crosses the genre boundaries creating at atmosphere of a psychological drama in its character study of Briony Tallis, the trauma ridden warfare with Robbie Turner's WWII experience, the star-crossed love of Cecilia Tallis, and the period drama of the entire family all in one massive film.\n\nJoe Wright's direction is impeccable relying on clever editing and astonishing score synchronized with the on screen movement. Wright goes from romantic views from the English countryside to a stellar long panning shot on the beaches of World War II. Whether Wright is directing a quiet day in English or a combat zone in France, everything in Atonement is stunning to behold.\n\nAtonement captures the naivety of adolescence next to forbidden love and unrequited love. It's themes of forgiveness, kindness, morality, love, hatred, and of course atonement all feel so close to heart centered around WWII.\n\nThe performances are particularly outstanding in Atonement. Keira Knightley plays the forlorn woman who never got to marry her beloved with a tragic and upsetting realism. James McAvoy gives understandable rage and sensitive romance to Robbie Turner's ill fated life. Vanessa Redgrave lends a sincerity and subtle quiet to her elder Briony Tallis depiction that really ties Atonement together in a nice bow.\n\nThe real standout for me is still Saoirse Ronan as the childhood Briony Tallis. Her fitful and willful ignorance to the pain she causes around her is astonishing. Ronan plays Briony with a maturity and knowing well beyond her years as an actress. Her mesmerizing glares at her sister Cecilia and her longing gazes at Robbie yield much more inner turmoil that I'd realized. Saoirse carries Atonement to new heights of character study with her portrayal of this upset, spoiled child with serious problems. Her certainty of her crime and merriment at the tragedy of others is hard to watch, but makes Saoirse a great villain in Atonement. Saoirse makes Briony fascinating and intriguing. Her large blue eyes constantly reveal new flaws in Briony's character. I am glad Ronan built a strong acting career after Atonement. She deserved it!\n\nAtonement is a depressing, yet thoughtful take on World War II combat and childhood crushes alike. It tackles more adults themes on mistakes, pain, guilt, and forgiveness that expected. It is worth watching regardless of the genre that you like most in Atonement.",
            "review_date": "2019-01-18",
            "source": "rt"
        },
        {
            "content": "No hay más palabras para describir esta película más que \"una joya visual\".",
            "review_date": "2018-12-24",
            "source": "rt"
        },
        {
            "content": "This movie is very slow, it all happens in the last half an hour and has a sad ending",
            "review_date": "2018-11-26",
            "source": "rt"
        },
        {
            "content": "Stretch of imagination, lie and atonement.\nThe story is centered on a girl whose misinterpretation of the events destroyed two lives. She carried this guilt throughout the years. \nPerfect casting, gripping plot and charming scenery. Stunning soundtracks will not leave anyone indifferent. Watching this film is about being a participant of the events. Natural acting of James McAvoy  and Saoirse Ronan is absolutely brilliant. The plot is rather catching and thought-provoking. Joe Wright managed to show everything: loss of hope, despair, powerlessness... The ending is unpredictable  and astonishing what makes the film remarkable. \nThe film is a little bit slow-moving but it didn't spoil the whole impression. Avid fans of drama will really like it.",
            "review_date": "2018-10-20",
            "source": "rt"
        },
        {
            "content": "Another fantastic period-film starring Kiera Knightley shows archetypal struggles from several perspectives and adds a new age twist that envelops all the characters involved. ",
            "review_date": "2018-09-01",
            "source": "rt"
        },
        {
            "content": "This one is one of the best movies I have ever seen in my life.  I still have chills just to remember this movie.  The acting was great, the story is great, but it is such a sad movie. How a lie destroyed the life of all the members involve.  This is a must see movie for everyone that has the opportunity.  But in my opinion it should only be seen once because the sadness that it causes is just to hard to bear and to forget.",
            "review_date": "2018-08-08",
            "source": "rt"
        },
        {
            "content": "Tells about how unfair our life is. heavy film, but really beautiful and sensual.",
            "review_date": "2018-07-26",
            "source": "rt"
        },
        {
            "content": "THIS IS WHY YOU SHOULD BE ORGANISED AND FILE YOUR LETTERs. P.S. WAR IS DUMB.",
            "review_date": "2018-07-16",
            "source": "rt"
        },
        {
            "content": "Superb!  And better than the book.",
            "review_date": "2018-07-08",
            "source": "rt"
        },
        {
            "content": "Wright’s direction is slightly above average. Acting is profoundly good especially from Ronan and McAvoy. The writing could have used work as the relationships and characters had to be developed more. The pacing was uneven and the war scenes could have been cut short. The story doesn’t really kick in until the very end. It’s a well crafted film but it’s just not my cup of tea. ",
            "review_date": "2018-06-14",
            "source": "rt"
        },
        {
            "content": "I really thought I was going to hate this movie since love stories are really nothing something I like to waste my time watching but this movie surprised me.  It had some of the most beautiful settings and a story that kept me on the edge of my seat.  I highly recommend it even if you wouldn't typically watch sappy love stories.",
            "review_date": "2018-06-03",
            "source": "rt"
        },
        {
            "content": "From the rapid, rhythmic soundtrack to the jaw-dropping cinematography, Atonement proves that sometimes the film can be better than the book.",
            "review_date": "2018-05-11",
            "source": "rt"
        },
        {
            "content": "Deeply symbolic and dramatic, truly sad. The romance is a bit weak in the middle, however the movie always stays enjoyable thanks to superb direction, excellent acting and brilliant scenes.",
            "review_date": "2018-04-29",
            "source": "rt"
        },
        {
            "content": "The one word I would use to describe this movie is boring. Especially once it leaves the English estate. The story is centered around one act, and the ramifications of that (basically a 21st century Crime and Punishment). So nothing much else happens in the movie. It does hit you with a couple surprises at the end. But there just wasn't much dramatically to keep me engaged.",
            "review_date": "2018-04-20",
            "source": "rt"
        },
        {
            "content": "it was ok not the best",
            "review_date": "2018-03-17",
            "source": "rt"
        },
        {
            "content": "i finished my play..\n\nAtonement\n\nWithin few minutes you will fall in this world i.e. so beautiful and horrific at the same time with the help of probably one of the best background score of all time (it may remind you of Birdman's background music). Atonement is the perfect mixture of two antonyms for when there is beauty in it one feels full of hope but when it gets dark, it may get difficult to digest the practicality of it. Hats off to Joe Wright, in its such a beautiful depiction of love, pettiness and consequences of ones action, by justifying each and every frame and character of it with a mild but dark tone. James McAvoy and Keira Knightly oozes vulnerability and strength at the same time, doing some of their best work with the help of brilliant supporting cast like Saoirse Ronan. Atonement steals the show in excellent execution, brilliant writing and stellar performances all wrapped up in one of the most dreadful and heartbreaking love story ever.",
            "review_date": "2018-02-12",
            "source": "rt"
        },
        {
            "content": "(5.0 out of 6)- Faint Farewell to twist of fate\nWhen what place we need to make everything fit right we see we don't have much time. When we see what place we go when we control all matter of time in other places we are lost in what places we create. When we see a large place with everything inside it full of timeless places that makes such places have plenty to do to only waste time in what we don't see. When other places those come from we make place for them and put others in their place when time is on our side when we are wealthy. When what others place more then others they see what time will bring. When what place we go in our spare time we see it takes to other places more beautiful & erotic. When we see what places others go in what we don't see when we are not old enough we see the place where to go when what we learn in time we learn now. When what place we go are other people's places when we have no time but the present. \n\nWhen we see what embarassing places we go we only see time can only takes us out of such places. When we see such places that our eyes have not seen or read but know overtime we see such places as unwelcoming or welcoming. When we see what places we both yearn to be in the same place we see what such time brought us together to see, when we have been seeing it for awhile. When what place we go we see we better be sure we know we are going such same places together when we need to know what time we are spending is love not lust. \n\nWhen we see the little places we go that lies may take us when time is on our side to make up as we wish. When what we misplace we retrieve when time away we find those missing. When what we see we place not what others place when what we know over time such people don't go foreign places. When what foreign places we end up are places far from home when we are moved place to place when we are given time that pushes us further away from  eachother. When what places we see time makes time for us we see such the place in time and such places are not appropriate when we are in different places to know what time has taken from us. When we see what places we wonder to, to know such places others arrive to first when time can make the difference between life and death. When what place we see those hold for us, we see those places in time where we didn't see the signs. When what foreign places others don't know within time we see they know other places but not all places to know they are too young for such place for adults. When what our rightful place belongs too we see time can't take away.\n\nWhen we see the place where time calls for us and many to serve when it's a war to be fought. When we see a place in time where what little we have to go with we make use when time brings us to war and time brings us moments of peace to know what time is valued in such places to use wisely. When what places time doesn't end sooner we see such places not coming to an end anytime soon. When such places we all serve such time in such places when being in foreign places we don't want to be in when we wish we were in other places. When we see such places we don't want others to serve permanent time to when it's death to be attached to those past places when time doesn't heal old wounds.\n\nWhen such places we reach we use other places when the time is right to atone for such places we have been through. When some places others reach they recall such places in what they possess over time that others don't have. When what place we reach are those places where fate gives another chance to be together momentarily as time seperates them again. When we see what places we are in, we see time puts us in permanently when we have no way out of such places. When what place we are in are low places when we are responsible for giving those the wrongful place they must serve the rest of their time alive. When we see what place we will grow up to be when time puts ourselves alone when the only man we loved we betrayed push us all in different places. When we see what such places holds when it's our time to face our own penance for what we done to go to the same places we sent those to die. When such places we don't see where death takes lives we sent them for there is not always time in this world to fix what we have done.",
            "review_date": "2018-02-06",
            "source": "rt"
        },
        {
            "content": "This movie took itself very seriously. I, however, was just bored and confused.",
            "review_date": "2018-01-02",
            "source": "rt"
        },
        {
            "content": "Fantastic film, the one scene in this movie is the beach scene. It was very well directed when they put the beach scene with all the militaries and etc people of events folding, it was a one shot scene that continued with those people in place to play their roles for the one shot as the camera was moving. Amazing film ð??¥",
            "review_date": "2017-12-07",
            "source": "rt"
        },
        {
            "content": "Such a good movie--but stop before the last ten minutes if you want a happy ending. We cried into our tea watching it.",
            "review_date": "2017-11-20",
            "source": "rt"
        },
        {
            "content": "Nice movie with solid acting. However, the ending seemed a little rushed. I wish they could've explored the relationship between Lola and Paul further.",
            "review_date": "2017-11-11",
            "source": "rt"
        },
        {
            "content": "Touching companion piece to the non-fiction military history book I'm currently reading: \"Dunkirk\" by Joshua Levine.",
            "review_date": "2017-10-27",
            "source": "rt"
        },
        {
            "content": "A period drama which uses flashbacks, long takes, and perspectives from different characters. I'm very mixed about this film. I've never read the book but it seems that the director is trying to stay very true to the book. In doing so the film becomes a little confused when it could be so much better. but it does have a certain beauty about it",
            "review_date": "2017-10-15",
            "source": "rt"
        },
        {
            "content": "Atonement slipped my attention for a decade or so. What a film to miss!\nThoughtful. Intelligent. I even watched some period drama it seems!\nThe film is from 2007 based on the novel published in 2001 by Ian McEwann starring a cast including James McAvoy, Keira Knightley and Benedict Cumberbatch (with a bit of Vanessa Redgrave near the end!).\nIt begins in 1935 before the outbreak of World War Two in a posh mansion that could come straight from a period drama I refuse to watch!\nA 13 year old called Briony has a rather startling imagination. You see she writes plays it seems and has a teenage crush on her older sister Cecilia's adult boyfriend Robbie (James McAvoy and Keira Knightley).\nWhen she witnesses the couple's sexed up relationship she exacted a revenge on Robbie by falsely accusing him of a rape she witnesses ruining Robbie's life and momentarily the blossoming relationship he enjoyed with Cecilia.\nRobbie ends up in prison only earning release by serving in the harrowing battlefields of northern France in the war.\nThe film explores the harrowing conditions including the retreat at Dunkirk in a precursor to that film really.\nBriony in later life becomes to regret her actions of her youth and by now a novelist attempts to release her guilt and atone her actions in an autobiographical novel that is explained on a talk show by pensioner Briony  (Vanessa Redgrave).\nI can't believe this film from director Joe Wright escaped my attention and can only atone its greatness by giving it a positive review.",
            "review_date": "2017-10-12",
            "source": "rt"
        },
        {
            "content": "Quello che mi ha stupito di più di \"Espiazione\" non è stata l'intelligente e originale narrazione che viene usata per raccontare la storia, né l'incredibile talento degli attori protagonisti, e nemmeno l'uso perfetto di una colonna sonora unita ad immagini incredibili. Quello che mi ha colpito di più è stata la regia magistrale di un regista emergente dal talento sconfinato, capace di dare al film un tocco magico, un misto di poesia e dolcezza che coinvolge dall'inizio alla fine. Ho trovato perfetto il modo in cui viene narrata la storia, che riesce ad unire realtà e fantasia, in un intreccio che solo alla fine rivela i suoi segreti. Proprio nel finale si raggiunge una profondità emotiva molto toccante e commovente, che rende il film un piccolo capolavoro degli ultimi anni, un piccolo gioiello di rara bellezza.",
            "review_date": "2017-09-26",
            "source": "rt"
        },
        {
            "content": "\"Atonement\" struggles to capture the true pain and guilt that the protagonist carries, but in reaching for the moon, it falls among the stars.  The film is achingly beautiful.",
            "review_date": "2017-08-26",
            "source": "rt"
        },
        {
            "content": "Looks great thanks to the cinematography and costume design, and paired with a melodious score and great acting all around. However, the romance and the drama around it is perhaps too sappy and, in some parts, the direction is overdone.",
            "review_date": "2017-07-26",
            "source": "rt"
        },
        {
            "content": "With heavy handed music and an uneven ratio of dull-to-touching, Atonement is somewhat of a head scratcher. The third act is excellent but I couldn't really care about what was happening in the earlier sections of the film",
            "review_date": "2017-07-20",
            "source": "rt"
        },
        {
            "content": "Probably, if memory is correct, a couple of films radiated its weight to the viewer, and this film \"Atonement\" is one of them by being quite heavy. It went from corrupted innocence through different takes in perspectives to the tragic, conflicted end of the consequent thread that somehow expresses hidden feelings with emotions understood throughout. The said conflicted end goes to the similar adjective usage of both satisfaction and resolution while pulling a little farther. Mostly a war with a romance undertone being personal, within a unique turn of narration, the film accomplished its own heavy radiation for the viewer to feel, with the genuine qualities of the performances backed up by selective nice casting, cinematography and score. (B+)\n\n(Full review TBD)",
            "review_date": "2017-07-16",
            "source": "rt"
        },
        {
            "content": "Absolutely phenomenal acting and a powerful plot have made this one stand out for me.",
            "review_date": "2017-06-11",
            "source": "rt"
        },
        {
            "content": "A great film with fantastic performances. \nSaoirse Ronan plays the very, very naughty Briony brilliantly! So deserving of her Oscar nomination!",
            "review_date": "2017-05-05",
            "source": "rt"
        },
        {
            "content": "Atonement suffers from the \"Full Metal Jacket\" problem. The first half at the Tallis mansion is a brilliantly made, tightly constructed, and well paced. The second half is a disastrous mess that is so drawn out and poorly paced I really couldn't believe it. There are so many holes and baffling sections that is \"explained\" in the end scene, but in a way that feels like a cheat more than an answer. \nThe film is also soul crushingly sad, so watch with caution.",
            "review_date": "2017-04-04",
            "source": "rt"
        },
        {
            "content": "Spoiler Alert: This movie will break your heart, but to be honest it's worth it. As it kept going it only became more interesting through the excellent acting and brilliant writing. It also happens to be a very beautiful and well shot film with powerfully striking scenes. My only complaint is that it tried to have a happy ending, and that in effect ruined the beautiful sadness it brought out in me.",
            "review_date": "2017-04-01",
            "source": "rt"
        },
        {
            "content": "Pacing is poor and the characters are quite detestable. Not an enjoyable watch, and a generally forgettable film.",
            "review_date": "2017-03-06",
            "source": "rt"
        },
        {
            "content": "I cannot believe I never made myself watch this before. This is just an incredible film! The cinematography is everything. The feeling it gives you is unexplainable. It's a bit melancholy but sparkling. Such an irony. It never failed to give me chills from start to end! The progression of the events can be quite slow for some viewers but I think that is just how it's supposed to be - every emotion of the moment should be perceived by all of your senses. I'm personally not pleased with Kiera's performance though. She was okay, but being okay is definitely not fine when you're acting next to an extraordinarily magnificient actor like James McAvoy! They could've chosen a better Cecilia. I still love this film though and will definitely recommend it to anyone who ask me of a great movie. Hats off to Atonement!",
            "review_date": "2017-02-20",
            "source": "rt"
        },
        {
            "content": "This 2007 film is an astonishing incredibly sad drama about a young girl who separates a couple from a lovely future by lying about a crime he did not commit and her attempts throughout her life to seek redemption. A beautifully adapted tale with an Academy Award-winner breathtaking score.",
            "review_date": "2017-01-30",
            "source": "rt"
        },
        {
            "content": "A little uneven and scattered, especially toward the end, but beautifully filmed and wonderfully acted.",
            "review_date": "2017-01-30",
            "source": "rt"
        },
        {
            "content": "Mcavoy is great.  I personally can't stand Knightly.  Good film.  Emotionally gripping",
            "review_date": "2017-01-10",
            "source": "rt"
        },
        {
            "content": "Based on a great book",
            "review_date": "2016-12-11",
            "source": "rt"
        },
        {
            "content": "I feel very mixed about this film, as it has great scenes and is very well acted, but it seems stuck at some points. Perhaps this is how Wright wants you to feel, but this didn't make it more enjoyable for me. This makes for an interesting film with potential to be a classic.",
            "review_date": "2016-11-04",
            "source": "rt"
        },
        {
            "content": "stunning. sound effects were beautiful- especially the intermixing of the typewriter and musical score. very somber, but powerful.",
            "review_date": "2016-10-28",
            "source": "rt"
        },
        {
            "content": "It's fine but nothing special",
            "review_date": "2016-10-04",
            "source": "rt"
        },
        {
            "content": "Atonement is a period piece that shows how a series of misunderstandings can potentially destroy a man's life. When you look at the cast list you will see why the biggest strength of this film is the acting. James McAvoy has some particularly complex emotional moments and I thought he handled them brilliantly. The story structure was a concern for me, because it was a bit disorienting and sometimes made it a challenge to see what exactly was going on when. It didn't flow particularly because of how they would replay scenes from a different perspective. Once I was comfortable that I knew what was going on within this strange narrative I was fully engaged. The setups and payoffs in the first half were pretty obvious, but that didn't stop them from being effective. When we break into the third act is when my interest really waned. I was more interested in the relationship stuff between Keira Knightley and McAvoy, but the film decided it was time to show us the devastation of war. There is one sequence that goes on seemingly for ages, and the only reason I could find for this scene to be in the film is that it is trying to convince us that war is hell. It just didn't fit in the rest of the movie I was watching. Without delving into spoilers I will just say, the conclusion is tough to accept, but I think that speaks to my investment in the characters leading up to that point. Atonement is certainly a beautiful film with amazing performances, but the story failed to deliver all the way from start to finish for me.",
            "review_date": "2016-09-19",
            "source": "rt"
        },
        {
            "content": "The believable chemistry between James McAvoy and Keira Knightley made me support their perspectives throughout this powerful story.",
            "review_date": "2016-09-17",
            "source": "rt"
        },
        {
            "content": "A good movie that could have been great if not for mild incoherency in its middle segments.",
            "review_date": "2016-08-25",
            "source": "rt"
        },
        {
            "content": "You know it's a great movie when as soon as it ends, you go back and watch the first half of it again. What makes this movie so great especially is the cinematography and screen play, though the acting is quite fine as well. Very unique approach to a period film. Very intense. Very beautiful!",
            "review_date": "2016-08-08",
            "source": "rt"
        },
        {
            "content": "Quite simply one of the best movies of 2007.  It's a simple premise in which one decision changes the lives forever of three people.  Everything about the movie is lovely from the score to the direction to the acting.",
            "review_date": "2016-06-21",
            "source": "rt"
        },
        {
            "content": "Sound transitions are amazing.",
            "review_date": "2016-06-18",
            "source": "rt"
        },
        {
            "content": "This is a truly great film! The cinematography is wonderful. The story and acting are great, and the music is especially good.",
            "review_date": "2016-06-16",
            "source": "rt"
        },
        {
            "content": "Atonement is one of those movies where after watching, you have to sit a moment and let it all wash over you, not the facts, but the emotions.  This has become one of my favorites, one I'll revisit time and again.   Josie",
            "review_date": "2016-06-06",
            "source": "rt"
        },
        {
            "content": "52%\nSaw this on 22/5/16\nAfter a rather explosive first 45 minutes, the film succumbs into boredom, slow paced thick melodrama and a lack of genuine romance is always felt. James MacAvoy gives a fine performance and the film has some twists towards the end and a few horrid war images. However, it still lacks in romantic heft and emotional content.",
            "review_date": "2016-05-22",
            "source": "rt"
        },
        {
            "content": "Beautiful acting by Keira Knightley and James McAvoy. The causation created by one lie invokes a rippling effect that destroys the happiness of three people, only to be redeemed by the dream ending to unite the tragic lovers, which can be seen as an act of atonement.",
            "review_date": "2016-05-22",
            "source": "rt"
        },
        {
            "content": "Perfectly emotional, shows the power of perspectives",
            "review_date": "2016-05-08",
            "source": "rt"
        },
        {
            "content": "tedious to make through! I had to check the remaining time several times. I guess that if you liked \"The English Patient\" you might also like this. I must admit that it had a good music score and some nice directional touches but it was not all that engaging. I just didn't care the characters that much.",
            "review_date": "2016-05-08",
            "source": "rt"
        },
        {
            "content": "I have been wanting to see this movie FOREVER. I am so obsessed. It is hands down one of the most visually beautiful films I have ever seen. Heartbreaking, I totally cried & couldn't stop thinking about it afterwards. I loved it. The acting is perfect. The story was shocking. Music beautiful. A perfect movie for me. I always thought Keira Knightley was pretty but in this she is absolutely stunning. The entire cast was great!! I will never get over how it looks though. Director Joe Wright did a absolutely amazing job with this. The ending blew me away too. So very glad I finally own this! :)",
            "review_date": "2016-04-30",
            "source": "rt"
        },
        {
            "content": "It's a great drama with beautiful shots and scenes. A fresh story about the war. Just a tad slow in the middle.",
            "review_date": "2016-04-23",
            "source": "rt"
        },
        {
            "content": "The plot was tight in the first act, but it began to helplessly wander, before returning to a point at the end. The cinematography was beautiful, but it occasionally bordered on distracting.",
            "review_date": "2016-04-07",
            "source": "rt"
        },
        {
            "content": "Brilliant, romantic, dramatic, and all out incredible, Atonement is a movie that deserves all the praise. I has an amazing score, amazing performances and great cinematography, watch this movie.",
            "review_date": "2016-04-02",
            "source": "rt"
        },
        {
            "content": "One of the most beautiful & brilliant piece of filmmaking I've seen! It was unbelievable!",
            "review_date": "2016-03-26",
            "source": "rt"
        },
        {
            "content": "The first hour is amazing. Unfortunately, it also contains the climax of the film and the last hour is saved for falling action made entirely of heavy-handed messages that life sucks. What started out having me enthusiastic for the quality of writing and wit had me rolling my eyes at the end.",
            "review_date": "2016-03-12",
            "source": "rt"
        },
        {
            "content": "I don't usually especially notice sound, but the sound and the score on this film were excellent. An interesting format which worked in its favor. The flashing forward and back and the ending all served as an interesting, non-linear, structure that added unpredictability. Some beautiful shots and good acting.",
            "review_date": "2016-03-12",
            "source": "rt"
        },
        {
            "content": "A little uneven, \"Atonement\" tries to be a grand sweeping epic that's just too ambitious for its own good.",
            "review_date": "2016-03-04",
            "source": "rt"
        },
        {
            "content": "I cry every time. Every time. There is no other reaction to this.",
            "review_date": "2016-02-19",
            "source": "rt"
        },
        {
            "content": "\"Atonement\" is a fully-realized, beautifully-cinematographed, and deeply-moving adaptation of Ian McEwan's novel of the same name.",
            "review_date": "2016-01-28",
            "source": "rt"
        },
        {
            "content": "I am totally the wrong demographic for this film. This film is made for 30 year old single women who love sappy romance. This film does elevate itself from the average romance films. Great cast, surprisingly impressive cinematography, and well done production design. But sad to say, this film just wasn't for me. If the 'writing love letters from a world war II battleground to his loved one back home' story interests you, then this is for you.",
            "review_date": "2016-01-18",
            "source": "rt"
        },
        {
            "content": "Quite different, stays with you.",
            "review_date": "2016-01-02",
            "source": "rt"
        },
        {
            "content": "This was beautiful and heartfelt.I adored every scene and every single directing choice.The cast was marvellous,every one of them was amazing.Keira Knightley was a sight for sour eyes and a great acting force while James McAvoy owned every scene he was in with his pure blue stare and his talent.I found the story greatly interesting and I swear the end just broke me apart.A really great movie.I adored every second.",
            "review_date": "2015-11-18",
            "source": "rt"
        },
        {
            "content": "amazing how many of these people from this movie are now household names.  I did not think Cumberbatch could be any thinner.  He could turn sideways and slide between the crack of the door and frame.",
            "review_date": "2015-11-14",
            "source": "rt"
        },
        {
            "content": "Take away the acclaim and Atonement works fine as a drama. The film looks as good as the actors. The various situations are somewhat interesting, but the film never comes together or feels completed at the end. The war scenes do almost nothing for the story, which seems to have no main character. But overall, Atonement is fine, I just didn't find it to merit any awards.",
            "review_date": "2015-09-27",
            "source": "rt"
        },
        {
            "content": "This was a great movie. I don't remember hearing a lot about it when it first came out, but this was really good.Great story and some great acting. Every movie I see with James McAvoy makes me appreciate him more and more. Great actor.",
            "review_date": "2015-09-26",
            "source": "rt"
        },
        {
            "content": "A child's misunderstanding leads to a stirring vision of truth and perception in this immense romantic war drama. More aesthetically stimulating than most costume dramas, the camera and score pulse with beauty and insistence as these characters learn to find purpose in a torn world. Far from the yawn-inducing film it seemed to be from afar.",
            "review_date": "2015-09-23",
            "source": "rt"
        },
        {
            "content": "Interesting look at how individuals deal with shame and guilt. Extremely depressing though.",
            "review_date": "2015-08-29",
            "source": "rt"
        },
        {
            "content": "This movie is not watched with sympathy; it is watched with empathy. Trying to figure out why I liked this movie so much was not obvious. Two of my favourite actors do play the leads, but it is because of all the strong emotions portrayed; not one second of this movie is blasé. Every scene rips at your heart in some way. We have all known shame... passion... longing... hate. We all know what we would give, what price we would pay, to correct that one mistake... futile wishing. I felt with the characters and deeply so.",
            "review_date": "2015-08-21",
            "source": "rt"
        },
        {
            "content": "This movie is not watched with sympathy; it is watched with empathy. It was not obvious why I liked this movie so much. Two of my favourite actors play the leads, but it is because of all the strong emotions portrayed; not one second of this movie is blasé. Every scene rips at your heart in some way. We have all known shame... passion... longing... hate. We all know what we would give, what price we would pay, to correct that one mistake... futile wishing. I felt with the characters and deeply so.",
            "review_date": "2015-08-21",
            "source": "rt"
        },
        {
            "content": "Certainly gorgeous to behold, featuring sumptuous cinematography, a one-of-a-kind score, and vibrant period settings. The performances are also striking, but it is Ronan who steals it, and Redgrave who leaves a lingering impression in her one scene. Unfortunately, as striking as the set-up is, and that first hour is indeed wonderful stuff, the central doomed romance is too undernourished for the tragedy to have any lasting impact. Because of this, Atonement is a technical marvel, but the heart and soul is robbed a bit.",
            "review_date": "2015-07-29",
            "source": "rt"
        },
        {
            "content": "With solid performances and brilliant cinematography, this military romance drama has some twists in its ultimately sad tale. AAN GGWD. 1001",
            "review_date": "2015-07-26",
            "source": "rt"
        },
        {
            "content": "I genuinely enjoyed this movie.",
            "review_date": "2015-07-06",
            "source": "rt"
        },
        {
            "content": "A beautiful and tragic love story torn to pieces by misunderstanding and refusal to admit reality. Briony is an easy scape-goat for the tumult in the lives of Cecilia and Robbie, for she even blames herself; however, the audience hates Briony not for her actions as a 13-year-old but for our own flaws reflected in her character. The depth of this story excels expectations in its finale when its revelation of reality leaves the viewers wanting to hold onto the reverie of happiness.",
            "review_date": "2015-05-28",
            "source": "rt"
        },
        {
            "content": "Beautiful and highly under-rated.",
            "review_date": "2015-05-22",
            "source": "rt"
        },
        {
            "content": "An epic story, that plays out surprisingly well. Wright doesn't force the audience to feel, he just lets the story unfold before our eyes.",
            "review_date": "2015-05-06",
            "source": "rt"
        },
        {
            "content": "The 2007 Best Picture nominee 'Atonement' explores a lot of themes, all centering around a misunderstanding seen through the eyes of a 13-year-old girl from a wealthy family from the British countryside. When Briony (Saoirse Ronan) witnesses a series of events between her older sister (Keira Knightley) and one of the family's hands (James McAvoy), a spiral of repercussions ensue, which slices through a budding relationship between the two. Years later, we see how the loves of these three people intersect, and how forgiveness is never even given a chance. It's fair to say that 'Atonement' is not the cheeriest film, but it definitely presents an interesting plot.\n\nBut there is a big difference between having an interesting lot and executing one. In this case, director Joe Wright does not do a great job executing, and would presents itself as a promising film just doesn't materialize. For one, the pacing is totally off, as the interesting pieces of the main characters' lives between the actions at the outset and the major turning point in the film are not shown, and while World War II is supposed to be the glue that holds everything together, it ends up acting more like a character in and of itself. In terms of acting, Knightley and McAvoy do okay, but neither are standouts. To add to things, Benedict Cumberbatch plays an awkward role as an unassuming rapist, and he does not play this role all that well. Ronan is the only one who does an above average job. Still, the one aspect of 'Atonement' that is actually of interest is the cinematography, as there are a few scenes in particular that work well (the scene with Knightley and McAvoy at the water fountain and the scene where McAvoy walks around at Dunkirk following a battle.\n\nAgain, 'Atonement' certainly is a well-respected film, as demonstrated by all of the awards recognition it received, but it could have been so much better.",
            "review_date": "2015-04-25",
            "source": "rt"
        },
        {
            "content": "Ultimately the film is about a final act of kindness. Brilliantly told story with great performances all around and some amazingly shot scenes. Great film with a heart-wrenching, yet poignant ending!",
            "review_date": "2015-04-17",
            "source": "rt"
        },
        {
            "content": "Atonement comes from source material that would seem difficult to translate onto the big screen, but Joe Wright does a beautiful job. The film can feel disjointed at times, but yet somehow still comes together at the end. Without a doubt, the first and third act are the strongest parts, with a middle that lacks a strong connection. Still the film has so much craft that it's easy to forget the missteps. It also never fails to make me cry in the end.",
            "review_date": "2015-04-13",
            "source": "rt"
        },
        {
            "content": "Beautifully shot movie!  The story & resolution were painful!",
            "review_date": "2015-04-13",
            "source": "rt"
        },
        {
            "content": "I love graphics of this movie.",
            "review_date": "2015-04-10",
            "source": "rt"
        },
        {
            "content": "Atonement is a solid, touching and expertly-crafted drama, thanks to its impressive production values (its cinematography and score are superb) and excellent performances, particularly from Ronan and McAvoy.",
            "review_date": "2015-03-11",
            "source": "rt"
        },
        {
            "content": "Atonement is elegantly crafted, well-acted, and ambitious, but its jumbled narrative ultimately falls short of achieving the same level of greatness as the technical aspects of the film",
            "review_date": "2015-03-06",
            "source": "rt"
        },
        {
            "content": "I have a copy of the DVD but every time it's on HBO or Cinemax, I'd still watch it. It's that good.",
            "review_date": "2015-02-19",
            "source": "rt"
        },
        {
            "content": "Really the narrative is where the movie is let down. Stunning visuals, an original score, and strong performances all around, but I just wish the narrative added up to something more. Not that the story was bad, but it just wasn't as great as the other parts.",
            "review_date": "2015-02-13",
            "source": "rt"
        },
        {
            "content": "Good but has the feel of a Masterpiece Classic special instead of an cinematic feature.",
            "review_date": "2015-02-03",
            "source": "rt"
        },
        {
            "content": "Beautifully made and stunningly performed, Atonement is what The Notebook wishes it could be. Full review later.",
            "review_date": "2015-01-29",
            "source": "rt"
        },
        {
            "content": "Film de buena factura , con unas actuaciones secundarias muy buenas de Romola Garai , Saoirse Ronan y el gran final con la gran Vanessa Redgrave , pero que carece de espiritu y emoción.",
            "review_date": "2015-01-18",
            "source": "rt"
        },
        {
            "content": "So stylish & well acted especially 'Cecilia' the actors voice so much reminded me of Celia Johnson in 'A Brief Encounter' clipped to perfections to remind us of  a bygone time. As the tension built in the first half I loved the way that background noises were exaggerated which was the whole reason for 'Brionny' wanting atonement. A film that absorbed me to the end & left me melancholic but in a way that me made feel 'it is better to have loved & lost. Having just seen it again it is still holding up, shamefully overlooked at the 'Oscars' but then again the 'C' word was a bit too much for some so bravo for keeping it in.",
            "review_date": "2015-01-15",
            "source": "rt"
        },
        {
            "content": "Joe Wright's direction is absolutely spectacular in the way he runs his crew to show alternate versions of events in reality and then through a young girl's eyes. The score and cinematography is sublime throughout, and whilst there is a strong tendency towards sappiness in places, Atonement is still an engaging tragedy with a number of fine performances - most recognisably young Saoirse Ronan.",
            "review_date": "2015-01-11",
            "source": "rt"
        },
        {
            "content": "I really wasn't very fond of this when I saw it in the theatre.  For reasons I'm not too clear on this many years later, it lost me during the war scenes and never really got me back ... especially with it's twist ending that can't help but annoy you if you're not really with the film to begin with.  On repeat viewing, I feel quite differently.  The first half is brilliantly constructed, tightly paced and both capturing the point of view of the little girl who doesn't quite understand what she's seeing while acknowledging that the viewer has a more complete understanding.  I don't think the second half is as good, but the war sequences are far better than I remembered.  Knowing the ending in advance robs it of its frustrating qualities and I can see how it really does end the story appropriately.",
            "review_date": "2014-12-27",
            "source": "rt"
        },
        {
            "content": "Rare case of a top novel well adapted to the screen.",
            "review_date": "2014-12-12",
            "source": "rt"
        },
        {
            "content": "Exquisitely filmed, sharply acted, and a twist at the end. It all makes for a fantastic movie.",
            "review_date": "2014-11-16",
            "source": "rt"
        },
        {
            "content": "It's not the love story you want, it's the love story you need to see.",
            "review_date": "2014-09-28",
            "source": "rt"
        },
        {
            "content": "Très beau film, sur tous les plans.",
            "review_date": "2014-09-28",
            "source": "rt"
        },
        {
            "content": "Well made and moving, but overlong and perhaps a bit quasi-artistic in places.",
            "review_date": "2014-09-27",
            "source": "rt"
        },
        {
            "content": "This drama movie is more than I expected, and the style is unique and great.",
            "review_date": "2014-09-06",
            "source": "rt"
        },
        {
            "content": "A hauntingly beautiful, but sad, love story. Striking cinematography, unique score and well written screenplay.",
            "review_date": "2014-08-31",
            "source": "rt"
        },
        {
            "content": "The movie confidently succeeds in exploring its titular theme on all fronts: A compelling narrative structure, well defined characters and setting, subtlety when needed, excellent casting and acting, and a superb ending that hammers home on maximum catharsis. Despite this, the only real flaw is that, because it's so entirely straightforward, there's no reason to revisit.",
            "review_date": "2014-08-28",
            "source": "rt"
        },
        {
            "content": "\"Come back.\nCome back to me.\"",
            "review_date": "2014-08-11",
            "source": "rt"
        },
        {
            "content": "Based on Ian McEwan's novel of the same name, this movie is packed with powerful performances from each character infused with a strong storyline that delivers.  The movie delves on sadness from the start as Briony Tallis wrongly accuses Robbie Turner for a crime. This initiates a sequence of events that destroys everyone. As restitution for the act, Briony Tallis tries to fix all the consequences but fails. A profound movie that excels in all areas. \n\nMakes you wonder about your own guilty conscience.",
            "review_date": "2014-08-05",
            "source": "rt"
        },
        {
            "content": "a heart-wrenching movie.. final is perfect!",
            "review_date": "2014-07-16",
            "source": "rt"
        },
        {
            "content": "\"Atonement\" is a heartfelt and beautifully shot film that although starts off talkative and is occasionally painstaking, grows into an engaging and emotionally powerful romantic drama. The film features deft storytelling methods that highlight multiple perspectives and performances from James McAvoy and Keira Knightley which are committed and powerful.",
            "review_date": "2014-06-23",
            "source": "rt"
        },
        {
            "content": "There is a special place in my heart for Joe Wright. In Atonement, he gives the audience the most gorgeous cinematography then any film I have ever seen, stunning performances from all the actors especially James McAvoy and Saoirse Ronan who equally break my heart, a story which will destroy your very soul as well as one of the best long one-shot sequences in all of cinema; for me it's on par with the van sequence in Children of Men. Oh, and the soundtrack is so original and perfect and, my god I love this film. It's what films were created for.",
            "review_date": "2014-06-09",
            "source": "rt"
        },
        {
            "content": "Gorgeous film. Brilliant performances from the actors. Incredibly heartbreaking.",
            "review_date": "2014-05-29",
            "source": "rt"
        },
        {
            "content": "Pretty good when Joe Wright the artist doesn't get in the way of Joe Wright the director.  He's a brilliant visual stylist but not to any purpose. This film would greatly benefit from a sense of humility and economy. Kiera Knightly is good as always though.",
            "review_date": "2014-05-26",
            "source": "rt"
        },
        {
            "content": "The movie is just spectacular to watch and applaud-able performance by every character in the movie. The Visuals are stunning and the way the movie has been taken forward is great.",
            "review_date": "2014-05-14",
            "source": "rt"
        },
        {
            "content": "A must see! It will have you weeping and thinking!",
            "review_date": "2014-05-11",
            "source": "rt"
        },
        {
            "content": "A satisfying melodrama packed with emotion and sentiment, Atonement is a movie full of great performances and beautiful cinematography that make for a very moving experience.",
            "review_date": "2014-05-03",
            "source": "rt"
        },
        {
            "content": "This is one of the best movies I have ever seen, and I watch loads of movies. If you have the time and patience to watch a beautifully made movie, then please take the time. Brilliantly casted and directed.",
            "review_date": "2014-04-21",
            "source": "rt"
        },
        {
            "content": "had potential, but in the end was pointless and stupid. some good directing and music, but horrible story (1 view)",
            "review_date": "2014-04-06",
            "source": "rt"
        },
        {
            "content": "Beautiful and sophisticated film that is truly heartbreaking in all the right ways, a top notch music soundtrack as well.",
            "review_date": "2014-03-17",
            "source": "rt"
        },
        {
            "content": "Well... after writing this review, I may have to start giving some merit to those who call me \"pretentious.\" Seriously though, Atonement is a great film, and has the potential to join Casablanca and Gone With the Wind in the lexicon of incredible screen romances. This is the kind of movie that boasts great performances, marvelous direction, a fantastic script, and possibly the best cinematography of the 21st century... but is for some reason instantly forgettable. It's probably because a good amount of the film is padding, or perhaps because it moves slower than molasses in January. Still, although this movie is glacially paced, it's almost never boring, which really speaks a lot for the quality of the filmmaking. I was paying rapt attention to Atonement from beginning to end, something I cannot say for other \"modern masterpieces\" such as Requiem for a Dream, Gravity, or Adaptation. If nothing else, this is a film that lives more or less up to its hype.\r\n\r\nAtonement stars Kiera Knightley and James McAvoy as two lovers in the summer of 1935, just before war turns Europe upside-down. Okay, we all know the story: She's a privileged young upper-class woman and he's a slightly less privileged housekeeper's son at her grandiose mansion. And when I say \"grandiose,\" I mean every syllable... like, damn. I never thought I'd see a house that puts Downton Abbey to shame. This kicks off a whole slew of great cinematography in the film, but I'll get to that later: The pair are unable to spend much time together, as right in the evening when they finally, er, go at it, a man staying in their home (Eggs Benedict Cummerbund) sexually assaults a young girl. Not understanding the situation, and already scarred from seeing Knightley and McAvoy bang in her living room, Knightley's little sister Briony (Saoirse Ronan) tells the police that McAvoy did the raping. \r\n\r\nThis sets off a long, long chain of events that sends McAvoy off into the army and Knightley into a five-year-long funk. This is the good hour or so of the film that is less than action-packed, but it's still one of the better parts of the movie, mainly due to the cinematography. There is a whole lot to love about the visuals in this film from beginning to end, but this is where the cinematography really begins to run wild. From minute one of McAvoy's experience at war, we know that we're not in for our average two-hour love and war story. There are shots of beautiful colors and foliage interspersed with the dead bodies of children. There are brief, throwaway moments that you can tell the director lovingly put into the film, such as the reflection of the planes traveling overhead in the puddles. And, of course, there's the thing this film is most famous for: That long-ass tracking shot across the beaches of France. McAvoy walks through a literal army of people, passing things that will give you hope for humanity and things that will instantly snuff it out. And it's all in five or six awesome minutes of uncut, decadent glory. I don't want to go all cinema nerd here, but man... what an awesome scene.\r\n\r\nAnd then, after this buildup of tense, powerful beauty, we have the ending. I don't want to spoil this, but it is heartbreaking. After being given so much hope, it's all extinguished in an emotionally wrenching finale that I admit I should have seen coming, but didn't (shoulda read the book). One minor quibble would be that it's a serious cop-out when a historical film fast-forwards half a dozen decades to present times, just to show one of the characters old and wizened, looking back on their lives (cough cough, Saving Private Ryan, Little Big Man, cough cough), as it devalues the entire experience the audience just went through. Ending a film by saying it was all a flashback is nearly as bad as having it turn out to all have been a dream. It also completely destroys the visual splendor that the cinematographers were shooting (no pun intended) for in this film by zapping us from a beautiful 1940s setting to a dull recording studio in present day. Still, a film this strong overall deserves to get some leeway, and I'd be lying if I said I was complaining about that at the time.\r\n\r\nFinal Score for Atonement: 8/10 stars. I know, I know. Oooh, look at the pretentious film buff, he liked the depressing romance movie with the good cinematography. Whatever. Let the naysayers naysay. This movie is powerful and emotional stuff, and will resonate deeply with anyone who has ever wondered what life would have been like if they hadn't made one silly mistake... which, if I'm not mistaken, is just about everyone. The film strikes deep into the core concepts of, well, atonement, and forces the audience to somehow bring themselves to forgive a character so appallingly naïve that we hated her even when she tried one last time to do the right thing. The good thing about the philosophy of this movie is that there's no right answer-if you decided not to forgive and forget, that's what you took away from the film. It's all open to interpretation, and people may find their own morals and values reflected back at them a lot more than they'd like when they judge the characters of this movie. In other words, it does something that more movies these days need to do: It makes you think.",
            "review_date": "2014-03-07",
            "source": "rt"
        },
        {
            "content": "Skillfully scored and brilliantly filmed, Atonement is a fantastic story of guilt and tragedy, filled with magnificent performances from the entire cast",
            "review_date": "2014-03-02",
            "source": "rt"
        },
        {
            "content": "Fabulous story, we'll acted and affecting drama.",
            "review_date": "2014-02-26",
            "source": "rt"
        },
        {
            "content": "damn another review lost by flixter love this movie",
            "review_date": "2014-02-25",
            "source": "rt"
        },
        {
            "content": "This movie was so boring!  It took forever to get to the point, which itself was elusive; I thought the movie was going to be mainly about what turned out to be the most uninspiring romance ever, but it was really about some stupid girl being jealous.  Even when approaching what passes for a climax, this movie still seemed to drag on foreverrrr... and then it dragged on some more.  Whoopee, check out this long take of all the Allied soldiers at Dunkirk!  Okay, now get to the freakin point already.\n\nThe movie does use an interesting flashback device, where we see something from Briony's point of view and then we see what leads up to that event from a different point of view.  This was used twice and both times involved Briony catching an interaction between Cecilia and Robbie.\n\nThe romance between Cecilia and Robbie was super weak and unconvincing.  There was very little in the way of showing us the history between the two - hell, a romance between Briony and Robbie would've been better supported.  The romantic dialog was stilted and pedestrian, as if it had been written by an old stuffy English professor who hadn't gotten laid in thirty years.  Okay, in all fairness maybe that's how people talked back in 1930s England, but to me it still sounded flat and bloodless.\n\nCecilia's character does have that nice enigmatic quality in the first half of the movie (and Keira Knightley does a good job here), but then she was shuffled off the stage and we had to deal with Briony instead.  Briony is the only character who's really fleshed out, but really, who cares about her... And what was the point of that drawn-out scene with the French soldier?\n\nBy the way, are we really expected to believe that the British justice system was really able to try, convict, and imprison Robbie on the strength of one clearly unreliable witness and a racy letter that didn't even have anything to do with Lola?  And did Briony actually see that it was Paul who assaulted Lola, or was that just a product of her imagination after witnessing them getting married?  Because if marriage is now somehow an automatic indicator of past sexual assault, well, that makes weddings even more depressing than they already are.\n\nThe ending was lame.  Briony makes up some scenes in her last book, Atonement, where she gets to apologize in person to Cecilia and Robbie, who don't get prematurely separated and killed.  Cecilia and Robbie get to have a nice vacation together.  Briony claims that this is her way of giving them the happiness they never had.  Give them their happiness my ass... writing about how much fun two dead people had in your imagination doesn't somehow restore their lost time together.\n\nOh, and minor quibble, but it's yet another ounce of salt in this movie's already gangrenous wounds: this movie was also historically inaccurate.  The first half of the movie takes place in 1935 and the second half \"four years later\" - meaning 1939 - in northern France, but the German invasion of France didn't begin until May 1940.",
            "review_date": "2014-02-17",
            "source": "rt"
        },
        {
            "content": "Beautiful and well acted, Atonement is a very good film although it wasn't the emotional heavyweight I had expected (although an interruption in my viewing could have lead to that fault)",
            "review_date": "2014-02-15",
            "source": "rt"
        },
        {
            "content": "I thought it was wonderfully directed and beautifully shot but I felt completely frustrated buy its ending and kept asking myself: What was the point? I could see it was trying to be clever but I just felt ripped off as a viewer.",
            "review_date": "2014-02-10",
            "source": "rt"
        },
        {
            "content": "In 1935 England a young privileged girl named Briony (Garai/Ronan), witnesses a budding romance between her older sister Cecilia (Knightley) and the boy who's family has loyally worked for the estate, Robbie(McAvoy). There is a first encounter by a fountain that is harmless enough, but the young sister misunderstands what she witnesses. There is further confusion when the girl intercepts a note from Robbie. The note is very explicit sexually and was intended for her older sister Cecilia. The young sister is disgusted and believes that Robbie is a sexual fiend. She then witnesses her sister Cecilia and Robbie making love in the library of their home and is once again shocked. When a cousin of her's is raped, the young Briony falsely accuses Robbie of the deed and he is sent away to Prison, wrongly convicted.\r\n\r\nThe film then jumps into the future and deals with the repercussions of this event and shows all the affected characters. The story is very well adapted from novel to screenplay and the cast is excellent. The direction and cinematography are magnificent and the academy award winning musical score is very fitting. The WWII sequences have some very epic shots and the hospital scenes are very raw. Overall the film is very well made and visually satisfying.\r\n\r\nNormally not a film I would go out of my way to watch, I accepted this film as a challenge to break down the story. This is a film I can take a step back from and truly appreciate it for the work that it is, without letting preconceived opinions ruin it. \"Atonement\" is a tragic romance that takes viewers through the mid thirties England to WWII France and eventually beyond. It is well crafted and ultimately a very successful picture.",
            "review_date": "2014-01-31",
            "source": "rt"
        },
        {
            "content": "Sad and tragic and all the feels.",
            "review_date": "2014-01-17",
            "source": "rt"
        },
        {
            "content": "Stellar acting and an incredible ending...",
            "review_date": "2014-01-10",
            "source": "rt"
        },
        {
            "content": "A romance drama that shifts from joy to chaos thanks to a misunderstanding from a little girl, told in a unique musical score of typewriting sounds. It'll leave you pitiful towards all three main characters.",
            "review_date": "2014-01-07",
            "source": "rt"
        },
        {
            "content": "Aesthetic masterpiece. This film was beautifully shot and Dario Marianelli's soundtrack is one of the best. The story also gave decent justice to the book: a great story of guilt, misunderstanding, and consequences of bad luck.",
            "review_date": "2014-01-05",
            "source": "rt"
        },
        {
            "content": "Since it's an Ian McEwan story, the plot has some enormous holes.  Unfortunately, the screenplay doesn't plug them, and the direction makes things worse - a ferris wheel at Dunkirk: what were they thinking?.  Good acting can't compensate.\r\nThis is one of those quite good movies that gets less and less satisfactory when you think it over afterwards.",
            "review_date": "2014-01-03",
            "source": "rt"
        },
        {
            "content": "Excellent performances by Knightly and McAvoy, especially the latter. Gripping and poignant story. The inclusion of the typewriter into the score was interesting.",
            "review_date": "2013-12-31",
            "source": "rt"
        },
        {
            "content": "An amazing, heartbreaking and poignant film with superb performances from the entire cast.",
            "review_date": "2013-12-25",
            "source": "rt"
        },
        {
            "content": "Boring. Simplistic and predictable plot. It tries to compensate for this with a twist ending, but is too little too late.  The characters are shallow.",
            "review_date": "2013-12-12",
            "source": "rt"
        },
        {
            "content": "In my top10 movies list! HEARTBREAKING!",
            "review_date": "2013-12-10",
            "source": "rt"
        },
        {
            "content": "\"Atonement\" is a near-perfect motion picture. The performances are great all around, the film is well directed and visually pleasing, and also includes a memorable score. The first act of the film is the most memorable and I loved the way it was presented. The only real flaw I can think of is that the movie hits the brakes big time right after the first act and is very slow for the middle portions. However, the movie wraps up very well and as a whole the movie is excellent. It's an impactful film that kept me engaged almost all the way through.",
            "review_date": "2013-12-03",
            "source": "rt"
        },
        {
            "content": "One of 2007's best films, Atonement is a film that begins with reigning calmness, and falls into a tale of despair. Accompanied by a brilliant original score, Seamus McGarvey's impressive, breathtaking cinematography (that includes one of the most perfectly crafted sequence shot in film history), and a carefully crafted script perfectly broughted to the screen, Atonement is an engrossing, absorbing, intriguing film that is masterfully directed, and gloriously, powerfully acted by an amazing cast that includes James McAvoy, Keira Knightley, Romola Garai, Saoirse Ronan, Juno Temple  and Vanessa Redgrave.",
            "review_date": "2013-11-23",
            "source": "rt"
        },
        {
            "content": "Marches to its own drumbeat--and uses all of its qualities to the fullest advantage.",
            "review_date": "2013-10-30",
            "source": "rt"
        },
        {
            "content": "I do agree that the ending of the movie is quite shocking and thought-provoking. But I also think that the rest of the movie was lacking something crucial - the patchwork of poorly connected, yet pretty scenes didn't let the characters evolve nor the viewer grow on them. So in the end you might be impressed by the outcome, but totally indifferent to the characters involved. And that's not enough to call it a great movie.",
            "review_date": "2013-10-27",
            "source": "rt"
        },
        {
            "content": "http://youtu.be/Wnn47V09Q2M?t=33s",
            "review_date": "2013-10-22",
            "source": "rt"
        },
        {
            "content": "A lovely and gently told tragedy from the eyes of a less-than-innocent young girl.  Who says that the children have no guiles? The ruined life and missed opportunity makes such love story searingly powerful.",
            "review_date": "2013-10-17",
            "source": "rt"
        },
        {
            "content": "Feel my heart has a hole left behind",
            "review_date": "2013-10-06",
            "source": "rt"
        },
        {
            "content": "now i want to read tht book ..",
            "review_date": "2013-10-05",
            "source": "rt"
        },
        {
            "content": "It Could Be a 5 Stars Picture ..... Just Cause I Hate The End !!! \n\nBut This Film Is Really Great .... Many Remarkable Scenes Here, \n\nUnforgettable Soundtrack Deserve The Oscar Really.",
            "review_date": "2013-09-22",
            "source": "rt"
        },
        {
            "content": "Atonement is a very good book from Ian McEwan and the movie, for me, is also very well made. The cinematography and directing from Joe Wright proves again that he actually masters his job. Absolutely fantastic acting from James McAvoy and of course, the wonderful Vanessa Redgrave, even though she only appears in the last 5 minutes or so at the end. the book itself is rather lengthy at the first one third of it but after you get through it, you wont be able to stop reading it! The movie makes a good adaptation.",
            "review_date": "2013-09-22",
            "source": "rt"
        },
        {
            "content": "For there is no salvation, for there is no retraction for the moments and choices that has gone by...... In life, there is no atonement.",
            "review_date": "2013-08-31",
            "source": "rt"
        },
        {
            "content": "An epic movie, put together very well.",
            "review_date": "2013-08-26",
            "source": "rt"
        },
        {
            "content": "As a movie on its own, it's pretty confusing. I was spellbound by the book, and while the title theme is pretty well done in film, the richness of the characters' thoughts and histories is missing.",
            "review_date": "2013-08-12",
            "source": "rt"
        },
        {
            "content": "One of the greatest contemporary romances, Atonement just isn't about \"love\", it's about consequences, as well as other things. All the leads are fantastic, especially Saoirse, and the wonderful James McAvoy, and dang, the score is catchy. A wonderful, five star film.",
            "review_date": "2013-08-09",
            "source": "rt"
        },
        {
            "content": "This is a test review 2",
            "review_date": "2013-08-05",
            "source": "rt"
        },
        {
            "content": "This was an absolutely marvelous movie, though it can make you uncomfortable. It knows how to smash a heart but at the same time, it has a big one.",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "Everything a romantic tragedy should be, love, passion and tragedy",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "This is a great and beautiful film, it was all so perfectly executed, acted and directed. Some scenes were horrifically sad and a in some cases disgusting but all in way with absolute beauty, I would recommend this film to anyone who hasn't seen it.",
            "review_date": "2013-07-27",
            "source": "rt"
        },
        {
            "content": "A beautiful, weightless, effortless film-to-screen adaptation of a classic novel many thought too heavy to adapt.",
            "review_date": "2013-07-19",
            "source": "rt"
        },
        {
            "content": "Generally romance movies and I don't agree with each other, but Atonement offers beautiful cinematography and tender writing to make even the most masculine viewers find something to appreciate and admire.  The long distance lovers plotline has been thoroughly overused in theater, but this manages to find originality, not to mention great chemistry from its leads that never once comes off as cheesy or forced.  Every shot and every bit of dialogue seems to have so much thought in it, and the director seems to have been very invested in the film.  Atonement is another hidden gem in one of the best years of cinema of the 21st century.",
            "review_date": "2013-07-17",
            "source": "rt"
        },
        {
            "content": "Atonement simply is defined as the redemption of someone/thing that had done wrong.\n\nThat is what Briony (Saoirse Ronan) had yearned to achieve throughout this film as a result of falsely accusing Robbie (James McAvoy) of raping her cousin Lola (Juno Temple) in 1935.\n\nBriony had misinterpreted a few encounters between Robbie and Cecilia.\n\nThe first one was when Briony believed that Robbie had forced Cecilia to take off her clothes when Cecilia did so herself to retrieve something in a fountain.\n\nThe second encounter was when Robbie had written Cecilia two letters, one talking about his love for her while also apologizing for his behavior and another telling her what he would do to her sexually, this letter just being a joke to Robbie, but when he wished for Briony to deliver his letter to Cecila, Robbie gave her the wrong one and Briony read it.  \n\nThe third encounter was when Briony believed that Robbie was attacking Cecilia when really they were both having sexual intercourse which Cecilia condoned.\n\nWhen two of Briony's very young cousins ran away at night, everyone gathered a search party and this gave the perfect opportunity for Paul (Benedict Cumberbatch), a friend of Briony's visiting cousin, to make his monstrous move on Lola.\n\nBriony had seen the two bodies on the grass with the use of a flashlight just after Paul had finished. Paul ran away but both Briony and Lola couldn't see who the man was due to the darkness. Briony had set it in her mind so surely that it had been Robbie, the sexual deviant, who harmed Lola, when it was actually Paul.\n\nRobbie was arrested and was given the choice to either serve time in prison or at war, just when the Nazis had invaded Poland and declared war. He chose war.\n\nFive years later, we witness Robbie's horrible time at war while also seeing how he and Cecilia were able to see each other at certain times until Robbie had to leave again for war.\n\nBriony then visits the two lovers, while she is working as a training nurse, in order to sincerely apologize for her huge mistake she had made five years ago.\n\nBoth Robbie and Cecilia are unable to forgive Briony.\n\nWe then see Briony many years later as a somewhat elderly woman at an interview for a novel she wrote entitled \"Atonement\" which is basically an autobiography and the honest telling of what happened in 1935.\n\n(SPOILER) Briony reveals in the interview that both Robbie and Cecilia had died in 1940. Robby died from a disease he had caught while at war and Cecilia had died from drowning after a bomb went off and water flooded the bomb shelter which was ironically meant to be her safe haven.\n\nThis film is absolutely, beautifully tragic. It's a very sad love story that grabs you by the heart until the end credits commence.\n\nThe performances are wonderful, the score is beautiful and creative with the use if keys from a typewriter, the cinematography is gorgeous and outstanding, and the story is beautifully and melodically told with a well written screenplay.\n\nAtonement, I give you a 100%.",
            "review_date": "2013-07-17",
            "source": "rt"
        },
        {
            "content": "It can be slow and frustratingly painful to bear the patience of actual interesting scenes, but Atonement is an impeccable feat, guarded by performances from James MacAvoy, Keira Knightley and Saoirse Ronan, direction from Joe Wright and an incredible score, it will satisfy later on.",
            "review_date": "2013-07-09",
            "source": "rt"
        },
        {
            "content": "With an all star cast and beautiful cinematography, Joe Wright manages to retain the essential elements of the complex and breathtaking novel Atonement.",
            "review_date": "2013-07-01",
            "source": "rt"
        },
        {
            "content": "Made me feel horribly sad, and a bit nauseous.",
            "review_date": "2013-06-18",
            "source": "rt"
        },
        {
            "content": "Beautiful, tragic & haunting - exactly what you'd expect from any heart-breaking love story.",
            "review_date": "2013-06-09",
            "source": "rt"
        },
        {
            "content": "Too artsy for me! Good acting for the most part, but the going back in forth in time thing was annoying.",
            "review_date": "2013-06-04",
            "source": "rt"
        },
        {
            "content": "The breathtaking tracking shot on the beach at Dunkirk is still one of my all-time favorite shots in a movie. Atonement is visually great, the acting is fantastic and the story is well written. All the ingredients for a classic.",
            "review_date": "2013-05-23",
            "source": "rt"
        },
        {
            "content": "A beautiful, tragic movie.  Things happen very quickly in the beginning but you are emotionally invested in the characters almost instantly.  The two leads are Oscar-worthy, and every actress playing the Briony character is absolutely perfect.  It is terribly sad and had me in tears, but it is beautifully done and one of the best movies of the year.",
            "review_date": "2013-05-23",
            "source": "rt"
        },
        {
            "content": "meh i didnt care for this one. good acting, but the story just dragged on and on... i couldnt bear it at times..",
            "review_date": "2013-05-16",
            "source": "rt"
        },
        {
            "content": "Director Joe Wright gives an excellent film with great visuals,  and good storytelling!  There are more than a few occations where just how the shot was filmed, and paced along with impecable acting created riveting scenes!  James McEvoy has to be mentioned as a stand out.  He made every scene he was in memorable!  One of my favorite films from 2007!",
            "review_date": "2013-05-16",
            "source": "rt"
        },
        {
            "content": "The Dunkirk scene is in the film for a few minutes only!",
            "review_date": "2013-05-08",
            "source": "rt"
        },
        {
            "content": "Gorgeously shot movie about the power of words and stories, fantastical and true.  Director Joe Wright films Ian McEwan's novel so richly that it was astonishing to hear from screenwriter Christopher Hampton at a TIFF Q&A about all the parts they let out.  The famous Dunkirk scene in which one long tracking shot goes on for an astonishing 5 min is a true marvel, but the early languid scenes of a sweat-soaked summer English country house are just as engaging.",
            "review_date": "2013-05-06",
            "source": "rt"
        },
        {
            "content": "I usually hate Oscar-material films, but this was quite fun. The cinematography and direction is quite unique and refreshing. The first part of the movie reminded me of L.P.Hartley's \"The Go-Between\".",
            "review_date": "2013-05-05",
            "source": "rt"
        },
        {
            "content": "While this movie is wonderfully done, beautifully acted and fantastic in so many ways....I cannot reccommend it to a soul because anyone who does not leave this movie feeling absolutely depressed at the unfairness of this world saw a different movie then I did.",
            "review_date": "2013-05-05",
            "source": "rt"
        },
        {
            "content": "Not exactly what I expected but it was really good at the beginning and end, middle got a bit confusing",
            "review_date": "2013-05-01",
            "source": "rt"
        },
        {
            "content": "I've waited several months to see Joe Wright's second feature film \"Atonement\" and it did not disappoint. For an only second feature film by 35 old Joe Wright, it's absolutely astonishing. Directed superbly on all levels. From the stunning Dunkirk visuals, to several Point of view shots empathizing each character's need and feelings at that point, you can't help but feel intertwined in the story and with the characters. I haven't seen such an epic of a film since The English Patient, I hope it continues to do well at the box office and worldwide, as it deserved to. I haven't read the novel, so I will do soon.",
            "review_date": "2013-04-29",
            "source": "rt"
        },
        {
            "content": "good story. felt like punching that little stupid girl in face for being some dumm and imagining stuffs..",
            "review_date": "2013-04-28",
            "source": "rt"
        },
        {
            "content": "Atonement.  Loved the way they filmed different point of views in the beginning.  Liked Kiera Knightley in it and I usually hate her.  A little boring in the middle I thought but McAvoy was great.  Ending was a phenomenal wrap-up and it was so good that I was able to overlook the middle.  Absolutely loved the whole thing, GREAT story and nasty direction.  8.5/10",
            "review_date": "2013-04-25",
            "source": "rt"
        },
        {
            "content": "What an incredibly beautifully made movie.  The cinematography, the acting, the story... everything about this movie was well done.  Tragic and moving from beginning to end... it makes one think of how easily a misunderstanding can change the course of someones life.",
            "review_date": "2013-04-20",
            "source": "rt"
        },
        {
            "content": "This is a gorgeous well-executed film by Joe Wright, featuring a beautiful musical score that really does well to match the moods of the film... The story is ridiculously depressing though, and the main antagonist is such a bitch, so to be honest, unless you've actually read the book and know the ending already, I would probably not recommend the movie to anyone. Even if all of the actors - every single one of them, but particularly James McAvoy's powerful speech against Briony in the apartment, and Saoirse Ronan's evil foolishness - do a supremely amazing job in all their roles... The story is just really depressing and unforgiving. Oh, and Joe Wright's long take on the beach with the 1,000 extras for the British army... So friggin' well-done. Stunning stuff. Also, one more mention for the musical score.",
            "review_date": "2013-04-11",
            "source": "rt"
        },
        {
            "content": "Awesome!!! plot was amazing, and cinematography was soooo ridiculous!  This was great!",
            "review_date": "2013-04-11",
            "source": "rt"
        },
        {
            "content": "Vanessa Redgrave is great.",
            "review_date": "2013-04-09",
            "source": "rt"
        },
        {
            "content": "One of the most heartbreaking but beautiful movies about real love. I absolutely loved it! Cried at the scene of Dunkirk Beach and final scene. A true masterpiece",
            "review_date": "2013-04-08",
            "source": "rt"
        },
        {
            "content": "Aching story of a great love unfullfilled.",
            "review_date": "2013-04-07",
            "source": "rt"
        },
        {
            "content": "Absolutely stunning movie, keeps true to the book almost word for word. I absolutely loved the cast too.",
            "review_date": "2013-04-06",
            "source": "rt"
        },
        {
            "content": "good yet hating protagonist at the start was a confusing experience.  Thought provoking never the less.",
            "review_date": "2013-04-05",
            "source": "rt"
        },
        {
            "content": "I liked the way the movie spanned three time periods in the sister's life.  The five minute one shot was brillant!  James McAvoy played his role with grace.  I loved the ending, this was her only way to atone for what she did..great movie..",
            "review_date": "2013-03-31",
            "source": "rt"
        },
        {
            "content": "this movie shows the impact that could happen of telling a little lie.",
            "review_date": "2013-03-28",
            "source": "rt"
        },
        {
            "content": "Amazing cinematography and brilliant score. Another awesome film from Joe Wright. Wright is a visual storyteller, as proven by his exquisite direction of the Dunkirk evacuation scene - in a five minute long take.",
            "review_date": "2013-03-27",
            "source": "rt"
        },
        {
            "content": "I love this movie. The time period is brillitant!",
            "review_date": "2013-03-24",
            "source": "rt"
        },
        {
            "content": "Pretty much faultless.",
            "review_date": "2013-03-24",
            "source": "rt"
        },
        {
            "content": "I would've like the movie less if it ended in any different way.",
            "review_date": "2013-03-21",
            "source": "rt"
        },
        {
            "content": "Been putting this one off for a while now as I can't stand the snooty Knightley. But was pleasantly surprised.",
            "review_date": "2013-03-17",
            "source": "rt"
        },
        {
            "content": "?????? ?????? ???? ??? ?? ???? . ???? ????? ?????????? ???? ?????? ?????",
            "review_date": "2013-03-16",
            "source": "rt"
        },
        {
            "content": "i really love james mcavoy..",
            "review_date": "2013-03-04",
            "source": "rt"
        },
        {
            "content": "The almost ten minute continuous tracking shot on the beach is one of the most amazing scenes I've ever seen. Great film.",
            "review_date": "2013-03-03",
            "source": "rt"
        },
        {
            "content": "Period piece, yay!\r\n\r\nEmotional blackmail, boo!\r\n\r\nBecoming Jane was WAY BETTER.",
            "review_date": "2013-02-24",
            "source": "rt"
        },
        {
            "content": "With Never Let Me Go, Mark Romanek has delivered a graceful adaptation that captures the spirit of the Ishiguro novel -- which will be precisely the problem for some viewers.",
            "review_date": "2013-02-22",
            "source": "rt"
        },
        {
            "content": "I love this movie! OMG, where to begin.",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "Different from what I expected.  What started out as a Jane Austen-esque shoot-me-in-the-face English period piece, turned into a very adult and endearing picture.  The events take a while to unfold and just when you think you know where the story's going it takes a sharp turn that leaves you jarred but more intrigued.  I'm surprised that no one else has made the comparison to 2001: A Space Odyssey, but the structure of the film really moved in that sense.  The two lead performances were good but a little too \"I want my fackin Oscar\" for my tastes.  The obvious stand out actress was from Saoirse Ronan who creeped me out in that haunting maturity we see in someone like Dakota Fanning (except I don't want to punch her in her face).  The direction was deec, I mean maybe I'm too hard on the dude but I guess I just wanted to be slightly more impressed.  Of course, this one does contain the annual longest shot of the year which always impresses but the reasoning behind it remains lost to me.  Some, if not most, audiences will think it's a pretentious p.o.s. but fuck you.  I dug it.",
            "review_date": "2013-02-11",
            "source": "rt"
        },
        {
            "content": "gorgeous film but of course really depressing.",
            "review_date": "2013-02-11",
            "source": "rt"
        },
        {
            "content": "The unique replay of events from different perspectives in the cinematography and the incorporation of environmental sounds into the soundtrack can only be described as genius.",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "Aggravatingly disjointed, with a stupid, unsatisfying ending.  This movie made me want to commit murder.",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "A sad love story. I cried a lot.",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "A very touching film",
            "review_date": "2013-02-07",
            "source": "rt"
        },
        {
            "content": "Truly an amazing piece of cinema that blew me away. Having not read the book I was instantly entranced by this story and drawn in to the tightly woven plot. I'm actually finding it hard to write about this film which is unusual, but there was just so much originality, stunning cinematography and variety in cinematic technique to make this an unforgettable film. The sound of heavy punches on a typewriter accompany us through the entire film and add suspense, rhythm, pacing and atmosphere. \n\nThe acting was superb, I could even stand watching Keira Knightly which is a rarity, but she held such poise and grace that she fitted this role and period perfectly. The stand out for me was definitely McAvoy in a tragic portrayal of Robbie he holds the audience's attention and sympathy until his final moments on screen. The entire cast did an amazing job, and of course credit to director Joe Wright for creating such a wonderful film and an apparent faithful adaptation - I will have to read the book now to make the comparison myself. \n\nThe only problem I had with this film which held it back from being a 5 star movie was what I am going to call the 3rd quarter of this film. This part of the movie lacked something for me in comparison to the rest of the film. It felt like it had lost some steam or some of the punch that was present throughout. It wasn't a major problem however as the incredible ending more than made up for it. Definitely one of the best endings to a story/film I have seen in a very long time. I'm still thinking about it now, which is why I believe this is a powerful and incredibly well made film, because it stays with the audience long after the final credits have rolled.",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "(referring to the book) A brilliant masterpiece., Ian McEwan is such a genius., He captured his readers with riveting plot, each part is well connected with each other.., (to the movie) Although there are some missing or converted part, it was organized well to brought to us, viewers, the story of \"how an act would brought crime because you thought you're telling the truth\".., It is educational as well, telling as to first, think about an act you are going to make and what the possibility of risks if it went the other way around..,\n\nThe story of Atonement is one of a kind., Briony Tallis didn't understand an adult motive and taking that as a crime... However, the ending was so awful because, the truth was, Robbie Turner died of septicimia before the ship comes and Cecilia Tallis died in an undergroud train., But, the good part was, Briony made them a novel entitled \"Atonement\", or I suppose in the novel, it was called \"Two Figures on the Fountain\"., and she made the ending a happy one which shows how sorry she was.,. and atonement for the terrible things she had done..., and I highly recommend for everybody to read the book before watching the film 'coz it will give you the full apprehension about what it is all about.",
            "review_date": "2013-01-28",
            "source": "rt"
        },
        {
            "content": "Not terrible.  A bit of a bore though.  Kiera Knightly was just dreadful, but the rest of the cast was very good.",
            "review_date": "2013-01-25",
            "source": "rt"
        },
        {
            "content": "Enjoyable, started off a little slow, but loved the cinematography, and the different point of view settings. Great Film.",
            "review_date": "2013-01-24",
            "source": "rt"
        },
        {
            "content": "this was a really slow film with nothing really of note happening. you sit through it thinking something will happen and it just doesn't!",
            "review_date": "2013-01-20",
            "source": "rt"
        },
        {
            "content": "This movie is one of my all-time favorites.   Here's a good article about it on its 10th anniversary: http://focusfeatures.com/article/legacy_atonement_10-year-anniversary",
            "review_date": "2013-01-19",
            "source": "rt"
        },
        {
            "content": "Didn't expect to see the C word used so often in a period piece. Seriously. Not the rubbish C word either, no sir. Impressive",
            "review_date": "2013-01-16",
            "source": "rt"
        },
        {
            "content": "overly dramatic typical english faire. the best part of it was a hot love scene in a library and even that was too short. was hoping for a much better movie and ended up disappointed.",
            "review_date": "2013-01-14",
            "source": "rt"
        },
        {
            "content": "Visually and conceptually beautiful.",
            "review_date": "2013-01-12",
            "source": "rt"
        },
        {
            "content": "Joe Wright's 'Atonement' has a lot of positive things going for it, but none more brilliant and substantial than the film's cinematography and visuals. This includes, but is not limited to, a 5 minute tracking shot that never cuts away. It's pure, unadulterated filmmaking that we see less and less of. Not only filled with magnificent visuals, but each of the three leads fills their roles with great intensity and pathos, really creating something out of nothing when it comes to the script. The story feels a little blown out of proportion and the pace a little slow at times, but Wright makes sure it doesn't disappoint his audience. 'Atonement' does not have an astonishingly great story to tell, but its technical brilliance cannot be denied.",
            "review_date": "2013-01-11",
            "source": "rt"
        },
        {
            "content": "Beautiful setting and very complex story.  Great filming and photography",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "This period drama with a modern feel is a powerfully ambitious and influential work of cinematography, though in the end the composition of the film makes the work seem a little self indulgently narcissistic.",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "May be the best movie of the year. The acting is spot on; each performance brilliantly done. I have never seen a book so faithfully recreated on film and with such success.",
            "review_date": "2013-01-05",
            "source": "rt"
        },
        {
            "content": "To it's credit - a good, solid movie - but not really to my liking and not one that I'd watch again in a hurry.  There are some good performances across the cast (James McAvoy especially), and there are some moving and emotional scenes throughout - but it wasn't enough to lift my rating of the movie any further than 3 stars.",
            "review_date": "2012-12-31",
            "source": "rt"
        }
    ]
}