{
    "rating": 8.7,
    "release_date": "2007-04-04",
    "num_reviews": 50,
    "genres": [
        "War",
        "Drama",
        "Mystery&thriller"
    ],
    "summary": "After narrowly escaping death, young Rachel Rosenthal (Carice van Houten) becomes part of the Jewish resistance, assuming the name Ellis de Vries. Her superiors order her to seduce a Gestapo officer named Ludwig (Sebastian Koch). Ellis is successful in her mission but soon finds herself falling in love with her mortal enemy.",
    "reviews": [
        {
            "content": "Seamlessly blending the ordinary with the extraordinary, and the thrilling with the chilling, this war movie delivers drama from start to finish, with thanks to the exceptional talents of van Houten and Koch. as well as the vision of Verhoeven. It's not flawless, but it is worthy of your time. It certainly didn't feel as long as its 2h 26m runtime",
            "review_date": "2022-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of my favourite movie genres but I found the spaghetti junction nature of all the double crosses, the unpleasant graphic scenes and gratuitous violence not to my taste. I think the actors in this were better than their material.",
            "review_date": "2022-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story was unserious, unbelievable, unemotional, and predictable, with an awful ending. The chocolate foreshadowing was painful. There was unnecessary nudity to the point that the film was trying to be a porno. The characters were almost all unlikeable, and many could have been developed better, but the acting was reasonable. The gory action was entertaining, but it only made up a small portion of the film, with the runtime being too lengthy. The cinematography, editing, and visual effects were average,  the sets/props/costumes were fine, and the soundtrack was forgettable but fit.",
            "review_date": "2022-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie on the Dutch in WWII.  Based on a Jewish female who infiltrate's the Nazis in Hague and then is hunted down herself.  A lot of double agents and turncoats.",
            "review_date": "2022-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only Paul Verhoeven can make a devastating World War 2 movie erotic.",
            "review_date": "2021-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. This is a seriously underrated movie. A must watch if you love suspense and spy films.",
            "review_date": "2021-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On its surface, Black Book is a relatively conventional WWII drama with added thriller-mystery twists to capitalize on the hidden loyalties of Resistance fighting and Verhoeven's penchant for explicitness to differentiate it. However, there is a greater significance lurking beneath the surface, as the writer-director uses the dangerous backdrop as a criticism of the black-and-white view of politics and morality in wartime, drawing distinct parallels between characters of supposedly conflicting loyalties and creating a diverse cast of characters with very different motivations. Still, there is an undeniable pulp to the narrative that does feel like something of a detractor; driving events in the plot are occasionally not entirely sensical and often out of character. A bit odd to call the film 'Black Book' when the object that the title refers to is introduced with barely a half hour remaining in the film's hefty runtime. Though there are some early hints of promise, Verhoeven never seems to really exploit the massive potential for suspense inherent to the premise. A bit overstuffed but far from a bad film. (3/5)",
            "review_date": "2021-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Plenty of twists and turns in this Dutch war time secret agent thriller. Based on a true story though I imagine only loosely, it travels at a good pace throughout its relatively long runtime, never becoming dull. Strangely at no point do you ever feel much for the characters involved. There's more intrigue elicited than emotion but either way it works fine. Worth a watch if looking for something engaging.",
            "review_date": "2021-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story with lots of twists.  The actors speak in Dutch and German so I needed English subtitles except when the Canadian English-speaking forces appeared - not a problem!  Lots of action!",
            "review_date": "2020-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't like it a lot. But I had great time watching it. Not the best movie ever, but really good, you should watch it.",
            "review_date": "2020-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ontsettend spanned!!!!!!!! Very good movie",
            "review_date": "2020-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I come back to this movie again and again. It is sexy and raw with amazing acting quality and drama that was truly lived.",
            "review_date": "2019-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super thrilling edge of seat stuff .. loved it",
            "review_date": "2019-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5.0/10 — \"Poor\"/\"Inferior\"/\"Amateurish\"",
            "review_date": "2018-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Moving portrayal of a difficult time.",
            "review_date": "2018-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There were so many holes in this movie it was ridiculous.  Was so relived when it was over.",
            "review_date": "2018-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Arguably Paul Verhoeven's best work, Black Book is no Schindler's List nor another Inglorious Basterds. It is how a woman struggles under tyranny and patriotism. I would compare Rachel with Maria Braun under Fassbinder, yet the sufferings she went through is inconceivable. Excellent performance from Carice van Houten.",
            "review_date": "2018-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was not as heavy as the other similar movies about people under the cruel reign of the Nazis.  But it was still a good one.",
            "review_date": "2017-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good film, period.",
            "review_date": "2017-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie keeps you on the edge of your seat and can sometimes be confusing. However, all the events were true but not for one person. The scenarios happened and they were written into the script. The actors did a terrific job and the time went by quickly. The costumes and scenery seemed to be authentic. It was fascinating to be inside the Nazi headquarters. I cared deeply about the main character which is the most important aspect to me for a movie.",
            "review_date": "2017-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This may be my first movie review.  I loved it, 100%.  Every time I watch a good movie, and there are many, about Nazi's in WWII it makes me wonder.  \n\nThis is an amazing story and an amazing screenplay and the acting is off the charts excellent.  To be a Jew in that time, to be anyone stuck in that horrific time of fighting, we are just so lucky that we missed that.  Thank you for your bravery in making this wonderful movie.",
            "review_date": "2017-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much, Much better than I expected.",
            "review_date": "2017-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great performances by all the cast but particularly Carice van Houten.\nSex Violence, Intrigue, Plot Twists... Just really entertaining cinema.",
            "review_date": "2016-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Violent and emotional, Black book is one of best WWII dramas to come around in a while.",
            "review_date": "2016-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "11/10/16 Netflix\nAn entertaining \"B\" style movie. Lots of action, sex and intrigue with enough plot twists to keep it fun and interesting. Well worth a watch. It is amazing what some people had to go through in their lives.",
            "review_date": "2016-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good second world war film from the Dutch perspective, which you don't get to see often. It has a story to tell that surpasses the end of the war which is also unusual.",
            "review_date": "2016-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Carice is beautiful and the movie is excellent",
            "review_date": "2016-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not even my intense love for Carice van Houten could get me through this. She's good, but the story is mad hokey and dumb, and except for a couple cool parts where Verhoeven embraces his sleazy Verhoeven-ness, it's a waste of time.",
            "review_date": "2016-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonder how this stayed under my radar for so long while having so many things in excess - runtime, dramatization, graphic content be it sex or violence, production values, contriving, the number of characters and tragically failed missions. But what was hard to believe was the text that said in the beginning - based on real life events. Were they just referring to WWII in the backdrop? Though Carice van Houten gives her best shot, this multidimensional dream character was never converted to an Oscar vehicle. \n\nBackdrop is Denmark has come under Nazi rule and Jews are fleeing the country. Carice van Houten (Rachel Stein) is a Jew living in hiding. When her hideout is blown, she tries to make a run out of the country. She gets together with her family and gets on a boat. Rachel alone escapes a ruthless slaughter when a German patrol boat intercepts them. After she smuggles herself back into the city helped by a resistance group, she decides to fight for their cause. Her role is to setup a honey trap to a German Captain and assumes a new identity as Ellis de Vries. \n\nCarice van Houten fits the role perfectly upon her looks where she has to be equally cute, sexy and generous on nudity. Production values were extravagant for bringing an authentic feel to the period. With too many melodramatic moments and a highly commercial approach to presentation has not done enough justice to live up to the words in the beginning 'Based on real life events'. The resistance group is full of caricature characters you will find in any sort of group - an aggressor, a thinker, a comedian, a guilt driven paranoid etc. The dilemmas, perspectives and consequences that happen on the immediate aftermath of German surrender to the Allied Forces has never been dealt before - that too this period is not just a commentary based factual display but a proper thriller thread is induced here. Background score found wanting of elevation at certain moments, the action sequences look dated for its time. \n\nSeduce you through sex, violence and drama",
            "review_date": "2016-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films in any quintessential mode.",
            "review_date": "2015-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Very intense! Have to have a strong stomach for some parts.",
            "review_date": "2015-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film which focuses on the story of a young Jewish woman who joins in the Resistance and becomes involved with double dealing and betrayal. Of course with this director one expects controversy but he plays this one relatively straight and marks a certain maturity in storytelling. Verhoeven also co-wrote with long time collaborator Gerard Soeteman. Carice Van Houten makes an impressive perfomance along with many familiar Verhoeven regulars. Verhoeven's move away from Hollywood proves that he is much better when he chooses his subject material and has artistic freedom. This is a much more intimate film than either Starship Troopers or Basic Instinct. He goes back to his arthouse roots and for the most part has made a very watchable film, sharply written and edited without the flashy style we have come to expect. The sex and violence are there of course!",
            "review_date": "2015-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Black book is entertaining, sexy, melodramatic, violent and reviting tale of a jewish woman's survival in nazi occupied holland during world war 2. It was extremely well crafted, fast paced and intelligently written dutch thriller with some good suspense in the end.",
            "review_date": "2014-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Paul Verhoeven has made some tremendous Science Fiction action films such as Robocop, Total Recall and Starship Troopers. With Black Book he does a significant departure from that genre, and directs quite possibly one of his most powerful films. This is a standout drama, a breath of fresh air from a director who has always seemed to make action films and Sci Fi films. If y6ou enjoy Verhoeven's work, but want something quite different, then Black Book i8s a great choice. Set during the Second World War, and follows the Dutch resistance as they infiltrate the local Gestapo headquarters, Black Book is a fine mix of drama and thrills and has enough twists to keep you on the edge of your seat from start to finish. This is a superbly acted film, and captivating and highly entertaining from start to finish. Black Book is a fine drama that is steadily paced, and it's a well layered film that doesn't have a single dull moment. Overall, it's a powerful  picture, one that will stick with you long after you've seen it, and warrants multiple viewings as well. Verhoeven crafts something quite unique here, and it is a riveting drama, one of his finest yet, and considering that his last great movie was Basic Instinct (Starship Troopers was good, but it didn't compare to other previous works directed by Paul Verhoeven), Black Book is a richly detailed film, one that you can get thoroughly involved in, as it will leave you guessing into a tightly woven web of thrills. I would easily put this picture as one of Verhoeven's best, and it's a film that never ceases to amaze.",
            "review_date": "2014-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a whole lot of really good movies about the resistance in WWII, and even less featuring a female lead actor.  This is definitely one of the best in the first category, up there with Flame and Citron, and far better than Defiance, Soldier of Orange, or Army of Crime.  There is a few things that didn't go great with me, for one the B-17 bomb that landed right beside their boat would have put a quick end to the movie and killed them both, and the action, although not bad, did seen a bit one sided in favour of the resistance when it should have favoured the Germans, and the people getting gunned down could have been preformed better.  But those are minor setbacks to an otherwise great movie, that tells it's story very well and doesn't glorify anything or end in a unrealistic happily ever after.  It doesn't shy away from gore, although not particularly common when it's shown it doesn't hold back.  Also the nudity is rather similar and doesn't hold back, and that in itself is a character in the movie, as holds a big importance to the events.  Like all movies about the resistance or occupied territory in WWII many of the characters are double crossers, trying to survive and join the winning side, and it makes for characters that almost always cannot be trusted.  Often we can detect this beforehand, but it's not too obvious.  The story isn't exactly fast paced, but it's not really slow, and has the content to keep us engaged, as if we don't something important will surely be missed.  The ending is good, has us torn between who to root for, who are the real bad guys and who is bad but we still like. It ends good, most loose ends are tied up, but we find most of our characters dead, through various causes, mostly bullets.  Overall good movie, could have benefited from better action and slightly faster pace, but all in all portrays what it tries to almost to perfection.",
            "review_date": "2014-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really, really liked this film, which marked Paul Verhoeven's return to the Netherlands after a very successful stint in Hollywood.\n\nStarring Carice van Houten as a Jewish refugee who infiltrates Nazi ranks in Holland to avenge the death of her family, this is a WWII thriller with an incredibly generous dollop of mystery and suspense. Warning for those who care about such things: you see more of van Houten than even \"Game of Thrones\" dares to show.\n\nProbably providing inspiration for later films like Quentin Tarantino's \"Inglorious Basterds\", this film will keep you on the edge of your seat, and is incredibly entertaining.",
            "review_date": "2014-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a great film, I was enthralled from the very start, not sure how it was all going to end. \nSo sorry that the main heroine loses so much in her attempt and was shocked and upset when I found out who the villain of the piece was. Bugger, I really liked that guy!",
            "review_date": "2014-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super thriller. Really fast action that at no time becomes boring in the slightest. Great movie.",
            "review_date": "2014-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great movie, very well done and extremely interesting.  I was very intrigued.  Check it out if you get a chance.",
            "review_date": "2014-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At first glance it is a straightforward WWII espionage thriller, but there's a far more complex and jaded view of morality lurking below its surface, like how the antisemitism of the Nazis in the film isn't that different from that of the regular European population. All of this falls right in line with what Verhoeven explores in most of his film about the roots of fascism in society except that this time he's working with the legacy of real history, which makes what he's saying all the more terrifying.",
            "review_date": "2013-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good spy, Dutch resistance, movie about the end of WWII that centered on the efforts to entrap & kill rich Jews trying to escape the final days of German occupied Holland.",
            "review_date": "2013-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Jewish woman doing all that is necessary to survive.",
            "review_date": "2013-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Should be one of the greatest memoirs of the Jewish resistance. Full of twists",
            "review_date": "2013-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A damn good Dutch WWII film. Fantastic acting. A great story that will for sure leave you thinking about aspects of war that you haven't previously considered. HIGHLY RECOMMENDED.",
            "review_date": "2013-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From the director of \"RoboCop\", \"Total Recall\", \"Basic Instinct\", \"Starship Troopers\" and \"Hollow Man\" comes a new hardcore thrill ride of juicy intrigue... I think. I don't know about you, but it seems like Paul Verhoeven is getting a little bit carried away with his artistic license with this film, because, come on, Paul, as much as we're glad about your returning home to the Netherlands, two-and-a-half hours of you calling all of the names in your little black book seems to be a bit too experimental. Actually, jokes about this film's artistic integrity aside, this is yet another Paul Verhoeven thriller about a woman exploiting her sex appeal to get men killed, it's just that there's a bit more tastefulness to this film than your usual film by Verhoeven. Well, I guess it's safe to say that with \"Basic Instinct 3: I Did Nazi This Coming\", this delightful saga about the killing of some guys who were just hoping for a nice night with a hot lady has returned to form, because this is the supposed to be the most commercially successful and renowned Dutch film of all time... which isn't really saying much. I love how this was supposed the most expensive Dutch film ever upon its release, and it's also the most inexpensive film that Verhoeven has done since \"RoboCop\", meaning that not even \"Showgirls\" cost this little, as the box-office returns will tells you. Well, apparently Dutch films really are cheap, because even with a budget that, in USD, is about $21 million, this film has been about as prettied up as leading lady Carice van Houten herself. Of course, unlike Van Houten, this film didn't really \"blow my mind\" (Like I said, I bet these German slaves to seduction did \"Nazi\" that coming), as it is not exactly without quite a few faults.\r\n\r\nI was going into this film expecting some thrills, but I was mostly fearing that Paul Verhoeven would get to be a bit too carried away with this thoughtfulness as the teller of this, for him, more weighty story, thus I am relieved to say that entertainment value is generally firm, though I can't say that my fears were entirely dashed, as there are still limp spells in atmosphere that establish blandness, or at least intensify it, as bland limpness is reinforced enough on paper. At just under two-and-a-half hours, this film outstay its welcome a bit, and does so with repetitious material whose blandness could never be entirely washed away, and whose being accompanied by the aforementioned atmospheric dryness leaves steam to gradually dilute at the film progresses. There are more cold spells to this dramatic thriller than there should be, and that challenges your investment enough, yet doesn't do so alone, as there are also questionable moments in atmosphere that are more overbearing than cold, because whether the film is getting a bit carried away with its violent imagery or getting to be a bit melodramatic, there are more than a few lapses in subtlety, a few of which prove to be glaring. Verhoeven handles this project ambitiously, but hasn't conditioned himself through the years to handle subject matter of this much importance, even though may of this drama's aspects are driven by actiony thrills and intrigue, and perhaps his success as a dramatic storyteller would have been helped if the film was more well-rounded. You certainly get a reasonable understanding of the characters and their situation, but there's only so much expository punch-up to sell you on the full weight of this worthy story, at least enough for you to ignore the conventionalism, because even though this film about an ordinary, but struggling woman exacting revenge on the Nazis with both her companions and her attractiveness could have been turned into a rather refreshing thriller by its own right, Verhoeven hits too many tropes for the film to not simply feel like a cross between a formulaic and somewhat watered down femme fatale thriller and a formulaic and somewhat watered down wartime drama and espionage thriller. There's not a whole lot of punch to this film, and while there is enough force to the inspiration behind this project to almost drive the final product into decency, resistance from pacing and subtlety issues, underdevelopment and conventionalism overpower this ambitious effort and secure its underwhelmingness. Still, the point is that while the film falls short of rewarding, it comes close, carried on the back on many an inspired aspect, one of which being the very thing that our lead Rachel \"Ellis de Vries\" Stein character uses to get the job done: good looks.\r\n\r\nCinematographer Karl Walter Lindenlaub has had a history of lensing pricy thrillers that choose to direct most of their attention in the forming of eye candy to technical spectacle, rather than visual style, so there's not a whole lot that's especially appealing to this film on a visual level, but Lindenlaub's eye is still sharp, gracing the film with a crisp definition that emphasizes color strikingly and occasionally plays with lighting beautifully. The film is pretty prettied up, maybe not to a stunning degree, but certainly to an attractive degree that gives you a lot of room to admire this film's art direction, supervised by Cornelia Ott, - with help from Roland de Groot, Maarten Piersma and Wilbert Van Dorp - and featuring production designs, by Wilbert Van Dorp, and costume designs, by Yan Tax, that intricately and handsomely restore the Nazi-occupied Netherlands with distinct immersion value. The film uses its money well when it comes to putting together a distinguished and engaging look, even though there could be a bit more uniqueness to the photography and art direction, so on a technical level, the film excels about as much as you would expect from a Paul Verhoeven film, only with a few less explosions and whatnot, but what drives the final product is its substance. As I've said, storytelling betrays the value of this film's subject matter, which is limited to begin with, because this isn't your garden variety \"Oh, how the Jews suffered, and oh, how depressing it was\" type of Holocaust drama, but rather a war-era thriller with some dramatic touches and relevance to Nazi misdeeds, thus making for a story concept that was never to hit too much, but still has a potential that Paul Verhoeven, when particularly inspired as director, does justice to with an effective capturing of the intensity within what action there is, while keeping heart pumping enough to make the dramatic touches fairly compelling. If nothing else, Verhoeven keeps entertainment value going more often than not, sustaining your engagement value through and through, and therefore drawing your attention towards the other commendable areas in storytelling that don't exactly drive the decency of this dramatic thriller alone. There's not a whole lot for the performers to work with, yet with what they've been given, the cast delivers on charisma and heart, with beautiful leading lady Carice van Houten being particularly convincing in her portrayal of an ordinary woman putting herself in extraordinary situations that will test her morality while she goes on a dangerous adventure to give those who have wronged her what she feels is harshly just. Van Houten has only so much to work with, being perhaps at her most engrossing when she's, well, naked (It's a bit disrespectful, I know, but hey, she is indeed good-looking), but her commitment as leading lady is potent enough to help in gracing this film with the heart that, while not enough to carry the final product beyond a degree of underwhelmingness, comes close to rewarding.\r\n\r\nWhen the book is closed, you're left with an overdrawn thriller with too many lapses in pacing, subtlety and uniqueness to sustain steam enough to keep underwhelmingness at bay, which isn't to say that there's not enough good looks to cinematography and production value, intrigue to subject matter, and heart to direction and acting to make Paul Verhoeven's \"Black Book\" an enjoyable, almost rewarding thriller that could have hit harder, but nonetheless gets you by just fine.\r\n\r\n2.75/5 - Decent",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        }
    ]
}