{
    "rating": 3.8,
    "release_date": "2007-05-11",
    "num_reviews": 30,
    "genres": [
        "Comedy"
    ],
    "summary": "Three buddies (Larry the Cable Guy, Bill Engvall, D.J. Qualls) set out on a relaxing weekend of drinking and target practice, when a sergeant (Keith David) mistakes them for Army Reservists. The three men are deployed to Iraq, but a premature ejection lands them in Mexico. Believing they are in the Middle East, the bogus soldiers save a village and become local heroes, until a karaoke-loving warlord decides to strike back.",
    "reviews": [
        {
            "content": "Funny and original; ages 13+ only!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-04-10",
            "source": "rt"
        },
        {
            "content": "I loved this movie it was funny as hell",
            "review_date": "2022-03-28",
            "source": "rt"
        },
        {
            "content": "Not as farcical as advertised, but more realistic than The A-Team.",
            "review_date": "2020-12-12",
            "source": "rt"
        },
        {
            "content": "I don't know what everyone has a problem with. I really enjoyed this movie, it had some great humour and a fantastic interesting plot, the acting was great. This has got to be one of my favourite movies of all time",
            "review_date": "2020-01-30",
            "source": "rt"
        },
        {
            "content": "There are bad movies just as there are bad songs, books, poems, and people. Yet, there is a audience for each of those works or humans, someone who will enjoy or agree with them for some reason. Delta Farce accepted this challenge and created a film that no could like. And I mean at the level that a mother would not defend their child or a stripper won't laugh at your joke level of rejection. Our \"film\" manages to pair two southern comedians/actors who would bring with them a more conservative viewership to the party and proceeds to shove anti-Bush era/anti-Middle East conflict propaganda down their throats for what seemed to be an eighteen hour movie. Liberals, especially those overeducated pansies I always hear about, are not spared. The Farce is packed anti-woke jokes thanks to their racist Mexican caricatures and tasteless homosexual representations. Moreover, it is actually a remake of The Three Amigos, proving that we have regressed in our art as much as our values. Delta Farce is an example of how we sound when our unfiltered/unchallenged minds have a sounding board. Now you might think I am bashing on this film, but I am actually its champion. It is brilliant in that regardless of what defines you as a human being we all have one undeniable commonality, we hate Delta Farce.",
            "review_date": "2019-08-24",
            "source": "rt"
        },
        {
            "content": "I love Larry the Cable Guy, and Bill Engvall so I was mildly entertained. However, if you don't love them, this will be a real waste of time",
            "review_date": "2019-08-15",
            "source": "rt"
        },
        {
            "content": "I got what I expected from two comedians from the Blue Collar Comedy Tour and what I got was a silly comedy that keeps in the spirit of The Three Amigos. Keith David was clearly inspired by the late R. Lee Ermey from Full Metal Jacket but nowhere near as good. It was clearly meant not to be taken seriously and it will make you laugh if you enjoy the comedy of Larry the Cable Guy and Bill Engvall. Danny Trejo once again plays the bad guy but still plays a scary villain well with a silly script.",
            "review_date": "2019-03-20",
            "source": "rt"
        },
        {
            "content": "Larry The Cable Guy is funny as a small part of a stand-up routine, not as an leading actor.  Bill Engvall has no business being famous.",
            "review_date": "2016-10-19",
            "source": "rt"
        },
        {
            "content": "Mindless fun thought it was really funny. My humor I really had fun with the movie",
            "review_date": "2016-07-22",
            "source": "rt"
        },
        {
            "content": "Once again, who expected this movie to be even remotely funny?  Larry the Cable Guy just isn't good at comedy!  F",
            "review_date": "2015-09-21",
            "source": "rt"
        },
        {
            "content": "it flat out just sucks\\",
            "review_date": "2015-05-30",
            "source": "rt"
        },
        {
            "content": "much better then I thought but still nothing special",
            "review_date": "2015-04-20",
            "source": "rt"
        },
        {
            "content": "If you accept what it is, it's actually pretty damn funny.",
            "review_date": "2014-06-09",
            "source": "rt"
        },
        {
            "content": "Bumbling idiots from the Army Reserve get sent to the wrong destination and help save Mexico. A stupid grown up version of in the army now.",
            "review_date": "2014-05-08",
            "source": "rt"
        },
        {
            "content": "this is a funny movie",
            "review_date": "2014-05-02",
            "source": "rt"
        },
        {
            "content": "Favorite movies because Jeff Dunham is because he plays one of these characters",
            "review_date": "2014-01-22",
            "source": "rt"
        },
        {
            "content": "very funny movie!!!!!",
            "review_date": "2013-10-19",
            "source": "rt"
        },
        {
            "content": "It has its moments, but it's weighed down by an overabundance of slapstick humor that eventually grows tiresome.",
            "review_date": "2013-07-23",
            "source": "rt"
        },
        {
            "content": "pretty damn funny! One liners that is!",
            "review_date": "2013-06-10",
            "source": "rt"
        },
        {
            "content": "This movie was ohhhhh so boring...",
            "review_date": "2013-06-04",
            "source": "rt"
        },
        {
            "content": "they just copied 3 amigos and did a really bad job.",
            "review_date": "2013-03-18",
            "source": "rt"
        },
        {
            "content": "Another movie starring Larry the Cable Guy that sucked. It's not a real comedy so I can safely say that nobody thought it was funny. Also just because the poster was parodying Full Metal Jacket doesn't mean it's funny.",
            "review_date": "2013-03-04",
            "source": "rt"
        },
        {
            "content": "Seriously, Keith David in drag,  Keith David in a gay duet singing I got you babe.  Danny Trejo singing I will survive.  What more do you want?",
            "review_date": "2013-02-16",
            "source": "rt"
        },
        {
            "content": "They should have never made a movie like this!!!",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "Words can't tell how awful is this piece of horse crap. I can't even watch the whole thing. Retarded unfunny cinema.",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "pretty dumb...but what do you expect.",
            "review_date": "2013-01-24",
            "source": "rt"
        },
        {
            "content": "Larry is funny as always!!!",
            "review_date": "2013-01-21",
            "source": "rt"
        },
        {
            "content": "A war comedy that has no action or funny moments. Basically no redeeming qualities.",
            "review_date": "2012-12-28",
            "source": "rt"
        },
        {
            "content": "not a serious movie. a lot of people go into this flick expect a real plot that's funny. it's not. it's a big joke with subtle political messages. it's funny but a little too lacking in seriousness.",
            "review_date": "2012-12-24",
            "source": "rt"
        },
        {
            "content": "what a shitty movie, bored me to death and NOT funny at all!",
            "review_date": "2012-12-21",
            "source": "rt"
        }
    ]
}