{
    "rating": 8.3,
    "release_date": "2007-09-14",
    "num_reviews": 230,
    "genres": [
        "Crime",
        "Drama",
        "Mystery&thriller"
    ],
    "summary": "Nikolai (Viggo Mortensen), who is both ruthless and mysterious, has ties to one of the most dangerous crime families in London. He crosses paths with Anna (Naomi Watts), a midwife who has come across potentially damaging evidence against the family, which forces him to set in motion a plan of deceit, death and retribution.",
    "reviews": [
        {
            "content": "Very well done (& I'm surprised there isn't another following with Vigo).",
            "review_date": "2023-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Director David Cronenberg began exploring the body horror of organized crime in his previous film, A History of Violence, and he continues this pursuit in Eastern Promises, focusing on the infamously vicious Russian Mafia. This group has become a film stereotype for the nastiest of bad guys (thus beloved of screenwriters), and Cronenberg is presenting conventional movie fantasies of these people rather than a gritty expose. Everyone talks like Boris Badenov and drinks way too much vodka at banquets while listening to sad Russian folk songs. Viggo Mortensen is brought back as the badass undercover agent infiltrating the gangsters' organization to take it down, and has done his usual meticulous preparation for it, but was this role really worth the trouble? His nude fighting scene in the bathhouse always gets mentioned, but at this point in the film we already know he will have to survive to keep the plot going, so is it really that suspenseful?\n\nEastern Promises' biggest flaw is its McGuffin – the dead girl's diary that the bad boys will do anything to retrieve and will take out anyone who has read it. We are supposed to simply accept that cute midwife Naomi Watts would take this piece of vital evidence for a dead Jane Doe home rather than immediately turning it over to the police, and that she apparently has no sense of the nastiness of the Russian Mafia, even though she works in a downtown London hospital, and must regularly see their victims and thugs being wheeled through the corridors. This is really asking too much of us, yet the whole plot hinges on this device. Cronenberg, so effective at creating creepy body horror films that get us thinking, is simply out of his element making a plain old dumb gangster film like this.",
            "review_date": "2023-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great acting skills of viggo mortensen, really carries the movie",
            "review_date": "2023-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly disappointing. Among the worst acting skills ever seen; worst photography, and definitely silly trama.",
            "review_date": "2023-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfect will timed story telling, the bathroom scene, what can I say, great stuff",
            "review_date": "2022-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Set in London, the Russian mob is involved in human trafficking, smuggling in underage girls and engaging them in the sex trade.  Things get complicated when Anna (Naomi Watts), a nurse in the local hospital, finds herself involved with the criminals when a young girl dies in childbirth, leaving behind a newborn. Watts does a pretty decent job in her role, as does Armin Mueller-Stahl as the seemingly kind but ultimately ruthless mob boss.  Viggo Mortensen and Vincent Cassel ham it up nicely as a pair of Russian killing machines, sometimes taking it way over the top.  The violence is brutal (check out the spa fight) but not as pervasive as one might think. The final ten minutes or so contains a twist that seems out of place and totally unnecessary, but, beyond that, David Cronenberg's Eastern Promises proves to be a pretty effective gangster film.",
            "review_date": "2022-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Naomi Watts is from King Kong yeah",
            "review_date": "2022-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dark, intense and atmospheric gangster movie that seems to transcend the genre with its brilliant direction and fantastic cast, but also doesn't shy away from moments of sentimentality. Remarkable is Cronenberg's fully sovereign direction and at least one unforgettable fight scene.",
            "review_date": "2022-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This gripping, superbly acted crime thriller from David Cronenberg is a Russian 'The Godfather' without the length or scope. Lean, brutal (the violence is breathtaking), and engrossing, this film scores with its depiction of crime in the London underworld and the stellar cast. Viggo gives a great, Oscar nomination-worthy performance at the center of it all. But as much as I liked the film, I didn't find it as fascinating or affecting as 'A History of Violence.' If only this film were longer and gave more time to more thoroughly develop the relationships in the story. It leaves one wanting more. But perhaps that's the biggest compliment I can give it",
            "review_date": "2022-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent, slightly offbeat crime thriller in which Watts and especially Mortensen excel. The Turkish bath fight scene might be the most memorable, but many other scenes shine.",
            "review_date": "2022-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think many who did review this highly were more concerned on seeing Viggo's wee wee & ying yang rather than rating this movie for what it is worth...just a C grade.  This film lacked on so many levels other than yes the \"ying yang\" action!  Poor acting on many fronts too and you really need to pay attention in full detail focus to understand the concept of this barely average film.\n\n4.5 out of 10!",
            "review_date": "2021-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Naomi Watts plays a nurse who discovers a journal written in Russian on the body of a murder victim who just gave birth.  She starts to unravel the mystery of her death when she gets the journal translated, unfortunately gaining the attention of a crime family who may have something to do with it. Viggo Mortensen plays the driver of the crime family who has secrets of his own.  Fantastic film from the legendary David Cronenberg. Mortensen is incredible in his role as is Vincent Cassel.  \nSome horribly brutal scenes and an uncomfortable fight scene are still just as powerful as they were on first viewing.",
            "review_date": "2021-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great performance by Viggo Mortensen. \nAnd the fight in the sauna will be the benchmark for such things for a long time.",
            "review_date": "2021-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow what a fight scene. Also Viggo's best performance by far",
            "review_date": "2021-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brutal film with superb performances. A must-see for Watts and Mortensen fans.",
            "review_date": "2021-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Compelling and gritty?! My eyeballs! Shoddy directing and the consequent rigid acting cheapen whatever redeeming qualities its writing may show. Such a waste of a great cast... The only glimmer of greatness shows towards the end of the movie. Under a different stewardship, this could have been every bit the gritty and compelling thriller it's sold as",
            "review_date": "2021-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First and foremost, the actual plot to this film is barely important; it's the tiny enclave of the Russian mafia and the individual characters that compose this select group that draw the attention, with Mortensen as the enigmatic but capable Nikolai, Cassel as the drunken inheritor who skips by on family connections, and the film's top-notch villain, Mueller-Stahl's Semyon who puts on the airs of a wise, harmless sage but is ultimately revealed to be harboring extreme cruelty and a substantial lack of empathy. I don't feel that the film as a whole is as revelatory as some seem to believe (and not as interesting as Cronenberg's earlier outing with the lead, A History of Violence, but that might be my love for that film's small-town America setting), as Mortensen makes the best of a script that forces him into a somewhat predictable 'criminal with a heart of gold' arc, albeit one that peppers in interesting stops along the way. Everyone loves the sauna fight, one of the earliest of its brutal and bold-faced, unromanticized, long-take style to have made the jump from foreign films (particularly Korean action) before going mainstream with films such as John Wick years later. The performances certainly elevate the film above the depths that it could have sunk to; if the original premise was not refined to incorporate more interesting characters, it would have ended up relatively generic. Though Mortensen adds plenty of nuance to his role, I am an even bigger fan of Mueller-Stahl, who provided a bait-and-switch villain that feels convincing and far from cheap; his performance in the somewhat middling but underappreciated action-thriller The International had similar undertones. (3.5/5)",
            "review_date": "2020-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surely one of the best performance in Viggo Mortensen entire career. Delivered like a thriller movie, this film has it all: violence, blood and drama... all of this is sorrounded by an amazing cast, what do you want more?",
            "review_date": "2020-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked it, it's ok; not fantastic IMHO. The final part of the movie is very surprising.",
            "review_date": "2020-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good story, interesting twists in to a russian mafia endoscopy",
            "review_date": "2020-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The promise behind the cast was not fulfilled by the writing and directing of the movie. The gore and crime felt out of place and in fact were rather revolting and made me fast forward. What kept me going was the fact that it was late and I really wanted some diversion before going to bed. The steam room fight scene was so grotesque that I could not help laughing. It was noir and horrory at the same time. Poor girl, poor baby and poor Naomi. They had to go through all this. The horror, the horror!",
            "review_date": "2020-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "London = street markets and people drinking tea. Russians = shadowy gangsters with heavy accents who drink vodka. This is the depth of writing you can expect.\nThe talented cast look bored and most scenes look like they were done in one take without any direction.\nStrange, stilted editing.\nEven the foley sounds like it was done by high school students.\nBizarre, cliche movie and i have no idea why anyone could rate this highly.",
            "review_date": "2020-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the violence was a bit much but the performances make it worth a watch.",
            "review_date": "2020-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I find David Cronenberg to be a good director. He always provides strange, gory and witty movies. But Eastern Promises was disappointing. It starts out very interesting, but little by little, it unravels into a very average gangster movie, nothing more. I found it to be uneven and inconsistent.You've got some compelling scenes, some scenes of very grisly violence. But then it stops in order to just be plain boring. Which is too bad because it has a golden cast, comprised of Naomi Watts, Viggo Mortensen and Vincent Cassel in the lead roles. But those fake Russian accents are hard to follow sometimes, which ruins the storyline. Overall, I find this flick to be immensely overated, I don't see the big deal with this crime pic. But I guess that if you're a fan of the genre, check it out, but I honestly won't be revisiting it...",
            "review_date": "2020-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A raw and realistic tale of the Russian Mafia based in London, featuring Viggo Mortensen's best performance and nice cinematography. 8/10",
            "review_date": "2020-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I Russian. I bood guy. Is killer of men. I naked while kill man.",
            "review_date": "2020-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a performance by Viggo Mortensen, a fantastic movie",
            "review_date": "2020-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mortensen portrayal of the Russian mobster completely outshines Naomi Watts' midwife, and yet the story is narratively sophisticated and compelling enough to remain steadfast.",
            "review_date": "2020-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a short film that will leave you wanting more. Too bad no film of this nature that has met that bar that this movie has set.\n\nThis film is a great British-Russian film that gives insight into the Russian Mafia. This film that sticks to its source material religiously. The accuracy of the Russian Mafia tattoos with its meanings deserves respect.\n\nAction scenes were brutal and unforgiving. The opening itself keeps the audience on edge. The storyline is riveting and leaves one guessing throughout the film.\n\nAwesome performance by all the actors.\n\n5/5. A must-watch Russian or crime film enthusiasts.",
            "review_date": "2020-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A modern gangster movie. Russian mob crime movie with intense drama, violent action and dark thrills. The characters were well made and acting well done. The ending was just ok.",
            "review_date": "2019-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eh, not bad, not great in my opinion.  I don't know, the story just wasn't that captivating for me.  Nothing that intense, exciting or engaging occured within the plot.  The best aspects for me would be the performances, lighting, cinematography, and that's about it.  I didn't feel emotionally invested in the characters or what was going on.  The sporadic bloody violence was indeed graphic, that's for sure.  This was okay, nothing special.",
            "review_date": "2019-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eastern Promises has a rocky start because things start happening and they don’t tie them together. I was thoroughly confused at first, and found myself searching for answers. Thankfully, the plot starts to weave the disparate storylines together and bring all the different characters into one story. I quite liked how the characters’ motivations were formed, because I felt that I knew each person and what they were seeking through almost the entire film. It helps that the cast is delivering great performances across the board. There’s some nuance to this film that elevates it slightly above most other mob/gangster movies for me. I think mixing in the element with Naomi Watts, as a civilian trying to negotiate with the Russian mob to get what she wants, was a crucial component that kept this from feeling like another carbon copy of other crime dramas. She was engaging, and I liked how determined she seemed despite the potential danger of her situation. I think my biggest complaint about Eastern Promises is that it sometimes moves at a slow pace. The entire film is loaded with quiet moments. Even though I was into the story, the lulls in the film sometimes threatened to make me lose interest. It’s also a highly explicit film with both sexuality and gore. This is stuff I don’t normally handle well in any situation. But there is enough in the story that intrigues me, so I was able to forget about the objectionable things when they passed. I’m no expert on accents, so it’s hard for me to tell whether Viggo Mortensen is doing an amazing Russian accent or a terrible one. Either way, I know it was weird hearing that voice come out of his mouth. He does embody the type of character they needed for that role, though. I always like when an actor can pull off dangerous and likeable in one performance, and he nails it. I did enjoy Eastern Promises, even if it wasn’t totally my cup of tea.",
            "review_date": "2019-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A gritty look at the Russian mob.  Gripping at the first scene and doesn't stop until the credits roll.",
            "review_date": "2019-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good change of pace from the normal struggles of the Italian mafia to the violence and family issues of the Russian mafia. My mom recommended this so I gave it a chance not knowing what to expect; I ended up being pleasantly surprised. The characters are really good with cool stories and problems that definitely pushed the intensity of the film. The story was too good, that is, I actually got a little lost in it, needing my mom to explain some parts to me. Sadly, a good story usually has its dull moments, and this does have it. But the dull stuff was still interesting, I never got uninterested in it. There were only one or two action scenes in it and one of them was an awesome knife fight where the main character fights off hitman naked in a sauna. That was really good and cool. This is definitely a must watch for those into crime thrillers but those who are opposed to some butt-clenching violence might step away.",
            "review_date": "2019-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How could a movie with such a premise be so boring?",
            "review_date": "2019-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie. I love the two main characters. Naomi Watts was awesome.",
            "review_date": "2019-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An Unfaithful And Broken Asset.\n\nEastern Promises\n\nCronenberg has a smart stable method to work his way up on the ladder. His simplicity, and even cliches, has a panache that any filmmaker would die to have for. His lucid flow on storytelling is why it all looks so simple and easy. He doesn't rely much upon antics, but when there are their to work upon, he makes sure he builds them up sincerely and weaves them out sharply on the screen. Take the holy ceremonial or mythological ritual sequence that these gangs go through before claiming their titles or roles in their community. That entire sequence where Mortensen surrenders himself to their religion or the game that they believe in and feed themselves in, says a lot about the integrity of these characters.\n\nThese tiny characteristics of the characters is why we care, this attractive nature of theirs makes us root for them from the start. There isn't much action in the film, but only once does Mortensen throws a punch, and that entire sequence is not only well choreographed and shot but also brilliantly performed. Nikolai; the protagonist, played powerfully by Viggo Mortensen is not your average Godfather-like mafia member, he wants to prove himself and he does.\n\nNaomi Watts cloaking as Anna, the sort-of voice of the reason of the film has unfortunately very less to invest. In fact, Vincent Cassel as a spoiled brat has much more threat to convey with his uncertainty. Stephen Knight, the writer, is not overprotective or melodramatic about his content, he gives up easily but wisely, he makes sure that there is another surprising layer attached to it, to ground the emotions and justify these killings. Eastern Promises has a promising premise, scoffing off the usual crime drama rigmarole, David Cronenberg focuses on the heart of these characters.",
            "review_date": "2019-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was recommended by friends and is usually not my kind of movie. The story was not all that original but the great acting and the directing made it worth watching. A very decent drama-thriller if that's your thing.",
            "review_date": "2019-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's been a while since I've seen a good crime film, and this is one I would definitely recommend.",
            "review_date": "2019-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that isn’t completely suspenseful nor completely action-packed, it makes you wait for the action, then subdued you with an ending where you don’t get any more of that action. It’s crescendo fight scene is bold but well-done and realistic. The script is also airtight and wraps up abruptly but in a way that makes sense. Nickolai’s character makes complete sense and Mortensen’s acting is a more terrifying version of his Lord of the Rings character. I was a bit confused at the beginning of the movie but by the end I not only understood the story but appreciated it as well. It’s simplicity leaves some things to be desired and more action to reward viewers could have been added, but with everything making sense and being so polished, it’s hard to be too upset. 7.75/10",
            "review_date": "2018-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent effort all around but I really could have done without that Viggo naked fight scene. What is it with that guy? He is always taking his clothes off. Bah ! Vincent Cassel is his typical nutjob and Naomi Watts is super hot as always. My favorite scene of the movie involved the nutty Turkish kid shouting for Arsenal at a Chelsea match on the way to the ground.  He got dealt with.  It was one of those movies that seemed to linger on for hours but the running time was relatively short. Well all in all, pretty good around.",
            "review_date": "2018-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an OK gangster movie but its nothing like the oldschool cronenberg! where are the parasites?",
            "review_date": "2018-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "7/1/18  We watched this a while ago.  I was hoping for more .  Erika really liked it, but I didn't get too into it.",
            "review_date": "2018-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An impressive, powerful thriller interrupted frequently by moments of weak, made-for-TV writing and plot. Inconsistent.",
            "review_date": "2018-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It’s often engaging and offers some good characters to follow throughout the film. The story does have some sleepy sections that tended to feel broken within the plot. It is generally a good crime thriller that is definitely worth a viewing ",
            "review_date": "2018-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Viggo Mortenson's layered, mysterious and intimidating performance leaves subtle cracks of humanity that's incredible to watch in this gritty and violent psychological drama. ",
            "review_date": "2018-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First off, the movie was incredible.\n\nI'm Russian, so I get pretty critical and nitpicky when I see Russian characters in Hollywood movies. Usually I get mad or disappointed, usually the portrayals are disgraceful, the language is barely Russian at all, the people talking this mangled language barely try. Not to mention the typical Russian villains.\n\nBut here, WOW. I feel like this is the best Russian portrayal I've seen out of Hollywood. Any better than this and it'd be some kind of joint Russian production. You could tell the production did its research, most of the actors took their Russian lessons seriously, the Russian dialog made sense and was surprisingly natural. Hell, they even finally hired real Russians to play some of the extras.\n\nAnd Viggo just... He just knocked it out the park and into another galaxy. I always heard he had a talent for languages, but to hear it here was a shock. He nailed the language. Bravo to him. I might even go as far as to say that this was Viggo's most impressive role yet.\n\nI also have to say that I was really surprised by the quality of the cast here. They all did a serviceable job.\n\nNow the story took me by surprise. The third act of the movie is refreshingly unexpected. I thought I had a good grip on it all, and then I was pleasantly proven wrong. It elevated the movie from a good movie, to a great one.\n\nI can recommend this movie to anyone with a completely clear conscience.",
            "review_date": "2018-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another movie where the majority of critics and the audience portray terrible judgement.  Both Viggo Mortensen and Naomi Watts fall very far short of their best in this rather tedious and brutal film with almost nothing to recommend it.  I couldn't suspend disbelief with the characters or the story, a mix of cliches and strained credibility.  Oddly, Mortensen seems to have received Best Actor nominations for his performance here, which tells me more about the questionable standards of those who make such nominations though he's at least serious about his character in this.  The direction is probably the worst aspect of the movie.  It veers from routine to jarring, almost amateurish at times. Whether the script called for it or not, the opening scenes are gruesome and disjointed for no good reason.  Other scenes struck me as contrived or stylized in the way they were staged.",
            "review_date": "2018-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excellent Mortensen performance and a dark story are well supported by Cronenberg. Highlighted by the excellently shot bath house scene.",
            "review_date": "2018-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "***\n'Eastern Promises' is a movie that would appear to have everything: good performances, excellent direction/cinematography, and a proved writer in Steven Knight. Yet, for whatever reason, it never quite lands as well as it should. There's nothing blatantly wrong with the movie, but there's nothing particularly noteworthy either. It's a well-made crime drama made by very talented people, all of which have done better, but could do a helluva lot worse too.",
            "review_date": "2017-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Viggo Mortensen did a good job, but Vincent Cassell is always a standout for me. One of my favorite actors. He should have won an award for something he has done but never gets any recognition. This is one of his best movies.",
            "review_date": "2017-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think we can all agree Viggo Mortensen's role was the most favorable part of the film and really tied the bow with that and it being a triumphant story. It wasn't excessively violent and suited it well for the story that didn't require much violence to accomplish its essence. The twist near the end just further improves the acting side of things.",
            "review_date": "2017-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cronenberg returns to the crime drama following A History of Violence two years prior; this time around, the result is a bit more streamlined, never getting quite as caught up in a big plot twist and losing steam like that film. Eastern Promises isn't all that dissimilar to A History of Violence, dealing with similar themes of ordinary citizens getting caught in a darker world lurking all around them: this time around, Cronenberg takes us into the seedy depths of the Russian mob and one woman's entanglement with the aftermath of a rape. Despite running just 100 minutes, the film takes its time in establishing the facets of the story, as well as the inner workings of the mob, never feeling like detaild have been glossed over or rushed. It's not too intricate or complex, with just enough development to keep the intrigue alive and the story moving at a solid pace. It's an acting powerhouse across the board, but the clear standout is the Oscar nominated performance from Viggo Mortensen as Nikolai, playing a pretty convincing Eastern European. Mortensen's role only gets stronger as the story progresses and the intricacies of his character's arc are revealed: a fight sequence in a sauna, already a masterful scene as it is in its sheer brutality, becomes even more impressive in what it reveals about Nikolai as a character. If A History of Violence proved Cronenberg capable of simply exploring different themes outside of the realm of body horror, Eastern Promises cements his skill in a very different genre.",
            "review_date": "2017-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very scattered the way all these just come about. I don't really like the way Cronenberg filmed this movie. I like his movies but the way he shot this movie the lighting, I didn't care too much for. It's like he was trying to get with the times.\n\nThe story actually gets interesting once you start to see the driver show some compassion. You start to wonder how a man who chops up bodies and kills people can be empathetical towards people. That one fight scene in the bath house was brutal. \n\nThere was a twist I wasn't expecting and they made it so subtle.  \n\nI think the best way to describe this movie would be that it lack some taste. I don't really care to know more about the Russian mobs. But, interesting plot and story but not a movie I'd go back and watch again. It's cool to see how these inside jobs work and taking a glimpse inside how one works was cool to see.",
            "review_date": "2017-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With A History of Violence in 2005, David Cronenberg seemed to take his career in a more mainstream direction. It wasn't the horror or dark science fiction that many had come to know him by, but an arresting thriller that was actually based on a graphic novel. It was a big success and, two years later, led to Cronenberg sticking with his leading man Viggo Mortensen and attempting something similar with Eastern Promises. You could say that their second collaboration delivers something even more satisfying.\n\nPlot: Deeply affected by the death of a Russian teenager in childbirth, nurse Anna (Naomi Watts) takes it upon herself to find her family and save the baby from foster care. With access to the girl's diary, Anna is led to Semyon (Armin Mueller-Stahl), the owner of a Trans-Siberian restaurant. Semyon isn't the endearing character that he makes out, however, and the closer Anna gets to the girls story, the closer she gets to the enigmatic 'driver' Nikolai (Viggo Mortensen) and the bloody underworld of the Russian Mafia.\n\nWhen you think of a mob movie, your memory will most likely be jogged to the glamorously brutal Italian American variety. The obvious ones being the exemplary work of Scorsese's Goodfellas or Coppola's The Godfather. You may even consider the violent Cuban's of DePalma's Scarface and the Puerto Rican's of Carlito's Way or perhaps the Irish goons from The Coen brothers Miller's Crossing. With Eastern Promises, though, Cronenberg decides to focus on the Russian mafia operating from a restaurant in the drab, Hackney borough of London. Although it mines the same well as some of the aforementioned films, it feels like a fresh take on the mob movie, primarily because it's an ethnic group of mobsters that don't often get attention. \n\nSteven Knight's screenplay focuses on the murky world of people trafficking while exploring the tradition and initiation of Russian criminal codes. The gangsters of this story have to earn their positions and their stripes which are represented in tattoo form and by doing so, brings forth an genuine air of mystery and intrigue to the characters. This is the master stoke of the film. And Cronenberg knows it. He's not overly concerned with the plot itself. Sure, it plays out with a good degree of tension and more than holds your interest but the real draw here is what we don't see. It's the machinations of this criminal underworld and their untold code of ethics that intrigues the most. This is exemplified with some great performances; Naomi Watts delivers the perfect bewilderment of a women out of her depth and while I'm a huge fan of Vincent Cassel - and his loose-cannon, Kirill, gets a substantial amount to do here - even he isn't the standout. It's the unnerving work of Armin Mueller-Stahl who brings real gravitas as Semyon, the patriarchal head of the family and the quietly affecting, yet very intimidating, Viggo Mortensen who own this film. When we speak of mystery and intrigue, Mortensen's loyal driver Nikolai is the epitome of it. It's an absolutely captivating performance which rightly gained him his first (and long overdue) Oscar nomination with his involvement in a steam-room brawl worth the nomination alone.\n\nWhere the film is slightly let down is in its rushed denouement. For the most part, it revels in a particular pace, but when it's drawing to a close it feels muddled and determined to finish within a particular running time. Up until then, however, it's a brutal and punishing crime yarn that hits many a strong note and breathes new life into the mob film. \n\nA viceral, stylish and compelling story that benefits greatly from masterful acting. It's arguably both Cronenberg and Mortensen's finest work. This Eastern themed film keeps good on its Promises. \n\nMark Walker",
            "review_date": "2017-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Estern Promises\" is a great drama that inspires and is suspenseful to the very end. Viggo Mortensen delivers one of his best performances, right after \"Captain Fantastic\", and has a great chemistry with Naomi Watts and delivers a great Russian accent. The latter delivers a great performance as well and makes the viewer feel for her. The thing that most surprised me was the very authentic Russian accent by Vincent Cassel who as a Frenchman has an accent anyway but his performance is just brilliant. The story is great and is laid out in brilliant way. The movie jumps right into action in the opening sequence and then makes the viewer curious for more within the first ten minutes. A refreshing change here is that this movie is not predictable but has many twists and revelation that are very unexpected. Cronenberg portrays his characters here in an unconventional fashion but it is exactly that what makes them and the movie so interesting and intriguing. He builds up the story gradually and as the movie progresses the story unfolds in a very exciting and suspenseful way. With many medium shots and close ups the cinematography helps the viewer take in all the emotions and feelings that the characters show. In this movie facial expression often say more than words and that is exactly what the camera catches and what makes this movie so intense. All in all we can say that this is an amazing drama where all the elements fit together and where suspense is present form begging to end.",
            "review_date": "2017-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fucking exciting, but also incredible brutal...",
            "review_date": "2017-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eastern Promises features director David Cronenberg's trademark raw violence allied with Viggo Mortensen's strong lead performance and the result is a gritty and haunting crime drama.",
            "review_date": "2017-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The plot lacks substance and surprises only towards the end. \nStunning, though, is Cronenberg's ability to make you perceive the creepiness of Mafia's amoral familism",
            "review_date": "2017-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good story not quite as good as History.",
            "review_date": "2016-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Cronenberg weaves this tale of the Russian mob and a nurse who becomes slightly entwined with them when she attempts to discover the identity and family of a young 14 year old girl who died giving birth, in order to find a proper home for the child.  This leads us to the story of the Driver of this mob, Nicolai Luzhin, and his attempt to rise in the ranks there.  It is a great story well weaved, and features one of the best action fight scenes I have ever seen (with Viggo Mortensen entirely nude in a bath house for the entirety of it).  It is a fine picture, with a great cast and a good story.",
            "review_date": "2016-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While having some credibility issues and some ostentatious aspects, Eastern Promises stays above water by taking the best from an incredible Viggo Mortensen and surprises with its thoughtfulness and emotional depth.",
            "review_date": "2016-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eastern Promises is a refreshingly calm, well shot, unconventional gangster thriller with (for Cronenberg standards) little, but explicit, raw violence (with one scene in particular involving a naked Viggo Mortensen being one of the best and most visceral fight scenes put to film), a quietly effective score and great performances, especially by Mortensen. Its intriguing discussion of classic Cronenbergian themes- body, identity and community- within a character-driven story is only hindered by the comparatively uninteresting story-part surrounding Anna and a few other writing flaws, especially in its final 30 seconds.",
            "review_date": "2016-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great crime drama that deals with some serious issues and some really great performances and a wonderful script. Cronenberg is 100% one of the best directors around",
            "review_date": "2016-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very new-age Godfather-ish vibe to it. Viggo Mortensen pulls off the role with plenty of grace and manages to pull you into the story instantly. The levels of brutality make this unsuitable for the faint-hearted, but a good movie nonetheless if you're capable of powering through the gore scenes.",
            "review_date": "2016-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Viggo Mortensen truly shines in this crime drama that is both gritty and compelling, and very well-directed.",
            "review_date": "2016-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More a showcase for Viggo Mortensen's amazing performance than anything else, Eastern Promises is an overall mediocre gangster story. Packed with one-dimensional characters and perhaps too dialogue-rich for the genre, Eastern Promises relies on Viggo Mortensten to stay entertaining.",
            "review_date": "2016-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An unsettling movie with a daring performance from Viggo Mortensen!",
            "review_date": "2016-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie, great story and great execution, believable heroes and villains in that they are not invincible.",
            "review_date": "2016-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Viggo Mortenson's finest and most convincing performances",
            "review_date": "2016-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Viggo Mortensen is stern and calculated, reflecting the calm of a man who knows he's in charge of the situation, while not overdoing it. Naomi Watts is also great for her part, while the other castmates are OK but do not excel. A good movie that kept me engaged but not something i'd want to revisit, a solid 8/10.",
            "review_date": "2016-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit convoluted but enjoyable",
            "review_date": "2016-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Cronenberg is one of my favorite directors, even though I would really only rank one of his movies (Cosmopolis) as a favorite of mine.\n\nDavid clearly had something on his mind that he wants to talk about for each of his films, but they end up getting bogged down by poor plot structuring almost every time.\n\nThe parts of Eastern Promises that are great, are really great. The realistic portrayal of lifetime criminals, the shocking violence, every single time Viggo Mortinsenis on screen, are all fantastic, but are bogged down down by a lack of momentum and a climax that comes too early in the film.\n\nGreat movie if you are able to look past those structural issues.",
            "review_date": "2016-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dark and bloody. I enjoyed the plot even if it was somewhat predictable. But I always enjoy Viggo Mortensen in anything.",
            "review_date": "2016-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Count me as one who found this very slow and constantly waiting for the psychological drama to stimulate.  It had all the required ingredients to make something beautiful, yet the whole does not even add up to the sum it's parts.  Viggo Mortensen's performance was noteworthy, so that is a plus.  But the talented Naomi Watts wasn't employed in a fashion that brought out the best in her.  Overall this movie is quite overrated and not the psychological drama it's made out to be.",
            "review_date": "2016-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Eastern Promises\" is an expert blend of brutal violence and tender morality, and features a stellar performance from Viggo Mortensen.",
            "review_date": "2016-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eastern Promises tells the story of a Russian mob family and their connection to a woman who dies in childbirth. The film is not a typical mobster movie but instead develops characters and a story that is unique to the genre. Viggo Mortensen has a great performance as a driver of the family who shows remorse to a nurse who is trying to unveil the story behind the dead woman's past. Well acted and well told.",
            "review_date": "2016-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful drama about the russian mafia abroad.",
            "review_date": "2016-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its violent and brutally well done. In the truth of drugs human trafficking and so on. Great action thriller.",
            "review_date": "2016-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid movie, well acted.",
            "review_date": "2016-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Have not watched this since it first came out. Two times is plenty for this one.",
            "review_date": "2016-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A new kind of mafia film, \"Eastern Promises\" struck me as a Russian version of \"The Godfather\" with a fittingly grim nature.",
            "review_date": "2016-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When born into hell when your raised in a bad household that we leave for a better life to fall into another cage of hell. When we live this constant battle of struggle and pain, can't escape the misery we face wherever we go. From the moment we were born, from the moment we died. Unable to live a normal family life we wish, to bringing up a family we wish to raise how we intended. \nWhen where we end up we are stuck in, forced to live a dreadful life, when we searched long for this better life. We console in a diary to maintain our sanity and thoughts to get through it. The place we search for we realize we are searching in the wrong place before it's too late. There is no better life here, when gangsters and corruption rule the streets and you live in it and need it. When this better life isn't achievable when such corruption is too in depth and large and hidden that no one is able to solve or grasp. When these careless souls are even careless when those whom they rely on fail. When getting into deep in such departure corruption takes time and lives are at loss, but the sacrifice for those help resolve end corruption eventually until a new one happens again. A constant battle, struggle and fight that not only victims go through but those whom have to end it. \nIt takes some good hearted, soulful angels to help give a life for those whom cant.",
            "review_date": "2016-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Naomi Watts and Vincent Cassel in a film together is enough for me. The story is alright and it does get pretty brutal at times. It's about the Russia mafia in London, so unless you've seen other films on this subject then I guess you'd agree it's quite an original plot. Surprisingly, it doesn't resemble any of the crap British cockney gangster films at all; they did well to steer clear of that Guy Ritchie style rubbish.",
            "review_date": "2016-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant movie, captivating, I was drawn into this movie, the depth of characters, twisting plot, edge of your seat viewing.... Totally recommend for adult viewers.",
            "review_date": "2016-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty cool crime thriller, but it still fails to fully engage me.  While there's still a few great set pieces, it ultimately feels a bit like it's trying to hard...",
            "review_date": "2016-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very well put together film, and classic Cronenberg as we like him. Depth, subtlety, and great acting all around... quite refreshing.",
            "review_date": "2016-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Way too violent,  Horrible stories of Russian Mob in London.   Disgustingly violent. Naomi watts makes the movie tolerable.",
            "review_date": "2016-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a fucking joke...",
            "review_date": "2016-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "an OK film. nothing special. average acting.",
            "review_date": "2016-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Viggo Mortensen and Naomi star in Eastern Promises. The film centers around a small area of Russian that features the Russian mob. Watts delivers birth to a child to a prostitute who dies during child birth and becomes interested in the mother's life after uncovering her diary. She comes across a driver (Mortensen) who is trying to move his way up in the mob. The contents of the diary are vital as they uncover aspects of that threaten the mob. Eastern Promises was an interesting movie that features good performances and some pretty good scenes. The film is not action centered and does its pace will likely detract people. Although I thought it was a solid drama, the film does not have enough resolve for me to see it again.",
            "review_date": "2015-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eastern Promises is the least Cronenbergey Cronenberg film that ever Croned a Berg; and that's alright.  \n\nEnter the seedy world of, uh, London, where the Russian Mob runs the streets.  Vincent Cassel plays a bumbling fuck-up mafioso, whose only saving grace is being son to a local Vor (made man, essentially) played by veteran actor Armin Mueller-Stahl.  Along for the ride is Cassel's driver, muscle, and all around bad ass, Nikolai, played by Viggo Morgenstein.  \n\nAlthough Nikolai is the main draw of the movie, the film is rich in Russian Mafia traditions, so we're partly lead through the exposition of those ideas by \"the average joe\" character of Anna, played by Naomi Watts.  \n\nAnywho, Naomi Watts works at a hospital when her life gets flipped turned upside down by a 14 year old girl who dies giving birth.  Watts is like \"oh shit\" and finds a diary and a business card on the body, and decides to investigate.  She heads to the restaurant/club on the card and meets a guy who ends up being a mob boss who ends up getting pissed off about the whole thing, and sends Aragorn to off Naomi Watts' Ukranian Uncle.  Following the success of the hit, and the years of loyalty within the family, Aragorn gets upgraded in status, and you get to see his cool tattoos.  \n\nThe rest of the film involves Watts trying to get justice, while dealing against villains way outside of her league.  \n\nThe film is notable for being one of the finest films regarding Russian criminal organizations, avoiding ridiculous stereotypes while also showing the brutality, deception, and ritual culture of the clandestine groups.  The film is also known for its realism, with Aragorn's tattoos being considered so accurate that customers would weep into their pickled herring anytime he would go to a nearby Russian diner for lunch.  The movie is also noteworthy for discussing the underestimated and extremely significant criminal market that is human trafficking, and the effects it has among countries, groups, and women.\n\nAll things concerning the story aside, the film is also extremely proficient technically.  The acting is damn fine (especially from Morgenstein), the cinematography is gritty (matching the tone of the film perfectly), the music is haunting, and the pace of the film is so close to perfect that I don't even know how they could have made it better.  Aside from that, great films have something regular films don't: memorable scenes.  Eastern Promises has a lot of those, almost all of which are carried by Morgenstein, including a scene where he carefully preps a corpse for disposal, and another where he fights some dudes in a bath house with his dick flopping all over the place.   Awesome.  \n\nTL;DR - 9/10\nCronenberg is solid.  Motherfucker made The Fly.  Although crime is not a film genre he's deeply involved in, Eastern Promises proves that the dude can do whatever he wants and make it dope.  So if you're looking for a realistic crime movie about the Russian mob, with some great acting and a solid storyline, then here it is.  Watch the movie.  Or buy it, so that way when people come over and see it on your shelf, they'll know you mean fucking business, and they'll be weeping into their pickled herring in no time at all.",
            "review_date": "2015-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well timed film about Russian mafia and its uses, with the usual quota of violence from David Cronenberg",
            "review_date": "2015-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There were some really good movies coming out from about 2004-2010.  Some great acting was being done in some of these films.  One of the films in the gangster genre that not too many people seem to be all that familiar with is Eastern Promises.  What do most people know Viggo for? Lord of the Rings obviously, he is the king after all.  But behind that big budget blockbuster of a trilogy and role for him is one of the great actors of our time.  He showcases all his worth in Eastern Promises.  Not many movies if any that I know of have been made about the true Russian mafia.  Eastern Promises goes deep into the culture of this group.  This movie is a great gangster movie and then some.  Showcasing the mentality of these criminals and the brutal violence that surrounds them.  A fantastic movie.",
            "review_date": "2015-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "*** bordering on **1/2. Why? Not half as good as A History of Violence. I didnt buy the ending and there was hardly any tension there. Rather gruesome violent death scenes though, if you are into those things",
            "review_date": "2015-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While having some credibility issues and some ostentatious aspects, this movie takes the best from an incredible Viggo Mortensen and surprises with its depth.",
            "review_date": "2015-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eastern Promises benefits from a strong Russian atmosphere and a harsh look at modern day mobsters that aren't given as much spotlight as the Italian or Irish. The thought of such violent and bloody criminals living among the common folk is an unreal almost surreal idea which is beautifully and shockingly realized in the film. Along with a string of well-performed and impactful characters, the performance to focus on is above all Viggo Mortenson as Nikolai Luzhin, the slick, viscous and yet compassionate rising Russian mobster. Mortenson transforms completely in the role with a calm cool demeanor, a lot of tattoos and a very convincing Russian accent, bringing more of a heart to the character as well as a presence which will not soon be forgotten.",
            "review_date": "2015-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The ending of the movie was happy ending and a easy one. Otherwise story was great.",
            "review_date": "2015-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Full review at WordsonFilms.com \n\nEastern Promises is a grim, unsettling, brutal, and darkly sexy film that features a fantastic performance from Mortensen, overcomes a few overly sentimental hiccups, and ultimately makes for memorable and engrossing ride.",
            "review_date": "2015-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eastern Promises makes for a mesmerizing thriller that keeps unraveling layers of surprise. A great story brought to life by David Cronenberg and Viggo Mortensen, who is one of the finest actors around, makes Eastern Promises a gripping crime story.",
            "review_date": "2015-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really great movie. I was actually surprised how much i liked it. The ratings dont lie on this one and Viggo couldnt have played a better Russian.",
            "review_date": "2015-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A gritty and smart thriller that never overstates itself. Steven Knight writes remarkably deep and complex characters that slowly unveil themselves little by little throughout Eastern Promises. Cronenberg gives a dreadful direction to this grim story that is surprisingly watchable. Mortensen, as Nikolai, is controlled and delivers a memorable character that hollywood writers should take note of, and not give us everything about a character and where they stand right off the bat. Very good film and worth a watch!\n\nCheck out more of my reviews: reviewsbycaleb.com",
            "review_date": "2015-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "People and critics alike really enjoy the older and more nuanced Cronenberg style.  I am one of the few who do not.  I grew up with this man directing such minor classics as SCANNERS and VIDEODROME and outright classics like THE FLY and NAKED LUNCH.  This new Cronenberg is old and weathered but also seemingly less creative.  His dark and brooding overall style along with signature moments of explicit violence and sex are still there and this is why people are drawn in, but I've seen so much better not just from the man himself but from others in the same areas that he's recently tread with this one (LITTLE ODESSA covers Russian mafia better) and SPIDER (check out CLEAN, SHAVEN instead) and A HISTORY OF VIOLENCE (the obvious choice is Peckinpah's STRAW DOGS).  I don't know...maybe I'm getting more jaded as I age but I'm fairly certain that Cronenberg has settled into mainstream movie making just fine enough to dull most senses...how he's fooling the critics as well has me scratching my head...",
            "review_date": "2015-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Something is good here and lot's missing. But, highly suspenseful.",
            "review_date": "2015-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is nothing really wrong with this movie, but it is all a bit expected. We've seen this before.",
            "review_date": "2015-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mob loyalty has nothing to do with familial ties, brotherhood, emotional neediness, or any other term that might suggest a genuine, true bond - mob loyalty has to do with fear, a four-letter word written in the blood of a Benedict Arnold who just had his throat slashed.   Coincidentally, \"Eastern Promises\", a mob film, opens with an enemy getting their neck cut open, with all the subtlety of exceptionally over-the-top porno.  This event is crossed and eventually revealed to be connected with the death of Tatiana, a murdered (and pregnant) 14-year-old girl.  Perhaps it's needed for \"Eastern Promises\" to introduce itself with these ugly events - they prepare us for the stirring brutality to follow.\n\tTatiana's nurse, Anna (Naomi Watts), is understandably disturbed by the tragedy; only the baby is saved, the mother damaged beyond belief.  Desperate to find out who would have wanted to harm Tatiana, Anna fortunately finds her patient's diary, with a bookmark leading to the local Trans-Siberian Restaurant.  There, she meets Semyon (Armin Mueller-Stahl), the aging owner she initially believes to be a friendly sort.  As she gets more and more involved, though, Anna finds that she is no longer just a woman trying to make right; she has become a woman that has angered a nasty crime syndicate that will stop at nothing to prevent disorder from befalling their meticulous system.\n\t\"Eastern Promises\" also involves Semyon's driver, Nikolai Luzhin (Viggo Mortensen), whose scrappy but slick deliverance (and tolerance) of violence finds him climbing the rankings of the blood-stained organization like a knife wielding vampire warrior.\n\tDavid Cronenberg began his career as a horror maven with a creepy fixation on fantastical bodily destruction, and though he still isn't afraid to throw around explicit shots of murderous injury, he has matured, aging from a kid fascinated by the fears of delusion to a wise filmmaker who amplifies unease in the scope of grimy reality.  \"Eastern Promises\" is one of his best movies, a more psychotic peer to Ford Coppola's \"The Godfather\".  Whereas \"The Godfather\" lined itself in foreboding placidity, ready to erupt at the nearest mini-climax, \"Eastern Promises\" is liked a panther on the prowl, searching for the slightest misdemeanor, delighting in its punishment.\n\tThere is humanity to be found, mostly through the increasingly fearful Anna and her anxious family, but \"Eastern Promises\" is a captivating thriller mesmerized by the businesslike manner violence is so frequently carried through.  The mafia calls for hits, retributions, and silences; a murder has nothing to do with emotion, but with order.  Any chance of derailment could result in the downfall of the structure these Russians have so carefully built from scratch.  Sex trafficking also exists in their world (upsettingly, but honestly so); is it possible that the old ideals of finding a better life in a wealthy country can survive here? The film pushes its characters far enough to make them wonder just how long they can continue on a path that can only end in premature death.\n\tThough he begins as a secondary character, Nikolai eventually becomes the most magnetic character in \"Eastern Promises\", as he is quickly brought up in the ranks and progressively pushed into situations only a grizzled veteran would be able to handle.  Mortensen's performance is simultaneously foreboding and inexplicably heroic; in his best scene, he ferociously fights two hit men to the death in a bathhouse, his only clothing coming in the form of his numerous tattoos.  The brawl is vicious and lethal; every hit is intensified, not only because Nikolai has no armor to speak of, but also because it tests the boundaries he probably never thought about overcoming.  \n\tIf not for Watts' delicate performance, \"Eastern Promises\" would cannibalize itself within its fortress of carnage; Watts serves as the film's most optimistic aspect, standing as one of the too few characters that will make it out of the story alive.  With its balance of character study, criminal fixation, and lingering humanity, \"Eastern Promises\" is a successfully ambitious mob film that acts as a career best for the always engrossing Cronenberg.",
            "review_date": "2015-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm just the driver.",
            "review_date": "2015-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies if seen in many years. Viggo Mortensen is on top of his game - big time! Perfect casting right down the line.",
            "review_date": "2015-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good mystery/suspenser",
            "review_date": "2015-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cronenberg delivers a super violent gangster flick that is so gritty and tough it will leave you wanting more. Viggo Mortensen provides a subdued but amazing performance from start to finish.",
            "review_date": "2015-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Viggo is god! Seriously! He was brilliant!",
            "review_date": "2015-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hardly a masterpiece, but definitely worth a the while thanks to its focus on its characters and its story, instead of the violence that it mightve easily been the focus of the film. It does encounter some issues all throught, but the subject and its treatment make it a pretty interesting film with great moments.",
            "review_date": "2014-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film may or may not be David Cronenberg's finest achievement as a director thus far. He directs this film with a clear appreciation for the psychology of the crime genre. This is the kind of subtle directorial detail that many filmmakers gloss over, but Cronenberg is just insightful enough to prop up and put on display.\n\nIf the Lord Of The Rings wasn't enough to cement Viggo Mortenson into cinematic history, this master class performance surely will. This is the kind of subdued but emotionally complex performance that you would expect from Mortenson, but add in screen time with the great Vincent Cassel and you're in for a crime film that mustn't be missed.\n\nThis is a masterpiece and I loved it! Absolutely incredible work!",
            "review_date": "2014-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It had a great opening 30 minutes. But after that, it fell short. I got bored. There really is no story, and when there were story, it wasnt interesting. The acting and directing was good. But it felt like 2 and a half hours. When its a hour and forty minute movie. Overall, not the strongest Cronenberg film. Watch A History of Violence for a better Cronenberg film.",
            "review_date": "2014-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film really does promise more than it delivers.\nThe characters and story were not that interesting, but in the end it picks up a bit and then somewhat ends without leaving much of an effect. \nThis film was rather forgettable and not Cronenberg's strongest.",
            "review_date": "2014-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When it comes to this kinda movies Cronenberg is the man......",
            "review_date": "2014-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gritty, hard and entertaining Russian mobster thriller. Great performance by lead actor and rest of cast. Will leave you wanting more.",
            "review_date": "2014-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great movie, keeps you guessing.",
            "review_date": "2014-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Cronenberg has made yet another masterpiece, perhaps even superior to his previous effort \"A History of Violence\".",
            "review_date": "2014-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A gritty crime story/epic featuring a scene stealing performance from Viggo Mortensen.  The violence is amped up and there is psychological drama aspects included in the film. It's intense at times and dull as well. There is not a ton of action here but he and Naomi Watts are enough to carry this.",
            "review_date": "2014-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing performances from Viggo Mortenson and Naoma Watts",
            "review_date": "2014-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In more than one way akin to A History of Violence, and almost as brilliant. Almost, but still very good, featuring one of the most down-to-earth fight scenes I've seen.",
            "review_date": "2014-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know. It was fulfilling in a mild way, considering the degree of violence. It was not too long.",
            "review_date": "2014-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful mini-epic. Viggo/Cassel are great. Violence was great. Watts was great. Great was great. Accents were great.",
            "review_date": "2014-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Dark, gritty, disturbing, with a fantastic performance from Mortensen.",
            "review_date": "2014-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film! Highly recommended! Aragorn killing gansters and stuff",
            "review_date": "2014-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very solid film that makes me wish for a sequel. But Cronenberg is either a master of leaving you wanting more, or just doesn't wrap up the loose ends. It's hard to decide. Vigo Mortensen gives a standout performance and is really the driving force of the film.",
            "review_date": "2014-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beautifully written , directed and performed , \"Eastern Promises\" is a deep thoughtful and gritty tale that states the prowess of Cronenberg in this crime thriller genre",
            "review_date": "2014-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This marks the second time Mr. Cronenberg has displayed Viggo Mortensen's screen presence in an enterprising role, while using his own knack for character study and graphic violence to make a highly riveting crime drama.",
            "review_date": "2014-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not hurting babies or children is the Russian promise. I first heard that in 'little Nikita' some 30 years ago. I hear it again in this movie. There is a silver lining to the Russian mafia cloud.",
            "review_date": "2014-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cronenberg takes us through this blood-soaked tale of Russian underworld in London. And the journey is as beautiful as it is harrowing.",
            "review_date": "2014-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Passionless and bland. Eastern Promises has a lot elements of a good crime-thriller, but overall, falls short of any real purpose.",
            "review_date": "2014-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Minor plot contrivances aside, Eastern Promises finds director David Cronenberg at his most ambitious and versatile, weaving a crime story that is equal parts grim and engaging",
            "review_date": "2014-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Cronenberg being more famous for his body horror films crafts this stunning, riveting thriller with dramatic overtones. With a brilliant cast of actors, Cronenberg does a great job at crafting a stunning picture that proves that he is able to make something other than a horror film. I thought that this film was a far superior film than A History of Violence, which I couldn't get into. The film has a very good story that is complimented by the performances of its actors, and it's a movie that is steadily paced and takes it's time for the story to unfold, therefore it's a movie that you are invested it more often than not because you are hooked at will happen next. Cronenberg's direction is immaculate and he crafts a fine picture with Eastern Promises. This is a solid film that is sure to please fans of Cronenberg's work, even if it's not a horror film, which is what he's most famous for, Eastern Promises is a taut, exciting picture that steadily unravels before you, and you simply cannot look away as it's truly an intriguing picture from start to finish. With memorable performances from its cast, especially that of Viggo Mortensen in a finely tuned performance that is menacing, cold blooded, this ranks also as one of his most intense yet. Eastern Promises is a visceral Thriller that is both brutal and beautiful in the sense that what Cronenberg has created here is simply a superb piece of cinema.  If you have a taste for something different, and love David Cronenberg, then you're sure going to enjoy this film. Everything that is presented on-screen is near perfection, and it ranks among Cronenberg's most memorable films in the last few years.",
            "review_date": "2014-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After this movie Viggo Mortensen sealed his place on my list of best actors ever. Really subtle but profound story of crime and punishment.",
            "review_date": "2014-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Viggo Mortenson thrives as the slicked, inked and intimidating man delving into the intriguing world of underground crime.",
            "review_date": "2014-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm going to say this right now, David Cronenberg has always made thought provoking films in my opinion (The Fly, Scanners, Naked Lunch); were they any good, my answer is yes. With Eastern Promises, Cronenberg creates a gritty, dark atmosphere with great performances, especially with Viggo Mortensen, he had a great performance. Eastern Promises centers around the Russian mafia and their elaborate human/sex trafficking ring. Naomi Watt's character soon finds up what they're into after finding the diary of a woman who died in her work shift. That woman turned out to be pregnant and a prostitute in that mob's ring of trafficking. The plot unravels, and the movie just gets better and better. This movie feels like a psychological thriller, a mystery, and a brutal mob film. Eatern Promises is surprisingly compelling, unusually dark comic, and in the end, it pulls the rug from underneath. Great performances, great character complexities, and great directing makes Eastern Promises a brutal, gritty, and interesting experience.",
            "review_date": "2014-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was Okay..Boring & Bland In Parts With Some Pretty Average Acting / Production Value.",
            "review_date": "2014-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Viggo Mortenson Definitely Deserved The Oscar Nomination",
            "review_date": "2014-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Viggo Mortenson Definitely Deserved The Oscar Nomination",
            "review_date": "2014-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brutally compelling and fascinating film worthy of your attention!",
            "review_date": "2014-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Viggo..confused showstealer or showstopper here..Naomi Watts, same forced expression here like The Ring duology. Cronenberg, nothing much impressive in this case. The film, brings a lot of contents on the table,but for a smaller approach. It wonders me what is the reason Cronenberg did not get more aggressive with his films. They had very much potential, but always with a limited scope. Strange, at least for me, expected a lot.",
            "review_date": "2014-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a violent, angry adult crime story, a simply one of Viggo's best. For the ladies, the sauna scene alone makes this a must watch.",
            "review_date": "2014-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An interesting look into the Russian mob's presence in London, but not much else. Slow pacing is hardly an issue when it pays off, but not even Mortenson's brimming humanity or Watt's doe eyed (and nice butt) cunning can stop all the beats in the movie from leading to one extremely easy wrap-up. Also, there's only one intensely harrowing scene to be found, and it doesn't make the rest of the mislaid character examinations that lead nowhere (does it matter that Viggo's friend is in the closet?) and ineffective scenes depicting brooding old men any better. All in all, it's not that I require heady hyperviolence in order to enjoy my mob movies, it's just... ok, yeah, there's really no way to ruin a mob movie for me faster than to remove the heady hyperviolence. 2.5/5 Another Cronenberg dud, imho.",
            "review_date": "2014-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just the right dosage of everything. Excellent acting, easy to follow, interesting twists and overall a wonderfully written crime drama.",
            "review_date": "2014-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Cronenbergs powerhouse thriller Eastern Promises contains a smart and interesting plot, fantastic direction and incredible performances.",
            "review_date": "2014-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely thrilling. Fantastic acting by Viggo!!",
            "review_date": "2014-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eastern Promises is an above average thriller due to its great performances and directing, but sometimes failed to keep my attention.",
            "review_date": "2014-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe it's a little too graphic for some to stomach, but it's nothing bad.  Everyone who dies gets their throat slit.  At times, Eastern Promises sets out to be a great mobster flick, but it can't help but feel like it's copying a huge part of Goodfellas, The Godfather, Scarface, etc.  This could have been in the making of a great gangster flick, but it unfortunately never soars.  The acting is probably the best part of this.  Viggo Mortensen pretty much steals the show and Naomi Watts isn't bad herself.  However, it's let down by some very jarring tonal shifts.  It didn't know whether it wanted to be a psychological film or a mobster one.  However, watching Mortensen chew the scenery up is enough to warrant a 6/10.  It's nothing great, but it's at least nothing terrible.",
            "review_date": "2014-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's an intriguing and gritty film that could've been a lot more some scenes were very clichéd and resembling The Godfather but still its enjoyable",
            "review_date": "2014-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An entertaining and well shot thriller, so whilst Cronenberg may have found himself somewhat closer to the mainstream than he is typically used to, he is still a force to be reckoned with.",
            "review_date": "2013-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While I thought this film had some interesting visual moments, I have been forever puzzled why so many people liked it so much. It seems predictable and just another organized crime flick to me.",
            "review_date": "2013-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent Cronenberg film. Moves a bit slowly at times, but is interesting. Wonderful performances all around. The story is very believable. The sauna scene is a bit much - ladies, if you ever dreamed of seeing Viggo Mortenson completely naked, here's your chance. Tense crime drama.",
            "review_date": "2013-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gritty, Unflinching and Powerful, Eastern Promises is a compelling and engrossing drama with a superb performance from Viggo Mortensen",
            "review_date": "2013-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fight scene in the sauna is brutal! Awesome dialog and good performances. Great flick!",
            "review_date": "2013-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "83%\nSaw this on 21/09/2013\nEastern Promises was an odd movie. It was not so violent, but it was hard to watch through seeing all those onscreen nudity as well. This is the only Viggo Mortensen film that I have seen other than the LOTR series. I am not a big fan of the actor, but he has a daring role in this film. The acting and drama involved in this film is okay, but my favourite actor here is Vincent Cassel.",
            "review_date": "2013-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good film. Some far fetched aspects but definitely worth a look!",
            "review_date": "2013-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Compelling and good but not 'brilliant'!  Very good to highlight the plight of young women caught up in human trafficking.",
            "review_date": "2013-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More of a Western than a crime drama (I suppose there is no difference really), the clever plot-twist is exemplary, Viggo is suitably GAR, and in general, another tense, gritty, well paced Cronenburg romp. It's nothing you've seen before in terms of thematic delivery, but it's entertaining all the way.",
            "review_date": "2013-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my first review. I just watched this film so it's still fresh in my mind. I won't go into the story.\n\nI did like this film. There were both the likeable and the hateful characters. A very good performance by Viggo Mortensen. His Russian accent disappeared a couple of times but I'll forgive him. Armin Mueller-Stahl was pretty damn good too. Naomi Watts was consistent, but that's all the praise I can give her. Though the film should have been about her, she took the backseat and it really was Viggo who stole the show. I was pretty disappointed by Vincent Cassel. He was all over the bloody place. \n\nThe whole film was a strong, continuous narrative. I've heard people complaining about the lack of surprises in the script. I really did not think they were necessary. I predicted a lot of the things before the end of the film, but I was delighted in the way they were presented. It's not the best thriller there ever was, but it's an engaging story. I wasn't expecting a great piece before I watched this, so I'm pretty happy with what I got. \n\nI will list a couple of weaknesses, however. The ending was lacklustre. I needed a bit more umph. For God's sake, the head of the Russian Mafia is going to be arrested and we're not even going to give that 2 minutes of screen time?? The ending wasn't all Hollywood, which I'm pleased about, but all I ask for is a reasonable conclusion with all loose ends tied up. The ending, plus a couple of really cringe-worthy moments in the dialogue, prevented the film from reaching the heights it was capable of. That's just my opinion. \n\nStill though, solid 4 stars.",
            "review_date": "2013-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it lives up to its hefty expectations, the story never feels as strong as it could be- Cronenberg still gives us the punch that we saw in his previous work as does Mortensen but there is a sense of missed potential here as it becomes clear that the plot isn't going to live up to the other elements of the film.\n\nIt's full of grit visually and has some of the strongest scenes of realistic and believable violence that you are likely to find. Add to that Mortensen's aggressive performance and you've got something brilliant. The rest of the cast deliver too and there's some strong dialogue and generally just some very cool scenes. The only problem is, sadly, a pretty big one- story-wise it just doesn't live up to the premise. \n\nIt seems on track at first but things begin to feel rushed and incomplete and I couldn't help but wonder why this film wasn't longer- it could have stayed interesting to the two-hour mark and the film really needed the extra minutes to seal things in but instead we get plot developments that all seem to end with 'Luzhin saving the day off-screen'. Things feel fast at times as if they are just there to fill in space between the key moments and worse yet, nothing is hard to predict here. It's done well so I wouldn't call it cliché but there is definitely a lack of some originality and excitement with the storyline. Add to that the mind-bogglingly half-baked attempt at creating a romantic relationship between Luzhin and Khitova and there's definitely some disappointment when all is said and done. \n\nDespite such faults, it's never a bad film- the dialogue is fine and the cast, along with the direction, keep us entertained throughout. As a result, I do recommend it but if you are after something that feels unconventional or new and fulfilling, look elsewhere.",
            "review_date": "2013-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable Russian mafia with some really entertaining, violent scenes. The story is very intriguing but does feel somewhat rushed towards the end. Overall a really enjoyable watch which I would recommend.",
            "review_date": "2013-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "rather gory in places, quite amused to see a good deal of this film was shot in a street i walk down every day on my way to work, ending a tad disappointing as it didnt really tie everything up",
            "review_date": "2013-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only Mortensen really impresses here, though he does so masterfully. Director David Cronenberg's usual gritty violence and pyschological interference is present, but the script flows so smoothly that the tension is largely lost. More interesting than entertaining,",
            "review_date": "2013-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a great gangster movie with a story that very well written. vitto mortenson shows just how good an actor he is",
            "review_date": "2013-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A mystery drenched in darkness, Eastern Promises shows London at its grimmest in this tale of evil, family, culture, and morality. Despite Mortensen and Cassel's strong performances, Eastern Promises fails to reach the point of depth found in mafia films of the past, and the story fails to deliver past the momentum of the gruesome action sequences. However, David Cronenberg's solid direction makes Eastern Promises an extremely gripping and an overall well-done film.",
            "review_date": "2013-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Viggo Mortensen convincing in an action movie - surprise for me. Not very good, but it has enough originality to make it worth seeing.",
            "review_date": "2013-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was SO GOOD, oh my gosh. I love these suspense dramas where it's so dark and it's so bloody (even though there's really only one major action scene) and ahhh, it was just so good. Viggo Mortensen was of course, amazing in his role. The plot twist was kinda left hanging (I feel like it could have been explored more at the end), but dayum, Viggo was werqing it all through the movie and he was intense! Naomi Watts was perfect - kinda wasted, but her role was vital, so. Vincent Cassel and Armin Mueller-Stahl (the two mobsters) were both amazing. The entire cast was just amaaaaazing to be honest. It was gritty, well-paced, intense, dark, compelling etc. - carried by the hugely talented cast. My only qualm with this movie was that it was a tad long, but it was well-paced, so it's not a major complaint. Would recommend it to anyone who enjoys suspense dramas or crime dramas!",
            "review_date": "2013-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film is not actually intriguing, but still, it enterteins.\nThe scene where Viggo Mortensen is attacked in the baths is a piece of art.",
            "review_date": "2013-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It seems as a light drama for it's surface, but it roots as a deep story of the Russian Mafia. It has lots of insights about the tattoos and their purpose. 'Tis a different kind of mafia film, Russian Style!",
            "review_date": "2013-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Edge of your seat on every second.  Deeply engaging performances. Also, Armani suits have never been worn better (haha!)",
            "review_date": "2013-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yet another great and different Cronenberg flick. A slow burn of a movie that you'll be in love with by the end. Viggo Mortensen's performance here is brilliant and the plot while simple is very effective. Only negative I can level against the film is the predictable plot twist.",
            "review_date": "2013-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In a much overused genre, Eastern Promises is able to rise above the average gangster drama through very devoted performances from its talented actors and smooth direction by David Cronenberg. Despite the unnecessary explicit content, Eastern Promises proves to be an excellent addition to the gangster genre.",
            "review_date": "2013-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A realistic crime thriller of Russian criminals with sex trafficking and violence subjects.",
            "review_date": "2013-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story is expertly told, the acting superb, and the cinematography is appropriately hard and gritty.  The only downside is that the film feels unfinished.",
            "review_date": "2013-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great crime thriller. It's intense, brutal, but elegant at the same time. Mortensen and Naomi Watts are at their best, as well as the music. It's the kind that puts you into the Mafia film mood, which takes this one into a very good level.",
            "review_date": "2013-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful crime story about Russian mafia. Smooth storytelling, engaging characters in the forms of Viggo Mortensen and Naomi Watts, but when the plot is building up to the climax, Cronenberg decided to give an abrupt end to the show, making it incomplete somewhat. What Cronenberg could have done was elaborate a little more on how the kingpin was finished off and how Mortensen's character ascended to the pinnacle. Instead, he decided to make it ends so abruptly that audience would not know the so-called climax was actually the final climax. Of course he also stopped short of telling where all these plots are heading too with such premature ending. If not for the ending, it would have become one of the finest crime epics.",
            "review_date": "2013-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought it would be a bit too violent for me, being a Russian Mafia movie.  But Viggo and Naomi did a great job with their accents... and the sauna scene was nail biting.  Well done!",
            "review_date": "2013-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A solid gangster film with some fresh (and some cliched) messages.  Viggo Mortensen has an intriguingly reserved performance that added a great deal to the film's effectiveness.  Definitely worth seeing, even if it lacks some of the punch that the typical gangster film delivers.",
            "review_date": "2013-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eastern Promises was an exciting movie to watch! The clash of both stories were very well constructive and each actor played his or her role pretty well. Viggo Mortensen made an incredible performance which through the movie was displayed well and emotionally constructive.",
            "review_date": "2013-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "HOLY CRAP!   it'll get nominated, Viggo will get nominated, Vincent will, just omg!",
            "review_date": "2013-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great crime thriller with outstanding cast. I was slightly disappointed with its ending but all in all it's another Cronenberg movie that I liked a lot.",
            "review_date": "2013-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "too slow literally goes nowhere",
            "review_date": "2013-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a film for all eyes. From start to finish, not necessarily the graphic violence, but mostly the raw truth is strong enough to shy away some forms of audience. Extremely original, as a mob movie has never been created. The role of creating an eye into the harsh Russian mob of London they use a character involved in situations completely out of her element. It is complicated due to the immense different perspectives but not hard to follow. The view of the Russian culture is not exactly flattering but brings the viewer deep inside dark realities, but also on the surface of a few stereo types as well. Not the work expected from relatively no-name writer Knight. Most films would depict one of the three mob members as pivotal characters, but using an outside entity is unique and greatly thought through. At some points too much is attempted, for example the narration of the dead mother with whom you need no further explanation but the story that follows her giving birth. Watts is nothing extraordinary but is completely believable. Mortenson's character is chilling and his heart is deep inside, brought to surface by his instinctual decision making. He does an incredible job, his role is the glue to the film. You are unable to take your eyes off his movements and your mind off his mentality, second guessing yourself constantly. Cassel's character is intriguing, meant to illuminate disgust in many ways. I am grateful for what Cassel can bring to the screen, especially with this portrayal of a pitiful sociopath. The interactions between Cassel and Mortenson's characters are fascinating, like viewing the food chain out of order. The original story is eventually a little\nwashed out with too many side stories and facets to the mob issues on screen. The violence is raw, not film action but real grit and blood. Although ending unexpected in a certain unrealistic way, it is a suitable finish to tie things today and create a conclusion to the conflict at hand.",
            "review_date": "2013-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gripping. A whole new look at London'd Russian Mafia. OUtstanding performances from Watts, Mortensen, Mueller-Stahl",
            "review_date": "2013-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another vanishing review. Hmm..once again, I thought I had reviewed this ages ago. Cronenberg creates more mainstream films every now and again and with wonderful results. Although overflowing with violence, this is nonetheless a creative masterpiece.",
            "review_date": "2013-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great movie, the acting won me over. the plot, action, storyline etc. was okay, but the supurb job by viggo was phenomenal. i almost thought he was russian, but the fluency in which he spoke it.. very violent though.",
            "review_date": "2013-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An innovative and compelling crime drama with talent on every front.",
            "review_date": "2013-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The thrill keeps you awake till the end. Splendid acting from Viggo Mortensen. Thumbs up for the excellent dramatization of the plot.",
            "review_date": "2013-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The shower fight scene gives me a funny feeling in my pants.",
            "review_date": "2013-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is a classic love this film",
            "review_date": "2013-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A superb work, although if anything too brief, and not enough Naomi. This is everything the awful The Departed should have been.",
            "review_date": "2013-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Cronenberg's Eastern Promises is the story about a British-Russian midwife, Anna Khitrova (Naomi Watts) who have just delivered an infant from a young Russian prostitute that died during the childbirth. Nobody knows who that girl was, all that she had was a diary written in Russian. Anna is determent to find the baby's family. But the content in the diary might be dangerous for the Russian mafia that becomes involved when Anna is foolish enough to let a Russian restaurant owner/mafia boss translate the diary. Something that aren't so good, considering that he has hired such brutal hitmen like Nikolai Luzhin (Viggo Mortensen).\n\nViggo Mortensen who once again team up with Cronenberg give us a marvelous performance as the brutal but loyal mobster. He even looks Russian and also speaks it. Vincent Cassel is excellent as Mortensen's premature psychotic partner, Kirill, that are constantly rebuked by his father, the mafia boss, Semyon, played wonderfully by the great Armin Mueller-Stahl. In other words, there's great performances all over the place.\n\nI liked the plot, because it's a family blood bonded story that makes movies like The Godfather great. It is a quality gangster picture, with a dark overtone of lawlessness, and a lot of on-screen violence that are truly shocking and powerful, specially a scene were Mortensen has to fight of two Chechen mobsters in a Turkish bath, bare naked. This is certainly another great gangster film from Cronenberg. Thumbs up.",
            "review_date": "2013-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The build up was astonishing, it was interesting to see these characters together on screen, until the movie ends like the sopranos",
            "review_date": "2013-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing better than a naked knife fight.",
            "review_date": "2013-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe i should watch this again but i wasn't blown away like i expected.",
            "review_date": "2013-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such promise for this dark drama, ruined by an ending I hated. I'll say no more...",
            "review_date": "2013-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, definately worth a rent.",
            "review_date": "2013-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Cronenberg + Viggo Mortensen = fantastic movie. Their chemistry was proved to be amazing in the History of Violence. Once again they work together and this time Naomi Watts gives fine supporting role. This movie is dark and stylish. Story is fascinating though. Vincent Cassel is great also.",
            "review_date": "2013-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Eastern Promises\" is the only film I can recall that prompted a second viewing mere hours after I watched it for the first time. It is a profoundly spiritual film (a Christmas story really, beginning with a virgin birth) about love and sacrifice that left me deeply moved. It also contains one of the most jaw-dropping, horrifically tense fight sequences ever put on film, and a brilliant performance for the ages by Viggo Mortensen.\n\nA transcendentally beautiful piece of work, and one of my absolute favorites.",
            "review_date": "2013-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story-I'm normally not into gangster movies, but I really enjoyed this one.",
            "review_date": "2013-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Visceral and Real Life Movie with Thoughtful Implications. One of the Gnarliest Fight Scenes I've Ever Seen on Film. Sure Do Love the Cronenberg/Mortensen Collaboration So Far.",
            "review_date": "2013-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a huge gangster fan, but I do have to admit, this was an interesting introduction to the genre.",
            "review_date": "2013-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed this movie to the Nth degree. It was amazing and involved one of my favorite kinds of people...Russians :).",
            "review_date": "2013-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than a History of Violence, still nothing surreal here, I guess mostly mainstream is all Cronenberg can do now to get films in theatres",
            "review_date": "2013-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "what a great cast for a great movie,with a surprising twist,Viggo Mortesen was excellent as a driver for the Russian mob,right down to his Russian accent.although the scene where they are fighting in the shower was a,bit tough to watch overall this movie was very good with a,storyline that kept you guessing.So for this being one of the good movies out there I give\"Eastern Promises\" a B-.",
            "review_date": "2013-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cronenberg has a style I can surely see others not appreciating, but I thought this movie was the shit.  His movies are short, simple, and to the point; Eastern Promises is no different.  Russian mafia story focused on the death of a pregnant fourteen year old girl.  It clocks in at a fast 1 hour 40 minutes and it sums up all you need to know with such a tight script.  Sure this ain't Goodfellas, it's not trying to be.  It's telling a small but DARK tale.  And if it's Cronenberg you know it's gonna have unbelievable shock value.  The steam bath scene, jesus.  Damn good film.",
            "review_date": "2013-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The instances of violence, while graphic, are never unjustified. This is a brutal movie- but it could not be done any other way.",
            "review_date": "2013-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An ingenious crime thriller detailing the workings of the Russian mob. . .in London of all places.  The brilliance of Cronenberg returns momentarilly.",
            "review_date": "2013-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good film, Viggo is awesome as good as a history of violence",
            "review_date": "2013-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ruthless, patient, realistic and brilliant.  A must-see.",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was good but the End was so Blah!! I was like what the Hell!! Vigo great acting!",
            "review_date": "2013-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "an interesting follow up to History of Violence. i enjoyed Viggo Mortensen in this, but i felt that he was underused in this. there was less mob activity and more of a soap opera \"Who is the father?!\" business. a little silly.\n\nbut the violence! holy cow the violence! very realistic, very scary, very AWESOME.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really solid follow-up to Cronenberg's master work, A History of Violence, but not as engaging. Viggo is the only star of this movie, though, stealing every scene he is in, and it has one of the most real looking fights in film (you'll know it when you see it). I say rent it, damn it!",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The problem with watching films high is a) I can't remember them and b) maybe they weren't as good as they seemed. But from what I remember this was great.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If we are talking about my favorite Cronenberg film, I would choose \"A History of Violence\" or \"The Fly\" over \"Eastern Promises\". I find those two emotionally engaging and infinitely rewatchable. However, if we are talking about the best Cronenberg film, I would gladly say it is \"Eastern Promises\". It's complex, intelligent, and a very compelling film about identity. This is Mortensen's best performance to date and Cronenberg's most complex film. I loved it.",
            "review_date": "2013-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "O.K! It disapointed me in comparison with A History Of Violence because you never really felt this film was heading towards any kind of climax-good acting, well made, with absolutly no wow factor at all",
            "review_date": "2013-01-20",
            "source": "rt",
            "lang": "en"
        }
    ]
}