{
    "rating": 2.9,
    "release_date": "2007-01-26",
    "num_reviews": 170,
    "genres": [
        "Comedy",
        "Adventure"
    ],
    "summary": "Four adult orphans (Kal Penn, Adam Campbell, Faune Chambers, Jayma Mays) have an incredible adventure in a spoof of blockbuster and fantasy films. They visit a bizarre confectioner's chocolate factory and enter a mythic realm in which they must help a wise but lusty lion rid the land of a witchy woman.",
    "reviews": [
        {
            "content": "I wish there was an option for zero.",
            "review_date": "2023-02-21",
            "source": "rt"
        },
        {
            "content": "an epic disaster of a film.",
            "review_date": "2022-12-14",
            "source": "rt"
        },
        {
            "content": "Amazing , inspiring, this is a must watch , do not listen to the other reviews , just listen to mine🙏🙏😭😭😭😭",
            "review_date": "2022-10-15",
            "source": "rt"
        },
        {
            "content": "Better Than Disaster Movie but that is not saying Much. The acting is horrible, no real chemistry, no effort put into line delivery just over the top delivery with stupid dialogue. The cinematography is bad with shots being centered on the actor and nothing going on around them, and everything else being out of frame and cheaply designed sets and costumes. It looks Bad to begin with despite the tons of different exotic locations. The editing is bad also with every new location feeling like there is no flow or consistency to them outside of terrible jokes. The pacing in this awful also because  there really isn't a consistent plot throughout this. Rather things just happen until we get to the second half when it becomes a Nardia parody. The jokes are incredibly bad full of pop culture reference humor popular in the mid 2000's, cheap over the top slapstick, gross out humor, and offensive shock humor at times that feels more offensive than funny. The Plot also is worth mentioning again is nonexistent until like the second half but you could take the first half out of this movie and nothing would be lost. One of the worst comedies ever made easily. Stay Far Away.",
            "review_date": "2022-10-07",
            "source": "rt"
        },
        {
            "content": "This movie is a fever dream saw it when I was little and thought it was some sort of crazy dream with a bunch of movies of the time but it turns out it's an actual film.\n\nAlso damn people really took this movie too seriously and went in with a snobby mind set to a movie that's not supposed to be grounded in reality and meant to be gross and over the top but seems people went in with the pinky too high or I'm just nostalgic about this movie for being a fever dream with a bunch of stuff I grew up with.",
            "review_date": "2022-09-10",
            "source": "rt"
        },
        {
            "content": "LOL, the funniest 01 hour: and 21 minutes ever!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-09-05",
            "source": "rt"
        },
        {
            "content": "This movie is actually super creative and entertaining.",
            "review_date": "2022-08-15",
            "source": "rt"
        },
        {
            "content": "You must have an intelligence way below normal to watch this and have fun, saying \"it's so bad it's good\" just confirms it. It's literally impossible go beyond first minutes; if you desperately fast forward, hoping it was just an unfortunate beginning, every time you land in another part of the \"\"\"movie\"\"\" you face total unfunny, imbecile, ignorant, unbelievably bad taste crap. It makes you want to endorse eugenics.",
            "review_date": "2022-07-03",
            "source": "rt"
        },
        {
            "content": "The first movie I've ever walked out of a theatre for\n\nCalling this trash would be an insult to trash truly the fact that this was made makes me lose hope for humanity... again the worst thing I've ever seen...",
            "review_date": "2022-06-14",
            "source": "rt"
        },
        {
            "content": "One of the most disturbing movies I've ever seen. You think Midsommar was disturbing? That movie does not even come close to Epic Movie. So much violence. It needs to be rated at least rated R. Don't watch this shitshow if you don't want nightmares. Go watch Scary Movie 1 - 6 instead, much funnier than this garbage. Infact, this movie is so much worse than Morbius.",
            "review_date": "2022-05-23",
            "source": "rt"
        },
        {
            "content": "A lot of punch and fart jokes, and I mean a lot. For me the best joke was when an action double was shown on purpose, apart from that all the gags were so lame. One of the worst parody movies although it has great celebrities on it.",
            "review_date": "2022-05-19",
            "source": "rt"
        },
        {
            "content": "As any spoof movie the point is to laugh at the good or bad skits, and it's hilarious for a day you just need to laugh. Or a good movie to drink to!",
            "review_date": "2022-05-10",
            "source": "rt"
        },
        {
            "content": "bom filme . apesar de as vezes se arrastar . diverte em alguns bons momentos .",
            "review_date": "2021-11-15",
            "source": "rt"
        },
        {
            "content": "Love it! 😂😂😂\nIt is so insanely ridiculous that is fun to watch it even if it's not that funny.\nI rewatch it once an year.",
            "review_date": "2021-04-19",
            "source": "rt"
        },
        {
            "content": "When the tagline for the film is \"We know it's big.  We measured.\", we know that we're in trouble.",
            "review_date": "2021-01-18",
            "source": "rt"
        },
        {
            "content": "A crude comedy with nothing new or insightful to say about the subjects it satirizes.",
            "review_date": "2020-12-17",
            "source": "rt"
        },
        {
            "content": "I thought it was good but stupid",
            "review_date": "2020-12-15",
            "source": "rt"
        },
        {
            "content": "The end credit music is the only good thing about this movie. Maybe i should've been drunk to enjoy it.",
            "review_date": "2020-12-13",
            "source": "rt"
        },
        {
            "content": "This ain't no \"Epic Movie;\" this is a harrowin' endurance test offering further proof that Jason Friedburg and Aaron Seltzer can't direct. One medallion: The Burnin' Medallion Of Badness. Characters: 1/5 Story: 1/5 Acting: 1/5 Special Effects: 1/5 Direction: 0/5 Cinematography: 0.5/5 Soundtrack: 1/5 Overall: 1/5",
            "review_date": "2020-12-10",
            "source": "rt"
        },
        {
            "content": "it's a bad parody that is not funny at all this film didn't have to exist",
            "review_date": "2020-10-12",
            "source": "rt"
        },
        {
            "content": "The critics were not joking about the humor in this film being pointless and terrible!!!",
            "review_date": "2020-08-24",
            "source": "rt"
        },
        {
            "content": "Another bland comedy directed by Aaron Seltzer and Jason Friedberg, which only uses pop culture references to be funny.",
            "review_date": "2020-08-18",
            "source": "rt"
        },
        {
            "content": "This movie was silly fun. Yes, it was filled with dumb jokes and silly comic violence, but the movie was loaded with hilarious pop culture and movie references. If you're going to watch this flick, just don't take it seriously and you''ll have fun and laugh.",
            "review_date": "2020-07-20",
            "source": "rt"
        },
        {
            "content": "In its attempt to satirize as many movies as possible, it terribly misses the mark, with humor and references that haven't aged well, a silly dialogue and a terribly generic narrative that doesn't add anything new to the genre.",
            "review_date": "2020-07-15",
            "source": "rt"
        },
        {
            "content": "This movie is so terrible it's so funny in an old saying about movies that are bad enough entertainment. It just rips off original true entertainment such as the Harry Potter Franchise,The chronicles of Nanaria The Witch The Lion and the Wardrobe and even Charlie and the Chocolate Factory.",
            "review_date": "2020-07-05",
            "source": "rt"
        },
        {
            "content": "This is easily the worst movie from the 2000s. Bad acting,unfunny jokes,poor humor and lack of memorable characters makes this movie a chore to finish. Go watch Superbad because it's better than this abomination.",
            "review_date": "2020-06-27",
            "source": "rt"
        },
        {
            "content": "Yes this is dated and has alot of bad moments with comedy, but this is watchable compared to the worst one, the disaster movie, if you see through all the flaws it will pass the time and give you a few laughs",
            "review_date": "2020-03-19",
            "source": "rt"
        },
        {
            "content": "I feel like only the first 20 minutes of this movie was worth watching after that the rest of the film just goes down hill and gets worse as it progresses.",
            "review_date": "2020-02-21",
            "source": "rt"
        },
        {
            "content": "some movies are so bad they are good/ entertaining. This is just bad.",
            "review_date": "2020-02-13",
            "source": "rt"
        },
        {
            "content": "This is the worst movie ever. ",
            "review_date": "2019-08-16",
            "source": "rt"
        },
        {
            "content": "An movie that’s so bad, it’s ironically enjoyable. Just turn your brain off, get high/drunk and you’ll have a good time.",
            "review_date": "2019-08-09",
            "source": "rt"
        },
        {
            "content": "It's way worse than Disaster Movie!",
            "review_date": "2019-07-06",
            "source": "rt"
        },
        {
            "content": "Like the black death avoid this film at all costs",
            "review_date": "2019-06-26",
            "source": "rt"
        },
        {
            "content": "A brilliant satirical comedy, filled with hilarious moments and insightful social commentaries. All of the reasons listed above, plus an all star cast and highly original script makes this film truly one transcending cinema going experience.",
            "review_date": "2019-04-30",
            "source": "rt"
        },
        {
            "content": "it's ok but i suggeist scary movie 1 to 3",
            "review_date": "2019-04-28",
            "source": "rt"
        },
        {
            "content": "There's no way to soften the truth: Epic Movie is a waste of time. It's like a bad issue of Cracked Magazine come to life. It's not so much painful as it is sleep inducing. Bad imitations of beloved movie characters can be funny but not the way they are presented here. The movie is so poorly assembled that it feels like a direct-to-DVD product that ended up with a theatrical release because the January schedule is so threadbare. Even if you love every movie that Epic Movie references, this film will not please, divert, or amuse you. Bad taste and worse jokes abound. Epic Movie's humor isn't tired; it's comatose. After a while, the effect of so much failed humor is numbing.",
            "review_date": "2019-01-13",
            "source": "rt"
        },
        {
            "content": "Dictionary definition of aggravating, unfunny, and annoying.",
            "review_date": "2018-11-06",
            "source": "rt"
        },
        {
            "content": "Epic B.S. Excels in all forms of mediocrity",
            "review_date": "2018-11-04",
            "source": "rt"
        },
        {
            "content": "If u want to waste 1 hour and 21 minuets of your life be my guest but any one that gave this movie more then 1 star is either 5 years old or has been out in the sun to long ",
            "review_date": "2018-06-05",
            "source": "rt"
        },
        {
            "content": "Very low budget, but I would watch it again ",
            "review_date": "2018-05-30",
            "source": "rt"
        },
        {
            "content": "\"EPIC MOVIE\" made me physically ill with how terrible it was",
            "review_date": "2018-02-12",
            "source": "rt"
        },
        {
            "content": "Worst movie of all time",
            "review_date": "2017-12-31",
            "source": "rt"
        },
        {
            "content": "This is one of the worst comedies I have ever seen and rather than being so bad it's good, it's just plain bad. None of the jokes work, the movies that are being spoofed aren't even actual epic films and it doesn't have any plot. While the Scary Movie...movies had parody stories, they still benefited from its charming cast and still had a tinge of originality to them. In Epic Movie, however, the infamous Friedberg-Seltzer duo I've been hearing so much about seem less interested in making a consistent movie and instead inserting as many pop culture references as possible. The editing is terrible with characters that come out of nowhere and various nonsensical things, an obvious stunt double in one scene and cliched and predictable jokes (example: NACHOOOOOOOO...cheese-flavoured Doritos are delicious. Hardy-har, how much did they pay the Jack Black lookalike for that product placement?). The actors are incredibly cringy especially Jayma Mays as the stupid one out of the four. In fact, I think Friedberg and Seltzer just cast Kal Penn and Jennifer Coolidge for a White Castle joke and a reference to American Pie. If you saw X-Men and Click, you'd know that two \"jokes\" involving these movies, were already done in the actual movies. And, it gets worse, even when the credits start rolling, they keep you trapped with a mid-credits scene that has V from V for Vendetta for some reason, then there's a parody of the Willy Wonka song from Charlie and the Chocolate Factory, then there's a joke involving Mel Gibson in prison. Epic Movie is an epic fail and I strongly advise you stay away from it at all costs. Even Dumb and Dumberer had better jokes than this pile of crap. Didn't get a single laugh out of me.",
            "review_date": "2017-11-05",
            "source": "rt"
        },
        {
            "content": "A terrible abomination of my wasted cinema experience. All I can is that EPIC MOVIE does NOT deserve to earn the title \"EPIC MOVIE\".",
            "review_date": "2017-09-17",
            "source": "rt"
        },
        {
            "content": "Terrible movie that I saw when I was younger, I regret seeing this terrible tragedy.",
            "review_date": "2017-09-16",
            "source": "rt"
        },
        {
            "content": "A deeply grotty and unpleasant experience . Avoid at all costs.",
            "review_date": "2017-08-23",
            "source": "rt"
        },
        {
            "content": "This movie is pretty stupid.",
            "review_date": "2017-06-09",
            "source": "rt"
        },
        {
            "content": "This is movie is the personification of being dumb is not automatically funny.",
            "review_date": "2017-03-14",
            "source": "rt"
        },
        {
            "content": "average with some good laughs",
            "review_date": "2017-02-16",
            "source": "rt"
        },
        {
            "content": "i remember wanting to see this as a kid but even then i thought it sucked",
            "review_date": "2016-11-21",
            "source": "rt"
        },
        {
            "content": "Funny but very dumb. A good time if you just want some raunchy humor. Other than that, very bad in almost every aspect.",
            "review_date": "2016-11-06",
            "source": "rt"
        },
        {
            "content": "It not funny just very weird...",
            "review_date": "2016-10-10",
            "source": "rt"
        },
        {
            "content": "Unfunny and painfully not clever",
            "review_date": "2016-10-01",
            "source": "rt"
        },
        {
            "content": "Epic Movie is yet another shot at the \"parody\" genre, this time taking a hit at some of the biggest movies ever made in film history. This film could have been great. This film could have been  enjoyable and clever and pretty good. But Jesus CHRIST this film went way too far. Right when the opening sequence for this film was over I absolutely knew what this was going to be: A uncomfortable experience filled with awkward long lasting sequences ruined by completely unfunny pop culture references. And that's really what this entire film was. They went really far with the pop culture references this time and I mean almost every miniute a unfunny pop culture reference was just thrown out to take up running time. Slightly better than \"Date Movie\", this film was dissapointing because it could have been really smart and well made, but it turned out to be a horrible experience, especially since some well respected actors were in this film and these people have shown before that they can be funny and talented. But no, this film is a low budget unfunny piece of crap, don't waste your time.",
            "review_date": "2016-08-08",
            "source": "rt"
        },
        {
            "content": "Epic Movie is a film with gloriously unfunny, horrid acting, destructive writing, cheap production values and dreadful directing. A total dud on almost 65 levels... AVOID AVOID AVOID",
            "review_date": "2016-05-30",
            "source": "rt"
        },
        {
            "content": "One of the worst movies i've ever seen in my life. Not an over exaggeration.",
            "review_date": "2016-04-29",
            "source": "rt"
        },
        {
            "content": "The pinnacle of film making! 11/10",
            "review_date": "2016-04-18",
            "source": "rt"
        },
        {
            "content": "As a nine year old finding this on demand during a sick day, I was enthralled by  the idea of viewing such an adult movie. I don't know what I expected that to be, but it didn't deliver. I was able to see through the veil of cheap parody into the core of lazy humor sitting clumsily on the card house structure of a plot. It horrified me as a child, it haunted my dreams. Unintentionally scarring a child is about the worst thing a movie could do, in addition to being a bad movie, which it always does.",
            "review_date": "2016-02-16",
            "source": "rt"
        },
        {
            "content": "rip roscoe lee browne",
            "review_date": "2015-12-01",
            "source": "rt"
        },
        {
            "content": "We dislike that movie so much that even Willy himself tries to turn our 4 stars into organs.",
            "review_date": "2015-11-13",
            "source": "rt"
        },
        {
            "content": "Oh My God! Fuck This Fucking Movie!\nI heard a lot of bad stuff about it,\nThey made Fake people who are all stupid\nAnd making a bad movie is a lot easier than making a good one,\nThis is the easiest movie to make because it's so bad!\nB A A A A A A A A A A A A A D! BAD!\n\nScore: 0/10",
            "review_date": "2015-11-06",
            "source": "rt"
        },
        {
            "content": "Overall, this movie has terrible special effects, bad acting, unfunny jokes, and is just plain stupid. It's not that epic...",
            "review_date": "2015-09-26",
            "source": "rt"
        },
        {
            "content": "I laughed 3 times or 2 when I saw it!",
            "review_date": "2015-09-02",
            "source": "rt"
        },
        {
            "content": "One of the STUPIDEST movies I've ever seen!",
            "review_date": "2015-08-17",
            "source": "rt"
        },
        {
            "content": "This movie is so bad that. \nI will watch again.",
            "review_date": "2015-08-15",
            "source": "rt"
        },
        {
            "content": "Horrible y sin gracia, es un buen ejemplo de este tipo de películas esta enterrada en el fondo de lo peor del cine.",
            "review_date": "2015-08-09",
            "source": "rt"
        },
        {
            "content": "Had some good shit and some bad shit , not the best parody ever . SOMDVD",
            "review_date": "2015-07-31",
            "source": "rt"
        },
        {
            "content": "I mean, it's bad. Ok?",
            "review_date": "2015-07-19",
            "source": "rt"
        },
        {
            "content": "There is nothing epic about this movie.",
            "review_date": "2015-05-20",
            "source": "rt"
        },
        {
            "content": "Horrible...these writers need to get a life!!!",
            "review_date": "2015-05-14",
            "source": "rt"
        },
        {
            "content": "It's sad that the best this poorly conceived, one trick \"satire\" can do to mock other BETTER movies is to conjure up unoriginal bawdy humor. The reason that movies like \"Naked Gun\" and \"Airplane\" were hilarious and still hold up to this day is, because Leslie Nielson was a total comedic genius, and he could sell all of the wackiness. Seltzer and Friedberg are really bad about latching onto premises that have promise, and then picking the most one-dimensional, unfunny cast possible. This breed of satire isn't funny anymore, because we've seen it a million times before. Look at movies like \"Kingsman\" or \"Cabin In The Woods\" or \"You're Next,\" for instance. Those are great movies that entertain on the same level as the movies they're poking fun at, and they don't sacrifice the satire and comedic possibilities. This breed of sophomoric poop and fart humor just is NOT funny.",
            "review_date": "2015-04-27",
            "source": "rt"
        },
        {
            "content": "Awful piece of shit!..",
            "review_date": "2015-04-20",
            "source": "rt"
        },
        {
            "content": "it lacks everything, and it shouldn't exist",
            "review_date": "2015-03-05",
            "source": "rt"
        },
        {
            "content": "I'd prefer to spend 1hr. 24min. of my life cleaning the gaps between a pubic bathroom's tiles rather than watching a movie like this.",
            "review_date": "2015-02-23",
            "source": "rt"
        },
        {
            "content": "From the writers / creators of Scary Movie. I guess I just expected more. This was satire, but done so affectionately that it was lame, not funny, and uninspired. Never waste your time.",
            "review_date": "2015-01-17",
            "source": "rt"
        },
        {
            "content": "although everything is cheesy and usually stupid, it's still actually kind of funny. It's like meet the spartans, but with a whole lot more references.",
            "review_date": "2015-01-14",
            "source": "rt"
        },
        {
            "content": "I don't care what people think, this film was amazing and fucked up but in a good sense.",
            "review_date": "2014-11-30",
            "source": "rt"
        },
        {
            "content": "A few (slight) laughs, but the rest is awkward, tacky, and very stupid. Epic Movie doesn't understand that to make a spoof, you've got to play it strait, no matter who stupid the situation is. What a mess. 17/100",
            "review_date": "2014-11-13",
            "source": "rt"
        },
        {
            "content": "Some funny parts in this, but it's so pointless and dumb. It's not as bad as everyone is making it out to be. If you don't like spoofs then you won't like this. It's not for everyone but it was entertaining but so, so dumb",
            "review_date": "2014-10-03",
            "source": "rt"
        },
        {
            "content": "Ok, guys. To make a GOOD comedy, we need originality and good jokes. \nThese guys limit themselves to throw dirty unfunny jokes to the screen.",
            "review_date": "2014-09-10",
            "source": "rt"
        },
        {
            "content": "EPIC MOVIE?!?! More like EPIC FAIL!",
            "review_date": "2014-07-29",
            "source": "rt"
        },
        {
            "content": "don't treat this like a movie, but rather like a show on tv and its the funniest thing ever",
            "review_date": "2014-07-18",
            "source": "rt"
        },
        {
            "content": "STUPID STUPID STUPID",
            "review_date": "2014-07-15",
            "source": "rt"
        },
        {
            "content": "Horrible. No comment.",
            "review_date": "2014-07-03",
            "source": "rt"
        },
        {
            "content": "EPIC MOVIE?!?! More like EPIC FAIL!",
            "review_date": "2014-06-30",
            "source": "rt"
        },
        {
            "content": "Why do people watch this?",
            "review_date": "2014-06-05",
            "source": "rt"
        },
        {
            "content": "It was funny, but only an ok movie.",
            "review_date": "2014-05-22",
            "source": "rt"
        },
        {
            "content": "it's so terribly bad that it's actually good",
            "review_date": "2014-05-22",
            "source": "rt"
        },
        {
            "content": "After repeated viewings I have found out that this film is just not very good or funny = 3/10",
            "review_date": "2014-04-30",
            "source": "rt"
        },
        {
            "content": "I saw this movie for free and still felt ripped off.",
            "review_date": "2014-04-15",
            "source": "rt"
        },
        {
            "content": "Le deberían cambiar el nombre a Epic FAIL !",
            "review_date": "2014-04-13",
            "source": "rt"
        },
        {
            "content": "I share the same rating with Date Movie it because Crispin Glover saves the day. There is just something about him that makes me laugh just at the sight of him. While this is weaker than Date, it is about the same level of gross humor that is written for high school guys that quote this for a about month and than forget about it. \nAgain, the same directors, same style of comedy and still nothing to ride home about. Some good actors that make the so called jokes and gags bearable but not enough to save the movie from the hell that is run by Jason and Aaron.",
            "review_date": "2014-04-11",
            "source": "rt"
        },
        {
            "content": "Good time no alcohol required",
            "review_date": "2014-03-07",
            "source": "rt"
        },
        {
            "content": "I'm actually surprised this movie got 2% positive reviews, surely 1% would be more accurate.",
            "review_date": "2014-03-02",
            "source": "rt"
        },
        {
            "content": "Awful movie, one of the worst spoof movies out there.",
            "review_date": "2014-01-21",
            "source": "rt"
        },
        {
            "content": "This is probably one of the worst movies I have ever seen. First and perhaps it's biggest issue is that it is not funny. All they do, is try to make fun of other movies  using modernism. Modernism is only a little funny in a medieval fantasy setting generally, but should not be the main humor. Terrible character development. I didn't care about any of the characters.",
            "review_date": "2014-01-17",
            "source": "rt"
        },
        {
            "content": "It's worse than date movie. Does any more need to be said?\r\n\r\n1.4/5",
            "review_date": "2014-01-11",
            "source": "rt"
        },
        {
            "content": "this movie wasn't for me.",
            "review_date": "2014-01-06",
            "source": "rt"
        },
        {
            "content": "horrific. walk away.",
            "review_date": "2013-12-26",
            "source": "rt"
        },
        {
            "content": "This creepy hellhole of comedies this is every comedys low accept jack and jill which is the creepy, awkward and pointlessly dullest comedy ever made but this is the secound pill of garbage",
            "review_date": "2013-12-08",
            "source": "rt"
        },
        {
            "content": "It's quite painful to watch.",
            "review_date": "2013-10-12",
            "source": "rt"
        },
        {
            "content": "some laughs for the most part just average though",
            "review_date": "2013-10-11",
            "source": "rt"
        },
        {
            "content": "A movie that sucks out comedy and infuriated me the entire time I was watching it",
            "review_date": "2013-10-09",
            "source": "rt"
        },
        {
            "content": "The creators of this film have come up with a new rule in comedy filmmaking, \"the stupider, faker, and more disgusting it is, the funnier it is.\"",
            "review_date": "2013-10-06",
            "source": "rt"
        },
        {
            "content": "Sorry in advance about this but to be honest, watching \"Epic Movie\" is the equivalent of being set on fire in a room full of buckets of diarrhea. Out of the sheer power of the human instinct of survival you'll make it out alive, but afterwards you'll feel dirty, disgusting, smoldering and partially wishing you had simply dropped dead instead. Here is the closest this movie comes to a plot: Lucy (Jayma Mays) finds her adopted father semi-naked on the floor in a way similar to \"The Da Vinci Code\". He is dying after being attacked by Silas (Kevin Hart) an albino white man that whips himself. After doing a break dance in which he spells out a clue for her, she finds a Golden Ticket (similar to the one from \"Charlie and the Chocolate Factory\"). The movie switches to Edward (Kal Penn) an orphan living in a Mexican monastery. A parody of \"Nacho Libre\" gets upset when he doesn't appreciate the food and throws his out of a window. On his way out, he finds a Golden Ticket (but not before Nacho shows off some tasty Doritos, available now at the concession stand!) Next we have Susan (Faune Chambers) who is on a plane when all of a sudden snakes pop out! Cue the Samuel L. Jackson impersonator. Susan is thrown out of the plane, lands on Paris Hilton and finds a Golden Ticket inside the dead celebrity's purse. Finally we have Peter. He's a highschooler and a mutant who is bullied because his mutant power sucks (as the movie spells it out for its audience, he has chicken wings instead of angel wings). He finds a Golden Ticket too and joins the other orphans at Willy Wonka's Chocolate Factory. Willy (Crispin Glover) reveals to them that the special ingredients in the chocolate are human body parts. Cue the nut jokes. The children run away inside a magical wardrobe, which brings them to Gnarnia in a spoof of \"The Lion, the Witch and the Wardrobe\". Lucy befriends Mr. Tumnus (Hector Jimenez) while Edward is seduced by the White Bitch (Jennifer Coolidge). The children discover that they are actually all brothers and sisters (whatever) and ally themselves against the White Bitch. Edward is captured while the rest of the group enter a training montage at Hogwarts. Peter, Lucy and Susan meet a parody of Aslan named Aslo (played by Fred Willard) in the hopes that together they can formulate a plan to save their brother, and the kingdom of Gnarnia.\n\nThere's no reason for anyone, ever to watch this colossal piece of crap. For my own personal reasons I had to, just so I could vow never to watch it again and to write this review but really, why would you even be tempted by this? I watched the unrated version, which at least had the \"Snakes on a Plane\" spoof done correctly, with the actual wording accurate but how bad does it show that in the theatrical version of the movie, Samuel L. Jackson says \"goddamn\" instead of \"motherfucking\"? I counted 9 testicles jokes, 5 piss jokes and 9 other jokes that related to body hair, farts, poop or similar material. When it comes to the spoof segment of the film, several of the jokes don't even make any sense. There's an extended joke where the film makes fun of the actors in the Harry Potter franchise. The joke is that in this film's version of Hogwarts the actors are much older than they should be. Maybe the directors didn't realize that not only are the actors playing Susan, Lucy, Peter and Edward adults themselves (So way off the characters they are spoofing) but the actors in the Harry Potter films were always the same age as their characters (plus maybe a year or two?) so it's just an excuse to have a bunch of ugly people dress up in funny costumes. To the film's credit, that could have actually been a joke. Sometimes it misfires so bad that some of the \"funny\" moments aren't even jokes or references. When you insert a character named Borat into your movie, you make him look like Sasha Baron Cohen and you give him lines like \"This is my sister, she is number one prostitute in Gnargnia\" that isn't a reference, that's just plagiarism. While we're at it, how do you make fun of a movie like \"Snakes on a Plane\" which not only ran its own joke into the ground before the movie was released in theatres but was a parody in itself? I get a head ache just reading my notes about the movie.\n\nEverything could be forgiven if this film was actually humorous but it isn't. There are two jokes in the whole hour and thirty-two minute running time that might actually make you smile. One is a reference to White Castle. Kal Penn was in \"Harold and Kumar Go to White Castle\", so that's an actual joke. I didn't laugh, but I recognize the effort. They later run that one into the ground, but I'll give them that. The other running joke, which is the poor production and special effects, does work. They make absolutely no attempt to make the stunt doubles look like the actual actors, the special effects are terrible and even the sets look cheap. It's probably a way to mask the fact that making an actual spoof of an epic would cost hundreds of thousands of dollars but I did laugh at the cheap, fake-looking dead cat and the obvious beaver puppet. Were my standards just falling so low that out of desperation my mind latched onto these moments? Who knows.\n\nThe movie was pretty much doomed from the start because the two directors/writers Jason Friedberg and Aaron Seltzer are two mentally deranged idiots that can't make a good comedy to save their own lives. The blame does not rest solely on their shoulders though. Who green-lit a project named \"Epic Movie\" that contains spoofs of Shrek, Mel Gibson, Ghost Busters, Click, Tivo, Bobby Beats Whitey, Punk'd, Brittney Spears, Star Wars, 50 Cent, \"Get Crunk\", Rick James, Rocky, Batman, MTV Cribs, Laguna Beach, Dr. Phil, Casino Royale, Talladega Nights, Brad & Angelina, Fast and the Furious: Tokyo Drift, Siegfried & Roy and insurance commercials? There's maybe one or two of those that could be considered grand, action packed films that could be considered epic in the sense that they blow you away and have to be seen on the big screen to be appreciated but for the most part, what do any of those have to do with Epic Movies? While we're at it, who actually remembers half of those references now that it's been 6 years since the movie has been released?\n\nYou've heard enough. Just from the Dvd cover or any trailer you can tell this limp comedy is about as unfunny as finding your pet stuffed inside a blender. Even the ending of the film is incredibly lazily put together thanks a Deus ex Machina that's allows our \"heroes\" to win. As far as I'm concerned, if you like this or even think it \"isn't that bad\", if you complain that I \"spoiled too much\" or you are willing to give this movie a chance despite all of the negative press it's been given you need to really re-evaluate your taste in everything and I really hope you grow out of it because otherwise we can't be friends anymore. Any movie that references \"Scar Face\" by playing \"Say Hello to my Little Friend\" over and over almost automatically gets the lowest score imaginable and boy, this one deserves every insult it's got coming. (Unrated version on Dvd, September 14, 2013)",
            "review_date": "2013-10-03",
            "source": "rt"
        },
        {
            "content": "Epic Movie is from the two people who did Scary Movie and Disaster Movie so you know what to expect, parody's on blockbusting movies with crude jokes mixed in. I did get a few laughs though but it's not that much fun.",
            "review_date": "2013-09-15",
            "source": "rt"
        },
        {
            "content": "soooo funny i wet myslef very good rofl",
            "review_date": "2013-09-13",
            "source": "rt"
        },
        {
            "content": "So bad. Just so bad. What were they thinking making a movie as bad as this? I literally cried because it was so bad. I wish I could erase this from my memory.",
            "review_date": "2013-09-09",
            "source": "rt"
        },
        {
            "content": "Lol funniest movie ever",
            "review_date": "2013-08-19",
            "source": "rt"
        },
        {
            "content": "Awful But Sadly This Is Not The Worst Friedberg/Seltzer Movie.",
            "review_date": "2013-08-12",
            "source": "rt"
        },
        {
            "content": "Just like every movie put out by \"2 of the 6 writers of Scary Movie,\" the gags throughout are extremely hit or miss, with hit being the more infrequent outcome.",
            "review_date": "2013-08-12",
            "source": "rt"
        },
        {
            "content": "Made in a style, similar to Date Movie. Epic Movie was the start of some randomness, but at least it doesn't get in the way throughout.",
            "review_date": "2013-08-06",
            "source": "rt"
        },
        {
            "content": "The worst spoof/parody movie I've seen.",
            "review_date": "2013-08-04",
            "source": "rt"
        },
        {
            "content": "I know it's terrible but its such a guilty pleasure",
            "review_date": "2013-08-04",
            "source": "rt"
        },
        {
            "content": "One of the rare movies I turned off before finishing.",
            "review_date": "2013-08-03",
            "source": "rt"
        },
        {
            "content": "The formula of copying the plot of one movie has really gotten old, and Epic Movie just turns out as stupid, unfunny, lazy, and insulting to comedy.",
            "review_date": "2013-07-27",
            "source": "rt"
        },
        {
            "content": "Love this its funny to",
            "review_date": "2013-07-22",
            "source": "rt"
        },
        {
            "content": "Home Alone 4 was better than this. Dear God did I really just say that?!",
            "review_date": "2013-07-22",
            "source": "rt"
        },
        {
            "content": "Dis nigga movie was da shit yo, why dez fun a$$ niggaz given dis ill movie a bad review?",
            "review_date": "2013-07-12",
            "source": "rt"
        },
        {
            "content": "Hilarious! Captain jack is hilarious! The best scenes are with him! Give it a try if you like these kind of movies!",
            "review_date": "2013-07-10",
            "source": "rt"
        },
        {
            "content": "do not for gods sake, watch this movie!!!!!",
            "review_date": "2013-07-09",
            "source": "rt"
        },
        {
            "content": "Epic Movie lives up to its name: It is an epic disaster of hollywood filmmaking. Unfunny, pointless, and insulting to the human mind, Epic movie should be avoided at all cost by everyone.",
            "review_date": "2013-07-07",
            "source": "rt"
        },
        {
            "content": "Few good jokes, wouldn't watch again though",
            "review_date": "2013-07-01",
            "source": "rt"
        },
        {
            "content": "This movie was so hilarious, but not as good as 21 Jump Street.",
            "review_date": "2013-06-25",
            "source": "rt"
        },
        {
            "content": "i laughed(chuckled) at i think 2 seconds of the movie. Other than that, very glad these guys are done doing this and should of been fired from the film industry before they began, but oh well. 40 million dollars this shit made.  The people who actually gave this film money are people i never want to associate with.",
            "review_date": "2013-06-19",
            "source": "rt"
        },
        {
            "content": "Funny but not funny enough",
            "review_date": "2013-06-03",
            "source": "rt"
        },
        {
            "content": "Possibly the worst movie of all time. Waste of my time",
            "review_date": "2013-05-31",
            "source": "rt"
        },
        {
            "content": "so funny a must see movie",
            "review_date": "2013-05-31",
            "source": "rt"
        },
        {
            "content": "funny, but completly pointless",
            "review_date": "2013-05-29",
            "source": "rt"
        },
        {
            "content": "Not impressed. Will not see it again.",
            "review_date": "2013-05-26",
            "source": "rt"
        },
        {
            "content": "Not funny, unless you are a fifth grader...",
            "review_date": "2013-05-16",
            "source": "rt"
        },
        {
            "content": "If I could give negative ratings, I would. This was an epic...waste of time.",
            "review_date": "2013-05-15",
            "source": "rt"
        },
        {
            "content": "Pretty much the biggest waste of time ever.  Nothing pisses me off more than when movies are made simply to get your money and leave you with this empty feeling that you just wasted an hour and a half of your life.",
            "review_date": "2013-05-14",
            "source": "rt"
        },
        {
            "content": "funny but  it could way better",
            "review_date": "2013-05-08",
            "source": "rt"
        },
        {
            "content": "Only parts of it is funny the rest is too stupid.",
            "review_date": "2013-05-05",
            "source": "rt"
        },
        {
            "content": "what a load of cheap rubbish!",
            "review_date": "2013-05-04",
            "source": "rt"
        },
        {
            "content": "really rather corny, but then again, I tend to like that. so whatever.",
            "review_date": "2013-05-03",
            "source": "rt"
        },
        {
            "content": "Rather shitty movie...glad I got it as a FREE rental",
            "review_date": "2013-04-24",
            "source": "rt"
        },
        {
            "content": "Honestly, didnt hate this",
            "review_date": "2013-04-16",
            "source": "rt"
        },
        {
            "content": "after reading bad reviews of this film on the web and in the newspaper I couldn't really decide whether to go and see it. In the end I went and saw it with some friends and found it hilarious. I am definately going to buy this film on dvd and you should to.\r\nDon't believe everything you read in the press!",
            "review_date": "2013-04-15",
            "source": "rt"
        },
        {
            "content": "Yes, it might be a spoof movie and all, but Epic Movie still isn't comedic in any way.",
            "review_date": "2013-04-14",
            "source": "rt"
        },
        {
            "content": "A Non-Memorable Movie,That Is In No Place Clever Or Funny",
            "review_date": "2013-04-13",
            "source": "rt"
        },
        {
            "content": "if i had a choice between this and Movie 43... i'd kill myself.",
            "review_date": "2013-04-13",
            "source": "rt"
        },
        {
            "content": "Don't waste your time, this movie was far worse than anything from the scary movie series.",
            "review_date": "2013-04-12",
            "source": "rt"
        },
        {
            "content": "wow this movie sucked\r\nnot funny",
            "review_date": "2013-04-11",
            "source": "rt"
        },
        {
            "content": "Not even worth the half star! Thats out of sympathy! The worst film I have seen in years ruined my Saturday nite! Badly written, terribly acted, and bollocks jokes repeated just for the sake of it! Oh a talking beaver....har har! And what is with all the characters rapping? What the FECK!!! Avoid at all costs!",
            "review_date": "2013-04-11",
            "source": "rt"
        },
        {
            "content": "A Superb Epic-Fail Movie!",
            "review_date": "2013-04-09",
            "source": "rt"
        },
        {
            "content": "\"Epic Fail\" would've been a more appropriate title for this ungodly abomination trying to pass itself as a satirical comedy film, or any kind of film for that matter.",
            "review_date": "2013-04-07",
            "source": "rt"
        },
        {
            "content": "had funny parts, but not enough to get praise",
            "review_date": "2013-03-31",
            "source": "rt"
        },
        {
            "content": "Another shit-comedy from the shit-filmmakers Friedberg and Seltzer.",
            "review_date": "2013-03-31",
            "source": "rt"
        },
        {
            "content": "Possibly the worst movie ever. But hilarious! That may not make sense. Take your chances watch this waste of time",
            "review_date": "2013-03-31",
            "source": "rt"
        },
        {
            "content": "OH MY GOD THIS TRULY IS AWFUL!!!!!!!!!!!!!!!!!!! WHO APPROVED THIS CRAP!!!!!!!!!!!!!!!!!",
            "review_date": "2013-03-30",
            "source": "rt"
        },
        {
            "content": "I freaking love this movie!!!!  (:",
            "review_date": "2013-03-30",
            "source": "rt"
        },
        {
            "content": "This is the greatest movie ever made any one who hasnt seen it has my recomendation to get it and watch it",
            "review_date": "2013-03-29",
            "source": "rt"
        },
        {
            "content": "worst movie I have ever seen",
            "review_date": "2013-03-26",
            "source": "rt"
        },
        {
            "content": "As a piece of entertainment this is fine, but as a movie...........not so much.",
            "review_date": "2013-03-23",
            "source": "rt"
        },
        {
            "content": "Is this shit meant to be funny?",
            "review_date": "2013-03-23",
            "source": "rt"
        },
        {
            "content": "I remember the first and only time I watched this and that was when I was a freshman in high school. I went to see it with a good friend of mine and his friends. I guarantee that we were all laughing our butts off at this. I had never seen anything funnier in my life. I don't know how the movie holds up now that I'm older and honestly I don't wanna know, I just wanna remember it how it was when I did like it. It was freaking hilarious.",
            "review_date": "2013-03-21",
            "source": "rt"
        },
        {
            "content": "i really want to see this",
            "review_date": "2013-03-19",
            "source": "rt"
        },
        {
            "content": "Terrible!!!!!!! An unfunny wanna-be comedy/satire that's not funny nor intelligent. Those are 2 hours of my life I will never recover!",
            "review_date": "2013-03-19",
            "source": "rt"
        },
        {
            "content": "One vulgar spoof after another, Jason Friedberg and Aaron Seltzer keep failing to say anything original or clever about their targets. They don't even try.",
            "review_date": "2013-03-17",
            "source": "rt"
        },
        {
            "content": "I SWEAR I've reviewed this, rated this, discussed my dislike for this, expressed my contempt for it and other such crap before? NO? ARE YOU KIDDING ME? How many  ____ Movies are there? Just NO with the tiring spoofs. Crispin Glover, why not just make a WHOLE picture about a pedophile Willy Wonka and be over with it, i'd rather watch that.",
            "review_date": "2013-03-16",
            "source": "rt"
        },
        {
            "content": "The only way you can get some enjoyment out of this movie is if you use an electric drill on your skull and cause sufficient brain damage to drop your IQ to \"retard\" level",
            "review_date": "2013-03-09",
            "source": "rt"
        },
        {
            "content": "AWFUL.  Why did I sit through this nonsense?",
            "review_date": "2013-03-08",
            "source": "rt"
        },
        {
            "content": "It was a good movie!  They should of used more movies in it though.",
            "review_date": "2013-03-04",
            "source": "rt"
        },
        {
            "content": "I usually love parodies but this just isn't funny. I gave up after 30 minutes.",
            "review_date": "2013-03-02",
            "source": "rt"
        },
        {
            "content": "Tässä elokuvassa Jack Sparrow räppää, Aslan-leijona on pervo leijonapuvussa ja koko sankarien joukko jättää tulematta lopputaistoon koska heillä on krapula edellisillan bileistä. Lopulta kaikki ratkeaa, kun paikalta löytyy kaukosäädin (joka on lainattu Adam Sandler-komediasta, jota kukaan ei enää muista) ja sankarit saavat vanheta ja kusta lumihankeen rauhassa.\n\nJoskus juoniselostus on paras tapa havainnollistaa elokuvan tasoa. Tämä leffa oli jäätävintä paskaa mitä olen ikinä katsonut.",
            "review_date": "2013-03-01",
            "source": "rt"
        },
        {
            "content": "Where epic movie falls short is where it tries to hard to be funny when Kal was the only remotely funny one.",
            "review_date": "2013-02-21",
            "source": "rt"
        },
        {
            "content": "it has about 2 or 3 funny bits, but doesn't come close to the comedy and intelligence behind Scary Movie 1 and 2. This series of films has gone downhill since the Wayan Brothers quit the series.",
            "review_date": "2013-02-20",
            "source": "rt"
        },
        {
            "content": "Captian Jack Swallow and the witch Bitch made me laugh...and the pimp ny house thingee!!! awesome!!!",
            "review_date": "2013-02-20",
            "source": "rt"
        }
    ]
}