{
    "rating": 8.6,
    "release_date": "2007-10-19",
    "num_reviews": 450,
    "genres": [
        "Mystery&thriller",
        "Crime",
        "Drama"
    ],
    "summary": "Along with his girlfriend (Michelle Monaghan), a private detective (Casey Affleck) takes on the difficult task of searching for a kidnapped girl in Boston. During his investigation, he must deal with the girl's aunt, a disapproving lawman (Morgan Freeman) and a drug dealer.",
    "reviews": [
        {
            "content": "The haunting and thought-provoking movie Gone Baby Gone presents a thorough investigation of morality, justice, and the human psyche. For fans of criminal thrillers who appreciate an engaging plot and top-notch acting, it is a must-watch.",
            "review_date": "2023-04-20",
            "source": "rt"
        },
        {
            "content": "Great suspense throughout the film and very dramatic ending",
            "review_date": "2023-02-20",
            "source": "rt"
        },
        {
            "content": "The final dilemma was fascinating, but how we got there required a significant suspension of logic. There are many great aspects to this film, it is a worthy effort, but ultimately the lack of relationship/connection between characters, and also the lack of motivation behind many of their actions, left me unsatisfied with the overall film.",
            "review_date": "2023-02-08",
            "source": "rt"
        },
        {
            "content": "Very good movie plot twists all the way through sometimes it was hard to keep up with the scenes overall 8/10",
            "review_date": "2023-02-06",
            "source": "rt"
        },
        {
            "content": "Heart-pounding twisting movie that will keep you on edge. Lots of twists with great writing and acting. I highly recommend!",
            "review_date": "2023-01-29",
            "source": "rt"
        },
        {
            "content": "The movie is all over the place with scenes going one to another without explanation, bad performances from Cassey Affleck and Ed Harris. Too much happening in a short timeframe, no depth at all, feels like a disorganized movie overall. Came in with high expectations, left with disappointment.",
            "review_date": "2023-01-15",
            "source": "rt"
        },
        {
            "content": "Everything that we need to make an excellent suspens movie.",
            "review_date": "2022-12-27",
            "source": "rt"
        },
        {
            "content": "This movie, doesn't get the respect it deserves. Ben Affleck is great at what he does, making stories come alive on the screen",
            "review_date": "2022-11-29",
            "source": "rt"
        },
        {
            "content": "Good movie . Surprised I missed this back when it came out ",
            "review_date": "2022-09-25",
            "source": "rt"
        },
        {
            "content": "With endless twists and turns, soulfully rich characters and a supremely epic moral dilemma at the films crescendo, Gone Baby Gone is just short of excellent. It's just a small shame it's in service of yet another white trash ghetto Boston tale provided by director-writer Ben Affleck.",
            "review_date": "2022-09-23",
            "source": "rt"
        },
        {
            "content": "Gone Baby Gone is an emotional rollercoaster that's worth the ride!! Morgan Freeman does it again, with his amazing acting skills! Casey Affleck is phenomenal and I must say, major kudos to Ben Affleck in his directorial debut! A Must Watch!!!",
            "review_date": "2022-09-21",
            "source": "rt"
        },
        {
            "content": "6 years ago-Tense and unrestrained, the film holds nothing back as Ben Affleck offers tight direction while his brother becomes an unexpected crime drama hero in a well acted masterpiece. The film has further life bred into it by setting of Boston's streets.",
            "review_date": "2022-08-22",
            "source": "rt"
        },
        {
            "content": "A well done crime mystery that has a great surprise and an ethical dilemma that will have you thinking after the movie.",
            "review_date": "2022-07-24",
            "source": "rt"
        },
        {
            "content": "Ben Affleck makes a most assured and riveting directing debut with this Boston-set police procedural/moral drama. The cast is superb all around, except for Affleck's little brother, Casey, in the lead. He's not bad, just not good enough to carry the picture. Still, the smart story and the setting make for gripping drama. It's no 'The Departed' but it's a strong crime drama",
            "review_date": "2022-07-19",
            "source": "rt"
        },
        {
            "content": "An interesting take on how kidnap kids can affect a community and how the results of said kidnapping can leaves scars on the soul.",
            "review_date": "2022-05-16",
            "source": "rt"
        },
        {
            "content": "Ben Affleck makes his best debut as a director, telling the story of a private detective who, with his girlfriend, investigates the disappearance of a girl. In addition to a beautiful photograph, the film deceives us in many ways and makes the path of investigation interesting and with a rewarding ending.",
            "review_date": "2022-05-12",
            "source": "rt"
        },
        {
            "content": "While Gone Baby Gone is well directed by Ben Affleck, superbly acted in particular by Casey Affleck and Amy Ryan and featuring strong dialogue, this is a standard neo-noir picture that is overbearingly dark, depressingly one-note and never as intense as it should have been. It's a slow-paced, forgettable flick that I found to be highly overrated.",
            "review_date": "2022-05-07",
            "source": "rt"
        },
        {
            "content": "Overall I liked the film. Really nothing special, cinematography and acting performances are all mediocre. 6/10",
            "review_date": "2022-04-16",
            "source": "rt"
        },
        {
            "content": "Movie moves along rapidly, even with many plot twists. Well acted and the story is easily followed through the maze. Affleck has proven himself up to the task in many movies now, and he doesn't disappoint in this one. Seeder side of society, good and bad where you don't suspect and a little girl in the middle. A couple hours well spent.",
            "review_date": "2022-03-25",
            "source": "rt"
        },
        {
            "content": "83/100 -------------",
            "review_date": "2022-02-22",
            "source": "rt"
        },
        {
            "content": "Too boring, too slow, I gave this movie a chance, but it did not capture my imagination, thus the *3* star rating!!!",
            "review_date": "2022-02-22",
            "source": "rt"
        },
        {
            "content": "I liked the moral question. What is right? What is wrong? What is good and what is bad?",
            "review_date": "2022-02-13",
            "source": "rt"
        },
        {
            "content": "Gritty Boston drama centring on a missing child case.  Casey Affleck and Michelle Monaghan play a couple hired to try to find the missing girl working along with the detectives.  \nReally well acted by the cast especially Ed Harris as the lead police detective.  Morgan Freeman also stars.  Directed by Ben Affleck.  Very good crime drama that gets a bit dark.",
            "review_date": "2022-02-09",
            "source": "rt"
        },
        {
            "content": "This film was absolutely terrible. Do not be fooled by the high rotten tomatoes score, there is a plethora of other films, with lower rotten tomatoes and IMDb scores, which are far better. Some include: Red dragon, The bone collector, taking lives and Se7en (yes I know Se7en has a lower toms score!!!!!!!!!! HOW) to name a few, watch those instead and if you've watched all of those, watch them again. In fact watch anything instead of this. Some of the critics say 'gritty' and 'thought provoking ' but just no. The film was highly unrealistic, hard to follow, the main \"protagonist\" was unrelatable and frankly the \"action\" sequences were abysmal. Don't watch, as there isn't even any eye candy to be distracted by.",
            "review_date": "2022-01-19",
            "source": "rt"
        },
        {
            "content": "Drags in places and the tone is grim but it's a powerful and thought provoking film.",
            "review_date": "2021-12-31",
            "source": "rt"
        },
        {
            "content": "Once you've seen a crime thriller like Prisoners, it's hard for anything else to come close. Particularly when the inevitable comparisons are made.",
            "review_date": "2021-10-11",
            "source": "rt"
        },
        {
            "content": "A fantastic crime story that will linger in your mind long after the credits have rolled.",
            "review_date": "2021-09-21",
            "source": "rt"
        },
        {
            "content": "A solid thriller with a great cast.",
            "review_date": "2021-08-30",
            "source": "rt"
        },
        {
            "content": "As advertised, it is a quality kidnapping story, with lots of twists and good pacing.  But that is not the true gem of the movie.  How the story morphs into a deep dissection of people's choices and their consequences.  Whether the ends do or do not justify the means.  Is a choice that may be morally right in your eyes correct if that choice harms others.  Very well acted.",
            "review_date": "2021-08-03",
            "source": "rt"
        },
        {
            "content": "Stunning direction and acting in a film that wasn't afraid to pursue the moral high ground against what seemed like more appropriate choices. While the outcome may not please everyone, the film is worth every RT percentage point!",
            "review_date": "2021-08-01",
            "source": "rt"
        },
        {
            "content": "I wanted this to be great but it just wasn't. For one they filled potentially great scenes with awful dialogue. The accents especially from cheese was ridiculously bad. Michelle Monaghan sorry to single out was one of the worst out the lot for her weak performance mainly just a spare part. For some reason even the crack head in the poor estate seemed to have a mansion. Ben elected himself to direct this but appeared to throw in as many cring—y swear words as he could, as many tough guy statements which lead no where as he could, didn't select his cast well as we needed more from the senior detectives just messed up what was actually a good script. Well sorry to say Ben this wasn't gone girl, this was just gone baby gone - problem was they must have been pretty gone to mess up this story. Shame",
            "review_date": "2021-06-25",
            "source": "rt"
        },
        {
            "content": "Love the Afflecks when they bring Working Class to a movie. As BA's first punt as Director, this shows his talent, pure and simple. The story is good, the setting is perfect, and the stalwart cast showed obvious faith in him, and it paid off",
            "review_date": "2021-06-24",
            "source": "rt"
        },
        {
            "content": "I don't know about you but it's pretty bored ride till felt asleep... well that tell you much",
            "review_date": "2021-06-22",
            "source": "rt"
        },
        {
            "content": "85%. Interesting twist at the end that I didn't see coming. Good story and drama. Worth a rewatch.",
            "review_date": "2021-06-07",
            "source": "rt"
        },
        {
            "content": "The greatest thriller ever!!!!!!!!!!!!!!!!!!",
            "review_date": "2021-03-23",
            "source": "rt"
        },
        {
            "content": "Ben Affleck's \"Gone Baby Gone\" is an ambitious, gripping and utterly unpredictable crime thriller that marked a promising start to Affleck's career as a filmmaker. With his directorial debut, Affleck crafted an astonishing adaptation of Dennis Lehane's murder-mystery book. Using captivating cinematography, Affleck draws viewers into the world of an obsessive detective that investigates the disappearance of a girl in Boston. From intimate close-ups to tense tracking shots, the cinematography keeps viewers engrossed in the film's smalltown setting. For a first-time filmmaker, Affleck exhibits immense control of craftsmanship over the production design, editing and musical score. Affleck's screenplay is also sensational, and expertly uses voice-over narration to keep viewers engrossed in the murder mystery. It is hard to not admire the astonishing performances from the cast. Casey Affleck delivers one of the best performances of his career as Patrick Kenzie. With riveting expressions, he conveys  the angst, persistence and internal remorse of a private detective that commits his life towards solving a murder mystery. Michelle Monaghan is equally remarkable in the role of a tormented woman that is haunted by her tragic past. Monaghan brings heartfelt emotion to the film in one of her finest roles. The final, most unforgettable standout in the cast is Morgan Freeman. As a guilt-ridden police officer, he infuses emotional depth into one of his most memorable characters. Although \"Gone Baby Gone is undeniably an astonishing crime thriller, ultimately it is not a flawless film. If there's a minor drawback to the movie, it suffers from an uneven pace that tests the viewer's patience. Moreover, it lacks the compelling character development of the films that Affleck would later go on to direct in his career. Nevertheless, fans of the novel will definitely enjoy \"Gone Baby Gone\" and so will movie-goers seeking gripping entertainment. At a time when Ben Affleck seems to have lost his spark as a filmmaker, its a rousing reminder of his talent for making gripping murder mysteries.",
            "review_date": "2021-03-18",
            "source": "rt"
        },
        {
            "content": "One of the best Ben's movies. Great adaptation from the book. Great cast, great performances. Excellent directional debut.",
            "review_date": "2021-03-12",
            "source": "rt"
        },
        {
            "content": "Incredible cast, amazing performances. The story is an emotional roller coaster. Well written and well delivered. ",
            "review_date": "2021-03-06",
            "source": "rt"
        },
        {
            "content": "This is a really good movie.  The story is great and the cast is phenomenal.  I love the gritty blue collar Boston backdrop.",
            "review_date": "2021-02-21",
            "source": "rt"
        },
        {
            "content": "It's an interesting story. The second half is stronger than the first half. I think you have to see it more than once to fully appreciate it.",
            "review_date": "2021-02-07",
            "source": "rt"
        },
        {
            "content": "A must see movie mystery and suspense a plenty.... fantastic and i mean really fantastic script and acting make this a wonderful piece of cinema",
            "review_date": "2021-01-31",
            "source": "rt"
        },
        {
            "content": "Great acting, and a nicely paced story.",
            "review_date": "2021-01-26",
            "source": "rt"
        },
        {
            "content": "Twisty, dark, light, and well done! It's great to see a film that risks the conventions of a caper that has to resolve to a textbook happy ending and instead studies the ambiguity of doing the \"right thing.\"",
            "review_date": "2021-01-25",
            "source": "rt"
        },
        {
            "content": "Thoroughly enjoyed this one. Very original plot with great performances. Interesting moral questions are asked with no clear answers. This is a smart and thought provoking movie.",
            "review_date": "2020-12-21",
            "source": "rt"
        },
        {
            "content": "The movie was decent. The question of morals and decision is a very good theme. The twist was a bit far fetched for me. Any Ryan's performance was great. Casey affleck was also decent. It's a very average thriller.",
            "review_date": "2020-12-09",
            "source": "rt"
        },
        {
            "content": "Fantastic and nuanced ending. Great performance by Morgan Freeman, as usual. Why does Ed Harris always play an ignominious bastard? And why do my own trips to Boston never look anything  close to an Affleck movie?",
            "review_date": "2020-11-24",
            "source": "rt"
        },
        {
            "content": "A moving story with great questions of morality. Only held back by its slightly muddled storytelling.",
            "review_date": "2020-10-17",
            "source": "rt"
        },
        {
            "content": "This is bad movie it's boring I don't like it at all and I can't complete this no interesting story and no good acting nonthing good",
            "review_date": "2020-09-14",
            "source": "rt"
        },
        {
            "content": "Brilliant movie  great  storyline and great acting, I'd  definitely recommend this",
            "review_date": "2020-09-12",
            "source": "rt"
        },
        {
            "content": "Debut cómo director de Ben Affleck. Un filme arriesgado por lo fuerte del tema y que pone a prueba nuestra paciencia y creencias. \nLa historia se centra en un secuestro de una niña, la familia llena de fallas, la policía incompetente o quizás rebasada, un pedófilo cómo principal sospechoso y un sin fin de circunstancias que cómo espectador nos ponen a dudar hasta de lo que nosotros creemos correcto. \nCon un elenco sólido con Casey Affleck, Michelle Monaghan, Morgan Freeman, Ed Harris entre otros.\n La manera en la que el director entrelaza las historias incluso utiliza su conocimiento sobre la ciudad de Boston para volverla parte fundamental para que el guión fluya con dinamismo, sin perder interés es muy bueno.",
            "review_date": "2020-09-06",
            "source": "rt"
        },
        {
            "content": "Rewatched this a few days ago. DOn't know why. Just did. Amazing performances and I would pay good money to have seen all the takes of Morgan Freeman at the moment he realizes what has happened to him.",
            "review_date": "2020-09-05",
            "source": "rt"
        },
        {
            "content": "This film was excellent. I loved everything about it from the acting to the plot. Highly recommend this to anyone.",
            "review_date": "2020-08-20",
            "source": "rt"
        },
        {
            "content": "Loved this movie. I thought everything about this film from plot to acting was excellent.",
            "review_date": "2020-08-20",
            "source": "rt"
        },
        {
            "content": "If you haven’t seen this great film, and you’re reading these User Reviews, you can read mine but stop afterwards. This story can be spoiled and Users have a horrible habit of saying too much. I’ve seen this probably four times over the years, and each time I appreciate the writing and the direction even more. The acting performances are the type where you forget that the characters you’re watching are actors. The story is great, and will stay with you after the end credits. It plays like a great fictional book that successfully got adapted for the screen. If you have trouble with the Boston accents just skip back and listen again, but that’s part of what makes this great is that you feel like you’re watching something authentic. ",
            "review_date": "2020-08-19",
            "source": "rt"
        },
        {
            "content": "When the right thing goes so wrong",
            "review_date": "2020-07-05",
            "source": "rt"
        },
        {
            "content": "I couldn't find any reason to become engaged with the story as I found it depressing but uninteresting.",
            "review_date": "2020-06-23",
            "source": "rt"
        },
        {
            "content": "I fratelli Affleck, uno alla regia e uno protagonista, tirano fuori una pellicola notevole sotto tutti gli aspetti; un crescendo continuo di emozioni contrastanti che arriva al suo culmine con una scelta che mette a dura prova chi guarda.\nSceneggiatura praticamente impeccabile, attori perfettamente calati (citazione particolare per Ed Harris).\nBene bene bene",
            "review_date": "2020-06-13",
            "source": "rt"
        },
        {
            "content": "One of the best thriller movie with a beautiful plot.",
            "review_date": "2020-05-02",
            "source": "rt"
        },
        {
            "content": "I really like films directed by Ben Affleck, and this is his directorial debut. And it's a fine good one! Based of a book by the same author who wrote the book which would be adapted into Clint Eastwood's Mystic River (2003), this is one of the best and most powerful mystery thrillers I've seen. The writing is done in a realistic manner, where characters just come and goes in the pic, which I found realistic. And the cast is just terrific. Casey Affleck gives a strong lead performance, as well as Michelle Monaghan, Morgan Freeman and Amy Ryan and Ed Harris among others. There are some suprising twists and turns which amazed me. And this movie heavily tackles the theme of morality, it weights a lot in the pic's story, as well as a certain sense of dread. Overall, this neo-noir thriller really entertained me, and it's a future classic for sure. Great flick and recommended!!",
            "review_date": "2020-05-01",
            "source": "rt"
        },
        {
            "content": "Great movie always makes you keep guessing",
            "review_date": "2020-02-29",
            "source": "rt"
        },
        {
            "content": "It's good! Nice solid captivating movie",
            "review_date": "2020-01-20",
            "source": "rt"
        },
        {
            "content": "A good movie with a nice twist. Overall pretty average. The acting was decent.",
            "review_date": "2019-10-20",
            "source": "rt"
        },
        {
            "content": "I didn't like Casey Affleck. He's not a great actor. He's too flat; not enough emotion. The ending was ridiculous.  I cannot recommend it.  ",
            "review_date": "2019-09-29",
            "source": "rt"
        },
        {
            "content": "The drama was good as was the acting, but the ending didn’t work for me. The movie was slow in parts, sometimes a bit hard to follow and had an ending that didn’t make sense in any way.",
            "review_date": "2019-09-15",
            "source": "rt"
        },
        {
            "content": "Oh my god this movie is terrible. Everyone who liked this film I beg you to watch it again but this time take your idiot caps off. It kinda feels like the movie had 3 potential endings but they couldn't figure out which one was less dumb so they just put them all in. ",
            "review_date": "2019-08-05",
            "source": "rt"
        },
        {
            "content": "Gone Baby Gone is a truly emotional picture. It's something you will watch multiple times. Ed Harris's performance is the highlight. His just stands out from the rest somehow.",
            "review_date": "2019-07-28",
            "source": "rt"
        },
        {
            "content": "This film (directed by Ben Affleck) is one that probably would not be made today, not for the subjects it touches, but because 2019 audiences are way more sensitive than 2007's were. Gone Baby Gone takes place in a tough suburb of mid 2000s South Boston. It's a drama mystery crime thriller that deals with a little girl being kidnapped from a \"questionable\" parent (to say the least) and the private investigators hired to help the police (who's already looking) find her. \n\nAs the investigator (Casey Affleck, yes Ben's brother) goes through the \"Boston underworld\" for answers, the rabbit hole gets deeper and deeper. With an excellent supporting cast of Morgan Freeman, Ed Harris, Amy Ryan, and Michelle Monaghan, the story flows smoothly with many twist and turns. Some of these turns might too graphic a subject matter for some since it involves the kidnapping of children, but the reality is that this is part of our society and director Affleck doesn't hold back. The action and situations are gritty, voilent, and bloody.\n\nThe final act will have you questioning about what's more important? Your own personal moral values or the greater good? Excellent film that got lost in 2007 since American Gangster, We Own the Night, The Bourne Ultimatum, and Ocean's13 came out as well. \n\nFINAL REVIEW: 9 out of 10. Netflix or rent it online. It's damn worth it \n\n\n",
            "review_date": "2019-07-13",
            "source": "rt"
        },
        {
            "content": "The ending could’ve been better. It was a good movie though.",
            "review_date": "2019-06-03",
            "source": "rt"
        },
        {
            "content": "The movie was great except for the end.",
            "review_date": "2019-06-03",
            "source": "rt"
        },
        {
            "content": "One of the best movies on Netflix right now.  Absolutely brilliant writing.  A lot of love and passion went in to portraying the good and the bad aspects of a community steeped in poverty.  The cast is nothing short of spectacular with Morgan Freeman and Ed Harris working hard to keep Casey Affleck from stealing the scenes.  Although I tend to favor Casey's acting, Been Affleck is still an incredible writer and director.",
            "review_date": "2019-05-31",
            "source": "rt"
        },
        {
            "content": "I just didn't find the private detective credible. Good story though ",
            "review_date": "2019-05-27",
            "source": "rt"
        },
        {
            "content": "Despite a couple of enormous plot holes, this was a well acted and well directed movie.",
            "review_date": "2019-05-23",
            "source": "rt"
        },
        {
            "content": "Left a bitter taste, mainly because the lead Patrick was such a pussy he possibly let one child be murdered and robbed another of a bright future.  He may seem the hero but overly moral characters particularly when mixed with religious nonsense should just get the fuck out of the way and let John Wick deal with it.",
            "review_date": "2019-05-20",
            "source": "rt"
        },
        {
            "content": "An engrossing and fully realized film that manages to tie all narrative loose ends and still leave you pondering the morality and choices it’s protagonists make. Caysey Affleck and Ed Harris are magnificent, Amy Ryan brings so many dimensions to what could have been a one note, evil character. Great, great film. ",
            "review_date": "2019-02-18",
            "source": "rt"
        },
        {
            "content": "Ben Affleck is a good director and with Gone baby Gone he has shown that he might very well transform into a top caliber one with time. The best mystery novels are the ones that use the genre as a stepping-off point for developing characters and examining issues. Affleck has successfully captured the essence of a written mystery on the screen. The production engages viewers not only on an emotional level but on an intellectual one. As the onion-like layers of the story are peeled away to reveal new ethical dilemmas that force the lead character to question what truly is \"right,\" we are invited to answer those questions alongside him then evaluate whether the consequences of his choices justify the decisions he made. It's a rare motion picture that provides such an uncompromising perspective of what is right and what is moral. This is an auspicious start by Affleck.",
            "review_date": "2019-02-05",
            "source": "rt"
        },
        {
            "content": "Great acting and directing, very well done.",
            "review_date": "2018-12-27",
            "source": "rt"
        },
        {
            "content": "The best thing about this film are the throw at shots of Dorchester streets. \nThe acting, directing, and plot are all sub par. As far as Boston movies this is not even in the same atmosphere as The Town... god forbid you mention it in the same sentence as the Departed. \nDisappointing movie considering the substantial hype",
            "review_date": "2018-12-24",
            "source": "rt"
        },
        {
            "content": "Fucking wow. Ben please stick to directing.",
            "review_date": "2018-12-09",
            "source": "rt"
        },
        {
            "content": "This film was solid.",
            "review_date": "2018-11-09",
            "source": "rt"
        },
        {
            "content": "Twists that would make M Night Shyamalan proud, together with some unexpectedly great acting from Casey Affleck",
            "review_date": "2018-10-24",
            "source": "rt"
        },
        {
            "content": "Just saw the movie. I think it is timely in that 2400+ children are missing everyday in America  and unbelievably this isn't reported and its epidemic. Really good movie.",
            "review_date": "2018-10-04",
            "source": "rt"
        },
        {
            "content": "I saw this movie and it was a real disappointment in reference to the messaging for society when you have an abusive parent. Drug mule mother neglects 3 year old child who is then taken subversively by authorities behind the scenes to try and give the child a normal life. Afflectk character who is PI takes  the wrong side and blows up the plan returning the child to her drug runner Mother. Really sad commentary on how Ben Affleck the director sees life.",
            "review_date": "2018-09-15",
            "source": "rt"
        },
        {
            "content": "6.3/10 — \"Okay\"/\"Watchable\"\n\n-(Seen on 6/30/21)",
            "review_date": "2018-08-16",
            "source": "rt"
        },
        {
            "content": "Very high quality investigation flick, fantastic direction and cast! The script is very well crafted with a few good twists. Also admire the difficult question this movie asked at the end. Highly recommend",
            "review_date": "2018-08-09",
            "source": "rt"
        },
        {
            "content": "Strong performances all around, incredible dialogue to build up truly interesting characters and a conflicting emotional conflict that will keep people talking, drives this movie, but the stand out aspect of this movie is the immense trust that Affleck puts into his viewers, offering a slightly odd structure and character decisions that lead to a heart wrenching finale. Gone Baby Gone is one of the best mystery dramas of the 2000s.",
            "review_date": "2018-08-04",
            "source": "rt"
        },
        {
            "content": "This movie not worth 94%. This is a bad one. It tries to have \"twists and turns\" but they don't work if you aren't along for the ride.",
            "review_date": "2018-07-25",
            "source": "rt"
        },
        {
            "content": "Thought provoking and well paced. Good story with a few twists and turns.",
            "review_date": "2018-05-19",
            "source": "rt"
        },
        {
            "content": "Gone Baby Gone is gripping from the first scene. I’m always delighted by any kind of mystery, and this one felt like a real puzzle for me to solve. This was the best kind of puzzling movie as well because it gives the audience most of the clues and challenges us to piece it all together while we watch the characters do the same. I was ahead of the story a couple of times, then I’d get stumped and the movie would surprise me. Even when it felt like the story was wrapped up, I knew it was too early for the film to end and I was delighted because that meant there was more to discover. It was a great experience that I seldom get in movies nowadays, so I have to applaud the novel and those who adapted it for the screen. This was also an interesting take on a private investigator. I liked how he was ahead of the cops, not because they were morons, but because he had friends on the street, since he grew up in the neighborhood with them (and for other more spoiler-filled reasons that I won’t ruin.) I’ll avoid talking about the end of Gone Baby Gone in too much detail, because I don’t want to spoil it, I just have to say it was gut-wrenching. I cannot tell you how intensely that affected me. I love films that force a character to face the question of what is right and what is wrong, but at the same time the question is being posed to you as an audience member. Any time I find myself watching a scene and I stop wondering what the character will do, and start wondering what I would do I almost want to stand up and applaud. That’s when a movie has transcended the passive act of showing a story, and achieved something greater. I couldn’t move for a few minutes after the movie ended. Where I would ordinarily skip the ending credits I just stared at the screen and couldn’t decide whether I wanted to cry in sorrow or scream in anger. Needless to say, I was deeply impacted by Gone Baby Gone, and I will be anxious to return to it and see it all unfold again just to experience that same emotional reaction. So that should be it, that could be the whole story, I would end this review now and tell you it is one of my favorite films of all time. I want that to be all, but there’s one thing, and as hard as I tried I could not ignore it. We’re talking about a film I think could have easily been a top 50 of all time for me on my first watch. But WHY did it have to star someone who can’t act? I’ve had this issue before, and after Manchester By the Sea, I convinced myself that I must be missing something that others are seeing. Sadly, Gone Baby Gone has confirmed my suspicions that Casey Affleck does not belong in front of a camera any more than his brother. It stands out more here because he is playing against masters of the craft like Ed Harris and Morgan Freeman. Where good actors have inflection and expression in their delivery, what passes for acting with Affleck is volume. He can be soft or loud, but give him an emotion to express and you get blank stares. He didn’t ruin the movie, but what could have been great was demoted to good because of this nepotistic casting choice. ",
            "review_date": "2018-03-24",
            "source": "rt"
        },
        {
            "content": "Seriously??? I cant believe the ratings for this. Mediocre at best.",
            "review_date": "2018-03-04",
            "source": "rt"
        },
        {
            "content": "Very decent movie. Gritty and realistic.",
            "review_date": "2018-01-11",
            "source": "rt"
        },
        {
            "content": "In a town ensnared by twisted, moral consequences, a haunted detective unwinds the costly truth that “the end never justifies the means.”",
            "review_date": "2017-11-27",
            "source": "rt"
        },
        {
            "content": "Asks tough questions and doesn´t give easy answers.",
            "review_date": "2017-11-26",
            "source": "rt"
        },
        {
            "content": "This directorial debut from Ben Affleck is more than just your average thriller. There's a real ethical, moral, and even borderline philosophical conundrum at the center of this piece that really helps move things along and make some of the more quiet moments that much more potent. A movie that - really all throughout, but most especially in its final moments - asks \"what is the 'right thing to do' in this situation?\" and presents a vast array of reasons for every option, giving the audience a real thinker. Yes, the performances are fantastic, the cinematography is top notch, and the music is memorable, but again, the real winners here are the more intangible aspects of the film. \"Gone Baby Gone\" might not be the easiest watch, but it is a recommended one nonetheless.",
            "review_date": "2017-11-25",
            "source": "rt"
        },
        {
            "content": "Watching this film is like enjoying a delicious serving of soup only to find a turd at the bottom of the bowl.",
            "review_date": "2017-11-22",
            "source": "rt"
        },
        {
            "content": "I wanted to see this because I had read and heard great things about it - but the film didn't stand up to what I had heard. It was kind of lackluster and all over the place. I felt like overall they were trying too hard to make it this intriguing thriller with many twists. The acting wasn't very good - and Casey Affleck did a terrible job. Also, the ending was awful and so weird. I just didn't really like it.",
            "review_date": "2017-10-04",
            "source": "rt"
        },
        {
            "content": "Great film. Cracking watch and very fast paced",
            "review_date": "2017-09-25",
            "source": "rt"
        },
        {
            "content": "The kid is alive at the end and living with Morgan Freeman.  He and Ed Harris stole the kid because they thought the kid's white trash mom was an unsuitable parent.  This whole movie was fairly dumb and unbelievable.  Casey Affleck was horrendously and comically miscast as a tough private investigator.  The kid is declared dead even though no body was ever found.  Casey Affleck shoots an unarmed pedophile in the head and totally gets away with it for no reason.  Maybe I'm just totally cynical and jaded, but the whole moral dilemma aspect of this movie just didn't really resonate with me -- I didn't find myself caring one way or another about whether the little girl went back to her white trash mom or if she lived with child kidnapper Morgan Freeman.  Who cares?",
            "review_date": "2017-09-09",
            "source": "rt"
        },
        {
            "content": "ed harris is the man.",
            "review_date": "2017-09-04",
            "source": "rt"
        },
        {
            "content": "Phenomenal film. Would definitely reccomend to those who show an interest in crime-drama films.",
            "review_date": "2017-09-02",
            "source": "rt"
        },
        {
            "content": "The flaws are serious but for the first half the intensity sweeps you along anyway. As it transitions, from tense mystery thriller, to more of a noir drama its failings start to catch up with it. It's not that it becomes bad, more that all the unlikely character behaviours accumulate to the point where you realise it can't blow you away no matter what the ending. And, while the twist is effective, the moral dilemma the film is so keen to leave you with just isn't presented with any new or revealing insights - it only feels a bit cynical and pessimistic.",
            "review_date": "2017-08-07",
            "source": "rt"
        },
        {
            "content": "Casey Affleck Pretty Handsome!!!",
            "review_date": "2017-07-23",
            "source": "rt"
        },
        {
            "content": "Very annoying adaptation of a good book.Great acting in segments. Uneven plot editing.  The heavy handed ending centred far to long on a fairly uninteresting moral dilemma. Plus watching bro Affleck talking without moving lips is up there with old-school nails on blackboard.",
            "review_date": "2017-07-16",
            "source": "rt"
        },
        {
            "content": "Excellent first up direction attempt by Ben Affleck and with a solid effort in the lead role by brother Casey. Supported by a stellar cast including the perennially superb Ed Harris. Without giving too much away this deals with the emotions and fallout from child abduction and is set in the grittier boroughs of Boston. Watching it for the first time this movie does not show its age.",
            "review_date": "2017-07-09",
            "source": "rt"
        },
        {
            "content": "A mystery with plenty of twists and turns.  It will ask you to question what is right and wrong.  The movie continues to change and you will question who is working for who and who can you trust.  It isn't a straight forward case and you will not see what is coming until the end.   I came away with this single thought, A righteous person may have to stand alone.",
            "review_date": "2017-07-01",
            "source": "rt"
        },
        {
            "content": "Really enjoyable film, especially for those from Massachusetts. Though I appreciate the unconventional ending, I can't decide if I think it's a bit forced...",
            "review_date": "2017-06-03",
            "source": "rt"
        },
        {
            "content": "Good crime story with a bunch of crazy twists!",
            "review_date": "2017-05-24",
            "source": "rt"
        },
        {
            "content": "Ben Affleck knocks it out of the park with his first directorial debut. Gone Baby Gone is very powerful and gripping. Strong performances from the entire cast. I loved Casey Affleck in this movie. The dialogue and script are really strong. Everything in this film felt legit, I felt like I was in Boston watching this movie. I love the end of this film, it leaves you with a big moral question at the end that will have people arguing what the right thing to do was for years.",
            "review_date": "2017-05-20",
            "source": "rt"
        },
        {
            "content": "Surprisingly long and complex crime thriller.",
            "review_date": "2017-04-12",
            "source": "rt"
        },
        {
            "content": "An unknown little gem of a movie. Story about a child that is abducted and how a private detective couple (who are married) go looking for her. Really well directed and edited. The producers really know what Boston's lower class of society acts like, and how they look. One of my all time favorite movies.",
            "review_date": "2017-03-25",
            "source": "rt"
        },
        {
            "content": "Surprising movie from Ben Affleck, really award worthy movie, but it has it flaws, but good acting overcomes them.",
            "review_date": "2017-03-15",
            "source": "rt"
        },
        {
            "content": "A triumph for the Affleck brothers both as leading star and director, Gone Baby Gone is an enthralling crime drama that raises complex moral issues.",
            "review_date": "2017-02-09",
            "source": "rt"
        },
        {
            "content": "Not the type of movie I'd normally watch, but this gritty thriller come morality tale has enough meat on the bone to retain interest.",
            "review_date": "2017-02-09",
            "source": "rt"
        },
        {
            "content": "Depressing AF. Jesus",
            "review_date": "2017-02-04",
            "source": "rt"
        },
        {
            "content": "Great performances from the whole cast, especially Casey Affleck and Ed Harris. Stylish direction from Ben Affleck and a very good story that makes you question the nature of right and wrong.",
            "review_date": "2017-02-02",
            "source": "rt"
        },
        {
            "content": "Really great mystery. Not what I expected at all. Proves how talented both Affleck bros are.",
            "review_date": "2017-01-31",
            "source": "rt"
        },
        {
            "content": "What an unbelievable movie. Such a strong moral and ethical question at the end, and the slight twist leaves you thinking on a deeper level. Casey Affleck is sensational, as are Morgan Freeman, Amy Ryan, and Ed Harris. Michelle Monaghan is also sneaky superb. Such a Boston movie. Would definitely love watching this with someone who's watching it for their first time.",
            "review_date": "2017-01-26",
            "source": "rt"
        },
        {
            "content": "Gone baby, gone. Mrs Affleck must be very proud because this was fantastic. Ben Affleck proves he is a superb director, possibly better than he is as an actor after this thriller. This is one of the most hard hitting films I've ever seen and Ben Affleck masters building up tension with the lack of music is important scenes. Parts of this did shows small resemblance to Se7en. Casey Affleck gives his best performance to date, he is subdued and subtle about his work but if you watch closely, you'll notice how good he is. All the characters are made relevant and interesting with good back stories to all of them. I thought Morgen Freeman was just there to sell tickets but his character plays a crucial role. There is a lot of talking in this film but the screenplay is good enough to entertain you. (No spoilers) towards the end of the film there is an impossible choice that a character has to make, I know for a fact that I couldn't choose, which was incredibly clever from Ben Affleck. What a debut!",
            "review_date": "2017-01-12",
            "source": "rt"
        },
        {
            "content": "A wholehearted crime drama with layers of character development, twists at every turn, and an ending that will leave you thinking for days after.",
            "review_date": "2017-01-06",
            "source": "rt"
        },
        {
            "content": "Most unintresting investigation I have ever seen.",
            "review_date": "2016-12-29",
            "source": "rt"
        },
        {
            "content": "A pretty impressivley directed movie. The editing and lighting are also well implemented. The characters are all fleshed out and motivations are understood. In relation to the plot itself I didn't find it as enthralling and engaging as other types of movies of this genre such as prisoners but the characters keep it moving forward. The pacing is good but drags a bit at times but not much. The story doesn't rush anything which can be a good thing or a bad thing but generally works here. I love the use of the colour white to represent Casey and black when something else is going on. This is a really great crafted movie amd succeds for what it is but it isn't than engaging or enthralling.",
            "review_date": "2016-12-22",
            "source": "rt"
        },
        {
            "content": "Tough to watch sometimes. Well done.",
            "review_date": "2016-12-03",
            "source": "rt"
        },
        {
            "content": "Ben Affleck crafts wonderful films behind the camera and normally pens them too. He deserves all the praise he gets because in his later years he has mastered both acting and directing. The dialogue is believable and absorbing. There is a ton of talk about best intentions & happens while characters act questionably. I love Morgan Freeman as a cop any chance I can get em. On top of that, this adaption of a book is written by the guy who wrote Mystic River.\nLittle Affleck shows his an ability to play a character from his home state. The mysteries winding excellently scene to scene. Critics call this a thriller, but one can also sense the elements of Noir. The cast surrounding him do not disappoint either, of which include the Black Smoke master from Lost and Michelle Monaghan. The narrative flows so naturally with a majority of things clicking for the film.\nIt's always interesting to see these movies give the hints to you, hiding the fact they are clues for the finale. The story causes you to rethink what you would deem good and bad as Casey looks for this missing girl beside the police. You can feel it start to lose you in the middle when a misdirection leads the story to stall, but it comes back stronger for it. The whole thing ends and you are still left with the question \"Did he do the right thing\"?",
            "review_date": "2016-11-25",
            "source": "rt"
        },
        {
            "content": "'Gone Baby Gone' is an exceptionally well told story. An adaptation of a novel of the same name (which I haven't read), it tells the story of an investigation into the abduction of a young girl investigated by both the police and an amateur private detective of sorts (Casey Affleck). The first time I saw this, I wasn't all that impressed. Then a couple of years later I watch it again for a second time with the girlfriend (her first time) and loved it. It's like I watched a totally different film the second time around. I hadn't forgotten how it ended, but maybe I was paying attention to the middle. Ben Affleck does an excellent job behind the camera - clearly much more capable at directing and acting - and his younger Casey Affleck clearly benefits from Ben's strong direction, supported by an all superb cast of actors. One not to miss. 4.5/5",
            "review_date": "2016-11-19",
            "source": "rt"
        },
        {
            "content": "For every good actor and plot point, there's a bad character arc and a laughable editing choice.",
            "review_date": "2016-11-09",
            "source": "rt"
        },
        {
            "content": "Ben Affleck's superb directorial debut is a tense and well paced dramatic crime story. Thrilling and emotional, Gone Baby Gone is worthy of all it's praise.",
            "review_date": "2016-10-25",
            "source": "rt"
        },
        {
            "content": "Couldn't understand a feckin' word they were saying. Steely eyed cyborg Ed Harris was good. Wolverine's girlfriend looked exactly like Michael Jackson.",
            "review_date": "2016-10-16",
            "source": "rt"
        },
        {
            "content": "Ben Affleck's directorial and screenplay efforts are a fascinating take in Gone Baby Gone. The film puts you in a vice-like grip with its emotional story, enthralling performances and even its striking and divisive twist that is emphatic and brilliant in every way. 4.5/5",
            "review_date": "2016-10-15",
            "source": "rt"
        },
        {
            "content": "Argo is a good (best) picture, but Gone Baby Gone is on another level, but not for everyone, both for the same reason.",
            "review_date": "2016-10-08",
            "source": "rt"
        },
        {
            "content": "'Gone Baby Gone' is a powerful, thought-provoking thriller that entertains, yet leaves the viewer will something to genuinely ponder. Toying with the true meaning of right, the film revolves around a missing girl. Much of the story plays out as you would expect, as one of the Afflecks assists in tracking down the culprit. Exciting action sequences inject pace inbetween tense scenes between key culprits. The conclusion however begins to pose difficult questions not only for our lead to answer, but the audience also. I thoroughly enjoyed this book to film adaptation, and its certainly one I continue to discuss and recommend.",
            "review_date": "2016-10-07",
            "source": "rt"
        },
        {
            "content": "Worth watching but never fully grasped my attention like other crime dramas have. Casey Affleck definitely made this movie with his phenomenal acting.",
            "review_date": "2016-10-04",
            "source": "rt"
        },
        {
            "content": "Entretenida, imprescindible y muy bien dirigida y actuada, no tengo problemas con esta pelÃ­cula, me gustÃ³ mucho, Ben Affleck lo hizo muy bien.",
            "review_date": "2016-09-25",
            "source": "rt"
        },
        {
            "content": "The accents are so realistic and thick that it's occasionally hard to understand.  The brothers Affleck do an amazing job with really tough subject matter.  You leave asking questions about what's morally right and wrong.  Great stuff.",
            "review_date": "2016-09-15",
            "source": "rt"
        },
        {
            "content": "Ben Affleck's first directorial effort is completely carried by his brother's great lead performance (which should've been more recognized)",
            "review_date": "2016-09-06",
            "source": "rt"
        },
        {
            "content": "It takes a while for the pieces of the puzzle to come together. But, once the picture becomes clearer, it leads to an unfathomable ending. While portions of Gone Baby Gone may be far-fetched, it does beg the question of what is right, and what is wrong.",
            "review_date": "2016-08-29",
            "source": "rt"
        },
        {
            "content": "Ben Affleck definitely showing his talent other than acting in this movie.",
            "review_date": "2016-08-25",
            "source": "rt"
        },
        {
            "content": "nice twists, not enough character or plot development but def worth the time",
            "review_date": "2016-08-22",
            "source": "rt"
        },
        {
            "content": "A great mystery drama with good cast and good performance, and oh my god Ben Affleck , he just nails it with his direction. He proves that he is one of the best directors we have now.This movie has a great location set in Boston and gives us a beautiful thriller.",
            "review_date": "2016-08-18",
            "source": "rt"
        },
        {
            "content": "Good but not stunning",
            "review_date": "2016-08-02",
            "source": "rt"
        },
        {
            "content": "a real disappointment for a fan of the Kenzie Gennaro series of books. This was a poor representation of these characters. Casey Affleck- cmon man!",
            "review_date": "2016-07-24",
            "source": "rt"
        },
        {
            "content": "This movie is a collection of a splendid storyline, outstanding performances and directing.",
            "review_date": "2016-07-19",
            "source": "rt"
        },
        {
            "content": "It relies on a sophisticated attempt at caricatures and is structurally sloppily, barring it from being a \"must see\" mystery thriller, but the emotional heft present despite these errors, found in the film's better characters and its setting, make it worth a watch.",
            "review_date": "2016-07-11",
            "source": "rt"
        },
        {
            "content": "Smart, unpredictable and morally-challenging.",
            "review_date": "2016-06-16",
            "source": "rt"
        },
        {
            "content": "They could have cut a good 20 minutes out of this movie.",
            "review_date": "2016-06-15",
            "source": "rt"
        },
        {
            "content": "Al suo debutto alla regia Ben Affleck riesce a creare un buon thriller, pieno di colpi di scena e personaggi interessanti. Nonostante una trama particolarmente intricata il film risulta essere chiaro da seguire, grazie ad una sceneggiatura pulita ed una regia mai scontata.",
            "review_date": "2016-05-31",
            "source": "rt"
        },
        {
            "content": "Gone Baby Gone may be a little bit longer than it should, but it's a thrilling and dramatic story that poses one of the best moral dilemas one could think of. And it's pretty real about it too. I wouldn't say it's the best acting I'd see, but it's the story that needs needs the focus here.",
            "review_date": "2016-05-22",
            "source": "rt"
        },
        {
            "content": "Ben Affleck's directorial debut is a knockout. His grasp on capturing the life of Boston is second to none. This will rank high in years to come as one of the best modern thrillers out there.",
            "review_date": "2016-05-19",
            "source": "rt"
        },
        {
            "content": "Acting is good in this \"saw that coming\" movie.",
            "review_date": "2016-05-11",
            "source": "rt"
        },
        {
            "content": "It has his you going the entire way through. Something so real you can't look away until the end. Much suspense and satisfying ending.",
            "review_date": "2016-05-08",
            "source": "rt"
        },
        {
            "content": "this movie broke me in so many ways",
            "review_date": "2016-04-19",
            "source": "rt"
        },
        {
            "content": "Due to the tough subject matter, I kept wanting to turn it off. But I just couldn't. A thinker!",
            "review_date": "2016-04-08",
            "source": "rt"
        },
        {
            "content": "An interesting set up, that starts out very promising. About halfway through \nThe movie starts out with an interesting set up and interesting characters, that, unfortunately, all degrade as the movie goes on. The plot becomes riddled with holes, characters start doing non-sensical stuff while the dialogues worsen.  Wouldn't really recommend this one.",
            "review_date": "2016-04-05",
            "source": "rt"
        },
        {
            "content": "Tightly directed and just as well-acted, \"Gone Baby Gone\" is a mystery thriller more interested in why its characters do things, rather than the actions themselves.",
            "review_date": "2016-03-27",
            "source": "rt"
        },
        {
            "content": "Loved this directorial debut from Ben. It was extremely well written.",
            "review_date": "2016-03-24",
            "source": "rt"
        },
        {
            "content": "When we see shit is sensitive around here when others dont like other people snooping or talking. When we see whom is wanted and whom is not wanted in some parts. When whom we have to see we don't expect to see when we are used to seeing people our age. When what we don't see is times a changing when we get younger and younger to have better eyes to see whom we are dealing with. When we see we got all informants and help from places we don't usually care to look, when the streets have all eyes to see and hear what's going on. When we are old school to see the source to only see it our way. When what we see or don't see we are lead to believe to see it one way when some leads either go one way or nowhere to see if they are reliable. When others don't see why we do somethings when it's hard, to see it our way. When we do or don't see some people to care but know they are seen as guilty.\n\nWhen we see business is done differently down here, we see the lengths people go through to make others see we mean business. When we see others go to lengths to make others not see. When what we font see or see its either hidden or they don't have it for everyone to investigate or see it their way to find our answer another way. When all we can be seen is victim or suspect for us to see what we want to see again. When so hard to see the end to make sure others see we get what's coming us. When we see we got to dig in deep where the law don't see, when we see things are not as deep as they may seem. When we see this is only business when we see in order to get the big fish we leave the small fish to swim and see what goes on. When we see we can't come to some places where we see how we both work to see we are either disrespected when we are mutual colleagues. When we see we are going nowhere to see somethings find its way to us when it's evidence. When we see we can't come in our own places to disrespect those whom have rank over us. When we see that we must follow procedure to go by everything by the book and as planned to see to we get somethings safe and sound. When we don't see somethings coming to see we get there as soon as we can before it's all over. When we see how some cases we are invested in to chase after to its sadly end before we could see to their safety. When we see that somethings that ho wrong we take responsibility for while others hold on to seeing they failed. When it's hard to let go and see things go to see their sad end. When we see it in their shoes to only want to be found then lost. When we don't see somethings coming when the same thing happens to know we have another chance to see redemption, to see we are not failures of those whom see us and don't trust us to see the case.\n\nWhen what we rather see is justice in places where it doesn't belong, in people whom it has effected, and those whom we need to get rid of. When what we don't see on time costs innocent lives. When we see our way works when tips and informants all have eyes for us to see where we don't normally look. When what we see we see to our own justice. When we are seen as a hero, seen to do a good job, seen to do a city a good, to see ourselves something else. When we see we all have dark moments in our career we keep seeing that makes us look that we are doing a good job. When we see the world is filled with injustices people not doing a good but see they are not fit for so much to see they got to go when we don't like seeing shit like that. When we see we all pay the price gor what we don't want to see when we are a symbol more then for the city but religion when we see evil & good. When not everything we see makes sense when we put two & two together that somethings we dont see is clear. When we see the right people, others choose to reveal what they see or let it slip when they don't see or care to see it through when it could be nothing or something. When what we see is somethings that are strange out of the ordinary to see closer.\n\n\nWhen somethings we see we see go down the drain for when we are involved with somethings we ought not to be seeing. When we need to put a stop to others seeing into things deeper we make them see part of the truth. When there are others whom dont want us to see or speak to put an end to us seeing. When the last bit of decency and last thing we ought to see is we did our job to the vary end and we chose to see we lived by the side of the law to see it through the end. When we see our words in front of witnesses and evidence to see others see what's coming to them. When we see life sees it differently to change the outcomes of what we thought to see. When we see everything was staged when we are brought into something for only our eyes to see, to see what others can profit on when there is no harm when we see some people unfit, see we are doing a city a good by getting rid of them, to see it our way when we can. When we see we sre duped into thinking somethings, to see past all the darkness and see to it that justice is done or instant justice as others see. When we see justice isn't always fair to everyone, but we work for those whom we clearly see as a victim and what others can't see now but later that they are one too to see we fo the right thing.\n\nWhen we wish we were in a different place we wish to see we have to live in the place and world we always see and live with it. When what we see is the truth, and can't whind ourselves living in other places we don't belong, or not apart seeing. When we see there are plenty of good people we see and bad people we see to not see into everyone's life and see to it they live good. When we do see justice was done, to see everyone is safe and sound. When we can't see some people whom we dont see eye to eye with when they remind us of what we can't see. When we see we did a good job to see its a unfair decision, but a good one we see and live with.\n\nWhen somethings don't change when we see that good people whom do good acts continue to live unseen.\n\n***************************************************************************\nWe have designated system, law, enforcers, and civilians that embody and follow this system that make it work. When the system does work for all, those whom follow the system, need to find another way to live their life, outcasted, unlawfully they follow. When child abductions, to find another means for profit is the next resort. When rising crime in banks, and new procedures have followed that make the old ways of crime no longer trustworthy. What role do we all play in what crimes exist. Those whom are rich, poor, priviledged, unluck, lucky, enherited, bosses, low lifes, all cohabiting together in this system. When new ways of fighting crime, is needed, to be undercover, playing both sides of the field. When the system doesn't work, the crime gets more serious. The underworld of crime, desperate need for money from up to bring to down. Those whom have addictions and those whom have drugs. Those whom abuse the system, and those whom dont. When some crimes we have a role in and others we dont. When even the enforcement doesn't believe in the justice system as much those whom they are against. When the system is broke, when their is no compensation for the lose to returns justice is not enough in penalizing, we take justice in our own hands. When we are similar to those whom do they samething, yet our life and death is more priviledged and decorated. Infiltrating gangs and getting in deep, serves same brotherhood as being part of the system and being in enforcement. What is legitimacy, when the law is supposed to be legitimate, but those whom swear to enforce it, are able to go for and against it, and play both sides, benefit. When being unethical and illegitimate is addicting when it works. But, becomes unaddicting when it doesn't work or accidents happen. Everything returns back to the way it was, legitimate becomes legit and out in the open, and un-legitimate become unlegit and goes in hiding, awaiting the next time. What makes legitimacy legit, when we tell ourselves we are doing it for the right reasons. Tore people's life to benefit our own. When those lives are what is a drain unto society that we remove and benefit from. When legit removes the middle men of the underground society to serve themselves. Who knows what's best for society, those whom are in the front lines of it, or those whom are not. When those whom are not legitimately invested in society are sometimes the best ones who can take care it. But it's not right, when its not legitimate. When legitimacy doesn't mean you stray away from your duty. When legitimacy doesn't mean you make the new rules that goes against the system's fundamentals. There are people depending on us to go unlegitimate.",
            "review_date": "2016-03-20",
            "source": "rt"
        },
        {
            "content": "From a interesting story to good performances from Amy Ryan and Casey Affleck, Gone Baby Gone is a true sign of Ben Affleck making a comeback",
            "review_date": "2016-03-05",
            "source": "rt"
        },
        {
            "content": "Oh my god I don't even know how to express how angry I am at this movie :-) The two and a half stars is an emotional reaction to a unbelievably s***** ending and are for the acting of Casey Affleck and Harris with an equally impressive supporting cast. But seriously.  What an absolute rip off... Gratuitous in its abandonment of the audience. Really well acted gritty and compelling and then just a total burn. I will say having seen Ben Affleck (who directed it)  express himself as the sanctimonious self-proclaimed defender of the politically correct social justice warrior status quo artist on the Bill Maher show  with Sam Harris in attendance it doesn't surprise me how much of a douche ending he decided to go with. F@#!* Ben Affleck  and f*** the ending to this movie. I just hope he doesn't ruin Batman for me. But it ain't looking good.",
            "review_date": "2016-02-24",
            "source": "rt"
        },
        {
            "content": "What a truly great mystery. Gone Baby Gone has all the elements any good mystery story should have - misdirection, crazy twists and turns, and bloodshed (just to add to the excitement). The all-star cast especially elevates Gone Baby Gone to heights that exceed most mysteries and thrillers produced in this day and age.\n\nThe person who earned this film an Oscar nomination: Amy Ryan. Rightfully so.  Appearing in supporting roles in both The Office and The Wire, Amy Ryan goes well out of her comfort zone to play a druggie coked out of her mind, conflicted emotionally over her missing child (at points she can care less, at others it is heartbreaking how she takes it). It is difficult not to marvel at Ryan's performance; she is completely believable as being psychologically disturbed which is rare from an actress who is sane in her other roles (well, at least in The Wire).  It is very difficult to pull off being a convincing drug addict, and Ryan is arguably the best part of this film.\n\nThe plot is on and off at points; in the first half of the film it is easy to notice that something seems \"off,\" but it is hard to put a finger on it, making the audience question the events as a good mystery should. The outcome of a mystery should be a surprise, but you don't want to keep the audience completely in the dark if you want the outcome to seem plausible. However, the logic of the situations in the first half of Gone Baby Gone does not add up in ways that are too obvious.\n\nWhat makes up for this?  Practically everything else about the film.  The story eventually gets to a point where the morality of certain situations and choices is questioned by both the characters and the audience, and with good reason too. Movies are meant to be about the human condition, and when you have a film like Gone Baby Gone pose difficult questions of what is ethical, or what the greater good is in certain situations, you have an outstanding movie (and it helps when the twist of any mystery is very unexpected).\n\nGone Baby Gone is an overlooked work by Ben Affleck. It is his best film, but it did not get the recognition it deserved when it was released.\n\n4.0/4.0",
            "review_date": "2016-02-18",
            "source": "rt"
        },
        {
            "content": "great movie, great plot with unforeseen twist and turns. Pulls at the heartstrings!",
            "review_date": "2016-02-17",
            "source": "rt"
        },
        {
            "content": "Morgan Freeman was the big draw. Kept watching hoping it would get better.",
            "review_date": "2016-02-08",
            "source": "rt"
        },
        {
            "content": "The twist in the end that really got me as well as the performances, story and overall film really shows Ben Affleck's skill at directing as well as his future with other projects. Check it out!",
            "review_date": "2016-02-05",
            "source": "rt"
        },
        {
            "content": "Was an interesting movie, but the last 3/4 pretty much ruined it for me. Affleck started out as a not very believeable character but turned into fitting the role well.",
            "review_date": "2016-01-29",
            "source": "rt"
        },
        {
            "content": "Great cast and writing. Casey Affleck delivered a great performance.",
            "review_date": "2016-01-16",
            "source": "rt"
        },
        {
            "content": "A VERY impressive directorial debut for Ben Affleck. Gone Baby Gone is an emotionally haunting, sometimes disturbing mystery thriller with a cast full of good performances led by Ben's brother Casey, and some thought-provoking themes. As a drama, it can be heartbreaking, as a thriller, it can be grippingly intense, as a mystery, it sucks you into it wanting to find out what happens. It does all of its genres very well and it's one of my favorite mystery thrillers of the past twenty years.",
            "review_date": "2016-01-16",
            "source": "rt"
        },
        {
            "content": "Tense and unrestrained, the film holds nothing back as Ben Affleck offers tight direction while his brother becomes an unexpected crime drama hero in a well acted masterpiece. The film has further life bred into it by setting of Boston's streets.",
            "review_date": "2016-01-09",
            "source": "rt"
        },
        {
            "content": "Debut director Ben Afleck shows that he can direct so well.. the mystery continue till the end...supporting casts like Ed Harris,Morgan Freeman is so good...Amy Ryan gives her best performance in the movie...but somehow Causey Afleck can't impress me,. he can do much better ......the story is really good and keeps you hold till the end. It shows us how a great neo-noir mystery movie looks like....",
            "review_date": "2016-01-05",
            "source": "rt"
        },
        {
            "content": "A fascinating movie that will test your beliefs and views.  What starts as an emotional drama quickly morphs into a thrilling mystery.  And even though there is a clear separation between black and white in the beginning, by the end all you can see is grey.\nThere is some fine acting on display here, and Casey Affleck definitely didn't get the lead due to nepotism.  He shines in his role as the protagonist, forcing you to walk in his footsteps during this emotional rollercoaster.  Oh ya, and that other Affleck, he actually shines too, in his directorial debut.\nOverall it's a great movie that will appeal to a very broad audience:  Film fans who enjoy an intelligent mystery as they attempt to stay one step ahead of the plot... or film fans that just like to relax and be surprised as the plot reveals itself... and especially film fans that love debating human morality, and what's right vs what's wrong.  All will leave satisfied at this end of entertaining flick.",
            "review_date": "2016-01-02",
            "source": "rt"
        },
        {
            "content": "This such a sad story for so many reasons, mostly for the two children involved, both taken--one ends up dead and the other is a pawn..  That so many children are unwanted, neglected, victimized all over the world, as well as here, is one of the most most tragic facets of human life. What is the right thing to do? There are no easy answers--and that is what I admire so much about this film, a quality effort of direction, scriptwriting and casting.",
            "review_date": "2015-12-31",
            "source": "rt"
        },
        {
            "content": "Really underrated mystery flick with a nice twist at the end and great performances by Casey Affleck, Morgan Freeman, Ed Harris and Michelle Monaghan.",
            "review_date": "2015-12-29",
            "source": "rt"
        },
        {
            "content": "A very entertaining Boston crime drama directed by Ben Affleck, that is reminiscent in its portrayal of Boston life, of Clint Eastwood's 'Mystic River', Martin Scorsese's 'The Departed', and a previous Affleck flick 'The Town'.",
            "review_date": "2015-12-25",
            "source": "rt"
        },
        {
            "content": "I could probably go on forever about all the good parts I love about Gone Baby Gone. To start with, it has a winning original story written by Dennis Lehane. Casey Affleck shows what he really is capable of pushing himself to his own limit. Amy Ryan, Ed Harris and Morgan Freeman are simply fabulous as one could ever expect them to be. And the soundtrack is definitely heart-gripping. Ben Affleck really did a fantastic job directing!! It starts off making you feel like watching The Town, another piece of Ben Affleck' s.\n\nGone Baby Gone starts its story in a flat and straightforward way of telling but then so many more layers adding onto one another, then the audience starts to realise that the case is actually more complicated than it appears. Instead of pealing off layers, Gone Baby Gone works its way sort of backward telling the story and it absolutely works. Perfectly.",
            "review_date": "2015-12-14",
            "source": "rt"
        },
        {
            "content": "When I first heard that Ben Affleck was going into directing and his first movie was going to star his brother, I must admit, I was pretty skeptical.  After some straight up box office duds in theatres, I thought it was a last ditch effort to keep himself relevant in the eyes of the public.  Boy was I totally wrong on that.  Affleck's directorial debut is really impressive.  This movie starts off kind of slow, just getting you used to the setting of tough nosed Boston and the people that inhabit it.  But as the movie picks up and the story starts to develop you cant help but be on the edge of your seat throughout the entire show.  And just when you think you have it all figured out and the movie is coming to a slow close, the script gets flipped on you again.  The screenplay taken from a great book is top notch as well is the acting.  Affleck manages to capture the feel and attitude of Boston in this gritty mystery thriller. The Town and Argo which followed this movie were both great films as well, but in my opinion this is Affleck's best work as a director to date.  It really makes me excited as to what he will bring us in the future.",
            "review_date": "2015-11-24",
            "source": "rt"
        },
        {
            "content": "Mystery thrillers with its lots of turns and twists and edge of the seat elements keep its viewers stick to their chair until the mystery unveils, there is no chance of getting distracted in between the flow because of its transfixed contents, 2007 release investigative mystery thriller ''Gone Baby Gone'' is one such kind of good movie that astonishes the viewers with its enthrall storyline which gives you the roller coaster experience with its unexpected twists and turns.\n\nBen Affleck well known for his mesmerizing and naturalistic performances, this cinematic genius is well perfect when it also comes to the work behind the screen, he proved himself to be the good director by presenting his first movie as a director in very mastery way, this movie is to be specially appreciated for its curious and particularly much naturalistic presentation, we never find any kind of over or exaggerated performance by any of the actors, Casey Affleck as a private detective Patrick Kenzie performed very well and he succeeds in beguiling the viewers with his ideal performance, Amy Ryan and Ed Harris are other two actors to be appreciated for executing their roles in perfect manner.\n\nTechnically this movie is well presented and could observe the brilliance in Cinematography, editing and especially the screenplay; such a beautiful mystery tale from an award winning screen writer really is like adding extra wining feather to his hat.",
            "review_date": "2015-11-15",
            "source": "rt"
        },
        {
            "content": "Ben Affleck's directorial debut Gone Baby Gone is one of my favorite mystery thrillers of all time. it is about Private investigator  Patrick Kenzie",
            "review_date": "2015-10-31",
            "source": "rt"
        },
        {
            "content": "Interesting, well done crime \"whodunit\". Good cast, great acting, interesting story with some very good twists and turns. But ultimately sad and depressing. The story of a child abduction, and how the detectives go about trying to solve it. Well done.",
            "review_date": "2015-10-23",
            "source": "rt"
        },
        {
            "content": "Excellent film throughout, though the ending is way overdone.",
            "review_date": "2015-10-18",
            "source": "rt"
        },
        {
            "content": "I'm probably in the severe minority on this one, however Gone Baby Gone feels like a futile exercise in cinema making. Ben Affleck, love him or hate him, makes his directorial debut with what should be a thunderous powerhouse of material. Instead its over bloated, unfocused and by the end, completely stupid. Gone Baby Gone is set in Boston, during the media frenzied investigation of an abducted 4 year old girl. Led by a chief of police, who can relate with the pain of losing a child, the Boston police force do all they can to find the missing girl. Not satisfied with their work however, the relatives of the child hire 2 youthful private investigators to work the underground sources, getting answers from the low lives or degenerates that wont speak to the police, mainly due to personal reasoning. What they find is a corrupt and twisted set of events, that lead to a finale which will have you laughing your teeth out, before slapping yourself across the face, as the film tries so desperately to find some form of reasoning in its own preposterous manner. With all that's going on here, the cast actually pull off some tremendous performances, Casey Affleck does his brother proud as the private investigator leading the case, Michelle Monoghan is wonderfully subtle, if not slightly under utilized, Morgan Freeman is Morgan Freeman and Ed Harris fire cracker, as the head investigator. Affleck's script is also, apart from on the foul mouthed, heavy side, brilliant, it has charm, whit, character and most notably feels real. This blend allows us to immerse ourselves with the characters and their surroundings, making the first hour of Gone Baby Gone, quite powerful and potentially something to be hailed as genius. The film takes a gritty and lifelike approach, much in the same vein as other independent movies, with a grainy and over the shoulder style of shooting, it adds an intensity and realism to the entire affair, sets look downtrodden and proceedings are well realized. Its around the half way mark that Gone Baby Gone, starts to crumble, there are a handful of reasons, the most prominent being the film has 4 endings. The first comes 50 minutes in, leaving us feel confused as to the remaining hour on the clock, you cannot help but feel something preposterous is about to unfold in front of you and boy does it get preposterous. The film then takes a huge U turn for its second ending, leaving you dazed and confused by the time you get to the final act. The story by the end of this film is so stupid and left field, it is impossible to even keep a straight face, never mind buy what Affleck is trying to achieve here. That's the problem with Gone Baby Gone, its lost, much like its subject matter, it has no idea where its going, what its doing or if it will ever return. The problem is that we the audience want to see this film succeed, I wanted to love this film, but its heavy handed message of the innocence of children and its unfocused 2nd half makes it impossible to recommend on a serious level. Great performances, strong visuals, a blinding score by Harry Gregson Williams, but everything else is just forgettable.",
            "review_date": "2015-10-11",
            "source": "rt"
        },
        {
            "content": "Not as great as I expected it to be, but maybe that's just due to me having just finished the book and thus the film being devoid of the punch that it delivers for me.",
            "review_date": "2015-10-09",
            "source": "rt"
        },
        {
            "content": "A promising mystery, until the HORRIBLE ending.",
            "review_date": "2015-10-08",
            "source": "rt"
        },
        {
            "content": "Good story but its all dwindled.",
            "review_date": "2015-09-27",
            "source": "rt"
        },
        {
            "content": "Gone Baby Gone is a well-directed, well-acted and emotionally complex film. It's not an easy movie to watch, but it presents its gritty reality in a way that makes it hard to look away. The actors, especially Amy Ryan, disappear into their roles and heighten the sense of realism. The film also brings up some interesting moral dilemmas that are sure to be a catalyst for conversation. Well done, Ben Affleck.",
            "review_date": "2015-09-17",
            "source": "rt"
        },
        {
            "content": "What initially seems to be a by the numbers detective mystery soon unraveled into a ripping yarn full of twists and turns. Cassey Affleck takes the lead in an understated way, perfectly portraying the young protagonist. He draws from his co-stars, all of whom give career defining performances and uses their skills to push himself. This is enhanced by Ben Affleck's captaincy, he guides the film with an obvious passion for its subject and portrayal. Drawing from his love of Boston and its people, giving the viewer a picture of this city not often seen. He directs the story with a certainty and steady hand that holds the mystery, only revealing information as the hero understands it himself.\nThus Gone Baby Gone becomes a near unique movie within the current age of Hollywood drivel.",
            "review_date": "2015-09-04",
            "source": "rt"
        },
        {
            "content": "What initially seems to be a by the numbers detective mystery soon unraveled into a ripping yarn full of twists and turns. Cassey Affleck takes the lead in an understated way, perfectly portraying the young protagonist. He draws from his co-stars, all of whom give career defining performances and uses their skills to push himself. This is enhanced by Ben Affleck's captaincy, he guides the film with an obvious passion for its subject and portrayal. Drawing from his love of Boston and its people, giving the viewer a picture of this city not often seen. He directs the story with a certainty and steady hand that holds the mystery, only revealing information as the hero understands it himself.\nThus Gone Baby Gone becomes a near unique movie within the current age of Hollywood drivel.",
            "review_date": "2015-09-04",
            "source": "rt"
        },
        {
            "content": "In a town ensnared by twisted, moral consequences, a haunted detective unwinds the costly truth that \"the ends never justifies the means.\"",
            "review_date": "2015-08-30",
            "source": "rt"
        },
        {
            "content": "the difference between right and wrong is not so black and white, there's a lot of gray areas. this puts morals to the test. one hand, you have a terrible mother who abuses drugs, neglects her child. other you have law enforcement and family members taking upon themselves to \"teach the mother a lesson\". what they wanted to do was probably justified, but their approach was completely off. in the end, the truth comes out and no one wins.",
            "review_date": "2015-08-28",
            "source": "rt"
        },
        {
            "content": "Awesome movie Ben Affleck proved in his first seat in the directors chair to tell awesome story. Great crime drama also had good message what would you do.",
            "review_date": "2015-08-18",
            "source": "rt"
        },
        {
            "content": "Ben affleck's directorial debut was great this movie is so great its well acted well directed and amazingly written dialogue is so good. But i have only one problem with this movie and that is,that it has some draggy parts but overall this movie is great visually and Ben affleck is best at capturing realism this movie as all of his movies feel so real.",
            "review_date": "2015-08-17",
            "source": "rt"
        },
        {
            "content": "Casey Affleck is accompanied by a great cast that gives beautiful performances on this thriller that captures the attention of the viewer every time, although the resolution is quite simple.",
            "review_date": "2015-07-22",
            "source": "rt"
        },
        {
            "content": "A little slow to getting going but very good once it does.",
            "review_date": "2015-07-09",
            "source": "rt"
        },
        {
            "content": "Hit on a lot of the main points from the novel!",
            "review_date": "2015-07-06",
            "source": "rt"
        },
        {
            "content": "Brilliant, dark, twisty. Stunning acting from Casey Affleck & Ed Harris. Not the kind of film I would watch again though.",
            "review_date": "2015-06-25",
            "source": "rt"
        },
        {
            "content": "Before his directorial dig for \"Argo\", Ben Affleck made his feature-length debut on the director's chair in this well-performed, excellent mystery noir that was very well written, which had led to a smart test question on the act of cynicism and what's right or wrong, even though it's hard with a figured-out twist and unappealing images and turnouts. (B+)\n\n(Full review coming soon - with better wording probably)",
            "review_date": "2015-06-24",
            "source": "rt"
        },
        {
            "content": "Considering it is Ben Affleck's  directorial debut it shows how good he would become. The twists in this movie are thought provoking and make you think about your own conscience.",
            "review_date": "2015-06-21",
            "source": "rt"
        },
        {
            "content": "Great movie. Very pleasantly surprised",
            "review_date": "2015-06-21",
            "source": "rt"
        },
        {
            "content": "Every parents nightmare, the kidnapping of your child! Ben Affleck does a great job of directing this flick. Just a note.....not all parents are fit to be a parent!",
            "review_date": "2015-06-17",
            "source": "rt"
        },
        {
            "content": "8/10\nBen Affleck's directorial debut is actually pretty great! The story is thrilling and intriguing, and the third act portrays a major sense of morality, giving the audience an understanding of both sides and struggle to decide which choice is the best. While the movie was very good, that third act really got me thinking!",
            "review_date": "2015-06-11",
            "source": "rt"
        },
        {
            "content": "There are several reasons to confuse this with Gone Girl, Affleck, the cover, the title, but while both are great films, this is a bit grittier. This is a clever story which keeps you guessing as it twists and turns all over the place. Good cast and well directed by Affleck who is quite an underrated director really.",
            "review_date": "2015-06-04",
            "source": "rt"
        },
        {
            "content": "I'll admit I was prejudging this film when I saw on the cover \"Ben Afflack\", so it sat here a while. What a great film. Great cast, great acting, great story, and great direction by aforementioned Afflack. Pacing was good for the plot. This film is a wonderful enigma. Not a warm fuzzy feeling film, though it was really, really well done which is always a good thing. Recommend.",
            "review_date": "2015-06-01",
            "source": "rt"
        },
        {
            "content": "Amazing and thought provoking . Ben Affleck's direction is well done ..truly epic",
            "review_date": "2015-05-13",
            "source": "rt"
        },
        {
            "content": "We have to redefine what's our moral obligations are. Brilliant craftsmanship by Ben.",
            "review_date": "2015-05-09",
            "source": "rt"
        },
        {
            "content": "Historia de crimen genialmente hilvanada y construída. Ben Affleck consigue un neo noir absorbente, con giros inesperados, dilemas morales, y actuaciones intensas de Casey Affleck, Ed Harris y Morgan Freeman.",
            "review_date": "2015-04-12",
            "source": "rt"
        },
        {
            "content": "a cop would never drink alcohol out of a brown bag outside a hospital",
            "review_date": "2015-04-02",
            "source": "rt"
        },
        {
            "content": "This is a brilliant work on moral choice and it's repercussions. Ben Affleck has shown what he's capable of coming out of a career lowering spell.",
            "review_date": "2015-03-30",
            "source": "rt"
        },
        {
            "content": "Ben Affleck's first directorial effort doesn't reach quite the superb levels of perfection that his later efforts do, but this suspenseful crime drama was a brilliant debut from one of the best directors in Hollywood today.",
            "review_date": "2015-03-22",
            "source": "rt"
        },
        {
            "content": "Undoubtedly an excellent crime thriller, this movie has the right amount of suspance that keeps you right there.\nBen Affleck demonstrates that he's still got a lot to give.",
            "review_date": "2015-03-15",
            "source": "rt"
        },
        {
            "content": "What a complete waste, this movie",
            "review_date": "2015-03-05",
            "source": "rt"
        },
        {
            "content": "one of the best directorial debuts, and the best of Affleck's efforts so far.",
            "review_date": "2015-02-19",
            "source": "rt"
        },
        {
            "content": "such a strong cast make this a really good film really enjoyed this and will watch again",
            "review_date": "2015-02-11",
            "source": "rt"
        },
        {
            "content": "Ben Affleck's directorial debut is a good one. Its not my favorite crime drama but it is a very very good one. Casey Affleck and Ed Harris along with Morgan Freeman lead this movie through its mystery of trying to find a woman's niece. The suspense is there all throughout it and it is a very impressive debut",
            "review_date": "2015-01-25",
            "source": "rt"
        },
        {
            "content": "Casey Affleck's acting really made the movie for me.",
            "review_date": "2015-01-25",
            "source": "rt"
        },
        {
            "content": "Ben Affleck's Regiedebüt ist ein klasse Krimi-Drama mit einer packenden & teilweise deprimierenden Geschichte und einer Riege altbewährter Schauspieler, die auch hier ihr opulentes Talent zur Schau stellen (darunter Ed Harris, Morgan Freeman & Mark Margolis). Die Story ist packend inszeniert und die Wendungen sind nicht zu vorhersehbar. Alles in einem bietet der Film spannende Unterhaltung. Einziges Manko: leider verblasst die etwas eintönige Performance des Hauptdarstellers Casey Affleck, dem Bruder des Regisseurs (ein Hoch auf Vetternwirtschaft!), neben dem Rest des Casts. Achtung! Wer Kinder hat läuft Gefahr sich einem Trauma auszusetzen!",
            "review_date": "2015-01-20",
            "source": "rt"
        },
        {
            "content": "I am in no way a fan of either of the Affleck brothers but Gone, Baby, Gone is rare and welcome departure from their regular standard of work. In the line of great cop thrillers like The Departed, Affleck creates a film of great tension, excellent twists and powerful moral dilemmas. A well crafted work throughout.",
            "review_date": "2015-01-19",
            "source": "rt"
        },
        {
            "content": "At his first work behind the camera Ben Affleck proves his talent with this thriller that also wants to denounce what is the \"real \" Boston.",
            "review_date": "2015-01-18",
            "source": "rt"
        },
        {
            "content": "Not bad. It feels real. It keeps you wanting more till the end because it never quite seems resolved. Good acting by all involved. It also shows that all things considered, it's not always easy to make the right decision, and even then, it's not always good.",
            "review_date": "2015-01-11",
            "source": "rt"
        },
        {
            "content": "Apart from the opening sequence, compelling film with lots of food for thought> What would you have done?",
            "review_date": "2015-01-09",
            "source": "rt"
        },
        {
            "content": "Good film, well acted and a good twist. Worth a watch",
            "review_date": "2015-01-03",
            "source": "rt"
        },
        {
            "content": "Where was this version of Ben Affleck in the years between Good Will Hunting and Gone Baby Gone? As the years hence have unfolded, we sure are glad he's stayed.\n\nThanks to top-notch performances from a stellar cast, Gone Baby Gone is a thriller that, quite rightly, doesn't play out the way you expect yet rewards the viewer in the end. Casey Affleck shows he's not just the forgotten younger brother, as a tough guy with a good heart as Patrick Kenzie. Ed Harris and Morgan Freeman play their parts as we expect them to at this late stage of their careers. With tight dialogue and a good sense of pacing, the film transpires quickly.\n\nThe craftsmanship involved in weaving a story like this needs to be noted, and again we find Ben Affleck as the reason behind it. The thought-provoking and challenging decision faced by Casey Affleck's character is one of deep moral consequence, and not the kind you would expect from a movie of this ilk.  \n\nHaving seen the elder Affleck's other two directorial stints to date, I can attest to his rise in the ranks of Hollywood's filmmaking elite. With more movies to make, as well as his acting career still in high gear, we look forward to what Affleck still has left to show.",
            "review_date": "2015-01-01",
            "source": "rt"
        },
        {
            "content": "Ben Affleck's directional debut it's a great thriller and also a great drama. Affleck's direction is really nice, and it gives the movie it's personality. The acting couldn't get better, and with this cast, it's no surprise. The movie actually has some clichés and flaws but the experience it's so great that it doesn't matter.",
            "review_date": "2014-12-12",
            "source": "rt"
        },
        {
            "content": "Saw this when it was released theatrically but just re-watched today. Solid drama/thriller with some very good performances.",
            "review_date": "2014-12-07",
            "source": "rt"
        },
        {
            "content": "This movie remains incredibly moving and relevant even after the 10th view. It portrays its characters amazingly and has very good performances all-round.",
            "review_date": "2014-12-03",
            "source": "rt"
        },
        {
            "content": "a great cinema masterpiece.",
            "review_date": "2014-11-22",
            "source": "rt"
        },
        {
            "content": "This was a really good film, fueled by a top notch cast.  I really liked the grittiness of the Boston area crime film, and the mystery behind the disappearance of a girl.\nIt has element of a good crime movie.  \nGritty hard nosed cast, public outcries, and overall mystery trying to figure out what happened.\nIt builds up pretty nicely, to a payoff that I thought would be a little better.  I like all the scenes, but for some reason I thought the ending would be better.  I liked act 1 better than act 2.",
            "review_date": "2014-11-22",
            "source": "rt"
        },
        {
            "content": "Ben Affleck's Gone Baby Gone is a thrilling and entertaining drama.",
            "review_date": "2014-11-20",
            "source": "rt"
        },
        {
            "content": "Very good and riveting story, about how sometimes the truth is not always the answer we were looking for. Very well directed by Ben Affleck, and an equally great cast. \n~November 15, 2014~",
            "review_date": "2014-11-15",
            "source": "rt"
        },
        {
            "content": "I just can't get past the SHITTY, Boston accents!!!",
            "review_date": "2014-11-15",
            "source": "rt"
        },
        {
            "content": "hard movie to digest (due to subject matter) perfectly crafted from direction, acting and writing",
            "review_date": "2014-11-10",
            "source": "rt"
        },
        {
            "content": "A surprisingly good thriller. The Affleck brothers should work more often together.The only thing I disliked it was how Angie left Patrcik for such a stupid thing. She obviously didn't love him.",
            "review_date": "2014-11-05",
            "source": "rt"
        },
        {
            "content": "This is a haunting and riveting masterpiece with some terrific acting,a brilliant score and some great direction.The story was very well done and all the actors did a phenomenal job.Overall Gone Baby Gone is a emotional powerful film that benefits from great performances,brilliant writing and some amazing direction.\nGrade A+",
            "review_date": "2014-10-27",
            "source": "rt"
        },
        {
            "content": "really good movie !!!",
            "review_date": "2014-10-25",
            "source": "rt"
        },
        {
            "content": "Um...if you shoot a child molester in the back of the head you will be charged with murder....",
            "review_date": "2014-10-24",
            "source": "rt"
        },
        {
            "content": "Good twisty turney story delivered by a solid cast. Competent direction keeps the story moving forward but doesnt speed through details.",
            "review_date": "2014-10-05",
            "source": "rt"
        },
        {
            "content": "A smart, layered film that asks the difficult questions. But I can only take so many plot-twists.",
            "review_date": "2014-10-03",
            "source": "rt"
        },
        {
            "content": "Constantly engaging, even if it diminishes just a tad near the end. Fantastic casting and very well written.",
            "review_date": "2014-10-01",
            "source": "rt"
        },
        {
            "content": "\"when Corruption become a bliss.\"",
            "review_date": "2014-09-25",
            "source": "rt"
        },
        {
            "content": "Story: Based on Dennis Lehane's novel, Casey Affleck as Patrick Kenzie, a private investigator from working-class Boston who takes on a case involving a kidnapped girl. The girl's aunt begs Patrick to take the case because he has connections to criminal Boston that the police do not. He agrees and along with his partner, Angie Gennaro (Michelle Monaghan), they uncover a web of corruption that threatens the relationship between the two. Ed Harris and Morgan Freeman co-star as members of the Boston Police Department\n\nDirector: Say what you will about Affleck before this movie except a few good movie of his, the man is a fantastic Director and it show, he has a passion for everything he directs.\n\nCast\n\nCasey Affleck as Patrick Kenzie - Casey is fantastic in this movie he usually a supporting but in this hes the main actor, and he delivers\n\nMichelle Monaghan  as Angie Gennaro - she is great too she deserved the oscar nomination\n\nMorgan Freeman as Jack Doyle - I thought Freeman played a asshole but hes great, hell hes great in everything.\n\nEd Harris is also great\n\nOverall: this movie is great thriller, strong performances, just great overall\n\nOverall Grade: A+",
            "review_date": "2014-09-20",
            "source": "rt"
        },
        {
            "content": "Very capivating. realistic. great acting.",
            "review_date": "2014-09-07",
            "source": "rt"
        },
        {
            "content": "Completely gripping even though I'd read the book.  Having read the book, I thought Casey just seemed too young for the character, but he pulled it off with grace.  Amazingly cast and directed, would have like to have seen more of Michael Williams.",
            "review_date": "2014-09-05",
            "source": "rt"
        },
        {
            "content": "Interesting, twisty. I don't agree with what he did. I don't think.",
            "review_date": "2014-08-30",
            "source": "rt"
        },
        {
            "content": "Just doesn't ring true..... multiple miscasts, and the story is egregiously non-sensical as it pertains to certain characters' actions.",
            "review_date": "2014-08-26",
            "source": "rt"
        },
        {
            "content": "Ben Affleck is strong behind the camera in his debt with excellent performances",
            "review_date": "2014-08-21",
            "source": "rt"
        },
        {
            "content": "Strong performances for a very strong directorial debut. While all the characters get to show their brass it's the director who shines his own light. This film will keep you constantly intwined in it's grasp with it's gripping story. Makes you think, makes you feel, and most of all respects any knowledgable film goer.",
            "review_date": "2014-08-19",
            "source": "rt"
        },
        {
            "content": "This movie did what it set out to do well.  It has a good story, and it's filled with excellent actors.  It gets straight to the point, and it does a really good job of keeping you interested.   There is lots of swearing, and talk about drugs and what's right and what isn't.  It has a little bit of everything in it, detective work, drugs, and action, and does them all in hope of saving a child.  Some scenes are disturbing, with the baby girl falling off the cliff, and the murdered little boy in the bath tub.  In the end figuring out that one of the detective cops were involved in the stealing of the child was kinda disappointing, because I think it would have been better if it had been a real case instead of an expected plot twist like every other movie does.  But the very end is good, with controversy to what should have been done, because both options to what they could have done had their reasons, but he chose what was right, even if it wasn't what would have better benefitted the child.  But it was a good movie nonetheless, that never gave away enough hints for the audience to figure it out for themselves.",
            "review_date": "2014-08-17",
            "source": "rt"
        },
        {
            "content": "Simply brilliant. And depressing.",
            "review_date": "2014-08-13",
            "source": "rt"
        },
        {
            "content": "Grade - B-\nA gripping time at the movies. 'Gone Baby Gone' is a brilliantly told story, and a great debut by Ben Affleck as a filmmaker. It's not perfect, with a slow start and for the most part a visually uninspired look, but it gets the storytelling and the script locked down, which in a movie like this is most important thing.",
            "review_date": "2014-08-07",
            "source": "rt"
        },
        {
            "content": "Gone Baby Gone is an exceptionally good thriller with many twists and turns and excellent performances. Dennis Lehane books have always churned out good movies and this one is no exception. It takes many elements from the book, including its statements about corruption and the influence of urban life on working-class families.",
            "review_date": "2014-08-04",
            "source": "rt"
        },
        {
            "content": "Powerfully acted and a naturally tension driven screenplay is what makes this Affleck thriller a wonderful watch. \"Gone Baby Gone\" is a thoughtful execution of a natural tension to take shape rather than cranking up artificial tension in the narrative- something that Ben Affleck is getting better and better in every movie. This particular film features buoyed performances from Casey Affleck as the story's lead and ably supported by an overall wonderful cast. The story is often reflective despite all the mystery surrounding the plot - something which extends the film's journey more than just another thriller. Wonderfully shot and nicely scored , this film is quite powerful.",
            "review_date": "2014-08-04",
            "source": "rt"
        },
        {
            "content": "A gritty, hard-hitting film about real-life choices and trying to do what's best for the ones you love versus doing what's right... The characters are well-developed, the plot is unpredictable, and the dialogue is realistic. Very well done.",
            "review_date": "2014-07-26",
            "source": "rt"
        },
        {
            "content": "Gone Baby Gone is a gritty taste of reality and moral dilemna. I like that there are twists and the writers keep it tight and believable, unfolding the truth bit by bit as we can handle it. Casting is great, love Ed Harris as always. Amy Ryan is brilliant as is Casey Affleck. It's not a feel-good formula movie, which is nice now and then, but it is high on my list of all-time great dramas.",
            "review_date": "2014-07-18",
            "source": "rt"
        },
        {
            "content": "ben affleck's place is in the edirector' seat",
            "review_date": "2014-07-03",
            "source": "rt"
        },
        {
            "content": "very good but utterly depressing",
            "review_date": "2014-06-24",
            "source": "rt"
        },
        {
            "content": "The story is about a young girl is kidnapped in the Boston area which stretches two detectives professional and home lives to the brink. Based on a novel. This movie has fantastic directing and the acting is brilliant as well.",
            "review_date": "2014-06-24",
            "source": "rt"
        },
        {
            "content": "Very, very well made film with a very good story. Lots of twists, turns, and unexpected quandaries. A brilliant crime thriller.",
            "review_date": "2014-06-22",
            "source": "rt"
        },
        {
            "content": "Las leves fallas del guion son compensadas por  el desempeño del reparto.",
            "review_date": "2014-06-15",
            "source": "rt"
        },
        {
            "content": "Delves deeply into themes of guilt, God, murder, and family.  Realistically depicts inner-city conditions and citizens.  Touching, truthful, and insightful, \"Gone Baby Gone\" will make you think about things you never knew it could.",
            "review_date": "2014-06-15",
            "source": "rt"
        },
        {
            "content": "http://filmesylibros.blogspot.mx/2014/06/gone-baby-gone.html",
            "review_date": "2014-06-12",
            "source": "rt"
        },
        {
            "content": "Wow, never mind a twist at the end!",
            "review_date": "2014-05-31",
            "source": "rt"
        },
        {
            "content": "A captivating who-dun-it that questions the axiom, \"It takes a village to raise a child.\" Characters aren't thickly drawn and intentions are messy but end up spelling themselves out in the end.",
            "review_date": "2014-05-15",
            "source": "rt"
        },
        {
            "content": "After suffering from a crop field of mediocre movies, Ben Affleck directs this greatly made movie and goes into the tunnel to a brighter future for his career (If Batman vs Superman doesn't stink)",
            "review_date": "2014-05-03",
            "source": "rt"
        },
        {
            "content": "Very clint eastwoodish, reminds me of Mystic river for some reason.",
            "review_date": "2014-04-30",
            "source": "rt"
        },
        {
            "content": "Excelentemente actuada, entretenida, interesante, Ben Affleck es lo maximo como Director.",
            "review_date": "2014-04-19",
            "source": "rt"
        },
        {
            "content": "Great movie, with excellent script and screenplay.",
            "review_date": "2014-04-06",
            "source": "rt"
        },
        {
            "content": "Sucks you in, plenty of twists and turns, really enjoyed it",
            "review_date": "2014-03-31",
            "source": "rt"
        },
        {
            "content": "Few directors could hope to achieve in their career what Ben Affleck has achieved in his directorial debut. A beautiful script that could only have come from the writer of Good Will Hunting, sensational performances from the entire cast (with extra credit to Amy Ryan, Casey Affleck and Ed Harris) and world class direction from one of the most up-and-coming directors of our time. I was absolutely spellbound.",
            "review_date": "2014-03-30",
            "source": "rt"
        },
        {
            "content": "An intense and morally complex thriller with amazing performances all round",
            "review_date": "2014-03-23",
            "source": "rt"
        },
        {
            "content": "Ben Affleck best film ....yes its better than the town and argo in my opinion",
            "review_date": "2014-03-19",
            "source": "rt"
        },
        {
            "content": "Ben Affleck best film ....yes its better than the town and argo in my opinion",
            "review_date": "2014-03-19",
            "source": "rt"
        },
        {
            "content": "Affleck's maiden direction of taking his movie from down under to its zenith is amusing, however, the script lacks powerful dialogues and charming characters. The outcome of morality and justice is very much ambiguous at the end, which adds an unforgettable panache to the whole story.",
            "review_date": "2014-03-10",
            "source": "rt"
        },
        {
            "content": "This is a gripping, very dark, well acted film. Set in Boston, the story is exceptionally well directed by Ben Affleck, in his directorial debut. Amy Ryan, Amy Madigan & Casey Affleck are the the strongest among a fantastic cast. Casey Affleck is a private investigator hired along with his girlfriend/partner, to find an abducted child. Nothing really is as it seems. Plot twists & surprises around various turns of the film. It's well written, well directed & well acted. It's a very dark film, but if you don't mind some darkness, watch this movie!",
            "review_date": "2014-03-09",
            "source": "rt"
        },
        {
            "content": "Solid. That is the first word that comes to mind when thinking of this movie. Sold performances and work all around. The cast, fantastic. The script, extremely tight. The directing, top notch. Ben Affleck has really proven that he knows what he is doing behind the camera. Only three directing credits to his name and they have all been great hits. What I like about his films is that the characters seem very real and believable. Casey Affleck gives a great performance along with Ed Harris, Amy Ryan, Michelle Monaghan and others. All seem like real people and not just characters that were written for a story. As for the story, nothing is extremely new or groundbreaking, it's just a well-told, intriguing, \"solid\" story. If you are looking for a crime mystery story that is easy to follow and well made, then Gone Baby Gone is a great choice!",
            "review_date": "2014-03-08",
            "source": "rt"
        },
        {
            "content": "Compelling enough to probably earn a re-watch, Though I didn't really buy the ending - 8.5/10",
            "review_date": "2014-03-08",
            "source": "rt"
        },
        {
            "content": "A dark story involving difficult to swallow topics such as molestation and child kidnapping. A strong directoral debut by Ben Affleck.",
            "review_date": "2014-03-02",
            "source": "rt"
        },
        {
            "content": "Awesome and engaging!",
            "review_date": "2014-02-27",
            "source": "rt"
        },
        {
            "content": "good cop mystery suspencer",
            "review_date": "2014-02-25",
            "source": "rt"
        },
        {
            "content": "Very powerful and moving film!! It kept me engaged for the entire 2 hours and just when I thought it was over it would hit you with yet another of many twists that you will truly not see coming! Absolutely fantastic film!!",
            "review_date": "2014-02-23",
            "source": "rt"
        },
        {
            "content": "dark, disturbing but memorable.",
            "review_date": "2014-02-18",
            "source": "rt"
        },
        {
            "content": "Wow what a great suspenseful movie",
            "review_date": "2014-02-18",
            "source": "rt"
        },
        {
            "content": "A gripping and thought provoking cop drama with fascinating characters and a carefully woven plot. The twists are surprising and rewarding, and the acting is great.",
            "review_date": "2014-02-16",
            "source": "rt"
        },
        {
            "content": "Well made but not all that interesting. I thought the performances definitely could have been better considering how heavy the movie itself was, but it was directed exceptionally by Ben Affleck. He definitely improved a lot on The Town and Argo though.",
            "review_date": "2014-02-10",
            "source": "rt"
        },
        {
            "content": "Gone Baby Gone is an enjoyable film with a good cast. I felt the story was weak in places but overall a good flick. I give this movie 3 stars.",
            "review_date": "2014-02-10",
            "source": "rt"
        },
        {
            "content": "A film that lives in the gray lines. It's dark, sad, disturbing and depressing but it's superbly acted (especially by Casey Affleck) and it's pretty gripping at the best of times.A story about an investigation that pushes two private detectives to their limits, and leads them to discover what they will ultimately stand for and how far they would go to do the \"right\" thing.",
            "review_date": "2014-02-03",
            "source": "rt"
        },
        {
            "content": "A top notch film with a difficult moral question which it doesn't shy away from. \nThis was Ben Affleck's first film as director and he started off brilliantly, before lifting even more with The Town and then Argo. \nGone Baby Gone is dark and edgy, but very human and the performances from the whole cast keep the film feeling very real.\nThe ending is not an easy one, leaving the audience to debate what the right thing to do is. What I think is very good about it though, is that when the decision is made, whilst you may or may not agree with what Casey Affleck's character chose to do, what you do see, is him take responsibility for his decision. Really, that seems to me to be the core of this story, taking responsibility, which these days, is a lost personality trait. \nAffleck could well become a bigger film name as a director than an actor, but only time will tell.",
            "review_date": "2014-01-27",
            "source": "rt"
        },
        {
            "content": "An engaging police procedural that isn't just skin deep. Its questions of morality aren't answered, but rather left for the viewers to decide for themselves.",
            "review_date": "2014-01-26",
            "source": "rt"
        },
        {
            "content": "After watching the town, argo and gone baby gone it can be said that ben affleck movies gets you an adrenaline rush.He never let his audience yawn for a second and keeps them intact till the end of the movie. \nThis movie is definitely good but would have been excellent if Ben would have acted himself.",
            "review_date": "2014-01-23",
            "source": "rt"
        },
        {
            "content": "intense and riveting. Ben Affleck shows that why is he not only a good actor but also a very good director.",
            "review_date": "2014-01-22",
            "source": "rt"
        },
        {
            "content": "For a directorial debut gone baby gone is a fantastic start for Ben affleck in his amazing directing career, while it might be his weakest movie he's directed that's really impressive as this is a great film. The performances are excellent, it's tense, atmospheric and overall fantastic. Grade A-",
            "review_date": "2014-01-21",
            "source": "rt"
        },
        {
            "content": "It starts out slowly, but once Gone Baby Gone builds up steam, it becomes a nice crime drama full of good performances, a gripping story, and phenomenal direction from first time director Ben Affleck.\r\n\r\n--FULL REVIEW TO COME--",
            "review_date": "2014-01-12",
            "source": "rt"
        },
        {
            "content": "Whilst offering a fairly strong debut for director, Bem Affleck, and coaxing a brilliant performance out of his younger brother, Casey, this a severely flawed and at times, poorly written, thriller. Still, despite its weaknesses, it is still more than watchable",
            "review_date": "2013-12-30",
            "source": "rt"
        },
        {
            "content": "Tidy little mystery thriller from Ben Affleck, and a great vehicle for sibling Casey. To comment on plot would be a disservice to potential viewers but it has a very 70's vibe in terms of characterisation, staging and cinematography. Affleck is an old school filmmaker and this is a great debut feature from a much maligned star- reaffirming himself as someone to keep an eye on.",
            "review_date": "2013-12-30",
            "source": "rt"
        },
        {
            "content": "My Favorite Film Is 1941's Citizen Kane.",
            "review_date": "2013-12-27",
            "source": "rt"
        },
        {
            "content": "Ben Affleck is as good of a director as any. He puts together a Boston cop/kidnapping movie that you'll have to watch again to fully grasp what you just endured. Ben also showed what boston not only means to him, but how the city thrives in the confines of poverty and community. \n\nGrade A filmmaking and acting from one of my favorites, Casey Affleck. \n\nA",
            "review_date": "2013-12-26",
            "source": "rt"
        },
        {
            "content": "Ben Affleck's directorial debut, quite enjoyable thriller with police as well as private detectives searching for a 4-year-old kidnapped girl Amanda. While police can not progress with sufficient pace, the 2 young detectives detectives (a couple) find pieces of puzzle which leads to a big moral dilemma in a grand final.",
            "review_date": "2013-12-22",
            "source": "rt"
        },
        {
            "content": "This movie ending lets us to think not only about it, but also in our world is there things like it.",
            "review_date": "2013-12-21",
            "source": "rt"
        },
        {
            "content": "Gone Baby Gone is trully a masterpiece.\nGreat story by Dennis Lehane,\nand great directing by Ben Affleck (it's even better than Argo).\nWhat seem to be like a B-class movie turned into something that must not be missed by mystery movie fans....\ntons of twists and thrills, concluded in such a dramatic ending.\nLove Ed Harris and Morgan Freeman.",
            "review_date": "2013-12-19",
            "source": "rt"
        },
        {
            "content": "Hats off to Ben Affleck. Director & actors were on their \"A\" game.",
            "review_date": "2013-12-16",
            "source": "rt"
        },
        {
            "content": "In Ben Affleck's Gone Baby Gone, a small girl is kidnaped one night so the girl's uncle and aunt hire Patrick Kenzie (Casey Affleck) and Angie Gennaro (Michelle Monaghan) to investigate after the police proves them selves useless. The story in the movie is completely amazing with fantastic performances from everybody, you feel sorry for the family and really want Patrick to find the girl but things get complicated for him after a couple of events. The movie has some shaky cam in parts but that is just a minor complaint because this is a fantastic movie which shows Ben Affleck is a fantastic director.\n5/5",
            "review_date": "2013-12-15",
            "source": "rt"
        },
        {
            "content": "Vreemde film die me toch met een aantal ongemakkelijke vragen achterlaat.",
            "review_date": "2013-12-15",
            "source": "rt"
        },
        {
            "content": "Affleck is definitely a great director. He found out his real gift. He made all the cast to bring us their best performance, the light is great too, the use of the camera is excellent and the movie is really good!",
            "review_date": "2013-12-06",
            "source": "rt"
        },
        {
            "content": "Although it is sometimes uncomfortably grimy and undeniably flawed, Gone Baby Gone is an absorbing, well-acted crime drama that proves to be an impressive debut for Ben Affleck as a director.",
            "review_date": "2013-12-01",
            "source": "rt"
        },
        {
            "content": "Très intense. L'intrigue mise en place fonctionne solidement. Les revirements sont étonnants et déchirants. Ce film de Ben Affleck est de loin une plus grande oeuvre que Argo.... Du très bon cinéma.",
            "review_date": "2013-11-30",
            "source": "rt"
        },
        {
            "content": "I'm morally conflicted after watching this great movie. If I feel something after watching a movie, it's gotta be pretty good.",
            "review_date": "2013-11-28",
            "source": "rt"
        },
        {
            "content": "\"Gone Baby Gone\" brings to the table some excellent performances, including Ed Harris and Casey Affleck, however a somewhat lackluster story with a been there done that feel to it. The twists do not pack the emotional punch the film wishes it would give due to convoluted story telling and weak character development. In the end Ben Affleck's directorial debut is certainly a good film, just not a fantastic one compared to his future films such as \"The Town\", and \"Argo\".",
            "review_date": "2013-11-27",
            "source": "rt"
        },
        {
            "content": "Gone Baby Gone, serving as Ben Affleck's debut as a director, proves that he has a much stronger talent in directing films than he is at starring in them.\n\nGone Baby Gone is a suburban thriller directed right. It doesn't succumb to melodrama or a lack of originality, but instead actually harnesses the strong elements of these themes and turns Gone Baby Gone into a surprising and strongly dramatic thriller which has a rich direction, sufficient script and powerful cast which is enough to deal justice to Dennis LeHane's novel.\nThe talent of the Affleck brothers is on full display in Gone Baby Gone, because Ben Affleck's dedication to directing Gone Baby Gone and ensuring it has a sufficiently strong screenplay for its actors to work with, and it includes the strong technical of powerhouse editing, strong cinematography and a strong atmosphere helped by a great musical score. Ben Affleck shows much promise as a filmmaker in Gone Baby Gone and puts all his experience on display. He leads narrative very strongly.\nAnd his brother, Casey Affleck provides a strongly charismatic lead which is so powerful that it defies anyone's theory that nepotism could be the case for his casting. His emotional articulation and dramatic line delivery construes a strong lead for Gone Baby Gone and ensures that the emotional intensity of the story is consistently held aloft by his strong and natural talent as an actor.\nBut Amy Ryan is the standout. Even though I will always remember her more for portraying Holly Flax in The Office, she supplies excellent dramatic heft to her part in Gone Baby Gone through her intense facial gestures and effortful lining delivery, mixed with her ability to articulate befitting emotions to the scene so that it may fit the context greatly. \nMichelle Monaghan supplied some some powerful work too, as did Ed Harris. But really Morgan Freeman overshadowed them both with his small role that benefited from his powerfully meaningful line delivery and emotional efforts usually reserved for a monologue, yet put on show for a brief time so audiences may examine the kind of powerful acting he can achieve within a very short timespan and remember how he is such an acclaimed actor who recently earned an Academy Award for his role in Million Dollar Baby.\n\nSo Gone Baby Gone is a powerfully acted and meaningful thriller which overshadows its simplicities.",
            "review_date": "2013-11-24",
            "source": "rt"
        },
        {
            "content": "K C is a great actor",
            "review_date": "2013-11-17",
            "source": "rt"
        },
        {
            "content": "A  beautifully and realistically shot Boston provides the setting for Gone Baby Gone, a crime drama that includes a thought provoking climax about parenting and the protection of childhood that works its way through your mind for days after.  Ben Affleck was a perfect fit to direct the film displaying an understanding of the people and atmosphere of Boston neighborhoods.",
            "review_date": "2013-11-02",
            "source": "rt"
        },
        {
            "content": "A morally-challenging Bostonian crime film that features both the Afflecks at their best.",
            "review_date": "2013-10-31",
            "source": "rt"
        },
        {
            "content": "A great movie that's well directed and has an excellent, creative, and interesting plot. However, it's not a very satisfying movie (which is OK - it's good it breaks the norm). The acting is very good. Overall, definitely five stars, an excellent thriller, and very great.",
            "review_date": "2013-10-25",
            "source": "rt"
        },
        {
            "content": "Ben Affleck is probably a better director than he Is an actor. This is Well worth a watch.",
            "review_date": "2013-10-16",
            "source": "rt"
        },
        {
            "content": "Utterly impressive work. Gone Baby Gone is dense and provocative, constantly building a believable reality, which is what makes it so daunting and ultimately entrapping.",
            "review_date": "2013-10-09",
            "source": "rt"
        },
        {
            "content": "While Casey undoubtedly received all the acting talent, Ben sure knows how to make a movie. Damn!",
            "review_date": "2013-10-07",
            "source": "rt"
        },
        {
            "content": "An unconventional investigation.",
            "review_date": "2013-09-22",
            "source": "rt"
        },
        {
            "content": "Just when I thought I figured out the story the plot took a twist. Fantastic storytelling about beliefs and some stick to them optimistically. Good stuff from the Afflecks.",
            "review_date": "2013-09-16",
            "source": "rt"
        },
        {
            "content": "Differed from the book too much...",
            "review_date": "2013-09-13",
            "source": "rt"
        },
        {
            "content": "Not what I was expecting but the ending was decent",
            "review_date": "2013-09-12",
            "source": "rt"
        },
        {
            "content": "Gritty, realistic and heartbreaking, Ben Afflecks directorial debut pulls no punches and works well.",
            "review_date": "2013-09-05",
            "source": "rt"
        },
        {
            "content": "Gone Baby Gone starts off with promise of a kidnapping thriller that stays grounded in reality. But the second half's focus on confusing plot twists and its bland lead character make this film feel more like a \"crime of the week\" tv drama than a film with real emotional weight.",
            "review_date": "2013-08-29",
            "source": "rt"
        },
        {
            "content": "First movie I've seen directed by Ben Affleck... And it was good... Very suspenseful... Dramatic abs at time scary... I'm really looking forward to seeing some of the other movies he has directed,  also got to say great acting,  and Casey Affleck is amazing here...",
            "review_date": "2013-08-29",
            "source": "rt"
        },
        {
            "content": "A masterpiece. A perfect crime thriller that manages to keep surprising you.  Shows maturity the genre rarely is allowed to. SEE THIS MOVIE.",
            "review_date": "2013-08-28",
            "source": "rt"
        },
        {
            "content": "Amazing. Smart. Now one of my all time favorites.",
            "review_date": "2013-08-27",
            "source": "rt"
        },
        {
            "content": "Loses some credibility after the \"big reveal\", but otherwise a well-made movie.",
            "review_date": "2013-08-27",
            "source": "rt"
        },
        {
            "content": "overrated, boring.  no wonder it didn't do all that well",
            "review_date": "2013-08-26",
            "source": "rt"
        },
        {
            "content": "second in the Ben Affleck-directed film power rankings behind Argo. A wonderful capturing of Lehane. Ahead of Shutter Island and Mystic River.",
            "review_date": "2013-08-21",
            "source": "rt"
        },
        {
            "content": "i hate this movie, i hate the story, i hate the ending, i hate what it said: people dont change. SO TRUE. watch this movie, you should.",
            "review_date": "2013-08-21",
            "source": "rt"
        },
        {
            "content": "Great movie. I just thought there were too many characters and the plot was confusing. But other than that, it was great. The story and theme were well-created and the movie has fine acting. I really liked it.",
            "review_date": "2013-08-18",
            "source": "rt"
        },
        {
            "content": "A morality play that is deeply unsettling and brilliantly directed, Gone Baby Gone is a genius work that will bother you for a long time.",
            "review_date": "2013-08-17",
            "source": "rt"
        },
        {
            "content": "Ben Affleck's \"Gone Baby Gone\" is a well-made mystery that keeps you guessing until its final moments. The movie is eerily grounded in reality and features some strong performances. The movie is slower paced, and I think it is the weakest of Affleck's directorial efforts, but that in no way means it is a bad film. I simply just found more enjoyment in \"The Town\" and \"Argo.\" The way the film ends is so morally complex that I genuinely couldn't decide if the right decision was made. The film blurs the lines between what is right and wrong and that is what stays with the viewer and has the biggest impact.",
            "review_date": "2013-08-10",
            "source": "rt"
        },
        {
            "content": "A chillingly real film which is masterfully done by a unique story, great directing, and fantastic actors.",
            "review_date": "2013-08-03",
            "source": "rt"
        },
        {
            "content": "Argo is amazing. The Town was terrific. Gone Baby Gone is gripping, great and gloriously tense. I loved it. Affleck has really drawn a line in the sand and taken on a new life as a great director who has made three excellent movies in a row. This makes me excited to follow him further on his directorial journey. Gone Baby Gone is a crime film worth watching with great performances and a realistic edge that is missing from many films in the genre.",
            "review_date": "2013-07-23",
            "source": "rt"
        },
        {
            "content": "beautiful piece of cinema :)",
            "review_date": "2013-07-22",
            "source": "rt"
        },
        {
            "content": "This is a damn good movie.",
            "review_date": "2013-07-17",
            "source": "rt"
        },
        {
            "content": "I loved this movie!!! It is a sleeper if I ever saw one.  The acting is brilliant and Casey A. and Ed Harris were really great in this movie.",
            "review_date": "2013-07-15",
            "source": "rt"
        },
        {
            "content": "Ein raffinierter Entführungsthriller um ein Kind! Mit vielen moralischen Aspekten gespickt und von guten Darstellern gespielt! Die Rolle von Patrick Kenzie ist voll auf Casey Affleck zugeschnitten. Auch das Regiedebüt von Ben Affleck ist Klasse! Hier kann man sehen, dass er ein guter Erzähler ist! Schade nur, dass man nicht mehr aus den Schauspielern gepresst hat und es hat einige Überlängen!",
            "review_date": "2013-07-15",
            "source": "rt"
        },
        {
            "content": "I don't know if I should feel bad for thinking Pat's a jerk for doing the right thing. But oh well, amazing film.",
            "review_date": "2013-07-14",
            "source": "rt"
        },
        {
            "content": "I've never liked Ben Affleck. Nothing personal against the guy, its just that I've never actually seen any of his works that truly moved me. And then came this little gem. Ironically the acting chops go to his hugely underrated brother Casey. But what Ben does here is create a very realistic world with so much depth and realism you would think he was just retelling a past memory. Every shot is beautiful and obviously well calculated, which is the hallmark of a great director. \nAll in all, a must watch for those who love a good thriller and also for those who just love good movies. \n9/10",
            "review_date": "2013-07-12",
            "source": "rt"
        },
        {
            "content": "Casey Affleck's character doesn't reflect as a detective. I don't if his acting who ruined it or the character itself. So goes the plot also, the story doesn't know whether his advocacy is against cop corruption or the missing children. The ending is quite a joke also. Yes the mastermind is the nicest person in the movie, whatta big surprise.",
            "review_date": "2013-07-11",
            "source": "rt"
        },
        {
            "content": "Ben Affleck's directorial debut is a perfect crime thriller. Gripping and intense right from the start. The movie grabs you and never lets go. Keeps you guessing throughout. Casey Affleck is phenomenal as the p.i. trying to solve a kidnapping and facing moral dilemmas along the way. About as well made a film as you can make.",
            "review_date": "2013-07-08",
            "source": "rt"
        },
        {
            "content": "I did not see that coming",
            "review_date": "2013-07-07",
            "source": "rt"
        },
        {
            "content": "Casey Affleck is as good as Brando and the rest of this film's great cast are up there with him in a film that asks hard questions and doesn't come back with easy answers-- unlike much of what the film world offers.",
            "review_date": "2013-07-02",
            "source": "rt"
        },
        {
            "content": "My Rating: 4/5 stars; Grade: B+; Gesture: One Thumb Up; Status: Fairly Better (Fresh); Emoticon: :-).",
            "review_date": "2013-06-30",
            "source": "rt"
        },
        {
            "content": "One of those exceptional movies you only get to see every so often. Mesmerizing and spins the compass of morality.",
            "review_date": "2013-06-30",
            "source": "rt"
        },
        {
            "content": "Director Ben Affleck's first film he made is an authentic, intriguing, suspenseful masterpiece that proves that his directing talent is on the same level as Spielberg, Scorsese, and all the other great directors in cinema history.",
            "review_date": "2013-06-30",
            "source": "rt"
        },
        {
            "content": "74%\r\nOf the three Ben Affleck directed movies, this is my least favourite film, but I liked this one. The thing that I really hate about this film is it's shaky camera work. Other than that, this film is a lot different from the usual 'kidnap' related films that I have seen. The climax of this film was actually a shocker and it was eventually realistic.\r\nAs it moves to the last 20 minutes, the camera gets steady and the film in turn becomes watchable. This film does question the morality of an average person, but the film actually runs out of ideas in the early half of the second half and it sometimes isn't intelligent and logical as well. The acting involved is great, especially from Morgan Freeman.",
            "review_date": "2013-06-30",
            "source": "rt"
        },
        {
            "content": "Ben borde hålla sig till att regissera filmer 4/5",
            "review_date": "2013-06-20",
            "source": "rt"
        },
        {
            "content": "Before there was the Town, before there was Argo, this little film called Gone Baby Gone  shot into theaters way back in 2007. Ben Affleck directing? Really, that guy? That's what we all though. Now, in 2013, if you backpedal, you see how wrong we really were. Gone Baby Gone is a gripping crime drama, set in an authentic Boston, with strong performances.  Affleck & Monaghan are great in their leading man and woman roles, but it's the supporting cast that thrills. Ed Harris, Morgan Freeman, and especially Wire alum Amy Ryan. This is a top-notch movie that really put Affleck on the map, and allowed him to go on and create larger films. Even though you could argue that The Town and Argo are more technically proficient, better directed films, nothing compares to the raw power of Gone Baby Gone. This is still Affleck's best film.",
            "review_date": "2013-06-12",
            "source": "rt"
        },
        {
            "content": "Casey Affleck, hmm... it wasn't a bad performance for sure but it just wasn't right. Maybe some nepotism from Ben Affleck. Anyway this movie has a solid plot with mostly really good acting. The end was very interesting and thought provoking that made me glad I took the time to see this, but its not something I need to see again. Still a good job from Ben Affleck in his directing work.",
            "review_date": "2013-06-11",
            "source": "rt"
        },
        {
            "content": "In Gone Baby Gone, Ben Affleck handles a sensitive topic with just the right amount of restraint, veering dramatically satisfying results.",
            "review_date": "2013-06-09",
            "source": "rt"
        },
        {
            "content": "Dark, intense, superb.",
            "review_date": "2013-06-08",
            "source": "rt"
        },
        {
            "content": "I hate having expectations cause i'm usually left disappointed as i was with this movie.  Good idea for a storyline but a bit too slow pace to execute.  And what's with the crappy ending??",
            "review_date": "2013-06-07",
            "source": "rt"
        },
        {
            "content": "4/5  Very good stuff, although I am not sure if Casey was right for the lead.",
            "review_date": "2013-06-03",
            "source": "rt"
        },
        {
            "content": "Beautifully shot, a different view of Boston, even after the countless films shot in the urban areas of the city. The way it is written and filmed is very different from most movies of this generation. Aside from the commonly used narration, Boston attitude and help the community mentality, much of the movie gives a real life feel. Casey Affleck is persistent, not incredible but believable. The true realism of the movie is brought forward mostly by Amy Ryan. The guilt and emotional issues she displays is unavoidable. Her lack of emotions and hard spirit makes the audience grow more afraid for the missing child. She is the grit the movie needed that the novel was so successful at bringing to reality. This film is the underlining reason she should never be sold short or assumed to be only a comedic actress. The hardball \"never talk to police\" aspect is more poetically portrayed in this screenplay but too frequent in these types of films. Monaghan is nothing to rave about, clearly acting and not suitable for the role. The movie is meant to show the line between humanity and the lack of humane attributes within a single community. Harris and Freeman are easily grouped together as cliche cops bringing nothing special to investigational scenes. Especially Freeman, he fails at showing true emotion. Harris though ends up developing as a character and is strongest when telling his story about planting evidence. Freeman also comes into his natural talent at the end of the film. The cheesy cop play was apart of the screenplay. The script is touching but not very believable. The action is exciting but not very true to life. Affleck does not come cross as the tough guy he is supposed to and is transparent when trying to do so. Everything does however pick up for the benefit of the audience just past the halfway point, just when you start to lose hope. This is when you are forced to the edge of your seat and the story becomes more gut wrenching, and the writing becomes tricky. The story evolves like you could never expect and the twists are smartly placed. At first the end seems too far fetched but really it is the necessary twist and the glue to the moral. Who decides what is right? Who picks the fate of those who cannot decide for themselves? This is one of those films you cannot decide weather it is good or bad, but the last few moments quickly make it great. Most films have a clear ending, either it is an audience pleaser or less occasionally a depressing conclusion. This film is a rarity that lets you decide.",
            "review_date": "2013-05-23",
            "source": "rt"
        },
        {
            "content": "Great performances but I found Affleck's directing to be only competent. As an actor he knows how to get great performances but there is little authorial voice.",
            "review_date": "2013-05-20",
            "source": "rt"
        },
        {
            "content": "Extremely realistic with a questionable decision in the end. Very well acted by Casey and very well directed by Ben",
            "review_date": "2013-05-17",
            "source": "rt"
        },
        {
            "content": "Wow, that's a really good movie, near masterpiece. I liked almost everything in it. That is the detective-noir-mystery story with unpredictable plot steps and twists with fine actors.   It is must-see for everyone who loves those kind os movies. And by the way, he did the right thing, Patrick, absolutely agree with him.",
            "review_date": "2013-05-13",
            "source": "rt"
        },
        {
            "content": "http://rosslangager.com/2013/02/10/film-review-gone-baby-gone/",
            "review_date": "2013-05-10",
            "source": "rt"
        },
        {
            "content": "A brilliant performance from all cast members and credit to Ben Affleck for his solid direction and flowing script. Gone Baby Gone is a dark, powerful and breathtaking film.",
            "review_date": "2013-05-03",
            "source": "rt"
        },
        {
            "content": "Loved it. I thought it was well acted, well written, and directed. Once you think it's over...it's just getting started!",
            "review_date": "2013-05-01",
            "source": "rt"
        },
        {
            "content": "Raises some interesting questions concerning whether the 'end justifies the means ' and the true meaning of home but the main case investigation itself wasn't gripping to a huge degree. Also, the revelation, although relevant to the theme, was a bit too predictable and an anti-climax because not enough was done prior to steer audiences in a different direction. I found the second missing child's case involving the drug dealers much more engaging but this was only a small portion of the film in the middle. It has achieved high Rotten Tomatoes ratings which I usually use as a reliable source but I guess we'll have to agree to disagree this time round.",
            "review_date": "2013-05-01",
            "source": "rt"
        },
        {
            "content": "A thoughtful, touching film where no amount of gangsters or plot twists can change how people feel towards children.",
            "review_date": "2013-04-28",
            "source": "rt"
        },
        {
            "content": "Well acted thriller with some strong scenes.",
            "review_date": "2013-04-25",
            "source": "rt"
        },
        {
            "content": "Just when you think Ben Affleck is killing it, along comes his brother and hits it out of the park too ! Whats goin on here !?",
            "review_date": "2013-04-25",
            "source": "rt"
        },
        {
            "content": "Es excelente, pero tan terrible que desearía no haberla visto. Impresionantes las actuaciones: Affleck Jr., Ed Harris que la rompe como siempre y Morgan Freeman, idem.",
            "review_date": "2013-04-25",
            "source": "rt"
        },
        {
            "content": "Ben Affleck directing his younger brother, Casey, in this one. You get the Boston feeling right off. The accents are annoying but genuine. Affleck, Freeman and Harris do very good work. Monaghan is window dressing unfortunately. The story is handled effectively, with an interesting but not surprising twist. The moral issue of what is right vs. what is lawful comes to a head near the ending. Enjoyed quite a lot.",
            "review_date": "2013-04-20",
            "source": "rt"
        },
        {
            "content": "Totally unpredictible, it keeps the suspense until the last minutes. I loved it.",
            "review_date": "2013-04-15",
            "source": "rt"
        },
        {
            "content": "Wow. the plot and transitions in this one  were aweful. The whole movie hinged on one shocking scene that had little to do with the actual point of the movie, and was unneccesary!! Casey Affleck - we all know you are a better actor than this!! DO NOT sit in the mediocre shadow of your brother!\r\n\r\nAWEFUL!",
            "review_date": "2013-04-11",
            "source": "rt"
        },
        {
            "content": "A great debut by Oscar winner Ben Affleck. A suspenseful and intriguing story, that while a little confusing; will still have you interested the whole time.",
            "review_date": "2013-04-11",
            "source": "rt"
        },
        {
            "content": "I think it was a flawed script...your main character shoots a pedophile in the back of the head for molesting and killing a child, then turns around and returns a child to an unfit mother who will probably get her child abused and/or killed because of her drug use, criminal activies and sexual conduct? And his reason is ideology?  It just doesn't ring true to the character we watched murder a pedophile in cold blood a couple of scenes before.   I couldn't buy it..",
            "review_date": "2013-04-10",
            "source": "rt"
        },
        {
            "content": "very movin film i loved it...it had me guessin all the way up till the end a must see",
            "review_date": "2013-04-09",
            "source": "rt"
        },
        {
            "content": "Ben Affleck the new Clint Eastwood? Who'd have thought it? Great story.",
            "review_date": "2013-04-05",
            "source": "rt"
        },
        {
            "content": "A story about decisions..neither choice may be wrong but each has consequences.  Excellent acting.  Definitely worth seeing and you may learn something about yourself while you are there.  What would you have done about the little girl?  I have to say that I am inclined to choose Morgan Freeman's side.  And I think Casey's character feels the same in the end.....",
            "review_date": "2013-04-03",
            "source": "rt"
        },
        {
            "content": "By far- the Afflecks reign supreme in this Boston flick.",
            "review_date": "2013-04-03",
            "source": "rt"
        },
        {
            "content": "This movie is just all around badass, i lose a man point for waiting 6 years to watch it for the first time. Ben Affleck did an amazing job writing/directing while his brother, Casey, played the perfect role... Well done, Very well done!",
            "review_date": "2013-04-02",
            "source": "rt"
        },
        {
            "content": "The direction is impeccable and Casey Affleck delivers an incredibly overlooked, powerhouse performance. With such a tight script that falls into complete unpredictability territory in the final act, Gone Baby Gone is near faultless and it has all the key elements of an instant classic.",
            "review_date": "2013-03-27",
            "source": "rt"
        },
        {
            "content": "A truly stellar directorial debut by Ben Affleck.",
            "review_date": "2013-03-27",
            "source": "rt"
        },
        {
            "content": "A little girl is kidnapped and her relatives call on private detectives  Patrick Kenzie (Casey Affleck) and Angie Gennaro ( Michelle Monaghan ) to help with the police investigation. What they find is shocking, involves drug dealers, dirty cops and finally involved relatives.They give up the girl for dead until another boy goes missing. Its then that the plot unfolds. Watch this for a unbelievable ending that leaves the two detectives at odds with each other. Ben Affleck is the director here.",
            "review_date": "2013-03-26",
            "source": "rt"
        },
        {
            "content": "Good mystery film with unexpected twists that shows ambiguous moral situations.",
            "review_date": "2013-03-25",
            "source": "rt"
        },
        {
            "content": "Too flawed to be enjoyed. Casey Affleck litteraly gets away with murder in this movie, given the guy he murders is infectious human waste, and whether or not you agree on the morality of it it doesn't change the fact that it was murder and that he should have been tried by a jury of his peers. How does he get away with killing someone, but God forbid the little girl has a stable family dynamic with parents who love her. Now we have to go by the book? This ruined the whole film for me. Pity.",
            "review_date": "2013-03-24",
            "source": "rt"
        },
        {
            "content": "Powerful, gripping, and brilliant, Ben Affleck made an excellent and intelligent drama through a great ensemble cast and an even better story that is focused on its emotionally investing characters.",
            "review_date": "2013-03-24",
            "source": "rt"
        },
        {
            "content": "This movie and Argo prove that Ben Affleck is a much better director than actor. It is a completely thrilling movie with some disquietining twists. It is superbly acted, especially by Amy Ryan as the neglecting mother. It is apity was overlooked by the Academy",
            "review_date": "2013-03-21",
            "source": "rt"
        },
        {
            "content": "Easily the most overrated film I can think of. Unrealistic in every way imaginable, the characters, the story, everything. Thankfully, Affleck went on to make 'The Town' and 'Argo'. While those two films can only be criticized for how much artistic license they took, this film can and should be criticized for everything else. I would expect a movie of this caliber to have a single digit tomatometer rating. Absolutely dreadful. The type of film where the viewer should be paid $12 from the theater to sit through.",
            "review_date": "2013-03-20",
            "source": "rt"
        },
        {
            "content": "Movie starts with Casey Affleck's narration with very calm tone. Then it starts with a tragedy in a small town. This is a great story and script is at top notch. Performances by Casey Affleck and Amy Ryan are outstanding and also supporting actors are fantastic in their roles. It will leave you heart broken and wondering at the end. It brought me tears and I will always remember what the character said in this movie(I won't spoil...). Ben Afffleck is is an amazing director who knows how to tell the story. Highly recommended.",
            "review_date": "2013-03-18",
            "source": "rt"
        },
        {
            "content": "The film's opening line summarizes the essence of the film. \"I have always believed that it is the things we don't choose that make us who we are.\" Ben Affleck makes an engaging thriller with lot of brains and emotional depth making us literally wonder about what is right and what is wrong. And how that choice affects our own thought process. A brilliant achievement.",
            "review_date": "2013-03-17",
            "source": "rt"
        },
        {
            "content": "After watching all Ben Affleck films I can't decide which one is his best one.",
            "review_date": "2013-03-16",
            "source": "rt"
        },
        {
            "content": "really good movie... john toll photog great, casey and Michelle superb performances, score sumptoous and surprise surprise, ben afflect is a real director...",
            "review_date": "2013-03-15",
            "source": "rt"
        },
        {
            "content": "Great film making by Ben Affleck!",
            "review_date": "2013-03-11",
            "source": "rt"
        },
        {
            "content": "Really amazing work. Thought provoking, intelligent, and complex, but still extremely entertaining.",
            "review_date": "2013-03-10",
            "source": "rt"
        },
        {
            "content": "its gone baby gone.. mind twist and good plot!",
            "review_date": "2013-03-07",
            "source": "rt"
        },
        {
            "content": "Thought-provoking as well as suspenseful, Gone Baby Gone is an excellent directorial debut for Ben Affleck and quite far from the average thriller. Casey Affleck and Amy Ryan both give solid performances, and the ending will have you wrestling on which side you want to take.",
            "review_date": "2013-03-06",
            "source": "rt"
        },
        {
            "content": "Ben Affleck's feature directorial debut is an excellent mystery film about a missing girl.  Affleck's younger brother Casey stars as a private investigator in Boston who is hired to look into a missing child with a drug addict mother, and he is very good in the role, as is the whole cast.  It is a really effective film and Affleck's direction is great...proving early on that he has the skills to become one of the best directors out there, and that he may be much more than a fading pretty boy actor.  This is a tale that has mystery and drama, and heart wrenching moments.  It is a really effective debut for Affleck behind the camera.",
            "review_date": "2013-03-04",
            "source": "rt"
        },
        {
            "content": "Who says Ben Affleck is a hack? Great film that brings up important questions about kidnapping.",
            "review_date": "2013-03-03",
            "source": "rt"
        },
        {
            "content": "a thrilling and exciting film with distinct realism in regards to setting and charactors, the beginning of a good resume for affleck in directing",
            "review_date": "2013-03-01",
            "source": "rt"
        },
        {
            "content": "Impressed. Much better than Argo.",
            "review_date": "2013-02-27",
            "source": "rt"
        },
        {
            "content": "The Affleck brothers have made us a great deal by shelling out an impressive , intelligent and an emotionally power-packed film.The film is led by brilliant performances from Casey Affleck, Ed Harris, and Michelle Monoghan and notably  intelligent casting by Ben Affleck as he advertises his mettle in film-making through this fine directorial debut.Gone Baby Gone is one of those thrillers that amuse us by complimenting reality, rather than creating one.",
            "review_date": "2013-02-22",
            "source": "rt"
        },
        {
            "content": "I guess I am the only person who doesn't think Ben Affleck is any good as a director. I find his movies (aside from Argo, which I haven't seen yet) to be mediocre at best. Casey Affleck is one of the crappiest actors around with his mushmouthed delivery and range of a potato. Still Gone Baby Gone is okay and doesn't suck.",
            "review_date": "2013-02-20",
            "source": "rt"
        },
        {
            "content": "Immense. That's all I can say",
            "review_date": "2013-02-20",
            "source": "rt"
        },
        {
            "content": "\"Beatrice don't use that word.\"",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "This movie was good!! I thought i had it solved but then i was wrong! I am just glad nothing bad happened to the little girl.",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "Can't believe this has such high ratings!  This film is mostly a mess.  The writing is absolutely horrible, every piece of dialogue is just moving the plot along, there's nothing to give depth to anybody on screen.  Michelle Monaghan does nothing throughout the entire movie except stand behind Casey Affleck looking worried and crying every so often, she may as well not even be in this.  The decisions some of the characters make are so stupid and defy any sort of logic.  Music beds are used in every scene to tell the audience what emotion they should be feeling.  The direction is static and boring.    I don't get the praise.",
            "review_date": "2013-02-17",
            "source": "rt"
        },
        {
            "content": "Intense & gripping thriller. Gives a good message at the end i.e doing the right thing is always RIGHT. Brilliant screenplay and Affleck's best till date!",
            "review_date": "2013-02-14",
            "source": "rt"
        },
        {
            "content": "great directing by ben afflect and great acting by his brother casey.",
            "review_date": "2013-02-11",
            "source": "rt"
        },
        {
            "content": "You all made me think I was gonna want to off myself after I watched this.  More of a moral dilemma crime tale where there isn't really a right or a wrong, its just... no one really comes out smilin.  The beginning totally hooked me in with the whole Bostonian thing, and the accent especially when a chick says a dudes place smells like cock, pronounced beautifully as \"caulk\".  Casey Affleck and Ed Harris did a bang up job, and Amy Ryan was absolutely outstanding as that trashy bitch everyone knew from high school.  As the end started to unravel I was piecing together all the clues before the film had time to explain them which is always kind of annoying, but for the most part I liked it and was glad it got adapted to the screen.  And as for Mr. Benjamin Affleck.... (clap, clap) you're alllll right.",
            "review_date": "2013-02-11",
            "source": "rt"
        },
        {
            "content": "4.1/5 \nBen Affleck no reinventa la rueda con este thriller pero vaya que lo hace bien, excelentemente actuada, una historia que atrapa desde el inicio y no es nada predecible, además de un desarrollo de los personajes impecable; mucho mejor que la sobrevalorada Argo (también dirigida por Ben) y más emocionante.",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "Affleck's debut is remarkably assured with flawless performances across the board. Best of all, the ending leaves audiences debating for days. It's also an original story. Casey Affleck is an unusual choice for a P.I. (especially considering his age) and having his partner be his girlfriend is equally strange. Yet, it works and the supporting cast brings it all together. Some of the bit parts have an almost Cassavetes-like appeal. Personally, I think our hero made the right choice in the end. Well worth seeing with plenty of complexities.",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "As many have said Ben Affleck should stick to directing as he seems to have much more talent for it than acting. The opposite applies for his brother Casey who gives a stunning performance here, although at times he struggles to pull of the \"hardass\" character pulling his gun out and threatening people, he just doesn't have the look to match. Overall a solid screenplay and even though some plot twists are quite obvious they are none the less satisfying. The ultimate point to this story is a question and the direction this film takes poses that question to not only the characters but the audience watching their story and this ultimately stays with you after the film has concluded. It's an intense film, the performances are realistic and heartfelt and overall an extremely satisfying film. (though not enjoyable at all times due to the content)",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "Awesome.  Makes you think about morality and right and wrong.",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "A powerful theme, a strong supporting cast and I don't mind the polished noir approach. What baffles me is the lead character and the choice of Casey Affleck for him. A wimpy guy that has a strong moral sense, while being well connected with underground people? Not very believable.",
            "review_date": "2013-02-05",
            "source": "rt"
        },
        {
            "content": "heartbreakingly wonderful.",
            "review_date": "2013-02-04",
            "source": "rt"
        },
        {
            "content": "The movie`s great scenes, cinematographical and directing work combined with the actors` performances show how Great the movie is. You can watch it twice and it keeps being thrilling and exciting. A movie I would have never expected of Ben Affleck.",
            "review_date": "2013-02-04",
            "source": "rt"
        },
        {
            "content": "It's better than I expected. I would call this one a touching drama rather than a crime suspense thriller. Every individual has their own opinions about a situation. And I think Ben Affleck was right.",
            "review_date": "2013-02-04",
            "source": "rt"
        },
        {
            "content": "the Affleck brothers deliver an astounding movie. Casey Affleck proves just how underrated an actor he can be with his strong performance and Ben proves that he can make it as a director. The entire cast of Harris, Freeman and Monaghan deliver top notch performances as well. Definitely a film worth not only seeing but owning because you'll want to see it over and over",
            "review_date": "2013-02-03",
            "source": "rt"
        },
        {
            "content": "One thought it was done and finished after one hour but no. more twists and turns all the way through. I did not see it coming. Not massively impressive but not bad either.",
            "review_date": "2013-02-03",
            "source": "rt"
        },
        {
            "content": "We own this and have watched it 5 or 6 times and it gets gooder and gooderer! Casey Affleck plays the part with just the right amount of crazy...",
            "review_date": "2013-02-01",
            "source": "rt"
        },
        {
            "content": "This movie had the greatness that films like \"The Departed,\" and \"Mystic River\" had, and it was dramatic, intense, sad, and was loaded with great acting.. It is one of the greatest films that came out of my town of Boston. This film didn't have the intensity that the Town had, but it was still very intense though. The Affleck brothers really do work well together. The thing about the ending that is so emotional is that no matter what Casey Affleck did it would still be a sad ending, and you could really feel all of the emotions you were supposed to feel at the end, and you could put yourself in the shoes of all of the characters in the story. I loved it how they also tied everything together at the end, and showed brief snippets of all of the things that happened earlier in the movie to sum up the story. I love mystery's that do that. This is my favorite movie to come out of my hometown of Boston.",
            "review_date": "2013-02-01",
            "source": "rt"
        },
        {
            "content": "Debut directorial film from Mr. Ben Affleck. I REALLY enjoy this film, lots to like about it and very few things to dislike. Mainly a few moments of bad acting that actually took me out of the film. But this is a great movie and made me look forward to more Affleck directed films.",
            "review_date": "2013-01-30",
            "source": "rt"
        },
        {
            "content": "This film is Ben Affleck's first directing work and it showed. It was still good, but certain elements seemed forced, lacking, or just weird. Casey Affleck gives a decent enough performance, but his accent seems a little forced (not wrong, but forced) and sometimes he just lacks emotion for the kind of things he's dealing with. His girlfriend is just kinda there, not really being significant except at the end (sort of). There are certain parts that are skimmed over too quickly, and sometimes you aren't completely sure why he's doing what he's doing, though based on the ending that was probably the point, though it still is confusing occasionally. The film does do a good job of making you despise the mother and therefore really making the end choice a dilemma instead of obvious, which is effective to make you really care about what he eventually chooses to do. There are quite a few tense moments that are done quite well, though sometimes it's predictable. It's really the story that is the strength here, and that's what puts it over the top despite the flaws. It's still a good movie that is worth the watch, but don't expect it to be on the same level as Affleck's later directing work.\n3.5 stars: Good, not great",
            "review_date": "2013-01-30",
            "source": "rt"
        },
        {
            "content": "Gone Baby Gone is Ben Affleck's triumphant debut on direction. A haunting thriller of kidnapping, a tense and honest mediation on moral dilemmas that makes you think. Very well acted, (specially Ed Harris and Morgan Freeman), Gone Baby Gone is definitely an excellent movie, to watch again and again.",
            "review_date": "2013-01-30",
            "source": "rt"
        },
        {
            "content": "Very good movie. Acting and directing is on point. The story is kind of slow paced but it keeps you interested due to good directing (Ben Affleck's directorial debut), good character development and mystery. A tough subject matter to deal with but Affleck does a good job of showing it without going over the top and leaves you with the moral question of is it the \"right\" or \"wrong\" thing to do at the end.",
            "review_date": "2013-01-30",
            "source": "rt"
        },
        {
            "content": "Nada de excepcional aqui, mas um bom thriller.",
            "review_date": "2013-01-28",
            "source": "rt"
        },
        {
            "content": "I love to see a failure, like in \"Unforgiven,\" make it to hero status by the end of the film.",
            "review_date": "2013-01-26",
            "source": "rt"
        },
        {
            "content": "He may be a poor actor, but he's a solid director; and is brother can act. Good movie.",
            "review_date": "2013-01-26",
            "source": "rt"
        },
        {
            "content": "89%\nWhile not the fast-paced crime movie I thought it was going to be, Gone Baby Gone is an intriguing, suspenseful, and tactful film with an ambiguous ending. It delivers excellent performances by its cast, earning Amy Ryan an Oscar nod for Best Supporting actress, but is also a fantastic directorial debut for Ben Affleck.",
            "review_date": "2013-01-25",
            "source": "rt"
        },
        {
            "content": "Major plot hole in the quarry scene. .",
            "review_date": "2013-01-25",
            "source": "rt"
        },
        {
            "content": "A good but sad movie, the twist of was great.",
            "review_date": "2013-01-24",
            "source": "rt"
        },
        {
            "content": "I'd previously had this marked as \"not interested\" (so as to why i added it to my netflix list? no answers, here), but I must say... past-Skyler was an idiot. This movie has it all and - indeed - more. Great acting, gripping moral dilemmas, and a perfect ending - there is no looking forward in time... you are only ever able to change the moment you're in.\n\n\nPS: Titus Welliver!",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "Finally got to see this movie and wasn't disappointed by it.  Very good and definitely worth seeing.",
            "review_date": "2013-01-20",
            "source": "rt"
        },
        {
            "content": "Really good movie. Very well made and well acted. Interesting supporting cast",
            "review_date": "2013-01-19",
            "source": "rt"
        },
        {
            "content": "Tv movie feel but serious content - I liked the style - very gritty... Another good entry from mr b affleck\nDon't you just hate a righteous mutha fukka though???",
            "review_date": "2013-01-19",
            "source": "rt"
        },
        {
            "content": "Gone Baby Gone would have been much better with Ben instead of Casey Affleck at the forefront but that is my only complaint with the movie. With powerful performances from Ed Harris and Morgan Freeman, the story definitely delivered making you question \"What would you do\" at the end of it all.",
            "review_date": "2013-01-18",
            "source": "rt"
        },
        {
            "content": "Well acted, intense thriller. Good stuff.",
            "review_date": "2013-01-15",
            "source": "rt"
        },
        {
            "content": "Brilliant film that had me questioning wether the right decisions had been and ultimately, sometimes what's right isn't necessarily the correct way. Brilliant film.",
            "review_date": "2013-01-13",
            "source": "rt"
        },
        {
            "content": "Violence...but at the same time  it's moving and beautiful",
            "review_date": "2013-01-13",
            "source": "rt"
        },
        {
            "content": "Vraiment, ce film fait rÃ (C)flÃ (C)chir.\nTrÃ¨s bon, Ã  voir absolument",
            "review_date": "2013-01-09",
            "source": "rt"
        },
        {
            "content": "a decent film but a bad ending, at least that's my feel... i guess i think some people don't have the stomach for reality and that's what this movie was about. a camera following a man who thinks he is doing the right thing, when in reality he is only making the lives harder of those around him. It's hard to watch at times because of the topic at hand. at least that was my experience.",
            "review_date": "2013-01-09",
            "source": "rt"
        },
        {
            "content": "this movie was awesome, i suggest everyone go see it. casey affleck is great",
            "review_date": "2013-01-08",
            "source": "rt"
        },
        {
            "content": "The first half of the movie was quite slow and had some lack, but the the second one definitively changed my mind. The final punch was extremely interesting and was ethically great.",
            "review_date": "2013-01-08",
            "source": "rt"
        },
        {
            "content": "An engaging well acted film that is great for a directorial debut. 'Gone Baby Gone' has a brilliant story that'll keep you entertained from start to finish.",
            "review_date": "2013-01-08",
            "source": "rt"
        },
        {
            "content": "Clocking in with markedly less raw kinetic quality and gripping fierceness than Affleck's phenomenal film The Town, Gone Baby Gone is nonetheless an extremely solid debut from the director. He draws us in with genuine fondness for the Boston underworld and never lets go, inspiring a serpentine labyrinth of excellent, snappy scriptwriting and interesting twists to boot. Affleck's affection for penetrating, emotional filmmaking cannot be understated, neither can it be over appreciated.",
            "review_date": "2013-01-07",
            "source": "rt"
        },
        {
            "content": "An excellent taut drama with compelling questions of morality. What would you do? The morale dilemmas in Gone Baby Gone are compelling and leave the viewer to debate what would you have done? Gone Baby Gone is an extremely well acted, well directed film with unpredictable plot twists & turns. It's gritty, it's sad, and it is engrossing from start to finish.\r\n\r\nCasey Affleck delivers a powerful performance for his director/writer brother, Ben Affleck who really does an extremely fine job directing this film.\r\n\r\nI would highly recommend this film.",
            "review_date": "2013-01-07",
            "source": "rt"
        },
        {
            "content": "Awesome movie - can't believe Ben Affleck directed it but who cares, it is what it is - a great movie. Casey Affleck delivers another stunning performance and the story keeps you guessing. Highly reccomended.",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "Both Affleck's shine in this gritty drama. One behind the camera and the other in front of it. They make us think about  ethics and what is right and what is wrong. Great Film!",
            "review_date": "2013-01-05",
            "source": "rt"
        },
        {
            "content": "Brilliant. Hooray, Afflecks!",
            "review_date": "2013-01-05",
            "source": "rt"
        },
        {
            "content": "A gripping film about a child kidnapping and the ensuing investigation that packs a punch as its twists and turns lead up to a shocking climax and one that will leave audiences discussing the rights and wrongs of the decisions taken long after the final reel. Superbly directed by Ben Affleck, with a top notch cast.",
            "review_date": "2013-01-03",
            "source": "rt"
        },
        {
            "content": "Ben Affleck has chosen alot of crappy roles when it comes to acting. Thankfully, he makes up for it with his skills behind the camera. \"Gone Baby Gone,\" his directorial debut, is a very entertaining crime drama. The premise is this: Casey Affleck is a private detective who agrees to help find a missing child, and uncovers corrupt policemen.\n\nIt sounds like a cliche', but in this, it does not feel so. With fun to listen to dialogue, and an amazing performance from his brother Casey, Ben Affleck found what he's best at.",
            "review_date": "2013-01-03",
            "source": "rt"
        },
        {
            "content": "Affleck succeeds as a director once again, Gone Baby Gone may not be his best but it's very well done at the most.",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "It's a stellar film. Grim, but stellar.",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "Great Movie.  Hope to see more of Casey Affleck he truly is the better actor in the family.  Brother Ben gets a A+ for his work as Director and Screen Writer. Ed Harris had a great performance too.   I?m still lost in thought on the moral issues.  Leaves you with the question ?What would I do? ????",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "Gone Baby Gone is an amazing film, and clearly based on my rating, I thought it was excellent. The directorial debut of Ben Affleck has impressed many, myself included. I was more impressed by Casey Affleck, however, who was amazing as the central character as a private investigator (along with Michelle Monaghan) looking into the disappearance of a 4-year old girl in the Boston area. An unbelievable story (based on a 1998 novel), and despite it being a particularly dark story, it is well told and again, credit to the actors, director (Ben Affleck) and producers involved. A magnificent film that had me hooked from the opening scene. See it if you think this is your kind of movie.",
            "review_date": "2012-12-31",
            "source": "rt"
        },
        {
            "content": "Gone baby gone is ground gripping dramatic, highly intense and twisting thriller. Ben Affleck  debut his directing career in a very promising future. This film shows not only the society facing against conspiracy corruptions, it is also a challenge of making the right decisions or making everything okay. Either decisions prove there is something to lose.",
            "review_date": "2012-12-31",
            "source": "rt"
        },
        {
            "content": "Really well-done movie.  Makes you really think about what you would do in a similar situation.",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "Morgan Freeman is a great actor. I loved this movie",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "The movie suffers somewhat from characters reacting unconvincingly to events due to either bad acting or scripting. Harris and Casey give strong performances and when the plot starts to unravel in the latter half of the movie it really takes off. By the end the line between right and wrong starts to blur and the audience is left wondering.",
            "review_date": "2012-12-28",
            "source": "rt"
        },
        {
            "content": "Casey Affleck really does great work in this one.  And Ben does great behind the camera.  I don't care if everything he does from now on is based in Boston.",
            "review_date": "2012-12-27",
            "source": "rt"
        },
        {
            "content": "I think this would have been a much better film with a different director and lead actor. I'm sorry but the Afflecks ruin this movie. Casey Affleck is a wooden actor. His heartfelt speeches and attempts to act the touch guy were laughable, brought no emotion to the character and left the film damp. If you compare this to  Mystic River, another adaptation of a Lehane novel and you'll see how short Gone Baby Gone falls. My wife and I were shocked how bad this was after seeing it get 94 percent on Rotten Tomatoes. Normally RT is spot on with it's ratings. It was so off this time that it has prompted me to write my first review. Maybe the sad subject matter of child abduction/abuse clouded everyones ability from being able to tell a brilliant movie from a badly acted/directed one.",
            "review_date": "2012-12-27",
            "source": "rt"
        }
    ]
}