{
    "rating": 2.6,
    "release_date": "2007-07-27",
    "num_reviews": 70,
    "genres": [
        "Mystery&thriller",
        "Horror"
    ],
    "summary": "A young woman named Aubrey Fleming (Lindsay Lohan) falls victim to a sadistic kidnapper. When her ordeal is finally over, Aubrey has a shocking surprise for her family: She claims to be someone else. Some wonder whether Aubrey is mentally ill, intentionally lying, or if there is some bizarre truth to her claim.",
    "reviews": [
        {
            "content": "Convoluted and not at all interesting.",
            "review_date": "2023-02-01",
            "source": "rt"
        },
        {
            "content": "I liked it. I believed she was delusional the whole time but the plot twist was nice. It would have been nice to know at the end if they were found, but overall, it was a suspenseful movie that kept interest.",
            "review_date": "2022-06-06",
            "source": "rt"
        },
        {
            "content": "Norm of the north not my norm and sonic the king king of lord evil king evil lord",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "Though it can be classified as so bad it's hilarious, it still marks as one of the worst of lindays's career before her downfall.",
            "review_date": "2022-04-10",
            "source": "rt"
        },
        {
            "content": "I know when I first saw this movie when it came out I loved it. I honestly do not get the bad reviews. Usually, though, if I see bad reviews from critics I know I will most likely like the movie. \n\nA movie is an escape. A movie is supposed to keep you entertained the whole time and not nodding off in your seat. I see a consistent theme for movies that get good critic scores and that is a) pushing political agendas or b) a snooze fest. This was neither. \n\nIt has nice use of symbolism and color, it had a really neat plot and I thought Lindsay Lohan did a great job. It was a thriller that had you guessing for a short period until they pretty much told you what was going on, but also kept you unsure until the near end. It was meant to be that way. \n\nI just rewatched it for like the 6th time and it's one of those movies where you don't watch it for a few years and it's enjoyable to watch again and again. \n\nI don't want to spoil anything, but I have to say it is one of the more unique and enjoyable movies I've seen which is why is has a low score.",
            "review_date": "2022-04-07",
            "source": "rt"
        },
        {
            "content": "This is really too bad - it has a good gag in it and might have been a fun film. Trouble was, it was so badly written, acted, and directed.",
            "review_date": "2022-03-29",
            "source": "rt"
        },
        {
            "content": "Such a bad movie! I was hoping that it was going to get better so I continued watching it because I was invested in it. Don't waste your time!",
            "review_date": "2022-03-28",
            "source": "rt"
        },
        {
            "content": "A new record: the movie hasn't even started yet I already hate it. Why? The title of this film is \"I Know Who Killed Me\" which makes absolutely zero sense. Lindsey Lohan's acting for a psychological thriller was pretty bland and looked like she didn't give any effort whatsoever. The visuals of the gore presented in this film was not that impressive and quite honestly it felt more like a B-movie. The main antagonist's intentions in I Know Who Killed Me is just like in other popular movies like Saw and Hostel: kidnapping the characters and torture them. This honestly just feels like a rip-off of Saw and Hostel actually. The writing by Jeff Hammond is beyond ridiculous since the audience was presented an extremely bizarre premise.  Especially with a lame twist and the police handling the identity case poorly. However, I did like the nuance moments of cinematography with the colors blue which symbolizes mystery or attaining the impossible and red symbolizes courage. Also, the music composed by Joel McNeely is pretty beautiful and is a decent fit for psychological thriller. Unfortunately, I Know Who Killed Me couldn't save itself regardless of the music and cinematography because the acting, writing, visuals, and the title itself made me dislike the film.",
            "review_date": "2021-12-09",
            "source": "rt"
        },
        {
            "content": "A terrible Lindsay Lohan vehicle that boasts awful acting, script, and plot. Overall, a miss.",
            "review_date": "2021-09-16",
            "source": "rt"
        },
        {
            "content": "Lindsay Lohan stars in the mystery thriller as a psychic, cyborg, crime fighting, hustling stripper, attempting to put her skills to the test and solve the biggest mystery of her life! Who abducted her and where is she though?",
            "review_date": "2021-07-06",
            "source": "rt"
        },
        {
            "content": "Lindsay Lohan in one of her first grown up roles and she goes all out playing a teen who's also a stripper who gets abducted and mutilated....and then it gets confusing.  This is a mess of a film, which potentially could have been decent.  \nHigh marks for hand trauma in this film as it is suitably gruesome. \nOther than that the movie itself is mainly frustrating.",
            "review_date": "2021-01-07",
            "source": "rt"
        },
        {
            "content": "one of the worst films in the world. did not like. this movie sucks don't watch",
            "review_date": "2020-10-13",
            "source": "rt"
        },
        {
            "content": "It's better than rotten tomatoes says. Lindsey killed the role as a twins.. Yet again.   The ending you didn't see coming unless you thoroughly pay attention. It leaves you wondering.. though I wish there was a movie about after this all went down.. the ending left me wanting to know more. It's definitely a good movie in my opinion.",
            "review_date": "2020-09-21",
            "source": "rt"
        },
        {
            "content": "In this psychological thriller, Aubrey Fleming (Lindsay Lohan) is abducted and tortured by a serial killer. Meanwhile, her twin sister, Dakota Moss (also Lohan) wakes up in a hospital and discovers mysterious wounds on her right hand and right leg, before solving the mystery of her killer, Aubrey's piano tutor Mr. Norquist. Atop of the recycled murder mystery plot, those ridiculous blue operating tools, the goofy gore scenes, and the ludicrously preposterous twin stigmata syndrome, here are some of the billion plot holes that earned I Know Who Killed Me its eight Razzies. If Aubrey was buried during the investigation, then why isn't Dakota slowly rotting away like real corpses? In fact, wouldn't she be out of breath by the time she got to the killer's house? For that matter, if Aubrey and Dakota are twins, how could their parents (Julia Ormond and Neal McDonough) not recognize her when Dakota walked in? How did Aubrey's dad end up from the cemetery to a coffin in the killer's lab within ten minutes? If the impact of one twin affects another twin, did Aubrey feel anything down there when Dakota had sex with her boyfriend Jerrod (Brian Geraghty)? And most importantly, why aren't the FBI agents brought into the case again even after Norquist died? I Know Who Killed Me is an extremely stupid movie with not much thrills and a lot more laughs. (1 Blue Rose Bouquet out of 5)",
            "review_date": "2020-07-23",
            "source": "rt"
        },
        {
            "content": "I'm so old I remember when LiLo was an up and coming star and let met tell you it was a long time before this turd floated to the surface.",
            "review_date": "2020-05-27",
            "source": "rt"
        },
        {
            "content": "I personally really enjoyed the movie and the plot. The cinematography was beautiful and the story was nicely illustrated. I loved Lohan's acting as well as she sold it well for both roles - give this movie a shot, i believe it was ahead of its time.",
            "review_date": "2020-03-12",
            "source": "rt"
        },
        {
            "content": "Say what you want about Lohan and cinematography, I actually liked the plot.",
            "review_date": "2019-10-14",
            "source": "rt"
        },
        {
            "content": "Very confusing. It made very little sense.",
            "review_date": "2019-10-07",
            "source": "rt"
        },
        {
            "content": "Pretentious, poorly acted, and not convincing at all. The tone was all over the place (or no place), and it was so padded with unnecessary Lindsay screentime. So stupid, but so funny. Fun to make fun of and laugh at. The gore effects were pretty good though.",
            "review_date": "2019-08-08",
            "source": "rt"
        },
        {
            "content": "Jesus........ To put it on one word: Abho",
            "review_date": "2019-07-12",
            "source": "rt"
        },
        {
            "content": "Yo listen up, here's the story\nAbout a little girl that lives in a blue world\nAnd all day and all night and everything she sees is just blue\nLike her, inside and outside\nBlue her house with a blue little window\nAnd a blue Corvette\nAnd everything is blue for her\nAnd herself and everybody around\n'Cause she ain't got nobody to listen\n\nI'm blue da ba dee da ba daa\nDa ba dee da ba daa, da ba dee da ba daa, da ba dee da ba daa\nDa ba dee da ba daa, da ba dee da ba daa, da ba dee da ba daa\nI'm blue da ba dee da ba daa\nDa ba dee da ba daa, da ba dee da ba daa, da ba dee da ba daa\nDa ba dee da ba daa, da ba dee da ba daa, da ba dee da ba daa\n\nI have a blue house with a blue window\nBlue is the color of all that I wear\nBlue are the streets and all the trees are too\nI have a boyfriend and he is so blue\nBlue are the people here that walk around\nBlue like my Corvette, it's in and outside\nBlue are the words I say and what I think\nBlue are the feelings that live inside me\nI'm blue da ba dee da ba daa\nDa ba dee da ba daa, da ba dee da ba daa, da ba dee da ba daa\nDa ba dee da ba daa, da ba dee da ba daa, da ba dee da ba daa\nI'm blue da ba dee da ba daa\nDa ba dee da ba daa, da ba dee da ba daa, da ba dee da ba daa\nDa ba dee da ba daa, da ba dee da ba daa, da ba dee da ba daa\n\nI have a blue house with a blue window\nBlue is the color of all that I wear\nBlue are the streets and all the trees are too\nI have a boyfriend and he is so blue\nBlue are the people here that walk around\nBlue like my Corvette, it's in and outside\nBlue are the words I say and what I think\nBlue are the feelings that live inside me\n\nI'm blue da ba dee da ba daa\nDa ba dee da ba daa, da ba dee da ba daa, da ba dee da ba daa\nDa ba dee da ba daa, da ba dee da ba daa, da ba dee da ba daa\nI'm blue da ba dee da ba daa\nDa ba dee da ba daa, da ba dee da ba daa, da ba dee da ba daa\nDa ba dee da ba daa, da ba dee da ba daa, da ba dee da ba daa",
            "review_date": "2019-06-10",
            "source": "rt"
        },
        {
            "content": "Tense and gripping, I Know Who Killed Me features Lindsay Lohan at her very best, and sent her career roaring back to life.",
            "review_date": "2019-04-21",
            "source": "rt"
        },
        {
            "content": "Late 2000's Lindsey Lohan, a confusing plot, and the horror genre. Certainly not a trio that gets you excited going into a movie. However, I Know Who Killed Me ends up being, if not good, a fine film. The main problem with the film really is calling it a horror. Sure, there are some scenes in the film with ominous music over bloody images that are kind of unsettling, but the climax of the film is so sudden and unexciting that you're not really truly scared for a second.\nThe plot draws you in but man, there are some bad parts of the movie that kind of ruin what might be a good one. First, there's way too much time in the strip club scenes. You could've just said \"Hey, I worked in a strip club\" and that could've been the end of it. Instead, there's like 10 minutes of just incredibly uncomfortable film. Lohan does a good job of portraying multiple characters, not worthy of all the Razzie awards she won in my opinion, while the supporting cast was not as strong. But there are too many distractions that deter an otherwise decent movie. Like someone learning how to walk perfectly on a prosthetic leg after just one day of PT, or two people going to a serial killer's home with no police backup and no weaponry. I mean, what do you think you're really going to accomplish? These are a few of many dumb things that threw me off a little. The plot and acting are mostly there, and with a little more work this film could've been pretty good, but ended up just being a meh film you'll only watch once and shouldn't waste your time with.",
            "review_date": "2019-01-14",
            "source": "rt"
        },
        {
            "content": "I don’t know why this movie is so hated I actually really loved this movie I thought it was creative and different I enjoyed it ",
            "review_date": "2018-03-13",
            "source": "rt"
        },
        {
            "content": "Worth it. Excellent movie. Here is a hint as to how to watch this without thinking it is bad or for that matter, really bad: just don't take it seriously and you'll find it alright.",
            "review_date": "2018-02-13",
            "source": "rt"
        },
        {
            "content": "Não vou dar menos estrelas pq esse filme me deu muuita criatividade! Mas o enredo é bem fraquinho.",
            "review_date": "2017-07-07",
            "source": "rt"
        },
        {
            "content": "Sexy moves, too many freckles. Confusing, ended up having twin sister and piano teacher was killer",
            "review_date": "2016-10-25",
            "source": "rt"
        },
        {
            "content": "Really weird and screwed up!",
            "review_date": "2016-09-20",
            "source": "rt"
        },
        {
            "content": "it was crap.Lindsey Lohan was crap(as always),the plot was crap,everything was fu*****ng crap",
            "review_date": "2016-07-01",
            "source": "rt"
        },
        {
            "content": "Ever wondered how \"The Parent Trap\" could've gone terribly wrong? I mean like a complete trainwreck. Well, this is it.",
            "review_date": "2016-02-15",
            "source": "rt"
        },
        {
            "content": "I thought it was a good movie",
            "review_date": "2015-09-12",
            "source": "rt"
        },
        {
            "content": "No one. I repeat no one should see this movie",
            "review_date": "2015-08-05",
            "source": "rt"
        },
        {
            "content": "We interrupt this program as we all watch Lindsay Lohan go down in flames in this career-killing thriller (if you want to call it a thriller). \n\nThe quiet suburb of New Salem is being terrorized by a brutal serial killer who abducts and tortures young women, holding them captive for weeks before murdering them. Aubrey Fleming (Lindsay Lohan), a talented pianist and aspiring writer, appears to be his latest victim when she disappears without a trace during a night out with friends. As the days tick by, the special FBI Task Force convened to track the killer begins to lose hope of finding her before it's too late. Then, late one night, a driver discovers the young woman by the side of a deserted road, disheveled and critically injured, pleading for help. The girl is rushed to the hospital, where Aubrey's distraught parents, Susan and Daniel, wait by her side as she slips in and out of consciousness. When she is finally able to speak, she shocks everyone by claiming to be a down-on-her luck stripper named Dakota Moss (also Lindsay Lohan) who has never heard of Aubrey Fleming. Convinced Aubrey is suffering from post traumatic stress disorder, her doctors, parents and law enforcement officials can only wait for rest and therapy to restore her memory. But after returning to her parents' suburban home, she continues to insist that she is not who they think she is, despite bearing bizarre wounds identical to those of the serial killer's previous victims. The FBI agents are further mystified when they search Aubrey's computer and discover a short story about a girl with an alter ego named Dakota. When Dakota begins to suspect she may be Aubrey's identical twin sister, Susan (Julia Ormond) shows her a video of her pregnancy ultrasound clearly revealing there was only one fetus in her womb. Confused and terrified, Dakota starts seeing visions of a menacing figure slowly butchering his captive. Convinced that time is running out both for Aubrey and herself, Dakota confronts Daniel (Neal McDonough) with a shocking truth that leads them on a frantic hunt for the killer.\n\nFrom the beginning to end, I Know Who Killed Me is just a ludicrous mess of a film. With a story this bad, it baffles me that a script went through script meeting. And they said yes to it. When I watched this script go on my TV screen, it is so hard to take this story seriously because the concept from the jump is really absurd. And when a story/script is this silly is released to the world, there is no reason for this script to be written.\n\nThe performances are incredibly horrible in every way. However, it is not their because the script is so bad. Lohan, who gives a great performance in the Parent Trap, is especially dreadful in I Know Who Killed Me. Because of her arrest for DUI, on-set bitchiness, and all that jazz, her awful performance shows. The rest of the cast includes Neal McDonough, Julia Ormond, and Brian Geraghty, who are no better-- they are just as terrible as Lohan. Again, the script is just so incompetent and I can't nothing else but the screenplay/script-- which is (I forgot to mention) one of the worst written things that put into celluloid.\n\nThe direction.... what direction? There's barely any direction in my opinion. If there was any direction, in my eyes, I didn't see much of it. It's like Chris Sivertson wasn't on set when this film was made.\n\nI Know Who Killed Me supposed to be a thriller but it really isn't. There are no thrills whatsoever. At the end, I saw everything that coming especially when they reveal who the killer was. And the ending is just so pitiful that it is laughable. I can't call this a thriller but I can however call this a comedy. Also, the film features one of the most unintentionally hilarious sex scenes in recent memory. I will not describe it. You have to see it for yourself.\n\nI can go on how shockingly awful I Know Who Killed Me really is. From the inane script, horrific performances, and the nonexistent direction, I Know Who Killed Me is a disaster for everyone involved-- especially for Lohan herself. I am so surprise that is got made. Based on the plot itself, I Know Who Killed is a film that is so distasteful and so vile that it shouldn't been made. It made several critics worsts of lists and won eight Razzie awards-- and rightfully so. The film tries to be technically eye catching and mind-blowing but it flunks on both of these things. I prefer you to skip this misguided excuse of a thriller, However, if you are fascinated by terrible films like I Know Who Killed Me, then this movie is for you. But, like I said, skip this movie at all cost.",
            "review_date": "2015-07-25",
            "source": "rt"
        },
        {
            "content": "Truly awful. Ugly, terribly directed and shot, stupid, and ridiculous. Lindsay Lohan is terrible and the movie features what is perhaps the most forced, unnecessary, painfully uncomfortable sex scene in the history of movies.",
            "review_date": "2015-05-25",
            "source": "rt"
        },
        {
            "content": "A genuinely terrible film that relied heavily on Lindsay Lohan acting sexy to try to spark anyone's interest.",
            "review_date": "2015-03-24",
            "source": "rt"
        },
        {
            "content": "Original and entertaining horror movie",
            "review_date": "2015-03-18",
            "source": "rt"
        },
        {
            "content": "This is the worst movie I have ever watched, but it was such train wreck i couldn't look away. The plot had such massive holes and the characters so terribly developed I am truly shocked it was ever produced in the first place. Don't become me and waste brain cells on this movie, sticking your head in a microwave would be better.",
            "review_date": "2015-01-25",
            "source": "rt"
        },
        {
            "content": "Dark, cheap and mesmerizing. That's how I feel about I Know Who Killed Me. It's a sour pill to swallow, but it at least gives you something to taste, even if it's not always pleasant or as fulfilling as one would hope.",
            "review_date": "2014-11-07",
            "source": "rt"
        },
        {
            "content": "I believe this film was decent, but I still don't understand why there's so much hate on this film. It took my a little bit of time to figure out how some things happened, but I got it all down. I also like the visuals and the soundtrack was superb. The visuals kind of reminded me of the visual style used in Dario Argento's Suspiria because of the lighting used including red or pink or in this film that uses blue throughout the film. I won't spoil the movie, but look deep into it and you'll get the film and you may even like it.",
            "review_date": "2014-10-12",
            "source": "rt"
        },
        {
            "content": "It's not even misogynist in an interesting way. The movie is so bent of torturing, bleeding out & overtly sexualizing its female lead that 'the plot' just becomes an excuse to show as much of Lindsay Lohan's naked & abused body as possible",
            "review_date": "2014-09-11",
            "source": "rt"
        },
        {
            "content": "Terrible and great at the same time. It's up there with 'Showgirls'",
            "review_date": "2014-08-30",
            "source": "rt"
        },
        {
            "content": "A rambling, incoherent mess of a movie with one atrocious performance/decision after another. Everything is horrible: the acting, the music, the camerawork, the structure, the ending.... Dear God, the ending! In terms of whodunit, you can pick him out in the first fifteen minutes. On the awfulness scale, this falls squarely between \"Battlefield Earth\" and \"Gigli.\"",
            "review_date": "2014-08-28",
            "source": "rt"
        },
        {
            "content": "This movie is so dumb it's sad",
            "review_date": "2014-02-06",
            "source": "rt"
        },
        {
            "content": "Worst movie I've ever seen. Wow.",
            "review_date": "2014-01-20",
            "source": "rt"
        },
        {
            "content": "Here we have a Lindsay Lohan vehicle. I saw this film maybe a month ago, so this review can't be too official as I forgot about most of the film. That's how bad it was, a month later I forget about it and I forgot that I have even saw it until I'm reminded of it.\nTo begin, this has been considered one of the worst films of all time and for good reason. It has a 6% on here and I can see why. According to this site, it only has 4 good reviews. Were these 4 people who gave it a good review drunk or something? It doesn't matter. \nI forgot how this film starts off but I can say that the ending is just lame and somewhat predictable. For one, the acting, writing and directing here are bad but the visuals are not bad. I would compare it's used of color to that of Suspiria. \nI rated this 1.5 about a month ago and now writing a review. I would go into the plot but who really cares? Lohan plays a teen named Audrey Fleming who is abducted and is tortures and then escapes. After her abduction, she says she is a stripper named Dakota, which includes scenes of Lohan in a strip club performancing some dances. ( The lighting in the club is actually fantastic.) \nAnd, now remembering what the beginning of the film was like. it starts off with a striptease of Lohan. I guess writing this review is slowly bringing back flashbacks of this movie.\nI don't have much else to say about this film except that it is horrible and I wasted about 1 hour and 45 minutes watching it. TIme that I'll never get back.",
            "review_date": "2013-12-13",
            "source": "rt"
        },
        {
            "content": "Watching this film is like having a nightmare.  Let me explain because that almost sounds like I've got something against the film.  You see, I've never seen anything by Dario Argento so I have no idea how this compares to any of his work, but I can say that learning that the director of this film was inspired by Suspiria has me intrigued enough to seek out that Dario Argento classic.  What did I like about I Know Who Killed Me?  I like that the structure of the film is dream-like, that you have no idea whether the characters are who they say they are or whether they are who other people say they are.  You're also not sure if what has supposedly happened is what really happened or if it's just a delusion or if it will be revealed later on as a dream the character is having.  I was left wondering where the film was going, and I'll admit that I was unsettled by some of the imagery and by not knowing where things were going to go.  Whatever this movie was trying to be, it was working for me.  I was consistently disturbed by it and confused, and at no time did I feel so in a way that suggested I was disengaged.  I was never bored and I wasn't frustrated by it, and I didn't feel like it was trying too hard.  I found the act of trying to understand things more entertaining than if it had been done in a more comprehensible fashion.",
            "review_date": "2013-11-06",
            "source": "rt"
        },
        {
            "content": "1 star!\n\nVery freaky and creepy movie! Didn't really understand it to be honest!",
            "review_date": "2013-07-05",
            "source": "rt"
        },
        {
            "content": "worst movie ever,,,,no suprise ,this movie got 9 worst movie awards",
            "review_date": "2013-07-04",
            "source": "rt"
        },
        {
            "content": "As awful as you think it would be, don't watch this movie if you still wanna have faith in Lindsay Lohan's acting ability. Awful movie Half a star : Very Very poor.",
            "review_date": "2013-06-26",
            "source": "rt"
        },
        {
            "content": "Granted, this film actually had an interesting premise of split personalities and what not, but the execution was terrible. The Writers had a concept but had no idea what to do with it. No wonder this film received 8 Razzie Awards.",
            "review_date": "2013-05-11",
            "source": "rt"
        },
        {
            "content": "Unlike most of America, I like Lindsay Lohan. Been a fan since her Disney days. I don't agree with her lifestyle choices, but I can separate that from her work. This movie is nothing special, but it is watchable. Lindsay does a fair job (though she doesn't look comfortable in the pole dancing scenes), the story is interesting even if I didn't find the twist all that credible, and there is some decent effects featured in the torture scenes. Give it a shot on a slow night.",
            "review_date": "2013-05-10",
            "source": "rt"
        },
        {
            "content": "Wow, bad? awful? confusing? The acting was terrible, the plot and story were werid.",
            "review_date": "2013-05-01",
            "source": "rt"
        },
        {
            "content": "Lohanin elokuvat ei yleensa ole mitenkaan kamalan hyvia. Ei ollut poikkeus tama.",
            "review_date": "2013-04-29",
            "source": "rt"
        },
        {
            "content": "Not to everyone's taste but I adored it from start to finish.",
            "review_date": "2013-04-19",
            "source": "rt"
        },
        {
            "content": "Joel Schumacher meets Dario Argento. Surprisingly gory - what is it with strippers losing legs in cinema this year? Rose McGowan and Lindsay could start a support group.",
            "review_date": "2013-04-12",
            "source": "rt"
        },
        {
            "content": "this movie is hilarious. i suggest see it if you like bad movies.",
            "review_date": "2013-04-08",
            "source": "rt"
        },
        {
            "content": "Not since The Parent Trap have we seen double-Lohan. This is obviously a very different film, also a very muddled one. It never really seems sure of itself, there are elements of torture-porn, murder mystery and a form of psychedelic thriller that seems to have Lynchian ambitions. It never gets anywhere near those ambitions, instead it is just rather dull and frankly quite preposterous.",
            "review_date": "2013-04-04",
            "source": "rt"
        },
        {
            "content": "Twenty minutes in.  One star and dropping.",
            "review_date": "2013-03-30",
            "source": "rt"
        },
        {
            "content": "One of the worst movies I've seen!  No wonder Lindsay is on so many drugs.  Don't waste your time or money to see this film.",
            "review_date": "2013-03-25",
            "source": "rt"
        },
        {
            "content": "My friend told me about this movie and that she couldn't watch it. So I decited to watch it myself. I thought it was kind of good. There were a couple things in the movie that I thought were different in a good way. So it's good to see something different every now and then than the same thing. I  got confused a few times during the movie. So I would have to say that it is one of those movies you have to really sit and watch and pay attention to. I was mad that I didn't catch on to why the killer did things the way he/she did. But I give this movie 3 stars.",
            "review_date": "2013-03-14",
            "source": "rt"
        },
        {
            "content": "This was actually better than I expected, all-be-it rather messed up (i.e. strange).  Good though, not what you would expect from Lindsay Lohan.",
            "review_date": "2013-03-10",
            "source": "rt"
        },
        {
            "content": "A horrible disgrace to every horror film. Lindsey Lohan gives the worst performance that I have seen film making history. Plus, this movie is nothing but a fucking rip off of the Saw movies and the Hostel movies. God damn Chris Sivertson and Jeff Hammond for making this horrible horror movie.",
            "review_date": "2013-02-26",
            "source": "rt"
        },
        {
            "content": "this movie was pretty good.  i was thinking she was delusional but.... well i guess not now.",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "Stupid title. Stupid acting. But good story. Horrible. Horrible. Ending just awful.",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "Somebody put too much emphasis on artistic visuals than they did story. The whole thing is beautifully shot but it feels like there are entire bits of movie missing. I mean, what happens with the boyfriend (who just disappears halfway through) and the mother when they are confronted with the twins? The movie fades out and rolls the credits where an epilogue should be.\n\nHaving said that, Lindsay is actually quite good in this. Except for lines that require her to swear. It's like she can't bring herself to deliver them with any kind of conviction. This was 2007 though. Now she probably has the biggest potty mouth this side of Julie Andrews.",
            "review_date": "2013-02-11",
            "source": "rt"
        },
        {
            "content": "I know who killed your career, too!\r\n(Hint: It was herself)",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "It was a seriously weak movie. Some parts were ok but the ending was weak!!!!",
            "review_date": "2012-12-30",
            "source": "rt"
        },
        {
            "content": "nice twist at the latter part...",
            "review_date": "2012-12-27",
            "source": "rt"
        },
        {
            "content": "Weak movie.  I didn't really find it confusing like some other people have.  It was poorly written and directed.  A decent plot idea that was botched.",
            "review_date": "2012-12-27",
            "source": "rt"
        },
        {
            "content": "I'll see you in Hell for making me watch this, Chad...",
            "review_date": "2012-12-25",
            "source": "rt"
        }
    ]
}