{
    "rating": 8.7,
    "release_date": "2007-08-17",
    "num_reviews": 790,
    "genres": [
        "Comedy"
    ],
    "summary": "High school seniors Seth and Evan have high hopes for a graduation party. The co-dependent teens plan to score booze and babes so they can become part of the in-crowd, but separation anxiety and two bored police officers complicate the pair's self-proclaimed mission.",
    "reviews": [
        {
            "content": "Not a bad flick with some good laughs. Good intro to seth rogen / jonah hill comedy genre.",
            "review_date": "2023-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great utopian movie about Riku's, Samuel's and Oskari's attempts at getting women. The scenes of them with the women were not the most realistic but the personalities of them were on spot. Riku and Samuel, as expected, were extremely gay at the end. One thing I really liked was the details, such as Riku having the exact same pants as in real life. Oskari also looked alike. Sami should have had more screen time because he is a big part in the real story. There were lots of women in the movie which I liked a lot. Overall it was a good movie with great realism and detail.",
            "review_date": "2023-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely the best teen comedies ever made. It feels as if the writers wrote this in high-school as they were being picked on for being nerds.",
            "review_date": "2023-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one is a little more dated than I remember. But it's another one of those movies that perfectly captures a certain period of time. In this case, high school seniors in 2007, which I was at that exact time. It's a little longer than I remembered as well, could have trimmed it up a bit. Still very good though, brings the nostalgia hard. 8/10",
            "review_date": "2023-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You love Superbad, I love Superbad, everyone loves Superbad.  It's well known that Superbad is one of the best comedies of all time.  Every single person in here emits perfect comedic genius throughout the entire runtime.  Jonah Hill, Michael Cera, Christopher Mintz-Plasse, Bill Hader, Seth Rogen, Emma Stone, and more.  Every moment of Superbad is about as perfect as you can get with a comedy and it's probably one of the most rewatchable films of all time for me.",
            "review_date": "2023-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So bad. If you're into self harm this is the right choice. Had to skip every scene every 5 seconds.",
            "review_date": "2023-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LOL, 01 hour: and 53 minutes, plus unrated footage not seen in theaters!!!!!!!!",
            "review_date": "2023-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bill Hader and Seth Rogan define what cops shouldn't do but the result is hilarious and this movie is great.",
            "review_date": "2023-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First rewatch since it came out. It's astonishing how many people became stars coming off of this one. Also a great seeing how many had their chops all along.",
            "review_date": "2023-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two dudes get alcohol, run from law enforcement, and commit multiple felonies in an attempt to get some puss",
            "review_date": "2023-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Iconic high school movie. 10/10 seen it a billion times as a kid, teen, and adult.",
            "review_date": "2023-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is a hilarious film with a serious undertone about the end of adolescence and the start of adulthood. Jonah Hill's performance is funny, but Michael Cera and Christopher Mintz-Plasse shine as the true stars. Bill Hader and Seth Rogen also deliver scene-stealing moments. A fun and entertaining R-rated movie, it offers great laughs and a relatable theme, particularly for younger audiences. Overall, I would rate it an 8 out of 10.",
            "review_date": "2023-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its kinda like a you scratch my back and I'll scratch your back situation. I think everyone has come to the same conclusion that Mclovin and the cops are by far the better and funnier half of the story.",
            "review_date": "2023-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was not a disappointment and was worth the see, if you haven't seen it yet, watch it right now.",
            "review_date": "2023-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classical comedy movie which also serves as a coming of age movie. The cast is spectacular and their phenomenal chemistry is evident throughout the movie. I highly recommend this movie to anyone looking for a good laugh!",
            "review_date": "2022-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious and dumb. Well done and worth the watch",
            "review_date": "2022-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although its characters feel a bit over-the-top at times with some wooden dialogue, Superbad is a funny and focused film that immerses you into the college experience with top-notch performances on all frontiers.",
            "review_date": "2022-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On paper, Superbad looks like just another teen comedy in a genre that has exhausted itself over the last couple of decades.  Two guys (Jonah Hill, Michael Cera) are graduating from high school and embark on an epic journey to secure alcohol for a grad party, hoping to have their way with the girls of their dreams when they arrive.  What separates Superbad from most movies of its kind are some fantastic set pieces (the iconic scene of McLovin at the liquor store, for example), a lot of crude but hilarious dialogue, and, most importantly, the fact that the two protagonists actually learn something about themselves over the course of their eventful evening.  Superbad has as many laugh-out-loud moments as any movie in recent memory.",
            "review_date": "2022-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great teen comedy years in the making",
            "review_date": "2022-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite comedy of all time.",
            "review_date": "2022-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had A LOT of fun with \"Superbad\", and I'm not embarrassed to say this loud. I mean, I had fun with \"American Pie\" as well. Comedy is far from my favourite genre, but like everyone else, I love to see one when I want. And comedy is the easiest genre to review because it doesn't need to have either a talented cast or a plausible story, it only has to be funny. Only. That's the whole point (as I reviewed this film 8/10, it means 80% of the humour works). But as I touched on these two points, I will analyse them only because yes. Is the cast good? YES. Even though Jonah Hill is a lot older than Michael Cera and Christopher Mintz-Plasse (Hill was 24, Cera was 19 and Mintz-Plasse was 18), he's passable as a desperate-to-sex newly adult. And he's hilarious, come on. Speaking about the two other guys, Michael Cera is the nerd one, and he fits perfectly the role, and McLovin, I mean, Fogell, I mean, Christopher Mintz-Plasse is the soul of this project alongside Jonah. And is the story plausible? ABSOLUTELY NOT, this is possibly the most absurd plot I watched since \"Micmacs\", and the story escalates so fast that it's impossible not to be immersed. And Bill Hader and Seth Rogen are one of the best cop duos ever. Oh, and an honourable mention to Martha MacIsaac and Emma Stone as Evan's and Seth's crushes. I would say something more here, but it would be a massive spoiler, so this review ends here. I should watch comedies more.",
            "review_date": "2022-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice young people drawn into nasty, foul-mouthed mysoginistic Hollywood vision of humanity where vile behaviour is not only acceptable but hilarious. Amazing how critics now can see the whole Rogan/Sandler/Apatow schtick as ‘of its time' and say some movies couldn't be made in our more enlightened time now. They shouldn't have been made then, and you should've known it. It's not that these types of film can't be made - The Farrelly brothers took risks and trod a fine line, mostly successfully - but if it's ok to make dumb films for teenage boys, justifying and celebrating teenage boy behaviour, don't be surprised when some of those teenage boys grow up to be Weinsteins.",
            "review_date": "2022-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "mclovin makes this film i love it",
            "review_date": "2022-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OMG, this movie it's hilarious, make remember that old good days when you were an idiot, you and your friends.",
            "review_date": "2022-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "gross, 2 hours of my life ill never get back",
            "review_date": "2022-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never ceases to crack me up. Brilliant comedy",
            "review_date": "2022-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched it three times. It's just a perfect example of a tennager-comedy film.",
            "review_date": "2022-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of best comedy’s of all time",
            "review_date": "2022-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is the Perfect Movie",
            "review_date": "2022-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A hilarious catch phrase-filled teen comedy. Super rude, super crude, and very often super funny. Some slow moments with some jokes that don't work, but overall a fun time. Catch phrase of the summer? \"I am McLovin!\"",
            "review_date": "2022-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although its characters feel a bit over-the-top at times with some wooden dialogue, Superbad is a funny and focused film that immerses you into the college experience with top-notch performances on all frontiers.",
            "review_date": "2022-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better Good Boys. Way funnier and better characters (looking at you, Mclovin).",
            "review_date": "2022-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don’t get me wrong, I really love this movie, but it starts to drag on towards the end. Besides that, this movie was filled with laughs and iconic moments.",
            "review_date": "2022-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is a 2007 American coming-of-age teen buddy comedy film directed by Greg Mottola 👮‍♀️ \n\nIt's very good! 😀\nI'd recommend it 👍🏼\nDefinitely one for the boys…\n\nCOME AND GET SOME!",
            "review_date": "2022-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's funny and I liked it I don't really have much more words for it.",
            "review_date": "2022-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious from beginning to end, well balanced, and a good dictatorship on an awkward high school ending. Even with the stand-out comedy that is the premise of the film, Superbad shows us a strong bonded connection between the protagonists that we can all but love",
            "review_date": "2022-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Movie!! Superbad gives me nostalgic vibes when it comes to older comedies and it doesn't disappoint one bit!! Definitely one of the better comedies!",
            "review_date": "2022-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The cast was very good and star-studded, but the film itself fell short, even in the comedy department. The McLovin license was funny at first, but got really old really quick. I also thought that at some points, the film tried too hard to be funny and edgy. Comedies aren't usually good as films, and this was no exception.",
            "review_date": "2022-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Movie is just amazing",
            "review_date": "2022-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's a reason my brother and I watched this every single night for an entire summer back in the day",
            "review_date": "2022-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic comedy that is very relatable for us millennials growing up in high school. I truly believe this will become a staple of comedy one day",
            "review_date": "2022-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's one of my favorite movies and in fact one of the best. Great humor and extraordinary friendship development between the leads, I love this movie so much and everything about it, the end of high school and how they want to be the guys before college. I actually laugh every time I watch it. I recommend.",
            "review_date": "2022-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun, stupid jokes but very funny. Seth Rogen is the best. Must watch",
            "review_date": "2022-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am not a fan of bad words and so I really did not like this movie and I am sure I will take some flack for this but this movie is designed for teenagers who want to be Superbad!!!",
            "review_date": "2022-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fun and perfect, just that.",
            "review_date": "2022-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great, funny, relatable film for all, Superbad is super bad!",
            "review_date": "2022-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absurdly funny movie of teenage angst with the perfect actors.Of course some scenes are unrealistic but they're still funny as hell! Sit back and enjoy!",
            "review_date": "2022-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Iconic to the Millennial generation. Every aspect of this movie is hilarious.  Years later, still good.",
            "review_date": "2022-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie very much, I'm net kidding when I'm telling you that I re-watched it al least 20 times, it's that good, the jokes get me every time (even though I got half of the script memorized), I'm just such a fan of this movie, I recommend you watch it, it's the best!!!",
            "review_date": "2022-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lots of a crude humor in this movie that a high school student would definitely enjoy. Insanely funny. 5/5",
            "review_date": "2021-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful film for young people, fun and irreverent that deals with the problems of young teenage friends in a very strong way. In general, the plot is a little sombre but not trivial and has moments that seem not so well written",
            "review_date": "2021-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I LOOVEEEDDDD IT!!!!!! THIS IS ACTUAL ART lol",
            "review_date": "2021-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A phenomenal classic comedy that will most certainly stand the test of time for many years to come. Mixed with its comedy aspects is also a deeper subplot regarding friendships. A fantastic film. -Fennett",
            "review_date": "2021-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad mixes the teen movies from the early 2000s with a 16+ rated type of comedy. It is really funny",
            "review_date": "2021-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok, the movie is good and fresh, there are 1 or 2 times where it may try too hard to show the typical movie teenager, but it does not fail to be funny and it guarantees at least 1 or 2 laughs.",
            "review_date": "2021-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5 stars just cause you have to watch this movie, I can't name on person that I haven't talked to at college or work place that isn't my age that hasn't seen this movie, my parents who are in their 50's have seen it lol. good movie more you watch it the worse it gets honestly (disclaimer)",
            "review_date": "2021-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Teen High School flick with a great cast and some genuinely funny moments. Follows three friends looking to get some lovin' before graduating, and shows a number of mishaps and blunders as they navigate their way through it all. Great if you love Apatow, Rogen, Hill, etc.",
            "review_date": "2021-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is amazing and a classic for anyone who went to high school around 2003-2011. It nails life around that time and makes me laugh so hard every time I re-watch it. My favorite movie of all time and I would give it 10/5 stars if I could!",
            "review_date": "2021-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It brought to life a coming-of-age with more laughs than morality. The toilet humor wasn't funny. 7/10",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Comedy movie ever 😂",
            "review_date": "2021-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best. Funny and a great story about friendship.",
            "review_date": "2021-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brings me back to high school...for all the right and wrong reasons.",
            "review_date": "2021-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my top ten comedies of all time.  The star power alone that came from this film says it all.",
            "review_date": "2021-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love it so much I watched this endless times!",
            "review_date": "2021-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The pinnacle of comedy!",
            "review_date": "2021-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Alright acting, mediocre music and a decent plot. 6.5/10",
            "review_date": "2021-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best teen sex comedy ",
            "review_date": "2021-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this movie was good, however it isn't extraordinary or great in any particular way. I like the story and some of the parts are hilarious, and overall I think it's pretty good, not bad not amazing.",
            "review_date": "2021-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its funny, realistic and downright stupid.",
            "review_date": "2021-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So much fun.  Seth Rogen and Judd Apatow team up to create a hysterical and reflective teen flick with an adult sensibility.   Jonah Hill and Michael Cera lead this cast of amusing characters in search of liquor, love, and popularity.  Some very memorable scenes and lines make this one that you see again and again. Seth Rogen and Bill Hader are very funny as two police officers. Christopher Mintz-Plasse, as McLoven, is amusing in every scene. This one has heart too-not just laughs.  This one holds up.",
            "review_date": "2021-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies of all time! Natural fluid character development and honest writing.",
            "review_date": "2021-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The pioneer of teen comedies, maybe stay away from this one if you're not a fan of slapstick and over the top sex jokes however.",
            "review_date": "2021-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is a must see. It's a funny high school comedy. Great cast, great jokes and just a great movie.",
            "review_date": "2021-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a pretty good comedy, all the characters are pretty good Christopher mints plasse who plays mclovin, and the cops Seth roger and bill hader are funny but Jonah hill is the funniest of all.",
            "review_date": "2021-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent but not great. The ending felt unfitting and seemed to legitimize the characters' actions while almost glorifying their behavior. Some of the jokes were brilliant, but there were a few misses. Cera and Hill were alright if unremarkable as the leads.",
            "review_date": "2021-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I laughed my ass off the whole time, it feels so long yet so short, it needs a sequel",
            "review_date": "2021-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is fun and really funny to watch and when your watching the movie you won't get bored is amazing love it and recommend it",
            "review_date": "2021-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "93%. Movie is filled with incredible one liners. Jonah hill is truly incredible in this movie",
            "review_date": "2021-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now here's a long overdue comedy sequel done right. Kevin Smith does not sell out and give us a bunch of watered down PG-13 humor, in fact, he gratuitously piles on even more tasteless X rated humor than before. But under all of it's tastelessness it surprisingly has a really big heart, something the first film didn't have. Perhaps it's too sentimental for some fans, but that's exactly what makes the film work this time  around. Well written. Clerks II is without a doubt the Jeff Anderson show, which is on purpose. Kevin Smith had to coax him into returning by giving him a meatier and much deeper role this time around........and he kills it.",
            "review_date": "2021-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is so funny. Jonah Hill is such a great actor. The writing is executed very well.",
            "review_date": "2021-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was far from a bore, I laughed the entire way through the film, it's definitely another must watch",
            "review_date": "2021-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favourite comedies. It portrayed being in High School perfectly. The funny situations that come from it. As funny as this movie is, the characters upset that they might not be together as much at college was a great touch. Made the characters in this movie so real, and relatable. Everyone is great and funny in this movie. Christopher Mintz- Plasse stole the show as Fogell/ Mclovin. Great script and directing.",
            "review_date": "2021-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious film.Masterfully wrote by Seth Rogen and Evan Goldberg. ",
            "review_date": "2021-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Darned funny with a heart to boot.",
            "review_date": "2021-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie, one of the best comedies of all time.",
            "review_date": "2021-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies I´ve ever seen....",
            "review_date": "2021-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best comedy's out there. Constant witty and profound humour throughout. Jonah hill deserves an Oscar for this! Favourite movie of all time.",
            "review_date": "2021-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad has some pretty funny moments, but those are overshadowed by a weak story (Can't Hardly Wait did it better) and persistent perverted & vulgar language. I get that shock humor and raunchy jokes appeal to some audiences—it's not my style of comedy. I prefer clever dialogue instead of a movie just trying to offend me into laughing. It's pretty obvious Seth Rogen and Evan Goldberg wrote this when they were kids. It's a very immature movie.",
            "review_date": "2021-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cult comedy, but nothing special in fact.",
            "review_date": "2021-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hmmm, this was problematic. It's offensive, sexist, homophobic. And sometimes hilarious. Hate the characters. With a passion. They are all vile, evil caricatures. The film, however, is funny. It's not great, but it could be a lot, lot worse.",
            "review_date": "2021-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another coming-of-age, stoner, teen comedy adventure, exotic romantic that successfully tries to be differentiable by having Bill Hader as the adult point of view and being written by Seth Rogen",
            "review_date": "2020-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a classic 2000's film, and it's not my favorite movie ever, but it gives lots of laughs and tons of fun.",
            "review_date": "2020-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've literally seen this movie at least 50 times and it still makes me laugh out loud. Each member of the cast does an excellent job of making their character feel real. Jonah Hill and Michael Cera have a chemistry that makes it feel like they are actually best friends. This is a timeless coming of age comedy.",
            "review_date": "2020-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not enough can be said about this gem. Just simply brilliant and often extremely hilarious. Acting is top notch and helps to give the film a deeper feeling than other films of this sa.e style. The directing and writing are the other aspects that drive this through the roof. Very enjoyable characters, story, situations and all shot beautifully. Fantastic comedy.",
            "review_date": "2020-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very mid 2000s movie. One of best from that era.",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really expected this to be a lot funnier. I mean sure, it was funny, but it wasn't the roaring, crying, long-lasting kind of funny that I was really hoping for. The cast was great and they all gave entertaining performances, it's just that the jokes simply weren't that funny. That being said, it's still pretty entertaining and it's kind of a cultural thing at this point, so I guess it's worth watching. Booksmart is much better though.",
            "review_date": "2020-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good watch, would watch again, and can recommend.\n\nI've watched this movie several times, but had a couple different reactions: sometimes I agree this is overhyped, other times I'm completely in line with why it was overhyped.  You mood might be a factor in your movie watching, it's all I'm saying.\n\nOverall, this is decently funny in dialogue, delivery, and writing.  The movie is full of cringe humor and ridiculous circumstance, it's essentially designed so the characters have a good story to tell later on, and it definitely meets the criteria.  The big problem is that it's a high school, \"let's get laid adventure\" starring 2 idiots and their idiot friend.  I've never seen 2 guys work so hard to prevent themselves from their actual goal.\n\nWhen you look a little closer too, it's really two movies wrapped around each other.  \"McLovin\" could have been its own movie, but neither story really has enough meat too it.  \"These high schoolers tried to get alcohol to impress girls for this party.\" is the whole movie, but it's so much more fun of an experience than that.\n\nYou're not going to get a rich and fulfilling story, though they try to make it into a life lesson in a traditional \"coming of age\" style, but it's a pretty funny movie, if a little over the top.",
            "review_date": "2020-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You know the movie is actively hilarious when you're still laughing at something that was said 5 minutes prior.",
            "review_date": "2020-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the funniest movies I've ever seen and a comedy classic",
            "review_date": "2020-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny fantastic story and pretty interesting and crazy but really rude",
            "review_date": "2020-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was expecting more actually, but it has its moments.",
            "review_date": "2020-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seth ruins almost everything he touches. How do people not start to hate him or find him annoying with all these movies he’s staring in. Talk about overexposure like I’ve never seen it.",
            "review_date": "2020-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was SO boring the characters weren't anything special and Johan Hill's character sucked ass. The jokes rarely landed and the acting wasn't that great from it's main leads. Seth Rogan is always a plus since he's normally the best part of these movies.",
            "review_date": "2020-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the funniest films I've ever seen. It takes a high school comedy, sprinkles it with crude humor, absurdism, and slapstick comedy. I laugh out loud every time I watch it, even after numerous rewatches. It doesn't stand up with its political correctness, but it certains stands up with every other aspect. Plus, I don't expect anything appropriate or non-offensive from a trio of high school kids. On top of the impeccable comedy, there are excellent performances from the leads and masterfully quirky editing that loves to show cutaways to featured extras or anecdotal scenes. Also, it has some of the cutest and most wholesome moments in a coming-of-age comedy.",
            "review_date": "2020-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A comedy sure to appeal to pubescent boys for many generations to come, it also contains little nuggets of comedy gold, and shows a lot more heart than the crude jokes, male objectivity of the female, and misplaced instincts of its main protagonists let on at first. Because, surprisingly, underneath all that, it's a perfect summation of the loss of one's sublime wonder years; and in some ways the relationships that went with it. But more importantly, it perfectly shows the fear we try to ignore, but inevitably must face, as we prepare to embark with that first step on the road to adulthood. Actually Stephen King may have summed it up best in that great little story he wrote called \"The Body\" (which became the movie \"Stand By Me\"), when at the end we flash forward to one of the young protagonists as a now middle aged adult, as he's reflecting on that particular period in his life, long gone to many years - \"Friends come in and out of your life...I never had any friends later on like the ones I had (when I was a kid)...Jesus, does anybody?\" And no matter how old one gets, or what generation those pubescent boys grow up in, and what year THEY inevitably become middle aged, I think that answer will always be a resounding \"NO\". This movie encapsulates that to perfection.",
            "review_date": "2020-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A go to movie when I need a laugh!!",
            "review_date": "2020-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't get the whole line of Judd Apatow comedies.  Mildly funny.",
            "review_date": "2020-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest comedy and coming of age movies of all time.",
            "review_date": "2020-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A funny and smarter-than-average teen film.",
            "review_date": "2020-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ages well (the gay jokes can be cringe, but those were realistic for the times) One of the greatest comedy cult classics. They just don't make them with all star line ipa these days.",
            "review_date": "2020-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you like knocked up and the 40 year old virgin, then this is best comedy to watch. Jonah hill and Micheal Cera are the best part of the movie, it’s about nerdy teens getting alcohol to a party and it gets hilarious AF when Seth Rogen and Bill Hader playing as cops. This movie is on the top 3 best comedies of all time.",
            "review_date": "2020-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best comedies ever made",
            "review_date": "2020-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie will be a classic. Your kids, kids will be watching it. It's one of those rare comedies that has great acting and well thought out plot.",
            "review_date": "2020-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First movie I ever snuck into at age 16. It's a perfect comedy and actually a good movie with heart. Above all it's actually realistic to how late high school and transitioning into adulthood can go at times",
            "review_date": "2020-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredibly fun and immersive, it is very digestible and memorable, without a doubt one of my favorite comedies of recent years.",
            "review_date": "2020-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was pretty funny and a load of fun to watch.",
            "review_date": "2020-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the recent staples of comedy. -Go",
            "review_date": "2020-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A funny albeit vulgar coming of age comedy that features an accurate depiction of friendship and how awkward it is to be at high school.",
            "review_date": "2020-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is funny at times but it is mostly an unintelligent raunch fest. They should have just given the McLovin character his own film.",
            "review_date": "2020-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its so funny I loved all the characters so much it was hilarious this is a must see I started crying of laughter I absolutely loved it and i 100% reccomend it rent or buy in now you won't regret it",
            "review_date": "2020-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "9.0/10 I first saw this as a high school senior but it still holds up at I approach 30. ",
            "review_date": "2020-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In this crass in-your-face sex comedy, the thing that really makes it stand out to me [aside from the humor of course], is the subtext to everything we're watching. The problem with most movies like this is they have a-hole lead characters and they drift from gag to gag until a slapped on ending with fake sincerity in which the jerks we've been watching the entire film turn out to be great guys all along. However, with Superbad, I'm rooting for all of these characters from beginning to the end when we see schlubby Jonah Hill somehow land Emma Stone, I'm rolling with it. Probably my favorite apple off of the Judd Apatow tree of comedy.",
            "review_date": "2020-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The perfect teen movie. It's vulgar, hilarious, touching (at moments), and a true coming of age tale for young people finishing their adolescence and trying to come to grips with the reality of becoming an adult. Jonah Hill, Michael Cera, and Christopher Mintz-Plasse have impeccable chemistry with one another and their deft interplay really lends to the realism of these teens. Far too often in teen movies it is clear that much older writers had far too heavy a hand in crafting the dialogue, which is generally clunky and unrealistic. I, and likely many other viewers around my age, felt that these were just like the kids I went to school with. We joked around the same way, in the same manner, and had many of the same struggles. The film manages to balance the realism of the teens with the absurdity of their night out on the town. Their reactions always felt genuine despite the increasingly chaotic circumstances they were put in. The humor was fantastic, a credit to the writing prowess of Evan Goldberg and Seth Rogen. The awkward moments were surprisingly lighthearted and easy, due largely in part to the actor's terrific performances, solid directing, and excellent writing. Overall, it's an essential watch and is, in my opinion, one of the best teen movies ever made.",
            "review_date": "2020-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Makes me laugh like few movies can. It's a comedy classic.",
            "review_date": "2020-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it is a funny movie i really enjoyed watching it",
            "review_date": "2020-02-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked a lot the way the story goes on",
            "review_date": "2020-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is so satisfying to see Superbad excel (where many others fail) at accomplishing numerous belly-laughs in teen comedy.",
            "review_date": "2020-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is my favourite comedy of all time. Mclovin as a character is a blast too watch while Michael Sera and Jonah Hill, 2 brilliant actors focus on getting booze to the party. The acting of the main characters reveals a great undertone of anxiety which makes them more relatable. These events can happen to you.\nIt's such a fun movie with hilarity sprinkled in through the whole thing, One of the most incredible movies ever made.\nPlus the opening scene is the best ever.",
            "review_date": "2020-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "GREAT, would highly recommend!",
            "review_date": "2020-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've seen this movie more than 100 times in my youth! love it every second!!",
            "review_date": "2020-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "some of the funniest shit ive ever seen",
            "review_date": "2020-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is an hilarious comedy involving three bros that leaves you laughing and happy as they take on their final year of high school.",
            "review_date": "2019-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An all around great cast makes for some of the best high school shenanigans ever put on the big screen. (B+)",
            "review_date": "2019-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This to me will always be the best high school partying movie",
            "review_date": "2019-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic !! Easily one of the funniest movies of all time.",
            "review_date": "2019-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sometimes funny, but overrated! Some people say that Superbad is one of the best comedy movies of all time, but i definitely disagree! But still pretty good! 6/10",
            "review_date": "2019-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic. The classic of the decade. Enough said",
            "review_date": "2019-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was absolutely amazing I absolutely loved it so good I definitely recommend and it’s just awesome and it also a movie that I am going to give an A+",
            "review_date": "2019-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is a really really good movie...with Superb characters... You can watch it numerous times... Only good movie by Seth Rogen....",
            "review_date": "2019-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super Cute, in a filthy way.",
            "review_date": "2019-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When I watch movies like Superbad all I can do is wonder, “Do other people really act this way?” I mean do other guys talk so explicitly about their penises, sexual needs, and other topics like that? I know I had a small friend group and grew up in a generation prior to the 2000s, so perhaps I’m just out of touch with kids of the 2000s. If this is the norm, then I’m glad I had an abnormal adolescence, because these kids are vile. Watching them objectify women, berate one another, and abuse alcohol so freely makes me want to punch them in the face. The main satisfaction that I got from the film was watching Jonah Hill’s character get hit by a car multiple times. If only he’d broken some bones! I did not laugh at their exploits, and found some of the elaborate detours they took to be downright boring. They spent way too much time at this one party (that a crazy person drove them to) simply because they thought there might be an opportunity to steal some booze. This entire location was pointless and did absolutely nothing to move the story forward. Then there’s the whole McLovin adventure. In all honesty, this is what the whole movie should have been. While Fogell isn’t much more endearing than his friends, he has a goofy earnestness that they lack. He doesn’t seem to be so singularly focused on getting a girl drunk to have sex with her, and I guess I “admire” him for that. To be fair, this entire subplot of the film is utterly ludicrous and feels like it was pulled from an SNL sketch or something. Seth Rogen and Bill Hader as the irresponsible cops are insane and constantly do things that make no sense for no reason. Their foolishness was just crazy enough to be mildly humorous. Sadly, the movie wasn’t really about McLovin and the sketch cops. We had to spend more time with Jonah Hill screaming about period blood and Michael Cera doing next to nothing memorable. I think he horribly sang a song or something, it kind of slips my mind. As a whole, Superbad was so completely not a film for me that it made me actively annoyed with its protagonists. There were moments of reprieve from some of the supporting cast, but not enough to make this a movie I enjoyed.",
            "review_date": "2019-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "seth, mclovin and officer slater make the foundation of the movie and it wouldn't work without these characters.",
            "review_date": "2019-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is all the cliched tropes about doing stupid stuff to get the girl.  There is an insanely overdeveloped obsession with alcohol.  And the jokes are just gross and crude.  I can see why this film has a cult following.  For me, this film was a disappointment however.  Watching this more than 10 years after its release, it already seems dated - much of what was more shocking then has been done to death since (think like ANY Ashton Kutcher film, future Apatow films, etc), and the movie was oversold, so I was expecting more.  This doesn't make it a bad movie, but it seems like it would be more relevant had I watched it 10 years ago.\nI DID find myself smiling in places, but just not enough there for me.  A younger audience might appreciate this film more.",
            "review_date": "2019-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Top 5 comedy of all time ",
            "review_date": "2019-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, plot doesn't go to fast or too slow, characters are realistic and comical, all  around great movie!",
            "review_date": "2019-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Human comedy at it's finest 👌",
            "review_date": "2019-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I highly recommend this great coming of age story to all teenagers. The movie is relatable, actually funny, and full of heart.",
            "review_date": "2019-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic to the Comedy genre and a movie to watch without getting bored",
            "review_date": "2019-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Came out at probably the last time a movie could come out and be edgy. This movie is not politically correct and it rules because of it. ",
            "review_date": "2019-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is the worst.",
            "review_date": "2019-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great cast fresh new comedy and interesting idea to be developed it's a must see for comedy fans and anyone else who loves great films",
            "review_date": "2019-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is an insult to your intelligence. Not only is it not funny, but it's kind of a rip off of American Pie which is another dumb movie. Seriously, it's just another film that glamorizes teen sex.",
            "review_date": "2019-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good, but a little dated now.",
            "review_date": "2019-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Iconic, I grew up with this movie and it's the most relatable teen movie of the deca",
            "review_date": "2019-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie of all time. ",
            "review_date": "2019-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm upset for you if you haven't seen it. ",
            "review_date": "2019-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good childish fun + some awkward conversations.",
            "review_date": "2019-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It’s one that’ll truly make you laugh out loud!",
            "review_date": "2019-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious dialogue. Great fim editing. Great pace throughout. Very witty writing. You will laugh throughout the entire film.",
            "review_date": "2019-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best coming-of-age of its generation, Superbad is a fun ride fueled with awkward, yet charismatic characters. ",
            "review_date": "2019-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "About as funny as teen comedies get",
            "review_date": "2019-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bill Hader, Seth Rogen and McLovin and cops could be the greatest sequel ever. This movie is absolutely hilarious and enjoyable because of the little things.",
            "review_date": "2019-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As stupid as this movie was, it was amazing. It was on the line between stupid and on the other hand it was hilarious. The jokes were clever and some were just dumb. The movie beautifully shows the crossing into adulthood.",
            "review_date": "2019-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Witty, relatable, and hilarious, this hits the mark as one of the best comedy movies ever.",
            "review_date": "2019-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie needs to be watched just for McLovin. Has an excellent cast and a great movie to watch with friends",
            "review_date": "2019-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best comedies of all time... a CLASSIC",
            "review_date": "2019-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh it’s Superbad alright. Absolutely painful to watch. ",
            "review_date": "2019-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favourite films ever.",
            "review_date": "2019-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some brilliant LOL moments, an excellent choice when drunk or recovering from being drunk.",
            "review_date": "2018-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Around 95% of these lines are something vulgar and/or raunchy, normally the stuff I really don't get into. I am not always a fan of comedies that totally rely on the raunchiness. Yet, due to the chemistry between the main characters, its surprisingly level of heart and likability (mainly in the third act) and its (mostly) authentic take on the awkwardness of High School and friendship, Superbad is a completely raunchy movie that I actually enjoyed seeing.",
            "review_date": "2018-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This rated R film directed by Greg Mottola is hilarious and one of the greatest movies I have ever seen. This movie was filled with hilarious and serious parts, I did not enjoy those parts.  Superbad is about these three nerdy high school seniors were invited to a gigantic house party and they said they will bring alcohol to supply the party and to impress these girls. But it was not so easy and they went through a lot to get it. Mclovin was personally my favorite character. I watched other comedies some of the comedies I enjoyed like Why Him. Lots of comedies where not funny but this movie and others managed to do it. Even though itï¿ 1/2 1/2(TM)s an old movie I still would recommend it and watch it over and over again, I say that was 2 hours of my life well spent. (4 stars out of 5)",
            "review_date": "2018-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious comedy that is so well written and stands out from dozens of teen comedy movies that go before it. Quotable and loveable.",
            "review_date": "2018-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Me and my boyfriend Josh Mclovin this movie it's better than any Adam Sandlar movie. Cause he isn't Mclovin and my boyfriend looks like him so I just make out with him and it's so hot and he's hot and Adam Sandlar is not. so yeah lol. I love the grinch so much.",
            "review_date": "2018-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "maybe I'm just to old at 65, but this was a load of codswallop to me! with all the good reviews I thought I was in for a treat, just stupid teenagers,looking for booze and gals all the time, mainly booze! turned out the main 2 are gay anyway! hahhahhahh ....the only funny bit innit! well, there were a fewchuckles in places,Superbad is a VERY GOOD TITLE for it! :)  but it was so long as well, what a relief when it ended!",
            "review_date": "2018-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad works great as a comedy about a bunch of misfits in school and the usual clichés of losing virginity, hanging with the cool crowd, shenanigans that get one into trouble with the law and all that. This film consists of Michael Cera, Jonah Hill, Seth Rogen, Bill Hader- a troupe with many comedy movies to their name. The film is consistently funny and because many of the actors have already made a name for themselves in today's entertainment industry it is fun to go and watch them here especially Jonah Hill who is today considered a major actor, but back then he was just a fat kid tryin to hit it big. (Consistently funny comedy caper).",
            "review_date": "2018-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best comedies that defined an generation after it was released. \"Superbad\" is a relatable, vulgar experience that will burst your guts with laughs and remind you the importance of friendship during the awkwardness of high school. Some people might not enjoy the rated r jokes, but for those who do, you will have a helluva time.",
            "review_date": "2018-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For some reason this one didn't do much for me the only time i was really laughing was the scenes with the cops.",
            "review_date": "2018-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is a good stoner movie and probably the start of a new group of actors and filmmakers who would go on to make many such films. You know- Seth Rogen, Michael Cera, Jonah Hill and the likes. This one is well made and consistently funny. Its strange to think that many of the cast here are big stars now but this is where it began. It's a coming of age story which is hilarious and makes you ponder at the same time.",
            "review_date": "2018-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A problematic film with sexist representation of women",
            "review_date": "2018-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of my favorite movies ",
            "review_date": "2018-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is a good stoner movie and probably the start of a new group of actors and filmmakers who would go on to make many such films. You know- Seth Rogen, Michael Cera, Jonah Hill and the likes. This one is well made and consistently funny. Its strange to think that many of the cast here are big stars now but this is where it began. It's a coming of age story which is hilarious and makes you ponder at the same time.",
            "review_date": "2018-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is a good stoner movie and probably the start of a new group of actors and filmmakers who would go on to make many such films. You know- Seth Rogen, Michael Cera, Jonah Hill and the likes. This one is well made and consistently funny. Its strange to think that many of the cast here are big stars now but this is where it began. It's a coming of age story which is hilarious and makes you ponder at the same time.",
            "review_date": "2018-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only good parts of this movie are Mclovin and the resolution to the plot line. Otherwise I was bored to tears",
            "review_date": "2018-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How did you land between Muhamed and Mclovin? is there anything else to say.",
            "review_date": "2018-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic comedy that always lifts my spirits.",
            "review_date": "2018-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Couldn't stop laughing the entire movie.",
            "review_date": "2018-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad, though vulgar, might be the funniest movie ever made.",
            "review_date": "2018-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious, awkward, and raunchy, this coming-of-age story is one of the best high school comedies ever made.",
            "review_date": "2018-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun, crude comedy. \n\nOperating under the assumption that by procuring alcohol for an upcoming party they will finally be able to break their longstanding losing streak with the fairer sex, socially inept high school seniors Evan (Michael Cera) and Seth (Jonah Hill) set out to secure the adult beverages that could get them off of the geek list before they even attend college orientation.\n\n\"Superbad\" is a film title that's been thrown around for a while and for a decade, I had never watched it. There was no particular reason as to why I didn't watch it, it was just one of those films that I hadn't gotten to yet. And here's the thing with comedies; comedies can be hilarious. We all love to laugh and smile. But comedies are also one of the hardest pieces of dialogue to write. It's personally why I don't like writing comedy myself. However, \"Superbad\" is one of those surprise comedies that really works and manages to make you laugh. \n\nThis is years ago, when Jonah Hill and Michael Cera all looked really different. It's one of those weird experiences because you've seen them in stuff today and they're much younger obviously. I think it's really cool to see a lot of these names and their performances just a decade ago because they're all really solid. Them, along with Christopher Mintz-Plasse, Bill Hader, Seth Rogen, and Emma Stone were all really solid. I liked everyone's performance in this film and in general, everyone had pretty great comedic timing.\n\nThis film is pretty crude. It's based around the idea that these two high schoolers are trying to get with their crushes before school ends. You have one character who's all about having sex with a drunk girl, and another who just wants to get to know his girl when they're sober. I like seeing the parallels between the people here because it's what I feel like high school can be. You have these different people whose overachieving goal would be to have sex, and I think that's pretty funny. The comedy worked well and it was supported by a solid story. \n\nIn the end, \"Superbad\" was a fun time and a funny film. I'm glad I was finally able to watch it and I can't wait to watch it again.",
            "review_date": "2018-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i was doing some research for next years..\n\nSuperbad\n\nIts gripping screenplay and petty humor does tickle you here and there, but the sense of urgency fails to create the anticipated impact resulting into a shallow experience in the end. Seth Rogen and Evan Goldberg; the writers, are doing some of their best work in here but it isn't justified utterly by the director Greg Motolla. Jonah Hill and Michael Cera's chemistry is authentic and hilarious that is supported with a good cast like Emma Stone, Seth Rogen and Bill Hader. Superbad; despite of having a runtime of around 110 minutes, seems overlong and exhausting at certain points, but the rest of it sails off smoothly for it seems like a mere special one-hour episode of some R rated sitcom.",
            "review_date": "2018-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid funny movie. The extended edition dragged a bit in parts; I preferred the theatrical version.",
            "review_date": "2018-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've seen this film well over 10 times, and each time it's just as enjoyable as the last. Such a relatable story!",
            "review_date": "2018-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I must not be in the proper age bracket to enjoy this movie. I thought Jonah Hill's character was too obnoxious to have friends for as long as he did.",
            "review_date": "2018-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I laughed once during this movie.  When the cop talked about how his wife had a gang-bang on their wedding night and he wasn't invited.  The three lead characters are most likely closeted homosexuals who are unable to act on their feelings.  They have no chemistry with their female counterparts.  \n\nAllegedly Rogen and Goldberg wrote this movie when they were fourteen.  And I don't think they did a second draft.  Also this movie unleashed Emma Stone on the innocent moviegoers worldwide.  She's an okay actress but I think her Oscar win was probably due to good editing.....",
            "review_date": "2018-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's extremely funny and memorable, but also nostalgic and heart-warming at times. The characters are often crude, but good at heart and relatable. Everyone was a stupid teenager once, and everything about \"Superbad\" has cult classic written all over it.",
            "review_date": "2018-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious. One of my favorite comedies. A perfect blend of subtlety and vulgarity, with a perfect seasoning of emotion.",
            "review_date": "2017-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strengths: This movie is flat out hilarious. I've seen this movie so many times and I find myself cracking up with each viewing. That's the mark of a truly great comedy. Everyone was perfectly cast, with Jonah Hill (Seth) and Michael Cera (Evan) doing some of their best comedic work ever. The cops (Seth Rogen and Bill Hader) are hilarious and one of the best parts of the movie. We're also introduced to a woman who has arguably become the best actress of this era, Emma Stone (Jules). Then, there's Christopher Mintz-Plasse (Fogell), who played arguably the most memorable character. Nearly everything involving McLovin is comedy gold. That's a talented cast list without me even mentioning the quick appearances by Dave Franco, Clark Duke and Joe Lo Truglio. The characters are all relatable and likable, even in their most unlikable moments. It had a simple, but effective story and was loaded with memorable, quotable scenes. While it has some raunchy moments, the heart of the film is strong and focuses on the bond between Seth and Evan. I'm probably forgetting a lot, because there was so much to love about Superbad.\n\nWeaknesses: If I had to pick a gripe, it would be that the scene involving Seth and Evan in sleeping bags near the end feels like it drags on a bit. The same could kind of be said for how the McLovin/cops storyline ends. Even that feels like nitpicking, though, as they served a purpose.\n\nOverall: An absolute classic. One of the best comedies I've ever seen. It's my favorite movie of 2007 and I say that fully knowing that films like No Country for Old Men and Juno are from the same year. It was a launching pad for several talented stars (Stone, Hill, Cera) and remains some of their best work.",
            "review_date": "2017-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A vulgar and realistic high school comedy drama. Hilarious plot despite having a straightforward storyline and it has genuine chemistry between the characters. Jonah Hill's solid performance launched his comedic career. Some elements of the movie have since become cult status. The McLovin ID is still memorable to this very day.",
            "review_date": "2017-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious!  One you can watch again and again with a fantastic cast of characters.",
            "review_date": "2017-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very funny and super relatable",
            "review_date": "2017-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest movies ever created!",
            "review_date": "2017-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "GREATEST MOVIE OF ALL TIME!!!!! IF YOU HAVE NOT SEEN IT, LITERALLY, WHAT ARE YOU DOING WITH YOUR LIFE! GO WATCH IT RIGHT NOW!",
            "review_date": "2017-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok of Seth rogens best performances",
            "review_date": "2017-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are times I have been fooled into buying and watching a film based on either critical or audience approval, but rarely both. This is one of those rare occurrences where a certified fresh rating by a critical consensus paired with an equally glowing audience-metre, simply boggles the mind after watching the movie in question. This film is mostly puerile and downright ridiculous, and not in a clever or amusing way. Take the two supposed cops. They aren't funny. They certainly aren't remotely realistic or grounded any sort of way. They're just plain silly and lame. Period. And annoying. Oh, how truly irritating they are, let me count the ways! As for the rest of the film, you have... dire dialogue - with the exception of a handful of *midly* funny lines, the majority is swearing and coarse crudity (because that's always hilarious apparently, according to some people) - average acting, a bloated, desultory, meandering plot and absent character focus, ameliorated ever so slightly with the odd reasonable funny moment (the headbutting scene was rather amusing I'll admit, and no you won't see if coming, so it isn't a spoiler), and you have the aptly titled 'Superbad'. Or, if you prefer, 'Supermess', or even 'Superlame', as any of these are equally apt. I'm beginning to think that two stars is far too generous. *heavy sigh* 2/5*",
            "review_date": "2017-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad (2007) explores the confused emotional turmoil and awkward situations that arise in high school with sensitivity and plenty of laughs. Jonah Hill and Michael Cera are in their comfort zones as they play a hilarious and typically flawed duo trying to reach the pinnacle of high school popularity. The film milks the best from the duo, while balancing their wacky, raunchy story and gags with refreshing intelligence and honesty about adolescence. The film's greatest strength is its dialogue: it's paced well and packed with emotional nuance, with extensive opportunity for Seth Rogan and Bill Hader to make a great impact. Superbad's appeal stems from the idea that the absurd fantasies of hormonal, intoxicated guys may actually come true - and what can go wrong if it does. The sad situation that duo (who have great chemistry) are dealing with behind the booze is poignant throughout and gives the film added substance and authenticity. Superbad (2007) blends director Greg Mottola's dramatic influence with producer Judd Apatow's eye for a hilariously vulgar gag to great effect.",
            "review_date": "2017-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I guess this is what gets made in Hollywood when you have a couple of previous hits....   Not much surprises me anymore.  But how this awful movie has an 88% rating by the critics and 87% by the audience does.  The writing is like a 1st draft by 8th graders.  The only thing unique is Jonah getting blood on his pants while dancing witha girl on her period.  2 maybe 3 mildly funny lines.  The absurd cops are plain stupid and about as funny as having a turd show up in your salad in real-life.",
            "review_date": "2017-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's gotta be an American Classic.",
            "review_date": "2017-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best comedy's I've ever seen! Jonah Hill and Michael Cera are hilarious but the best characters are the police officers portrayed by the comedians Seth Rogan and Bill Hader. They were great!",
            "review_date": "2017-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great fantastic phenomenal funny hilarious movie starring Seth Rogan, Jonah hill, Michael cera and Bill hader. I love this movie, every joke is funny especially Jonah hill, he's so funny, he's to me the second funniest actor ever. Number one is Mike Myers, sorry Seth Rogan, you are number 3. I love the concept of 2 high school kids trying to get the girls and get alcohol for them and do some crazy stuff with some cops like foggle. He's the best character in this movie, he does the craziest things, him as a character is the best.",
            "review_date": "2017-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've been putting off watching this movie for so long. I don't know why I waited. It had me smiling from the very opening scene until the very end.",
            "review_date": "2017-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The funniest movie ever",
            "review_date": "2017-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, but with a heart. Coming of age story about two high school dudes who are not part of the cool clique. Jonah Hill and Michael Cera are supergreat compliments to one another comedically.  Saw this when it first came out and then again ten years later and it holds up. It feels like it was written by guys, but underneath the volgarity there are some gems of observation about the early 21st century adolescent American male and the social norms in 2007.",
            "review_date": "2017-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the funniest well acted comedies I have seen!!!",
            "review_date": "2017-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The title says it all.",
            "review_date": "2017-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic penis art,...hail to the MacLOVIN. R U MacLOVIN It?",
            "review_date": "2017-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't use absolutes hardly ever :), but this is the funniest movie I have ever seen.",
            "review_date": "2017-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never quite as funny or as sincere as it wants to be, but still full of memorable little moments. Rating: 58",
            "review_date": "2017-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's fucking funny man.",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is directed by Greg Mottola, and it stars Jonah Hill and Michael Cera in a high school movie about 2 best friends that are about to graduate high school, and they have to get the alcohol for a party as they think that it'll impress the girls that they like. This is the first film that is actually written by Seth Rogen and Evan Goldberg, and so far with the films that they wrote, I managed to enjoy them very much, which for this one, it made stars out of the actors, and with good reason also. Michael Cera and Jonah Hill work each other very well together and you can see about why they are best friends as it is very typical for those people to be high school students. Christopher Mintz-Plasse in his first film role has the comedic timing for the jokes, which gave me a laugh, and whenever he's with Seth Rogen and Bill Hader, their story is probably the most entertaining part of the film as they have a lot of fun chemistry, it's hilarious to watch, and it has a lot of heart from them, which they are just likable idiots. The writing by Seth Rogen and Evan Goldberg is really good with some of the dialogue being really funny enough that rightfully deserves to be a meme. The beginning has got a lot of jokes that got a laugh out of me, but when it gets a bit close to the end, I wasn't really laughing as much as I thought I would've gotten from it. It does a good job portraying some of the high school students as very awkward as it can be relatable to anyone that was in high school. Superbad may not be one of the classics for the high school genre, but at least I'll find it memorable enough to stand out.",
            "review_date": "2017-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A smart and creative comedy even if it starts out slow.",
            "review_date": "2017-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Of all similar drinking + sex focused movies set in late high school or early college, this is definitely the best!",
            "review_date": "2017-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You're mileage will vary depending on how high you are..... At 90 minutes this would have been tight, at 113 it is loose and long overstays its welcome.",
            "review_date": "2017-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not only a good comical movie, but a good movie.",
            "review_date": "2017-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I laughed all thru this fun movie. It represent my generation, so yeah, i love it.",
            "review_date": "2017-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bromance at it's finest",
            "review_date": "2017-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie, but not great. The scenes with Michael Cera and Jonah Hill are the best and funniest scenes. Especially Jonah Hill, who really knows how to act like a disgusting seventeen year old. Another thing I liked about it is the look of the movie. Its a throw back to the 70's. The clothes, the hair, the way it was shot.",
            "review_date": "2017-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun and hilarious film with a solid cast full of great performances and hilarious and fun comedy.",
            "review_date": "2017-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really wanted to like this film, I did. But I was sadly disappointed. I found by the time the movie actually got going I was so overly board with the stupidly mediocre plot that it was ruined for me.",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Brilliant comedy throughout and the character of McLovin is comedy gold.\"",
            "review_date": "2017-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Smart writing anchored by top comedic timing by the entire cast, Superbad is a funny, sincere, and lighthearted look into high school and teenage experience that is sure to relate to everybody.",
            "review_date": "2017-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I almost feel shame for having watched this whole movie.  How anyone over 25 could enjoy this movie is beyond me.  An endless stream of obscenities does not make a movie funny.  Ridiculous antics by cops are not funny.  Puke gags and worse, are not funny.  I just signed up for Rotten Tomatoes because I could not believe that 87% of people liked it!  That ratings makes me seriously worry about our society.  I wish I could give this negative 5 stars!",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seth was a whiny jerk. I don't think Jules would like him.\nThe 2 cops were funny. Overall a funny movie with a well-written plot and developed characters, but gross and unnecessary amount of cussing.",
            "review_date": "2017-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is one of my favorite movies of all time I love this movie because some parts of the movie i can relate to. like Micheal Cera's character awkwardness when he's talking to the girl he likes. ",
            "review_date": "2017-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad brings all the awkwardness of high school with a funny and honest script that highlights the easy chemistry between its leads.",
            "review_date": "2017-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad has become a modern comedy classic. Hill and Cera are the perfect team and they bring a big helping of laughs. As do Bill Hader and Seth Rogen. It's relatable to millennial teens too. It's a shame that it's littered with so much filth (sexual dialogue and profanity), because it could have been a real gem. I don't believe films have to include so much of it to be considered \"good\". Regardless, it's mildly enjoyable if you can get past all the profanity. (3.5/5)",
            "review_date": "2017-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Actually pretty funny! It's like the hangover, but in a high school setting. It just came on Netflix give it a watch",
            "review_date": "2017-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant film. Have watched it time and time again and it's always so enjoyable. I was their age and doing these things at the time when this was released so related to it so much ha. Brilliant to watch years later takes you back. Any big fans watch it on Blu Ray lots of extended scenes.",
            "review_date": "2017-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is our generation's caddyshack! Rewatch it way too much and quote it way too much!",
            "review_date": "2017-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gotta be my fav comedy of all time.",
            "review_date": "2016-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Comedy worth watching at the very least.",
            "review_date": "2016-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sweet, but raunchy comedy. Jonah Hill and Michael Cera's friendship is so believable, but for me, the highlight was Bill Hader and Seth Rogen.",
            "review_date": "2016-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The generation this belongs to will hail it as a classic. It's well made and funny anyway...but probably not enough to watch again.",
            "review_date": "2016-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is a coming-of-age movie in a class by itself.",
            "review_date": "2016-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If your in the mood to laugh , this is your film. Jonah hill and Michael Cera sure know how to entertain. This film follows two hormonal, crazed and weird teenagers as they spend the night trying to get into a party.",
            "review_date": "2016-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super funny movie and it was amazing",
            "review_date": "2016-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have heard that this is one of the best comedies out there, but I have to disagree. I was disappointed. There was not really that much to laugh about. It was far too vulgar and awkward for me to laugh. I have seen better comedies.",
            "review_date": "2016-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Having a best friend is most likely going to be the most irreplaceable aspect anyone can encounter, an aspect that actors Jonah Hill and Michael Cera managed to demonstrate so brilliantly, it works in Superbad, a comedy that knows what the teenage life is all about.",
            "review_date": "2016-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another one of those one time deals where it's a great movie and will not be repeated in terms of comedy greatness. If you are ready to have fun and laugh then you are ready to watch Superbad.",
            "review_date": "2016-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best comedies in recent memory",
            "review_date": "2016-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply hilarious. I couldn't stop laughing the first time I saw this movie and to this day some of the scenes and one-liners still get me. The story is somewhat unique in some aspects giving the rest of the film a sense of freshness in an otherwise saturated area of coming-of-age comedies. Jonah Hill and Michael Cera really seem to feed off each other's energy and the result is comedic gold.",
            "review_date": "2016-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The more I thought about this movie, the more I things I realized I liked about it. You connect with their awkward, vulnerable experiences while also laughing at some really good writing. You have no problem suspending disbelief for a few scenarios that are just fun to watch.",
            "review_date": "2016-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Comfortably awkward string of stupid situations. A load of dumb adventures in underage drinking & sexuality on the verge of graduating high school.",
            "review_date": "2016-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An update of \"Dazed and Confused\" as a semi-raunchy teen comedy fixating on a trio trying to seize the night with drinking, resulting in laughs and fitting energy in the performances towards the genre's recognizable writing. (B+)\n\n(Full review TBD)",
            "review_date": "2016-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is a hilarious teen comedy about how far people will go for a night with the girl of their dreams. It is full of jokes, alcohol, and a guy named McLovin.\n\n-The Critic",
            "review_date": "2016-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The birth of our current generation of comedy stars left me feeling completely left out. Possibly because I'd heard the entire movie quoted a thousand times before I finally saw it against my will.",
            "review_date": "2016-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the film is funny and at times clever, it's more heart-warming than anything.",
            "review_date": "2016-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very very funny movie, you will laugh every minute of it.....with some lessons through the way.",
            "review_date": "2016-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is definetly one of my all time favorites!! It cracks me up!!! if you haven't seen it, it's a must see!",
            "review_date": "2016-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great coming of age comedy? Believable characters and set pieces. Very funny throughout.",
            "review_date": "2016-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wanna remember what high-school was like?  Me neither really - but hey there's this!",
            "review_date": "2016-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad isn't that good of a movie. It lacked comedy. I would suggest this movie for more college typed kids and even high schoolers, but overall not that great of a movie.",
            "review_date": "2016-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Superbad' isn't actually Superbad. It's actually 'Super good', maybe even 'Super great'.",
            "review_date": "2016-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilariously vulgar, painfully awkward and surprisingly poignant, Superbad is an ace comedy about that period in life where everyone wants to rush into adulthood, while at the same time they are struggling with letting go of youth and the people left behind with it. I am McLovin.",
            "review_date": "2016-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Essentially the good version of \"American Pie\", Superbad is sure to be remembered as a comedy classic. The humor is well-written, the film is well-intended, it's consistently funny, it doesn't constantly rely on grossing out the audience to tell a worthwhile joke, and it's a sincere depiction of the high school experience for all generations.",
            "review_date": "2016-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply one of ten funniest movies of the past 20 years. Jonah Hill with one of the most underrated comedic performances of all time. The supporting cast is brilliant including Bill Hader and Seth Rogan as the cops we all wish we knew. Many classic lines including \"I am...McLovin' \"",
            "review_date": "2016-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the funniest movies of all time.",
            "review_date": "2016-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is misleading in the best way possible. Hidden beneath the crazy drunken antics of this movie is a surprisingly beautiful coming-of-age story with an unbelievable amount of heart. The chemistry between Jonah Hill and Michael Cera really sells their relationship and their struggles with social anxiety and moving on from high school to college. Even in spite of their social awkwardness, there's a lot of relatability to be had in these two characters. And, of course, the hijinks they get into throughout the course of the one night the film covers are undeniably hysterical. These come mostly thanks to interactions with two cops (played by Seth Rogen and Bill Hader) that also come in contact with Christopher Mintz-Plasse's McLovin' (who is one of the most memorable comedy characters in recent memory). Writing duo Seth Rogen and Evan Goldberg have jam packed so many jokes and hilarious situations into their screenplay, and the result is endlessly entertaining. Director Greg Mottola has created a gut-busting comedy that is simultaneously one of the finest coming-of-age movies of its decade.",
            "review_date": "2016-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really good comedy.",
            "review_date": "2016-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I couldn't have loved this much more. Cera and Hill were just the best. Writing was hilarious. Loved Rogen and Hader. Emma Stone was awesome. Laughed out loud about 15 times. Can't believe it took me 9 years to see this. Awesome.",
            "review_date": "2016-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is the movie that did the \"over the top party\" genre justice. Michael Cera and Jonah Hill are perfect casting choices, but Christopher Mintz-Plasse steals the show as Fogell.",
            "review_date": "2016-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the type of movie that's enjoyable to watch and gets better and better every time. It's a funny buddy comedy and behind all of the sex, crude language and booze is a heartfelt story about 2 friends that would lost without each other. It's not a very mature comedy movie which makes it more funny especially for an immature person like me.\nBut it's cliched awkward sex and under aged drinking makes for a pretty predictable comedy.",
            "review_date": "2016-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is a very enjoyable comedy with a great cast and characters that we genuinely care about. Jonah Hill and Michael Cera are great in their little comedy duo but I think the most enjoyable moments of the film are 'McLovin' fooling around with Seth Rogen and Bill Hader's cop duo. This is one of the better comedies of the 20th century and a great coming of age tale that is enjoyable for all teenagers.",
            "review_date": "2016-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a surprise to everyone, Superbad is actually funny.",
            "review_date": "2016-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the funniest movies I have ever seen, with some surprisingly honest and touching moments. All around a good watch.",
            "review_date": "2016-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ridiculous. Jonah Hill, Michael Cera, and Christopher Mintz-Plasse killed it!",
            "review_date": "2016-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad has good comedic performances and a genuinely touching ending",
            "review_date": "2016-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not only my favorite buddy film but also an amazing coming of age story.",
            "review_date": "2016-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is hilarious and Mclovin!",
            "review_date": "2016-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A modern comedy classic, fucking hilarious.",
            "review_date": "2016-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A mediocre and extremely overrated comedy.There ain't nothing special about it.",
            "review_date": "2016-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you like OTT teen comedies, \"Superbad\" is a fine choice. The protagonists are facing one awkward situation after the other in their attempt to get drunk and laid. The plot is imaginative for the biggest part, but I felt that, on the whole, the film was rather inconsistent and just a little bit way too hysterical. Flawed yet enjoyable.",
            "review_date": "2016-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still makes me laugh after all these years. So good",
            "review_date": "2016-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good and very funny. It kept me on the edge of my seat the whole movie.",
            "review_date": "2016-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the more uncomfortable movie viewing experiences I've had. The first half hour of the movie especially is pretty rough to sit through due to how awkward it is and what pieces of shit the characters come across as. But after the first half hour of set-up is done with and the plot gets going, the film despite never losing the uncomfortable awkwardness of it is still amusing to watch, and there are actually a few moments that I actually found pretty funny, even if the film as a whole I don't find very funny at all.\n\n5,5/10",
            "review_date": "2016-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although Superbad is unfocused at times, the unabashed bromance between Jonah Hill and Michael Cera, and a rambunctious adventure through the hallways of high school compensate to deliver a wickedly fun -- and sometimes quite touching -- experience for teenage filmgoers.",
            "review_date": "2016-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily one of the best comedies of the past 10 years. So many great lines and laugh out loud moments. Perfectly cast and filled with hilarious characters. I like this movie a lot if you couldn't tell.",
            "review_date": "2016-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is very funny although quite vulgar and excessive at times which in my own opinion made it even better. I would recommend a watch.",
            "review_date": "2016-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is a hilarious tale of three nerds in high school trying to become popular through partying.",
            "review_date": "2016-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I guess I can describe this movie like an American Pie type of film with less nudity and craziness.  The character of McLovin' just makes you laugh but the best performance in this movie was by Jonah Hill...he was hilarious!  As a comedy it works and provides some good laughs throughout the film.  For some reason though, I felt the scenes with the 2 weird cops were not as funny and I think this hurt the film a little.  Sure some of the jokes with the cops were funny but they were there too long to the point it lost its \"funnyness\".  Overall though, this a pretty good raunchy type comedy that would offend less people than the American Pie movies would.  3.5/5 OR 7/10...I feel this movie was too long though.",
            "review_date": "2016-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is an amazing movie vary funny and vary well written an other great movie \nwritten by Evan Goldberg Seth Rogen",
            "review_date": "2015-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even for me, this was a bit juvenile and raunchy. Maybe it would have been funnier when I was in high school. In any case, Superbad manages to provide a few good laughs even if it never really comes through ",
            "review_date": "2015-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of my fave modern comedies and a reel guilty pleasure",
            "review_date": "2015-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gotta love the friendship.",
            "review_date": "2015-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If Peanuts had swearing and underage drinking in it, it would be a lot like Superbad. It's a fantastic 'coming of age' comedy about a group of geeky school friends and the utter chaos that ensues when they try to buy some booze for a party. It is rude, crude and hilariously funny with, at heart, a story about friendship and camaraderie which makes it a cut above many other films of this genre. Full marks must go to Seth Rogan and Evan Goldberg for a naturalistic and witty script. Rogan himself makes an appearance in a key role as one of a pair of seriously unhinged, inept cops who provide some fantastically funny moments during the film. This is a movie that has me giggling and sniggering all the way through as the best laid plans of the the three lads spiral increasingly out of control. The comedy is far from subtle and very politically incorrect in places but the line is never crossed to the point where you don't empathise with the main characters or find them anything less than engaging to watch.",
            "review_date": "2015-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I genuinely laughed out loud more times during this than any other film I've seen in a while: combination of funny script, Hill and Cera and penis drawings!",
            "review_date": "2015-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best comedies made.",
            "review_date": "2015-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is such a memorable and instantly recognizable film with many funny, well developed and realistic characters, superb acting across the board and many hilarious moments. It is too long and sometimes typical, but it is always funny and even dramatic and smart from time to time. It is a fun movie that is also emotional and filled with likable characters.",
            "review_date": "2015-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun movie with the right amount of comedy.",
            "review_date": "2015-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "funny and good Chemistry of all the actors and actress, the funniest high-school movie of all time",
            "review_date": "2015-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Scorsese's After Hours meets American Pie (not that I like American Pie). Excellent, but it does die by the time they finally get to the graduation party.",
            "review_date": "2015-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty dang funny, although it can feel slightly too long at times.",
            "review_date": "2015-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I remembered this as being one of the most consistently enjoyable Apatow productions.  Yeah, it is.  It holds up very well.",
            "review_date": "2015-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Mclovin story is hands down the best part of this movie and should've been the only focus of this movie. Every other character's jokes fall flat most of the time apart from a few really good chuckles. Not a bad comedy, but I would rather watch The Interview.",
            "review_date": "2015-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There was a good balance of crude comedy and heart that it pretty much represented the modern high school experience and atmosphere. And the Emma Stone scenes weren't that bad either haha.",
            "review_date": "2015-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A hilarious comedy about two seniors who're on their way to lose their virginity. Basically the teenage version of The 40-Year-Old Virgin.",
            "review_date": "2015-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent comedy. The first half was mostly hilarious, then it may have gotten a little more serious later on, but it was still a pretty good all-around movie. Each of the actors played good parts, although Rogen may not have been all that hilarious as a cop, Hill was easily one of the best ones though. Then again, both the cops were not all that funny. The movie featured a simple and engaging story of some high school graduates trying to buy alcohol so they can get laid. Some good laugh-out-loud moments throughout and a fairly touching story overall. Wouldn't consider it hilarious, but still pretty good.",
            "review_date": "2015-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super funny! Haven't seen this movie since it first came out, and now giving it a second glance 8 years later, I must say, it's one damn funny movie. Jonah Hill has really come along way since \"Superbad.\" Since his debut in this ultra funny comedy, he has managed to also add to his resume \"Moneyball\" also starring Brad Pitt. \"21 Jump Street\" and \"22 Jump Street.\" And Martin Scorsese's \"The Wolf of Wall Street.\" So far and so good, Jonah Hill has managed to be very consistent lately with his movies and good for him! Because he definitely has the talent as he certainly proves it in this and \"The Wolf of Wall Street,\" for which he earned a best supporting actor nomination for his performance alongside Leonardo DiCaprio in the movie, his second one! The first was for \"Moneyball,\" which he also earned a best supporting actor nomination playing Brad Pitt's partner in the baseball scouting business, which I also need to go back and give another look at as I thought it was just good, but not great. Other than that, the rest of the cast in the movie plays out well. Michael Cera is surprisingly funny in some scenes, even though this really is his only good movie he has ever done.Christopher-Mintz-Plasse steals the show as McLovin. Emma Stone even shines in this movie as well as Jonah Hill's love interest. But the real comedy duo in this is Seth Rogen and Bill Hader, who are just unbelievably funny together, and play off each other so well as the moronic cops. Every time they pop up on screen you just can't wait to see what the two of them are gonna come up with next to abuse the badge, it's that funny! Also the soundtrack I noticed a second time around is definitely worth checking out, as I always say, the best movies are the ones with great soundtracks, and this movie definitely belongs in the ladder category!",
            "review_date": "2015-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the superbad cops. McLovin it!",
            "review_date": "2015-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As silly and hilarious as the Pie, it shows a newer generation of the the Americans in the mid 2000s.",
            "review_date": "2015-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I laughed so hard that I was in tears for most of the movie.",
            "review_date": "2015-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've always found comedy to be an exhausting genre, as it always seems to be one devoid of any kind of actual charm or purpose and without sending pretentious I just usually hate them. Superbad on the other hand is really f***ing hilarious. Emma Stone, Jonah Hill, Michael Cera and a few other future prophets of comedy shine in a simple film about three boys trying to buy alcohol for a graduation party. Jonah Hill's character holds the film and perfectly balances Cera's sarcastic normalcy.",
            "review_date": "2015-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No laugh out loud moments (which for a comedy is a pretty bad thing not to have), though it did bring up a smile or two. It's unfortunate so much of the film was unbearably awkward, the second hand embarrassment I felt for the actors was so bad that there were a few seconds throughout the piece I couldn't bring myself to watch without fast-forwarding.",
            "review_date": "2015-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just what I expected it to be, Superbad is a comedy classic. One of the better Rogen films, it is fun and hysterical throughout the whole entire movie. The hilarious trio of Cera, Hill, and Mintz-Plasse provide the laughs in the entertaining plot. A fun way to show struggling high schoolers try to make it out in the scene. Comedy  at its best to earn 4 and half stars.",
            "review_date": "2015-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wouldn't say it's particularly bad- wouldn't say it's good either.",
            "review_date": "2015-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most relatable comedy I've ever seen. It's also one of the funniest.",
            "review_date": "2015-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite. I mean, this is fucking hilarious!!!!!Even if you watch it for the 70th time !!!! still fucking hilarious!!!",
            "review_date": "2015-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boyhood-explained comedy.",
            "review_date": "2015-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I still can't get over how funny the scene is with the cops and McLovin's ID. This movie has many laugh out loud moments. I'm just thankful Amazing Spider-Man finally killed the painfully awkward teenager who kept showing up in every movie after Superbad. Even though it started an obnoxious trend, I still love this movie.",
            "review_date": "2015-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome!! Total guy movie with non-stop laughs. This is probably one of my top 3 comedies ever. Seen it in theaters twice and I never do that.",
            "review_date": "2015-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you where a nerd/geek/average in high school. You should find this film appealing. Really relatable to most guys.",
            "review_date": "2015-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's fairly rare that a high school movie hits really close to home. Superbad is a teen comedy that captures the high school atmosphere near perfectly. The story follows two seniors Seth and Evan, two nerdy kids that are trying to find someone they can get with by the end of their senior year. When they get invited to a popular girl named Jules's party, they get involved in a hilarious string of events that lead to a lot of difficult situations. To start off, I thought the acting was really good for the way this comedy portrayed itself to be. Jonah Hill, Michael Cera, Emma Stone, Seth Rogen, Christopher Mintz-Plasse, and Bill Hader all gave memorable performances. Characters like McLovin, Seth & Evan, the two cops and many more make the movie the great comedy that it is. I don't think any character was left out of a funny line or situation. People that weren't on camera very much (like Joe Lo Truglio) were memorable and he was there for like 8 minutes! To bounce off this aspect, all of this movie was hilarious. There were tons of laugh out loud moments, some worthy clever jokes, others not so much but they were still funny. The cops and Fogle were clearly the funniest people in the movie. Not only did they have really funny moments together, but they created a really good bond together. They had surprisingly good chemistry, as did Evan and Seth. I thought the writing for this movie was very well done, it was done by Evan Goldberg and Seth Rogen and it really shows that it was because of his signature brand of stoner humor. The film had a really good story to tell too, even if it does draw plot lines from films like American Pie, it felt like I was in their shoes. They didn't feel like they were really playing characters but like they WERE that character. Michael Cera may be the only exception since he's kind of a one trick pony sometimes but he meshes well with everyone else. The film is shot very well, the cuts were smooth and felt big budget at times which kinda bothered me but other than that it had good production. The thing that puts me over for this movie is its sense of moving on after high school. It's kind of like their last hurrah after being together for such a long time. The way that they show characters interact with each other also felt real because they didn't act like scripted jocks or nerds. They capture that aspect very well. Overall, Superbad is a lot better than I expected. It made me die of laughter while telling a hilarious story about moving on to college and getting through the stress and stereotypes of high school. B+",
            "review_date": "2015-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is truly SUPERBAD. Being that this movie is without a doubt in my top three favorite movies of all time, if you are looking for a controversial review with both pros and cons, you will not find it here. Superbad is the comedy that has yet to be beaten. No other movie in history makes me laugh like this one does. Granted I am in High School so I can completely relate to most of the content which gives it an advantage. Especially since Seth Rogen and Evan Goldberg know how to write High School life since the first draft of the script was written while they were in High School. Michael Cera and Jonah Hill's on screen chemistry makes for laughs even when they aren't cracking jokes. Michael Cera plays the perfect awkward student who shows the reality of what it is like to be a Senior in school. When I watch other comedy movies, it just reminds me how funny this one is. They really are spot on. Another one of my favorite pieces is the side plot involving McLovin and the two police officers. Their side story is so funny that it really could be its own film. Trust me when I say, you will laugh your ass off watching this incredibly hilarious movie with Hill and Cera's best performances to date and where Christopher Mintz-Plasse got his big break. I happily give this film 5 stars and would give it 6 if it were an option.",
            "review_date": "2015-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The funniest coming-of-age film ever, and I don't think that's even a question. Evan and Seth are my two favorite best friends in a movie ever, and not to mention McLovin, the \"25-year old Hawaiian organ donor.\" I was laughing my ass off the whole time, and have watched it over 10 times. Instant classic.",
            "review_date": "2015-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Superbad,\" a raucous and raunchy comedy from producer Judd Apatow and\ndirector Greg Mottola i must say it's another ultra-raunchy and\ncommercial sex comedy from the Judd Apatow laugh factory. The storyline\nis elemental and easy to catch. Two nerdy best friends trying to get\nlaid on a party night before going their separate ways to college.The\none is Seth played by Jonah Hill and Evan played by Michael Cera.Jonah\nHill character is a little bit vulgar and abusive but kind to just\nenough to make it realistic and he play that very well . The thing that\nbugs me is that \"Superbad\" is simply too long for the sort of picture\nit is  pic has some noticeable downtime, and it's all in the middle,\nwith too many goofy moments involving the cops and assorted fringe\ncharacters that come and go. You really want the boys to get to the\nparty already and see what they get cooking with the girls.You cant\nexpect more from teenage comedy but you get a lot from that movie it's\nfresh it will make you laugh but don't forget that's TEENAGE COMEDY not\nmore not less .",
            "review_date": "2015-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really tried to not like this movie, but left the theater crying because the raunch was so hysterical! I remember so many different scenes to laugh at and can't keep up -LMAO!",
            "review_date": "2015-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seth and Evan are a teen bromance for the ages and the birth of Jonah Hill and Michael Cera as comedy icons is an amazing thing to behold. Full review later.",
            "review_date": "2015-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If I could act and had been born within the borders of Canada, I would be Michael Cera.",
            "review_date": "2015-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Vulgar, gross-out and immensely hilarious. Has moments of genius followed be a genital joke, nothing not to love. A teen classic",
            "review_date": "2015-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Michael Cera and Jonah Hill are precisely in their element as a pair of hyper-awkward high school seniors, attempting to delicately navigate their way around virginity before college. Snide, sharp and effortlessly witty, it's an absolute howl, even for folks who may not have worked through the same problems at that age. Hill and Cera have great chemistry, bouncing insults and muttering puns at a machine-gun pace, and they get a ton of help from the supporting cast. Seth Rogen and Bill Hader damn near steal the show as a pair of irresponsible cops out for a joyride with Christopher Mintz-Plasse, who is himself unforgettable as the eccentric uber-geek \"McLovin.\" I just wish it could've hovered in its zone of meaningless shenanigans the whole way through, because the last twenty minutes - when the plot suddenly realizes it needs to get going - are something of a chore to push through. Still, it's great enough that I'd call it a generation-defining comedy, tremendously written and utterly unstoppable when it's in a groove. Extra kudos for introducing the world to Emma Stone.",
            "review_date": "2015-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Actually quite angry and upset at the misogynist piece of shit film.",
            "review_date": "2015-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Genuinely hilarious at points with the chemistry between Hill and Cera being blatantly obvious. This film is the classic story of growing up done well.",
            "review_date": "2014-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome, Very Funny!",
            "review_date": "2014-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is surely the funniest movie i've ever seen. But that's not all, the movie also has a heart and great characters that are really likeable. McLovin rules!",
            "review_date": "2014-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boundless bromanctic chemistry, a brilliantly crafted script, expertly delivered laughs, and endearing high school candor guarantee that Superbad stands toe-to-toe with the humor and heart of any coming-of-age film.",
            "review_date": "2014-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It´s one of the best teen comedies of the last 20 years , perhaps because of the connection of clever humor and the perfect portrait of what friendship really means.",
            "review_date": "2014-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched this one after all of the hype, was pleasantly surprised. One of those movies you just have to see.",
            "review_date": "2014-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing short of FORMITAVE.",
            "review_date": "2014-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hands down the funniest film I've ever seen. Absolutely hilarious from start to finish and the characters are incredible.",
            "review_date": "2014-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious, wonderfully original, and is the new American Pie. I like how Seth Rogen and Evan Goldberg wrote this as teens. It was 100% funny and is worth having. If you haven't seen it, I'm just gonna say that you'll laugh until it hurts.",
            "review_date": "2014-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not only does this movie boast incredibly written characters, witty and amusing dialogue, and tons of laugh-out-moments, it also features an incredible amount of heart from Rogen and Goldberg, and this heart is visible every step of the way through.",
            "review_date": "2014-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic modern comedy.",
            "review_date": "2014-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie its very funny!! It's Crazy",
            "review_date": "2014-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Superbad\" is a funny comedy that achieves its laughs by crudity while showcasing a softer side for its characters featuring empathetic performances from Jonah Hill and Michael Cera.",
            "review_date": "2014-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A ridiculous and twisted trip that made me laught as hell",
            "review_date": "2014-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Consistently funny and surprisingly smart. Supperbad is boasts a great cast used to the maximum of there capabilities, some of the most likable characters ever put to screen and  a heartwarming story, Superbad is one of the best teen films ever made.",
            "review_date": "2014-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is a funny and honest look at friendship, but it loses a few points for it's unnecessary vulgarity.",
            "review_date": "2014-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not every joke in \"Superbad\" works, but the ones that do are spot-on, and the story, I think, is even better than the comedy.",
            "review_date": "2014-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Produced by Judd Apatow and co-written by Seth Rogen, Superbad is hysterically funny.  When three high school friends attempt to score alcohol for one of their classmate's parties they get into a series of crazy misadventures.  Starring Jonah Hill, Michael Cera, Emma Stone, Bill Hader, Seth Rogen, and introducing Christopher Mintz-Plass, the film has great cast.  However, the performances vary; Cera in particular is quite annoying at times, doing is trademark nervous shtick.  The comedy is also a little inconsistent; some sketches are outrageously hilarious while others fall flat.  And, the vulgarity and crude humor is largely unnecessary and overused.  It's messy and a bit unfocused, but Superbad delivers a lot of laughs.",
            "review_date": "2014-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly memorable Hillarious movie that u will remember after you watch it this movie is funny it has heart and a lot of great gags an overall terrific memorable comedy \nGrade A",
            "review_date": "2014-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Vulgar, crude, and very funny, Superbad is more than just a comedy raunchfest, it has solid lead performances by Michael Cera and Jonah Hill, hilarious supporting roles by Christopher Mintz-Plasse, Seth Rogen, and Bill Hader, smart writing, and surprisingly very warm-hearted and a delightful trip back to high school flashbacks!",
            "review_date": "2014-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Giggling on the floor hilarious. Crass humour. Good stuff though.",
            "review_date": "2014-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Produced by Judd Apatow, Seth Rogen & Evan Goldberg and co-written by the latter two (autobiographical apparently!). Like their other movies, this has the familiar buddy elements, geeky sincerity, seemingly painless violence and the odd cum joke. I am beginning to grasp it as Canadian humor, crude but smart, more love... and likeable!",
            "review_date": "2014-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not original, barely funny, unconvincing and insincere, this movie is a long boring failed attempt at high-school comedy.",
            "review_date": "2014-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Regardless of dirty and sexual dialogue, Superbad glorifies the importance of mercy and forgiveness in crime and justice as well as the social adventure that teenage boys face upon growing up to meet girlfriend pairing and alcohol and the need to stay together even if their different personalities (Seth - violent and selfish, Evan - passive and mature) clash unfavorably.",
            "review_date": "2014-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good to see that even after a slew of shitty movies such as American Pie and other bilge the raunchy teen comedy can still be funny.",
            "review_date": "2014-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as super as many people make out.",
            "review_date": "2014-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outrageously funny on the most rudimentary level...2 Stars",
            "review_date": "2014-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A smart comedy that plays it dumb with a wonderful heart",
            "review_date": "2014-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny and ridiculous (but in a good way) in equal measure. If you like The Inbetweeners, you'll love this.",
            "review_date": "2014-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is a comedy that delves deep into the awkwardness of high school drama and will leave you laughing for hours after it's over. It's a movie that feels as though they reenacted the lives of a few high school losers and made a full fledged film. Not only is the movie hilarious but it is also at times deep and relateable. You might find yourself laughing at your own awkward adolescent adventures.",
            "review_date": "2014-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Man was that a funny movie, everyone in it was awesome. I can't decide if I liked Hill, Hader or Rogen the most. Plus the whole McLovin thing is hilarious. Those cops were so funny it made me want to be a cop just to mess around. This story of three nerds trying to get lucky is foul mouthed and hilarious, and now one of my favourite comedies. Just watch it and laugh.",
            "review_date": "2014-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best comedy movies of all time. Years from now it'll be seen as the defining comedy movie for this generation",
            "review_date": "2014-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An hilarious movie Michael Cera and Jonah Hill have great chemistry, great cast of actors.",
            "review_date": "2014-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really really lied this movie a lot! It is like watching teenagers on screen! The dialogue is right and the whole movie is hysterical. Some parts had me laughing so hard! First off Jonah Hill is fantastic, but I really loved Michael Cera in it! He really knows how to do comedy, he has awkward comedy and his timing is amazing and he had me laughing out loud so many times it was great! Also Seth Rogen and Bill Hader we're hysterical as cops! This movie is a hysterical movie about teenagers, anyone who loves great comedies has to see this, just make sure you are okay with comedies that are very vulgar!",
            "review_date": "2014-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A simple and original plot thats Hilarious while being surprisingly heartfelt at the same time. Overall, its a perfect \"Bro\" movie.",
            "review_date": "2014-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "8.5/10\nclassic right here",
            "review_date": "2014-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super best half an hour.",
            "review_date": "2014-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An instant comedy classic that hits just as hard now as it did in 2007. This is as near as a comedy gets to perfect, and made stars out of a number of the cast. I still wonder why Michael Cera's comedy career didn't rise as meteorically as Jonah Hill's- in this movie, he is unceasingly hilarious (\"Why do they even make this fuckin game if you can't win?\")",
            "review_date": "2014-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Arguably the funniest movie ever.",
            "review_date": "2014-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie. Good performances from Hill and Cera kept me entertained all the way through. a must see.",
            "review_date": "2014-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has the elements of a classic teen comedy and a story of friendship and the loss of a best friend. Also a subtle love story is involved. With that being said, Superbad is a hilarious film and gets better every time you see it.",
            "review_date": "2014-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought it was going to be a mediocre comedy, as many of recent years are, but it was surprisingly entertaining and very touching in some points.",
            "review_date": "2014-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun, good spirited movie. Feels a bit too long but the laughs and the characters keep it running smooth. \nGrade: B+",
            "review_date": "2014-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite comedies. Superbad is brilliant. Fantastic dialogue with constant hilarious lines. Too many funny parts to count. Seth Rogen plays a dumb cop and he's hilarious. Jonah Hill plays a horny and whiny teenager and he has so many funny lines and parts, but the real star of the movie is McLovin. Christopher-",
            "review_date": "2014-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is like the beginning of the 21st century comedies, this movie made Johan hill, Michael cera, Christopher mintx-plasse, Seth rogen, emma stone, all these actors/actresses big! This was the start of all their careers and they just nailed it! This movie made me crack up in every part, it's crude, but has heartfelt moments, it's kinda a love story too. Every actor is funny in this movie, all the characters just nail it. It's a classic in my book, best comedy in the last 10 years!",
            "review_date": "2014-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Downright dorky and hilarious, Jonah Hill and Christopher Mintz-Plasse own the screen whenever they are on it.",
            "review_date": "2014-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious movie outlining the difficulties of being a  high school student who wants to have one last blow out before college.  Jonah Hill was hilarious but Emma Stone was the best.  McLovin was pretty god damn hilarious too.",
            "review_date": "2014-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Title says it all SUPERBAD!!\nReally crappy movie, with some laugh and gags here and there; but overall, unimpressive.",
            "review_date": "2014-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Glorifies the lazy writer strategy of vulgarity for the sake of vulgarity, and seeks to make its characters relatable, yet they come off satirical. I suppose if you like that kind of thing...",
            "review_date": "2014-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only movie with George Michael (sorry, Michael Cera) I've ever actually enjoyed. One of Jonah Hill's best performances, the period scene had me in tears.",
            "review_date": "2014-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Will remember when looking back",
            "review_date": "2014-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is hilarity on steroids as it is unremitting on the laughs and awkward situations. Although when you penetrate the surface of getting drunk and getting laid it becomes an honest take on friendship and the reality of growing up.",
            "review_date": "2014-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only one or two moments are funny, and even then they're only mildly amusing. A disappointing comedy that is just chaotic in a bad way.",
            "review_date": "2014-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the finest of the Apatow films, Superbad is incredibly funny with some nice things to say about friendship. Equally hilarious even on repeat viewings.",
            "review_date": "2014-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best comedies of the 21st century.",
            "review_date": "2014-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is super bad. It only gets 3 1/2 stars for having Emma Stone in it. Lots of humor that sounds like a 13 year old boy wrote into the script, and an unnecessary amount of the F word in it.",
            "review_date": "2014-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has relatable, well-written teen characters, but the obnoxious police characters keep the film from being good. Instead, it's just ehh.",
            "review_date": "2014-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You will be on the floor laughing. MUST SEE",
            "review_date": "2014-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this movie, never failed to make me laugh. Just the sight of Mclovin is enough to make a grown man laugh, great actors and entertainment.",
            "review_date": "2014-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some of the sincere elements of the characters come off as pretty genuine, but the comedy is far more \"miss\" than \"hit.\" It's not so much that it thrives on vulgar humor so much as it has characters simply state vulgar things with little or no context. It's far more \"gross-out\" than \"gross-out funny.\"",
            "review_date": "2014-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is outrageous. It's like if Juno and Dumb and Dumber had a child this would be it's baby. It's extremely naughty, the running time is long, but the acting performances and chemistry among all actors and actresses make this movie possible to watch and possibly watch again. The comedy is mostly a hit. The soundtrack is unique and the script is interesting. It's definitely worth a watch for only those mature enough to watch it.",
            "review_date": "2014-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's amazing Seth Rogen and Evan Goldberg wrote this when they were 13. This isn't the best movie i've seen but it's my favorite. It's better with every viewing and the combination of comedy and sweetness is intertwined so effortlessly. The humor goes from stupid-funny\nMichaels: McLovin, how's it going with the ladies?\nFogel: It's not the \"going\" i'm worried about but the \"cumming\"\n\nto smart funny\n\nSeth: \"Look, it was the peak of my ass-getting career and it happened way too early.\"\nEvan: \"You're like Orson Welles.\"\n\nthere were even running jokes\n\nthat guy: \"You know a guy named Jimmy? You totally look like his brother.\"\nAnd later...\nStoner: \"Hey, he's Jimmy's brother.\"\n\nIncredible comedy cast and story with good lessons intertwined. The last scene in the mall is my favorite movie scene ever. A definite recommend for teenagers or actually anyone.",
            "review_date": "2014-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One my all time favorite comedies an all too real depiction of how I always dreamed high school life would be like.",
            "review_date": "2014-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The growing up comedy of my generation. Serious laughs bro",
            "review_date": "2014-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This teen comedy tries to take on the same subject matter as many teen comedies had done before it. 3 nerdy high schoolers head out on a mission to lose their virginity and party hard. Something that's been done many times and movies like this and this movie although funny at times has nothing new to offer to the genre.",
            "review_date": "2014-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best gross-out comedy I've ever seen.",
            "review_date": "2014-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the funniest comedies I've seen in the past decade... those three men became cinematic comedy icons!",
            "review_date": "2014-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty generic Hollywood, American coming-of-age story, but, the actors and characters they play are fine enough.  Most people won't be sorry they sat down and made it to the end...",
            "review_date": "2014-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very funny film laughed through the whole film I really loved this movie A+",
            "review_date": "2014-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good entertainment light and fresh film that makes the brain relax; with an hilarious Jonah Hill and a noticeable performance from Michael Cera.",
            "review_date": "2014-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Grade:Lower 8/10\n\nSuperbad is comedy with lots of laughs and a great story about teens\ngoing to college and making one final stand to do what they loved best\nabout high school and being friends. The film mixes good laughs and\ngenuine emotion of the characters to create a very good film which\ncould be considered one the best teen comedies round, and definitely\nthe best of the 2000's. I felt as I said that it wad Very Good, and\nhere is why I did.\n\nThe story is great and moves along a fantastic pace mixing character\nstories between each other and running into one another with\nunpredictable and funny circumstances. What sets this story apart from\nother party films is that the film has a preparation for the party and\nthen what happens after the party and so you get to know what the\ncharacters are like whether sober or drunk. With fantastic lines and\nfun characters it makes the story even better and one you can see over\nand over.\n\nI liked the cast who do a great job with the comedy and even with there\nmovements can make you chuckle. Jonah Hill is the comedy king of this\nmovie and serves up nearly every joke in this with fine brilliance and\ncalm sophistication. Michael Cera is the more rational mind but he does\nit well and although not so funny still manages to set the other funny\ncharacters off. The entire supporting cast around that such as Bill\nHader and Seth Rogen among others do a great job and just add to the\nlaughs of this very funny movie.\n\nThe script obviously is the funny bone and without a decent script it\nwould be a terrible film, and so all acclaim must go to Seth Rogen and\nEvan Goldberg who one are the basis of this film, but also the great\nwriters of this who mix comedy and friendship well together so that it\nisn't sweet but not too sour either. The direction also needs praise as\nmuch of that is what makes it funny with fast scenes that you just\nthink \"WOAHHH\", perfection in this genre of comedy.\n\nAny bad things come, well I am not sure, some jokes do miss the mark\nbut never that badly. I feel some people also will hate the crude\nhumour and so that is basis for some criticism to say it relies on that\ntype of humour, but what do you expect from a teen comedy like this.\nYet again it is your perspective when it comes to criticism and what\nYOU like and don't like in comedy, some will like some won't, but I do\nthink the majority will enjoy this.\n\nI would recommend it to basically to who I said would enjoy it, those\nwho like teen comedies should be pleased by this and American Pie fans\nshould equally be pleased by it. Don't watch if you don't appreciate\ndrunken behaviour and sexual tones too because this is chock full of\nit, maybe only certain people will like it and possibly being a teen\ncomedy, it is aimed at making teens and young adults laugh.\n\nGive it a lower 8/10 here, strongly a Very Good film and I felt it was super\nclose to being a straight B+ but wasn't quite a great and excellent\nfilm but all the same very good is no underrating nor overrating. Watch\nit with friends and drink and eat with it and go with the flow, the\nparty can entertain large groups of people at a time and laughs with\ncome from all corners of the room.",
            "review_date": "2014-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As hilariously crazy as this film gets, I think it is also very relatable for guys in a lot of ways.",
            "review_date": "2014-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great act and funny.",
            "review_date": "2014-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't find the constant vulgarity funny, but I did find it accurate of insecure high school boys. A movie of friendship.",
            "review_date": "2014-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's got to be imperfect, it's a comedy. and a damn fine one too.",
            "review_date": "2014-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The title is fitting.",
            "review_date": "2014-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was hilarious.",
            "review_date": "2014-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best stupid high school immature comedy dramas. The cop characters really steal the show.",
            "review_date": "2014-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It definitely tells us the truth of what high school was all about, but Superbad ends up making the fatal mistake all nerd movies do- providing a happy ending.",
            "review_date": "2014-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "McLoved it! Fun ride! Fits right into the Dazed and Confused category of movies.",
            "review_date": "2014-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the funniest film I've ever seen is judd apatow's \"superbad\". I usually don't really like these new comedies but this one is truly hilarious. This one had me in tears laughing the first time I saw it and is my favorite film of the past 10 or so years. The films humor blends in perfectly and the tone is a dark comical type. The performances were very goid and very accurate even for my 8th grade classmates including myself in their conversation topics and words. Overall this film is sickly hilatious and very accurate for high schoolers a 5/5",
            "review_date": "2014-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the funniest movies ever. \n\nStandout: Michael Cera \n\n7/10",
            "review_date": "2014-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best comedy's. Very funny and Mcluvin is amazing.",
            "review_date": "2014-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As stupid as this movie is, Superbad still ended up being pretty dang enjoyable.  Usually I'm not a huge fan of this type of humor, but the chemistry between Hill and Cera is just too much fun.  Anyone who has been through the american school system can relate to there characters and even if you don't agree with their morals, the storytelling is worth watching on its own.",
            "review_date": "2014-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely hilarious!",
            "review_date": "2014-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A prime example of how to make a teenage party film that isn't a piece of shit, Superbad is an inventive, hilarious, and heartfelt ode to friendship, growing up, and the stupid shit that accompanies high school in general.",
            "review_date": "2014-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe it's just because I'm not partial to comedy movies, but I never got the appeal of this film. I don't remember laughing once during it.",
            "review_date": "2014-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i think its a great comedy",
            "review_date": "2014-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great look at how teenage nerds ACTUALLY act.",
            "review_date": "2014-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dick! This movie is one of the best movies of the 0s.",
            "review_date": "2014-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "funnier than american pie but without so much heart. vehicle for the two main stars. one of the best gross out comedies of the generation.",
            "review_date": "2014-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the funniest movie I've ever seen. Not just hilarious dialogue, but two hilarious main characters and of course McLovin. It also has a very clever/inappropriate lack of maturity that would appeal to younger kids, and despite being comical, the protagonists get really deep with each other when they have to face the bittersweet reality of graduating.",
            "review_date": "2014-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is funny. Cracks me up every time I see it. 4 stars from me.",
            "review_date": "2014-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is amazing. This is what I love about seth rogen. The jokes were original. If your not convinced that this is a good movie then this will.\nMclovin!!!!!!!",
            "review_date": "2014-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A funny comedy about a bunch of teenagers trying to organize the biggest party of their lives. It's funny, well done and acted by a really cool bunch of newcomers.",
            "review_date": "2014-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Three high-school kids go nuts trying to procure liquor to show off and impress girls at a party. Only problem is their age. A series of funny and unfortunate events, you have Superbad. Jonah Hill, Michael Cera and Chris Mintz-Plasse are insanely hilarious.",
            "review_date": "2014-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original comedy movie that started Jonah Hill's career. Superbad remembers to include the elements of a movie that covers up all of the flaws of a comedy.",
            "review_date": "2014-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best teen comedies ever! Other than the whole night out with the cops aspect, this movie dealt with real teenage issues. The fear of losing a friendship after high school, teen romance and the always awful trying to get booze while you're underage. Plus, this movie too damn funny. A must watch for everybody!",
            "review_date": "2014-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "boy movie.. good comedy!!",
            "review_date": "2014-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Passed the time. Great pacing and acting and production. Even a few good jokes!",
            "review_date": "2014-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not that funny   (12, 13)  TO OWN",
            "review_date": "2014-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I expected this movie to be full of cliches but surprisingly this movie stirs away from them and that what makes it so clever, you never know which joke they're going are for.",
            "review_date": "2014-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very funny and extremely entertaining",
            "review_date": "2014-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the funniest movie ever made",
            "review_date": "2014-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I confess, I 'm an undercover Seth Rogen fan",
            "review_date": "2014-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies of all time.  Absolutely hilarious from start to finish.  I wish more than anything that they could have made a squeal to this.",
            "review_date": "2014-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing and very funny",
            "review_date": "2014-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everyone likes this movie and for good reason. It's about as funny as a coming-of-age film can be in this millennium.",
            "review_date": "2014-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I couldn't laugh,I couldn't even find it that funny.It is not the sort of movie I like.I watched it and as I watched I thought why did I have to watch this?It had some nice moments but I can't say that it was powerful or that meaningful as most people say.i wouldn't watch it again.",
            "review_date": "2014-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I never get tired of watching this movie. Best teenager party movie ever!",
            "review_date": "2014-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of  best hilarious movies I've ever enjoy",
            "review_date": "2014-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cute, but nothing amazing.",
            "review_date": "2014-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Produced by Judd Apatow, the man most celebrated for shaping new credibility into raunchy American comedies, comes a laugh out loud coming of age drama about three horny teenage geeks on their way to a party. Entertaining and even a little adventurous, this film is not only genuinely funny but also intelligent and creative as it is able to capture the true feelings of teenage frustration, meant in a sexual and a more general term, in a way in which it has hardly ever been seen before. Although it contains the usual childish graphic humour, some of which is particularly disgusting, it never feels tasteless and even has that added tinge of sweetness and nostalgia to it that makes the viewing experience all rewarding. Much of the credit for the film's entertainment also goes to its three leads Cera, Hill and Mintz-Plasse who show great comedic presence but are also able to transmit true feelings in their performances as the hapless leading trio.",
            "review_date": "2014-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This hectic journey of two high-schoolers on a mission is fueled by hilarious one-liners, but the most entertaining thing about this movie is when the three main characters get together, the laughs don't stop.",
            "review_date": "2013-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mclovin stole the show. Classic comedy.",
            "review_date": "2013-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie...\nsuper funny!!!!",
            "review_date": "2013-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is super good. It has some originatlity and uniqueness to it. It is just a fun time! It has many memorable scenes and although its not the most laugh out loud movie you have ever seen, it is always funny and interesting. It really sums up the High School partying experience in a nutshell. Good times & a deep cast make this one worth testing for yourself.",
            "review_date": "2013-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie, not much else to say, just a really fun movie.",
            "review_date": "2013-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Manages to bring raucous laughs and sweetness making for a very sincere coming of age movie.",
            "review_date": "2013-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With it's incredibly sweet ending, it's hard not to like this coming-of-age story that really set the bar high for the it's succeeders. Cera and Hill really work well together and the two symbolize the vulgarity and naivity that are cleverly balanced throughout the film. The script can sometimes contain a few too many sex jokes, but that's what the film is all about, and in someways, that's what gives it it's charm. It cleverly captures the teenage years, and doesn't try and insinuate that's it's something other than what is. A film that isn't always laugh-out-loud funny, but a film that puts a very large cheesy grin on your face.",
            "review_date": "2013-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are some hilarious material in this one but that doesn't make it more than a three-star film, mainly because of its lame plot, but it's still worth a shot.",
            "review_date": "2013-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For what it is, it's pretty great.",
            "review_date": "2013-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the great teen comedies of all time.",
            "review_date": "2013-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The whole cast is hilarious. I love Jonah, Michael, Seth, Bill, and Christopher.",
            "review_date": "2013-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The title is fitting.\n\nhttp://pandoraxsage.blogspot.com/2013/10/the-movie-watching-project.html",
            "review_date": "2013-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another teen movie. Only loved Christopher Mintz-Plasse's acting. He is awesome.",
            "review_date": "2013-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best high school movie since Dazed & Confused. 8/10.",
            "review_date": "2013-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious one of my favorites",
            "review_date": "2013-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect comedy movie.",
            "review_date": "2013-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Laugh-out-loud comedy with heart.",
            "review_date": "2013-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "vulgarly funny and a cast that makes it even more irresistible",
            "review_date": "2013-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "american pie underrated losers version",
            "review_date": "2013-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "if there is anything that is so SUPERBAD it would be the critics who gives this comedy a negative rating.",
            "review_date": "2013-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best comedy since American Pie. Fact.",
            "review_date": "2013-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. That was the most amazing thing on earth",
            "review_date": "2013-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unapologetically crass and hilarious from start to finish, this film centers less on plot (a majority of the film is spent on our protagonists trying to get beer for a party) and more on unlikely scenarios resulting in killer punchlines. However, it also addresses friendship and growing apart in an oddly sincere manner.  Cera, Hill, and Mintz-Plasse are absolutely perfect.",
            "review_date": "2013-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very poor acting. I feel like I could have done a better job myself",
            "review_date": "2013-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its funny movie.had me laghing through the whole thing.reminds me of all the funny stupid shit i did while partying.five star for sure..",
            "review_date": "2013-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not since the 90s have we seen teen comedies as great as this. Deserves all the praise it gets. Spot-on casting.",
            "review_date": "2013-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm changing my name to McLovin",
            "review_date": "2013-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "funny. amazing. will be a classic!!",
            "review_date": "2013-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad, a tale of two really horny teenagers determined to get laid, featuring Jonah Hill and Michael Cera. It is hilarious, and has a great story. Also, McLovin is freakin hilarious",
            "review_date": "2013-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Comedy at its finest !",
            "review_date": "2013-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it! For someone watching a 'teenage' style movie... well this is just an enjoyable fun experience! :) Just gotta watch out for the sexual references and such.",
            "review_date": "2013-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "what a waste of time !!",
            "review_date": "2013-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've never laughed so hard in my entire life.",
            "review_date": "2013-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Actually not a bad comedy, tried to avoid it originally because the adverts made it look like another stupid teen film.",
            "review_date": "2013-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I laughed my liver off with this bromantic flick.",
            "review_date": "2013-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is funny, vulgar, and at times outrageous but is boosted by two comical leads and an accurate take on the typical high school experience.",
            "review_date": "2013-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The antics of Jonah Hill are unmatched and Michael Cera is charming as ever.",
            "review_date": "2013-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "God this movie is loong!  ran out of steam after the first hour.",
            "review_date": "2013-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I absolutely love this movie so much.Cleverly balancing raunchiness with actual comedy(unlike per se Hangover part 2)With actual heart to it as well",
            "review_date": "2013-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Anthem to the awesomeness of nerd-dom.",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best comedies made with one of the best characters ever made. This story has a story and had great laughs with great actors. Totally enjoyable throughout the whole movie. Gotta give it props to McLovin tho. Funniest guy probably in the most recent decade. Everyone else was awesome too. Just to funny from start to finish",
            "review_date": "2013-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This hectic journey of two high-schoolers on a mission to get laid is fueled by hilarious one-liners, a nerdy friend and honest depiction of teenage life.",
            "review_date": "2013-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that you'd expect a middle schooler to write, but at times it keeps you thoroughly entertained and some jokes are noteworthy.",
            "review_date": "2013-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is super hilarious, and it really does an awesome job displaying the weirdness and pressures of high school and growing up.",
            "review_date": "2013-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious and awesome",
            "review_date": "2013-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true work of comedic genius.",
            "review_date": "2013-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is a great example on the awkwardness of the high school experience and a nice authentic take on friendship.",
            "review_date": "2013-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is \"super funny\" and gets more and more preposterous at every turn. Its a great buddy comedy and has underlying themes of friendship. Cera and Hill are one of the best \"opposites attract\" duos that I have seen and their chemistry is great. I must say this is one great comedy that is loads of fun.",
            "review_date": "2013-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first time watching this is very different from the second. The first time, Superbad appears to be just non-stop profanity and sexual jokes. The second time, it is still full of profanity and sexual jokes, but you can detect a message. It's message is that, you don't need to drink booze or get laid at parties to make your way through high school, all you need is friends and being yourself.",
            "review_date": "2013-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is how LOL movie should be ... i don't think i've ever laughed in a movie like this one",
            "review_date": "2013-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was an ok movie with one or 2 laughs but I certainly wouldn't go out of my way to watch it again, there wasn't really much of a storyline and it just seemed to drag on and on.",
            "review_date": "2013-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliantly written and hilarious film and I can't help but think that McLovin will be a meme even after memes die out.",
            "review_date": "2013-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Right jokes at the right time. Excellent teen movie.",
            "review_date": "2013-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "funny, and good character.. that everybody must be feel it in highschool",
            "review_date": "2013-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very funny experience.  This movie will send you reeling and laughing through the unbelievable situations these perfectly relate-able characters get stuck in, and then all of a sudden, you are hit with scenes of true sincerity.  A shockingly uplifting film despite the opening theme of it all.",
            "review_date": "2013-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "2007 was a good year for comedies. With films like Juno and Knocked Up, Superbad just adds on to the list.",
            "review_date": "2013-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite comedies",
            "review_date": "2013-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliantly hilarious, with outrageous laughs and terrible stomach churning cringes throughout.\n\nComedy classic up there with the best of them.",
            "review_date": "2013-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is hilarious and sweet, with spectacular leads.",
            "review_date": "2013-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Doesn't live up to the hype that its since received. Some parts made me smirk but its not the laugh out loud comedy it supposedly is. Not bad.",
            "review_date": "2013-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is a film that has all the hallmarks of a typical teen flick churned out by Hollywood. The focus of the plot is chiefly on beer and sex, the personalities are all fake, and much of the script is swearing for its own sake. Given what I've seen from other teen movies, I firmly expected that out of this film. The writing is pretty much terrible, since it revolves around the assumption that most teens deliberately seek out reckless social situations just for the sake of spending the night with a girl. Of course, that's probably not the point of the film, but it's so intrinsically puerile that everything else gets lost in a sea of beer and bad writing. The characters aren't all bad, although I really despise Jonah Hill's character, who seems to be good for nothing other than dragging his best friend down with him to the pits of mediocrity. Then again, I have a strong dislike for Jonah Hill as an actor. There may be a fair share of funny moments, and in the film's defence, the characters actually develop quite decently, but it's all standard fare for the teen film genre, which doesn't seem to have changed much in three decades. One could argue that this is one of the more decent films in the genre, and back when I was a teenager, I might have agreed. However, all teen movies are basically the same to me, and this film is nothing more than an outdated teen movie that only works for a teenage audience. Even if the film does try for a balance between puerility and wit, it's still too crude for that balance to work.",
            "review_date": "2013-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lot funnier and less annoying than one would expect it to be.",
            "review_date": "2013-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most original comedies I've seen in a long time.",
            "review_date": "2013-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So many hilarious quotes. Michael Cera is great in it.",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If at first you don't succeed watch this movie its pretty funny.",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When I first saw this film I thought it was funny as hell, now...It's still pretty funny.",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, raunchy, and--above all--accurate.",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "pretty much perfectly captures the thought process of a high school kid. one of the funniest and most quoteable movies of all time.",
            "review_date": "2013-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching this when it came out on DVD, it was okay. But then I grew up. For some reason, even when I thought it was okay, I could not stand the cast. Michael Cera is an effeminate, monotone wreck. Christopher Mintz- Plasse is an obnoxious kid who became worthy of internet and reality television fame with his uselessness as a character in terms of plot. It's supposed to be about the one-sided homosexual relationship on Seth's (Jonah Hill's) part in his romantic-friendship with Evan (Cera). All the while this McLovin' (Mintz-Plasse) kid is handing out with these cops (Bill Hader and Co-Writer Seth Rogen) who are clearly going through a midlife crisis. My apologies to Emma Stone, a beautiful young actress, for having to work with these horrible excuses for actors. Bill Hader tried to carry the weight of his performance with the other half of the comic duo, but Seth Rogan's weight is too much (I am not just talking about his physical weight). \"Actor\" Seth Rogan is proof that talent is not a necessity to be an actor or writer in Hollywood. After watching the 9-Month long \"Knocked Up\", one can only hope that the mockery of comic film will end. Jonah Hill is a shorter, fatter version of Seth Rogen, who at least does have slightly better acting ability than the former. Michael Cera, Christopher Mintz-Plasse, Seth Rogan, and Jonah Hill all have a place saved for them in Comedy and Actor's Hell\n\nIn closing, the title is quite appropriate with the quality of this abomination of cinema and the beginning of the end for comedy.",
            "review_date": "2013-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply the best mature teen raunchy high school comedy ever. The only people who don't like this are those who can't handle vulgarity, and even they'll laugh at parts.",
            "review_date": "2013-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seth Rogen and Evan Goldberg make a great comedic team when it comes to writing comedies such as this one.\nLaughed the entire time. Truly funny.\nJonah Hill, Michael Cera and Christopher Mintz-Plasse deliver some of the funniest performances I've ever seen in a comedy about teenagers.\nA great comedy.",
            "review_date": "2013-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly brilliant teen comedy, which has it all: likeable characters, a good storyline and crazy rude humor. Superbad lives up to previous teen greats like American Pie.",
            "review_date": "2013-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fresh, new and hilarious comedy.",
            "review_date": "2013-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "just a generally funny movie ahhahaah michael cera and Jonah hill are both histerical but together they are double as much",
            "review_date": "2013-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4 1/2 stars! \n\nSuperbad is a classic comedy that will have you in fits of laughter. Anything with Jonah hill in tends to be funny to be honest, but it really was brilliant. It's a bit of a cheesy movie, but one you will definitely want to watch again!",
            "review_date": "2013-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie - I thought it was hilarious!",
            "review_date": "2013-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a future classic. Grade A",
            "review_date": "2013-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious at every scene, a comedy that shows the true meaning of friendship.",
            "review_date": "2013-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely great one of the most hillarious movies ever.",
            "review_date": "2013-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Continues to be one of the funniest movies of the last few years.   For some reason the movie lost steam for me during the last 30 minutes.  Regardless Michael cera\"s dry humor and the vulgar need of Jonah hill along with the iconic mc lovin this movie has become a classic",
            "review_date": "2013-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Original, dazzling and fascinating teen-comedy about three precocious \"geeks\" who wants to have one last crazy night before college. The script it's exquisite, with a bunch of funny and clever dialogues, an exquisite story too. It can show the importance of friend-ship, I know it sounds corny but It's true! Thank's Seth and Evan for this one! For me, your best screenplay ever done! I AM MCLOVIN! CHICK! 4.5/5",
            "review_date": "2013-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best comedies of all-time. Great high school party movie and a solid bromance as well.",
            "review_date": "2013-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is one of those unique films with a well written screenplay that is comedy gold.",
            "review_date": "2013-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's hilarious, that's all I have to say.",
            "review_date": "2013-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even with a pretty average formula, Superbad manages to create a fresh new idea that turns out to be very funny.  Superbad is just more than a comedy, it has the feel of an 80s teen film with a 2000s update, which works very well.  The story is excellent and has great humor and storyarcs with a great look into modern high school life.  The acting is easily superb, the entire cast is both very great and funny all around.  The writing and direction is nicely done.  Superbad for the 2000s was a rare treat and still holds up today and remains funny each watch.",
            "review_date": "2013-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really funny movie and personally in my opinion the funniest of 2007, also both Jonah and Michael give great performances",
            "review_date": "2013-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "funny movie wish they would make a part 2",
            "review_date": "2013-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny movie....great pairing in the cast!",
            "review_date": "2013-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny and hilariously vulgar, Superbad recovers my faith in teenager party movies with a smarter dialogue than other movies of the same kind and well use of gags and sex jokes. Sometimes is gross, but at the end, it's a movie better than expected, even if you watched it many times already.",
            "review_date": "2013-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is one of my favorite comedies. The characters feel like real high school students which helps, and it's really well told in story, which brings in great opportunities to create funny moments.",
            "review_date": "2013-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Laughs throughout. The real beginning of a few careers.",
            "review_date": "2013-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know, I'm not really into these types of movies. this movie came out when i was in the sixth grade, and i really couldn't compare my life to that of the characters, not even to this day now that I am 18. I've always been a trouble-maker but never indulged in promiscuous acts not intoxication. Yet this movie happened to capture my liking because of the ending. Yes, the ending actually \"got to me.\" It reminded me of how I would eventually move on in life and start a new chapter losing what was near'n'dear to me.",
            "review_date": "2013-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Way better than Spider-Man 3 and the best film of 2007.  As funny as Pineapple Express and has perfect casting and performances.  Some heart with Seth and Evan scared of being separated and making the party the best they've had.  Very cool plot too.  Lots of laughs and humor.  A movie worth seeing.",
            "review_date": "2013-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious. Only seen this movie twice in the 6 years it's been about but could have easily seen more times and still find it funny. 8/10",
            "review_date": "2013-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I challenge any two actors to replicate the comedic chemistry between Hill and Cera. Undeniably genuine.",
            "review_date": "2013-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If I was 17 I would have loved it. It's so completely juvenile and unintelligent that it saddens me. Still, there are a small handful of truthful moments. For example, the sex scene at the end with Michael Cera is painfully honest. As well as the morning after awkwardness between the two male leads. Lastly, the final moment on the escalator, when Jonah Hill is essentially saying goodbye to not only his best friend, but his entire adolescence, is very touching. Sadly, they ruin it a moment later by having a montage of erect penis drawings. However, it's worth noting that the target audience (teenage boys) need to end the film with dick jokes because the previous emotional moment wouldn't have been \"cool\". Too much emotion! Like I said, as a teenager, the film is perfect. For adults, it's a painful train wreck.",
            "review_date": "2013-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best comedy everrr!!!!!!!!!!",
            "review_date": "2013-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For all it's good qualities, I just can't seem to find the high standards that this movie is held to.",
            "review_date": "2013-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "79%\r\nSaw this on 1 3/06/2013\r\nI had less hope watching this as it is made from the makers of The 40 year old virgin, a film that I didn't care much about. I didn't like this film's trailer because it was extremely vulgarous . But the film did turn out to be nothing like that. This film definitely puts the lead actors(who are good) in a lot of diverse situations and has a good supporting cast. As far as the supporting characters are concerned, the cops are really great and also McLovin. The girls don't have much to do in here, but they do good. This film relays very less on nudity, which is an improvement from the 40 year old virgin.",
            "review_date": "2013-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It comes off as a typical high school senior party, but it's underlying theme of true friendship can't be overlooked. Not to mention it's funny and pulls off raunchy very well.",
            "review_date": "2013-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad becomes all it sets out to be, and then some. It's an airtight flick: the only instances in which our horny protagonists are distracted from their goal of obtaining alcohol is when the ultimate objective of getting laid is in clear sight (the menstrual grinding scene is a prime example.) All conflict is brought about by the three teenagers' differing views on sex and what moral boundaries they are willing to cross in order to have it. Writers Seth Rogen and Evan Goldberg crafted a wonderfully hilarious script that never goes too far out of its way to make a joke. Greg Mottola was a great choice for a director who would guide rather than take control. And the actors killed it. Good stuff.",
            "review_date": "2013-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mate built it up too much.",
            "review_date": "2013-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "McLovin and dick drawings. classic.",
            "review_date": "2013-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best comedy of all time!!!\nWhere teenagers meet girls and party!!! One of my top comedy movies",
            "review_date": "2013-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Re watchable, Pretty hilarious and very well written - 9/10",
            "review_date": "2013-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't think I would like it......but it was pretty funny~",
            "review_date": "2013-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny as hell m, lovein b tripping",
            "review_date": "2013-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Totally painful to watch.  The only redeeming thing about this movie is McLovin and the last scene at the mall.",
            "review_date": "2013-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the best funniest movie ever! tops any funny movie! i love it!",
            "review_date": "2013-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definatly a top 10 comedy. If you can't relate to this film in some way then highschool blew for you.",
            "review_date": "2013-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This obscene, nearly perfect teen comedy covers all the cliches of the genre as three teenage boys must get their hands on some alcohol to bring to a party to impress some girls they like. Jonah Hill is an imaginatively foul mouthed high school student who carries much of the film on his shoulders with dialogue that seems to be coming hilariously straight from a testosterone soaked id. The film wavers a bit with the crazy antics of two police officers who give a ride to the nerd with a fake ID with the name 'McLovin' but it soon gets back on track at a party hosted by a student whose parents are out of town. Even though the four letter words are almost non-stop, this is a film with a heart of gold and the sincere friendships it reveals beneath the teasing, sarcasm and insults are what makes it so fresh, creative and brilliant.",
            "review_date": "2013-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny movie to pass the time",
            "review_date": "2013-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seems to have survived the test of time.",
            "review_date": "2013-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "filthy dirty but hilarious...",
            "review_date": "2013-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing, Amazing film, touching and hilarious.",
            "review_date": "2013-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This has got to be one of the funniest movies I've seen in a long time.  And its not all crude humor, there's a lot of sweet moments in there as well.  Overall an awesome film!",
            "review_date": "2013-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad rises the way for mostly it's entire new cast, showing funny performances and unarguably, teenagers will feel satisfied while knowing there is still a chance for things going well in their lifes",
            "review_date": "2013-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "VERY funny, same gross stuff like knocked up but not as bad and it was a different subject, not as funny either, but is extremelly quotable and funny",
            "review_date": "2013-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn't laugh at all the first time. Thats the curse of a hyped up film. After the dust settled and I revisited it, the laughs were fast, furious and it has some of the liveliest characters in the Apatow cannon. Great stuff. I can't imagine Seth Rogen ever being as good as he was here.",
            "review_date": "2013-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just near perfect coming of age teen comedy.",
            "review_date": "2013-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is a comical and refreshing look at the awkwardness of high-school that benefits from a splendid script that places the protagonists in realistically raunchy situations. Superbad is poignant and the moments of (somewhat) forced sentimentally often generate the most laughs.",
            "review_date": "2013-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty darn funny and pretty awkward too",
            "review_date": "2013-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies of all time. Some people won't get it. I just feel like I can relate to the characters. It is also damn right funny.",
            "review_date": "2013-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a movie that I never get tired of!",
            "review_date": "2013-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Flagrantly juvenile, but redeems itself by overtly breaking some Capracorn-ish sentimental cinematic conventions.",
            "review_date": "2013-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great film, but there was too much penis for me. Too much. There's only so many penises a person can take.",
            "review_date": "2013-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So funny...must see.",
            "review_date": "2013-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best teen movies ever made, McLovin is the best character",
            "review_date": "2013-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is hands down our generations Fast Times at Ridgemont High.  The funniest movie I have seen in a long time if if not the funniest movie ever.  \"I am McLovin\"",
            "review_date": "2013-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best high school comedies ever made.",
            "review_date": "2013-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie!  I can watch it over & over again and it will still generate the same laughter from me.",
            "review_date": "2013-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't care, this movie isn't funny.  There are some laughs when the cops are around but otherwise this is a lame, unfunny movie.  Period.",
            "review_date": "2013-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very funny! Makes you want to be 18 again!",
            "review_date": "2013-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a hilarious film with more than dumb slapstick and raunch that other comedies are going for these days. NO this is a great comedy film and worth a watch for sure",
            "review_date": "2013-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not the greatest start to a moie ever, the friend i went to see it with nearly walked out after the 20th time of disrespecting women, but it does rise to a crescendo. definately a male film. full of cock, pussy and fart jokes. nonetheless funny as hell and McLovin makes it. closely followed by the cops. still does what every american film should try to stop doing ends it on an unrealistic high",
            "review_date": "2013-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the funniest movie I've seen after the first Hangover (which still stands as the best comedy movie for me). Fogell's character was amazing and the star of the movie. It did get a little too extreme with it's jokes at times though.",
            "review_date": "2013-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh man this movie was the funniest I have seen all year..\"Take that vest off, you look like Aladdin.\" Priceless.",
            "review_date": "2013-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad may look like a typical high-school movie on the cover, but its actually much more. It follows a trio of high-school seniors that decide to have one last party before leaving for college (and one last shot at grabbing a girl). The trio consists of Seth, Evan, and Fogell. They make a likeable main cast that is very easy to compare to. Their acting style is ideal for this type of film. Joining them are several other intriguing characters. My favourite were the two police officers, Slater and Michaels. Pretty much every scene with them made me laugh; from their references to other movies to the spoofs on being an officer, its classic slapstick comedy.\n\nThe plot is definitely a strong point, unlike many comedies today. Most of the movie follows two distinct plot lines that join up at the end. Inter-weaved in the plot are countless jokes that kept me laughing almost the whole time. The plot itself involves booze, partying, and law enforcement, and somehow works these in to make a very absorbing story. Also, the particularly close friendship between Seth and Evan is an element that surpasses the comedy genre. The plot as a whole has plenty of unrealistic details, but manages to successfully meld comedy with some deeper meaning.\n\nThe movie as a whole is among the better comedies ever.",
            "review_date": "2013-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "lmao!!!McLovin is funny!! a great comedy movie...",
            "review_date": "2013-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Makes me want to go to a high school party.",
            "review_date": "2013-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't know what this movie was about when I went. Would have picked it - no. Am I glad I went? - hells yes!! Hi-frickin-larious!!!...just...just ridiculous.",
            "review_date": "2013-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie many can relate to looking back at their high school lives. Also a movie brilliantly written by Seth Rogen and Evan Goldberg, is very original by being vulgar and wild in a positive way, but yet play as touching movie. Very well done! Instant classic for the ages.",
            "review_date": "2013-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funniest movie of 2007, Jonah Hill makes me laugh just looking at him.  Can't wait to see him in more comedies.",
            "review_date": "2013-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Superbad\" is the movie where people don't get sickened by all the vulgar talk because the vulgarity is actually used for comedy and not just used for the sake of being dirty. Many funny performances in this movie, in particular Jonah Hill. Another shining character in this movie, who is also the world's biggest nerd, is Fogell, also known as McLovin. I also love the two cops played by Seth Rogen and Bill Hader. Terrific comedy writing by Seth Rogen and Evan Goldberg (they wrote the first draft of the script at the age of 15). The film also has a light-hearted ending that I really admire. \"Superbad\", in my opinion, is one of my favorite comedies ever made.",
            "review_date": "2013-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maturing from adolescence is something all youths aspire to achieve in order to portray themselves with pride and confidence as someone above the standards; looking reality in the face takes guts when defining your identity, but holding onto part of our innocence at the same time is worthy of respect.",
            "review_date": "2013-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't like it as much the first time as every time after. This is just what it was like in high school.",
            "review_date": "2013-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "jonah hill is hilarious in this film.  its LOL beginning to end. funny, realistic film about 3 inbetweener boys trying to get alcohol for the biggest party of the year.  they want to impress girls to get laid before college begins. seth rogen is in this film too, he plays a comical cop.",
            "review_date": "2013-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Vastly overrated. not a bad flick, but the hype was so high, I was let down.",
            "review_date": "2013-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "completely hilarious",
            "review_date": "2013-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A teenage comedy that will have you laughing. Great movie if your into stupid humor with no plot holes.\n\n4 stars.\nHttp://www.facebook.com/ZachLFeldman",
            "review_date": "2013-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny and entertaining",
            "review_date": "2013-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Since American Pie, nothing has been this crud yet have a bittersweet heart to it. This has a brilliant cast, that in a sense started off all their careers and have all starred in something slighty better. This is well directed and more importantly well written. It's such a funny film that you really do, again, believe Americans can write some amazing dialog and situations. Truley recommendable and I highly advertise that you watch this film. Teenage crudness is back on the list, laugh out loud funny, with a heart of gold film.",
            "review_date": "2013-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all-time favorite comedies.",
            "review_date": "2013-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is Supergood. McLovin steals the show. Highly recommend!",
            "review_date": "2013-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one word: Hillarious!",
            "review_date": "2013-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Teen bromance at its best.  Hill and Cera play great hetero-lifemates.  This movie also started my love for Emma Stone.",
            "review_date": "2013-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh my God!! This movie sucked!!!",
            "review_date": "2013-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "awesome movie but not how cops act at all. lol",
            "review_date": "2013-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome characters and many funny moments throughout the film. Just watched it again on network television and thoroughly enjoyed it. 5/5",
            "review_date": "2013-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad was very funny. Jonah Hill was great in it, Michael Cera too and Emma Stone; who was then still a young actress. McLovin was hilarious.\r\n\r\nThe only problem I have with this film is probably Seth Rogen and pal. I love Seth Rogen, but I found them to be slightly annoying at times.\r\n\r\nBut if you wanna have a fun time, go see Superbad. It's a great high school comedy.",
            "review_date": "2013-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gave me a good laugh!",
            "review_date": "2013-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "haha some hilarious, cringeworthy bits.",
            "review_date": "2013-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sure the humor is crude but it's hearty and the plot is nonsense but there is some pleasure to be had with Superbad. Jonah Hill is a whirlwind and really brings the energy into every scene he's in. Given that this film is done by the now well established Apatow Extended Family, it's no surprise that Seth Rogen is the writer and that he has a small part in it as well. What can't be denied is that the direction is pretty bland and feels like it only required powering on the camera and saying action. Scenes tend to run overly long, in an attempt to get good improvisations from the cast, but they arrive almost as often as they don't. Michael Cera plays the awkwardness great, but it doesn't seem that big of a stretch for him. Oh yes, did I mention the plot (if you can call it that) is absolutely ludicrous? Given the films ambitions, that can be a superfluous statement, but it has to be said. If looking for laughs, there are many to be had, but if looking for a great film, look elsewhere. Recommended for Jonah Hill admirers, and pretty much no one else.",
            "review_date": "2013-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To enjoy this this movie, don't expect a clever twist or a stupendous climax; just ride the thunder.......",
            "review_date": "2013-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious in a vulgar display of teenage angst",
            "review_date": "2013-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is a perfect take on teen comedy films.",
            "review_date": "2013-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seth Rogens best film. A raunchy comedy about two (or three) high school kids who, let's just say, want to have a great night. Very, very raunchy and very, very funny. Jonah Hill is perfect for his role, PERFECT.",
            "review_date": "2013-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At the time everyone talked of how funny this is, how hilarious Christopher Mintz-Plasse is but i just thought it was OK. Teen movies are becoming so formulaic and boring, I swear every one i see has the same plot with a few change ups and a different cast bar one cameo. I hope there are some better teen movies to come soon enough that aren't always about losing virginity/getting drunk/ doing drugs/partying etc. I'm probably not paying attention and there are LOADS of great teen movies but perhaps i just don't care anymore because i'm not at that age. Oh well.",
            "review_date": "2013-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its one of the best high school movies!",
            "review_date": "2013-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "67%\r\nSuperbad is a comedy that starts off very well, it has outrageous dialogue and great acting, but I feel it could've been cut 30 minutes or so because it got a bit boring and it wasn't as funny.",
            "review_date": "2013-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most funny movie in the 2000's decade!",
            "review_date": "2013-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing from the first minute to the end.",
            "review_date": "2013-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really tried to not like this movie, but left the theater crying because the raunch was so hysterical! I remember so many different scenes to laugh at and can't keep up -LMAO!",
            "review_date": "2013-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Behold, the best comedy film of all time that manages to make you love every character and manages to tell the story of my weekends, to a point. Recommend this to anybody who loves comedies, who loves the teen years, and to people who love films in general!",
            "review_date": "2013-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awful film! It is so inappropriate and disgusting. Not funny at all!",
            "review_date": "2013-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't believe that a fat Jonah Hill can get Emma Stone but this movie was so outrageous and fun that it doesn't even matter.",
            "review_date": "2013-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "sorry never happened to me in high school, maybe I wasn't coo enough",
            "review_date": "2013-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best comedies ever made, Superbad is a hell of a good time.",
            "review_date": "2013-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was funny, but really more a \"guy movie.\" I would have been happy seeing it on dvd, though.",
            "review_date": "2013-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A hilarious movie packed with all the right actors for the roll. This sort of movie is going to be a tough one to beat. It has also given me the great interest to watch other movies staring the Extremely amusing cast.",
            "review_date": "2013-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So funny it hurt!  Didn't stop laughing hard from beginning to end.  So much profanity and awkwardness.  I loved it!",
            "review_date": "2013-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought that Superbad could have been a little more funny that it really was. But it was really funny LOL",
            "review_date": "2013-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the funniest movies ive ever seen that keeps you laughing non stop throughout the entire movie",
            "review_date": "2013-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best kind of film since American Pie.",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While many high school films fail to capture its topic accurately, this one succeeds with its likeably awkward et hilarious cast intertwined with a couple of suprsiningly mature messages (like the consequences of over-partying and Michael Cera's character deciding not to take advantage of his intoxicated love interest). While it does have its problems like the unlikeliness of how an accidental head-butt could leave such a marking yet getting hit by TWO cars just to fall face-first onto concrete leaves barely any as well as (SPOILERS) Emma Stone's character possibly taking interest in the guy who just tried to get her drunk and take advantage of her (though to be fair he did learn his lesson by not getting the chance to and this could've been just an offering of forgiveness). Nonetheless, I laughed my ass of while watching this film much more often than many other modern comedies or even Seth Rogen movies for that matter.",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great flick. Instant classic.",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wish Jonah Hill was still fat.",
            "review_date": "2013-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I laughed, I blushed, I laughed, I cried from laughing so hard, I didn't pass out. But I'll just pretend my son didn't tell me he saw this one.",
            "review_date": "2013-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "had some funny parts, but it made me a little uneasy overall.  i think they were trying too hard to get laughs, and the language was ridiculously overused",
            "review_date": "2013-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two stars for super-creative drawings of penises that made me laugh more than anything else in the movie.  The rest just kind of reminded me why I never liked high school boys.  Finish growing that frontal lobe and get back to me.",
            "review_date": "2013-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, this movie was amazing. Blood on his pants, alcohol in detergent, etc. Amazing.",
            "review_date": "2013-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really liked this movie. As films go by, I realise that it's not as funny as others..but still.",
            "review_date": "2013-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At first, I didn't want to see it, but when i see it was awesome.... u should really see it....",
            "review_date": "2013-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A teen comedy movie of all the times, for peoples who watch \"The 40 Year Old Virgin\", will love this amazing movie (i guess).",
            "review_date": "2013-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seth was the best...Good for a laugh.Seen so many time.",
            "review_date": "2013-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie of all time!",
            "review_date": "2013-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "brilliant film! everyone needs to see this film, though it is probably more of a guys comedy. McLovin is a legend. haha",
            "review_date": "2013-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aside from the bordeline unrealistic cop scenes (which are pretty damn funny btw) this is such a hilariously accurate teen comedy that has it's heart in the right place in addition to providing crass, gut-bustling humor.",
            "review_date": "2013-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OMFG. This movie is so f*cking crude, i loved it! I can't believe I waited this long to watch it!",
            "review_date": "2013-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad was actually not bad at all. Funny and crazy!!",
            "review_date": "2013-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie was super funny i have to say its better then knocked up...reminds me of american pie....",
            "review_date": "2013-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is waaay overrated. There's some laughs, but 85% of the film was either stupid and not funny or just plain whack. In comparison to Apatow's other films such as The 40-Year-Old Virgin and Knocked Up, the comedy - especially the dialogue, just doesn't hold up. If you haven't seen it yet, wait for it on DVD and rent it. It's definitely not worth seeing for $8.50 - or even $5...",
            "review_date": "2013-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funniest move in a long time. I remember watching this years back with my dad. I was young and still laughed my ass off. Great memories, better film. 5/5 if your looking for laughs.",
            "review_date": "2013-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "F*** YES!!!!  You dont want to see this movie you dont have a sense of humor, for shame!",
            "review_date": "2013-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cannot stop laughing for the first half of it.",
            "review_date": "2013-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I laughed my ass off the entire time!",
            "review_date": "2013-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is to teen comedy movies what Star Wars is to Sci Fi",
            "review_date": "2013-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I snagged a screener copy of this last night and watched a rough cut.  Needs a tighter edit, but it's funny as fuck.  Jonah Hill is gonna be big after this and finally comes out from behind Seth Rogen and Judd Apatow's shadows.  Not as well made as Knocked Up but the comedy works just as well.  Go see it when it comes out next month based off one joke alone: Penis drawings.  That is all.",
            "review_date": "2013-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some hilarious scenes, but as a whole this was disappointing; either that, or I am just too old for this stuff.",
            "review_date": "2013-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Typical summer movie",
            "review_date": "2013-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally Apatow Productions are back in fine form after the horribly over rated Knocked Up here is a movie that lives up to the hype. \n\nI'm not overly familiar with director Greg Mottola; I've enjoyed Undeclared, the Apatow productions TV show which followed Freaks & Geeks in being axed after one season. Mottola directed several episodes of the show, so this collaboration with Seth Rogen along with Rogen & Evan Goldberg's amazing screenplay have created a memorable new chapter in American teen/college comedies. \n\nAs I said the screenplay is flawless. It's hilarious at the same time as bordering on disturbing and you can't help but find amusement in the plight of these high school lads about to embark on college. \n\nThe story itself is nothing new. We have seen many a film of this nature, most notably the American Pie series which were considered at their time of release to be pushing the boundaries of teen comedies. Superbad has just blown those films out of the water and set a new benchmark. The reason this film takes an overused premise and succeeds triumphantly is because of the incredibly strong and funny team working on this. The acting is superb. The leading duo are wonderful together and compliment one another perfectly. They are likeable characters but above that they are believable, making any unlikely or far fetched scenario which follows seem completely capable of happening in the real world. Rogen and Hader are hilarious as the two cops and this film would not have succeeded without these two players.\n\nI really enjoyed this movie which was a relief. After Knocked Up I was beginning to lose hope that we would see this team back on track again. Highly recommended.",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's so stupid it's funny.",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this one will get better each time you watch it!",
            "review_date": "2013-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best comedies that is entertaining from start to finish.  A+",
            "review_date": "2013-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is a super bad ass film. The film's screenplay is hilarious, it coincide's with the characters within the film. Seth is so direct in whatever he say's, he even makes the most offensive words into an art. Wheras Evan is a sit on the fence type of person and thinks before speaking. Possibly the biggest legend of Comedy films ever made 'Mclovin' he is somewhat an iconic person who opitomizes comedy.\nDirected by Greg Mottola he changes the stere-typical groups in society. Here we have a high school with your cliche groups of nerds,jocks and hot chicks. This film makes the 'nerds' the new jocks and flips the typical same old perception of the groups of people in High school.\nFogul who later becomes Mclovin is so cool he only needs one short snappy name. Fogul is such a 'dorky' name he looks, dresses and speaks like a nerd but he has such a hilarious personailty which all combined, a legend is born 'mclovin'. Seth is a person who dosen't think when he speaks but his vocabulary of the dirty mind is astonishing, it sounds so calculated but not scripted because Jonah Hill who plays Seth has an amazing personality anyway and it feels a real person.\nThe three of them together are awquardly funny around other social groups and people. There is Mclovin with his cop buddies, Seth and Ethan who are trying to retrieve Alcohol For Joules party and have extremly funny situations trying to get back to the party with the Alcohol.\nDiffrent relationships are formed in this movie, we have Mclovin with the two cops, Seth and Joules and Ethan and Becca. It's exceptional that all these are funny in their own way and have their own mini plot within the film.\nCinematically the film has little to offer, there is no special camera shots or effects, it's a film which is stripped of it's hollywood glamouisation and is a raw comedy with only one purpose to amke people laugh, and that they do. The script is executed by the cast and the performances seem like they are our level not any better than us not any worse.\nThe film has a lot to offer socially. Watching the cops who again change the dynamic of the stereotypical strict and serving poilce to laid back and relaxed average guys just having some fun. They don't take things seriously in this movie bu there are times when they do show some intelligence and know that they just saw a litle of them selves in Mclovin.\nOverall the film is comedy genius based on the awkward time in life of high school. a spectacular script and superb performances from all the cast.",
            "review_date": "2013-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a film if you asked in 2o to 30 yrs will be a part of cannon for people my age, as such as time marches on it will age but still to be a movie thats a touchstone picture like that is quite an achievement.",
            "review_date": "2013-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a pretty funny movie, but it made me feel really old.  i mean, like nursing home old.",
            "review_date": "2013-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I now have an even larger crush on Michael Cera.",
            "review_date": "2013-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lot of heart masquerading as inane comedy.",
            "review_date": "2013-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The characters are  unlikeable. But, that doesnt' save this movie from it's unbalanced script, let alone all the unfunny moments in the film.",
            "review_date": "2013-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was great so damm funny! Mclovin was the man! Not better than knock uo buy funny",
            "review_date": "2013-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was really funny but can be a little ronchy at times!",
            "review_date": "2013-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A hilarious commentary of the quintessential high school experience (with a good serving of Hollywood shenanigans).",
            "review_date": "2013-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fantastic movie of high school life that reflects on some high school students... love it... :)",
            "review_date": "2013-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The BEST movie of all-time",
            "review_date": "2013-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kind of funny. It had it's moments..",
            "review_date": "2013-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "FUNNNNNNY as H**L\n\nHave to say it is a bit of a boys film with some of the one liners, but still SO SO FUNNY :)\n\nGO & SEE IT MAN\n\nFrom \"McLovvvvvin\"",
            "review_date": "2013-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The defining comedy of our generation.  The king of awkward comedy.  Michael Cera nails the awkward teen moments and Jonah Hill is pure gold.  Not to mention Seth Rogan and Bill Hader being an absolute hilarious duo of buddy cops that every two best friends wish they could some day be like.  This one will never get old.",
            "review_date": "2013-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite comedy's",
            "review_date": "2013-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tried too hard to be funny by forcing too much.",
            "review_date": "2013-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite Funny...I definitely enjoyed it.",
            "review_date": "2013-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "hilarious movie, not for the kids, but it's gonna be a classic teenage coming of age comedy!!",
            "review_date": "2013-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "HAHAHAHA soooo funny... One of the best comedies ive seen... HAHAHAHA!!!!!",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty damn funny, all things considered. Good acting, really funny characters, and some hilarious moments. The cops are the best characters.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "couldnt get through it.. terrible movie.. love that guy in juno tho",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Michael Cera and Jonah Hill are perhaps the worst actors of their generation. They are the epitome of annoying. Thankfully, 35% of the movie is about McLovin who has become the breakaway hit of the movie, mainly because of how awful it is. McLovin's subplot should be the entire movie because everything Hill and Cera do is recycled, stale, and uninspired.\n\nBefore seeing: Jonah Hill can die. He can die and go to Hell. Go to Hell and burn!",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Witty, hilarious and extremely successful in portraying the hardships of high school life for your average teenager. Superbad is probably the finest comedy film of the decade! \n\nSome consider this film to be excessively vulgar and raunchy, but I personally thought that the vulgarity and raunchiness was one of the film's most valueable assets. It increased the authenticity of the portrayal of highschool life. We all know how teenagers talk nowadays, and Superbad did well in its representation of modern teen dialogue. With that aside it was also hilarious!\n\nThis film could not have been better casted. Jonah Hill with his outwardly-expressed rauchiness and sarcasm, Michael Cera with his awkward brand of humour, and Christopher Mintz-Plasse (MC LOVIN) with his nerdiness came together and created a masterpiece which catered to audiences with various senses of humour. No matter one's sense of humour, I can fully guarantee that they will find Superbad to be one of the funniest films ever. \n\nAs far as weaknesses...I believe it does not have any. This film is flawless. The script was brilliant, the casting was extremely well done and the costumes were great! This film effectively makes use of costumes in a way that escalates the hilarity of it. McLovin' and his vest, Seth trying on Evan's clothes (do you only shop at baby gap?), and when Evan is hooking up with Becca (be careful with this sweater it means a lot to me....its vintage) are just a few examples of how costumes were used to supplement the humour in the film.\n\nSuperbad is very ironic. The whole film is about Seth and Evan trying to get laid before starting college but they don't realize their feelings for each other. I cannot say that the two characters are indeed gay, but no one can argue against the fact that there is something homosexual in nature about their relationship. On more than one occasion, the film implicitly presents Evan and Seth's relationship as a homosexual one. The last few scenes of the film make this evident.\n\nOverall, this film was magnificent, a modern classic! It will definitely be remembered as one of the great films of the 2000's.",
            "review_date": "2013-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the funniest movies I've ever seen!",
            "review_date": "2013-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funniest movie of the summer. Better than Knocked Up, but not as good as 40-Year-Old Virgin. Great one-liners and pop culture references. The MySpace joke killed me.",
            "review_date": "2013-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic for years to come.",
            "review_date": "2013-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was hilarious. It had so many good lines and jokes, and it really makes you reminisce about highschool. Of course it's got a lot of bad languange humor, but that's something you should know that going in to it. Oh yeah, and the guy playing Fogall (Christopher Mintz-Plasse) got out about all the best lines and hooked up with the hottest girl. And he did it with this kind of Napoleon-esque kind of humor, but so much better.",
            "review_date": "2013-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "oh man this movie was so funny, everyone in the whole theatre was laughing the entire time, it was awesome",
            "review_date": "2013-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious. Creative and blunt. A few rare fall out of your seat moments but just consistently funny,",
            "review_date": "2013-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really funny. This is the first thing i saw Michael Cera in since Arrested Development, and he was great. Seth Rogan and Bill Hader as the cop are hilarious. The unrated version has a few really funny bits added in, mostly changes of dialogue, usually more obscene than the original line. Definetly worth gettingt eh two disk DVD, the extras are almost as good as the film. The Cop Car confessions inparticular.",
            "review_date": "2013-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "McLovin and the 2 cops were the funniest parts of this film which like all those films dragged on half an hour too long in my opinion.",
            "review_date": "2013-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this movie, allot of \"F\" words in it.......",
            "review_date": "2013-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious.  Not much of a story, but the movie's so funny that it doesn't matter.",
            "review_date": "2013-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Soooop funny. Worth the time",
            "review_date": "2013-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hillarious! Extremely dirty, I'm pretty sure it is the dirtiest movie I've ever seen. I loved it and i couldn't stop laughing. Even thought there was some sub-par acting from Michael Cera, he managed to master the art of awkward moments. Also the whole concept of the fake ID with the name McLOVIN was hillarious. Funniest movie of the summer.",
            "review_date": "2013-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its by no means a terrible movie, but I feel like this movie is a case of one single joke being milked for everything it's got. Seriously. \"McLovin\" isn't even THAT funny to begin with, and it ends up being the most memorable part of the flick.",
            "review_date": "2013-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hilarious, but a little too raunchy for my taste",
            "review_date": "2013-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crude & hilarious!!!",
            "review_date": "2013-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn't believe there could be a movie so lame!!!",
            "review_date": "2013-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great comedy movie. Funny in a stupid way.",
            "review_date": "2013-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is hands down one of the best comedies of all time, good competition for American Pie, but if they make a random spinoff called \"McLovin\" that'd be one of the most badass things ever",
            "review_date": "2013-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny but boring at times",
            "review_date": "2013-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is a hilarious movie with decent acting from not so familiar faces. Jonah Hill and Michael Cera don't have to try to carry this movie because they have so much more comedic help. There are dry spells in the comedy, and that's what it promised to be filled with, so three stars.",
            "review_date": "2013-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crass and hilarious with some genuine bits of comedy gold....have seen it many times..",
            "review_date": "2013-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everything I'd hoped it would be and more.",
            "review_date": "2013-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this movie is about me and my friends.",
            "review_date": "2013-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the funniest movies I have ever seen. The movie has a brilliantly hilarious script and unforgettable characters. The action, comedy and romance in this movie leaves the audience feeling completely satisfied in their movie-experience. If you're looking for a fun, action-packed, hilarious movie, definitely watch this.",
            "review_date": "2013-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Completely hilarious. The script is highly imaginative, albeit highly awkward, the direction is well balanced and the acting is sympathetically crude.",
            "review_date": "2013-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok i probably should have seen this two months ago in vegas when it came out as i had high expectations, whcih were kind of met!!\r\n\r\nThis has some very funny moments, and has seriously made me consider joining the police!!! Or changing my name to macmuffin!!!!!!!!!!!!!!\r\n\r\nAlso i would like a poster of the mr t dick to go on my wall as it is a piece of creative genius!!!!\r\n\r\nIf your looking for a high brow comedy this isnt it, but if your looking for a film full of dick jokes your in luck!!!!\r\n\r\nFelashe!!!!!",
            "review_date": "2012-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Superbad' is two bestfriends' day-long test of friendship and battle for alcohol that is definitely raunchy, vulgar, hilarious, yet honest... but still makes sense.",
            "review_date": "2012-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "laughed my ass off a must see",
            "review_date": "2012-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the foulest movies I have ever seen.",
            "review_date": "2012-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A funny, sweet, and perfectly harmless bromance",
            "review_date": "2012-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the funniest movies I've seen in a long time...I literally laughed throughout the entire movie",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A funny funny movie!  I laugh soo hard!  Love it!",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favourite movies.  At times so raunchy but very sweet.  Many funny bits and great acting across the board.",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad is one of those that you cant help but laugh. It delivers all the way in that front, and is one of the funniest movies I have ever seen. While the film is quite raunchy, I would defiantly tell anyone that has a sense of humor to check it out!",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great and old fashion comedy. Espacially for teens just mc lovin is a classic character you have to known. Basic knowledge",
            "review_date": "2012-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was Awesome, it is one of the funniest films I've seen in a while. I mean some of the one-liners in this move were classic. It is definitely one of the best films to come out this year!",
            "review_date": "2012-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superbad served as a revolutionary agent that changed the comedy genre forever. Many young careers were launched such as Jonah Hill, Michael Cera, Christopher Mintz-Plasse and Emma Stone. The story is simple yet interesting with characters that are controversially hilarious. Seeing the high school lives of socially awkward teens is something we can all relate to, and it makes watching Superbad an enjoyable experience.",
            "review_date": "2012-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw this in theaters with my best friends. I'm still shocked we were able to hear the movie through the unending laughter.",
            "review_date": "2012-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I haven't laughed so much in ages. Brilliant! I want to see it again already!",
            "review_date": "2012-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "20 minutes into this, I said to my friend \"this is the greatest movie ever made.\"  Not really of course, but as far as I'm concerned it's the best comedy since Anchorman.",
            "review_date": "2012-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, sweet, and a bit too close-to-home at times.\r\nThe new American Pie perhaps?",
            "review_date": "2012-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesomely hilarious! Some great lines that you'll laugh about for a while. Go see it!",
            "review_date": "2012-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favourite movie about teenagers and their problems!",
            "review_date": "2012-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The name describes how crappy this movie is.",
            "review_date": "2012-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "absolutely hilarious , astoundingly realistic, and exceptionally acted.",
            "review_date": "2012-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as generic as most teen comedies, but nothing amazing either.",
            "review_date": "2012-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the funniest movies I have ever seen.",
            "review_date": "2012-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great comedy. This film has everything a high school comedy fails to have. It has heart, an honest portrayal of high school and most importantly, it has laughs, lot's and lot's of laughs. This movie is where Jonah Hill and Michael Cera  became very famous. I love the 70's type of style of film-making that this movie presents, it's quite refreshing.Although it doesn't quite reach the height of a five-star rating for me, I still really dug the hell out of Greg Mottola's \"Superbad\". 8/10!!",
            "review_date": "2012-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really funny! the cops and mclovin make this movie good",
            "review_date": "2012-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The raunchiest movie I've ever seen. I felt embarrassed for all involved. I was laughing, but often out of embarrassment for the characters.",
            "review_date": "2012-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The comedy that started it all",
            "review_date": "2012-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, and great choice of cast",
            "review_date": "2012-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yea, noone will agree w/ me on this but i felt the movie was just horrible.  Sure there are some memorable lines but this is all about womanizing sex and drugs.  Been done before YIPEE DO DA.",
            "review_date": "2012-12-17",
            "source": "rt",
            "lang": "en"
        }
    ]
}