{
    "rating": 9.1,
    "release_date": "2007-08-03",
    "num_reviews": 610,
    "genres": [
        "Action",
        "Mystery&thriller"
    ],
    "summary": "Jason Bourne (Matt Damon) continues his international quest to uncover his true identity. From Russia to Europe to northern Africa to the United States, he must stay one step ahead of those who would capture or kill him before he has a chance to discover the truth.",
    "reviews": [
        {
            "content": "A good sequel that doesn't live up to the original.  The handheld cinematography is certainly interesting and works with the action sequences.",
            "review_date": "2023-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Elite for a 3rd in a series",
            "review_date": "2023-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excellent end to the trilogy, with more action, more tension, and a relief that our character is now complete.",
            "review_date": "2023-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I sincerely love the action in this movie. Matt Damon acted his part flawlessly. The movie's ending is the best in the series.",
            "review_date": "2023-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great action, great series of movies ",
            "review_date": "2022-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best sound mixing ever done in a movie!",
            "review_date": "2022-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has a rhythm that made me be really interested and inmersed, there's no a more elegant and neat hero (or antihero if you prefer) than V and his will to make his revenge a reality still makes me a fan. Escenes like the one in the top of the building with the 5th movement of Tchaikovsky and the other with the dominos created a gallery in my mind that lives rent free. \nIndeed, this is cinema🚬🚬🚬",
            "review_date": "2022-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "love all three absolutely fantastic movies",
            "review_date": "2022-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is something magical about these movies. It's like a Disney mixup with James Bond.",
            "review_date": "2022-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The third entry in the 'Bourne' spy series is the best installment yet. The filmmakers have crafted a delicious, neck-snapping, dazzling blur of a chase film, a state-of-the-art actioner complete with shootouts, chases, brawls, and dry wit. It is crammed with great actors, with Matt Damon leading the pack again in his definitive action role. At this point in the series we know what Bourne is capable of and we've become engrossed in his mission, and Damon is so convincing at pulling off the physicality of the role that he's a riveting presence at the center of this. Joan Allen and Julia Stiles are also back, providing solid supporting work. David Strathairn reminds us of that old Hitchcock saying \"Good villains make good thrillers.\" Director Paul Greengrass pulls off these amazingly complex set-pieces--a nerve-wracking getaway at London's Waterloo Station, a motorcycle and rooftop chase in the housing clutter of Tangiers, a whip-lash car chase in New York, and a visceral fight to the death with an enemy assassin. Each is meticulously plotted and choreographed to perfection. He and cinematographer Oliver Wood, editor Christopher Rouse, and composer John Powell are geniuses at capturing the time-running-out speed of this tale. Extreme close-ups of people, locales, and incidents, rapidly cut into a seizure-inducing blur, all set to a throbbing Hitchcockian score--this is how you mount an effective action thriller. Everything is so breathless that you may not notice the minor plot hole now and again. Still, here is arguably the best action picture of the decade, a film that ultimately redefines the action genre",
            "review_date": "2022-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most intense action movie I've ever seen. Paul Greengrass and Matt Damon are a dream team.",
            "review_date": "2022-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I missed this era of action movies this stroy is perfect in every ways. Im still watching this movie after so many years",
            "review_date": "2022-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Let me start by saying that this was a strong and fitting conclusion to an already stellar series of films bearing the Bourne name and is the best of the trilogy!  The camerawork is great and not as overbearing or headache-inducing as \"The Bourne Supremacy\" was, especially in the beginning of the film.  This time we have a more restrained style of editing that is still able to keep up with the action and provide multiple points of view and angles and editing together in a cohesive and exciting way.  The film features another strong performance, as does the rest of the trilogy, from leading man Matt Damon in the title role and a decent cast that round out the film's other characters.  The film is action packed, even more so then the previous efforts but also manages to make it poignant and relevant enough to stack on the suspense and tension for the viewer.  Jason Bourne comes back home and is there to bring the house down and he does!  I would highly recommend anyone who hasn't seen the Bourne Trilogy to strap on their seat belts and give it a ride!",
            "review_date": "2022-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yeah we're two movies into this franchise and I can already tell this is not it for me. Good action sequences, but just a forgettable and uninteresting plot.",
            "review_date": "2022-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jason Bourne is the terminator movie star movie theater with the movie star film star movie theater movie and film theater",
            "review_date": "2022-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "90%. High intensity throughout the whole movie. Really no downtime. Very exciting and suspenseful film. It is basically just action so it's hard to put it higher than a 90 or so but it's as good as it gets when it comes to action movies. Always worth a rewatch.",
            "review_date": "2022-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best action movies i have ever seen, everything about this movie is perfect and i can't find any flaws with it. Paul Greengrass puts all of his skills to the test with this film.",
            "review_date": "2022-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally getting round to seeing the original Bourne film trilogy, after hearing nothing but good things, there hasn't been any regret watching them. Wasn't sure initially as to whether they'd be my cup of tea or not, hence why it took so long to see them, but that was not the case.\n\n'The Bourne Identity' was a very pleasant surprise, giving a fairly well-worn genre a much needed freshness. It had its imperfections, but was a very solid and even very good film with much to recommend and introduced a cast-against-type Matt Damon in one of his best roles. 'The Bourne Supremacy' was an example of a sequel that was every bit as good as its predecessor, maybe lacking its freshness but also made a few improvements along the way. The original Bourne trilogy ends with 'The Bourne Ultimatum', which has been regarded often as the best of the three, cannot disagree.\n\nSome of the hand-held shaky cam is used a little too excessively (epileptics be warned!) and the ending could have been a little less frenetic and confused and had more careful tying things together and explanation.\n\nVisually, on the other hand, a vast majority of the time 'The Bourne Ultimatum' like its predecessors looks slick and stylish with even more breath-taking locations. There were many instances when the hand-held shaky cam did intensify the tense claustrophobia of the atmosphere and intensity to very good effect, never making things incomprehensible.\n\nLike 'The Bourne Supremacy', the music score is even more dynamic, atmosphere enhancing and more layered this time round, while Paul Greengrass' drama-documentary style and background to his directing is used to full advantage. 'The Bourne Ultimatum' has the sharpest, most intelligent and subtle script of the three films, in a way that is just dazzling.\n\nThe story never lets go of its grip and never strains credibility or reality. It is a tense adrenaline rush throughout, with the best mix of exciting action, the best of it is absolutely thrilling, and meaty story-telling, with lots of emotion and characterisation meat, that develops Bourne the best of all three films. Paul Greengrass' directing style and his experience in drama-documentary is once again used to full advantage.\n\nMatt Damon has really made the character of Bourne his own, at the time of 'The Bourne Identity' it was very much a cast-against-type role but now it is one of his best. Julia Stiles and particularly Joan Allen are marvellous, as is a suitably malevolent David Strathairn, and while the supporting cast are a little underused they all do uniformly sterling work (one would be very hard pressed to get a bad performance out of Albert Finney for example).\n\nIn conclusion, what a conclusion to the Bourne trilogy. 9/10 Bethany Cox",
            "review_date": "2022-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Story is pretty generic, still am not a fan of the shaky-cam style action. Some effective thrilling scenes though.",
            "review_date": "2022-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The bourne ultimatum shows the wrinkles of of the bourne series for me...while a reasonable watch you can't help but feel you've seen it all before",
            "review_date": "2022-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "FANTASTIC action thriller, couldn't take my eyes off for a minute. Also, scenes in Madrid.",
            "review_date": "2022-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest action movies of all time. The Bourne Ultimatum may be the end of Bourne, but it is the beginning of an era. Little do people realize the influence of this film—and the Bourne trilogy as a whole—on what would be the next 15 years of action-movie cinema.",
            "review_date": "2022-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing how much the CIA has upgraded in just 5 years. From CRT monitors and print outs to LCD screens and projections. The first final movie 😀, I really liked how they time linked it back to the end of the 2nd movie, then Bourne goes and jacks a police car just like in GTA! This is the one where we finally get some answers and closure! Cue Moby SMASH CUT.",
            "review_date": "2021-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first Bourne movie was a tightly made and thrilling story of a spy with a blank memory, and while the second was notably sloppier in execution, it was actually notably stronger in regards to story intensity and complexity, featuring a few moments that are better than any other moments of the first.  This third entry, however, is just sorta....there.  The story doesn't contain much inside of it and the plot elements are almost identical to those of the first two, making it a rehash but without the depth.  Additionally, while the action scenes are ever-so-slightly better than in the second one, they're still not exactly very good.  The editing is slow, the stunts are slow and the enemies are just faceless baddies.  The Director's obsession with accentuating hand-held camerawork is even more annoying here, and without much in the way of a story or engaging central conflict, it has nothing to fall back upon.  I can't say the movie is bad by any means, but it's easily the least interesting of the trilogy, features easily the most boring villains (whom were never the greatest to begin with) and doesn't actually offer any closure, despite this being one of the selling points of the movie upon release.",
            "review_date": "2021-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've seen the Bourne Films more times than I can remember, and yet they remain one of the most watchable sequence of films in living memory (I don't count The Bourne Legacy). Paul Greengrass' astonishing use of shaky-hand camera lends the film a truly edge of your seat experience, and the three main set pieces in The Bourne Ultimatum are nothing short of God-like film making. The earliest of these, a labyrinthine manhunt through London Waterloo station is one of the most impressive scenes I have ever seen in a thriller, and Greengrass doesn't stop there, he follows it up with a bone crunching sequence in Tangier, and a insanely violent car chase in New York City. It's a perfect end to a near perfect trilogy (The Bourne Identity misses Greengrass' direction) and although they then made a 4th which is solid, it doesn't hit the heights of Supremacy and Ultimatum. Brilliant, brilliant film making. Matt Damon is also superb.",
            "review_date": "2021-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly, I can't believe how good this film is. This film is an adrenaline rush that you'll not get anywhere else, even in 2021. Coupled with impressive storytelling, mind blowing action set pieces, spectacular fight scenes and brilliant performances from everyone, especially from Matt Damon. Sometimes I wonder, how did not Matt Damon win an Oscar for this film. Also director Paul Greengrass' shaky camera work is still very much unique to this day. And this film has the best chase sequence and the best hand to hand combat sequence I've ever seen. And the story wraps up the Jason Bourne trilogy on a high note, it's a very satisfying conclusion..",
            "review_date": "2021-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely the best Bourne sequel there is, showcasing a magnificent performance from Matt Damon, as well as having some top notch action.",
            "review_date": "2021-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It would sure help the movie and my enjoyment of said movie if I the camera wasn't jammed into someone's face the whole time",
            "review_date": "2021-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Bourne trilogy goes out on a high note with the third instalment \"The Bourne Ultimatum\". The first movie is a classic but I think this has to be a strong contender for #1 spot. The tension is constant throughout the movie and the action was nonstop. I was on the edge of my seat the whole time. Jason Bourne is in constant turmoil and Matt Damon is able to portray all of his feelings through his eyes that you are constantly intrigued with what he is thinking. I think this movie has some of the best stunt work yet. There is a fight scene about half way through the movie that was so real you couldn't look away. The only thing is the constant shaky cam does get disorienting, especially during those fight and chase scenes. It's hard for your brain to keep up the pace. Besides that I honestly enjoyed watching this movie and I really recommend it!",
            "review_date": "2021-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Somebody needs to teach this director to hold a camera steady for more than one second. The camera jerks and swerves so much, it actually made me dizzy. It's not the least bit clever, and it's unnecessary. I paid for a movie, not an amusement park ride.\n2 1/2 stars because Bourne finally discovers his real identity.",
            "review_date": "2021-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good story and action ruined by shaky camera. Is the goal to make the audience dizzy and confused?",
            "review_date": "2021-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Bourne Ultimatum ends the Bourne trilogy with a resolution. Matt Damon's Bourne is able to finally confront the forces that created him and the dark truth of his past. The movie adds David Straithairn to the cast in a great performance usual of him playing government officials. As the rest, this movie does not rely on characters and substance but on the plot. But the plot is exciting and exhilarating it and this one has more action than any of the previous ones with tense thrilling moments. The Bourne movies are simply fun to watch and that might be enough.",
            "review_date": "2021-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't know why or how, i was just not invested in the story.",
            "review_date": "2021-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LOTS of action sequencies…and a lot of chase scenes. I think that the movie had too much of these and not enough plot. The plot was easy to follow but it kept getting interrupted by a LOOOOOONG fight scene or a LOOOONG chase scene. The fight scene in the Moroccan apartment went on FOREVER! Geez…kill the guy already…we knew how it would end. The car chase with the \"asset\" went on interminably. It was like the director came from an action-type film background. Nice to see the bad guys get it in the end (we hope) although this was also something expected. One thing I cannot get over…Bourne is known intimately in the spy world and on camera. Why, why, why… did he not try to disguise himself at all? Some glasses, dark hair, a hat, grubby clothes….anything….but…no….had to have him moving around where all the cameras could pick up on him.\n\nAll in all, a good movie…too much action though.",
            "review_date": "2021-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best In the Bourne Franchise",
            "review_date": "2021-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great movie in the Bourne series. Matt Damon is officially a action star. I couldn’t ask for a better ending. ",
            "review_date": "2021-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Matt Damon gives another powerhouse performance in The Bourne Ultimatum, a fast paced non stop action thriller. Along with Paul Greengrass’ excellent camerawork making this installment the best Bourne film to date. ",
            "review_date": "2020-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can see why a lot of people like it but to me it's just run of the mill.  Matt Damon is not believable as an action star.",
            "review_date": "2020-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked the Bourne series. At that time it was a good original storyline and the action was James Bond like. This one was no exception.",
            "review_date": "2020-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With fast-paced and thrilling action sequences, intelligent storytelling, a strong lead performance from Matt Damon, and skillful direction from Paul Greengrass, it's arguably the best of the franchise.",
            "review_date": "2020-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The finale to the Bourne Trilogy lives up to its predecessors with spectacular action scenes; it does, however, seem at times as a best-bits montage of the previous two films. The difficulty is that Jason's story doesn't have anywhere to go and lacks motivation.",
            "review_date": "2020-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Bourne ultimatum is the best Jason Bourne Film. One of the best action films ever made. Best shaky cam ever used. Best way possible to finish Bourne's story",
            "review_date": "2020-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the most action-heavy of the original trilogy. In particular, the chase scenes are top-notch.",
            "review_date": "2020-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can understand why people would like these movies but in my opinion they're the most boring action movies ever made. I love action movies but I just can't get into any of these films. Maybe it's the way it's filmed but I always lose interest very quickly. I remember walking out of the movie theater while watching the Bourne Identity when I was 12 and it still hasn't aged well. Perhaps it's because they play the CIA up to be an organization that has its shit together and I know otherwise.",
            "review_date": "2020-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely my favorite out of the trilogy!! A good end to the original series!!! Matt Damon is incredible",
            "review_date": "2020-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best of the trio.",
            "review_date": "2020-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest action movies of all time. This movie is the definition of a non-stop thrill ride highlighted by an incredible hand to hand combat scene. But this is not just an action movie. As you dive deeper and deeper into Jason Bourne's past, you become emotionally invested in the character built up the previous 2 movies. This movie gave me goosebumps",
            "review_date": "2020-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's an action packed thriller that'll keep you glued to the television. The best part is that it is one of a 5 so you have the option to see other ones and continue the storyline",
            "review_date": "2020-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3 straight movies of the same people chasing after the same super agent. It's the same movie over and over. How do people keep interest?",
            "review_date": "2020-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "#TheBourneUltimatum #MovieReview: 10/10\n\nPros:\n\nMatt Damon\n\nFast paced\n\nAmazing handheld camerawork\n\nEngaging manhunt with more menacing villains\n\nAwesome hand to hand fight and 20 minute action sequence\n\nGreat conclusion to the original trilogy\n\nReveals a lot of info\n\nCons:\n\nN/A",
            "review_date": "2020-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mind-blown!it was insane and literally one of the greatest action thriller of all time!it was full of fast paced Chasing sequences and intense story-line with brilliant traps and twists it was that awesome i didn't wanna blink even for a second!the music was like cheery on top it was boosting adrenaline to the exciting and awesome actions and chases,the acting was iconic and the story-line was insanely great,the stating hide and seek game with journalist was mind-blowing and thrillingly amazing.the agent's assassination in Arab was shockingly brutal and awesome with the intense chase and great fight,the previous movie connection was surprisingly awesome with the amazingly brilliant trap for CIA it was literally ground-breaking and insane the whole ending was like another level awesomeness,the whole movie was literally roller coaster thrilling and intense ride it's a Masterpiece!",
            "review_date": "2020-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Certainly the best of the trilogy.  The filmmakers got back to what made the first movie so good, non-stop action from the beginning.  It helps that all of the back story has already been told, but there was still plenty to learn.  Very fast past, great chase scenes both vehicular and on foot, and goo fight coordination.  Downside, lots of shaky camera and quick cuts yo make the fights and stunts happen.",
            "review_date": "2020-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Best one in the series. Jason Bourne’s true past has been revealed, and the story ends on an explosive note",
            "review_date": "2020-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was suppose to be the end to this brilliant trilogy. Matt Damon is amazing in this movie and this is the best bourne movie in the franchise. A must see for anyone who loves these types of movies.",
            "review_date": "2020-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched the original trilogy again ...this is brilliant action movie making.",
            "review_date": "2020-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is another fast-paced action thriller with great fight scenes and expert-editing. Greengrass delivers with quick cuts that speeds up the fight sequences and delivers additional suspense. \n\nThe story again follows Jason Bourne as he continues his journey of self-discovery, while again eluding new CIA bosses in foreign locations.\n\nNot many flaws that can be pointed out besides convenient plot-driving events which allow for shorter run time (I'm not complaining), and some may complain about an excessive shaky-camera, but it works well putting the viewer in the corner as Bourne gets out of another close-call. Overall, the combination of Damon's acting and Greengrass' filmaking makes this a truly great action movie.",
            "review_date": "2020-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This third installment of the Bourne movie series was really good. Matt Damon, Julia Stiles, David Strathairn, and the rest of the cast did a fantastic job in this movie. The plot to the movie was suspenseful and action packed. This movie will blow your mind. If you haven't seen this movie yet, check it out sometime. However, you should the first two movies before this one.",
            "review_date": "2020-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great final installment in the original trilogy that provides a satisfying conclusion while fine-tuning the stylistic elements and action choreography that the series had become known for. (4.5/5)",
            "review_date": "2020-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How does he continue to slip through?",
            "review_date": "2020-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Same rating of the 1st and 2nd one, as it is the same movie.",
            "review_date": "2020-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The ending of the previous film is incorporated in a rather jarring manner in \"The Bourne Ultimatum\", which, like its predecessor, is a fun yet inessential expansion of Jason Bourne's saga. The trademarks of the franchise are reassuringly present and the occasional moments of brilliance, such as the sequence at Waterloo station, are worth the price of admission alone.",
            "review_date": "2020-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A visceral rush of energy and assassination!\n\nPaul Greengrass' espionage thriller The Bourne Ultimatum (2007) is a blitz of action assaulting your senses. 115 minutes flash by in a moment like one of Jason Bourne's faded memories. I think The Bourne Ultimatum may honestly be the best action movie ever as the hand to hand combat is so brutal and intense that you are gripped by every punch thrown, while the gunshots are loud and shocking. \n\nI cannot overstate how influential the Bourne series' choreography has been on the action genre as every film after it has tried and failed to replicate the awe inspiring hand to hand combat captured here. I would say only Guy Ritchie's Sherlock Holmes and Chad Stahelski's John Wick films are closest we've ever gotten to such pinpoint accurate choreography and brutal fight sequences. You'd have to go back and watch a Jet Li, Jackie Chan, or Bruce Lee movie to get that feeling again. The Bourne Ultimatum is nonstop action and thoroughly entertaining as a movie. How can you not love carefully planned out choreography, fast paced car chases, and stunning emotional clarity?\n\nAs a film, it is brilliantly written by Tony Gilroy from Robert Ludlum's spy novels. I think the plot is intricately plotted and creatively told as an amnesia suffering assassination named Jason Bourne finally gets closure as to his origins, training, and purpose in the world. The writing is so pithy and mature. The Bourne Ultimatum effectively critiques the extreme methodology that the American government is capable of, while telling the personal story of this killer who grew a conscious.\n\nGreengrass' direction is still experimental and exciting as he and Oliver Wood's shaky cinematography craft a  blur of motion to enthrall audiences. Christopher Rouse's editing is so rapid fire, but precise with each cut that you always know what is happening. That is rare indeed within the action genre. You never get a moment of rest, but in all the swift momentum, you are carried along a fascinating tale of government overextension of authority and excessive use of lethal violence. \n\nI love The Bourne Ultimatum for its ambitious arthouse take on action sequences and espionage narratives. John Powell's score pounds at your heart matching the film's energy like a crashing car or a gun being fired. By the end credits with Moby's killer \"Extreme Ways\" theme song for The Bourne Trilogy playing, I have this movie franchise burned happily into my fondest film memories.\n\nMatt Damon is brilliant as the genius professional assassin Jason Bourne, who must protect contacts so that he must uncover who is at the head of Treadstone and Blackbriar's assassination corporation as well as the key to the locked doors of his memories. Damon flies through breakneck speed action with effortless precise and devastating accuracy. His emotional moments are perhaps the most clear and affecting within the Bourne series. Matt Damon was simply born to play Bourne.\n\nJulia Stiles is really neat and likable as Nicky Parsons as the sidekick and love interest for Damon's Jason Bourne. She is a reliable asset and intriguing supporting actress. Her face and eyes are so expressive whether she is scared or upset. I wish Stiles had gotten more acting roles after The Bourne Trilogy, but alas she did not.\n\nDavid Strathairn is vile as the head operational chief of the CIA named Noah Vosen. His underhanded dealings and resorting to violence is shocking and entertaining akin to Chris Cooper's villain in The Bourne Identity. Albert Finney makes an unforgettable cameo as Dr. Albert Hirsch as he reveals Treadstone's cruel training methods in a performance as nuanced and reprehensible as Brian Cox in The Bourne Identity and The Bourne Supremacy. Likewise, Scott Glenn is excellent as the head of the CIA named Ezra Kramer, who rules from the shadows.\n\nJoan Allen delivers an emotional performance as the lady in charge of finding Bourne called Pamela Landy. Edgar Ramirez plays Paz in an early career role with a cold ruthlessness about him. Paddy Considine gives reporter Simon Ross a sweaty realism that I like. Would you believe that Daniel Bruhl even gets a cameo as Franka Potente's brother in an emotionally devastating scene of quiet composure. I forgot what a stacked cast The Bourne Ultimatum had, but then again, this was a gigantic film when it first released in theaters.\n\nIn all, Paul Greengrass outdid his phenomenal direction for The Bourne Supremacy with the focused storytelling and artistic flourishes of dreams and memories brought to life with a resounding gunshot.",
            "review_date": "2020-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Bourne Ultimatum is the least engaging yet most fantastical of the trilogy; at this point you feel like they should really just have saved themselves the trouble and told Bourne who he really is, or alternatively he should have at least grown a beard, shaved his head, and stopped wearing the same clothes.",
            "review_date": "2020-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its A Step up from other Jason Bourne movies! 4,56/5",
            "review_date": "2019-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the absolute best spy series\never",
            "review_date": "2019-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best action movies of the last twenty years.",
            "review_date": "2019-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "closing out one of the best trilogies ever. the third movie does a great job of wrapping up putting a stamp on this franchise. A must watch trilogy. This could of been perfect ending if they did without the 30 different camera angle shots every minute.",
            "review_date": "2019-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jason Bourne = best action movies",
            "review_date": "2019-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The conclusion to the Bourne Trilogy is a satisfying,, though the franchise's formula is wearing thin.",
            "review_date": "2019-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fueled by the same effective tone, pace and exhilarating action that improved the second one of the first entry, Ultimatum finds Paul Greengrass delivering a dedicated and thrilling flick that offers some good-although-hyperactive-action moments and, most of all, the engaging suspenseful plot that has Matt Damon giving his best as the action-espionage hero could give, with direction, fast paced rhythm and a satisfying conclusion to the Bourne trilogy in the storytelling department.",
            "review_date": "2019-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The third installment that caps off the trilogy on a high note. Ultimatum is the best film in this already iconic saga. Giving us an enemy that has more of a purpose. Matt Damon is back yet again, delivering us the iconic character we know and love. The great directing by Paul Greengrass, amazing action, and another fresh script which blends in with the smart plot. I only wish their was more characterization. But I can't help but argue, and say that is was fantastic.",
            "review_date": "2019-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just as good as the first movie!",
            "review_date": "2019-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best, and I mean BEST, BOURNE movie in the entire series. Now, people who know me or who have read my previous review on THE BOURNE SUPREMACY come to me and say: \"Hey! Wait a minute. How come you think SUPREMACY isn't that good but that ULTIMATUM is the best? It's made by the same director, ain't it?\". And yes, it is. But that's beside the point.\nThe reason this movie trumps all the other movies is just because it is SO....FAST....PACED! I mean, seriously. This film immediately begins with action, and then constantly hits you with rapid-fire fight sequences and amazing chase scenes in quick succession! It's breath-taking. No, literally. It just doesn't let you breath because it's so fast-paced.\nI also love Paul's signature quick-cut editing for the action scenes. He really perfected it in the movie, and some fight scenes are so much better than in SUPREMACY. For example, my favourite fight sequence of the entire franchise, the one with Bourne and Desh, was just so rough and violent and brutal, courtesy of Paul Greengrass's shaky cam/cuts. I also thought that this movie had new ideas. The rooftop scene in Tangier is just....a masterpiece.\nI mentioned THE BOURNE SUPREMACY had an unsatisfactory story arc (in my opinion), and that I had one or two issues in the direction it was going (mainly because it wasn't faithful AT ALL to the novels). But THE BOURNE ULTIMATUM serves us a riveting ending, and I'm so glad for that too.\nULTIMATUM delivers all the thrills you need. Watch this now!",
            "review_date": "2019-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's fast paced and actionpacked. It's probably the most exiting movie in the series but not the best, because I again think that the villain is quite silly.",
            "review_date": "2018-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was solid.",
            "review_date": "2018-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All the action made it feel kind of boring to me which is weird because action and adventure is my favorite movie genre. I'm half and half on this one.",
            "review_date": "2018-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Bourne Ultimatum is more intelligent than the previous entries and delivers the thrills but doesn't have as strong of a plot as the first.\n-8.5/10",
            "review_date": "2018-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a mess. Buy a damn tripod! If you think about it, nothing much really happens in this movie. As others have pointed out, it's Bourne going from here to there to over there. All this is intercut with scenes of people STARING AT COMPUTER SCREENS. Ooooo! Ahhhhh! The fight scenes may have been choreographed very well but I couldn't tell because it was shot so poorly.",
            "review_date": "2018-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it may still not live up to the original, \"The Bourne Ultimatum\" is a huge improvement upon it's predecessor.",
            "review_date": "2018-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm rating as close to average as I can. This is me just shitposting. Can everyone agree to call this movie The Boring Old Tomato?",
            "review_date": "2018-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "100% focused and surprisingly comprehensible in its genius editing job, Ultimatum marks a high peak in the Bourne franchise not only with the non-stop break-neck action, but also a satisfying plot.",
            "review_date": "2018-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fight scenes are great, but two or three of the scenes are so similar to The Bourne Supremacy that most people can't even tell the difference between them.  And unfortunately the surprises and mystery surrounding Bourne's story that made the first two films so great is gone.  In the end adding upto aomething that would be whole lot better if it's prequel didn't exist.",
            "review_date": "2018-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All the Bourne movies are good, but this one is clearly the best.",
            "review_date": "2018-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Weakest of the three movies but still very good.",
            "review_date": "2018-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have no idea why these movies get such high ratings, but I didn't like this one just like I didn't like the second.  The first was good, but I don't know what happened after that.",
            "review_date": "2018-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like John Wick, series starts well then becomes nonsense. Full of unrealistic moments, there is no way one man could pull this off and there is to much Martial Arts. Eventually, it becomes boring and doesn't impress. I love John Wick as well, at least the 1st one. Could say the same about Taken, gets a bit ridiculous by the 3rd one but I can rewatch them forever.",
            "review_date": "2017-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best spy movies of all time, The Bourne Ultimatum takes everything great about the first two films and dials it up to eleven. The action, acting, direction, and script are all top-notch, adding up to a thrill ride that grabs you and doesn't let go.",
            "review_date": "2017-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'THE_BOURNE_ULTIMATUM' was_directed_by_Paul_Greengrass_and_stars Matt_Damon, ?David_Strathairn_and_Julia_Stiles. ?Jason Bourne (Matt Damon) continues his international quest to uncover his true identity. From Russia to Europe to northern Africa to the United States, he must stay one step ahead of those who would capture or kill him before he has a chance to discover the truth.\n\nI didn't like Identity. I liked Supremacy. I adored every second of Ultimaum. This is easily the peak of the trilogy(and allegedly franchise as a whole). It encapsulates the good from both movies and improves drastically on the flaws I had with them films. No Marie Kreutz from Identity. Easily the Bourne franchise's best villain and no contest the best action. Greengrass is the only current director who can use hand held cam effectively and he perfected that craft with Ultimatum. He was working there with Supremacy but ironed out all the chinks with Ultimatum. This is easily the best movie in the trilogy and maybe even one of the best action movies in recent memory. \n\nWhere do I begin in complimenting this movie. I guess the story would be a great place to start, and what a brilliant story it is. Gilroy, Nofil and Burns have made a spectacular story that is gripping and enthralling from beginning to end. It is interesting and I would argue the best story of the three, even though Supremacy is technically the better thriller(for me). I've heard many people refer to this franchise as the 'Smart Bond' but I've never believed them until now. One small sequence in this movie(and a ridiculously clever way to intertwine Supremacy and Ultimatum) changed my entire outlook on this nickname and made me believe it. It is the thinking man's Bond. Not that I don't love Bond, it's just Mert Dermon is smarter than it. I defy anyone to tell me that the ending of this movie is not perfect. It is exhilarating, it ends on a cliffhanger but also complete finish, it's smart, it's engaging; it's the perfect way to end this trilogy.\n\nMert Dermon is spectacular in his role as Jason Bourne. The arc he experiences over the course of the trilogy is brilliant character development and Damon sells every single scene of it. It is probably his best performance, purely because of what he managed to do to the character.\n\nDavid Strathairn was great as Noah Vosen and provided a great mental foil for Bond. On the subject of Vosen, the villains in this movie are by far the best out of any Bourne film. They are smart, interesting and most importantly have a purpose. As much as I enjoyed Supremacy, Yuri Gretkov had little to no relation to Bourne and that made his character so much weaker. The villains in this movie, however, make sense and that instantly gives them an edge over the 'competition'.\n\nJulia Stiles plays a much larger role in this movie than the previous one and does it very well. She is filling in for Marie Kreutz and I actually prefer her to Kreutz. I also love how they don't try to force some love story between the her and Bourne. This is the maturity and evolution we need in film. Not every woman should be treated as merely a sex object or as a relationship starter for the masculine lead character. They can be interesting without the need for forced romance. Take notes Hollywood, take notes.\n\nJoan Allen plays a much smaller role in this movie for me but I still admired her performance just as much as in Supremacy. She holds her own against other character and provides a useful ally for Bourne.\n\nI have said it once, I've said it twice, I'll say it again; Paul Greengrass is the only man alive who should be allowed to use hand held camera. He uses it to add realism to the sequences and make them arguably more intense. He doesn't use it to obscure an actor's face and their movements so we can paint a picture of what is happening in our minds. It's truly admirable that he is the only living human that can do something that should be so simple.\n\nLeading on from the action, this movie is full of it. Two sequences stick out for me and both are excellent. The police chase sequence is probably one of the best action set pieces of the 2000s, and I don't say that lightly. Greengrass' use of hand held cam(I refuse to refer to it as shaky cam in this instance) helps sell the realism and urgency of the action. It doesn't feel well rehearsed(even though it is) and that makes it seem so much more grounded and real. Greengrass cleaned up his act with action and hand held cam and perfected the craft of it since Supremacy. Very, very impressive. Very enjoyable to behold.\n\nI love the score of this movie. It is utterly fantastic and spectacular and I adore it.\n\nMy main and only issue with this movie was that I never felt Bourne was in any immediate danger. I never doubted he'd escape or survive. They basically make him a god and that made the film lose stakes. Not that it takes away from the action, when the action gets going; you don't pay attention to this, but if you take a step back, you realise that there was 0% chance he'd lose any fight. I know that losing would be out of character but I would prefer to see some sort of weakness that he had to overcome.\n\nIn conclusion, Ultimatum is a very enjoyable and widely accessible action/thriller. I don't think seeing the first two films is required to like this movie but it is recommended. I definitely recommend you watch Ultimatum, and specifically recommend you watch the trilogy back-to-back. I'll rate The Bourne Ultimatum 9 'COME ALONEs' out of 10. Please see it; it is awesome!",
            "review_date": "2017-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the best of the series, great action and great story. There are also new actors who are brought on that are very intriguing, you really care about the characters. There is also great tension. Definitely rewatchable!",
            "review_date": "2017-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Best Jason Bourne's Movie",
            "review_date": "2017-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my favourite movie in the Bourne series. This movie is a non-stop thrill. It has an excellent plot and Paul Greengrass pulls of the shaky cam wonderfully and once again Matt Damon is excellent as Jason Bourne.\n\n9.6/10",
            "review_date": "2017-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful conclusion to the Bourne Trilogy!",
            "review_date": "2017-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Concluding the trilogy with aplomb, The Bourne Ultimatum wraps up Bourne's arch nicely with more great action and a generally tight script.",
            "review_date": "2017-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best Bourne film to date, The Bourne Ultimatum is a smartly written (who could forget that scene where Bourne guides the English reporter dude Ross through the train station in Waterloo?) film that once again shows that Matt Damon is still a good action star. While the shaky camera kinda put me off back in Supremacy, this time around it works perfectly as I pretty much embraced it. The action sequences are every bit as thrilling as you might expect with my favourite action scene being when he fights against the \"asset\" -what's his name again? Oh right, Desh - with Bourne doing some amazing rooftop jumping. Probably the most memorable scene in this film. An amazing way to conclude the original trilogy. *sarcasm* I can't wait to finally watch and review that Bourne movie with Hawkeye in it rather than skip it and go straight to the 2016 sequel to the trilogy, Jason Bourne for the sake of reviewing these films in a chronological order. Ain't this world we live in great?",
            "review_date": "2017-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Insane action and Jason Bourne taking care of business!",
            "review_date": "2017-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe the best movie in the Bourne series, the movie explores Bourne's past and reason why he is in this mess. Wonderful actions and fast paced movie. As usual the stunts looks quite real and thrilling.",
            "review_date": "2017-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The Bourne Ultimatum\" is another good addition to the Bourne collection - it still carries over the intense action (and adds more) from the first two movies in this franchise, and keeps a very good pace to keep it a very entertaining thriller action movie. Matt Damon (Jason Bourne) kills it again, this movie is more about his character than the other ones in my opinion, and as we are taken through the flashbacks to get a glimpse of what Jason Bourne used to be like, the stellar acting from Damon adds to the mystery and suspense as he slowly starts to remember things from his past, which I found to be really well done. The actions scenes are carried out very well, the chases were executed in a way that kept them exhilarating, and some of the things that Jason Bourne does in this movie is just so damn clever, and each line that he says once again seems like it was worked on for weeks by writers, they're that good. The only thing that made me like this movie less than the other two, however (yes, I know this is most people's favourite Bourne movie), was the sub-decent side characters. The only character besides Jason Bourne that I didn't mind was Joan Allen's character (Pamela Landy), where everyone else I felt was just put in just for the sake of having enemies/allies for Bourne to use throughout the movie. Although I probably wouldn't have cared much about the side characters anyways, the addition of Marie and others in the first two made me enjoy those more than this one. Nonetheless, \"The Bourne Ultimatum\" is a great time, filled with heavy and entertaining action sequences, and continues the hot streak of the Jason Bourne franchise, it is definitely worth the watch.",
            "review_date": "2017-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WHAT I LIKED: After proving itself with gritty on-the-ground action and espionage excitement, the Bourne franchise returns to impress by balancing the focus both on Bourne (as in the first installment), and on the corrupt CIA. The Bourne half is definitely where this one excels most though, as the character is finally given a little more drive in his arc, and thus more room for development. This makes the action all the more exciting too, particularly towards the brilliant final act where everything comes to a head very nicely indeed. On that note, 'Ultimatum' undoubtably contains the best action in the franchise so far, which is a very big achievement indeed.\nWHAT I DIDN'T LIKE: Unfortunately the espionage side that worked so well in the second installment is slightly less engaging here, and we instead resort to a slightly duller and drawn-out plot with far fewer interesting twists and turns - even it is great to see the lines between good and bad blur even further.\nVERDICT: This works because the Bourne-isms are upped and the focus is put back on Jason himself. Imbetween though, there's arguably less excitement than before.",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Has to be my favourite in the franchise, great performance, smart direction and intelligent decisions from Jason Bourne which mislead the CIA and Tread-stone. Learn so much more about Jason Bourne's past from brilliantly placed flashbacks. Great ending too!",
            "review_date": "2017-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great editing and creative action scenes, but the middle part is not as exciting as its ending and opening.",
            "review_date": "2017-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Taking a step above the previous installment, Ultimatum ends this trilogy with style.",
            "review_date": "2017-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Top Bourne movie so far.",
            "review_date": "2017-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good movie to watch",
            "review_date": "2017-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Bourne Ultimatum is a NON STOP action thriller masterpiece. The action is incredible(Bourne v Desh is the best), the script is clever and brilliant, and the plot feels like it can turn at any moment from an average action movie. There isn't a single moment in this movie that feels out of place. Arguably one of the best 3rd installments and in my top 5 action movies of all time, you don't even need Identity or Supremacy for this movie. Those movies are like setups. I'd definitely recommend this fast paced thriller.",
            "review_date": "2017-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A worthy ending to an amazing action trilogy",
            "review_date": "2016-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "love these films so hard for me to watch shaky cam please stop using this techniques was sick after the first 45 mins of this film had to leave cinema",
            "review_date": "2016-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More clever, more intense, more high quality shots, and just a bit too much cheese in the melodrama department. The story holds together, however, and by the end of Bourne 3 the fate of the main character remains relevant.",
            "review_date": "2016-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A highly trained assassin with traumatically programed amnesia is hot on the trail of his invisible trainers operators to shut down the source of his tortured conscience.",
            "review_date": "2016-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For once, a superb end to a film trilogy",
            "review_date": "2016-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one was awesome!! Excellent action, decent story, and the great performances synonymous to the series.",
            "review_date": "2016-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Bourne Ultimatum is non stop action film that delivers fans lots of thrills. Another great performance from Matt Damon and great camera work from Paul Greengrass makes this the best bourne movie of the franchise.",
            "review_date": "2016-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps the most thrilling of the trilogy, The Bourne Ultimatum continues to entertain with the intriguing story of Jason Bourne.\nMatt Damon confirms (does he have to?) his appropriateness for the role, while Paul Greengrass' direction changes from the first two chapters and it's not exactly a change for the good.",
            "review_date": "2016-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good thriller ups the ante for the franchise",
            "review_date": "2016-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The the third of the \"Bourne\" is a terrific action thriller that has an intelligent script and superb casting. I always enjoy Scott Glenn and Joan Allen as actors and wish they appeared in more films. Here, they a perfectly matched as the scheming CIA chief and principled agent. Matt Damon continues show his worth as the leading man, giving Jason Bourne an integrity that many action movie actors cannot manage. Paul Greengrass keeps the action tight and thrilling making this a real edge-of-your-seat drama. So far, these have proved to be intelligent and really modern thrillers that have much to recommend them and , frankly, leave others in this genre quite far behind.",
            "review_date": "2016-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic Action Thriller film!",
            "review_date": "2016-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps the most thrilling of the trilogy, The Bourne Ultimatum continues to intrigue with the story of Jason Bourne.\nMatt Damon confirms (does he have to?) his appropriateness for the role, while Paul Greengrass' direction changes from the first two chapters and leaves me perplexed.",
            "review_date": "2016-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The final movie of the Bourne trilogy, The Bourne Ultimatum combines fast-paced, solidly-crafted action sequences with fleshed out characters, and an excellent, exciting story. Matt Damon thrills, Paul Greengrass stuns behind the camera and the entire movie just works... Not only as the best in the series, but also as arguably the strongest of the decade, par Casino Royale; nothing more to be said.\nVerdict: A+",
            "review_date": "2016-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Without a doubt, 'The Bourne Ultimatum' is the finest entry the Bourne Trilogy, not just for it's grand scale, non-stop thrilling action, inciting and compelling plotting or the handling of the character. Ultimatum touches upon the character's ethics, how does he embrace a life free of being a pawn or a killer? can he ever go back to being that way? The conflict doesn't just lie with him wanting the know the answers, but for the people also once connected to him as well as those reluctantly helping him or going after him at almost every turn. In a way this is the biggest character motivation for the character, even while the past still haunts him, the CIA is hot on his trails and will hardly stop at anything in their sights or tracks. Luckily enough, Bourne's skills and abilities really do pay off, as he's able to pull off daring tactics avoiding authorities at every move as well as running and facing danger when necessary. The action more than makes up for a non-stop thrill ride that keep viewers at the edge of their seats with the sharp use of Paul Greengrass's handheld camera use puts us right up close to the action. The character's performances are also incredibly well done, really paying off what this series has to offer. Last but not least, the plotting is so incredibly sharp and quick witted, it really does require viewers knowledge of previous films in order to grasp the journey the character has faced as an ultimate assassin on the run from authority.",
            "review_date": "2016-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie in the series. Great action, a great story, great acting, great characters. I just love this movie.",
            "review_date": "2016-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Bourne Ultimatum is a thrilling action movie with great acting and incredible fight scenes, Ultimatum is still the best in the franchise and will go down in history as one of the best action thrillers ever made",
            "review_date": "2016-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best action films i've seen in a while and is really engaging. The action was well done, the story has interesting set pieces and fast paced plot. My only problem is that the camerawork has a few issues, especially during the action scenes. Besides that its great and the best Bourne film i've seen (which probably isn't saying much since i've only seen two of them.)\n\n83/100",
            "review_date": "2016-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "O my god. This movie was epic. I was into the movie from begin until the end. Matt Damon was geat as Jason Bourne and everybody else was also very good in their role. The story was very fast-pase, so it was never boring. And the action, ohhh the action was so very good. Just one big thrill-ride",
            "review_date": "2016-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a way to end a troligy but leave an opertunity for another movie",
            "review_date": "2016-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very thrilling and still going strong.",
            "review_date": "2016-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very entertaining although the plot did not seem too deep. My favorite parts are the dialoges actions and surprises towards the very end",
            "review_date": "2016-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To some, shaky-cam has become synonymous with low quality. But not the way Paul Greengrass does is. The director doesn't just do shaky-cam--he masters it. Every single movement is perfected and deliberate so that during fight scenes, we still know exactly what's happening all while getting the feeling that we're involved.\n\nThe pacing is pretty much perfect in the third installment of the spy-thriller series. We pick up weeks after the events of its predecessor, and Jason Bourne (Matt Damon) is still trying to figure out his forgotten past. The secret CIA program which was once called Operation Treadstone is essentially the same, except operating under the name of Blackbriar.\n\nDipping and dodging different assassins, Bourne is one step closer to finding out how he became an important piece in all this. But this time, there's more desperation. More urgency. He knows he could be dead at any moment and possibly should have been dead already. But he's not and he doesn't know how much longer he can cheat death. We feel it too. We want him to find everything out before he gets killed.\n\nIt's this energy that runs all through The Bourne Ultimatum that keeps you on the edge of your seat the entire time.\n\nBourne's character depth doesn't really progress anywhere from the last film, but we don't really feel like it needs to. He doesn't say much, but we can read his thoughts much of the time.\n\nIn the end, we're relieved, but not necessarily satisfied. There is still more to be found out. Although in the moment, we aren't aware that there will be more sequels to come. We just hope that there are.\n\nTwizard Rating: 95",
            "review_date": "2016-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The Bourne Ultimatum\" might be my favorite Bourne film and it ends the original trilogy on an extremely high note. It has everything you love about these Bourne movies, including phenomenal action sequences, an outstanding cast, Matt Damon's fantastic performance, and the conclusion of a great mystery thriller that has been building up throughout these movies. It's a must-see for fans of action thrillers, Bourne movies, and mysteries.",
            "review_date": "2016-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfect end to the trilogy. The scene at Waterloo Station is quality and the chase through Tangier is breathtaking.",
            "review_date": "2016-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jason Bourne now remembers everything!",
            "review_date": "2016-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "non stop action greatness",
            "review_date": "2016-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If the first film had way too much \"down-time\", this entry has almost none of it. This film fires on all cylinders about 85% of the movie. One giant chase to find Jason Bourne. Again, it is so cool seeing how Jason Bourne can out smart the CIA with all his unorthodox tactics. The action scenes are bigger and the intensity is as high as its ever been. The only gripe I can say about it is that there is a chase scene that happens in the middle of this film that basically ushered in the \"shaky-cam\" era of action films. I'm not the biggest fan of it. During the fist-fights (which are amazing by the way), it works for the most part, the chase which led up to it... not so much. The final car chanse though is one that feels super heavy and gritty and it feels like it hurts. That probably was a bad way of explaining it but just watch this film to see what I'm talking about. In fact, watch the whole series. It's a good one!",
            "review_date": "2016-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best spy/action movie of all-time without a doubt.",
            "review_date": "2016-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best of the original trilogy",
            "review_date": "2016-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Bourne Ultimatum is a fantastic thrill ride and easy one of the best action movies of all time!",
            "review_date": "2016-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The penultimate Ultimatum. Widely regarded as the best, a sentiment which I echo for the final installment in the trilogy. It improves upon every trope from the previous installments including the car chases and the shaky camera. I actually remember being too close in the theater in 2007 and getting a little sick from it. This 'Final chapter' closes with him finding out what brought him into the shady CIA agency while Jason out smarts everyone with their eyes fixed on computer screens pursuing him. It ends on a note that lets us know he is still alive and ready for the 2016 sequel.",
            "review_date": "2016-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite simply, a perfect action film. There are only a few in American cinema, but Paul Greengrass made one. This movie moves at a breakneck pace, and you don't mind one bit, because Greengrass has earned every ounce of our attention and respect.",
            "review_date": "2016-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5 stars out of 5, 95%",
            "review_date": "2016-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as Identity or supremacy",
            "review_date": "2016-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5/5.  Easily the best Bourne film.  The action and thrills and non-stop.  This is how you make a spy action thriller.",
            "review_date": "2016-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This franchise continues to impress me. All of the staples of the series are included, but with a story that delves even deeper into the psyche of Jason Bourne,\nFull review here: https://www.youtube.com/watch?v=-wUnlyMGOXA",
            "review_date": "2016-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The last and best of the Bourne series where professional stunt driver, car race enthusiast, computer technician, daredevil, marksman, professional amnesiac and thoroughly hard bastard Matt Damon goes on a rampage across various parts of the world, in order to get his memory back.\nThe stunts and camerawork are fantastic, the plot is fast but understandable and the action relentless.\nA great film..",
            "review_date": "2016-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All three of the original films work extremely well as one cohesive watch, as I've found out after watching them back to back to back, but 'Ultimatum' is the biggest and most explosive of the series.\n\nPaul Greengrass returned to direct the conclusion of the originally planned trilogy, as does Matt Damon in the title role.  Greengrass added a much more human aspect to Bourne in 'Supremacy' all while adding just the right amount of action.  I feel like there was a bit more of an imbalance in 'Ultimatum'.  Certainly, the car chases and the breathtaking rooftop chase are great, but there are a few too many leaps of faith the audience has to take in terms of logic.  Especially considering how grounded the first two films are.\n\nEven with the logic issues, The Bourne Ultimatum may be the most entertaining and heart stopping film of the entire series, with one thrilling scene after another.  The aforementioned rooftop sequence in Tangier is one thing, but one of the opening scenes takes place in a London terminal, and it may be my favorite scene of the film altogether.  It's usually not the high octane chases or visceral gun battles that get me, but the scenes in which Bourne is using his slick wit and experience to one-up those against him.\n\nAmong the cast returning is Joan Allen as Pamela Landy.  Although you can make the case her story ended with Bourne in 'Supremacy', the direction they take her arc in helping Bourne tear through his past made sense here.  Opposing Landy is Deputy Director Noah Vosen, played by David Straithairn.  Straithairn is very good at playing characters that get under your skin with frustrating decisions and Vosen is exactly that.  So although I preferred Chris Cooper and Brian Cox in those roles, Straithairn is a solid counterpart to Damon.  It's all the more impressive considering the very little screen time, if any, that the antagonists end up having with Bourne.\n\nThough it is now 2016 and there's a new Jason Bourne film coming out, watching The Bourne Ultimatum made me realize that there really never needed to be another entry in the series.  The film comes full circle and Bourne's search for answers got to the point I hoped for.  The end really feels like the end, so I sure hope the new film reinvents itself and doesn't retread the same story beats because Ultimatum certainly does.\n\n'Ultimatum' has its detractors and I can see a few of the complaints being warranted, but there's no denying the epic scope and thrill ride the film takes you on.  It's the most cinematic of the bunch and the characters don't really take a backseat to action.  I only hope there aren't as many leaps of logic next time around.\n\n+Scope\n\n+Rooftop and terminal sequence\n\n+Feels like the end\n\n+Landy & Bourne\n\n-Leaps of faith in logic\n\n9.3/10",
            "review_date": "2016-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boom best Bourne movie to be released",
            "review_date": "2016-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An masterpiece in the every sense of the word.",
            "review_date": "2016-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An action masterpiece. What the previous two films never were in the greatest possible sense, and what a great directing by Paul Greengrass who gives us his all with some of the most masterfully staged action sequences I have ver seen.",
            "review_date": "2016-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best of the original Bourne trilogy. A pure, energetic blast from start to finish.",
            "review_date": "2016-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Here comes an end to the trilogy of Bourne franchise which is a well made thriller, with a lot of action and a great performance by Matt Damon making this the best movie of the franchise.",
            "review_date": "2016-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I feel that we have gotten more towards the far-fetched/over the top type of film that seems to be attached to the late 2000's. A well done film nevertheless.",
            "review_date": "2016-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably one of the best ones in the Bourne series",
            "review_date": "2016-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'The Bourne Ultimatum' marks the conclusion of the epic Bourne Trilogy introduced by Doug Liman in 2002, elevated by Paul Greengrass in 2004, and perfected by Greengrass in 2007. This movie has everything you can want from a Bourne film and executed all of it amazingly. It has fantastic action, amazing performances, great drama, and at the same time it ties up any loose ends introduced in earlier films and also provides some more revelations about the origins of the man known as Jason Bourne. This movie has a lot going on and as a result the movie moves at a very very fast pace providing us with scene after scene after scene of thrilling action set pieces including hand to hand fights, foot chases, and crazy car chases. All of these scenes are backed up by great performances from all the main cast including the riveting performance by Matt Damon as Jason Bourne, Joan Allen's great performance as Pamela Landy, and David Strathairn's captivating performance as the newly introduced Noah Vosen. \n\n\n\nJust when you thought the action set pieces in a Bourne film could not get any more intense and exciting, 'Ultimatum' comes along to show how it's really done. You have a lot of the shaky-cam, close quarters action you saw introduced in 'Supremacy' which is just as awesome and just as entertaining as before. This film also does a fantastic job with its multiple chase sequences as they keep you on the edge of your seat the whole time wondering how on earth Bourne is going to get himself out of every situation. The great thing about the action in this film especially, is that each set piece is connected in a way that it is hard to outright distinguish when each fight or chase ends and another begins because of how fast this film moves along. So you don't get moments to chill and take in the last awesome sequence because by the time you take your second breath Bourne is reversing a car off the top of a multi level carpark. It is done in a way where despite it being almost continuous action, it never feels like too much and every scene is just as exciting as the last. \n\n\n\nThe performances in this film as i mentioned are what really add to the intensity and thrilling or dramatic aspects of every scene and the determination by the actors to deliver real characters allows you to connect to the characters. Matt Damon is phenomenal once again as Jason Bourne and i believe after seeing this film was the moment everyone switched to thinking of Jason Bourne first over Matt Damon. He embodies the character so well that you no longer see Matt Damon, he has been completely consumed by Jason Bourne. The way he commands every scene and always looks like the one in control adds so much to where his character is during this film. David Strathairn was a fantastic addition to the franchise as the way he went toe to to with Bourne's character on an intellectual level made for plenty of very exhilarating and entertaining cat and mouse sequences always leaving you with one question... Who is the mouse? Returning characters such as Pamela Landy and Julia Siles' Nicky Parsons are developed further in this film in ways that add a lot more personality and moral clarity to these characters who played relatively straightforward characters previously. \n\n\nBeing the final film in the franchise it had that job of wrapping up the entire story in a way that did a service to every character and the fans of the franchise. And i gotta say, the way the story unfolds in this film was crucial to providing a fitting end (for now) for the Jason Bourne character. The way it incorporates the use of flashbacks is genius, because rather than just having random flashbacks to explain the beginnings of Jason Bourne here and there, the film ties each one together with the current events in the film. The way it closes everything off once again acts as a fitting conclusion to the trilogy and the character Jason Bourne whose development has progressed over all three films. So now that we're done with revisiting the original Bourne Trilogy we only have to wait 5 more days for the release of 'Jason Bourne', the return of master assassin...\n\n9.1/10",
            "review_date": "2016-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely the best of the trilogy. It's a solid combination of stealth, suspence and action scenes. However my complain is the same as the other two. It's awfully predictable. It's missing any kind of twists. At most, there's the detail that he wanted to be recruited instead of them recruiting him, but that doesn't really change anything. For me it's a waste of a good oportunity; when you have a story where you're trying to connect the missing pieces, there's always space for a twist.",
            "review_date": "2016-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily the best of the series thanks to a more intriguing plot, faster pacing and more suspenseful sequences.",
            "review_date": "2016-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ultimatum another great sequal. That actullay was more thrilling, more great performance, and excellent script.",
            "review_date": "2016-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Bourne series has an awesome set up, which is why the filmmakers couldn't settle for just one movie. After all, wouldn't every man (or boy, at least) working in some boring office like to wake up from the soul-crushing, emasculating nightmare that is his life to find out he is secretly a bad-ass CIA assassin? The plot is just as absurd as the previous Bourne movies. The CIA is still trying to off Bourne because he could expose the agency for its shady activities and extrajudicial killings (to which the general public would presumably respond with, \"Well, duh!\") The movie is still exciting long after the plot wears thin (no, I really don't care that Jason Bourne's real name is David Webb). The long action sequences give the movie a breathless quality that heightens your excitement levels. Overall, it is a fitting conclusion to the Bourne series.",
            "review_date": "2016-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another solid entry in the series.  The shaky cam though, while I understand it's purpose, and it doesn't usually bother me at all, was a little distracting at times.  I find it amusing that Bourne finally squares off against Carlos the Jackal in this...lol",
            "review_date": "2016-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intense and the best Bourne film, The Bourne Ultimatum completes all the loose ends in the franchise with great action plus an incredible cast",
            "review_date": "2016-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Throughout cinematic history, it's common knowledge that, generally speaking, the third installment in a film trilogy is usually the low-point.  It's safe to say that The Bourne Ultimatum is a strong exception to that rule.  This chapter wastes no time in terms of pacing, as it throws viewers directly into the central plot and story from the very beginning.  Paul Greengrass's sharp direction, Matt Damon's confident lead, quick-cut editing and a lean script combine to make The Bourne Ultimatum almost on par with the 2002 original.",
            "review_date": "2016-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest action movies ever made, Paul Greengrass elevates this third installment in every single possible way.",
            "review_date": "2016-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best of this great franchise is an even more intense and fine acted film and is arguably the greatest spy movie of all time.",
            "review_date": "2016-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Discouraged by the first film, i skipped the second to watch the third. It was very good, actually great indeed. Set pieces throughout the film are spectacles and much more brilliantly made. Watching legendary Matt Damon jumping through windows was awesome and that follow up fistfight kept on the edge of my seat, worrying if any of the two protagonists would fall. It was just what I was expecting from this franchise. The plot/story has improved as well. We learnt more abt Bourne in the finale and there was stuff that's interesting to watch.\n\nJust a little scene I wanna talk abt. Remember the very end of the film where Bourne was abt jump over the roof when an agent pointed his gun at him point blank. Instead of shooting instantly he asked Bourne why didn't he shoot him earlier that day. Bourne followed up with some meaningful monologue. That was very brilliant. It should be made longer to bring a film into another lvl, like adding a memorable quote will do. Also I find it odd for Bourne to consider murdering a random agent who was injured and harmless after a car crash. I know it is meant to built up for the scene I am talking about but, it shouldn't have worked this way right? Anyways.\n\nGreat Jason Bourne stuff here",
            "review_date": "2016-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing when a series is just as good throughout",
            "review_date": "2016-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Any trilogy where The Bourne Supremacy isn't the best in it, must be damn good, and The Bourne Ultimatum is exactly that, damn good.\n\nThe Bourne Ultimatum is one of the greatest action movies ever made, alongside Die Hard, Mad Max II: The Road Warrior, and Mad Max: Fury Road no question about it.\n\nThe Bourne Ultimatum directed by Paul Greengrass, (Captain Phillips, Green Zone, The Bourne Supremacy, United 93) starring Matt Damon (Good Will Hunting, The Departed, Behind the Candelabra) is the highest point and third installment in the the Jason Bourne Trilogy.",
            "review_date": "2016-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "May 2016. really really actionpacked.",
            "review_date": "2016-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the best of the trilogy. With Matt Damon reprising his role as Bourne, along with non-stop thrills and intrigue, viewers are bound to have a great time.",
            "review_date": "2016-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie night with Iris. A trilogy that gets better with each one goes out on a high. Except of course now it hasn't.\n\nThe Waterloo station is as tense a 15 minutes as I've ever seen on screen. And it's all part of one of the truly great action films.",
            "review_date": "2016-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It tears through the action and suspense more effectively than the previous two films, but its predictable ending and lack of an emotional angle leave it alongside them, if a little under, in terms of overall quality.",
            "review_date": "2016-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had no idea handheld could look so good, and I'm not sure Matt Damon could have done any better. A+",
            "review_date": "2016-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Bourne trilogy goes out with a bang in this consistently moving action flick. Matt Damon delivers his best Jason Bourne performance yet as he continues to fight his inner demons while finding out the ugly truth about his life as a spy. The supporting cast, especially Strathairn and Stiles, really brings it this time around. As usual, the action and stunt work is superb. One factor that really elevated this movie above its predecessors is the shot editing. Greengrass understands how to create adrenaline through the camera, and nearly every scene feels like an adventure. All-in-all, one couldn't ask for a better way to end a franchise (for now).",
            "review_date": "2016-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "matt damon in his prime , good movie.",
            "review_date": "2016-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The third installment to the successful franchise builds up from the previous two in story add to that  the action and thriller that remain the staple of the franchise. Overall. The Bourne Ultimatum is a great film that showcase why the franchise is loved.",
            "review_date": "2016-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely the best of the original trilogy, with higher stakes, a more intriguing stroy and a great performance by Matt Damon.",
            "review_date": "2016-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Smart and relentless, \"The Bourne Ultimatum\"s sharp camera work and the strength of Matt Damon's calculating performance create the best entry in the trilogy, simultaneously qualifying as one of the best action thrillers to date.",
            "review_date": "2016-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All three movies are pretty much one large film so there is not too much to go wrong after the first two success.",
            "review_date": "2016-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worst of the trilogy.  Shaky camera effects over done, action sequences chaotic with no clear view.  It was like the director was trying to create something from his mind, failed, then yelled \"print\" instead of \"cut\". Great acting, story from a great book so a win there.",
            "review_date": "2016-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first decent instalment for the Bourne franchise. Ultimatum is better than its two predecessors in every way. Bourne is much more likeable and the other characters are more realistic and understandable as their motivations are much clearer. I still don't like the way Greengrass films the fight scenes though.",
            "review_date": "2016-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true action adventure film that never disappoints",
            "review_date": "2016-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shaky cam done right.",
            "review_date": "2015-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Bourne film of them all.",
            "review_date": "2015-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bourne Trilogy is the best series ever. Damon and Greengrass have taken thriller movies to an all new level through this series.",
            "review_date": "2015-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best one of the original trilogy it's non stop thrills and twists and amazing gripping story only gets better with every scene, Matt Damon was great again, Maybe in my opinion there could of been more action but that's just me but apart from that it's a very intelligent gripping film and should not be missed.",
            "review_date": "2015-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is amazing. Amazing action sequences, magnificently shot, well directed and you can always feel the tension and suspense throughout the film.",
            "review_date": "2015-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best action movie Ever",
            "review_date": "2015-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the finest, most memorable action movies I have watched in the past decade. It builds on the shaky-cam style of 'Supremacy' but delivers a more cohesive storyline. The Tangier set-piece is amazing,and Matt Damon is still terrific as Bourne; which I am glad to see there will be future Bourne \"chronicles\" even though this one offered a strong closure to a rock-solid trilogy!",
            "review_date": "2015-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good addition to Bourne franchise.  I don't like Julia stiles I think.",
            "review_date": "2015-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is just as good as the first one! Bourne is one of my favorite action movie characters. It's always fun observing his strategies, the way he plans for everything. Can't wait for the sequel that'll be coming out.",
            "review_date": "2015-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "DART YOU netflix for making me watch this for the who knows how mantyh time...i thought hey ill just put it on for a second cuz you know cant think of anything else for the moment and then of course....\nanyway its still ricoously watchable fast and spy thriller silliness intelligent.\n\nand watching Bourne Flix still makes me wanna work out just a little and hone my skills for messing people up cleanly, only those deserving of course.\n\ncuz im a secret super spy.",
            "review_date": "2015-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the better action trilogies ever and this movie is the best of the bunch.",
            "review_date": "2015-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If there's one thing to be said about the Jason Bourne films, it's that they are consistent.  They always provide excellent action sequences, a great performance from Matt Damon, and (unfortunately) a plot that doesn't live up to its potential.  This is true more than ever in Bourne's third outing, \"The Bourne Ultimatum\".\n\nLike \"The Bourne Supremacy\", \"The Bourne Ultimatum\" fails to capture the spark that \"The Bourne Identity\" had.  The action is what saves the movie.  \"The Bourne Ultimatum\" features some really kinetic action - some of the best of the franchise - especially a suspenseful scene at a London train station and an incredibly intense chase in Tangier.  However, while this action is spectacular, the plot is more aimless than ever; I spent half the movie wondering why Bourne was doing what he was doing?  On top of that, we FINALLY get the answers about Bourne's past that we've waited three whole films for, and the payoff is disappointing and predictable; it's something we've seen a million times before.\n\nAt this point, I think it's safe to say that if you've seen one Bourne film, you've seen them all.  Just like the previous entries, \"The Bourne Ultimatum\" is a decent action film, though hardly satisfying for those seeking an intricate plot.",
            "review_date": "2015-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Spy Action Movie of all Time!!!!",
            "review_date": "2015-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OK film made horrible with \"jerkycam\" effect",
            "review_date": "2015-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect Finale Trilogy",
            "review_date": "2015-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are plenty of thrills and spills in this spy thriller, the third in the Bourne series. 1001",
            "review_date": "2015-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now we're getting somewhere.\n\nPaul Greengrass has finally delivered a film with a more engaging plot, better action sequences, and finally an ending that actually delivers on the narrative he's been jerking around with for three movies.\n\nThis film finally starts to explore how Jason Bourne became to be. Although it makes heavy use of the 'sudden flashback' technique, the story is still well-done. The character has so much depth now, and his actions are finally starting to make sense.\n\nThe action is well-timed with the plot, even the Obligatory Car Chase Sequence. While the film still suffers from a lack of light moments, there is a better mix of tone here, and Matt Damon's acting elevates this.\n\nThe supporting cast are all solid. It's great to see Julia Stiles' character get a meatier role here, and Joan Allen does well also. David Strathairn played his part well, showing his uncompromising dedication.\n\nA welcome improvement over the previous two installments. They saved the best for last*\n\n*Yes, I am aware they made more after this.",
            "review_date": "2015-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best of the Matt Damon trilogy, The Bourne Ultimatum is a more than satisfying conclusion with great acting performances, strong directing, and a well written story.",
            "review_date": "2015-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A standard when it comes to action movies.",
            "review_date": "2015-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best of the series. Delivers on all fronts.",
            "review_date": "2015-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Paul Greengrass and Matt Damon working together is like a gift because the Bourne Ultimatum somehow improves from the first two even though they didn't need improvement. The best Bourne and now one of the greatest action films i have ever seen.",
            "review_date": "2015-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can see why this third instalment is rated higher than the previous 'Supremacy'. There's more action but if you ask me just more of the same old recycled Bourne antics just in a different city.",
            "review_date": "2015-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The action continues but the intrigue wanes",
            "review_date": "2015-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "after seeing mission impossible fallout i thought i had seen everything the spy genre had to offer, boy was i wrong. while not as good as fallout (my favorite film of this year 2018) the Bourne Ultimatum is great in a different way. Matt Damon is one of my favorite actors and he was born to play bourne (god that was stupid). the action is nonstop and the acting is great the only reason i think MI: Fallout is better is because of the great stunts Tom Cruise is capable of at the age of 56 but who could forget opening of ultimatum?",
            "review_date": "2015-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is how you close a trilogy, with a sharp plotter that does not abuses of well know clichés of the genre and maintaining all of the elements that made the prequels a success.",
            "review_date": "2015-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I still like the first one better, but The Bourne Ultimatum is a very thrilling, well made action movie with a great performance by Matt Damon.",
            "review_date": "2015-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The combination of professional actors, a good director and an incredibly brilliant story creates a true masterpiece. \"The Bourne Ultimatum (2007)\" is the best movie of the Bourne trilogy and can certainly be certified fresh.\n\nPaul Greengrass was able to fill simple scenes with unlimited suspense. Even with the \"shaky camera\", the fight scenes remained realistic and didn't look choreographed. The film also has a beautiful ending.\n\nWhether it's with a pen or a book, Jason Bourne can easily kick your ass. Whether he's in an airport or a metro, you'll never find him. He's one of the most skilled super-agents of cinematographic history.\n\nMatt Damon, Julia Stiles, Joan Allen and David Strathairn were all absolutely incredible in this motion picture. You'll keep your eyes on the screen the whole time! It's a thrill ride that deserves a sincere standing ovation.",
            "review_date": "2015-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Bourne film by far, fantastic pacing and direction, intense thrills and scenes, and a wonderfully shot fight scene between the legendary Bourne and the brutal Desh. It might have even been the most well shot fight scene in film history. The acting was incredible as well. This is a must watch, for Bourne fans or not.",
            "review_date": "2015-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This series was great!! I really like how they closed this chapter. They didn't try to hook Bourne up with any other woman, which is good, keeping the plot focused on much more realism than romanticism. This movie had the best fight scene of all three, which is tough to say, because they all had great fight scenes.",
            "review_date": "2015-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Matt Damon is still great a Jason Bourne, still directed very well, and the fighting is awesome",
            "review_date": "2015-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Matt Damon is Jason borne",
            "review_date": "2015-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Bourne Ultimatum is one of the best action movies ever. Matt Damon continues to impress as Bourne. The stunt work and choreography is stunning, there are so many memorable fight scenes. There are also chase scenes by foot or car, providing a variety of top notch action. Paul Greengrass has really improved this series, as his direction is spot on for the tone of the film. The story is also well paced and intriguing. The final moments give us more depth on the title character, and provide for a memorable final sequence. It doesn't have the most unique story, but this is by far the best of the series, an entertaining ride from start to finish. The Bourne Ultimatum gets 4.5/5 stars (A).",
            "review_date": "2015-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great action flick. Great sound editing. Great bang bang movie to entertain anyone. Great!",
            "review_date": "2015-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Bourne Ultimatum is an action thriller movie directed by Paul Greengrass. The movie shows a great action but on seeing the movie carefully you will observe that the start was great but at the end of the movie was not that satisfying. So Ya it's a timepass movie with a coupe or kissing scene but no nudity.I don't know why imdb has given 8.1 to this movie. The movie is not having a great suspense so that's why my review is 2.5 out of 5",
            "review_date": "2015-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's difficult to judge which is the best of the original Bourne movies, but the action and added emotional weight to this one make it a serious contender. Full review later.",
            "review_date": "2015-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The Bourne Ultimatum\" is the best film in the Bourne series where its intensely engaging throughout thanks to its intelligent story, its briskly paced and sharply shot action sequences, and the strong performances from the cast.",
            "review_date": "2015-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite of the Bourne installments.",
            "review_date": "2015-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is clearly one of the best action films ever made, it's a non-stop thrill ride, Matt Damon delivers once again a great performance, Paul Greengrass made the finest film in the trilogy",
            "review_date": "2015-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The end to the trilogy and finally answers to who is Jason Bourne.  Wow, what a series of movies, seen them all several times.",
            "review_date": "2015-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best of the trilogy.",
            "review_date": "2014-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1,2, and 3 complete the perfect trilogy. Well done.",
            "review_date": "2014-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie collection - lived up to the books",
            "review_date": "2014-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good. 8.3/10. B+. Worth seeing at the theater.\n\n\nThe Bourne Ultimatum is an eccentric, exhilarating experience with great direction and writing.",
            "review_date": "2014-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The last episode of Jason Bourne's trilogy is a wonderful conclusion of one of the best film series ever, it's really smart , full of twists and appassionating thriller.",
            "review_date": "2014-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect movie to end a great trilogy. Amazing Matt Damon's performances with a clever and original story, with a good plot and organized screenplay.",
            "review_date": "2014-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect movie to end a great trilogy. Amazing Matt Damon's performances with a clever and original story, with a good plot and organized screenplay.",
            "review_date": "2014-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect movie to end a great trilogy. Amazing Matt Damon's performances with a clever and original story, with a good plot and organized screenplay.",
            "review_date": "2014-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's been a long time since I've seen the first two. but there's not much you need to know if Jason's shooting at people.",
            "review_date": "2014-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent! There's some really gripping stuff in here.",
            "review_date": "2014-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An intense third entry knockout! Greengrass crafts an amazing visual style that raw and realistic. Damon makes sure his character comes full circle.",
            "review_date": "2014-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Would be higher, but when adjusting for the 'Matt Damon Curve', slightly above average.",
            "review_date": "2014-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A thrilling, intelligent spy film, showcasing the Greengrass/Damon partnership at its best. The Bond films could learn so much from this franchise.",
            "review_date": "2014-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excellent movie. Matt Damon is great and so is pretty much everything else.",
            "review_date": "2014-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "83%\nUnlike the other films in the series, The Bourne Ultimatum has an entirely forgettable plot and at that field it's a disappointment. Julia Stiles, her part in the movie and her kind of relationship was totally unnecessary for the movie. Matt Damon still continues to be good, but during the stunt scenes, it's clearly identifiable that he does not do any of it because of the poor editing and bad choice of doubles. However, the first half, especially the opening half an hour of the movie is really awesome. But the film's second half seems to run around purposefully on cliches that are adopted from the second film, especially the car chase scenes towards the climax. Joan Allen seems to be a relief in the middle of all this.",
            "review_date": "2014-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Polished and fast-paced, but not quite as coherent or original as its predecessors",
            "review_date": "2014-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very worthy third installment to the Bourne franchise.",
            "review_date": "2014-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "excellent, the best bourne",
            "review_date": "2014-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ultimatum is the undeniable king of all the films for being smart, fast, intense, thrilling, high-octane, and wild. It's arguably the best action thriller of all time.",
            "review_date": "2014-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thrill ride, well produced..loved it",
            "review_date": "2014-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Are you freaking kidding me? This is the end of The Bourne trilogy? Seriously? Come on, that was awesome and I'm hungry for more Bourne action. That is why this film is so perfect. I mean every single scene where Bourne is on that spot. He is so amazing to watch. Not your typical spy soldier as he is very clever and physically intense in every way. The story evolves around when he found out that his real name is David Webb and trying to connect the dots where he was belong. Secret service operations still look like dumb as they are trying to put down Jason Bourne every single time. Jason Bourne to me is like the Batman of spy action films. And Bourne Ultimatum is like The Dark Knight of the whole Bourne series. It was that good. Shaky cam shots, and with awesome chasing scenes. The action in its authenticity is just perfect and pretty intense. The most intense in the series as it ended very well with a statement. Should we see Bourne again in the future? Quite possibly yes. Should I care for another Bourne installment? I don't think so as this is the last Robert Ludlum novel in the Bourne series, which is very notable from the past years. Amazing action and definitely one of the best Action Spy films I've ever seen. Perfect 5. A must watch Blu-Ray.",
            "review_date": "2014-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant. This is much better than Supremacy with a clear story, a lead actor who is still amazing, great action while also still being able to round off all of the plot lines from the last movies. Well done, Greengrass. You made one good film.",
            "review_date": "2014-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A rare moment where the third film is the best in the franchise, The Bourne Ultimatum is just as smart and fun as its predecessors but very sharp camerawork and direction by Paul Greengrass, strong character development, and overflowing with action and thrills makes this a gem in the action thriller genre!",
            "review_date": "2014-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't have a whole lot to say about this film that hasn't already been said in my reviews of the first 2 films. Almost everything I said about Supremacy holds true for Ultimatum. The shaky camera work is so frustrating I just can't stand most of the action scenes or even some of the scenes where a character is merely walking and we have to bounce up and down like we're on board a boat. There are moments where the action holds up and things aren't too chaotic, and I quite enjoy them, but they seem rare. I also still have issues with Matt Damon in the lead role. He is very flat and uninteresting, and I just find myself mentally ticking off a list of actors that would be better in the lead role. The one redeeming factor in this film is that the plot is much stronger than it was in Supremacy. I still feel Identity is the best story, but this one ties up a lot of loose ends and even makes connections to both the previous films. I particularly enjoy those moments when Bourne is out-smarting the CIA bigwigs. Also the final confrontation on the roof is simply amazing and I love the direct reference to Identity. I do wish that Julia Stiles could have stuck around for longer. While I don't need a romantic relationship in this style of action film, I still enjoyed her character and the interactions she had with Bourne. Despite the things I did like in the plot of this movie it wasn't quite enough to overcome the annoying queasy cam. In the future I'll probably only watch the first movie of the trilogy and leave these sequels for others with stronger stomachs.",
            "review_date": "2014-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know if any movie for the rest of my life will be able to grab my attention as much as the last 5 minutes of this series did. Expertly crafted.",
            "review_date": "2014-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best of the series, really enjoy it. The rooftop scene is tedious though.",
            "review_date": "2014-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome third movie in the trilogy. I know that theirs going to be a 4th movie, I jUst know. Bourne is back and still has revenge from the Second Movie, all because of Marie, still can't believe she died. I Loved the third book, not as good as the second but pretty amazing. Great action scenes and a fantastic script. And finally the Epic conclusion of the three movies our three books but it's better in movie form of what Bourne is our was before he lost his memory and who started this all and don't forget his real name, it's ok I like Jason Bourne better. I also can't believe he died Bourne, ha joking, thought he died in the water but didn't. Love the ending Noah and the man who started this all are arrested. And Ethiopia doesn't live the ending credits music.",
            "review_date": "2014-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A terrific end to a phenomenal trilogy this is a well acted beautifully shot seriously entertaining, and well thought out crime thriller. I seriously enjoyed this movie this is a phenomenal film.\nGrade A",
            "review_date": "2014-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best of the trilogy and one of the best action movies ever made",
            "review_date": "2014-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As far as it gets from Ludlum's trilogy (hell, Bourne should be in his 60s in Ultimatum). Poor story with horrible shaky-cam all over it. Skip.",
            "review_date": "2014-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the more abrupt endings I've seen--but nevertheless, this is the rare threequel that actually works just as well as its predecessors.",
            "review_date": "2014-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As far as action/crime thriller goes it just doesn't get any better.",
            "review_date": "2014-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great instalment into the Bourne franchise but I'm afraid my heart still lies with Bourne Supremacy.",
            "review_date": "2014-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Greatest Bourne film ever! So much action, suspense and even comedy. Recommend this to all people!",
            "review_date": "2014-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What is there to say except the world is right. Everyone knows Bourne Ultimatum is a masterpiece, and I'm exactly just like the world in agreeing. I would like to say that when watching/theater, it wasn't the masterpiece but just really really good as getting older realize that it was really a much better movie that I originally thought (and thought wrong). Thankfully it is a masterpiece, even underappreciated by me originally, will watch again to see if it is a perfect movie. All I can say is WOW, because not realizing that this movie is a masterpiece has got to be the most offensive thing one can do in 2008. But times change and thankfully I realize that now. Because really, how lazy and spoiled can a person be???? It's unreal. I just can't believe it. Scary. I've lost my mind. BUT not respecting an epic movie like this is so wrong and not realizing how much work was put in to entertain me, is unreal because it was the perfect movie and a lot better than steak and potato dinner so as much as I want to give this a 8/10, It gets a 10/10 because it's flawless and the perfect movie, full or heart action zip and wonderful cinematography, with some killer scenes and some stunning chases and some great violence and passion and smart direction, so it's more a 9.5/10 than a 9. 10/10 for me underappreciating it over many years.",
            "review_date": "2014-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OH BOY! Aren't I just nice and rested after this thrilling finale!",
            "review_date": "2014-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The viewers not only get to see who Bourne really is, but also how well his movies can be.",
            "review_date": "2014-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Bourne yet!",
            "review_date": "2014-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the all time classics in my opinion.  The pacing of the movie provides it a rhythm you rarely see in cinema.  A 100% engaging film that has little room for improvement.",
            "review_date": "2014-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jason Bourne's final hour is also his finest. Not too many threequals can say they stand head and shoulders above the rest of the movies within their trilogy. This is definitely one of those cases.",
            "review_date": "2014-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Bourne Ultimatum is an action-thriller that lives on as probably the best in the series",
            "review_date": "2014-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, it wasn't as emotionally gripping as the previous movies but the plot and action scenes were really well planned out followed by some terrific acting.",
            "review_date": "2014-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really Really Really good, from start to finish! A great movie.",
            "review_date": "2014-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best one of the trilogy. Very intense.",
            "review_date": "2014-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, this was incredible.",
            "review_date": "2014-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nail-biting conclusion to a brilliant, thriving trilogy.",
            "review_date": "2014-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best one in the series! Good ending and good cinematography except when it came to fight scenes. I loved the story and well everything about it.",
            "review_date": "2014-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good closure to an epic trilogy.",
            "review_date": "2014-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely my favorite in the Bourne series, a very well written heart pounding action movie that will keep you on the edge of your seat...",
            "review_date": "2014-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A smart and thrilling action flick that delivers another great work from Matt Damon.",
            "review_date": "2014-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good, but some of the suspension of disbelief was a bit too much for me to go along with in this one, like telling the main antagonist that you're in his office when you're trying to elude him, like finding a safe code by simply looking through Â´the windowÂ´ of a top secret building, like evading capture by jumping through Â´the windowÂ´ of a top secret interrogation room.",
            "review_date": "2014-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't think I'll have any strong opinions on the Bourne trilogy as a whole, but I can say for certain that this is the best film in the trilogy, simply because the plot finally makes sense. The characters still aren't that interesting, but they get much better by the end of the film, and the story isn't too bad anyway. While this is all well and good, the film's style is still pretty much a cliché of modern thriller films, though it doesn't seem to irk me as much. I don't like this movie per se, but I still think it's watchable, and a little better than the rest of the trilogy.",
            "review_date": "2014-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Matt Damon at his best my opinion this is the best Bourne film",
            "review_date": "2014-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "God dammit shaky cam!!!!! that makes half a star less!",
            "review_date": "2014-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great plot and plenty of action make this a thrilling and exciting end to the Bourne trilogy.",
            "review_date": "2014-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stylish, sharp and impeccably choreographed, Greengrass reinvents the wheel with Camerawork and supersedes the first installment.",
            "review_date": "2014-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For someone who didn't actually see the Supremacy yet, it was a bit disjointed, but I figured it all out in the end - and loved the crap out of it.",
            "review_date": "2014-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the fastest and most involving action movies I've ever seen. The Bourne Ultimatum sees director Paul Greengrass at his best as well as Matt Damon giving his best performance as the title character Jason Bourne. In Ultimatum, Bourne attempts to unravel his past whilst fleeing the very people who hired him. That's the main point of the plot but the best part involves newspaper columnist Simon Ross, played by Paddy Considine, who is looking into Treadstone and because of that he draws attention from the wrong people, Bourne sets out to protect him and gain information and in one long gripping sequence Bourne directs Ross through London evading members of the organization. The camerawork captures every characters perspective from the hitmen, the organization members and even the public who watch in fear as Ross is eventually gunned down, by the end of this spectacular scene your heart will be pumping. Globetrotting from London to New York and eventually to Madrid, this film spans several locations with a fast paced and engrossing storytelling, the Madrid scenes are the fiercest with punch-ups, daring escapes and bombings. It all feels realistic, there's no CGI overload, the plots are plausible and there's not a single line of awry dialogue, a near faultless action thriller.",
            "review_date": "2014-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In love with Matt Damon",
            "review_date": "2014-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favourite action movie! In fact i don`t love the genre so much, but this one has true quality and never be bored to watch.",
            "review_date": "2014-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great finale to series!",
            "review_date": "2014-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is smartly crafted with joyous action and plot. The revelation of Bourne's character tips the one into the realm of epic.",
            "review_date": "2014-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great action, great story and a great conclusion to the Jason Borne trilogy.",
            "review_date": "2014-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The final Bourne movie in the trilogy kicks ass! It is even more gripping and thrilling than the second one, and possibly even better than the first. I have watched it probably a dozen times, and it still feels new and fresh to me. That is the mark of a great movie.",
            "review_date": "2014-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The beginning of the end, Damon and Greengrass reunite to create the final, and possibly the best in the Bourne Trilogy. The suspense never ends until we finally learn of Jason Bourne's identity. With a great performance by Damon, and superb cinematography by Greengrass, The Bourne Ultimatum is certainly the greatest chapter in the acclaimed Bourne Trilogy.",
            "review_date": "2014-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The third installment is by far the best of the bunch and for good reason. This changes the game for a long run in the series. Paul Greengrass has taking the stuff he has learn from the last round make this more intestine and better. This gave us a better story, acting, action and give us a good pace to make this all the way through, this could make this as one of the best action films I've ever seen for a while. If you love the other films, then you should love this one as well. The other films cant come this close after this one.",
            "review_date": "2014-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An action/espionage masterpiece, Bourne takes quality acting from Damon, Stiles, and Allen and meshes it with Paul Greengrass' chaotic camerawork. Action is very tense, and the film is pretty darn resourceful.",
            "review_date": "2014-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great popcorn flick. Watched more than twice, nice and easy finale for the series. The finale, I mean it. Oh, and Moby's song was in my head for weeks, so thanks for that.",
            "review_date": "2014-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant,good as the books",
            "review_date": "2014-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The crown jewel of the Bourne franchise.",
            "review_date": "2014-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is better than the second AND the first one. It is an action-packed movie as I like them. Hands down.",
            "review_date": "2014-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Following up the massive, as well as highly earned success and respect of the brilliant first two installments in the Jason Bourne Saga, The Bourne Ultimatum yet again pushes the envelope for the series into new, exhilarating heights. The shaky, yet impeccably controlled camerawork has been mastered, the musical score has been fine-tuned and perfected, and the plot leaves not a single second wasted, and gives the audience zero chances to catch their breath. The acting reaches a new emotional nirvana as well, portraying every distinct, subtle emotion and expression to a detailed point, and leads to the most realistic and believable performances in the series thus far, not to mention some of the darkest places the films have ever gone, period.\n\nThis is the movie that convinced me that Jason Bourne is not only a more interesting character than any and all other \"covert-operatives\" in cinema, including James Bond, but he is one of the most universally lovable characters in ANY genre of film. The breathtaking locations are abundant, the revelations are staggering, and the absolutely masterful way that this third installment ties off the trilogy leaves me to see this as nothing other than an action-thriller masterpiece. Holy hot DAMN. 9.8/10",
            "review_date": "2014-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best action movies ever. Too bad it is so one dimensional. But still, maybe that's what makes it good?",
            "review_date": "2014-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some of the shoddiest camera work I've ever had the misfortune of laying my eyes upon! It was literally an assault and battery on my eyes, and stomach!\n\nTotally Unwatchable!",
            "review_date": "2014-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The action scenes are brutal, and Matt Damon is compelling as Bourne.",
            "review_date": "2014-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie deserves 4 stars. Matt Damon was at his best while acting as the character of Jason Bourne. The intense thrillers and the captivating side stories is what made me give Paul Greengrass' movie 4 stars. The Original Motion Picture Soundtrack was descent, however, at some points of the movie, the soundtrack seemed to lag in loudness (forte) when Jason Bourne was doing his thing while resisting the many onslaughts. A good composer knows what to bring when it comes down to an Action & Adventure and a Mystery & Suspense type movie. Julia Stiles and David Strathairn were  good additions to add to the thriller of this movie. Overall, Greengrass did well in creating a character with much mystery from author Robert Ludlum's story.",
            "review_date": "2014-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "And then there were three - and each better than the last. Just hope this is not the last.",
            "review_date": "2014-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "just a great, well made flick.",
            "review_date": "2014-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the way spy-action movies ought to be made. If you want to  see how they ought NOT to be made, have a look at the \"Bourne Legacy,\" in which everything is a step off, from the protagonist to the chase scene. Matt Damon plays his role so well that we,ve come to take him for granted. Look at the extras on how these movies were made to see how grueling the role is, and the degree of excellence that the director and actors strove for and attained. An absolutely first-rate thriller.",
            "review_date": "2014-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm totally here for CIA bigwigs sayings \"How did that happen?\" and \"What?\" every time Jason Bourne does something slick to evade their pursuit.",
            "review_date": "2014-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best thrillers of the past 10 years. A+.",
            "review_date": "2014-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "prefer the first and can't explain why and still nails.",
            "review_date": "2014-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this trilogy. Suspenseful, fast-paced and entertaining as heck!",
            "review_date": "2014-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 3 Bourne's are one of the best if not the best action movies ever made! Great story in this one! Loved the ending!",
            "review_date": "2014-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than the second one.",
            "review_date": "2014-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jason Bourne = Machine",
            "review_date": "2013-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Bourne Ultimatum brings the Bourne trilogy to a satisfying end.",
            "review_date": "2013-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great trilogy.  Hope to see more.",
            "review_date": "2013-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Big fan of all the Bourne films.",
            "review_date": "2013-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clever thriller and character.",
            "review_date": "2013-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent finale for the Damon trilogy",
            "review_date": "2013-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ultimatum beats Identity but I still believe that Supremacy is supreme.",
            "review_date": "2013-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The third and final installment of this all action story. Bourne finally after more fist fights and car chases faces up to the truth about who he is David Webb. It makes you understand how with CCTV and mobile phone tracking anyone can be found.  By far the best of the three movies. Matt Damon at his very best. Definitely no need to make another Bourne movie.",
            "review_date": "2013-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a thriller, it doesn't dissapoint",
            "review_date": "2013-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I will just say that this is a must watch",
            "review_date": "2013-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect demolition with his intelligence..Made me love Matt and his movies..",
            "review_date": "2013-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "These movies are always good.",
            "review_date": "2013-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bourne tires to solve the mystery of his past as a trained killer, while being hunted by a ruthless CIA official and his agents. Although Bourne seems way too indestructible, it doesn't really matter, because one is hypnotized by all the exciting, hair raising chase scenes. Oscar winner for editing, sound mixing, and sound editing.",
            "review_date": "2013-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even better than the Supremacy",
            "review_date": "2013-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best action film I've ever seen in my life.",
            "review_date": "2013-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Liked it, but probably my least favorite of the 3 Bourne movies which is to say its still excellent. My biggest problem however was that they started this instalment by backtracking to the last 15 minutes of Bourne Identity. Now this would have been fine except that Damon had packed on about 40lbs and aged significantly, so that he looked quite different. This decision was jarring and made no sense to me? Still full of awesomeness with exotic locales (Morocco, Berlin, Paris and Madrid),  cool but slightly OTT car chases and awesome fight scenes. I could watch 100 of these movies.  11.13",
            "review_date": "2013-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "all Matt Damon Bourne's were perfect",
            "review_date": "2013-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely well-crafted and incredibly tense, \"The Bourne Ultimatum\" is by far the series' best entry, and gives no. 3 movies a good name.",
            "review_date": "2013-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Conclusion of the jason bourne trilogy that answers some questions. Focuses a bit too much on the action than the plot. But that' not really a problem.",
            "review_date": "2013-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a complete thriller till the end....superb action with a wonderful screenplay and everyone was spot on in the film from the very beginning to the end...\nA MUST WATCH (Y)",
            "review_date": "2013-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We want more Bourne!",
            "review_date": "2013-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Bourne Ultimatium is packed with action, drama and never stops delivering the thrills. There a couple of questions I felt were left unanswered, but it's a small price to pay for a terrific action thriller, where Matt Damon doesn't just play the role: he lives it.",
            "review_date": "2013-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Paul Greengrass and Matt Damon return for the finally of The Bourne Trilogy. Till they decided to make a fourth one but that's besides the point. This was the truly end of the trilogy.\nThe movie takes place right after the second Bourne movie ended and Jason begins to remember more of his past. The adventure starts and we have our best Bourne movie to date. It's so intense and incredible camera work from Greengrass. \nThe story is the best outa the 3 *four I guess*  it's intense, action packed, and you feel for Bourne to discover who he is. Loved this movie and definitely recommend it. After you watch the other two of course",
            "review_date": "2013-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now THIS was the Bourne movie we were waiting for!!!",
            "review_date": "2013-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Smart, well-acted, and brutal.",
            "review_date": "2013-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Bourne Ultimatum (2007)\nDirected by Paul Greengrass and produced by Universal Pictures, The Bourne Ultimatum is the third part of the Bourne series, as a sequel to The Bourne Identity and The Bourne Supremacy. The Trilogy is a novel adaptation, written by Robert Ludlum. In 2008, the action-thriller movie won three Oscar awards. IMDB's rating is 8.1 and Rotten Tomatoes, 8 out of 10.\nRobert Ludlum was an ex-marine and a theatrical actor before becoming an author, who sold more than 210 million books worldwide. He typically portrays a one-man story, who is faced with mysterious and scheming conspiracies from powerful organizations and governments. His style of writing is suspenseful and detail-oriented. \nJason Bourne is America's version of James Bond, who takes espionage to the next level by being highly-resourceful, tactical, and blending in with any part of the world like a 'chameleon'. Paul Greengrass attempts to bring the best out of the novel, however no movie can match a book that covers all details and stays in the original story line. The movie does not include \"Carlos\" a global terrorist who is one of the main characters in the novel series.\nIn The Bourne Ultimatum, the CIA red flags a conversation by an English reporter, Simon Ross (Paddy Considine) who talks about operation \"Blackbriar\" and Jason Bourne (Matt Damon). Ross publishes his investigations in The Guardian, which is read by Bourne after his trip to Paris. \nIn Paris, Bourne meets the brother of his girlfriend, Maria Kreutz (Franka Potente) to inform him of her death in India. Bourne says \"someone started all this, and I'm going to find out who\". \nBourne calls up Ross's office and sets up a meeting with him in London's Waterloo station. Here, Bourne realizes Ross is being tracked and slips him a cell phone. Bourne guides Ross to evade the crack teams and the cameras. After some brilliant action sequences, Ross panics and runs out into the open. A CIA \"asset\", Paz (Edgar Ramirez) is waiting to take out both Ross and Bourne at the busy train station. When Ross comes out, Paz shoots him with a sniper but is unable to get Bourne, who by now is running after the assassin. Paz eventually escapes in a train.\nBourne and the CIA (director Noah Vosen and deputy director, Pamela Landy) are after Ross' source, who is Neal Daniels, the station chief in Madrid. Daniels was involved with Treadstone as well as Blackbriar, who Bourne vaguely recollects during his first day of the Treadstone program. Bourne goes to Daniels' office which is empty but a CIA squad team reaches there as well. After another mind-numbing action scene, he meets Nicky Parsons (Julia Stiles) who is willing to help him.\nBoth of them reach Tangier, where Daniels is waiting to withdraw his escape money (which is held by the CIA, so they can assassinate him). They intercept the \"asset\" but are unable to save Daniels. The \"asset\" is now after Nicky, and the audience is treated to some roof-top Parkour action from Bourne. The \"asset\" is killed and Nicky is sent into hiding.\nBourne returns to New York City and lures Noah Vosen away to break in to his office. The climax of the movie takes place in NY, and the audience will not be disappointed with the car chases and the thrilling action sequences. This is a must-watch movie, and is at its best if watched in the original Trilogy order, starting from \"The Bourne Identity\". The 2013 movie, \"The Bourne Legacy\" stars Jeremy Renner, Rachel Weisz and Edward Norton, which was directed by Tony Gilroy.",
            "review_date": "2013-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best of the original trilogy.",
            "review_date": "2013-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Paul Greengrass's Bourne Ultimatum is the best of the franchise thus far, holding a slight edge over Identity. The action in this movie is second to none in the franchise, and with a significantly better story than Supremacy, is the most entertaining. The plot and direction may not be up to par with Identity, and the ending may be a little phoned in, but overall, Ultimatum is a great ending to one of the more entertaining trilogies ever made. The acting is solid, maybe even a step up from the others, but the cinematography, specifically during the fight sequences, is unnecessarily shaky. There's really no purpose for the style in which many of the action scenes are filmed other than a lack of compelling choreography. Despite these flaws, this is an incredible popcorn flick. Bottom line, I'd recommend this to everyone, but you really should watch this trilogy in order.",
            "review_date": "2013-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one was better than the first two, more fight scenes, more chase scenes, just more action in general which is what I love in movies. I am a full on action movie kind of guy and The Bourne movies have quite a bit of action. The storyline was somewhat easy to follow, the acting was really good and the movie kind of kept you on the edge of your seat. There were a few dull scenes but nothing to where you'd turn off the movie. Recommended",
            "review_date": "2013-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love all the Bourne movies. Matt Damon rocks!",
            "review_date": "2013-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the original Bourne films,bt I didnt like the adverts for.the new Bourne film as it doesnt look right without Matt Damon in the lead roll",
            "review_date": "2013-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A satisfying, skillful conclusion that ends the Bourne series, or at least Damon's part, in a manner that's consistent with the first two parts.",
            "review_date": "2013-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A slight notch above the first two, and should have been the final sequel.",
            "review_date": "2013-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not often a sequel compares to the first of a series, but it's extraordinary when the third instalment of a trilogy is the best. This closing story completes the incredible story and action-packed adventure behind the skeleton-packed closet of Jason Bourne.",
            "review_date": "2013-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has its moments, but \"Ultimatum\" suffers from the Bourne syndrome of atrocious pacing and seizure-inducing editing.",
            "review_date": "2013-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thr Bourne Ultimatum is just the most intense in the trilogy.",
            "review_date": "2013-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really really good sequel",
            "review_date": "2013-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you love action packed thrillers, this is the movie for you.",
            "review_date": "2013-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Heart-Stopping action Film.''",
            "review_date": "2013-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The way The Bourne Ultimatum was directed was fantastic, fast paced, and uptempo definitely a great entry in a great franchise",
            "review_date": "2013-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The finale of a great series and the conclusion to jasons journey for the truth. jason looks visually drained snd tired as the pursuit for the truth takes its toll. with each action scene pushing jason further and further. Action again is believeable but high impact and fast paced. Yet more locations around europe and the rest of the world. Nice finish to jasons story. Class series with epic truth baring ending :-)",
            "review_date": "2013-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What I got to say is that \"The Bourne Ultimatum\" is an entertaining, action-pack thriller that is non-stop thrill ride. The performances this movie is outstanding. \"Matt Damon gives another strong performance in this movie\" The directing by Paul Greengrass is excellent. The screenplay by Tony Gilroy and George Nolfi is perfect. The score and effects are extraordinary. \"I'm raving, that \"The Bourne Ultimatum\" is a great action movie!\"",
            "review_date": "2013-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Bourne Ultimatum combines an intelligent script with sharp directions and exhilarating thrills that make it one of the best action films of all time.",
            "review_date": "2013-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After despising the new \"Jason Bourne\", I had to rewatch one of these OG movies to see if maybe my tastes have just changed over the years and I didn't actually like any of them as much as I remembered. Well, if my tastes have changed, they certainly haven't here. This movie is supremely awesome. Quickly paced and well-written political commentary, with action that is wonderfully blocked and shot, I kept catching myself holding my breath. Favorite line: \"Uh, sir? He drove off the roof.\" So cool.",
            "review_date": "2013-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best of the trilogy.",
            "review_date": "2013-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There isn't an ounce of hyperbole in saying that The Bourne Ultimatum is one of the best action thrillers I've ever seen. Not only does it improve on the first two Bourne films (which are really good as well), have relentless thrills, engrossing action and excellent cinematography. It also has intelligence, making some acrid statements about the morality and methods of the C.I.A. The cast is flawless as well; Matt Damon continues his terrific work, and David Strathairn, Joan Allen and Albert Finney are equally fantastic. The only noticeable flaw is the same as in the two previous films; the soundtrack wouldn't have to play all the time, even if it sounds good. But once you let the action and suspense rivet you, it is quickly forgotten. The Bourne Ultimatum is one of the finest second sequels ever seen, and along with the two first installments makes one hell of a film trilogy.",
            "review_date": "2013-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By far the best in the trilogy, non-stop action that keeps the movie rushing forward.",
            "review_date": "2013-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very tense, and just spectacular. had me on the edge of my seat the whole way through.",
            "review_date": "2013-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great conclusion to the trilogy.",
            "review_date": "2013-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Bourne in my opinion 9.4/10",
            "review_date": "2013-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Add a Review (Optional)",
            "review_date": "2013-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Action, acting, and story was great. The chase scenes were really long though. The ending really pulled the movie together.",
            "review_date": "2013-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a fantastic third installment (which is rarity in cinemas) Matt Damon is brilliant as Jason Bourne in this new edition to the Bourne saga. The Bourne Ultimatum fires on all cylinders with more thrills and more action sequences that is well directed, from Paul Greengrass, and well crafted. 4.5/5",
            "review_date": "2013-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Matt Damon makes a third appearance in the Robert Ludlum inspired espionage novels. One bit of warning: the first two thirds of the film occur before the final scene of the previous film - The Bourne Supremacy - as Jason Bourne continues his search of information about his past and for those to turned him into a CIA assassin. \r\n\r\nThe Bourne Ultimatum was an excellent action movie taking us on a non stop high speed chase to Moscow, London, Tangier and New York.  It was a fitting end to the Bourne trilogy. The plot line could have been plucked from today's headlines, e.g., intelligence agents going rogue to turn over intelligence to the enemy, the CIA monitoring all telephone communications and CCTV cameras.  This is one of the best action trilogies ever made. I highly recommend this film and this entire trilogy to everyone.",
            "review_date": "2013-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "after watching all 3 back to back they make great sense",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An intense, smart, globetrotting, and wildly entertaining end to an excellent trilogy.",
            "review_date": "2013-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than the first 2.",
            "review_date": "2013-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great way to finish off bourne",
            "review_date": "2013-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "perfect balance between authenticity and plot",
            "review_date": "2013-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You'd be glad that it's finally over - not just for the sake of closure but for the fact how mentally exhausting the ride has been.",
            "review_date": "2013-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fast paced thrill ride, the Bourne ultimatum is the best of the series",
            "review_date": "2013-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "other than the first bourne this is definitely the best of them all, wonderfully plotted and scripted, fight and chase scenes are superbly done, I just wish the last movie they made in the Bourne saga Matt Damon would have been in, it would have made for a way better movie, not that I didn't like it, but nobody could do it like Matt Damon",
            "review_date": "2013-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a great movie. I didn't want it to end. Matt Damon is a FANTASTIC Bourne.",
            "review_date": "2013-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This concludes the Bourne trilogy in style, with sharper camerawork, interesting characters and great action.",
            "review_date": "2013-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sharp camerawork and script, with Matt Damon giving his all to a role he already plays pitch perfect.",
            "review_date": "2013-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tense, intelligent- I found this to be a rare finale to a threequel that tops the original.",
            "review_date": "2013-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good doesn't beat the first though",
            "review_date": "2013-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hope there is another but it was a great trilogy.",
            "review_date": "2013-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not too shabby. much better than the second one",
            "review_date": "2013-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely amazing!!!!!! Greengrass just shows us he's one of the best directors around. Damon, Strathairn and Allen are all brilliant. Top notch action with an equal level of intelligence thrown in for good measure.",
            "review_date": "2013-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I still think that the Bourne Identity is the best of the trilogy but this is great. It concludes the series well and still packs in a lot of great action.",
            "review_date": "2013-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Totally the best spy  trilogy of all time.",
            "review_date": "2013-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best in the series, Jason Bourne goes back to his roots and a truckload of action follows him",
            "review_date": "2013-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "*****\nMatt Damon is brilliant once more, as are the rest of the cast. The script is intelligent, the directing from Greengrass is full of energy, and the whole thing is an exciting, nail biting thrill ride, rounding off one of the best trilogies in movie history.",
            "review_date": "2013-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A solid final installment in the trilogy.",
            "review_date": "2013-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved it - doesn't give you a moment to breathe! Good old fashioned non-stop action - great end to the trilogy!",
            "review_date": "2013-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Edge of your seat thriller the whole way through!  Definitely a must-see great way to end the trilogy!",
            "review_date": "2013-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Favorite action movie along side my favorite action series",
            "review_date": "2013-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My new favorite action/suspense movie. so much action+good plot=amazing movie! the fight scenes and chase scenes were better than any other movie i have seen, that looked relatively realistic..",
            "review_date": "2013-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome!!! Cant wait to watch last one.  Each one better than the last !",
            "review_date": "2013-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not much different than the other two, but if it had been, it wouldn't be as good as it was.  A great conclusion to the Bourne trilogy.",
            "review_date": "2013-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sequel that does everything right. It is a ride through the whole movie. It's a lot of perfectly pulled off action and chase after chase. Great movie.",
            "review_date": "2013-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bourne!!  need I say more.",
            "review_date": "2013-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite one of the whole series. Julia Stiles is fantastic in it. Plus, some really awesome action sequences.",
            "review_date": "2013-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wasn't fully sold on the trilogy until the third one came out.",
            "review_date": "2013-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The thrill continues with same rate",
            "review_date": "2013-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am fan of the tale.",
            "review_date": "2013-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good, a little anti climatic but still good",
            "review_date": "2013-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best of the three, raising the stakes and brining everything full circle. It's intense and suspenseful, and it never stops.",
            "review_date": "2013-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The whole trilogy amazing!",
            "review_date": "2013-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best action/spy movies ever made. Also the best out of the Bourne Trilogy.",
            "review_date": "2013-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There were just a few things that bothered me - just a bit beyond my suspension of disbelief.  I suppose if I were just focused on the action, this would have been better, but then I started thinking.",
            "review_date": "2013-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant! The best Bourne yet!",
            "review_date": "2013-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Smashing. Ok - so the plot is just a simple continuation of the previous two, but that is no surprise. What makes it is the action. The directing and cinematography is    simply superb, and Matt Damon remains the credible anti hero. This was edge of your seat stuff the whole way through. See it on the big screen and see it now!",
            "review_date": "2013-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fast paced action movie that is truly a good ending of the trilogy... Great chase scenes...",
            "review_date": "2013-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My second favorite of the trilogy.  The filmography especially in the chase scenes is great.",
            "review_date": "2013-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great way to finish the trilogy!",
            "review_date": "2013-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Bourne series is very good. Mark Wahlberg is very good in them.",
            "review_date": "2013-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Chuck Norris fears this man.",
            "review_date": "2013-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "excellent start to finish",
            "review_date": "2013-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie!!! Much more action packed then the first two!!!",
            "review_date": "2013-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film I'm most looking forward to see this year.",
            "review_date": "2013-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, these bourne movies are getting better and bettter, and now it's all over.  :,-|",
            "review_date": "2013-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mel and I saw it Friday night. It is AWESOME!",
            "review_date": "2013-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first one was awesome, the second was amazing. This one is epic.",
            "review_date": "2013-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most consistently high quality trilogy ever. And an excellent finale. Whoever thought it was a good idea to make a fourth one needs a visit from Jason! At least Mr Damon had the good sense not to be involved.",
            "review_date": "2013-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "awesome! I wanna watch all of them again now. You should see it!",
            "review_date": "2013-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The whole movie is a succession of chasing and killing, with Bourne doing all the amazing things you're not impressed to see anymore after the previous editions of the franchise. What is left of actual story won't last 10 min if put together.",
            "review_date": "2013-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How many chase scenes can we fit inside one movie? Boring.",
            "review_date": "2013-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best franchises ever made, a breathtaking trilogy, and a stunning conclusion! \"The Bourne Ultimatum\" can be one of the best trilogys ever made, giving a phenomenal show, ending in a fantastic way the journey of Jason Bourne (Matt Damon) after the truth.\nThe story can be very loyal to predecessors and can mix a bit of \"Identity\" and \"Supremacy\", both at events and also the characters. The film starts in the middle and ends shortly after the end of \"Supremacy\", that's where the screenplay by Tony Gilroy and Scott Z. Burns impresses, being written with the greatest possible mastery and deepening the character of Bourne deeper than had ever been. Taking it to a new and dangerous journey to discover the origin of the memories that haunt his past and finally its origins. A journey that will take him to more epics dangers like never before faced. And the direction of Paul Greengrass with elements of action over the story is simply SUPERB!\nThe action sequences of the film can be epic and electrifying at every passing minute, Paul can put them very realistic and puts the audience in the place of Bourne, as if we were there in the midst of all the rush breaking windows, knocking three men at the same time, falling from buildings inside a car and get out alive .... it's just AWESOME as hell!\nThe old cast is still fantastic as ever, as Matt Damon who gives an EXELENT performance of Bourne as never before.\nOne of the best endings to a saga, being faithful to the predecessors, deepening the character more, the levels of performance, technical history as the movie is just FANTASTIC from start to finish. \"Ultimatum\" manages to be not only the best film of the franchise, as well as one of the best Action-Thrillers ever made!",
            "review_date": "2013-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really enjoyed this along with the previous two. Poss the best film so far this year....",
            "review_date": "2013-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fast-paced, action-packed, and smart as hell, this entry in the franchise is clearly the best. Jason Bourne's super-spy is always three steps ahead of his foes and you know you're watching an intelligent thriller. The fight choreography, chase sequences, and a particular train station scene are all spectacular and not to be missed.",
            "review_date": "2013-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved the first two. Been meaning to read the novels.",
            "review_date": "2013-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is no doubt one of the most cleverest espionage movie! Simply too clever! Finally get to see this after YEARS of waiting. This trilogy is about a man doing all the impossible, but it aint matter because he is Jason Bourne. One does not want to mess with him. Matt Damon is so brilliant, so is Joan Allen.",
            "review_date": "2013-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible threequel and the best in the series!!",
            "review_date": "2013-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nice way to end the trilogy.",
            "review_date": "2013-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best of the trilogy in my opinion!  I loved it!",
            "review_date": "2013-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fantastic ending to a wonderful trilogy",
            "review_date": "2013-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All three Bourne films are brilliant but The Bourne Ultimatum brings new heights into the series. Probably one of the best trilogy's out there.",
            "review_date": "2013-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not my favourite of the trilogy.",
            "review_date": "2013-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OK, now read the books because they are completely different and you'll love them if you liked the movie!",
            "review_date": "2013-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once again, lacks the punch of the first movie, but still a good flick. Also good for a tour of Europe and the Mediterranean, and the Tangiers scenes are high-energy and unmissable.",
            "review_date": "2013-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THE BOURNE ULTIMATUM brings Jason Bourne's story to its inevitable conclusion, and does so in the best way possible. This time around, Paul Greengrass and company outdo everything they did in the previous two entries. Matt Damon and the rest of the cast give outstanding performances, and the attention to story and character this time has been fine-tuned to perfection. In this third entry, Jason Bourne finally comes home to take on the agency and find out once and for all who he is and how he got that way. The cast has been expanded slightly yet again, this time adding David Straithairn as a ruthless CIA chief who runs a black ops unit. Scott Glenn and Albert Finney also have smaller roles as the CIA Director and the doctor who introduced Bourne into the program, respectively. What ensues is a globe-hopping adventure that gives the audience some amazing on-location shooting and enthralling action setpieces. My personal favorite, and the centerpiece of the movie is an intense chase through the streets and back alleys of Morocco, culminating in one of, if not the best hand-to-hand fights in the series. And this time, despite the chaotic nature of the cinematography, all of it was immensely more comprehensible than in the last entry, even the car chases. I also thought that they did a better job this time of balancing the different story elements and cutting between a variety of locations in a way that always kept the story moving. They also succeeded in bringing things full circle, as well as teasing some new developments which could be used in future sequels (and were, in THE BOURNE LEGACY). While bringing closure to Bourne's story, they didn't end things such a final way, which I thought was great. After all of the great storytelling of these first three, I'm definitely in the mood for more of it. Overall, I think that this is the pinnacle of the Bourne series, which was already very good to begin with. It's the American answer to Bond, as well as being an anti-Bond. It keeps you immersed in a believable world with real characters and human drama, as well as showcasing the best action that Hollywood has to offer. Seeing the previous two is kind of a prerequisite for understanding this one, but once you do, you shouldn't miss this one.",
            "review_date": "2013-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely a good end to the set of films, answered a lot of questions, and a good action film. If you like the other Bourne films this is a must see",
            "review_date": "2013-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed this movie. A great ending to the trilogy.",
            "review_date": "2013-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Jason Bourne film ever!!!",
            "review_date": "2013-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you've seen the others then you know what to expect.  Good movie worth seeing.",
            "review_date": "2013-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stunning and full of suspense! The climax is consider to be the most exciting among the other 3 of the series, one Bourne outsmarted CIA",
            "review_date": "2013-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily the best movie in the trilogy",
            "review_date": "2013-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love all the Bourne movies!",
            "review_date": "2013-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good Action but one note characters, second one and first one better",
            "review_date": "2013-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A high octane action film that's one of the best in recent years.",
            "review_date": "2013-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie. Still liked the first two better.",
            "review_date": "2013-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jason Borne film genius need I say more, this franchise is astonishingly good",
            "review_date": "2013-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, this is just amazing. It's smart, and that's something I like about commercial movies. It's not just that though. It also sends a message without being too obvious or preachy. it just gets you thinking about it. The movie answers all your questions and it's one of the only good third movies in a sequel that's actually the best of them all.",
            "review_date": "2013-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the best ending in every director's dream, but only achieved by Paul Greengrass.",
            "review_date": "2013-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Action scenes went too fast. Camera work was horrendous at best. And if that weren't enough, there were tons of pauses during conversations that were not needed. One of the worst movies I have ever seen.",
            "review_date": "2013-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Paul Greengrass returns to complete Bourne trilogy. Chemistry between Paul Greengrass and Matt Damon is perfect and they did not let me down for this third Bourne movie. It is equally, perhaps better than the Bourne Supremacy. Great story. Great characters. Very satisfying movie.",
            "review_date": "2013-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not better than the first, despite what people say. Actually, this is where it really loses its edge and surprise. A bit recycled from the previous 2 movies. Still, better than most modern action movies.",
            "review_date": "2013-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fast Fights, Action And Mayhem Bring The Dizzying Thrills Of This Gritty End To The Bourne Trilogy",
            "review_date": "2013-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Matt Damon showing Jeremy Reiner how it's done",
            "review_date": "2013-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very good movie.  Not quite as great as the 1st but better than the 2nd.  had a good story and action",
            "review_date": "2013-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it, lives up to the Bourne series!",
            "review_date": "2013-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riveting, relentless, and whip-smart, The Bourne Ultimatum is a brilliantly constructed action thriller with an exceptional performance by Matt Damon, proving not only to be the best of the franchise, but also an action movie landmark for the decade.",
            "review_date": "2013-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Three great spy/action scenes surrounded by an uninteresting plot.  Fun enough to watch but why they would take an interesting character like this, a cool original scenario and realistic spy action and make the last two movies into standard revenge movies is beyond me.",
            "review_date": "2013-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very very good!!! smooth and cool spy movie that puts Bond and the M.I franchises to shame",
            "review_date": "2013-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really like The Bourne Ultimatum I thought it had lots of action and was just a great movie.",
            "review_date": "2013-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie of the summer..no doubt",
            "review_date": "2013-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Movie of the Year",
            "review_date": "2013-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie, lots of butt kicking",
            "review_date": "2013-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Non stop action, I loved it!",
            "review_date": "2013-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the cameramen in this movie all suffer from Parkinsons disease",
            "review_date": "2013-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Bourne series goes out with a BANG!",
            "review_date": "2013-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films of 2007, the best action film of the decade and one of my all time favorite action films. Add that with a great script and superb acting, this movie is an absolute grand slam.",
            "review_date": "2013-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay. I loved the Bourne series. Is this the one where he beats up a dude with a newpaper? I love that!\r\n\r\nThis is probably also the only movie that I'll think Matt Damon is on the hot scale. Mostly because he's fighting.",
            "review_date": "2013-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the most perfect Trilogy of movies I have ever seen (except the original Star Wars flicks).  The Bourne series has been consistently good and this one is no exception.  Matt Damon does it brilliantly...and it does make you wonder...which is better Bourne or Bond???",
            "review_date": "2013-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is the best out of the 3",
            "review_date": "2013-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved it, even though it's no where near as good as the first.",
            "review_date": "2013-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A solid and satisfying conclusion to the Bourne trilogy.",
            "review_date": "2013-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing film!! Jason Bourne gets better and better everytime. Bourne is so much better than James Bond and is everything they've tried to make Daniel Craig's, James Bond and failed miserably. what can i say? you can't beat the original.",
            "review_date": "2013-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, this movie. . .Wow.  This movie redefined how to make an action film great.  The only one I point to as definitive in th action genre is still Leon The Professional, but this one is very close.  Loved it.",
            "review_date": "2013-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love the series... but the shakey camera thorugh the whole thing was used way too much! Took away from the film.",
            "review_date": "2013-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A simply amazing (possible) end to the Bourne films. Matt Damon is fantastic in the role again.",
            "review_date": "2013-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best spy thriller I've seen in recent years.",
            "review_date": "2013-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This lived up to my expectations from months ago that this was the real movie o get excited about this summer.",
            "review_date": "2013-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie DEFINES action-suspense as a genre. It was great.",
            "review_date": "2013-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's getting clever, ridiculous and entertaining.",
            "review_date": "2013-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seen it! Loved it! need I say more?\r\n\r\nIt's DEFINATELY a must see, if you hvn't already!",
            "review_date": "2013-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a great movie this was. A perfect ending to the saga that will hopefully get a fourth installment. Jason Bourne fricking Rocks!",
            "review_date": "2013-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As with its predecessors, The Bourne Ultimatum features one of the most brutal and well-choreographed fight scenes and jaw-dropping insane car chases ever filmed! Ultimatum concludes the Bourne trilogy perfectly with all answers to every question. One of the best movies of Summer 2007. A must-see!",
            "review_date": "2013-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great way to conclude the series ... thanks Bourne for making Bond even better ...",
            "review_date": "2013-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome.Better Than The Other First And Second Bournes.\n\nGrade A",
            "review_date": "2013-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The pinnacle combination of action and thoughtfulness as the grim reality behind Bourne's life and jobs are brought into light, effectively de-glamorizing the spy/assassin.  Bourne is fleeing for his life, but instead of running and hiding, aims that flight straight at the heart of his pursuing organization.",
            "review_date": "2013-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Humm its Fucking Hot, Matt damon finally beats some peoples ass.",
            "review_date": "2013-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent.  Damon once again rocks the shit in this one.  Great cast, acting, pace, story, music, editing, direction.  An all around fantastic action movie.  But I think I still might be more in love with Supremacy.  The Bourne character was at his most menacing in the second one and was out for revenge and the truth.  Ultimatum is more about the truth but picks up brilliantly where the second one (kind of) ends.  The only reason it doesn't get a full five stars like the second one is because I wanted just a little bit more of a climactic ending.  The revelation wasn't as huge as I'd have hoped for but the ride there is worth the trip.  The Bourne series is one of the best in action in a long long time.  And for all yous asses who hate on the shaky camera... go fuck yaself.",
            "review_date": "2013-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "kills a guy with a book!!",
            "review_date": "2013-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "without doubt the best of them all",
            "review_date": "2013-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Again, another \"Bourne\" film that delivered a great, intelligent plot.  It's stylish, well-made, and exciting to watch. You can't keep your eyes off it.  This fim has officially made me a Matt Damon fan, for real this time.",
            "review_date": "2013-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "an intelligent, highly energetic, and satisfying conclusion to the original Bourne trilogy.",
            "review_date": "2013-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best all time movies",
            "review_date": "2013-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "who hired the cameraman on this. it sux.",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Holy Crap.  I did not believe the Bourne movies could be any better, but it just happened.",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'll keep this one short, so as to give nothing away.  Absolutely my fave of the three, and maybe the best third flick of a trilogy ever (ok ok sit down LOTR fans, it's awesome too).  I'll amend that last statement:  it's the best third film in a trilogy where someone tries to kill someone else with a book.\n\nNow you're interested.",
            "review_date": "2013-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Explosive scenes, great thrill for a trilogy end (kinda).",
            "review_date": "2013-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boredom. Not worth the VOD charge",
            "review_date": "2013-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i luv this movie it was awesum action packed!!!",
            "review_date": "2013-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Delivers us a high octane action flick that's one of the best in recent years.",
            "review_date": "2013-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film very kick ass suspence and drama films",
            "review_date": "2013-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is the definition of ADD film making. The plot doesn't slow down and relentlessly assaults your senses and intelligence when throwing you story elements like full auto machine gun fire. The story is barely coherent, and the shaky camera work is just, well it is what it is, to each his own. Damon is good as Bourne, but in a story with so little substance his talent is wasted. Not recommended, watch Identity again instead.",
            "review_date": "2013-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid action movie with another good performance by the cast",
            "review_date": "2013-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Certainly the best of the three.  For an action flick, it's surprisingly tight.",
            "review_date": "2013-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Borune Ultimatum is the defining film of the franchise.",
            "review_date": "2013-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are few movies in existence that are as relentlessly fast-paced as \"The Bourne Ultimatum.\" At the time of its release, it was the finale of the series, and it would've been a good one that pleased me. However, I am glad to know that there is another movie on the way. This movie is full of insanely tense chase scenes and is exciting all the way through. As always, the story is engaging and Matt Damon does a fantastic job both portraying and humanizing Jason Bourne. This movie reveals the biggest mystery in the series and it certainly is rewarding when you reach that point in the movie. This is one of the best action movies out there and it is a ton of fun. There are few movies in the espionage action thriller genre like it. It's a must see.",
            "review_date": "2013-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Movie. Great Action. I love Matt Damon.",
            "review_date": "2013-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you have seen the others you NEED to see this one, and if you haven't seen the others, watch them just to watch this one!",
            "review_date": "2013-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5/5 *\nVisceral, and intensely well shot, with intelligence. The action is well paced and detailed.The Bourne Ultimatum is still one of the great action thrillers in recent years.",
            "review_date": "2013-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was good, but not really that satisfying in terms of answering questions.  guess they need to be able to make another one...great action scenes tho.",
            "review_date": "2013-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While Bourne recaptures his memories, he captivates an audience!\r\n\r\nThe Bourne Ultimatum was a bitter sweet ending to a wonderful series of movies. In the world of cinema where computer effects and super humans at every turn, Jason Bourne reminds us that when you as an audience can connect with a character at an emotional level, it's the story that makes the movie. With all the action I felt, the movie glided along just fine. Ultimatum was a wonderful film but I felt it was the weakest of the series. But I find myself becoming critical in the way that Harry Potter fans are of their final installment, the ending wasn't up to par of what I desired. None the less Matt Damon has proven himself to be on par with the greatest action hero's of our time; grossing more than Cruise's Mission Impossible series, also being able to outright restructure the Bond films. Robert Ludlum created a character that was meant to change, not only Bourne?s own life, but the way audiences look at the \"action hero\". Go remind yourself of why you watch movies; Bourne will help bring back your memory of that first time you got introduced into this genre.",
            "review_date": "2013-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love Matt Damon, love Julia Stiles - they were fantastic in this sequel. Best out of the trilogy.",
            "review_date": "2013-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "what was this supposed to be about? anyone?",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty OK finale to the trilogy, but not as much fun as the first two. It follows the formula of the previous films too much, making most of it overly early to predict. But, having said that, it's still a great ride and delivers on most of the hanging answers left behind. Julia Stiles remains annoying.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was great movie as i was sit on the like fun.... i love it.... you must see it...\r\nmatt damon is the man...",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty much the same as the second one, but I loved the second one, so we're all good. Stiles is still useless, but I thought the recycle of a scene from two was genius. Good action, but hardly the best of the summer. THIS MOVIE HAS NO SUBPLOTS!!",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Bourne, period!",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "GREAT MOVIE!!! A GOT TO SEE MOVIE !!!!! AWESOME FILM FROM ALL TIME!",
            "review_date": "2013-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tottaly loved it. I've seen The Bourne Identity and I have not seen The Bourne Supremacy but I cood understand somethings about that movie by this one. This is not only one of Damon's  best movies, it's the best movie of the saga, it has a lot of action, it's entartaining, never boring and it has very mistery, recommended 100%.",
            "review_date": "2013-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked the film, I like bourne so no big suprise. The ending was a bit unexpected but good enough.",
            "review_date": "2013-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent ending to a great trilogy. Smart and action packed.",
            "review_date": "2013-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. The best part is when he tricks Landy's boss near the end. Totally smartass. And Julia Stiles actually did something this time.",
            "review_date": "2013-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Movie, Great Finish to the Trilogy!",
            "review_date": "2013-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fast paced, exceptionally well put together... tied the 1st & 2nd one together very well.",
            "review_date": "2013-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not really knowing what the Bourne seires is about, it's actually not bad of a movie. Matt Damon kind of kicks ass as usual, and it's got enough action to satisfy any man. However I wish that they wouldn't give the camera to a seven year old during the really good actions scenes.",
            "review_date": "2013-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jason Bourne is back and it is badass!",
            "review_date": "2013-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Relly enjoyed the film, fast paced and as good as the first two.  James Bond is still No. 1 though.",
            "review_date": "2013-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have no idea how this made it into the top 100 flixster films",
            "review_date": "2013-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great end to the bourne flicks.",
            "review_date": "2013-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Freaking amazing movie.  Perfect way to end the series!",
            "review_date": "2013-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great end to the Matt Damon appearance in the Bourne series, I just wish it didn't leave me to want more - because we never got more.",
            "review_date": "2013-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best thriller of the year hands down. Considering it the last one also makes this exceptionally well done.",
            "review_date": "2013-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not my kind of movie.",
            "review_date": "2013-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This series is generally better than most action movies/series.  Personally, I was a litte bored and nauseated by the jerky camera shots and chase scenes.",
            "review_date": "2013-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good action film",
            "review_date": "2013-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this series and Bourne Ultimatum does not disappoint.",
            "review_date": "2013-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good action, kind of hard to follow though.",
            "review_date": "2013-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "...third, final, and best of the Bourne Trilogy ~ once more the fast moving plot, along with action scenes and a international back drop combined to provide a cracking 'thrill-a-minute' film ~ Jason Bourne (Matt Damon) continues to seek an answer to his lost past, as he moves from Russia to France to Morocco, with the final, spectacular chapter taking place in New York.  Damon is brilliant in this role, and fitted the character to perfection and this really is a 'thrill-a-minute' ride.  Pam Landy (Joan Allen) sides with Bourne again as he seeks the answers, while Noah Vosen (David Strathairn) tries every means, fair and foul, to silence Bourne and thus keep the dark secret at the core of the plot under wraps.  It is difficult to judge which way Bourne will finally turn as he closes in on the answers that have haunted him for so long, which is a sign of a good plot, and all three films provided brilliant viewing ~ in short, a great trilogy.",
            "review_date": "2013-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this was a great movie.  Lots of action shots...cool camera angles...more Bourne action.",
            "review_date": "2013-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a movie! another action packed, brilliantly scripted and well directed picture that showcases Matt Damon's abilities as an actor.",
            "review_date": "2013-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great end to the trilogy. One of the best action franchises ever",
            "review_date": "2013-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Damon is good in these movies.",
            "review_date": "2013-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think it was great...it did the series justice.",
            "review_date": "2013-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Action packed film, ties in well with 1 & 2. Great viewing never a dull moment.",
            "review_date": "2013-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice but very overrated",
            "review_date": "2013-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not too bad for a third installment. I really like how the script added extra depth on context around the final scene of the Bourne Supremacy and tied it all together. Really impressed that a \"mainstream\" movie can get away with such a stylized out of focus fast moving camera look.",
            "review_date": "2013-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great action packed movie!",
            "review_date": "2013-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THE BEST DAMN ACTION MOVIE IVE SEEN IN A LOOONG TIME!",
            "review_date": "2013-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nice way to end the trilogy, but all got a little weird in the second half of the movie.",
            "review_date": "2013-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was a good movie, i just saw it on a day that wasn't the greatest for me",
            "review_date": "2013-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "freakin Matt Damon is a bamf. best movie of the summer BY FAR! nothing even comes close to this, best movie I've seen in theatre since 300...",
            "review_date": "2013-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, I love the series. For book lovers, this movie is nothing like the book or even any of the other movies for the fact.",
            "review_date": "2013-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Totally different from the book.  Still can't get over Marie",
            "review_date": "2013-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great action and story! Grand end to the trilogy!",
            "review_date": "2013-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hands down the best movie ever made about people walking hurriedly.",
            "review_date": "2013-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nonstop action and plenty of thrills, The Bourne Ultimatum is one hell of a ride.",
            "review_date": "2013-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a while since I saw the first two. Couldn't remember their stories very well. This one tells the story independently from the first two. Loved it.",
            "review_date": "2013-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is, in my opinion, the best of the Bourne series. And what a way to give an ending to the trilogy!",
            "review_date": "2013-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hello he is hott!  It was really good.",
            "review_date": "2013-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "was a good end to the trilogy not as good as the other but deff worth watching",
            "review_date": "2013-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "loved it!! non stop action beginning to end, matt damon is absolutely fab in the role! should be a fourth if you ask me!",
            "review_date": "2013-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fast paced and action packed!",
            "review_date": "2013-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best of the Bourne trilogy with Damon.  An intelligent action movie.",
            "review_date": "2013-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I guess it was OK. The only thing that sucked about this movie was the stupid camera. It always moved. I couldn't see and understand anything that was going on during the movie. Plus, the movie doesn't follow the book what-so-ever.",
            "review_date": "2013-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "makes you go jumping up and down, they got the best for last",
            "review_date": "2013-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it.  Having watched this one again recently, I happen to think it's as good as the first two instalments without doubt. An awesome movie as the last (presumably) in the series.",
            "review_date": "2012-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'The Bourne Ultimatum' is not only an incredible action film, it's an incredible film. Period.",
            "review_date": "2012-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fast paced, Matt Damon at the top of his game, and well cut. Paul Greengrass makes his best and is a great climax",
            "review_date": "2012-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like Seth Mcgee said...best ending a movie can have",
            "review_date": "2012-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is not only the best Bourne film, but it is a marvel in its own right, gripping and amazing. I love and adore the Bourne films (apart from Legacy) and this for me is the ultimate bloomage of a series I hold dear to my heart. Bravo, Mr Greengrass, bravo. I do believe that the mix of US politics and European settings makes this series one of the best and my favorite action/spy series ever apart from James Bond.",
            "review_date": "2012-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Following hot on the heels of the second film is this satisfying conclusion. Loved the scenes in London in particular! (28.12.12)",
            "review_date": "2012-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The main problem with this film is that it's not Baby Boom, I was really in the mood for an 80's female empowerment movie with Diane Keaton, and this just didn't provide what I was looking for. Quality action flick though - exciting, great looking and some fab musical stings.",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best action movie of the decade.   As suprising as it may seem I find Edgar Ramirez role most intense in this third installment of Bourne Trilogy.\nAll the new action films will have to follow the trend of Jason Bourne makers!",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was on the 1 the action the drama the coolness of Matt Damon was awwwsssooomee!!!",
            "review_date": "2012-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome, watch this now",
            "review_date": "2012-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hate spy movies with a passion, but Jason Bourne is okay by me.",
            "review_date": "2012-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best trilogy ever",
            "review_date": "2012-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "he kicks 10 bells out of everyone again. really good Bourne film ties up lots of unanswered questions and its cool.",
            "review_date": "2012-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Movie, non stop action from start to finish!!",
            "review_date": "2012-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really solid.  Just wish it wasn't filmed in puke-o-vision.",
            "review_date": "2012-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was on the edge of my seat the entire movie",
            "review_date": "2012-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I decided Bourne is Bond for my generation.  Tough movie for sure.",
            "review_date": "2012-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great action, little to no story.  It was ok, but didn't measure up to the original.  Just felt kind of souless despite being shot well.",
            "review_date": "2012-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "trust me after you watch this you'll never want to watch bourne legacy.",
            "review_date": "2012-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great wrap up for the trilogy. Definitely worth seeing in theaters.",
            "review_date": "2012-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love these movies!",
            "review_date": "2012-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jason Bourne is the dogs bollocks !!!",
            "review_date": "2012-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love all the Bourne movie except the 2012 one.",
            "review_date": "2012-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is so intense, best movie i've seen this year",
            "review_date": "2012-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "FANTASTIC movie!!! There's pretty much no words to express how awesome it really was.",
            "review_date": "2012-12-20",
            "source": "rt",
            "lang": "en"
        }
    ]
}