{
    "rating": 9.2,
    "release_date": "2007-12-19",
    "num_reviews": 110,
    "genres": [
        "Biography",
        "Drama"
    ],
    "summary": "Jean-Dominique Bauby (Mathieu Amalric), editor-in-chief of French fashion bible Elle magazine, has a devastating stroke at age 43. The damage to his brain stem results in locked-in syndrome, with which he is almost completely paralyzed and only able to communicate by blinking an eye. Bauby painstakingly dictates his memoir via the only means of expression left to him.",
    "reviews": [
        {
            "content": "After suffering a catastrophic stroke, well-loved magazine editor Jean-Dominique Bauby finds himself the victim of locked-in syndrome, only able to communicate through the blinking of an eye.  Julian Schnabel's The Diving Bell and the Butterfly is a disturbing but inspiring story of resilience and the power of the human spirit, a film that never stoops to maudlin and manipulative means to express its message.  Schnabel wisely tells the story primarily from Bauby's point of view, using prolonged POV shots from the perspective of the patient and employing voiceovers to express Bauby's thoughts.  Well-acted, ingeniously shot, and smartly written, it never fails to be thought-provoking.",
            "review_date": "2023-02-26",
            "source": "rt"
        },
        {
            "content": "The best international movie ever made!",
            "review_date": "2022-11-26",
            "source": "rt"
        },
        {
            "content": "This is a very impressed be film but my god I felt depressed throughout. Quality in many ways but not one to watch if you need something even mildly feel-good.",
            "review_date": "2022-10-30",
            "source": "rt"
        },
        {
            "content": "THE DIVING BELL AND THE BUTTERFLY is an extremely beautiful and moving film with a lot of incredible visuals and powerful storytelling.",
            "review_date": "2022-10-13",
            "source": "rt"
        },
        {
            "content": "Truly and thoroughly a brilliant work of genuine art. A first-person take on a paralyzed man who blinked his memoir, artist-turned-director Julian Schnabel ingeniously transplants us into this man's consciousness. We hear what he hears, we hear and see what he thinks, and we see what he sees (the first 15 minutes literally do just that--a feat that is nothing short of a miracle of filmmaking). Everything here absolutely works, from the poetic writing, the perfect cinematography and editing, the nostalgic touching music, to the magnificent acting. All of which tells a harrowing and heroic story, one that genuinely moves the soul. A brave, thought-provoking film that is one of 2007's best",
            "review_date": "2022-07-22",
            "source": "rt"
        },
        {
            "content": "Max von Sydow was 'only' 78 when he played a 95-year-old character in The Diving Bell and the Butterfly. The man looked ancient from middle age but he could act the hell out of any role well into his late career. \n\nI wanted to rate this one higher, but ended up being unable to. Screenwriter Ronald Harwood and director Julian Schnabel take a limiting factor - the near-total paralysis of Jean-Dominique Bauby, left to communicate entirely by the manipulation of one eye - and flip the script brilliantly, delivering inventive camerawork and editing to convey Bauby's confusion, inner turmoil, and struggle through a uniquely visual medium. Our protagonist is given depth and humanity in a biopic that leans away from a Puritanical protagonist simply struggling against adversity in favor of a funny, passionate, emotional main character whose suffering is made to be the audiences own. So why do I rate the film a bit low when it combines originality and solid execution? Simple answer: the dialogue just cannot help but opt for low-hanging fruit, attempting to be profound but ending up obvious instead. Winners include \"this is LIFE?\" and comparisons being drawn between an old man (our main character's father) trapped in his own apartment and Bauby's confinement in his own body, with tears shed at this supposedly emotional realization. The concept is good enough to carry the film, and audience members really don't need to be led by the hand with this kind of dialogue. It's more likely to make you roll your eyes than dab them with a tissue.\n\nJust think, Johnny Depp was originally slated to play the role of Bauby, for which Amalric earned a César Award (mostly for making his mouth askew). Why did Depp pull out of the production? Scheduling conflicts associated with that other cinematic titan, Pirates of the Caribbean: At World's End. (3.5/5)",
            "review_date": "2022-03-01",
            "source": "rt"
        },
        {
            "content": "I've had this experience with my body paralyzed all over and a TV I could not focus my eyes on as even those muscles in my eyes were also paralyzed.  Unfortunately this movie hits a little to close to my own past experience, and I can tell you the reality of being paralyzed, bed sores, the catheter I had to wear and when I defecated myself  and had to be cleaned up.  So I found this movie totally disturbing which is why I can only give this movie a *2* star rating!!",
            "review_date": "2021-09-13",
            "source": "rt"
        },
        {
            "content": "Although The Diving Bell and the Butterfly is technically superb, especially in terms of cinematography, acting and editing, it's still a chore to sit through. It's a very boring movie that has nothing new to say about its subject matter. It felt very familiar, unoriginal and thus extremely overrated.",
            "review_date": "2020-06-05",
            "source": "rt"
        },
        {
            "content": "In this film the aesthetics have been abused a little, to cover for the absence of a complete story. In the whole it works, but on these specific and sad theme, there are better films.",
            "review_date": "2020-05-31",
            "source": "rt"
        },
        {
            "content": "Sometimes the experimentation comes off as a bit pretentious and even dry. However, what's remarkable is how the film manages such strong emotions even in its oddities. Bauby's inner thoughts are the star; such a humanistic way in which the movie uses humor to help us relate to his plight. Overall, it's a compelling and unique film…that I can't imagine ever wanting to watch again.",
            "review_date": "2020-04-07",
            "source": "rt"
        },
        {
            "content": "A gorgeous, innovative, and unique film.\n\nThe astonishing true-life story of Jean-Dominic Bauby -- a man who held the world in his palm, lost everything to sudden paralysis at 43 years old, and somehow found the strength to rebound -- first touched the world in Bauby's best-selling autobiography The Diving Bell and the Butterfly.\n\nWow. Let's just say first off, I had no context going into this film. I knew nothing about it so I didn't really have any expectations. However, it turned into something so powerful and so unique that it really became a memorable experience for me.\n\nFirst off, I didn't realize this was a biopic. That's absolutely mental! This told the story of a man who lost everything that made him, him. He took that loss and at first, wanted to give up. But with the help of people around him, he realized he just wanted to live. We've seen stories like this before but not like this. \n\nThis film had gorgeous cinematography. It was blended so well with the story telling, as the camera really was it's own character. A lot of times, we were in the POV of the protagonist and it just felt so immersive. The entire film felt immersive and so real. \n\nThe story itself is very powerful. I know people might want to skip over this because it's a foreign film or it uses subtitles, but it's ultimately worth it in the end. I think there's some really beautiful themes in here that are so precious. It looks at the idea of life and death and what you do while you live. It's an emotional ride and oddly, a very relatable one at that. \n\nThe actors were also fantastic in this film. For me, I didn't recognize any of them but they all really carried their own weight. Each one brought a powerfully grounded performance and each of them got their moments to shine at one point or another. \n\nIn the end, I highly recommend this film, as I feel like it's flown under the radar in the film community.",
            "review_date": "2019-04-22",
            "source": "rt"
        },
        {
            "content": "A hard to watch, but ultimately life-affirming and uplifting movie, which tells us one more time to value what we have and not to despair in no circumstance. There's always hope and even where there is none you have the power of your thought and imagination.\nA strong movie with incredible cast and powerful performances.",
            "review_date": "2019-04-16",
            "source": "rt"
        },
        {
            "content": "Great movie - depressing and harrowing yet uplifting. \n\nAfter a stroke, Jean-Dominique Bauby is left paralysed from the neck down, unable to speak and blind in one eye.  Then he writes his memoirs.\n\nAmazing true story, very well told by director Julian Schnabel.   Jean-Dominique Bauby's story is quite depressing and his ordeal quite harrowing.  However, it is ultimately quite uplifting, as he overcame his massive physical impediments to connect to the people he loved and to write/dictate his memoirs.\n\nThis could easily have ended up as a dry biopic / docudrama, but thanks to Schnabel's ingenious direction, it isn't.  Schnabel tells the story almost exclusively from Bauby's perspective.  The majority of shots are from Bauby's point-of-view, helping the empathy and engagement enormously.  You can feel what Bauby is going though, and it is far from pleasant.\n\nGreat movie.",
            "review_date": "2018-09-29",
            "source": "rt"
        },
        {
            "content": "Hello, all!  Do you find yourself overly happy about your life?  Been plagued by a bout of cheerfulness you can't stand?  Could you stand to have your mood dropped to something less merry?  Then do I have the movie for you!  I used to think the most depressing, joy stomping movie ever made was the adaptation to Cormac McCarthy's The Road starring Viggo Mortensen.  A new movie holds that spot for me now and it is The Diving Bell and the Butterfly.\n\"The Diving Bell and the Butterfly\" is, first and foremost, an amazingly produced and directed film.  I know nothing of French cinema but I was astounded by the writing, the acting, but most of all the camera work.  For once, the 1st person POV worked in conveying how stifling, frustrating, and claustrophobic it can be to live in a body that does not work but still have your mind intact.  The first 20 minutes alone make this movie impressive.  The actual story is also impressive in that Jean-Dominic Bauby, through sheer force of will and with help, was able to dictate an entire memoir, letter by letter, while suffering from locked-in syndrome.  \nTherefore, the real issue is can the individual viewer handle this movie?  It is not entertaining.  What humor it has comes from Jean-Do's snark at dealing with his situation.  It is not grueling, but it is a heavy movie.  Its verisimilitude will trigger a lot of emotions inside the viewer.  That's what it did for me.  I know a lot of the blurbs for this film say it is uplifting and a triumph of the human spirit.  That triumph is not so much uplifting as it is hard fought for.  YMMV but for me, at the end, I just felt drained.  It is not a movie to just watch casually, even if you like movies with similar subjects.\nSo who is this movie for?  I highly recommend it to people who have friends or family who provide long term care to a loved one in a situation similar to Jean-Do Bauby's.  I think many caregivers become invisible, sucked into the lives of those they care for.  I also think those afflicted like Jean-Do also become objects; this movie allows us to see they are not.  The movie shows how much these people go through.  The main emotion one feels after watching this movie is empathy.  I think the world could definitely use more of that because I don't really think one understands this world unless one has been in this world.  Still, this is a difficult movie to sit through.",
            "review_date": "2018-06-06",
            "source": "rt"
        },
        {
            "content": "A couple of weeks ago I saw a presentation about consciousness that discussed \"locked in syndrome\" (a terrifying experience in which people are fully paralyzed yet fully conscious); the speaker mentioned this film based on a book dictated by a person with locked in syndrome using only eye blinks.  So, I thought the film was going to be a documentary and that it was bound to be depressing.  To my astonishment, director Julian Schnabel instead used actors to dramatize the book, told primarily with subjective camera shots from the one non-paralysed eye of Jean-Do Bauby, former editor of Elle magazine, played by Mathieu Amalric.  We follow Bauby's journey and we hear his internal monologue as he realises he is paralyzed and as he slowly comes to terms with his plight.  We marvel at the team of health professionals who find a way to communicate with him and his drive to document his experience in a book.  The relationships with his ex-girlfriend (Emmanuelle Seigner), mother of his three children, and his current girlfriend, who is afraid to visit, as well as his 92-year-old father (Max von Sydow) and other friends are now filled with heightened emotions.  Schnabel keeps things impressionistic and humanistic, showing Bauby's fantasies, his memories, his regrets.  The film is almost experimental at times.  You can't help but feel empathy...and horror; it makes you want to throw yourself into life and experience it to the fullest.  Let's do it.",
            "review_date": "2018-03-29",
            "source": "rt"
        },
        {
            "content": "This is a really moving movie - if you're not moved or made upset by this then I'm not sure you're human! One reason I had to stop watching this and only continue watching a long while later was because it was so upsetting. It is a very good film though. I listened to the audio book many years previously which I rated really highly. I rate the film too, but prefer the book although they are both good for different reasons. The film often focuses on Dominic's one working eye, whose pupil is the only part of his body he can move and therefore communicate with since he has locked in syndrome. It is also filmed as if from his point of view, too, which works. You can really feel his emotions. In the book he comes across as more inspiring. I've read elsewhere that the film portrays him in a more negative light than the book he 'wrote', letter by letter via blinking. He died just a few days after his book, which the filmed was inspired by, being published.",
            "review_date": "2017-08-07",
            "source": "rt"
        },
        {
            "content": "Interesting but understandably slow.",
            "review_date": "2017-06-04",
            "source": "rt"
        },
        {
            "content": "A good story, fascinatingly told with some great camera work.",
            "review_date": "2017-03-11",
            "source": "rt"
        },
        {
            "content": "Most boring movie ever made. worst director.",
            "review_date": "2016-12-17",
            "source": "rt"
        },
        {
            "content": "A charismatic performance from Mathieu Amalric, deft direction, gorgeous cinematography and a brilliant script make the Diving Bell and the Butterfly a near perfect film.",
            "review_date": "2016-11-27",
            "source": "rt"
        },
        {
            "content": "There is much in this film that reminds me of Leo Tolstoy's \"The Death of Ivan Ilyich\" and it is every bit as moving and profound.",
            "review_date": "2016-10-28",
            "source": "rt"
        },
        {
            "content": "Quintessential French movie. The director's inventiveness succeeds  in bringing a fairly static book to the screen. I feared the subjective camerawork, the voice-over narration and the jumping backwards in time - techniques often fraught with danger - would spoil it, but the director lets no difficulty get in his way.\nOther reviewers have pointed out the film has taken liberties with the true story, especially in the treatment of Bauby's girlfriend.",
            "review_date": "2016-10-07",
            "source": "rt"
        },
        {
            "content": "This movie was outstanding!! The acting, music, special effects... really made me think... And, it was based on a true story.",
            "review_date": "2016-10-04",
            "source": "rt"
        },
        {
            "content": "Understated performances in this true life story, which is everyone's fear, to be trapped in their own body. Very moving. Very inspiring.",
            "review_date": "2016-09-26",
            "source": "rt"
        },
        {
            "content": "A friend's recommendation, based on true experiences of Jean Dominic Bauby, former editor of Elle Magazine. A very poignant and powerful film, brilliant cinematography and cast. I'd definitely highly recommend this film to anyone",
            "review_date": "2016-09-14",
            "source": "rt"
        },
        {
            "content": "Because it is filmed with impressive compassion and technique from director Julian Schnabel, The Diving Bell and the Butterfly is a powerful and absorbing experience on the struggle to overcome tragedies.",
            "review_date": "2016-05-29",
            "source": "rt"
        },
        {
            "content": "Going above and beyond the traditional biopic, \"The Diving Bell and the Butterfly\" is a painfully heart-aching reflection on memories and human desire.",
            "review_date": "2016-04-28",
            "source": "rt"
        },
        {
            "content": "One of the most appropriately shot films I've seen. There's nothing flashy, and every frame is deliberate while simultaneously being profound.",
            "review_date": "2016-03-25",
            "source": "rt"
        },
        {
            "content": "Stunning and devastating, this second feature in my stop-feeling-sorry-for-yourself film festival, is extremely well done. Much of it is shot from the POV of our \"locked in\" narrator to great effect. Every tear it got out of me was earned.",
            "review_date": "2016-01-29",
            "source": "rt"
        },
        {
            "content": "An enchanting biopic with heroic visuals brought to life by Janusz Kaminski.",
            "review_date": "2016-01-24",
            "source": "rt"
        },
        {
            "content": "A true story, the best kinda movie.  Interesting note:  It's entirely in French with English subtitles, but that's a unique experience when a considerable amount of the dialog is spelled out one letter at a time.  At one point the word \"Merci\" is spelled out, and you clearly hear the M...E...R..., but what appears at the bottom of the screen is T...H...A..., spelling out \"thanks\".",
            "review_date": "2015-12-29",
            "source": "rt"
        },
        {
            "content": "The first half hour is shot almost completely from Bauby's POV and it's disturbing and uncomfortable to watch. It perfectly sets up his struggle for the rest of the film. Then the next half hour he goes through self reflection and becomes a better person because of it... and then there were about 40 minutes still left of the movie.\n\nThe first hour and twenty minutes felt very satisfying, but the movie then seemed to be out of material as the rest of the movie relies too much on expressionist flashbacks that don't really blend well with the human drama happening in his hospital room. It feels oddly paced, since I was full of emotions about an hour in, and then the movie just keeps trying too hard to hammer it home in the last third of the movie. He was a very sympathetic character for most of the movie, but because it seemed like a script that relied on \"tugging the heartstrings\" it fills the last act with unnecessary scenes to garner more sympathy. It's kind of self defeating and reaches a point where I stopped caring and just waited for him to die already, as opposed to hoping he might pull out somehow.\n\nThere's also a lack of development for the other characters, namely the woman who helps Bauby write his book. I was actually intrigued by her story even more, since it would take a lot of patience and determination to do what she did. However, the movie kind of glosses over her, using her more as a prop than developing her character further. I understand it's about Bauby and his struggle, but the movie feels a bit one dimensional when he's the only character with depth.\n\nI've heard that it's pretty accurate and close to the book, so I guess it can be forgiven if a lot of this stuff is glossed over in the book and the filmmakers wanted to stay true to the material. But it didn't quite make the most compelling end product, despite a wonderful first hour.",
            "review_date": "2015-12-13",
            "source": "rt"
        },
        {
            "content": "I picked up this film, not previously familiar with it, from the shelves of the library. It was a gift to the library from a citizen. Somehow, I want to thank this nameless citizen for gifting this film to the library. Although I did not especially enjoy the film, I'm glad I was able to see the story of Jean-Dominic Bauby's life.",
            "review_date": "2015-10-16",
            "source": "rt"
        },
        {
            "content": "Of course a rather depressing movie, but what this makes it worth watching is the pretty consistent view through the eye(s) of the main character who has locked-in syndrome.",
            "review_date": "2015-08-28",
            "source": "rt"
        },
        {
            "content": "Entrancing cinematography and screenplay too poetic to be forgotten.",
            "review_date": "2015-08-22",
            "source": "rt"
        },
        {
            "content": "This is such a unique movie, with the beginning seen through the eyes of the main character. Based on a true story and brilliantly shot, this poignant French film is one that the viewer won't forget. 1001",
            "review_date": "2015-06-17",
            "source": "rt"
        },
        {
            "content": "It's touching, rhythmical, amazingly hilarious, and most significantly a fitting tribute to an incredible story. Recommended.",
            "review_date": "2015-05-26",
            "source": "rt"
        },
        {
            "content": "Very, very, very interesting movie!!!",
            "review_date": "2015-05-23",
            "source": "rt"
        },
        {
            "content": "Elokuva perustuu kirjaan, jonka on sanellut ranskalaisen Elle-lehden entinen päätoimittaja räpyttelemällä vasenta silmäluomeaan. Kirjassaan mies kertoo elämästään ennen sairastumistaan sekä elämästään täysin halvaantuneessa kehossaan. Kirja oli ehkä himpun verran parempi kuin elokuva... (Suom. Perhonen lasikuvussa)",
            "review_date": "2015-05-11",
            "source": "rt"
        },
        {
            "content": "May not be easy to watch, but it's a usual treat of a foreign film with style and being a small ride made by the cinematography that director Julian Schnabel done his probable best work with ambition of faithfulness. (B+)\n\n(Full review coming soon)",
            "review_date": "2015-05-09",
            "source": "rt"
        },
        {
            "content": "It beautifully depicts the infinite possibility of a human's life. The way it presents makes me feel I'm in the narrator's mind and fully understand what he feels. I was moved by the great endeavor of him, as well as the people around him. It just demonstrates how can a human achieve something magnificent despite all the obstacles and difficulties he's faced with.",
            "review_date": "2015-04-07",
            "source": "rt"
        },
        {
            "content": "This is the incredible story of a man who communicated using only one eyelid. Brillantly done. The symbolism of his \"locked in syndrome\" is wonderfully depicted. This is a heavy movie but inspiring. This man lost everything overnight and was still able to overcome. everyone can learn something from this film.",
            "review_date": "2015-03-20",
            "source": "rt"
        },
        {
            "content": "Holy Hard-to-Watch, Batman! The Diving Bell and the Butterfly is a film based on the true story of a man who suffers a massive stroke which results in him having locked-in syndrome. This is the condition where a person is completely mentally aware but loses all ability to move or communicate. All he can control is one eye. Naturally this is going to be difficult to watch, but it is accentuated even more when we spend large portions of the movie looking from the main character's point of view. So we are subjected to the same uncomfortable feeling of being locked-in with one view and only seeing things if they happen to pass within his vision. It's actually staged really brilliantly, and we are allowed to hear Jean-Do's thoughts just enough so we can sympathize with his ordeal. Mathieu Amalric has the unenviable task of trying to emote without being able to move a muscle, yet somehow I really do feel it all coming from that one eye.\n\nI absolutely love the parade of nurses, friends, and family that interact with Jean-Do. The acting is so convincing that you would think they are really dealing with the frustration of communicating with someone who can't talk back. My favorite is Henriette who devotes herself wholeheartedly to helping him communicate again. Her exchange with him, particularly when he's still feeling sorry for himself, is one of the most heartfelt moments of the movie. The other scene, which had tears streaming down my face from start to finish, was the phone conversation Jean-Do has with his father played by Max von Sydow. I have just come to naturally expect this kind of stellar acting from von Sydow, but he is masterful here. The Diving Bell and the Butterfly is definitely an emotional film. It doesn't feel particularly manipulative either, because these are simply real situations as they would play out. It's hard to nail down a rating, though. It was well-made, and it definitely touched me, but I can't imagine I will want to watch it again any time soon. Yet I can recommend you watch it, because it is inspiring how much Jean-Do does with his life despite what is wrong with him. If you're looking for a good cry, The Diving Bell and the Butterfly is the film for you.",
            "review_date": "2014-12-04",
            "source": "rt"
        },
        {
            "content": "I wanna see it again!  It's been years...",
            "review_date": "2014-11-22",
            "source": "rt"
        },
        {
            "content": "Beautifully made film",
            "review_date": "2014-11-15",
            "source": "rt"
        },
        {
            "content": "The astonishing true-life story of Jean-Dominic Bauby -- a man who held the world in his palm, lost everything to sudden paralysis at 43 years old, and somehow found the strength to rebound",
            "review_date": "2014-11-05",
            "source": "rt"
        },
        {
            "content": "In \"The Diving Bell And The Butterfly,\" the pairing of Julian Schnabel's clever directorial skills and Mathieu Amalric's stellar acting chops results in a truly memorable and brave film with rich thematic threads.",
            "review_date": "2014-11-05",
            "source": "rt"
        },
        {
            "content": "This is the most boring movie ever made. The Pompous director deserves a felony conviction for this most boring movie. What ever you think of the guy who wrote a book, his story is wasted with bad direction.",
            "review_date": "2014-09-23",
            "source": "rt"
        },
        {
            "content": "A really sad but also a inspirational story with great performances...",
            "review_date": "2014-09-15",
            "source": "rt"
        },
        {
            "content": "\"I decided to stop pitying myself. Other than my eye, two things aren't paralyzed, my imagination and my memory.\"\n\nJulian Schnabel's French film, The Diving Bell and the Butterfly, is a powerful and emotional film about a man suffering from locked-in syndrome due to a stroke. Despite having his mental faculties intact, he is almost completely paralyzed and unable to communicate with the outside world. The once successful magazine editor is now living as a prisoner of his own body. The only muscle he is capable of moving is his left eye and with the help of a therapist he manages to communicate by blinking his eye. Mathieu Amalric gives a powerful performance as Jean-Dominique Bauby, and most of the film takes place from his point of view. Schnabel brilliantly and effectively uses camera angles to give the audience a glimpse of what this person's claustrophobic world was like. From the very opening scene we are hooked and drawn to Jean-Do's new world as he's trapped in his body. It is a very emotional film based on the autobiography written by Bauby himself who managed to write the book with the help of his therapist through the use of a communication system they developed. The sole fact that this man was able to write a book in the condition he was in, is reason enough for me to want to read his book or see a movie based on his life. It takes a lot of courage to open up the way Jean-Do did, and I think it is one of the main reasons why this film worked so well for audiences across the globe. It says a lot about how powerless we are against these illnesses, but at the same time we can also share Jean-Do's approach of learning to deal with his disability and facing the obstacles with optimism. He realized that despite being physically disabled he still had his mental faculties and was able to break those boundaries with the power of his imagination. I am also certain that this element is what caught director Schnabel's attention and what pushed him to make this film. He tells the story with such class that despite the emotional moments you never feel he was trying to be manipulative or force the audience into feeling a certain way. The performances in this film are also outstanding, making this an even more engaging movie. I also loved the beautiful imagery that Schnabel used, turning the film into a poem at times. \n\nThe Diving Bell and the Butterfly was a personal film for me considering that my father is going through a slightly similar experience as the character in this film. He suffered a stroke four years ago and hasn't been able to speak since. The right side of his body was paralyzed, but with help from therapy he has been able to walk again. Despite not being able to speak he understands everything and communicates with us through signs and facial expressions. The brave way in which he has managed to face his illness by always being in good spirits and not letting the disease get the best of him is a constant reminder for me of how much our attitude influences the way we approach life. He could be feeling sorry for himself, or he can stay positive and continue to improve with therapy in a similar way that Jean-Do did with his locked in syndrome. Having your mental capabilities intact is a major force considering you can escape those limitations in your mind and let your imagination fly. In a way, it was a turning point for Jean-Do when he realized this and Schnabel managed to capture those moments really well on camera. The scenes he shares with his family members are among my favorite in the film. I loved the scene in which he's in the beach with his ex-wife and kids. It is such an emotional scene but at the same time it felt authentic and real. The scenes with his father, played by Max von Sydow, are also extremely powerful and effective. You rarely see a biopic like this one, and Schnabel deserves all the credit for making an original and moving picture.",
            "review_date": "2014-09-08",
            "source": "rt"
        },
        {
            "content": "\"I decided to stop pitying myself. Other than my eye, two things aren't paralyzed, my imagination and my memory.\"\n\nJulian Schnabel's French film, The Diving Bell and the Butterfly, is a powerful and emotional film about a man suffering from locked-in syndrome due to a stroke. Despite having his mental faculties intact, he is almost completely paralyzed and unable to communicate with the outside world. The once successful magazine editor is now living as a prisoner of his own body. The only muscle he is capable of moving is his left eye and with the help of a therapist he manages to communicate by blinking his eye. Mathieu Amalric gives a powerful performance as Jean-Dominique Bauby, and most of the film takes place from his point of view. Schnabel brilliantly and effectively uses camera angles to give the audience a glimpse of what this person's claustrophobic world was like. From the very opening scene we are hooked and drawn to Jean-Do's new world as he's trapped in his body. It is a very emotional film based on the autobiography written by Bauby himself who managed to write the book with the help of his therapist through the use of a communication system they developed. The sole fact that this man was able to write a book in the condition he was in, is reason enough for me to want to read his book or see a movie based on his life. It takes a lot of courage to open up the way Jean-Do did, and I think it is one of the main reasons why this film worked so well for audiences across the globe. It says a lot about how powerless we are against these illnesses, but at the same time we can also share Jean-Do's approach of learning to deal with his disability and facing the obstacles with optimism. He realized that despite being physically disabled he still had his mental faculties and was able to break those boundaries with the power of his imagination. I am also certain that this element is what caught director Schnabel's attention and what pushed him to make this film. He tells the story with such class that despite the emotional moments you never feel he was trying to be manipulative or force the audience into feeling a certain way. The performances in this film are also outstanding, making this an even more engaging movie. I also loved the beautiful imagery that Schnabel used, turning the film into a poem at times. \n\nThe Diving Bell and the Butterfly was a personal film for me considering that my father is going through a slightly similar experience as the character in this film. He suffered a stroke four years ago and hasn't been able to speak since. The right side of his body was paralyzed, but with help from therapy he has been able to walk again. Despite not being able to speak he understands everything and communicates with us through signs and facial expressions. The brave way in which he has managed to face his illness by always being in good spirits and not letting the disease get the best of him is a constant reminder for me of how much our attitude influences the way we approach life. He could be feeling sorry for himself, or he can stay positive and continue to improve with therapy in a similar way that Jean-Do did with his locked in syndrome. Having your mental capabilities intact is a major force considering you can escape those limitations in your mind and let your imagination fly. In a way, it was a turning point for Jean-Do when he realized this and Schnabel managed to capture those moments really well on camera. The scenes he shares with his family members are among my favorite in the film. I loved the scene in which he's in the beach with his ex-wife and kids. It is such an emotional scene but at the same time it felt authentic and real. The scenes with his father, played by Max von Sydow, are also extremely powerful and effective. You rarely see a biopic like this one, and Schnabel deserves all the credit for making an original and moving picture.",
            "review_date": "2014-09-08",
            "source": "rt"
        },
        {
            "content": "Really saddening yet inspirational film beautifully filmed and directed.",
            "review_date": "2014-07-28",
            "source": "rt"
        },
        {
            "content": "Such a touching & beautiful film. Life is short, & sometimes horribly cruel",
            "review_date": "2014-07-22",
            "source": "rt"
        },
        {
            "content": "A biopic that could have been grim and melodramatic but is anything but; Le Scaphandre et le Papillon is a gorgeous, lush kaleidoscope of images and terrific acting, a masterfully directed tour de force of point of view and fall from grace.",
            "review_date": "2014-05-25",
            "source": "rt"
        },
        {
            "content": "A visceral tour-de-force of a biopic that embraces the full spectrum of senses about a fashion designer that strokes out in the prime of his life, creating a physical prison for the suddenly humble soul within.",
            "review_date": "2014-04-21",
            "source": "rt"
        },
        {
            "content": "A magnificent film not just a stunt, which be easy enough to think at a very shallow level.",
            "review_date": "2014-03-25",
            "source": "rt"
        },
        {
            "content": "It's a truly beautiful picture and wonderful experience from start to finish.",
            "review_date": "2014-03-21",
            "source": "rt"
        },
        {
            "content": "The worlds of sentimental, true-story cinema and experimental film-making come together to create a moving tribute to a man whose imagination kept him alive",
            "review_date": "2014-03-20",
            "source": "rt"
        },
        {
            "content": "Sempre bom lembrar de obras primas como essa.",
            "review_date": "2014-03-17",
            "source": "rt"
        },
        {
            "content": "Incredibly well directed and acted, just not very appealing or entertaining. However, seeing life from Jean's point of view is very interesting.",
            "review_date": "2014-03-02",
            "source": "rt"
        },
        {
            "content": "This movie reminds you how much blessed you are .",
            "review_date": "2014-02-14",
            "source": "rt"
        },
        {
            "content": "A heartfelt biographical drama that sincerely move you.",
            "review_date": "2014-02-11",
            "source": "rt"
        },
        {
            "content": "This movie is the definition of what we call \"Life affirming\"! Unforgettable filmmaking! This should have won best picture in 2007!",
            "review_date": "2014-02-10",
            "source": "rt"
        },
        {
            "content": "A different experience.",
            "review_date": "2014-01-27",
            "source": "rt"
        },
        {
            "content": "Meh. Overrated. Slow without redeeming qualities.",
            "review_date": "2013-12-25",
            "source": "rt"
        },
        {
            "content": "One of the most beautiful and amazing films I've ever seen.",
            "review_date": "2013-11-26",
            "source": "rt"
        },
        {
            "content": "most emotionally intriguing movie I have ever seen. Get a \"never let me go\" vibe from the movie at the end, where it was quite depressing but one of the most beautiful films you will see. you won't mind reading the subtitles, trust me.",
            "review_date": "2013-11-25",
            "source": "rt"
        },
        {
            "content": "Great cinematography and score to complement an incredible story.",
            "review_date": "2013-11-08",
            "source": "rt"
        },
        {
            "content": "This such an interesting, unique film. It's such a clever idea to gradually have Jean-Dominique's face revealed. At first all we see is what he is seeing through one eye. And then we get to see him from a third-person's point of view. I felt his frustration as he was unable to express himself, for example when somebody turned the TV off when he was watching a football match. I cannot speak more highly of this amazing drama, which is based on a true story.",
            "review_date": "2013-11-08",
            "source": "rt"
        },
        {
            "content": "Very moving story that we were fortune to \"know\" about it...shared with us by Jean-Do. It's a man's point of view which is not too \"teary-eyed\"...more to the matter of fact... A well-known man who was suffered a paralysis event and then wrote  a book with just using his \"left eye\" with blinks ... can you image the time, frustration to do that :( See this movie and be amazed...",
            "review_date": "2013-11-03",
            "source": "rt"
        },
        {
            "content": "This movie looks awesome",
            "review_date": "2013-10-20",
            "source": "rt"
        },
        {
            "content": "Indeed, the film itself is descriptive rather than emotional. It is a good story, anyway.\n(I shall read the book.)",
            "review_date": "2013-10-20",
            "source": "rt"
        },
        {
            "content": "A man trapped in a place worse than hell, worse than death.  Yet he is able to reach us from beyond.  It is a wonderful rendition of the original and equally lyrical book.  One must live well, live instead of just being alive, to be worthy of life itself.",
            "review_date": "2013-10-17",
            "source": "rt"
        },
        {
            "content": "Beautiful cinematography and acting fuels this wonderful and emotional film. A cinematic masterpiece!",
            "review_date": "2013-10-16",
            "source": "rt"
        },
        {
            "content": "#7\nJulian Schnabel's direction, Mathieu Amalric's acting and Charles Trenet's voice in \"La Mer\" playing in the background. \nLe Scaphandre et le Papillon is beauty itself in it's finest form.\nEmotional and moving, Jean Dominique Bauby's inspiring and successful story of penning down his memoir by communicating through the sole functioning muscle in his body, his left eye, with the help of an aide after he is left fully paralyzed after suffering from a massive stroke. Jean-Dominique Bauby describes himself as both  \" The Diving Bell\", as he is trapped in his motionless flesh and also as \" The Butterfly\", the only part in his body which is not paralyzed other than his eye, his imagination and his memory.\nLe Scaphandre et le Papillon is a touching account of the days Jean-Dominique spent in the hospital, pitying himself for his pathetic condition and eventually rising up to successfully writing his memoirs.\nJulian Schnabel's direction is marvellous. Showing us the story through Bauby's left eye, Schnabel has also taken the liberty to disrupt the continuous shots with slight variations depicting the slight movement of Bauby's eyes. Schnabel's work is undoubtedly astounding. Bravo!\nRonald Harwood, was successful in adapting Bauby's own work, the narrative style was  rivetting and beautiful. \nMathieu Amalric executed the difficult role with near perfection. Playing both roles of Bauby, before and after his paralysis, Amalric was just awesome in his performance.\n\nLe Scaphandre et le Papillon  is powerful, elegant and emotionally moving.",
            "review_date": "2013-10-13",
            "source": "rt"
        },
        {
            "content": "Based on one of the best books I've read in recent years, The Diving Bell & The Butterfly is an excellent adaptation of a story that I thought would struggle to make transition to the silver screen. \nIt's the story of fashion journalist Jean-Dominique Bauby, who awakens from a coma paralysed from head-to-toe and only able to move his left eyelid. With the help of a speech therapist, he uses his left eye as his only ways of communication and uses this unique method to dictate his biography (the book that this movie is based on)\nBrilliantly directed and photographed mostly from a first person perspective, it's a sombre and dramatic story of a man trapped inside a shell, unable to escape.\nFantastic performances from the cast. A classic of French cinema and a beautiful, touching film. Try and read the book first.",
            "review_date": "2013-09-23",
            "source": "rt"
        },
        {
            "content": "Muito bom o jeito que ele usa a subjetiva.",
            "review_date": "2013-09-22",
            "source": "rt"
        },
        {
            "content": "This movie breaks a few conventions, and despite the subject matter being essentially not filmable, it makes it a stunning cinematic experience.",
            "review_date": "2013-09-15",
            "source": "rt"
        },
        {
            "content": "A unique, touching experience made effective by its clever use of editing and cinematography. The only bad thing I can say about it is the slightly abrupt ending (but maybe this is because I up late trying to stay awake).",
            "review_date": "2013-09-07",
            "source": "rt"
        },
        {
            "content": "Gentle, patient, compassionate, and stunning. Another great example of why I love foreign movies.",
            "review_date": "2013-08-27",
            "source": "rt"
        },
        {
            "content": "Stunning visual quality to this melancholically compelling story of a middle-ages stroke victim left with \"locked in\" syndrome and how he overcomes his affliction to write a book about his experiences. Not easy to watch, but very worthwhile.",
            "review_date": "2013-08-14",
            "source": "rt"
        },
        {
            "content": "1993's Schindler's List Is My Fifth Favorite Film Of All Time.",
            "review_date": "2013-08-11",
            "source": "rt"
        },
        {
            "content": "Yet another great french film starring the man who seems to be in every decent modern french film, Mathieu Amalric, as a paralysed man gradulally telling us his story, often through his eye(s), a style probably influencing Gaspar Noe's Enter the Void. One of the most touching films I've seen but also pretty funny in places too.",
            "review_date": "2013-08-08",
            "source": "rt"
        },
        {
            "content": "Heart wrenching and warming all at the same time... fabulous movie and soundtrack.",
            "review_date": "2013-08-06",
            "source": "rt"
        },
        {
            "content": "The Diving Bell And The Butterfly is a true narrative on and of French author, journalist, editor Jean-Dominique Bauby who wrote a book of same title with his left eye. A triumph of the persevering human spirit over a seemingly impossible challenge. A convincing offering of a perspective through brilliance in cinematography and direction. Life-affirming. Life-changing. Accomplished.",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "Ranks on my list of movies I would gladly recommend to anybody, regardless of age or sex. This adaptation of Bauby's bestseller adds a beatifically surreal layer to the disquieting scenario of being 'locked-in' to your body without any means of communicating but for one motion... blinking... as if your entire existence were reduced to nothing more than a morse signal released from a lone diving bell, drifting aimlessly for eternity... *ahem* Anyway, while there are moments of stark bleakness, Schnabel amazingly keeps the mood from dropping into a sluggish nightmare of serious lonnnnnnng silences and 'dumb doctor' slapstick by lackadaisically inserting the existential ideas of 'endurance' and 'corporeality' into a vivid, stupefyingly series of vinettes that transcend the nature of most \"biopics\" and turn into an original recreation of a rare story that longs to be told. Also, Almaric is mystifyingly good as Bauby (not to mention.. almost all the females in this movie are fashionably French and have those Naomi Watt-esque eyes that could revive any man from the depths of despair). 5/5 Did I mention there's a bevy of French babes in this movie? WINNING",
            "review_date": "2013-07-25",
            "source": "rt"
        },
        {
            "content": "I know it has been critisted by close friends of the real man whose story it is based on.I thought the movie was great. I especially liked how it was filmed.",
            "review_date": "2013-07-23",
            "source": "rt"
        },
        {
            "content": "incredibly moving and inspiring. \nmakes you identify with the main character on such a strong and personal level that it's hard to bring yourself back to reality during the first few minutes after the film. overflowed with beauty, sadness and love",
            "review_date": "2013-07-21",
            "source": "rt"
        },
        {
            "content": "Schnabel entrega seu melhor trabalho na direção, com um belo roteiro de Harwood e um Mathieu Amalric simplesmente perfeito no papel central.",
            "review_date": "2013-07-10",
            "source": "rt"
        },
        {
            "content": "la pelicula muestra la desesperación de un hombre que atrapado por sus enfermedad, tiene que lidiar con los errores de su pasado  y la realidad del presente, sin duda una película para analizar nuestra manera de comportarnos y entender nuestro manejo en la vida",
            "review_date": "2013-06-22",
            "source": "rt"
        },
        {
            "content": "With Schnabel in the direction, Kaminsky in the cinematography and Harwood in the screenplay made of this an magnificent film with extreme technical ambitions and outstanding narrative structure.\n\nLe scaphandre et le papillon is one of the greatest movies of all time with a wonderful story that reflects the human existencialism and force of the spirit in such a breathtaking way, the shots are magical with some never seen before scenes. There is some melodrama but is very subtle, focusing more on the inside of Jean-Do than the exterior of the character. The poems, the music, the editing, the screenplay, the acting, the cinematography and of course the direction are flawless.",
            "review_date": "2013-05-30",
            "source": "rt"
        },
        {
            "content": "A truly beautiful film that lets you see the world through another man's eyes as he is sitting in a hospital with locked in syndrome. Julian Schnabel should have won Best Director for this film because the film is a flood of emotions, you can feel everything that Jean Dominique Bauby felt as he was going through such an ordeal. This film is exactly like Jean Do's autobiography word for word. The Cinematography in this film lets you see everything that Jean Do imagined. I really loved this film when I first saw it and it deserves high apraise and an honor to be named one of the greatest films of all time.",
            "review_date": "2013-05-26",
            "source": "rt"
        },
        {
            "content": "\"Le Scaphandre et le Papillon\" is the reason we watch movies. It is about the Jean-Dominic-Baby's life after his stroke which paralyzed his body completely except for his left eye. He blinked 200, 000 times to write the novel that Julian Schnabel gloriously adapts. The actors are so good that it feels like a documentary especially Mathieu Amalric and Emmanuelle Seigner.  The idea to make it a POV movie is genius and is executed by Janus Kaminski with elements of beauty and reality. Its not depressing but more like a subtle message of hope. The score and soundtrack is miraculously well suited. People argue that it is melodramatic,but I argue that all the characters are too real for the film to be melodramatic. Few films feel like poems, but  \"Le Scaphandre et le Papillon\" is a true gem in modern cinema.",
            "review_date": "2013-05-22",
            "source": "rt"
        },
        {
            "content": "With art-house films, there are always two options on your opinion on it: 1) it was boring but well-made; 2) it was artistic but it went nowhere-- possibly \"Le Scaphandre et le Papillon\" is more groundbreaking because it's as unconventional as an art-house movie should be, but is so easily absorbing that it moves you by the end.  It's as if Jean-Luc Godard and François Truffaut made a film together, because the beauty is all there, and so is the story.\n\tJean-Dominique Bauby (Mathieu Amalric) is a high-powered editor for \"Elle\" magazine who finds his world shattered when, out of the blue, he has a stroke that paralyzes his entire body.  His mind is still in perfect condition, so basically he's in a \"prison\".  At first he has a cynical outlook on everything that's happening, but when he learns to communicate just by using his eyes, he decides to put his new skill to test by \"writing\" a memoir, with the help of a nurse (Anne Consigny).\n\t\"Le Scaphandre et le Papillon\" is a film experience unlike any other.  It's claustrophobic, scary, and strange beyond belief, at least for the first half.  But it should be.  We don't really watch the film as much as live it, as we see the world through Bauby's eyes.  It's uncomfortable, but fascinating; most of us luckily won't get the chance to face paralyzation, and it's here.  Experimentation like this really shouldn't work, but it remains to be artistic and unique throughout.  \n\tAs Bauby becomes more well-acquainted with his handicap, the film opens up.  The cameras rid of the first-person view and the aura goes from pessimistic to optimistic.  Whether or not it's symbolism, it comes across in a way that surprisingly isn't jarring.\n\tJulian Schnabel doesn't direct with any hint of pretentiousness.  It instantly appears that he's trying to create a world of empathy.  Though it's an adaptation of the memoir it's based on, it doesn't feel like one.  He's brave in how he shapes every scene, and it pays off.\n\tBauby is of course, a character that should be more unlikable; he cheated on the loyal woman (Emmanuelle Seigner) he can call the mother of his children for a narcissistic woman, he loves his kids but doesn't see that they need a family to truly be happy, and he's played by Amalric, who plays bad guys so well.  But because of the way he handles his condition, he instantly becomes a hero.  The fact that he can see the humor in his downward spiral gives him respect, and that's where the empathy really ties together.\n\tWhat if we had an American version of the film instead? Most likely it wouldn't be filmed in the same way and its main character would be a dime a dozen.  It would throw away the memoir that it's based on and instead make it as sweet as sugar.  Bauby would end up completely recovering and all the women would be played by a Kate Hudson type, all bidding for an Oscar nomination.  What's so refreshing and so \"un-Hollywood\" about this film is that it gives us a realistic look at a total nightmare, and doesn't shy away from the hardships going on.\n\t\"Le Scaphandre et le Papillon\" is an excellent film that grips you from beginning to end.  It's great any way you look at it.",
            "review_date": "2013-05-02",
            "source": "rt"
        },
        {
            "content": "I didn't think they could make a good movie of this book.  Boy was I wrong.  You can't get much lower in life than Jean-Do's end of life experience.  His low makes anyone else's life higher.",
            "review_date": "2013-05-01",
            "source": "rt"
        },
        {
            "content": "Excelente pelÃ­cula!",
            "review_date": "2013-04-30",
            "source": "rt"
        },
        {
            "content": "Amazing and moving film. Most of the film is from the point of view of a paralyzed man with locked-in syndrome. This condition although unimaginable, helps viewers connect with the man, Jean-Do Bauby, and his regrets.",
            "review_date": "2013-04-20",
            "source": "rt"
        },
        {
            "content": "If I could give it 10 out of 5 stars, I would. A beautiful, beautiful , masterpiece.",
            "review_date": "2013-03-29",
            "source": "rt"
        },
        {
            "content": "One of the most stunning emotional knockouts recorded in cinematic history concerning an editor (Mathieu Amalric) who suffers a massive stroke, but remains determined to write his memoirs of his experiences through communicating with the only part of his body that isn't paralyzed, one of his eyes, to an aide. What director Julian Schnabel has constructed is an unnerving, extremely personal masterpiece in struggling to overcome an affliction, and the self-doubts, guilt, anger, and fleeting hope one encounters along the way. The acting is very good, although that is not what is most impressive about the film, which is how it is told through Amalric's character's perspective, showing just how much of a struggle something like this can be. While it is relentlessly sad, it is powerful and incredibly moving all the way through. This is a movie that should be a must-see for anyone who knows someone dealing with a stroke or some other kind of physical ailment. It does a flawless job capturing the emotional cycle and inner-thoughts of someone who deals with it, somehow, someway.",
            "review_date": "2013-03-24",
            "source": "rt"
        },
        {
            "content": "This is a unique and very different film. Based on the book of the same name, this is the true story of Jean-Dominique Bauby, editor of Elle in France, who suffers a massive stroke that leaves him almost totally paralyzed. The only muscle he can control is in his left eyelid--he can blink that eye but do nothing else. And yet that blinking eye allowed him to dictate the story of his stroke and how he recovered. In fact, the book he dictated is the one the movie is based on.\n\nBauby's therapist and friends would recite letters of the alphabet from most frequent to least. When they reached the letter Bauby wanted, he'd blink. Slowly, letter by letter, he would dictate his wishes and his book. Over time, his \"interpreters\" got very good at telling where he was going, which saved some time.\n\nTo recreate Bauby's experience, the movie starts off from his point of view as he awakens from the post-stroke coma he was in. His vision is blurry. We can hear his thoughts, but no one else can. When Bauby blinks to signal to his doctors, the camera blinks too. This is a very effective way at putting us inside Bauby's head. Recognizing that it could quickly become claustrophobic, however, the film eventually shows us the \"outside\" view as well, but still remains firmly rooted in Bauby's experience. In addition to what he sees, we also see what he imagines, from sumptuous meals to scenes of terrible isolation to calving icebergs.  It is a wholly remarkable experience of a man who's pre-stroke life is revealed for its shallowness and self-centredness. He does his best to make up for it by re-connecting with people whom he'd let slip away.\n\nThe movie is in French, with English sub-titles available. This led to one odd quirk: when Bauby is spelling out words, the sub-titled letters don't match the spoken dialogue, because, of course, the French word he is spelling isn't spelled the same way in English. For example, his interpreter spells out \"m\", \"e\", \"r\", and knows that the word is \"merci\". Meanwhile, the sub-titles are showing \"t\", \"h\", and \"a\" for \"thanks\". Otherwise, the sub-titles seemed to be an excellent match for the dialogue. The acting is superb from everyone, including Mathieu Amalric as Bauby, who had to hold his body absolutely still, including a twisted mouth, while letting that one eye roam and blink. The cinematography is gorgeous, in a slightly washed-out palette that might symbolize Bauby's sensitivity to light. It's not clear there is a universal lesson here, but certainly this tale of how one man responded to a rare and frightening fate is nothing short of heroic.",
            "review_date": "2013-03-11",
            "source": "rt"
        },
        {
            "content": "The Diving Bell and the Butterfly is deep performance piece. The flashbacks function to add to its human elements and even the idea to have a screenplay primarily for a fully paralysed character is a revelation of modern day foreign films. It is only the truth Out the story that appeals to the heart.",
            "review_date": "2013-03-08",
            "source": "rt"
        },
        {
            "content": "I've always wanted to see a movie filmed from the first person view and it was a very pleasant surprise that this was the first that I saw. I didn't know it was like that before entering this movie. Also the acting was all very, very well done and this film was very, very enjoyable, sad too.",
            "review_date": "2013-03-07",
            "source": "rt"
        },
        {
            "content": "The life of someone who goes through so much but comes out on top is amazing. Not the most entertaining movie but sure interesting. What a trial.",
            "review_date": "2013-02-28",
            "source": "rt"
        },
        {
            "content": "From acclaimed director Julian Schnabel, and the screenwriter of \"The Pianist\", comes a remarkable and inspring story about the power of imagination. The astonishing true-life story of Jean-Dominic Bauby -- a man who held the world in his palm, lost everything to sudden paralysis at 43 years old, and somehow found the strength to rebound -- first touched the world in Bauby's best-selling autobiography \"The Diving Bell and the Butterfly.\" Bauby was able to compose a memoir through a painstaking process of blinking when an assistant spoke the alphabet aloud is nothing short of miraculous. The book was published in 1997, just three days before Bauby died at age forty-five.\r\n\r\nA descent from a wealthy and congenial playboy and the editor of French Elle, to a bed-bound, hospitalized stroke victim with an inactive brain stem that made it impossible for him to speak or move a muscle of his body. This prison, as it were, became a kind of \"diving bell\" for Bauby -- one with no means of escape. With the editor's mind unaffected, his only solace lay in the \"butterfly\" of his seemingly depthless fantasies and memories. Because of Bauby's physical restriction, he only possessed one channel for communication with the outside world: ocular activity. By moving his eyes and blinking, he not only began to interact again with the world around him, but -- astonishingly -- authored the said memoir via a code used to signify specific letters of the alphabet. \r\n\r\nSchnabel begins the film with a subjective camera, so that we see the world through Bauby's eyes as he wakes up to find himself in a hospital. We soon become familiar with his limited field of vision and aware that he can't move his head - thus things keep happening outside the frame. We hear Bauby's thoughts, and knowing what he wants to say helps us to feel just a hint of his frustration at not being able to communicate. It takes some time for Bauby to realize that his imagination can help ease his misery, and that's when the fantasy sequences come. But Schnabel uses them sparingly and with care. He never pretends that imagination can offer anything more than temporary consolation, and so beautiful sequences of a magical hospital corridor, with miracle cures or a leaping Nijinsky, land with a thud into reality. \"The New Yorker\" calls the \"The Diving Bell and the Butterfly\" -\"nothing less than the rebirth of cinema. It is a marvel.",
            "review_date": "2013-02-25",
            "source": "rt"
        },
        {
            "content": "A visual extravaganza with a lot of moving and funny events such as comments and remarks, A touching drama but for me it was more a visual quest show with beautiful artform and much more photographer movie then a pure tear and weep flick...",
            "review_date": "2013-02-25",
            "source": "rt"
        },
        {
            "content": "A film that plays out like a poem.",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "The touching movies is one of the best I have ever watched.",
            "review_date": "2013-02-17",
            "source": "rt"
        },
        {
            "content": "A tapestry to image and sound.  The most beautiful picture of the year.  Schnabel morphs the audience into Jean-Do's conscience and imagination that left me appreciating life.  It also left me emotionally drained but it's a subject that we've seen before with a story that doesn't have too much more to add.  The story didn't absorb me as much as the visuals and music did, but it is worth seeing for the inspiring direction and its uplifting tone.",
            "review_date": "2013-02-11",
            "source": "rt"
        },
        {
            "content": "This is the most completely satisfying film I have ever seen.  It is, at once, a horrifying, harrowing film, and an uplifting and heart-warming one as well.  Captivating first-person cinematography rewrites the book on how to execute such a method of portrayal (you have to see the scene where J.D. Bauby's right eye is being sewn shut--you feel like it is your own eye), and the script is written with a wit and subtlety that is refreshing and impactful without going over the top; the cast is absolutely stunning (literally every one of them is beautiful in one way or another), and the screenplay makes jumps between time-periods clear and cohesive without detracting from the flow or style of the film.\r\n\r\nTypically, great books make great movies, and the generally-accepted thinking is that the books are usually better than the movies made from them...this movie turns conventional thinking on its ear, and offers a sound rebuttal to that thinking with an authenticity that is difficult to challenge.",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "Just watched this today and really enjoyed it...I must admit however, although I was impressed by the films emotive qualities, I did think the film faded out somewhat, much like his life I suppose...",
            "review_date": "2013-02-10",
            "source": "rt"
        }
    ]
}