{
    "rating": 7.7,
    "release_date": "2007-03-02",
    "num_reviews": 510,
    "genres": [
        "Crime",
        "Drama",
        "Mystery&thriller"
    ],
    "summary": "In the late 1960s and 1970s, fear grips the city of San Francisco as a serial killer called Zodiac stalks its residents. Investigators (Mark Ruffalo, Anthony Edwards) and reporters (Jake Gyllenhaal, Robert Downey Jr.) become obsessed with learning the killer's identity and bringing him to justice. Meanwhile, Zodiac claims victim after victim and taunts the authorities with cryptic messages, cyphers and menacing phone calls.",
    "reviews": [
        {
            "content": "Great in all aspects, simple as that.",
            "review_date": "2023-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great film. It is intense, interesting and factually accurate. The acting is solid all-round, especially from John Carroll Lynch as the creepy \"Leigh\". If you enjoy true crime and dark thrillers, then this film is worth watching!",
            "review_date": "2023-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe a controversial take, but this is my favorite Fincher movie. I have no notes. It looks beautiful, the actors are killer, and the story is tight and maintains an ambiguity and is mystery that—and this is great—remains satisfying even though it's never fulfilled. This movie is about real life and the Zodiac Killer was never caught. But unlike stories like The Colorado Kid, where the ambiguity drags the whole thing down, this movie revels in it, and it's excellent.",
            "review_date": "2023-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a really great movie! The cast is absolutely amazing and the mystery of the Zodiac killer is incredible. The only thing that keeps me from rating this 5 stars is the pacing; sometimes it gets a little repetitive, particularly nearing the end. Otherwise, super good movie!",
            "review_date": "2023-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Masterpiece thriller filmmaking",
            "review_date": "2023-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Throwback to days when movies had a story.",
            "review_date": "2023-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is literally my favorite movie! \nIt's so compelling, and it's soooo accurate to the real life story.\nThe few parts that are fictional are still really good and solid. I'm now very fascinated by the Zodiac Killer. I know it's weird to say, but the Zodiac killer is my favorite serial killer or he's the serial killer I'm most fascinated by(if you prefer it being said that way). \nThis movie is part of the reason why I have a Bachelor's degree in Criminal Justice.",
            "review_date": "2023-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterclass in direction, writing and acting, David Fincher's Zodiac is a raw and hugely compelling film about one of the USA's most infamous unsolved case that has perfect pace, tone, editing and tension making it possibly his best film to date.",
            "review_date": "2023-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the type of film that grows on you.  Not as much suspense, etc. as I expected, so I felt is was an average film the first time I saw it.  But it's a well crafted and honest historical film.  Great acting and character development. Long, but interesting.",
            "review_date": "2023-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well-made movie, but almost too well made. It was freaky and felt so real. Really good job, but not my cup of tea.",
            "review_date": "2022-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This motion picture, Zodiac, is based on a non-fiction book written by Robert Graysmith, who is the main leading actor portrayed by Jake Gyllenhaal...\n\nScreen writer by James Vanderbilt, also a co-producer as well...\n\nIt's directed by David Fincher, with an excellent strong casting, say, Mark Ruffalo and\nRobert Downey Jr....",
            "review_date": "2022-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Set in the San Francisco area over, primarily, a ten-year period in the 1970s, David Fincher's Zodiac documents the investigation into the ruthless serial killer who taunted both the police and the media while conducting his horrific murder spree.  Showing the chain of events from the perspectives of police investigator Dave Toschi (Mark Ruffalo) and San Francisco Chronicle cartoonist Robert Graysmith (Jake Gyllenhaal), Zodiac is a gripping and gritty thriller that somehow manages to hold the interest of the viewer for the entirety of its considerable 160-minute running time, an intense character study of those in pursuit of the killer.  While some viewers may be frustrated by the resolution, or lack thereof, Fincher wisely sticks to the facts available, refusing to succumb to the temptation of drawing his own conclusions.",
            "review_date": "2022-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic movie.  Great characters, holds to the facts, unlike other movies (Argo, you know who you are).  Bit longish, but still excellent.",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing film about the inner workings of the Zodiac case that, despite its lengthy runtime, never feels like it's spinning its wheels. Gyllenhaal, Ruffalo, and Downey provide stellar performances. The film builds an amazing atmosphere of suspense and intrigue that's effective even if you already know about the events in the story.\nPerhaps one of the greatest films of all time.",
            "review_date": "2022-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The day \"Clerks\" came out, a friend of mine from work told me it was supposed to be hilarious & got great reviews, but that it was only playing at a small theater in town, where they also had Plays, like College Plays etc. So from beginning to end we both cried with laughter. Since then I still watch it & it's an all-time great for me. Then came part 2. It was cool seeing the previous films actors, who all had aged & all, once again doing their thing(s). But it couldn't compare to the 1st. Now we come to this 'mess.' Some things should just be left alone, this being a perfect example. So disappointing, with so many other directions they could have gone, in my Mind at least. Wasn't even happy to see them together again after the first 15 minutes or so. Any1 who hasn't seen the original would surely walk out of any theater this plays in, imo. A total FAIL, in just about every way-again, imho. Peace out, & may \"Clerks\" retire forthwith, PLEASE! 2 stars b/c I still love the 1st One, & without that there'd be no, uh, diss.",
            "review_date": "2022-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid for the first two-thirds, this film is ultimately weakened by that fact that the Zodiac killer was never conclusively identified, at least not at the time this movie was made.  This leaves the ending anticlimactic.  Still, it's worth a watch for the strong performances and David Fincher's signature touch.",
            "review_date": "2022-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Fincher's Zodiac is a good look at the infamous, unsolved serial killer case. The Zodiac killings of the 1960's has still never been solved so you understand going to be unresolved. The film follows reporters and police in the San Francisco area as the case unfolds in their attempt to identify the killer. Fincher does a great job in painting a picture of the times-something he does very well. He also does a great job of painting a phot of the disconnect between police departments at the time, which seriously impacted investigations like this and the Golden State Killer case-solved in the 21st Century. The case precedes the work of the FBI in his great series, Mindhunter. The acting by Mark Ruffalo, Jake Gyllenhall, Robert Downey Jr, and others is really very good. The movie is good, and interesting but frustrating by nature.",
            "review_date": "2022-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good thriller, fine cast",
            "review_date": "2022-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A phenomenal movie and even better if you don't do research beforehand.",
            "review_date": "2022-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable re-enactment of the true life story of the real Zodiac killer story\nThe 3 lead performances are amazing and the greatest compliment I can pay it is even at a lengthy run time, it is never boring",
            "review_date": "2022-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riveting movie which seemed to do its best to focus on the essentials of a story that could have easily been a series (possibly would be nowadays). Totally believeable reenactment of true crimes. Zodiac didn't actually murder so many people, but became impactful because of the mystery that somehow exists until today - some answers one never has in life. Though Le Figaro wrote, \"No audacity, no invention, nothing but a plot which intrigues without captivating, disturbs without terrifying, interests without exciting,\" it's on many a Top 10 list.",
            "review_date": "2022-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super interesting story that is filmed very well. The movie is action filled with not a moment to relax, the storyline is a bit confusing but this is a very intricate case so it's understandable",
            "review_date": "2022-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good development of story and also nice players. The plot took a lot turns but the mystery finally solved.",
            "review_date": "2022-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An engrossing and fascinating docudrama. The film is a sprawling, deliberate affair, but is highly dense--there's so much to savor over here there's no way you can pass it up. Destined to be a great classic",
            "review_date": "2022-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The suspense is chilling. I know that this is based on real events, but they could have cut some scenes to give it a better run time.",
            "review_date": "2022-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie had me uninterested in it for most of the time, although I did like it as it started to wrap up and they got closer to zeroing in on the suspect. I enjoyed the more suspenseful scenes too and the casting choices were well made! I love Robert Downey Jr., Mark Ruffolo, and Jake Gyllenhaal so I can't fully dislike this movie. I've still seen much better from Fincher.",
            "review_date": "2022-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my top 5 films. Jake Gyllenhaal is superb, and so is every actor. Music-score, directing, and camera work is genius. This film always leaves you guessing about the outcome of the plot. Simply incredible.",
            "review_date": "2022-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great script and look the camera shots.",
            "review_date": "2022-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac was a chilling film with an amazing cast. The suspense was really brought out of the screen to the audience through the superb acting and excellent pacing. I am glad they did not end the movie on a resolved note, as similar to the real Zodiac killer (at the time of the movie's release).",
            "review_date": "2022-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Real life stories do not always have happy endings, some mysteries remain unsolved for decades, which is exactly what I loved about this film. A movie that is rather disguised as a story about the ambiguous serial killer whereas it is story about obsession, mania, and being powerless to resist an urge to uncover the biggest mystery of the decade. David Fincher's commitment to keeping the film's consistent accuracy to the real-life crimes with each and every detail is to be applauded with respect, with only portraying scenes of the crimes that actually had surviving eye witnesses, rather than depicting crime scenes out of his imagination of the ones that had no survivors to tell how the actual crimes went down. Casting Robert Downey Jr. as Paul Avery hit the spot, Mark Ruffalo did an amazing job, and Jake Gyllenhaal simply put out the best performance of his career.",
            "review_date": "2022-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good and the story was so fascinating. My only negative take away is the film is too long.",
            "review_date": "2022-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is by far one of my favourite movies of all time. The plot is based on true events and stays on that road delivering one of the best Crime thriller movies of all time",
            "review_date": "2022-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a good movie.",
            "review_date": "2022-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that managed to tell the story of a real case that had no solution. The Zodiac is a big mystery to this day, but they still managed to tell the investigation process of this case and how the US police pursued this terrible serial killer. Story, characters, environment, music, all at the perfect level of a crime thriller.",
            "review_date": "2022-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pacing is amazing and I really do enjoy every\nbit of the movie. There are no dead spots in\nthis film. David Fincher did amazing and it's\nmy all time favorite movie from a directorial\nstandpoint. It's just so interesting how it's\nalmost like you play a part in the movie\ntrying to figure it out with the characters.",
            "review_date": "2022-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kept me interested throughout the whole movie.",
            "review_date": "2022-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie gives me a very strong feeling, I like how Jake acts in this movie, he and the zodiac is what keeps you going the most when watching the movie, I found a great balcony of the script all the suspense involved.",
            "review_date": "2022-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "[⭐️86%]\n\nDavid Fincher manages to portray the mystery of the Zodiac Killer on screen whilst also showing the amount of effort that went into trying to determine their identity with little success. The way it is executed feels as if those viewing are sitting there attempting to solve the mystery amongst these characters. The killings are recreated in some scenes however they are pushed to the back of your mind as the film continues delivering genius perspectives, deduction and tension.\n\nJake Gyllenhaal, Mark Ruffalo and Robert Downey Jr. are all brilliant in showcasing the toll this killer has had on these real life people's work and personal lives. Not only that, but another aspect which creates this real feeling is how it is edited, the fades to black when changing scene really does feel like it is a documentary of sorts going through the information and evidence established.\n\nZodiac (2007) tells one of the worlds most intriguing stories through the eyes of a fantastic director.",
            "review_date": "2022-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good! It will have you constantly trying to piece the puzzle together.",
            "review_date": "2022-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Zodiac\" follows the police and journalists investigation into the real life murderer known as  The Zodiac. Director David Fincher uses the books of newspaper cartoonist turned investigator Robert Greysmith ( Jake Gillenhaal )to tell the tale of one of America's most infamous serial killers.\n\nWhat makes the Zodiac such a mysterious character is how he used coded messages sent to newspapers to give clues to not only his identity but also confirming his actions and activities. Since the first confirmed Zodiac killing in 1968,  despite many coded letters and a number of suspects, no arrest was ever made and still today the identity of The Zodiac remains a mystery. \n\nThe film follows the police investigation by Dave Toschi ( Mark Ruffalo ) and Bill Armstrong ( Anthony Edwards ) with assistance from journalist Paul Avery ( Robert Downey Jr. ) and cartoonist Robert Greysmith. Fincher's focus is on the main characters as they Persue the killer,  digging  deeper into the mystery and hitting brick walls. John Carroll Lynch gives a genuinely chilling performance as Arthur Leigh Allen, who at one point becomes a prime suspect in the investigation.\n\nFinchers attention to period detail and recreation of the initial killings along with the focus on the main characters makes for a quiet , slow paced, unsettling movie experience. There is really no conclusion however, as the legacy of the horror continues to present day. The Zodiac vanished and was never brought to Justice. This was despite so much evidence, coded confessions and a thorough investigation spanning many years. What is clear from the film is the disappointment and frustration experienced by of all the main characters who never got to experience the identity of The Zodiac killer being revealed.",
            "review_date": "2022-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very watchable and a wonderful portrayal of 70's America. The films a long one but doesn't drag at all. A must see if you enjoy a wordy, intelligent crime thriller!",
            "review_date": "2022-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Today I watched \"Zodiac,\" I believe for the, no joke, 7th or 8th time. The movie covers the dense timeline of the \"Zodiac Killer's\" many crimes and the police investigation that followed, in an attempt to identify and eventually prosecute him. The main character of the movie is Robert Graysmith, played by Jake Gyllenhall, a cartoonist for the San Francisco Chronicle, who became engaged with the investigation due to the Zodiac Killer's contacting of several San Francisco-based newspapers. For a while, investigators thought that the Zodiac would be found, and they identified some promising suspects. However, the trail eventually ran cold, due to the (presumed) end of the Zodiac's spree and bureaucratic roadblocks among the police and the government, and it seemed that everybody had just moved on. Graysmith, however, did not, and was willing to put his familial relationships and his career on the line in order to write and publish a book about the Zodiac. What I enjoy most about this movie is that while its creators were tasked with the challenge of having to cover a vast number of years and a multitude of information within a traditional ~2.5-hour span, it felt to me that not a single detail went overlooked, and not a single (important) event was left out. Additionally, I felt that the movie's creators and actors did a fantastic job of capturing the essence of life in America, specifically San Francisco, in the 1960s-70s, from the set and costume design and the hair and makeup, to how the actors interacted with their environment and each other. I feel transported back in time every time I watch this movie. I'm also incredibly impressed with the range of emotions each of the actors is able to convey within the movie, especially since I've seen several of the cast members in less \"serious\" roles, so their performance in \"Zodiac\" is beyond impressive to me. These characteristics contribute to the unmatched \"rewatchability\" this movie holds. If you are in the mood to watch a movie, I would absolutely recommend that you go watch \"Zodiac.\"",
            "review_date": "2022-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dialogue heavy, but still keeps you on the edge of your seat. Gyllenhaal puts on yet another stellar performance.\nI felt like there was about twenty minutes that could've been cut out that didn't add to the film.",
            "review_date": "2022-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All in all, I did enjoy this film! I am a big fan of investigative films, and this one was 100% that. Viewers should be warned to watch when fully awake; the pace can seem a bit slow at times. However, those moments are chocked full of stellar acting and smart dialogue. I was most interested in learning about the happenings of the Zodiac Killer and the search for him. Being born in 1999 ruined any chance that I could have been privy to any original news coverage, so this was an information gathering viewing for me as well. All in all, the performances were good and I was curious to see the culmination of the main characters time and effort. Perhaps this is an unpopular opinion, but my favorite performance was that of John Carroll Lynch! He never fails to make me feel uneasy on screen when playing a (suspected) killer.",
            "review_date": "2021-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The films drags in places but it is carried by its strong acting performances.",
            "review_date": "2021-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Just because you can't prove it doesn't mean it isn't true.\"\n\nA while ago I attempted to watch this movie, but I dropped it halfway. This time I finished it, and it was a long ride. The pacing was not slow, but there was so much to cover that the movie felt like a miniseries. It wasn't a bad thing tho, because the first and third act were amazing.\n\nThe first act was an Iron Man and Hulk show, and the third was another superb showcase of Jake. All three actors reflected the obsession that many people had about the mysterious case back then, but Jake's character was definitely the most investing because he spiraled down very quickly. \n\nThe characters here wouldn't be interesting if the story wasn't great to begin with. The script worked wonder at not only draw audiences in, but make them feel the drag and tiredness that the characters went through.\n\nOne of the problems was Jake's character, who was introduced early on but didn't do anything for the first 2 acts. \n\nOverall, even though it felt long, Zodiac was an excellent thriller. 9/10",
            "review_date": "2021-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is an incredibly thrilling experience from start to finish. The film does a lot of things very well, with flaws few and far between. First off, this film has a star studded cast with the likes of Mark Ruffalo, Robert Downey Jr, and Jake Gyllenhall, with Jake giving what may be his best lead performance in a film ever. The movie is mainly dialogue, with a few murder scenes by the zodiac killer thrown in the mix. These scenes are not bad by any means, but they're pretty basic and dull, and some of them even get cut off before you see what happens. The other major flaw to this movie in my opinion is the handling of Downey Jr's character. I really liked where they were going with the character in the first couple acts of the film. However, the character gets a little bit left behind and we do not get to see much of an end to his character arc, some people might be okay with it but it wasn't quite enough for me. Besides those two flaws the film does not have any other flaws that stick out enough to affect the score I'm giving this film. This film does a great job at keeping you on the edge of your seat, waiting to see what might happen next, or who the new suspect will be. The thing that surprised me the most about the movie was how suspenseful it could be, as I could feel the stress building up in me, fearing for what could happen next. The greatest strength this film possesses is its ability to keep you entertained for so long with so much dialogue. It never gets stale at all through the course of the movie, and that's a rare occurrence in modern films, as I find a very large amount of movies like to rely on flashy action and comedy to keep viewers entertained. The characters also work so well together and bounce off of each others' performances, to really bring this amazing film to life. Overall, this movie is definitely a right time, right place kind of film, that you won't be watching on a regular basis unless you're a hardcore fan of the crime genre. This is a great film to put on during a movie date with someone special, or even a movie night with your friends or family, but is definitely best watched as a solo flick so you can really get a grip on the story. Easy 4/5, and would've been a 5 with more care towards RDJ's character.",
            "review_date": "2021-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite films, love how obsession is characterized with each of the portrayals of the people that are being adapted",
            "review_date": "2021-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shitty remake of Dirty Harry. Hahaha! Just kidding.  Zodiac is great!  In addition to its meticulous historical accuracy, the film puts you through the horror of the Zodiac victims and down the rabbit hole of obsession over trying to unravel the mystery.  Every bit of that journey is made engaging by solid acting and Fincher's camera subtly placing your eyes in the view point of characters.  Another nice touch is the use of music, both songs of the era and an original score.",
            "review_date": "2021-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A two-and-a-half hour movie shouldn't fizzle at the end, by which time it's pretty clear that Zodiac really doesn't know what, or whose, story it wants to tell. Lots of terrific set-pieces but they really don't fall into place.",
            "review_date": "2021-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie started off feeling somewhat drag. I expected the experience to be a boring one, but enjoyed the storytelling more and more. The acting was top-notch. Although I found myself becoming lost in the web unfolding in movie, I was still able to pay attention to keep up learning with our characters.",
            "review_date": "2021-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The All the President’s Men of serial killer investigations! Great!",
            "review_date": "2021-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At some point, it's less about the serial killer than the existential search for truth and meaning, even if it means sacrificing your personal life. A pleasure to watch great acting from beginning to end.",
            "review_date": "2021-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An astonishing and exhaustive take on the greatest unsolved serial killer case of the 20th century. The first half introduces us to the events of the Zodiac chronologically and contains a faster pace, while the second half focuses mainly on the details of the case and the clues left behind. One of the best thrillers ever made and easily one of Fincher's absolute best.",
            "review_date": "2021-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great cast tackling one of the craziest stories. Set up for a great movie and it delivers.",
            "review_date": "2021-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Fincher's expertly crafted thriller surrounding the mystery of the Zodiac killer was one of 2007's finest. Jake Gyllenhaal is excellent as Robert Graysmith, a cartoonist on the trail of the serial killer, alongside reporter Paul Avery (Robert Downey Jr) and police inspector David Toschi (Mark Ruffalo). Zodiac provides an exhaustive effort in research (Fincher used 10,000 pages of documents and interviewed survivors) and the films slow pacing only adds to the lingering degree of menace and tension. Brilliant.",
            "review_date": "2021-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Long winding cryptic serial killer investigation drama, the plot feels so tired from audience view can be improve for better chorology. The ending quiet exciting & good & you should just skip & start at 2 hour haha...",
            "review_date": "2021-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best true crime movies ever made and one the great cinematic studies in obsession made so far this century. This is the high water mark of David Fincher's career thus far.",
            "review_date": "2021-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At a certain time in the first half of the movie, I was finding that \"Zodiac\" couldn't preserve the thrilling pace it has set. Indeed, there was suspense and then the suspense was cut by months and years. That was annoying. But, otherwise, the rest of the film is wonderful. There is still  time skipping but a certain continuity in the intrigue. Also, the directing style of Fincher is remarkable. He is probably my favorite director and I know why. It reminded me a little of Mindhunter at some point. Jake Gyllhennal (?), Downey Jr and Ruffalo are all fantastic in their role and the casting director couldn't have done a better job.",
            "review_date": "2021-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I hoped for so much but then there was nothing. Like what do you expect from a movie about an unsolved murder spree but still…",
            "review_date": "2021-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is a movie about a loose serial killer who might still be living freely. Performances by Mark Ruffalo, Robert Downey Jr, and Jake Gyllenhaal were absolutely brilliant and David Fincher once again directed to the heart.",
            "review_date": "2021-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is much like the investigation of the Zodiac murders, steadily losing motivation, ending nowhere and with basically nothing more than loose ends. The acting is not bad at all, neither is the cinematography, but the adventure loses energy as it goes, and seems to lack dramaturgical edges, however much Jake Gyllenhall's character runs around in his obsession to solve the mystery. But Graysmith is at least presented seriously in this deeply grave plot, while other characters, like Robert Downey jr's reporter, who appears like he's some kind of parody act, obviously overacting, as if this is to underline the lack of focus and cooperation within investigators and media. But does that really work? The same also goes for some of the police characters, except from Mark Ruffalo portaying Inspector David Toschi. Together with Chloë Sevigny he probably does the best acting performance, keeping the tension at a certain level. It's sometimes hard to find a good balance and true intention in David Fincher's direction, and it's likely a logic to ending up with a series of questions due to the nature of the plot, which actually lacks a conclusion. But as a drama, it might feel like having been gazing into a dark void that only has been growing more empty. It's perhaps a great point with it, but that's all there is.",
            "review_date": "2021-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie, however the pacing is slow at times and I was often confused during some of the scenes, however that may be more my problem than the movie.",
            "review_date": "2021-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "2.29 hours of my life I will never get back. Too too long with a screen note at the end to finalize it.",
            "review_date": "2021-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Zodiac\" is the definition of a thriller about a serial killer done right.  Fincher's attention to detail shines in his recreation of California in the seventies.  Despite its lengthy runtime, the film is engaging throughout, with a plethora of plot twists and thrilling scenes.",
            "review_date": "2021-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Somewhat decent, however the runtime is just depressing",
            "review_date": "2021-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac was supposed to be this scary serial killer but he was pathetic, don't even compare yourself to Zaroff you don't have 1% of his creep factor",
            "review_date": "2021-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well-acted and reflective of the frustrating investigations of those most committed to catching the Zodiac Killer. Perhaps its ultimate aimlessness is a flaw, but the film never leaves one questioning the viewing commitment.",
            "review_date": "2021-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The ending made me so mad.",
            "review_date": "2021-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a great cast and understated period setting Zodiac starts by examining the hunt for its title serial killer from a dispassionate procedural perspective and meticulously evolves into an absorbing chronicle of one man's self-destructive obsession to discovery his identity.  The script was adopted from Robert Graysmith's true crime book, which was of dubious accuracy at the time and has since been discredited further.  But Zodiac is less concerned with unmasking the real Zodiac Killer than how the search for him affected the fictionalized people involved in it and tells its story with compelling nuance.",
            "review_date": "2021-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a great cast! Its a great and fascinating mystery",
            "review_date": "2021-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gyllenhaal and Ruffalo do a fine job with this excellent thriller based on the Zodiac Killer. Shoutout to John Carroll Lynch, who seems to be effortlessly brilliant in everything he lends his talents to. Zodiac is long, but the content does the runtime justice. \n\nMovie review #3",
            "review_date": "2021-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just as good as I remembered. A trio of great lead performances might be the highlight, but the film's rich in almost all areas.",
            "review_date": "2021-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really well-made police procedural about a real-life case.",
            "review_date": "2021-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Film. Very well crafted and accurate to real life.",
            "review_date": "2021-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Focuses too much on Graysmith, a Sherlock wannabe who injected himself into the case and has come under suspicion for possibly fabricating details in order to sell his books, such as the insinuation that the Zodiac harassed him on the phone several times. He might've got some hangups, but that doesn't sound like Zodiac's style to me; I doubt Zodiac even knew he existed until Graysmith wrote his first book on the case years later. And Graysmith has been pointing his finger at Arthur Leigh Allen since the start, only to end up being embarrassed when DNA tests did not match Allen. Not really the guy you want to focus on in this case.\n\nThe film tries to recreate the 60's & 70's, but the dialogue doesn't ring true in that respect; the chosen profanity and certain phrases are irritatingly from the new millennium. Annoying little details are thrown in, such as Toschi's obsession with animal crackers, that add nothing to the film. The details of who each person is is not of particular importance in this story; we should only care who the Zodiac and his victims are. History has shown that Dave Toschi, for example, did a lousy job on this case, so detailing his little eccentricities is irrelevant and uninteresting because he was a failure. Some of it is most likely not even accurate, such as his idly watching Belli and later a boardroom of newspaper editors carelessly handle blood-stained pieces of cloth without immediately intervening to protect the evidence. The police techniques and their dialogue feel phony and contrived. The acting is only so-so; competent but somewhat wooden. These people seem like actors acting, rather than involving us in the drama and mystery of the story. Downey Jr. seems to simply be playing himself, for the most part.\n\nAlso the story is told out of sequence, which Fincher seems to think is artful license but comes across as pretentious and confusing for those only moderately familiar with the Zodiac story. Fincher does get credit for revealing the Kathleen Johns story as a probably hoax - but why even take the time to show that scene then, when it could just be alluded to? The movie is too long as is and needed trimming. Graysmith on a date? Come on. How does that have *anything* to do with this legendary case?\n\nIt's a mediocre time passer, not much more. It's already become outdated in some ways as of 2021. The definitive film has yet to be made.",
            "review_date": "2021-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film, I would argue the violent social network.",
            "review_date": "2021-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was like an incomplete documentary but felt really real",
            "review_date": "2020-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolute masterpiece. One of the most thrilling movies I've ever seen.",
            "review_date": "2020-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie. Just a few days ago, my mom and I watched a documentary on the famous Zodiac killer and his victims. It was incredibly interesting so it got me thinking about the film Zodiac that was released this year and lucky enough it was released on DVD today so I rented it. My friend and I just watched it a couple of hours ago and really liked it, especially on how it ended and was over all shot. I thought it was kinda cool how it started off like a documentary type of movie, but then was turning into a thriller that kept you going and guessing, even if you knew the whole story.\n\nIn the small towns of California, there are several brutal murders, eventually going onto San Fransisco. These murders are extremely violent and very random, and every time it happens there is a message or sign that is left by the killer that calls himself the \"Zodiac\". He sends letters to the press on how and where he killed his victims and teases the police that they will never catch him. But Robert, one of the newspaper cartoonist starts to obsess about the killer, who he is and how they can capture him.\n\nWith an all star cast, we had absolutely no problem with acting because it was terrific. Jake and Mark held their own very well. The whole story is very chilling and kept you going. The Zodiac Killer is a case that forever will remain a mystery and it was a great idea for a film, Fincher added a Se7en type of feel to this film. It's so funny how I knew the story and how it ended already, but I was actually just waiting to see what would happen in the next scene. I would highly recommend this film to any thriller fan, I'm sure you'll enjoy it, it's a great one for 2007. 8.7/10",
            "review_date": "2020-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Smooth editing. Great acting. Fantastic Direction.",
            "review_date": "2020-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the only movie that scared me in a particular scene. well told and based on real facts. to be seen",
            "review_date": "2020-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So much to like about this film - the cast - the storytelling - the tone. \nFor a 2.5 hour film, you will not want it to end.\n\nWithout giving it away......the film details all the victims....some living....some dead.",
            "review_date": "2020-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was simply great. I really enjoyed the story and the fact that this was based on reality boggles my mind. This movie is paced a bit inconsistent, but that works for me because it makes it feel more real. It makes sense that at some parts the police was moving a bit quicker in the case and that in some parts they were not getting any clues. Makes sense doesn't it? The acting was incredible, the characters were likable and we understood more and more about the case. We get evidence, clues and we sort of have to figure out who the killer is ourselves. Was it Arthur Leigh Allen? Maybe. We don't know. The movie makes us feel like that. If you like mystery movies, you will love this.",
            "review_date": "2020-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really don't see what's so great about this film. It could have been shorter for starters and certainly Fincher has better works.",
            "review_date": "2020-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A dark movie with hard to watch moments at times. Great visual effects, but above all a great story with many complex elements and levels.",
            "review_date": "2020-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Highly recommend this to people that like thrillers, and mysteries. Watch at your own risk as it has a lot of gruesome moments.",
            "review_date": "2020-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I honestly watched this movie because it was leaving Netflix, and I had a mild interest in it, so I decided to give it a try. Boy, was it fantastic! It wasn't overly graphic, yet it did a perfect job of portraying the dread and suspense of investigation, as well as showing an insane obsession of the main characters with the case to the point of passing on this obsession to you as a viewer.\nNow I'm so excited to check out more work from David Fincher and Jake Gyllenhaal, as well as to read an original novel \"Zodiac\". Overall, excellent movie, 5/5 stars!",
            "review_date": "2020-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rating: A-\n\n\"All in all, Zodiac gains the most generous praise that a film based on a true story can ever receive from me. James Vanderbilt's screenplay convinced me to research everything about the real events as soon as the movie finished, which is undeniably an impactful effect of watching such a well-written, captivating narrative with well-developed, authentic characters. David Fincher's commitment to being as historically accurate as possible is visible on-screen, a remarkable result of a massive preparation that very few filmmakers would even think about performing. With some of the best editing work in the history of cinema, the lengthy runtime flows better than expected, but the amount of information to digest is overwhelming and tiresome, dropping the levels of entertainment, especially during a certain period of the second act. Nevertheless, a phenomenal third act, three outstanding performances from Mark Ruffalo, Robert Downey Jr., and Jake Gyllenhaal, and an emotionally compelling, realistic approach to extreme obsession turn the entire film into one of the best of its genre. Another massive recommendation from this side.\"",
            "review_date": "2020-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film changed how I view the world. The amount of anger but also confusion I felt while watching this movie, while yet also being just blown away by the cinematography, and acting was top notch. The incredible direction of David Fincher is just unmatchable. Near perfect film, very underrated.",
            "review_date": "2020-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can actually feel the obsessive stress of the protagonists as the movie goes on, and there's tremendous entertainment value that is created just from not knowing the truth, which is a hard thing to accomplish in any form of media.",
            "review_date": "2020-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent acting, boring and way too long movie.  No real payoff because the Zodiac killer was never really \"caught\" or charged.  Just ok, thought it was good to watch on Halloween 2020!",
            "review_date": "2020-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is wonderfully elaborate, intense, and intricately written. Led by its characters, dialogue, and evidence as it is revealed, the film does well in carrying out an intriguing story where you never feel secure.",
            "review_date": "2020-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A possibly perfect thriller filled to the brim with impeccable acting, writing, dialogue, directing, mystery, and suspense. A must see",
            "review_date": "2020-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is phenomenal and one of the most accurate movies. The performances by Robert Downey Jr, Jake Gyllenhaal and Mark Ruffalo are great. The suspence and the drama amazes and frightens you.",
            "review_date": "2020-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the best serial killer movies ever!  It builds tension throughout the movie, while rarely showing the actual violence. The acting is top notch, and the story is fascinating.  Some might find this movie to be slow, but I really enjoyed seeing the process of the characters slowly building the tension as they get closer to identifying the killer. If you enjoy movies that actually have some character development and not just beginning to end action, check this one out. It's dark and eerie without being gross.",
            "review_date": "2020-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't mind a long film when it's going somewhere but this is sooooo long without building any suspense or doing anything to make you really care about the characters or the story. The acting is good, some of the cinematography is great and the score works well but it's a missed opportunity. There's an hour of rubbish that could be lost with no adverse impact on the film.",
            "review_date": "2020-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is lengthy and its tone maybe a little too light for its subject: a serial-killer who terrorized the San Francisco Bay Area for several years in the late 1960s and 1970s.\n\nQuirky lead characters help to hold the audience's attention and, eventually, we are led to a conclusion that is satisfactory and believable, but not proven.",
            "review_date": "2020-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh my god. This is a film that I like to call a masterpiece. I loved this film. I loved it so much. I'm not sure if I liked it more than Se7en, but I do like it more than Fight Club and the Curious Case of Benjamin Button. First off, I loved the pacing. The film is 2 hours and a half and it felt like and hour and a half. I went my so fast. And it wasn't just the editing. But it's also the writing, directing, and acting. I love the script. It's an amazing script. I also love the direction. Fincher is always a great director and this is one of the best he's done. And the cast. This isn't just an all star cast. It's somehow higher than that. I also love the cinematography. Some of the overhead shots and nighttime sequences look amazing. It's on Netflix and you should watch it. Now.",
            "review_date": "2020-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "pretty boring ngl skipped half way through lol",
            "review_date": "2020-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is very amazing movie. It is the one of the best serial killer movie. And, also a great thriller movie",
            "review_date": "2020-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is slow-moving at times yet somehow still in a bit of a rush to cram all the facts in (for instance, the investigation's obsessive nature is an interesting side of the movie but never gets to sink in as much as it could). But it's also well-directed, intriguing and boosted by a very good cast. The absence of any redeeming finale, given that Zodiac's identity remains unknown in real life, is arguably its Achilles heel, although the tense Marshall/Vaughn subplot does act in lieu of a crescendo.",
            "review_date": "2020-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A slow film that, at times, peaks into mystery and intrigue. It would, though, have been more interesting to watch a film that lets you see the details of the Zodiac's story, rather than watch Gyllenhaal do it. The film builds a good feeling of the time and the effect of the Zodiac and so it is worth a watch for people interested in the Zodiac story.",
            "review_date": "2020-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film has it all: precise direction, great performances, sharp dialogue, thematically perfect ending and tension to boot. Maybe top 3 Fincher",
            "review_date": "2020-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I revisited this because of the recent serial murder conclusion in California. The grizzly  crimes aside, the acting chemistry in this one is enthralling. Downey and Gyllenhaal in particular. Ruffalo and Edwards are good as well. Great picture.",
            "review_date": "2020-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wish this film had performed better at the box office, but it deserves the faithful following that it has accumulated over the years. Perhaps the best acting in a Fincher film along with a captivating mystery throws you off to the real beautiful theme: obsession leads to destruction.",
            "review_date": "2020-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So, I didn't even know this had come out. Looking at the date, I realize  that I was dealing with a newborn at the time, so its existence completely escaped my awareness. Apparently, this is the same guy who did 'Se7en' and several others. I looked at his list of films, and 'Se7en' is the only one I can watch over and over again. This was one was cool. I felt like it kept jumping, though. It slowed down too much at several spots. I found it hard to maintain interest sometimes. Even though I really like manhunt movies, this manhunt wasn't all that interesting. Maybe, it's the way the movie was organized, or maybe the case just wasn't too interesting of a puzzle for long enough. Either way, this was a one-time watch for me.",
            "review_date": "2020-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love when a nearly three hour movie flies by. Fincher's precision is commendable in wasting no time with filler or superfluous scenes here, and creating an excellent level of suspense that maintains throughout the entire film, while never feeling forced or overwhelming. The casting choices were excellent as well on all levels, which shouldn't be surprising given how Fincher's attention to detail continuously elevates this film.",
            "review_date": "2020-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent story-telling via well known performers like Jake Gyllenhaal and Robert Downey Jr.  Not too violently graphic.",
            "review_date": "2020-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best David Fincher and his most underrated movie.The writing,the score,the costume design,the subtle visual effects,the production design,the performances,the historical accuracy,everything make this movie a must watch.Every time I watch this movie I see have there been any updates in this case,it's that good.It's one of the best murder mystery of all time. 95%",
            "review_date": "2020-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great performances all round and a riveting and compelling plot.",
            "review_date": "2020-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why did he go into the guy's house? I wonder if that really happened. If so, stupid move. (Ps that is not a spoiler- trust me). One annoying thing- I had to watch it with subtitles because I couldn't hear the dialogue through so much of it. Not sure if it was that the background noise was too loud or the actors were muttering, but it was frustrating.",
            "review_date": "2020-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Following a huge amount of information throughout a wide range of years could potentially lead to uneven storytelling, but being incredibly accurate, meticulously directed and helped by three lively performances ZODIAC has to rank among the best thrillers",
            "review_date": "2020-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was such a fun movie! It's got a really long runtime so I expected it to drag on, but it's actually paced quite well and kept my interest throughout. It does a wonderful just of keeping you guessing, and just when you think you've started to figure it out, and twists around and throws you in a new direction. The acting is wonderful and Jake Gyllenhaal and Robert Downey Jr. were perfect for their roles. I'm thankful that it doesn't get bogged down with too much personal drama, so the focus stays mostly on the mystery at hand. Don't let the runtime intimidate you - this movie is intriguing and exciting throughout!",
            "review_date": "2020-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The genius of Fincher once again shines through in this captivating thriller. Scattered with ups and downs of pace and tension, this film captures exactly the pace of a real-life investigation - everything is always changing. The cinematography is a standout in this film and the hidden details of Fincher's genius shine through in almost every aspect of every frame of the film. Coupled with his signature grading and some captivating audio, this film is strong across the board.",
            "review_date": "2020-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Seen this before but always get it mixed up with Summer of Sam(1999) when trying to recall it.  Maybe the most fascinating serial killer case in history, things move quickly as the movie tries to gain it's footing but once it does it gets quite interesting.  I have my own theories regarding serial killers and this one is no different but that doesn't effect my opinion of the movie.\n\n3 of 5",
            "review_date": "2020-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Atmospheric and extremely well acted. This is one of the best hunt for a serial killer films of all time.",
            "review_date": "2020-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An underrated movie that everyone should watch ",
            "review_date": "2020-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this movie is great, because it kind of subverts the genre, but you also know the killer will never get caught which is interesting. What's good is that the performances by the three leads are amazing. They all perfectly showcase how obsession can drive a person to their breaking point. What I also love is that the themes of the movie aren't very powerful, but they are real life things that EVERYONE deals with everyday. Not to mention it is amazingly shot and very well written. Although the movie does have some pacing problems and it kind of jumps in time too much, it's still a great watch. It deserves a 94%.",
            "review_date": "2020-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had first viewed Zodiac a few years back and had I rated it then, it probably would've been in the high-90s — this may be unfair compared to, say, Prisoners (also Fincher) which I first viewed after starting this blog. But hey, sometimes there is magic that comes with first experiencing a film that's absent on all subsequent viewings. This time around, I watched with a more critical eye (and a couple of aquavelvas) and still give the film a (90), a 5-star score. There's a style to a Fincher movie and I felt some of the scene cuts and the color palate were identical to Gone Girl. It also has to be one of the fastest 157 minutes you'll ever watch, switching storylines between Robert Graysmith (Jake Gyllenhaal), Insp. Dave Toschi (Mark Ruffalo), and the Zodiac murders themselves. As the most recognizable unsolved murder outside of Jack the Ripper, probably, the movie wasn't going to draw its own conclusions (at least nothing that isn't in the real Robert Graysmith's book) or create a Tarantino-like alternate history ending, and still keeps you hooked throughout. Gyllenhaal as Graysmith is the cartoonist who slowly pulls at the strings of the killer until he is enveloped in evidence and research, leaving his family broken. John Carroll Lynch as Arthur Leigh Allen, or the Zodiac Killer! (prove me wrong) is calculating and imposing, a perfect fit. Also, need to give credit to Robert Downey Jr. as Paul Avery who rounds out my favorite scene in the bar with Graysmith, empty aquavelva glasses covering the table and snorting cocaine in the booth. Lastly, need to discuss the \"basement scene,\" which during the first viewing is probably the most anxiety-inducing of the film, but after mulling it over (and after listening to the discussion on the LCB podcast), it doesn't really make much sense and is included to put our protag in \"real\" danger. Oh well. Zodiac is not just a must-watch for true crime fans but for pretty much anyone.",
            "review_date": "2020-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "pretty tepid given the star power. Neither a compelling police procederial or psychological study of those pursuing the killer. Works as \"periods\" piece for the Bay Area. Not bad but not much here.",
            "review_date": "2020-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a little rambly and there are quite a few loose ends but that could have been intentional as the killer was never found and convicted. If that was the case, it could have been done more intentionally.  The beginning was quite slow but it did pick up in the second half. This could have done another pass in the editing room or would perhaps do better as a tv show? But yeah, meh, passed the time would be a great way to describe it.",
            "review_date": "2020-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WOW!!! A long movie that you wish to have a bit more at the end!! Another great work by Jake who was perfect at this role!! Only that it is a true story it makes you to stick your eyes at the screen!!",
            "review_date": "2020-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A quiet and anxiety inducing thriller that is an elaborate and careful recreation of haunting real events and definitely deserves more attention.",
            "review_date": "2020-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good. One of Jake Gyllenhaal's best performances in my opinion. The rest was kinda sluggish and boring but good enough to watch and be entertained by. Not a complete waste of time.",
            "review_date": "2020-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac had some great performances but overall it was a slow burn. A typical Stokley, good not great, movie. ",
            "review_date": "2020-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is the movie long? Yes. Does the movie feel long? Absolutely not. This movie is exceptional. Jake Gyllenhaal gives one of the best performances I've ever seen. This isn't so much about the Zodiac killer as it is about the people the Zodiac affected. It's a movie about the obsession to find the truth and why that can become so dangerous. David Fincher's attention to historical accuracy and overall detail should not go unnoticed. You feel like you're living in the 60's and 70's. This my favorite movie of all time and an absolute must watch",
            "review_date": "2020-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is about the infamous unsolved case of the zodiac killer who terrorized Northern California .It wasn't as gruesome as Se7en and features comparatively less violence but has a similar charm to it. This film is dark and unsettling but thrilling nonetheless . David Fincher's direction is absolutely fascinating. Fincher manages to provide an insight into the mind of a serial killer, captivating the audience doing so. It is also utterly realistic and there is a lot of attention to detail. Both Robert Downey Jr and Jake Gyllenhaal are really good. Overall it was really good. I would recommend this to all psychological thriller fans. The film is sure to leave an imprint in your head.",
            "review_date": "2020-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an excellent film that portrays the real life events accurately using a fantastic cast. The acting is top notch and so is the dialogue. The cinematography, soundtrack, and execution of the plot were all well done. My only complaints are that in the middle things noticeably slowed down and there are a lot of time jumps throughout. The pace was acceptable overall (some people will disagree) and unfortunately this type of story requires lots of jumps in time due to the nature of the real events. Well worth a watch if you don't mind long films.",
            "review_date": "2020-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is a film that really takes its time, but does a masterful job of showing how these killings didn't just destroy the lives of the victims and their families, but how the case became a burden to almost everyone involved.",
            "review_date": "2020-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Im not a big David Fincher fan, and this is a film that has nothing good to it, it was very boring for me and the Zodiac killer in my opinion should have beentold in a better way. Robert Downy Jr. was great and he was one of my favorite characters in the movie. Overall the film did not convince me and bored me until it finish. So as that being said, For this film wasting good actors  , wich were 3 of my favorite actors, and for the movie not delivering what the movie poster and the trailer showed you, I give \" Zodiac \" a D-.",
            "review_date": "2020-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was fine.  The basement scene in particular.",
            "review_date": "2020-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "suspenseful, dark, and mysterious. Something very few directors can uphold altogether.",
            "review_date": "2020-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Easily Fincher's best crime-centered film thus far. 'Zodiac' boasts convincing performances from an all-star cast.",
            "review_date": "2020-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fascinating film about the real life investigations to catch the Zodiac killer. What an unbelievable cast! Very enjoyable watch.",
            "review_date": "2020-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's an interesting story and there's a lot of things to cover but damn this movie was long. If you're going to do a 2:40 movie, you better keep people on the edge of their seats. I found myself losing interest in the second half, not because of the lack of story, but just because of the length.",
            "review_date": "2020-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overall good movie. Hard to follow unless you have subtitles on. Robert Downey Jr.’s character seems to disappear 2/3 of the way through and the movie a tad bit too long. ",
            "review_date": "2020-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "zodiac makes us anxious and curious, great movie",
            "review_date": "2020-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is quite simply the most meticulous, engrossing, and well made police procedural film ever!\n\nOkay, that's a bold statement considering the many outstanding police procedural films made over the years. But at least in the last twenty years, I do feel that Zodiac (2007) is the best. Masterfully directed by David Fincher, the film is ultimately about obsession for the truth and how we as viewers see and relate to truth through various mediums including film.\n\nBased on the book of the same title by Robert Graysmith, Zodiac tells the true story of the manhunt for the Zodiac Killer, a serial murderer who terrorized the San Francisco Bay Area during the late 1960s and early 1970s, taunting police with letters, bloodstained clothing, and ciphers mailed to newspapers. The case remains one of the United States' most infamous unsolved crimes. (Wikipedia)\n\nThe story opens with the murders interwoven with scenes of the editorial staff of the San Francisco Chronicle dealing with the received cryptic Zodiac letters. Here we are introduced to lead political cartoonist Robert Graysmith (Jake Gyllenhaal), and crime reporter Paul Avery (Robert Downey Jr.). Following the murder of San Francisco taxicab driver Paul Stine, we are introduced to police inspectors Dave Toschi (Mark Ruffalo) and his partner Bill Armstrong (Anthony Edwards). This mid-section of the film forms the bulk of the police investigation but ultimately leads nowhere as Toschi is not able to find hard physical evidence to incriminate the prime suspect. The final third of the film follows Graysmith as he obsessively tries to tie the circumstantial evidence from three different counties together to find the killer. With all of the main characters, the obsession to find the truth behind the Zodiac's true identity wreaks havoc on their personal and professional lives. What's most fascinating about this film is how director David Fincher is able to pull audiences out of themselves to reveal that we as the public and movie viewers do the same thing, obsessively seeking the truth. All mediums during that time period are explored as we listen to radio callers and view television news broadcasts regarding the Zodiac killer. We also see a barrage of thousands of informants as they all give their interpretation of the truth. Of course it is one of these informants that ultimately leads to the prime suspect, but how we deal with all this information and sift through it, is one of the most mind blowing elements of this film. Perhaps most interesting is how the film is a commentary on how we as audiences view films like this. We too are drawn into the obsession and are frustrated by how we are forced to ignore the obvious \"circumstantial evidence\" due to a lack of physical evidence. Like the real life characters, we are also swayed by our own bias perspective and fears, sometimes forcing the truth because of our desire for completion and resolution. However, the only satisfaction we are able to find is the same satisfaction Graysmith achieves by his 99% identification of the Zodiac's identity. We are reminded that just like in real life, the crimes sometimes go unsolved.\n\nOn a technical level, there is so much to admire about Zodiac like it's brilliant construction, precise historically accurate production design, subdued realistic acting, beautiful cinematography and framing, and dynamic ever changing soundtrack. This is the first mature work of David Fincher and perhaps his masterpiece. There are two things that I specifically appreciate about Zodiac; the pacing of the film and David Fincher's restrained directing.\n\nThe film's deliberate consistent pacing is brilliantly appropriate here. Some critics have described the pacing as \"slow\" and lacking in action. The pacing, rather, is intense and unrelentingly suspenseful. It also is never static. The pace of the film slowly builds in momentum especially in the last hour keeping viewers on the edge of their seats. The pacing also aids in the film's more creepy moments. Cars stalking victims in the middle of the night. Investigators coming uncomfortably close to suspects. All this is made even more frightening when you contemplate that these crimes and events really happened. I also find the atmosphere and pacing in this film to be far more unnerving than any slasher film. \n\nThe second thing that stands out for me is David Fincher's unusually restrained directing. Fincher, known for his over the top graphic violence in many of his other films like Seven (1995) and Fight Club (1999), is quite restrained in Zodiac. This doesn't mean there aren't any violent sequences. The few murders that are depicted are quite shocking and brutal, but none of it is gratuitous or glorifying. In fact, the violence, while brutal, are depicted exactly as it was described by survivors of the Zodiac killer. Fincher has stated that he did not want to inspire the next serial killer in any way. Rather the violence serves in building the tension and adds urgency to the story. That being said, Zodiac has far less violence than any other Fincher thriller. It's far less distracting too. Through the restraint, we can focus on Fincher's remarkable skills as a director, as he sweeps us into this enthralling story and authentic time period.\n\nFor all of these reasons, Zodiac is my favorite police procedural and in my top two David Fincher films.",
            "review_date": "2020-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great cast and gripping story that keeps you engaged and based on real life events",
            "review_date": "2020-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Fincher knocks it out of the park once again. While this isn't quite on the level of his best work, this is a stellar mystery with a dark atmosphere and really good acting up and down the cast.",
            "review_date": "2020-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though the murders shown on-screen are visceral and disturbing, Zodiac doesn't seem as interested in the gore as it is in telling a chilling true story about one of the most infamous cold cases of all time.",
            "review_date": "2020-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Looks nothing like Ted Cruz",
            "review_date": "2020-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a perfect movie. Now roll the typewriter foley....",
            "review_date": "2020-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really enjoyable crime thriller of the mysterious Zodiac killer. Really good writing and acting with historical accuracy, keeping you interested troughout the whole movie. The energetic performance by Jake Gyllenhaal keeps this movie going for me. David Fincher, yet again shining on the serial killer genre.",
            "review_date": "2020-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jake Gyllenhaal is a great actor, and somewhat underutilized throughout. It becomes gripping when he revolves his life around the killer as everything close to him moves further away. After watching I want to believe Zodiac is Arthur but after doing a little research who knows!",
            "review_date": "2020-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed this movie. It had good acting and script. It also did very well representing what really happened. However, I wouldn't go as far as to say it was the best movie I have ever seen.",
            "review_date": "2020-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a favorite of mine, and is the perfect example of when a movie should be long. It is 160 minutes and mostly driven by the dialogue, yet somehow feels quick paced and riveting. Of course, it uses some of the tropes such as people walking and not looking at each other while carrying a conversation to do this, but it does so effectively all the same. It is tense and at times terrifying even though we all at least somewhat know the ending-- something that I believe is very underappreciated when films do it right. It has fabulous acting by Downey, Ruffalo, and Gyllenhaal; even though you know all of these actors so well they are entirely believable as their characters. This film creates a sense of paranoia even when we know absolutely that someone is not the culprit. The editing, done by Angus Wall, really brings Zodiac together into a thrilling and intelligent serial-killer movie.",
            "review_date": "2020-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A little boring in the end, a little too long. But awesome atmosphere and dark vibe, love it.",
            "review_date": "2020-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There isn't a single thing I'd change about this exquisitely entertaining nerve-wracker.",
            "review_date": "2019-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not very good. The protagonists biggest challenge seems to be keeping their jobs.",
            "review_date": "2019-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of FInchers best movies, zodiac is a thrillng captivating true crime story that demonstartes once again Gylenhall is one of the best actors working today and that Ruffalo and RDJ realy can step it up with the right material. The script is near flawless showing us how an obsession can control your life and never focus to much on the victims but just those wokring on the case which allows us as a watcher to feel involved. However during a bloated second act i found my attention wandering but that was soon changed by one of the most riveting third acts ever brought to cinema givng a staisfying ending to a beautifuly and creativly directed film.",
            "review_date": "2019-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "91%. David Fischer movie. One of Chris Ryan's favorite movies of the 21st century. Love a great movie like this that's based on a true story and based in SF. Placed 12th in BBCs ranking of top movies of the 21st century. It covers many years. It has a great need for resolution. It's very talky with not a tone of action but is very engaging.",
            "review_date": "2019-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films of 2007, and of the 2000s. First off, Jake Gyllenhaal's performance is one of the best of his career. The other acting is pretty good too but Jake's is fantastic. Second off, the filmmaking, certain tones, and the fast building of the Transamerica Pyramid Building in San Fransisco, fantastic. Third off, it broke a wall, by putting in \"Who would play me\", and put the",
            "review_date": "2019-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good accurate, no nonsense film about the zodiac murders. No silly plot twists in the end. Good acting. Disciplined film making. If you're interested in the zodiac killings. Give it a watch. Pretty chilling. \n\nZodiac No.3: \"Before I kill you, I'm going to throw your baby out the window.\"",
            "review_date": "2019-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gyllenhaal, Ruffalo, Downey Jr. trying to catch the Zodiac killer = A Great Movie.",
            "review_date": "2019-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am the zodiac killer",
            "review_date": "2019-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is an engrossing, tense crime drama without technological artifice and done in a completely believable, realistic way.  It has a great story, great acting, and great production values that re-create the San Francisco of the 60s and 70s.  Well-done!",
            "review_date": "2019-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit lengthy, but riveting, with a superb cast.",
            "review_date": "2019-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A showstopper of a movie. It is a spine tingling mystery with no positive outcome",
            "review_date": "2019-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love a good crime/drama and based on a true story. Lover of True Crime will enjoy.",
            "review_date": "2019-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So the Zodiac killer isn't officially identified by law enforcement but this film tells you who it was.",
            "review_date": "2019-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie was unneccessarily long with teriible acting from most of the actors, robert downey jr.'s acting was as boring as ever, he always plays every character as he is in real life, sassy, eccentric, mouthy, smart ass. That doesn't qualify as acting, it's just him being himself and speaking the lines. Nothing new. Moreover the movie had a supremely disappointing ending, just a huge crash and burn, the movie was also excessively dark, wanting the viewer to just skip over chunks of scenes. The development was slow and torturous. The progress was painstakingly slow. ",
            "review_date": "2019-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is unnecessarily long and feels extremely stretched. It also had a huge problem with pacing. However the movie has great acting and a great story and I really enjoyed the mystery behind it. However the ending is not satisfying at all.",
            "review_date": "2019-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is a long, obscure and tense thriller about the true story of The Zodiac Killer Case. The movie highlights with a memorable acting, script and direction.  ",
            "review_date": "2019-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Haunting brutal and brilliant. ",
            "review_date": "2019-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "SUPERB VISUAL STORYTELLING, FINCHER'S GENIUS LIES IN THE WAY THE STORY IS SHOT, FROM GREAT CAMERA SEQUENCE'S TO THE MUSIC IN THE BACKDROP, I THOROUGHLY ADVISE PEOPLE WATCH THIS FILM, I WOULDNT BE SURPRISED IF THIS IS USED AS A CASE STUDY FOR FILM SCHOLARS YOU LEARN SO MUCH ABOUT WHAT MAKES A GREAT FILM FROM WATCHING THIS AMAZING PIECE OF WORK  ",
            "review_date": "2019-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of those films that is just perfect. Having only seen the extended edition, it has a perfect pacing to accentuate the film-noir style.  Fincher masterfully recreated several scenes which were based on real-life events.  One of the best films of one of the best currently working filmmakers!",
            "review_date": "2019-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Acting is strong bit the story end in an anticlimax. Obviously it just follows the real story, but ends in anticlimax.",
            "review_date": "2019-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac discards almost all the usual clichés in police procedural mystery films like itself to create a much more interesting and unique true crime thriller. it focuses more on dialogue and character details than on fast-paced action or graphic violence. The lack of graphic detail in the film's portrayal of the Zodiac's crimes creates Lovecraftian-esque intrigue that creates a much more disquieting fear of the unknown, as opposed to the gross-out that drives many other serial killer movies.",
            "review_date": "2019-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'll see any movie David Fincher is involved with and this is probably my favorite of his movies. Other than Mindhunter on Netflix which is a TV show.",
            "review_date": "2019-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hi sorry I didn’t realize you were going to come over ",
            "review_date": "2019-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It eventually succumbs to its overly long run time, but Zodiac is peppered with moments of brilliance.",
            "review_date": "2019-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it is not a perfect film, Zodiac gives an eerie and interesting look into the true events of the Zodiac Killer, while providing great acting on every front.",
            "review_date": "2019-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best serial killer movie ever made! Absolute must-see!!!\n\nGranted, a lot of the information in this movie, along with some of the facts about the real life case are in dispute. The performances from the main cast are superb. The time period was shown beautifully, the soundtrack was fantastic and the eerie essence of the Zodiac Killer was not glorified but gritty and horrifying. ",
            "review_date": "2019-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love true crime thrillers and there are moments of genuine intensity in this movie for sure. But alot of the running time people are talking over the same things, which seemed to drone on and i lost interest several times. With over 2 and a half hours of film, i really think they could have cut some footage out or it might have been better as a tv mini-series. Still, the direction was flawless as was the costume and design. 3/5",
            "review_date": "2019-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was quite commendable for two hours. Then when they try to wrap the story up in the last forty minutes or so, it overall becomes boring. The very first two hours are quite amazing. Performances are solid throughout it, but when they can't figure it out it becomes a slow crawl at the end. I would rate this higher, but you can get this story in a 30 or 45 minute piece on TV shows about it than what's provided here. I still recommend seeing it though.",
            "review_date": "2019-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A slow burning thriller fuelled by anxiety. Zodiac sees Fincher at the top of his game, creating a nail-bitting atmosphere that breathes pure uncertainty; and anchored by a powerhouse ensemble.\nIroh's grade: B-",
            "review_date": "2019-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(Sighs) I can only imagine how much I completely forgot about I actually watch the different version of The Zodiac and that was like when I was a teenager I watched the 2006 version of it but I have not watched the David Fincher version with Jake Gyllenhaal, Mark Ruffalo, and Robert Downey, Jr. Years later I watched it finally and it was actually quite good. It based on the true story America's most notorious serial killer. Zodiac tells the story of the manhunt for the Zodiac Killer, a serial murderer who terrorized the San Francisco Bay Area during the late 1960s and early 1970s, taunting police with letters, bloodstained clothing, and ciphers mailed to newspapers. The case remains one of the United States' most infamous unsolved crimes. Jake Gyllenhaal as Robert Graysmith who is the cartoonist is obsessed with investigating the murders and researching into the Zodiac killings. With a lot of help from his fellow friends, Dave Toschi and Paul Avery played by Mark Ruffalo and Robert Downey, Jr. Okay so as it is the Zodiac investigation goes on throughout the entire movie and when Robert watches Dirty Harry for the first time, in his vision it's really based on the Zodiac killings loosely and then he meets Dave for the first time. Like I said in the couple of seconds the Zodiac investigation goes on throughout and it's gonna take days and months and, hell, even years. With all that said and out of the way, I will say for one thing that I am going to tell you about. I think the ending is crap! There are some scenes nearly at the end is that Robert continues his investigation and  in the next later and after that it just ends abruptly with some disclaimers about how it ends. I don't know if you notices this but it looks like this movie had no ending. Well, I know it's based on a true crime and it is based on the 1986 non-fiction book of the same name by Robert Graysmith played by Jake Gyllenhaal in the film. I just help the fact that it ends so abruptly. So yeah, the downside is the ending. Despite this, I still think this is a good movie. I mean, not perfect by any means but it is a pretty good crime drama that is so true. If you David Fincher's directing style you'll like this. It had a memorable cast that you'll recognise and it had good writing, solid directing, stellar acting and historical authenticity. You know the rest. Give it a watch and see if it'll grip you and you'll know the story is true.",
            "review_date": "2019-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not bad. I recommend it",
            "review_date": "2019-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is one of those movies which is more concerned with the details of the case more than the case itself , and thats a good thing. Because we discover who the killer us with the investigators , we suspect him with the investigators. David Fincher is a great director who has proven everytime that he has what it takes to be called the most versatile director in Hollywood today. In the beginning of this movie , the movie was starting to look a bit like The memories of murder (Korean movie , great movie btw). But as the movie went on things became different. Jake , Mark and Robert gave pretty good performances with jake being top notch. I would definitely recommend this movie.",
            "review_date": "2019-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most fictional mysteries conclude with the perpetrators being expose and their motives revealed. Zodiac revolves around a mystery which has never been conclusively solved – the identity of the Zodiac killer, who terrorized California in the late 60's and early 70's. Zodiac suggests a solution to this enigma, but also leaves room for the viewer to reject the film's interpretation. This ambiguity is a sign of respect for the audience's intelligence. None of the suspects were ever conclusively proven to have been Zodiac, so I appreciate not having the director's pet theory being depicted as fact. The film achieves this ambiguity not only through the content of its script, but also by having three different actors portray Zodiac in his onscreen appearances, none of whom play any of the suspects.\n\nObsession is the main theme in Zodiac. Several characters destroy their lives by focusing on the case to the exclusion of everything else. The effects of the case on the investigators are as much the focus of the film as Zodiac himself. Focusing more on heady themes and less on the brutal murders (reenactments of Zodiac's crimes make up only a small portion of the runtime) is admirable but requires a higher level of skill on the part of the writers and actors. While Zodiac isn't as brilliantly written as The Silence of the Lambs, the writer, actors, and director display a high level of skill in their skillful depiction of the ruined relationships and lost opportunities which accompany the characters' obsession with catching the killer.\n\nZodiac also beautifully captures California during this time period, with its period-correct San Francisco skyline, absent the Transamerica Pyramid, which is constructed in a time lapse midway through the film as a clever method to depict the passage of time. Such relics as a police telephone box and Atari's Pong also make an appearance. Perhaps most interestingly for me, given my interest in commercial aviation, were the accurate airline liveries which appear in the film, with several of the main characters flying on a plane operated by the defunct carrier PSA midway through the film. For me, the movie was almost worth watching simply for its glimpse into the time period. Fortunately, the film is not solely interesting as a period piece – Zodiac is also an intriguing murder mystery with an engrossing depiction of obsession.\n",
            "review_date": "2019-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A damn near perfect film. Each scene brilliantly leads to the next one, weaving together a highly intriguing, highly suspenseful telling of a historical crime story. The first hour and a half builds to a truly captivating, tense last hour that features some of the best suspense film has to offer. With masterful direction, quality performances, and inimitable story-telling, Zodiac ranks up there as one of my favorite movies ever. A definite must-see!",
            "review_date": "2019-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie lots of suspense toward the end.",
            "review_date": "2019-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Fincher's best",
            "review_date": "2019-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a perfect movie in every aspect.  ",
            "review_date": "2019-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The motives of the character werent clear enough, like explaining very well why Paul leaves the case, or why did GraySmith gets soooo obssesed with solving the case, he passess from a cartoonist to a fakin P.I. Also there is a point that the murders and the investigation merge, this happen at the beggining of the movie but then it only focuses on the investigation part and the years pass like if nothing happened in betweenthe murders, to finish, the end was a sort of cliffhanger made in a poor way, i had hopes for this movie the first hour and a half but it ended up being kinda dissapointed.",
            "review_date": "2019-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fascinating true story. ",
            "review_date": "2019-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliantly written, tense and thrilling mystery film, Zodiac mostly fires on all cylinders. Fincher directs incredibly with a fast pace where he needs to and a calmer pace at the right moments. He is so detail orientated his films are a joy to watch, he delivers so much tension in certain scenes just in the way its shot, it's remarkable. All the acting is top draw and the mystery remains intriguing and intelligent throughout.  While quite long at 2 and a half hours the film fly's by never outstaying its welcome. It's nice that the film doesn't dwell too much on the horrific murders of the Zodiac killer but the murder scenes are spectacular. Instead of this we get some great, fully formed characters who all have a part to play in the grand scheme and I was very taken by it. Top quality film making. ",
            "review_date": "2019-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fincher's distinctly medical (and somehow still intensely personal) way of filming brings such energy and power to each shot. The dialogue is witty and quick-paced, never failing to add extra gusto to an already well-executed scene. But what makes this film so successful are its occasional flourishes - an unexpected tracking shot, a brilliant realization shot, a comedic reverse - that bring all the more heart to a film about such a hard to understand story as the Zodiac's.",
            "review_date": "2019-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has everything going for it. A rich history and many stories to draw from a stellar cast, great direction, great cinematography and all the aspects that are needed to craft a great movie. That being said it is one fatal flaw that cuts this movie down to its knees in that it is too long.",
            "review_date": "2019-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Great acting. Amazing cast. Suspenseful and intriguing.",
            "review_date": "2019-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly close the real facts, this thriller is maybe not as breathtaking as some other polar movies but the reality of the facts gives it a very unique flavour.",
            "review_date": "2019-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can someone scream \"neo-noirgasm?!\" My god. The diner scene with Ruffalo and Gyllenhaal is pure magic. I've managed to avoid all knowledge of the Zodiac killings prior to seeing this movie and it made those final text blurbs all the more frustrating. Regrettably I watched this film for the first time over the span of three days. I worry that some of the grit washed over me without really sticking but, overall this is a fantastically intense movie.",
            "review_date": "2019-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brace yourselves. Are you braced? I have never thought Jake Gyllenhaal was a very good actor and this movie does nothing to convince me otherwise. What the movie DOES convince me of is that Robert Downey, Jr. always plays Robert Downey, Jr. (Just as George Clooney always plays George Clooney.)\n\nThe movie did not need to be this long. I can think of numerous scenes that could have been tightened up or done away with completely.",
            "review_date": "2019-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly one of the worst movies I've ever seen in my life. The entire movie was a cat and mouse gave with more questions than any answers. Yes, I understand the case was never truly solved... but why bother making a movie about it? Makes no sense. The whole movie I was completely lost with stuff being tossed back and forth. I hate when movies are over-complicated with no answers and the critics love it. This movie lacked any true direction and did not have any climax nor resolution to anything. It was a mess. The cast is excellent, but the writing and the whole point of the movie are just stupid.",
            "review_date": "2019-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac: Slowburning, strong preformances and stylish to a fault. David Fincherâ(TM)s masterpiece is a: quiet driven, masterful scene by scene suspencer with rich detail, and also as a flick that has room for subtley, horror and obsession, all done with panche.",
            "review_date": "2019-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Knew nothing about the Zodiac Killer before this, now I can’t get enough. Stellar movie, kept me on the edge of my seat the whole time",
            "review_date": "2019-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "90/100\n\nAmong the best thrillers, the acting was impeccable as well as the representation of what happened. Very well detailed. In conclusion, you must watch this movie !",
            "review_date": "2019-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Utterly engrossing, and a true masterpiece of the thriller genre.",
            "review_date": "2019-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some no like ending.  Is real story.  Complain ending Titanic?  Good movie.",
            "review_date": "2019-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fincher manages to keep your interest during this long stretched out movie about a long stretched out manhunt",
            "review_date": "2019-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't work out how I never saw this at the cinema, but it is a long and captivating film following the open case of a serial killer in California, managing to feel authentically period (Downey Jr's drug and drink addled persona certainly helps) and realistically frustrating fir everyone as the case falls from the media and the thoughts over years of dead ends.\nA good look at the almost always male nature of obsession where somebody loses everything and thinks it worthwhile.\nSee it if you can.",
            "review_date": "2018-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An eerie masterpiece and a brilliant job by director, David Fincher, zodiac remains one of my favourite films of all time.",
            "review_date": "2018-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw this movie the other day on boxxy software in my audio language",
            "review_date": "2018-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A spectacularly done detail-oriented true crime film that focuses on the case rather than the actual killer himself whilst keeping you hooked until the very end (and even afterwards, where you can find yourself researching about the Zodiac).",
            "review_date": "2018-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(94/100)\nThis movie is either captivating for some people or it isn't. But you really need to try to be invested in the story. Because the satisfaction it gives on the end, when you have been thinking with these characters and have been trying to tie up the loose ends while they do, is an amazing feeling. David Fincher really shows his skills with this being one of my favorite movies of his. Also solid performances by Robert Downey Jr., Jake Gyllenhaal and Mark Ruffalo.",
            "review_date": "2018-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very good movie, but my bias on the efficiency of US police still remains in the negative.",
            "review_date": "2018-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How many stars can you fit into a single film?\n\nZodiac features great performances from everyone involved, notably Jake Gyllenhaal, Mark Ruffalo, and Robert Downey Jr. Even the supporting cast showed phenomenal talent. The biggest complaint I had was with Charles Fleischer, as I thought his line delivery left something to be desired.\n\nI was very interested to watch Zodiac because I knew of the case, but had never taken the time to research the details of it. It was good to see the events depicted in film format, even if some liberties were taken.\n\nMy major issue with the movie is that, while interesting, I didn't find it very captivating. I felt that I was watching a documentary at times, rather than a film for viewing pleasure. While not necessarily a terrible thing, it wasn't what I was hoping for or expecting.\n\nI also found that the cinematography ranged from passable to bland for the majority of the film. I grew extremely tired of the 'fade to black' transitions and the 'time, date, location' typography on the screen. Do we really need to know that an hour has passed?\n\nI found the musical score to be hit or miss. At times, it was tense and dramatic and really accomplished the goal of amplifying the suspense on screen. Other times, it was almost whimsical and didn't fit the tone or atmosphere of the film or subject matter.\n\nThe plot was all over the place and, quite honestly, a mess. I'm sure that this was true of the actual events that the film is based on, so it's easy enough to give it a pass in this regard.\n\nHowever, the scene where the Zodiac attacks the couple while wearing some kind of fantastical black outfit was ridiculous. I'm not familiar enough with the case to know if that actually occurred, but that costume accompanied by the atrocious script and questionable acting from all three parties involved made it quite a horrible scene.\n\nWhile not the perfect film, Zodiac is an interesting and educational - if somewhat overlong - experience.",
            "review_date": "2018-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not all real events are suitable for a movie, and this is a good example for that. Zodiac, though a really interesting story, is a really boring movie with no real story arc.",
            "review_date": "2018-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is a thriller that has little thrill in it. It tries to keep a sense of anxiety in a viewer, but most of the time it fails to do that and it;s probably because it's really too long. The best moments of the film are when Jake Gyllenhaal is on screen.",
            "review_date": "2018-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A murder mystery masterpiece.\n\nZodiac (2007) is director David Fincher's finest film. It is a relentless case study and police investigation into the Zodiac killings of the 1960s-1970s. The direction is full of long slow panning shots that keep you on edge. The fun music keeps you at ease while you bear witness to detailed recreations of heinous murders. The pounding music will eat away at you while you try to follow alongside these detectives, reporters, and hobbyists at uncovering the identity of The Zodiac Killer.\n\nJake Gyllenhaal leads the fray as a cartoonist that is interested in reading, riddles, puzzles, and conundrums. His manic portrayal is fascinating and intriguing as you relate to this average man trying to do the right thing. Mark Ruffalo is quite sympathetic as the detective in charge of the Zodiac case. His frustrations become yours as his leads give you hope as well. Robert Downey Jr. is hilarious as the journalist invested in the Zodiac killings and head target. This leading cast along keeps you alert, on edge, and engaged at every moment of Zodiac's lengthy running time. You never feel the time pass as you are mesmerized by this gripping true story.\n\nI cannot recommend Zodiac enough. Fincher may never outdo this epic investigative film. Zodiac is a beast unto itself. The long length encompasses so much time and information, but Zodiac helps you along and keeps everything in order. I found Fincher's sense of suspense and intrigue completely entertaining throughout Zodiac. If you have never seen Zodiac, you are in for a wild time. You'll hold your breath as Zodiac takes it away!",
            "review_date": "2018-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatness of Zodiac is in it's monotony. The detectives' and journalists' wide-eyes slowly begin to sag as they seem to get further away from catching the infamous killer. We descend into madness with these characters; their obsession becomes ours, leaving us as flustered and frustration as they are. And because of its length and scope, you really experience the passing of every increasingly defeating year. A roller coaster of optimistic intrigue and pessimistic exhaustion.",
            "review_date": "2018-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A solid but too long movie.",
            "review_date": "2018-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story is similar to that of Se7en, with a good structure and great cast, although Se7en is the best of the two.",
            "review_date": "2018-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can somewhat say it falls in the serial killer genre, but it's also largely a detective movie, and both elements work incredibly well together. This is darkly atmospheric film that gives a subtle feeling of constant dread, despite only a few murders throughout. Along the way, i was heavily engrossed in Gyllenhaal's Robert Graysmith, a newspaper worker turned junior detective, as he pieces together clues and digs deep into his obsession of discovering who the Zodiac killer is. It's both mesmerizing and chilling thanks to David Fincher's direction and knack for creating the appropriate atmosphere in his work.",
            "review_date": "2018-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a great true life crime drama. helps escape its genre with great performances, a clever script and some excellent direction. Only real negative aspect is its probably too long and has some questionable CGI in it. If you have any interest in the Zodiac murders you'll love this movie",
            "review_date": "2018-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Atmospheric, stylish and chilling, Fincher captures the feeling of fear and panic, as well as the frustration and obsession surrounding the Zodiac killer with in-depth character studies, great visuals and interesting dialogue. The story is, of course, based on true events and is superbly written, unfurling at a deliberately slow pace, giving each character their due screen-time whilst also creating a natural feeling timeline and a helluva lot of suspense. It's not a short film at almost 2 hrs. 45 mins, but it's so engrossing that the time just flies by and it really is worth every second.",
            "review_date": "2018-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining, but meandering and felt to me like it was lacking in resolution.",
            "review_date": "2018-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well thought out film. Just the “write” amount of suspense without overdoing it. Gyllenhaal stole the show, but Ruffalo performed admirably well in my opinion, also.",
            "review_date": "2017-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ok dark movie starring jake gynhall, Robert Downey jr, and mark ruffalo. Aka iron man and hulk are in the same movie before the avengers came out. That's pretty much the only part of this film I really enjoyed but everything else, well and the cinematography is pretty good also but that pretty much sums it up. I felt bored and I wanted it to just end.",
            "review_date": "2017-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The investigation aspect was more interesting to me than the brutality so I was somewhat disappointed.",
            "review_date": "2017-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fine portrayal of the true life events that occurred in the '70s.  The events that lead up to the conclusion are very surprising... police getting taunted by a serial killer, cyphers in the newspapers, etc.  It seems more fiction that non at times.  The acting is really really good and that's what brings everything home.  I definitely recommend this film for fans of dark dramas, thrillers, etc.  It's not a 100% horror movie.",
            "review_date": "2017-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The mix of rhythm, script, acting and photography. \"Zodiáco\" is another film by David Fincher that is not perfect, but also does not sin, approaching the story of a curious serial Killer, the film mixes nuclei and points of view, with many details, tension and a good direction, all this makes \"Zodiáco\" one of the best films of the American director. With more than two hours and socks of duration the script can not be dropped into monotony, and even when the same is repeated in ideas, is saved by the great performances, telling the story of a serial Killer that ravaged California during the 1960s and 70, the film little develops the killer because, it was never discovered that it really was, so we have a concentration in a journalistic nucleus and a police officer, the latter to support the first, and running out, we have a nucleus with more poetic freedom, which in the case, is the murderer, the script, even if one repeats ideas at times, has a spectacular rhythm, in addition to telling an extremely instigating story in an even more instigating way, through speculation, all 4 characters that involve the two core cores are well developed, in terms of script the work is not perfect, but it is well above average. The film flees in talking about some social issues in the middle of the way, like racism for example, does not end up not going that way, which is not bad, since it is difficult to focus on something other than \"Zodiaco \", with a palette of gray but clear colors, the film transmits very well the 60s and 70s, in addition to centered camera angles, and always using plane against plane, the film direction is very good, the subjective camera is little used , but we have beautiful open plans, as well as a positioning in closed spaces that always goes through a \"Sinister\" climate. With a trio of actors that would come a few years later become synonymous of quality in the cinema, the performances are great and follow the whole. \"Zoadico\" is the right movie in the wrong year, released in 2007, a year where we had \"Black Blood\" and \"Where the Stars Are\". weak does not have \"the film really you're kind of forgotten, but still. It's a complete work, besides being a good movie.",
            "review_date": "2017-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Fincher reminded me why the Hollywood formula worked at some point. \"Zodiac\" was full of American quirks, but every single one of them was executed perfectly, so if you liked any of Fincher's earlier work (or the Korean \"Memories of Murder\") this will feel right at home, maybe even on par with \"SE7EN\". While it's still a typical American Investigation film, it's the best one I've seen in years.",
            "review_date": "2017-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A gut-wrenching and quietly powerful thriller by the ever-brilliant David Fincher, this masterpiece delivers with amazing editing, mix-matched with striking performances from Jake Gyllenhaal, Robert Downey Jr., and Mark Ruffalo.",
            "review_date": "2017-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very few moments of genuine tension that one would expect from a serial killer thriller. Also, sub-par acting from a great cast IMHO.",
            "review_date": "2017-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Who is Pepe Silvia!? \n\nThose familiar with Its Always Sunny In Philadelphia will feel EXACTLY like Charlie did at the close of this movie. If you aren't familiar with IASIP reconsider your life choices....\n\nThis movie took source material from before my time and made it a chilling, thrilling, edge of your seat emotional rollercoaster of a movie. Once completing his movie I guarantee that you will want to start your own investigation into who is the Zodiac killer. The movie is a bit in the longer side ~2.5 hours, but that time FLIES by from the second the first phone call is made to Jake Gyllenhaal's house. The movie is expertly made by the always amazing David Fincher to be a larger than life retelling of one of the most notorious serial killers of the modern day.\n\nSeriously, if you haven't seen this movie and somehow stumble on to my review... take the time and watch it. You'll be glad you did",
            "review_date": "2017-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Zodiac\" is a movie I was really interested in watching. It was all a big puzzle game but at times it was really difficult to completely follow because all the information came too fast to grasp. The performances were good with Jake Gyllenhaal really winning me over. It was too long for its own good and it never really managed to fully hook me in. It's a story that I find really intriguing and by the end of the movie it gave me some chills but I thought this movie was gonna really knock me over!",
            "review_date": "2017-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Led by Oscar-worthy performances from Mark Ruffalo, Robert Downey Jr, and especially Jake Gyllenhaal, Zodiac forgoes fast-paced action and over-the-top gore, instead focusing on a character- and dialogue-driven story. The real events-based story has a surprising amount of humor sprinkled in, helping make this one of David Fincher's best.",
            "review_date": "2017-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most under appreciated movies ever",
            "review_date": "2017-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie started out very interesting, and fast paced and by the end felt very dragged out. The movie could have been made shorter very easily. The acting was very good in parts and very spotty in others, all in all the movie was above average.",
            "review_date": "2017-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A thrilling tour de force, Zodiac is a clever, entertaining, and intriguing police procedural with a delicious 1970's edge to its filmmaking.",
            "review_date": "2017-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was jonesing for more of Jake, after seeing Nightcrawler.\n\nThe film as a whole is incredible, resembling the likes of Seven. Jake gives a exceptional performance, accompanied by a great cast, playing a cartoonist with an ass that wont quit, you go girl. The film is a long one, so bare that in mind before watching it. It's a really interesting story, following the Zodiac killer. \n\nI feel the film could be shorter in areas, there's 101 different twists and routes they go down. The films basically a long more information filled Seven, the story of a serial killer and those who try to capture him. Don't get me wrong, they're separately both great films, they just have a lot of similarities.\n\nI'd recommend this film to anyone, period.",
            "review_date": "2017-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "oke, fight club sama se7en itu masterpiecenya fincher, tapi Zodiac simply his best movies",
            "review_date": "2017-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Considering it's based on a true story, where they never caught the killer, this is actually a very exciting movie. The characters are well developed, and it's great to follow them over their lives of over a decade of trying to solve the case.\nMoody and dark, but with flashes of humour when required, this film really exemplifies how to carry a plot. Gyllenhaal shines, as does Ruffalo, with Downey Jr coming in a close third for the best performance, they all just work so well together, showing the real frustrations of tracking a serial killer. \nGreat suspenseful watch, highly recommended. \nWatched on the airplane coming back from Moncton (before connection in Montreal) after my cousin Beth's wedding, September 13, 2017",
            "review_date": "2017-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies of all time.",
            "review_date": "2017-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly good film.",
            "review_date": "2017-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a powerful cast, a clear vision, and a steadily paced direction on one of America's biggest unsolved crimes, Zodiac earns its place on the great American crime drama's list while also maintaining faithful to the reality of the situation at hand.",
            "review_date": "2017-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac features good performances from its talented cast, reliably strong direction from Fincher, superb cinematography, a good mystery and a couple of truly terrifying murder sequences, but it needed more action in my opinion and it was ultimately undone by its needlessly prolonged running time. It's a good film, but far from the director's greatest works.",
            "review_date": "2017-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The way this film flows is executed perfectly. It kept me iterested the whole time. Very easy to sit back and watch. Does a great job of showing us the story and not telling. Acting and cenimatography is great all across the board. My favorite thing about this film is how the point of view constantly changes from character to character. It allows for a really in depth look in the story.",
            "review_date": "2017-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Director, David Fincher, captures the true story of a San Francisco serial killer in the movie, Zodiac. The movie accurately depicts Robert Graysmith's obsession in finding the Zodiac Killer as well as really capturing the Zodiac Killer's effect on the community. Fincher manages to make the audience feel like part of the investigation by making sure every detail was there. This movie is a very intriguing mystery based on a real life mystery that is yet to be solved.",
            "review_date": "2017-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4.5/5.  The energy can't be maintained for the whole nearly 3 hour run time, but that said, Zodiac actually flows by quickly and is extremely engrossing.  Another solid film from David Fincher.",
            "review_date": "2017-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Suspenseful in every sense of the word. Dialogue driven movie with such great writing is bound to be good but this was great.",
            "review_date": "2017-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hard to make a 150-minute movie go by quickly.",
            "review_date": "2017-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Any fact-based film that doesn't surround an emotional crisis of a rising figure but chronicling around a singular events based on originated facts is intellectually captivating and brilliant, like this detailed mystery thriller. It invites you into a few decades of investigation to feel the suspenseful public atmosphere and the tricky obsession as part of the delivery of multiple facts that are engaging when indirectly interacting with the investigation. Both writing and direction were exceptionally well done while the main cast took us on a ride through the delivery and tensed atmosphere with their performances being mostly magnetic and occasionally charismatic. With the leading players led and narration directed, the direction gives an ideal sense for director David Fincher's own mastery, like this film being a masterpiece even with its small, yet heavy dark natured throughout. (A-)",
            "review_date": "2017-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stayed up all night after this one.",
            "review_date": "2017-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intelligent, informative and entertaining.  Very well done film about the Zodiac murders.",
            "review_date": "2017-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is crime/drama film directed by David Fincher, and it was released all the way back in 2007. A decade ago! Dang, that is hard to believe. Anyway, I wasn't able to see Zodiac when it initially released in theaters and really I had never even thought about it until I saw it got added to Netflix this month. I immediately added it to my list and finally got around to watching it. Zodiac may not be as good as Se7en, and it's definitely not the best crime/drama movie ever made, but it's still pretty damn good.\n\nPlot\n\nAs you might have guessed based off of the title, Zodiac, the movie is all about the Zodiac killer, and the people who try to figure out the identity of the killer. I won't go too deep into spoilers, but if you were alive when the Zodiac killer was actually active or if you have read the book, you'll know at least some of the story. Essentially, there's a serial killer on the loose in California and he likes to taunt the press/police after he successfully commits a murder. The movie follows the detectives, a journalist, and a cartoonist as they try to figure out who the killer is. I wasn't alive during that time, and I never read the book or do any research on the subject. So this was a whole new story to me, and I feel like I benefited because of that. The entire time I was trying to figure out who the killer actually was. The director does try to throw a few curveballs at the audience, but I feel like they were almost unnecessary and actually hindered my final assessment of the film. Not that throwing curve balls at the audience is necessarily a bad thing, but the twists just weren't executed all that well.\n\nAnyway, the story kept me enthralled from start to finish. I was completely invested in the investigation by about the half-way point. I didn't look at how much longer was left in the movie once, and I even put off going to the bathroom because I did not want to pause the movie. That's how into it I was. One challenge that Fincher really overcame was the timeline. This movie spans a lot of years. And sometimes that can harm a film dearly. Jumping weeks, months, years at a time can sometimes kill a film's momentum, and lose the audience in the process. But this movie doesn't do that. It can jump weeks or months and you'll hardly even notice. It never loses momentum and it never becomes a drag.\n\nOverall, the story of Zodiac is incredibly gripping and well done. Fincher does a great job of making a \"cold case\" into a movie that actually has a resolution that is satisfying, and he is able to make even the boring stuff seem interesting.\n\nCharacters\n\nAlmost all of the characters in Zodiac are great. They're engaging, unique, and have great arcs. But Paul Avery, who is portrayed by Robert Downey Jr., is the weakest character of the entire film. I get that Fincher was a bit hogtied when it came to each character's arc, but man what a waste of Robert Downey Jr. His character has a pretty small role in the film in the grand scheme of things and doesn't actually add a whole lot to it. He drinks, he smokes, and he helps the case along a little but for the most part he's just there. And it gets to a point in the film where he's completely unnecessary, but they give him a few scenes anyway. I mean, Zodiac is a long film, so cutting out these excess scenes with his character would have trimmed at least a few minutes off of the 2 hour and 37 minute run time. But it is Robert Downey Jr. so I guess they didn't want to cut any of his scenes. Now, I want to make it perfectly clear that Paul Avery doesn't hinder the film or impact it in a negative way. He just doesn't add a whole lot to it and overall seems unnecessary. The rest of the characters are great, though.\n\nPotential Audience\n\nZodiac is a mature film. The first half of the movie contains quite a few murder scenes, and I would say that no one under the age of 16 or 17 should watch it. Heck, some people well into their 40s may find some of the scenes in this movie disturbing. It all depends on how much ultra-realistic violence actually impacts you. If you like crime, drama, or thriller movies you'll definitely have a good time with Zodiac. Just don't let your young child watch it.\n\nConclusion\n\nZodiac is a great film. The story is a quite the ride and the characters keep you engaged. The film does run a bit long, but because the story is so fascinating I doubt you'll even notice how long it truly is. If you have Netflix, go watch it as soon as you can. If you don't have Netflix, go rent it for a couple of bucks-it's worth it.",
            "review_date": "2017-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Fincher needs to do more movies like this.",
            "review_date": "2017-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed this movie. Maybe it's my obsession with serial killers, or love for David Fincher, but I found it fascinating. Crazy they never caught the guy, or even figured out who it was.",
            "review_date": "2017-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great film about the unsolved murders that people still wonder about class performances and a film that grinds out the facts",
            "review_date": "2017-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrific and terrifying",
            "review_date": "2017-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Fincher, who previously directed some of the best films off all time, like Se7en (1995), and Fight Club (1999), comes back with this horror movie, based on true events. It's quite long, but the film is well made and sticks pretty well to the true story, feels, in a way, like a documentary. It's surprising how the film's dialogue can be very tense, suspensful and very scary, much more than the death scenes. The film spends more time developing, following the characters and shaping their personality and role in the story. Bottom line, this is an other achievement by David Fincher and makes you wonder who was, or is, and where the hell is the Zodiac now? Recommended !!",
            "review_date": "2017-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite knowing how this true story turned out (or at least how it did by 2007), I was still captivated and enthralled throughout the entire film. I couldn't wait to see where things would go. And I don't mean that in the sense that I just wanted to see what would happen at the end of the nearly three hour long run-time. I mean that I couldn't wait to see what was going to happen at the end of every minute.",
            "review_date": "2017-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great procedural and meditation on obsession. This would make a great double bill with \"All The President's Men\" or \"Close Encounters of the Third Kind\". Incredible attention to detail, beautiful cinematography and strong performances across the board.",
            "review_date": "2017-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Fincher again with the great tunes and setting that almost dark and uneasy mood like he does in most his movies. Already Iï¿ 1/2 1/2(TM)m digging the setting and time period - groovy. Iï¿ 1/2 1/2(TM)ve always liked Jake Gyllenhaalï¿ 1/2 1/2(TM)s roles and this one is no exception. \n\nInsane to think that these events actually took place and there was a serial killer that was that fucked in the head that existed during that time. All the stress and panic he caused just with his letters. I donï¿ 1/2 1/2(TM)t know if it really happened, but itï¿ 1/2 1/2(TM)s mind blowing to see how they live tv broadcasted the killer speaking. It was interesting to watch all the investigation that went behind this case and how determined Jakeï¿ 1/2 1/2(TM)s character was to find who the Zodiac was. \n\nDidnï¿ 1/2 1/2(TM)t like the CGI so much and all the remodeling of what it might have been during the late sixties around San Francisco. The writing is really good, the movie goes by quick. Itï¿ 1/2 1/2(TM)s a really sharp and somewhat smart movie. Although, thrilling and engaging, sadly, I donï¿ 1/2 1/2(TM)t think Iï¿ 1/2 1/2(TM)ll re watch this movie. Just not my type of movie - the feeling the mood. Fincher has done some really amazing movies like Fight Club and The Game which those are a lot more worthy of a re watch.",
            "review_date": "2017-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a great film. So many twist and turns! Thrilled from first minute to the last, such a surprising start!",
            "review_date": "2017-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Fincher's typically outstanding grip for suspense and a trio of powerful performances make Zodiac a compelling crime thriller.",
            "review_date": "2017-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't know there was such...",
            "review_date": "2017-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based on the non-fiction book of the same name by Robert Graysmith. Zodiac tells the story of the manhunt for a notorious serial killer who called himself the \"Zodiac\" in and around the San Francisco Bay Area (America) during the late 1960s and early 1970s.",
            "review_date": "2017-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Almost ten years after seeing this picture for the first time in 2007, I still find that multiple viewing of Zodiac is never an exhaust. This is a criminally underrated movie of all time. It under performed at the box office and was utterly ignored at awards. It does not play out like any serial killer films with vivid horrifying scenes but rather paints the picture with a realistic depiction of how characters involved trying to solve the crime by meticulous investigation. One of Fincher's best films after The Social Network and Fight Club.\n\nVerdict: Four stars out of Four (A)",
            "review_date": "2017-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "*Great Movie.  One of the best movies ever made.  Nobody remembers it.",
            "review_date": "2017-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very long, sometimes twisty in plot",
            "review_date": "2016-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very intense thriller featuring fantastic performances and a pretty accurate fact based tale.",
            "review_date": "2016-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty crazy how Ironman and The Hulk working together with Donnie Darko couldn't manage to figure this one out.",
            "review_date": "2016-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is an extremely low-paced thriller, quite unexpected from director David Fincher, that can result to be frustrating at times.\nWith a little more speed this very talented cast would hsve menaged to deliver much more thril.",
            "review_date": "2016-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Fincher always makes really well-made movies. The very techinal aspects of all his films are top-notch. The camera is very smooth, the colour palette is again very stylish, the score and soundtrack haunting and the acting is superb. David Fincher knows what he is doing. His films always suck in the audience even though not much is happening. This story for instance is based on the true story of a cartoonist getting obsessed with the Zodiac killing that took place in southern California in the late 60's and early 70's. When you start to create true stories, it gets harder to follow the classic Hollywood three-act structure. This film starts off very interesting with all the characters getting equal amount of screen-time and the creepy zodiac written letters begin to start coming in. Down the stretch, it starts to become a bit of a bore when the zodiac killer becomes absent in the story. While I can't really fault the filmmakers for this because this is a true story and the filmmakers were trying to depict the story as real as possible but it's something to take note of before you watch it. This is one of those films where many little clues are dropped here and there throughout the film and while many of them might fly under the radar or you may not remember all of them, they all come back at the end to make an impactful ending. Overall, this is a really well-made film. If you like David Fincher's other work like Gone Girl and the Social Network, I think you will enjoy this one.",
            "review_date": "2016-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great cast, doesn't show the gruesome murders you'd expect but more of the people side, of what was really going behind the scenes. A+ movie",
            "review_date": "2016-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is terrifying! And not in a horror movie kind of way, but in a true story kind of way. Wonderful cast, acting, and direction. Big kudos to whoever was in charge of researching the case so meticulously for all of the details to come together. The true story of Zodiac has been told, including Zodiac's identity.",
            "review_date": "2016-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as Se7en, but still great work from David Fincher",
            "review_date": "2016-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best thing about Zodiac is that it's not a film about the serial killer, but the people involved in the case and their lives. And also Jake Gyllenhaal, who delivers a performance on point, as he always does.",
            "review_date": "2016-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The zodiac killer story is a very fascinating one; however, this movie managed to make it somewhat boring and almost too quiet to be considered a horror movie or anything close. In my opinion it's needlessly long and drawn out, the film has entirely too much dialogue and by the end your eyes have glazed over and you're not even that drawn to the story anymore. Regardless, it certainly does have its thrilling moments and the essence of mystery and suspense cannot be denied.",
            "review_date": "2016-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stopped movie after maybe 15-20 minutes. It was too violent.",
            "review_date": "2016-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great thriller about a mass murderer and how it became one of the hardest cases, driving people insane, which the movie portrays perfectly, the pacing feels a bit choppy at times but the great script and performances compensate it, making a great mystery solving thrilling movie that always keeps you at the edge of your seat.",
            "review_date": "2016-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is one of them movies that convinces you that certain people in the movie were the killer. You have to watch out for what most people say about the case because if you don't, you lose the whole movie. Robert Graysmith who is played by Jake Gyllenhaal is a cartoonist, but ends up getting caught up in an investigation that only has fingerprints and handwriting. You would need a lot more to catch a serial killer back then. Graysmith punches above his weight in the movie: Going on national TV and the Zodiac wasn't happy. Graysmith was getting phone calls once a week from an unknown caller breathing very heavily down the phone. I wonder if that still haunts Graysmith to this day. Who knows? Only Graysmith knows. This movie in my mind was the best movie of 2007. although I didn't see the movie until July 2011.",
            "review_date": "2016-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A surprising film in that it has so many stars (& future stars) yet plays out more like a docu-drama than a Hollywood film. Excellent cinematography, lighting, and a strong script with minimal editing allows for the viewer to think through the implications  of each scene and reach conclusions just as the main characters do. Life, damaged as it may become, does continue on and can make victims of all who are touched by tragedy.",
            "review_date": "2016-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gyllenhaal and Fincher do an amazing job with the fascinating true unsolved story of the \"Zodiac killer\".",
            "review_date": "2016-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty interesting story.",
            "review_date": "2016-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A story everyone knows, shown to us with no suspense at all. Honestly really boring, everyone else likes it though.",
            "review_date": "2016-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow at first but once it picks up it really gets going...",
            "review_date": "2016-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wanted to like this. There were good performances all round but i just felt it really lacked tension for some reason. It was incredibly long and i personally feel it didnt have enough atmosphere to keep you hooked to a story that is very convoluted and doesnt really have any resolution.",
            "review_date": "2016-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Highly entertaining movie that sticks with you for a while",
            "review_date": "2016-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Fincher crafts another well-made serial killer thriller, but instead of the typical thrills associated with these films, we get a very talkative but engrossing mystery. Of course, the film is based on a true story. A case when the killer was never truly caught. This means that the ending is rather anti-climactic as it should probably be. The film doesn't make for the most satisfying film, unlike Fincher's other serial killer Seven. The cast is fantastic,except for a rather unfortunate lack of female characters, with Chloe Sevigny sleep walking through a poorly written part. Zodiac isn't Fincher's best film but it is mature, and solid filmmaking. Rating: 72",
            "review_date": "2016-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is a very underrated film from the late 2000's. The direction from David Fincher is on point as always and the acting is stupendous. The characters are well fleshed out and the plot is fascinating. I had seen numerous documentaries about the Zodiac killer, so I knew pretty much all there was to know about this case. Even with knowing the majority of the plot beforehand, I was transfixed on the film's narrative and the tension that slowly builds throughout. It is a dialogue heavy movie but it's so well scripted that this is nowhere near a problem. Keep in mind how the actual Zodiac case turned out beforehand. I think it helped to know that the film was going to end ambiguously.",
            "review_date": "2016-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's too long, and the writing isn't very good. This is David Fincher's weakest direction of a movie. If the runtime was shortened, and the story was tightened, this probably would have been better, and gotten to fresh.",
            "review_date": "2016-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Chilling, meticulous and with a remarkable grasp on the time period, David Fincher's \"Zodiac\" is a lengthy yet intriguing thriller that presents the real life events with a subtle, documentary-like style.",
            "review_date": "2016-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though it's quite long i was never bored, the link between the movie and the viewer was never cut off. David Fincher always surprises me.",
            "review_date": "2016-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great example of an excellent detective movie.",
            "review_date": "2016-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good film. Not amazing but it does a very good job of building and sustaining the tension throughout the run time. In addition to the suspenseful real-life crime story we are given a view of how the hunt for the Zodiac Killer claimed more than lives as it left many of those that lived through it scarred.",
            "review_date": "2016-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Fincher at his best with suspenseful dialogue and camera shots",
            "review_date": "2016-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is professionally made, with believable production all around. The film runs a bit long, but every scene is filled with a quiet kind of obsession that is marked by David Flincher's great direction.",
            "review_date": "2016-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac works more as an engaging trip back in time, encompassing moments of cinematographic brilliance and tapping into the 70s culture, than a consecutive work of a murder thriller; it focuses neither on the right character nor on the events and ultimately, its recreational work can't justify its nonetheless impressive runtime.",
            "review_date": "2016-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "subtle, thrilling, and quite smart",
            "review_date": "2016-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that for David Fincher's lofty standards was met with a\nsomewhat muted critical response and also a box office haul that didn't\neven scrap together enough to cover a $60 million dollar plus budget,\nZodiac remains the directors true underrated gem and a film that\ndeserves a place alongside some of cinemas best detective/murder\nprocedural tales.\n\nZodiac is a unique film, a based on real life account of the Zodiac\nkillings that haunted the American populace in the late 60's and early\n70's with a raft of public taunting's that often were followed with\ngrizzly and seemingly random murders, it's a film that cares little for\ncharacter development or the likes yet focus's its intentions and\ncarefully crafted gaze on the investigation itself, throwing the\naudience into the time and into the thick of it to create tension and\nintrigue unlike many other such films.\n\nWorking with the late D.O.P Harris Savides, Fincher delivered what\ncould well be his most beautiful film yet made. Shooting in a striking\nvisual palette, Fincher crafts his camera around the San Francisco\ncityscape and surrounding areas to striking effect. Building's form in\nfront of our eyes, taxi's weave through the city at night and basements\nbecome more ominous than we could've ever imagined under his watchful\neye and the script by James Vanderbilt (whose sadly not gone on with\nthe promise shown here) does a great job at condensing the drawn out\nsaga into a cohesive whole and his work on the film seems perfectly\nsuited to a man of Fincher's powers.\n\nZodiac's failings to initially make a mark upon release are hard to\npinpoint, although there were lots of critics that hailed its slow\npaced stylings and dialogue heavy scenes, there were equal amounts of\nnaysayers that seemed to prefer their Fincher more Fight Club than the\nprocedural that takes place here, although the films sparring violence\nis haunting - a stabbing scene in particular is hard to forget - and\nthe moments where Fincher takes us into the heart of suspect\ninterrogation showcase a tension and unease that only the best of films\ncan do.\n\nA great cast led by Jake Gyllenhaal, Mark Ruffalo and Robert Downey Jr\ndo great work without ever taking over Zodiac and Fincher's film takes\nall its power and crafts all its magic through the use of its couldn't\nmake it up if you tried narrative and an understanding of material that\nno doubt came from Fincher's renowned attention to detail.\n\nA long watch and a film not made for the average popcorn muncher that\nfloods our cinema screen in this day and age in search of their next\nCGI spectacle, Zodiac is a meticulously crafted and tension riddled\njourney through a time in American history that to this day remains an\nintriguing and engaging subject matter, Zodiac is the hidden jewel of\nFincher's filmography and a film well worth a repeat viewing for those\nthat may've only watched once.\n\n4  1/2 animal cracker boxes out of 5\n\nwww.jordanandeddie.wordpress.com",
            "review_date": "2016-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watch it every time it shows up on the schedule. I love the noir treatment in this character-driven movie.",
            "review_date": "2016-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best films of the 2000s",
            "review_date": "2016-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Took too long to get to the good part. I still believe in Gyllenhaal.",
            "review_date": "2016-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is David Fincher's best film. Better than se7en. Zodiac is a beautiful interpretation of the famous serial killer.",
            "review_date": "2016-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fincher weaves beautifully a string of clues that stretch over two and half hours, only to lead to one conclusion: we will never know who the boogey man is.",
            "review_date": "2016-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Danny Danko and teh avengirs face theyr gratest fo yet. a big bad killer ho is teh zodiak. he kills adn kils adn kils. but with danny danko time travelling abilitys adn teh raeg of the incredible crunk. adn iron man they haz a chance to take this bad boy down",
            "review_date": "2016-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overlong and over complicated but still fascinating viewing.",
            "review_date": "2016-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The \"All the President's Men\" of serial killer films.  A procedural based on a known case, that shouldn't be suspenseful since it's notoriously unsolved, but manages to create a ton of suspense while focusing on the fairly mundane details of police work.  It didn't seem like a film Fincher had in him.  While the dark subject matter is consistent with his body of work, but it totally forgoes the flashy style of his previous work.  Although the subject matter couldn't be more different, the seeds of \"The Social Network\" are sowed here.",
            "review_date": "2016-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really enjoyed this Fincher thriller. The character development in this movie is quite good, and the story is very intriguing.",
            "review_date": "2016-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very creepy film and historically accurate. Zodiac is another example of how to do a thriller right featuring great performances by Jake Gyllenhaal, Mark Ruffalo, Robert Downey Jr. and more. As well as having lush cinematography, great acting and a well written script. Some scenes I will admit were kind of questionable, but any flaw is easily overlooked. You get very invested in the situation and makes you want to research the real life events, that's how well directed this movie is! If you haven't seen Zodiac yet, please do so! Good job Fincher!",
            "review_date": "2016-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite mystery thrillers ever.",
            "review_date": "2016-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really liked this telling of the story of the hunt for the Zodiac killer and Greysmith's obssession with tracking him down. Great cast and direction.",
            "review_date": "2016-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A gripping, intelligent and suspenseful thriller. Zodiac is one of the finest horror/mystery movies i've ever seen. All performances are excellent and David Fincher's near perfect directing is excellent. This is a must watch.",
            "review_date": "2016-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was very tense, the atmosphere was unlike anything else I've experienced from a movie. The story kept you thinking all the time, and the A-list cast did an excellent job of keeping me entertained throughout the whole movie. Great film",
            "review_date": "2016-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A gripping tale of obsession. Downey Jr., Gyllenhaal, and Ruffalo all put on spectacular performances.",
            "review_date": "2016-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is truly one of the best movies I've seen in a long time, it's movies like this that make me realise how much of a wizard Fincher is. After viewing the movie and researching \"the zodiac\", it made me realise how much effort was put into this film. From the big details to the minuet, it really is staggering how even the littlest of details from the case are displayed in this movie. This movie will have you researching long into the night after watching and wondering in the days after viewing. The performances are masterful throughout with such a large star studded cast, it's amazing everyone's unique personality shines through. This may be Fincher's greatest work and is a definite must see for anyone out there, it is a masterpiece.",
            "review_date": "2016-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thilling and chilling.",
            "review_date": "2015-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "****\nDavid Fincher has created a creepy true story crime film with 'Zodiac'. The film has great performances from the three leads, and successfully achieves the sinister undertones (and overtones) that Fincher is best known for.",
            "review_date": "2015-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unlike Gone Girl or Girl With the Dragon Tattoo, this film at times felt long and boring, especially when the murders stopped. But when investigations are in order and have created this \"Law and Order\" vibe, it is a magnificent film. This film is thrilling, clever, and even disturbing when in the right moments. Also, Jake Gyllenhaal and Mark Ruffalo were brilliant in this film.",
            "review_date": "2015-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Far longer than necessary but still intriguing",
            "review_date": "2015-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story about the Zodiac killer is very intriguing, but the movie itself was sorta blah. Nothing here that you would miss, so you can make better use of 2 hrs & 37 mins. of your time. Grade: C",
            "review_date": "2015-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is an ambitious film. It tries to condense over 30 years of history with no definite ending into one cohesive movie. And, for the most part, it succeeds. The story is compelling and the cast is strong, although some characters feel unnecessary and the pacing is very slow. It's an interesting movie to watch, but I don't know if I'd ever want to watch it again.",
            "review_date": "2015-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a dark and gripping movie. Made me extremely interested with the story, the character, and made me wonder who the killer is. Such a great detective movie. But, would have loved to see more Robert Downey Jr. and the movie got a little bit dragged down after the Zodiac stopped writing letters. Mark Ruffalo and Jake Gyllenhaal are both extremely great in this film.",
            "review_date": "2015-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was permanently intrigued by this complex story. I quite liked the way it was told, although you had to be alert in the swift sequence of scenes and with the rather staccato dialogues.",
            "review_date": "2015-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is a rare movie that manages to hold your attention throughout its entire runtime and makes you want to go and research about its story even more after it has finished. The movie is masterfully directed, written, edited, and acted - making it one of the best thrillers I have ever watched. \n\nThe plot of the movie revolves around the investigation of the infamous Zodiac killer in the 1960s in the San Francisco area and how a cartoonist, Robert Graysmith (Jake Gyllenhaal), a homicide detective, David Toschi (Mark Ruffalo) and a news reporter, Paul Avery (Robert Downey Jr.), aim to crack his identity but see their personal lives greatly affected by their involvement in the case.\n\nThe main reason why I absolutely love this movie is because it is able to draw me in completely into its story. 'David Fincher' is one of my favorite directors and I really feel that this is one of his best-directed movies. 'David Fincher' and cinematographer 'Harris Savides', portray the 1960-1970 era terrifically. The costumes, the sets and era transport you straight to the 1960s-1970s and make the movie visually appealing. Moreover, 'Fincher' induces a suspenseful and tense atmosphere to almost every scene in the movie, especially the scenes when the 'Zodiac' killer is shown. This kept me intrigued throughout the whole movie and like the characters in the movie; I kept trying to crack the case myself. The thing that pleasantly surprised me the most, however, was, how well the humor in this movie was handled. The dialogues written by 'James Vanderbilt' were really funny and 'Fincher' used humor really well to keep me engaged in the portions of the movie when the characters are not doing much but talking. The interrogation scenes or the scenes in the 'Tribune' office become memorable because of this humor. \n\nThe other thing this movie, surprisingly, nails really well is its handling of its characters and its pace. Since the movie has a wide array of characters and spans over a pretty big era, this movie could have really become messy and overlong, but it is so well edited by 'Angus Wall' that I really could not think of looking away for a moment. Each moment in the movie is engaging, whether it is the characters talking or any action-taking place. Also, 'Fincher' does an outstanding job of handling all his characters well, especially, his 3 main characters, all of who manage to make a lasting impression. None of the supporting characters come off as unnecessary (most of them are intriguing) and add a significant amount of detail to a story that is riveting to say the least. \n\nFinally, the acting in this movie is also all-round terrific. A massive amount of credit has to go to the writing of these characters but in the end, it is the actors who really bring these characters to life. The supporting cast does an extremely good job in the movie. Particularly, 'Brain Cox', 'Anthony Edwards' and 'John Carroll Lynch' make big impressions. 'Anthony Edwards' and 'Mark Ruffalo' share some truly funny moments and complement each other really well in the scenes of investigations. 'John Carroll Lynch' has a few scenes in the movie but really manages to impress with a complex performance. The major cast is similarly exceptionally impressive in this movie. 'Downey Jr.' is at his cocky best as 'Paul Avery' and though he does not have as much screen time as 'Gyllenhaal' and 'Ruffalo', he really shines in his scenes and shares some truly hilarious moments with 'Gyllenhaal's' character.  'Mark Ruffalo' is also terrific as 'David Toschi'. He gets some the best lines in the movie and he delivers them with aplomb and manages to also really impress in his more serious scenes. My favorite character in the movie, however, was 'Jake Gyllenhaal's' character because I felt I really saw the case like he did. I felt that 'Gyllenhaal's' character was extremely difficult to make convincing and 'Gyllenhaal' did terrifically to make this characters motives and incentives seem believable. He infuses his character with tremendous likeability and that makes it hard to not root for him in the movie. \n\nOverall, I see Zodiac, as a hidden masterpiece that stays with you long after it has finished and manages to constantly engage you with its tremendous characters and brilliant dialogue. A movie that manages to really define what a serial killer thriller should be like -- Zodiac is one of my all time favorite thrillers, probably just below my all time favorite thriller - Se7en.",
            "review_date": "2015-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A slow,character driven thriller that trumpets mood and atmosphere over the gore.An easy,fine watch",
            "review_date": "2015-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Typical David Fincher film. Bit on the longer side but you can never take your eyes off the screen.",
            "review_date": "2015-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best true crime films of it genre.",
            "review_date": "2015-09-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Serial killer flick with a long time span - late 60's til the 90's. Many very known faces here, a terrific casting. Great skill from the actors too, without shining in quite typical roles. They have so much screentime that the character building is coming quite easy to you.\n\nWell, we are after a killer here. The police and you. The man is mysterious, smart, clever. We see his moves, but not too many kills. The long hunt, and long film - naturally, is never a bore. Two and a half hours of crime-thriller entertainment. If it works it's a perfect piece of entertainment, and \"Zodiac\" works as a charm.\n\nI miss some more haunting stuff, some intense stuff and maybe some more graphic stuff. It's a treat, but it's not the perfect film of it's kind. It's built upon facts and findings, not an untypical killer-thriller move, but this is a puzzle with few other turns of flips. Some funny business works out once in a while. The bar scene and the hunt for Animal Crackers are a few highlights.\n\nSince this is based on real stuff it's a given winner. It has some great music and sound work and the often dark images are great. It's exciting but lacks some suspence. Not THAT much other than a solid story, but that is often enough.\n\n7.5 out of 10 aqua velvas.",
            "review_date": "2015-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based on the actual case files of one of the most intriguing unsolved crimes in the nation's history, Zodiac is a thriller from David Fincher, director of \"Seven\" and \"Fight Club.\" As a serial killer terrifies the San Francisco Bay Area and taunts police with his ciphers and letters, investigators in four jurisdictions search for the murderer. The case will become an obsession for four men as their lives and careers are built and destroyed by the endless trail of clues. (Paramount Pictures)",
            "review_date": "2015-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This material is perfectly matched to Fincher's sensibilities as a director. Zodiac is probably the best film to date to handle this subject. The anxiety and paranoia are deeply felt, the sequences involving the murders are gut-wrenching, and the intentionally unsatisfying anticlimax is perfectly handled.  It's an endlessly compelling film that just gets better with each viewing, and is possibly Fincher's greatest work.",
            "review_date": "2015-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Fincher masterfully crafted a film about the Zodiac killer and the resulting obsession among those responsible for hunting him down. Part procedural drama and part character study, it may be a tad long for some, it is engrossing and thrilling. Even the disappointing end felt satisfying. Perfect casting.",
            "review_date": "2015-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's shocking how much like non-fiction this fictional representation can be.",
            "review_date": "2015-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "More interesting mystery than the horror thriller I was expecting. However, the few scenes that do go the distance get their moneys worth in tension and anxiety.",
            "review_date": "2015-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a big great yawn with little thrill",
            "review_date": "2015-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A detailed story of what was really going on",
            "review_date": "2015-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rather than focusing on the psychopathic killer, the movie focuses on the investigation and the mystery aspect to find him.",
            "review_date": "2015-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Way too long and lacks substance. The film is well made though and the acting is good.",
            "review_date": "2015-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was great. Slow paced and precise but intriguing and interesting. Very long but it kept my attention the whole time. Great acting.",
            "review_date": "2015-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Fincher's perfectly describes the events of the Zodiac case in a very well done mystery drama. The way Fincher develops his characters is the best part of the movie. The movie is really well balanced with the development of the characters more than the whole killing aspect.  Gyllenhaal, Downey Jr., and Ruffalo give some of the best performances of their careers. Fincher also does a good job of really setting the theme of the movie in the 70s to get a real feel of the time. Zodiac is filled with many great suspenseful scenes and has a well written script. The film has a great pace and is really a movie to watch from a directing and acting standpoint.",
            "review_date": "2015-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good watch with some excellent suspense scenes and based on true story - Has Gyllenhaal ever done a bad movie ??",
            "review_date": "2015-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my opinion i thought that Zodiac is not only the best David Fincher film but his most underated film",
            "review_date": "2015-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I guess 2 hours and 40 minutes is meant to make me feel the long time it took to conduct this investigation.\nAnd again, men acting like men, dazed and confused, lost and possessed, evidence is right before their eyes and they ignore it for some shinier object.\nI wonder if they haven't given that man all that publicity would he ever done the rest of the killings, since he threatened to kill himself if they don't talk to him. \nI guess TV and the newspaper had to make some money and the Zodiac kept it coming.",
            "review_date": "2015-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good film, great performance by Jake, but R.D.J steals the show!",
            "review_date": "2015-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A tense, suspenseful, fact-based true crime thriller, Zodiac reinvents one of the most spellbinding and unsolved murder mysteries recorded in the annals of American history while delivering a relentless concatenation of gut-wrenching anxiety. David Fincher also succeeds at gripping filmgoers' attention from start-to-finish thanks to a collection of compelling character interactions communicated through a gracefully assembled cast.",
            "review_date": "2015-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An extremely well filmed and acted telling of the infamous Zodiac murders and those trying to uncover the truth. The film has phenomenal atmosphere and is packed with tension derived from well constructed dialogue, rather then bloody violence. In fact, when there is violence on screen, it's filmed in such a blunt way that it has far more impact than it would if it was more gratuitous. Excellent filmmaking all around.",
            "review_date": "2015-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is a quiet, slow-paced crime-mystery-drama movie which is based on a true event. The movie is kinda over long but it worked. That could be the problem for some people to watch this movie. Anyway, um I think the casts are great. Performance is solid. Zodiac has some thrilling exciting moments. In the end, I would say Zodiac is a great mystery-suspense movie.",
            "review_date": "2015-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tediously interesting",
            "review_date": "2015-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tight, deft direction, solid acting, slow burn, cumulative power, Downey plays a self-absorbed pr***, which he is anyway.",
            "review_date": "2015-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty darn near perfect. Seeing every character evolve over 20 years throughout the film couldn't have been done any better. The acting and personality for each character was incredible. Awesome soundtrack that really fit the mood. Very intense and absolutely eye glueing. Possible the best crime thriller of all time, in my personal opinion.",
            "review_date": "2015-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Without a doubt one of David Fincher best work, the Zodiac is a thriller and a excellent editing film that will leave viewers satisfied as well as engaged.",
            "review_date": "2015-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well known story from the 60's and 70's, more true than fiction, which I found superbly structured and portrayed until the final 45 minutes where for some reason, Fincher ended the characters, possibilities and doubt he began with, changed into a semi horror, trashy Hollywood ending.",
            "review_date": "2015-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is a dark, slow paced thriller that will have you guessing over and over again where is the plot going, all with great performances from its cast and excellent direction from David Fincher",
            "review_date": "2015-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An excellent stylized noir, \"Zodiac\" is the closest David Fincher or ANY director has come to out doing his detective masterpiece \"Seven.\"",
            "review_date": "2015-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It isn't flawless, but Zodiac is a perfect example of how gore, shock, and violence alone does not make a movie.  What Fincher constructs in this truly unique mystery is very deliberate, dark, brooding, and subtle, but his passion on the subject bleeds into every detail from the intricate design of the 60's and 70's to the cat-and-mouse game itself played between predator and prey.  Although in retrospect some of Fincher's choices in direction for this film seem rather outlandish, the premise itself is no doubt right up his alley, and with a wonderfully gripping script developed by Vanderbilt, Fincher carries his stylized, yet withdrawn artistic flair throughout the film with total command over both the audience and his impressively complex depictions of real-life individuals.  Although with its length it comes off as plodding and perhaps even a bit contrived at times, Zodiac is executed in such a manner that even the most boring scene under less talented oversight can be seen as compelling.  This is the rare mystery film that does not let up on tension or deliver a nice, clean-cut ending delivered in a gift-wrapped box.  Zodiac will leave you with a lingering sting in knowing that this heartless, cold, calculated criminal may still be out there.",
            "review_date": "2015-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's very difficult make a good thriller based on a real case that has never been resolved, but luckily in these days we have a master of suspense who knows how to make a great film, Mr. David Fincher.\n\nOn July 4, 1969, an unknown man attacks two young people, and kills one of them, maybe a half an hour after that, the police received a short call from the attacker informing about what had happened. One month later, the San Francisco Chronicle receives encrypted letters written by the same killer calling himself the \"Zodiac\", after this the police started an investigation with the help of a political cartoonist and a crime reporter.\n\nZodiac is one of the most compelling pictures I've seen in years,  is so explicit and is so well done that is almost impossible not to feel empathy for it. With 162 minutes so well filmed by Harris Savides and so well accompanied by the music of David Shire (with some rock classics) makes this movie a delight for the eyes and the ears. For people who didn't notice it, the visual effects are excellent in some scenes.\n\nOne and another i have to say thanks to James Vanderbilt for that exceptional adapted screenplay, what great screenwriter.\n\nRobert Downey Jr. as the reporter Paul Avery, is maybe the protagonist that less time appears on the scene, but without doubts is the most convincing performance of this picture, in spite of that, for me the best was Jake Gyllenhaal as the cartoonist Robert Graysmith, and i'm not a fan of this actor. Mark Ruffalo as Dave Toschi it's ok, but is always the same, never surprise us.\n\nIn conclution, if you like Fincher's work, you need to see it, it's very advisable. 8/10",
            "review_date": "2015-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At close to 3 hours, Zodiac is incredible. There is NEVER a dull moment in it. It's a darkly stylish (in the typical David Fincher way) and meticulously plotted epic of the notorious killer who terrorized San Francisco. Outstanding. One of the year's best.",
            "review_date": "2015-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow but undoubtedly rewarding. Great atmosphere, dialogue and solid cinematography from David Fincher. It's lenght may be a turn off for most but if you don't mind a slow film, taking it's time to build tension; you're in for a tense, quiet, smart thriller.",
            "review_date": "2015-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good but a little bit longer than preferred.",
            "review_date": "2015-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent, but very long.",
            "review_date": "2015-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie with Jake,Mark &Robert by David Fincher was bound to be great.Even though this movie was 2hr 37 min long you didn't feel tired by it.The mystery in the movie was so deep, the story was in very detail. A good mystery movie is the one which makes you decode all the possible clues in the movie,like this does. All the time during watching this movie you you try to solve it all, and sometimes it also gives hope to you that you are going to solve the case,even before everyone else in the movie does.You listen to all the dialogues and try to remember all the names and try to find the connection between them.\nThis is one of the best mystery movies I have ever seen.",
            "review_date": "2015-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the most enjoyable and thrilling I've seen in along time...",
            "review_date": "2015-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac\n\nZodiac is a crime thriller with a brilliant cast to name a few Robert Downey Jr., Jake Gyllenhaal, and Mark Ruffalo. If you like a neat story and some great acting check this one out. The plot is A San Francisco cartoonist becomes an amateur detective obsessed with tracking down the Zodiac killer.\n\nI thought this was a great and a real original film. I enjoyed the music and i also thought that there was a lot of thrills in this movie. It was not predictable and the movie started off with a bang with the first murder by the Zodiac killer. \n\nMy favorite scene of the movie was when the zodiac killer says before I kill you I'm going to throw your baby out the window I also liked every scene when Robert was at bob vaughn's house those were great scenes. I liked these scenes because they were creepy and unexpected. \n\nI have to say that the acting overall was great but the people who stood out to me were Mark Ruffalo and Jake Gyllenhaal. The way they played there characters were great. What was different about Jake's performance was he was barely shown in the first half of the movie but then he was shown a lot towards the second half of the movie. My favorite character was the zodiac killer/Liegh. He was just the most interesting character and the actor who played him was creepy and brilliant. \n\nI would give this film a 8.6 rating. I thought the acting overall was wonderful. although the movie was very long I thought that it was the perfect length to tell the story. The music was chilling and creepy it really set the mood/tone of each scene. The camera work also was great I liked the one shot of the bridge I thought it was cool how they shot the scene. I didnt love the time lapses bc I felt there was too many but then they started to space them out towards the end and show less of them so i liked it more towards the end. I thought the last 30 minutes were great. \n\nI would recommend this movie to any crime fans and anybody who was from the era. I would watch this movie again to understand it better it was a complex movie.",
            "review_date": "2015-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely amazing movie. A tremendous cast with 3 of the best actors today. It isn't an action packed film like one might possibly expect going into it but the story making of the movie was tremendous",
            "review_date": "2015-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film that's driven by it's fleshed-out characters and engaging dialogue, Zodiac may prove too uneventful for some, but it's still a taut and restless mystery thriller that's faithful to the true story its based on, perhaps to a fault, and its elevated by director David Fincher's excellent pacing and polished direction.",
            "review_date": "2015-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It doesn't aim to please or satisfy anyone, it just cares about dragging you in every minute deeper and deeper. Leaving you dazed for a long time after the movie is over - which results in a great success in my opinion.",
            "review_date": "2015-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very long and drawn out at a few points. Overall a decent watch, keeps you wondering. Kinda a crappy ending but not much you can do when based on true story.",
            "review_date": "2015-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "you know it's a great movie when it's 2 hours and 42 minutes of mostly talking and you're not bored at any point in the movie. to say i was invested is an understatement. great cast, superb directing, and a very big story. After seeing this again, I realize that David Fincher is my second favorite director after Christopher Nolan (2 viewings)",
            "review_date": "2015-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Man is the most dangerous animal of all.",
            "review_date": "2015-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty much flawless from a production perspective. A mesmerizing & almost hypnotic movie.... Perfectly directed.",
            "review_date": "2015-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "terrible movie. waste of time.",
            "review_date": "2015-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If it wasn't for its slowness this film would be very captivating: a star cast wasn't enough to flavour up a script that feels too flat.",
            "review_date": "2015-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good film. Well directed and acted. The story line is compelling and keeps you watching with anticipation.",
            "review_date": "2015-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant crime/detective story. almost as good as Chinatown.",
            "review_date": "2015-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Re-watch. A modern classic. So chilling and detailed and even with 157 minute running time it flies by. Anthony Edwards, Brian Cox, Jake Gyllenhaal, Mark Ruffalo, and Robert Downey, Jr, are flawless. Finchers use of Donovan's The Hurdy Gurdy Man at the beginning and closing credits is so f**king creepy. Pure genius.",
            "review_date": "2015-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Fincher's Zodiac is a fantastic movie that is quite scary consider that it happened in real life. Even though it's a long movie, every minute of it is necessary and it doesn't seem to be filler at all. The characters are very memorable, and actually changes throughout time which is quite refreshing as when time goes by, people do change. Jake Gyllenhaal, Robert Downey Jr, Mark Rufflio, and the rest of the cast are fantastic in it and they are perfect for it and if it was someone else that was not as good, then the movie would've been boring. There's some funny moments in it, and the movie doesn't focus on the gory effects, but more on the anxiety of it as I got really invested by it. The writing is really great, and I was focusing on it too because if I don't listen to them talking, then I would've missed something and got lost, which is something that I never done in a genre like this besides some romance films. I also like that no matter how long the case is going, even if they give up on it, there's always going to be someone who wants to solve the case. It's very unpredictable, it really make you feel like a detective and make you want to look at every little detail of it. The ending is also great which makes me think that some movies should do stuff like that. In the end, Zodiac is a very gripping and well-acted film that shows that even slow paced movies can be very interesting to watch.",
            "review_date": "2015-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie overall but it gets a bit slow in the middle.",
            "review_date": "2015-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Smart and thrilling!",
            "review_date": "2015-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing.  One of Finchers best.  The level of authenticity in this movie is staggering.  For such a long movie, it surprisingly moves at a brisk pace.",
            "review_date": "2015-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sharp and with excellent dialogues, it captures the era nicely and tells a suspenseful story with some strong characters.",
            "review_date": "2015-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great return from David Fincher along with a SUPERB cast make Zodiac a real gem. This film is not what you expect, especially when the Zodiac takes a backseat to the story. Awesome film.",
            "review_date": "2015-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fincher's #3 movie for me, Zodiac is a slower-paced investigative mystery dripping with story and elite acting.  I loved Gyllenhaal in Darko, but this movie solidified his acting skills for me even though he isn't center stage throughout.  Robert Downey Jr., who is also one of my favorite actors, is cast perfectly in his Reporter role.  This is a long film that doesn't have a ton of action, but it is very thought-provoking and tense throughout.  It is a bit ironic that Gyllenhaal's character in this movie has some of the same, creepy similarities to his character in Nightcrawler seven years later - it is the type of role that he owns.  Love this film, but have to be in the right mood and frame of mind to watch it.\n\nGrade = 8.5/10",
            "review_date": "2015-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally saw this and it was awesome!",
            "review_date": "2015-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Creepy, gripping and compelling. Fascinating how true stories, even unresolved ones, make for the best viewing.",
            "review_date": "2015-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tense, exciting serial killer mystery, based on a true story. Much style is added by director Fincher including an arch sense of humour and washed out, nostalgic period recreation. It moves along fast and is therefore fun and easy to follow the various police and journalist investigators into a murderer who reaches out to them through letters and phone calls and killings.",
            "review_date": "2014-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Too much talking rather than delivering some good suspense or thrills, \"Zodiac\" might be a good film for those who want to study dialogue, but when it comes to storytelling, it's too long and focuses mostly on a character who doesn't care about the safety of his family, even though he says he does.  Definitely a bit overrated because of its length and not much exciting things happening.",
            "review_date": "2014-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everyone knows I love a good serial killer flick especially if it's based on a true story, so I was completely invested in the film. Though some may complain about the lack of action scenes and the long length, I enjoyed it very much regardless.",
            "review_date": "2014-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "By all means not a bad movie, with solid acting, and interesting premise and a couple good scenes, but settle in for the long run. Because it feels like a long run.",
            "review_date": "2014-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It almost feels like two movies... Which is weird, but both of the movies were great.",
            "review_date": "2014-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favourite films of the last decade, slick, oozing atmosphere, disturbing and with the most wonderfully unassuming use of CGI to recreate the feel of the era.  Not a frame of film is wasted in bringing the most notorious unsolved USA murder case (after The Black Dahlia) to life.  Utterly brilliant.",
            "review_date": "2014-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A thriller that is well-directed, well-acted and all around, a very interesting movie. It has a dark and chilling atmosphere, along with some very suspenseful and intense moments.",
            "review_date": "2014-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dark, brooding, real, and intense. Fincher captures the fear of the time and what happened, perfectly, while making you understand not to just watch, but listen.",
            "review_date": "2014-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story is interesting but the movie drags on for far too long. It would have been a 4 star movie it was drastically shortened.",
            "review_date": "2014-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unlike Fincher's earlier effort, Se7en, Zodiac is more about the case than the grisly details, and it has an eerie tinge to it.",
            "review_date": "2014-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best and most intriguing based-on-a-true-story movies with really good dialogue, great direction by David Fincher, really good performances by its leads, and a story that keeps you engaged for its entire runtime and almost gets you obsessed with the case like the people in the movie.",
            "review_date": "2014-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my personal favorite films, Zodiac brings possibly the best mystery movie and best actual event story I've ever seen. It gives not only Jake Gyllenhaal acting room, but also Robert Downey Jr. as well. The dialogue and cinematography are both amazing, as it is David Fincher after all, and the story is possibly the most chilling thing I have ever seen to date. This will stand as one of my favorite movies ever.",
            "review_date": "2014-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly my favourite David Fincher film.",
            "review_date": "2014-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is the reason why I love the movies. This movie crawls under your skin, and never leaves. It's a psychological thrill ride, and another masterpiece by David Fincher. The performances, especially from Robert Downey Jr. and Mark Ruffalo, are unnervingly good. This is one of the best thrillers of the 2000's.",
            "review_date": "2014-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very crisp and clean film however for a two hour and a half film the ending was far too unsatisfying. I know that it was based on the real thing but at the end of the day it's still a movie and they could have pulled some strings to make it even better",
            "review_date": "2014-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprise! I am the Zodiac killer. MAUAHAHAHAHAAHAHHAH. But seriously, The first 45 minutes had me on the edge of my seat with my heart pounding. It was rather intense. Wonderful acting all around. Yada yada yada, so on and so forth.",
            "review_date": "2014-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dreadfully, dreadfully boring. Is it an ultra realistic depiction of a serial killer and the investigation into one? Yes. Absolutely. Does it  feel like anything happens at any point in it? Nope. Powerful performances cannot save an unmotivated story.",
            "review_date": "2014-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An investigative movie,that focuses on the murders by the Zodiac killer,real events who took place in the 1960s  and the 1970s .Zodiac is a great movie that succeeds in capturing you in its mysterious story,while also offering top notch suspenseful moments.With its clever writing,complex story arc and characters,great performances,outstanding cinematography and incredible directing,Zodiac manages to enthrall the audience from beginning to end,despite its run-time.",
            "review_date": "2014-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent, Thriller, Kept me on the edge of my seat.",
            "review_date": "2014-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Fincher treads into the dark and heavy true crime world, where everyone's a suspect and obsession is everything. It's a more  suitable story for him than say Panic Room, with a lot more subtext going on and sets him onto the true path to greatness, in my opinion. Zodiac is based on a true stories set between the late 60's and early 90's. It follows the obsession of 3 men, who's paths intertwine as a serial killer, who calls himself the Zodiac, goes on a murderous rampage and enjoys publicity with his work by playing a game of cat and mouse with the media. To this day, the Zodiac has never been found guilty, however there were many a suspect and this film tries its best to touch on what it can, without coming outright and pointing the finger, even though it cant help itself from blurting it out from time to time. Paul Avery, a big shot news reporter, with quite the penchant for fame and booze teams up with a fellow team member and cartoonist, Robert Greysmith, once the letters come flying in thick and fast and the bodies start racking up. Both men fall into a downward spiral, hunting for a man that cannot be found, eventually David Toschi gets dragged into it as a detective, who looses a lot more than sleep over his decade long obsession with catching this man responsible. It's a long winded, thick and fast who done it, without the big reveal as such. The ensemble here is top notch, not one actor out of place, Jake Gyllenhaal is ace at the code breaking and book worm cartoonist, bouncing wildly off his counter part Robert Downey JR, who plays Avery, an alcoholic drug abuser who shoots for fame and just about loses everything. The chemistry between them is brilliant, if not a little short lived. Mark Ruffalo makes up the trio with Dave, this man is such an understated actor, Ruffalo has been at it for some time now and every role he touches, he smacks with professionalism and a naturalistic nature, very few actors to date can touch on. You can see the struggle in this mans eyes constantly, Ruffalo lives this character he doesnt act him. The supporting cast of semi regular Fincher faces and Chloe Sevingy are also well cast and yet again sadly their inclusion is understated. The story is a lot to chew on, so naturally the film hurtles at breakneck speed in order to get as much information crammed in as possible, this was Fincher perfecting his craft per say, his pacing has always been top notch, but here he fires scenes that are literally blink and you will miss some very important information. As mentioned earlier, hes still honing at this point and some of the character development with Paul Avery and some supporting actors kind of just doesnt happen. It's not critical as our focus fully shifts onto Jake and Mark for the final half but to continually refrence him once every 20 mins just feels slightly too tacked on for my liking. The film is gorgeous as per, however compared to the last outing, Fincher is more reserved, he uses his techniques to great effect, in order to gain a sense of dread and desperation. sparingly using tracking shots for when they really matter and it works. It's as if he just had to get all of that out his system and figure out what worked best for what. The grade on the film is also perfect, giving a real sense of time about it, each era is reconstructed brilliantly from colour schemes on set down to musical score, even the actors aging make up is brilliant. This film does however not lure you in, its a long film and unlike most of his other films, Fincher just presents his idea to you, if you like it you will invest and be truely horrified with its tales, however he doesnt try too hard to win everybody over. He isnt waiting for everyone to catch on and names and faces will come and go as quick as minutes before becoming a by product. This movie is strictly for Fincher fans and crime purists, anyone else will be left with a sense of boredom, confusion and most likely deflation by the end of the third act. A return to form and a stepping stone to greatness. under rated but far from perfect.",
            "review_date": "2014-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is so engrossing, I found my self researching the case and seeing if any new evidence had surfaced. I believe this movie is definitely  one of david finches best films, it has great acting , keeps a good pass and  the setting and shots are just beautiful .",
            "review_date": "2014-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When it comes to actual events, sometimes there is question towards the art it inspires whether good, bad, or poor? I believe this is true when portraying a tragedy and how the artist is responsible not only displaying, but delivering a message from the event. Cinema is greatly reflects this when films are released with the hook, \"based on a true story.\" The range is broad when a hook like that is thrown, for what is true, what was made up, and what was left out. Where did this true story originate from (book, eyewitness account, memoir, rumor, etc.,) and was there anything learned from it? When a film is made from it, that is when a line is made from the s***y filmmakers to the brilliant ones. The one example I must point is David Fincher and his work in the Zodiac. Zodiac is based on the true story of the terror Zodiac unleashed with 5 (and possibly higher) murders and messages he sent to the media. What makes it fascinating or horrifying is the Zodiac Killer was never apprehended or identified even as today. People have become obsessive about the identity of the killer that it inspired books, movies, confessions, and hoax. Among these pieces, the most known is the non-fiction book Zodiac by Robert Graysmith which chronicles the events of the Zodiac from the widespread panic that was caused to obscurity. I have not read the book, but I assume Graysmith became obsessed with the subject so much that I thought of director David Fincher in his film the Zodiac. Zodiac is definitely an outstanding accomplishment from Fincher who directed The Game, Se7en, Fight Club, and Alien3. Zodiac is a lavish and authentic work with Fincher not only obsessed with telling the story, but the look and feel to it. It must have taken countless of hours and days and months to make the film while paying attention to the smallest detail. We get the looks, fashion, the music, the vehicles, and even the food when it comes to the Zodiac. The film centers around the story of the \"Zodiac killer\" and the investigation that followed by different branches of the police to a dedicated detective to even the cartoonist Graysmith (Jake Gyllenhaal). However, Graysmith is often overlooked when he expresses interest over the Zodiac. Yet, Graysmith manages to get a little help from crime reporter Paul Avery (Robert Downey Jr.) with note he has on the crime. Their newspaper, The Chronicle, then begins to receive letters from the killer taunting the police and promising to strike again. Fincher manages to reflect the tension and anxiety the city of San Francisco had. It is sometimes a little difficult to believe certain scenes happened which I would point out, but do not want to ruin it. However, it seems like Fincher has spent a great deal and focus on every scene even after film moves into the 90s. This is a definite works as a period piece even focusing on the toll it had on the characters. My favorite of all was Downey Jr. as Avery. He was pretty amusing as the film's antihero while Gyllenhaal displayed the flawed hero. He is dedicated to stopping the killer, but is oblivious to his personal life. Other performers to highlight are Mark Ruffalo, Brian Cox, Elias Koteas, and others.",
            "review_date": "2014-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Filmed smart and very nicely, interesting movie.",
            "review_date": "2014-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"I Need to know who he is. I... I need to stand there, I need to look him in the eye and I need to know that it's him.\"\n\n'Zodiac' is surrounded by incredible talent which presses its story through Fincher's vivid representation of the 70's, intentionally chilling it's viewers to the bone. You won't want to look away.",
            "review_date": "2014-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Only someone as talented David Fincher would be able to make a film with so little action so tense and interesting",
            "review_date": "2014-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting film the whole way through",
            "review_date": "2014-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was brilliant in the sense that it will keep you on the edge of your seat with mainly just smart and sharp dialogues. That is the magic of having a good cast, fine writing, and skillful directing.",
            "review_date": "2014-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When looked at as a thriller, the movie fails. It isn't thrilling. Maybe I'm too seasoned a horror fan to be affected by the scenes of graphic violence, but nothing had me at the edge of my seat. What kept me watching (all 157 min.) was the incredibly deep drama of watching a cartoonist, a crime reporter, and a detective try to solve the Zodiac murders. The film works best as a drama, and an academic piece of film. Its directed with restraint and discipline by Fincher, who never loses sight of what he wants the film to be. He doesn't take any shortcuts by killing off a main character's wife, or even a main character at that. He doesn't do anything that didn't happen, and quite frankly that isn't as exciting as watching his film Seven (a film easily comparable to Zodiac). That being said, this film has a lot more to say than Seven about the nature of man. The Zodiac killer was obsessed with \"The Most Dangerous Game\", and that short story's themes run deep. The killer hunted humans, but so did everyone else when searching for him. Man is the most dangerous game, and it can overtake people's lives if they let it. This film is good, it might even be great. I just wish I enjoyed watching it more. I'm not saying I wanted Fincher to add anything exploitative, but perhaps a shorter run time would have been better.",
            "review_date": "2014-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is, without doubt David Fincher's masterpiece and unbeknownst to everyone at the time, it will become the benchmark for all future Fincher films. It is the perfectly realised balance of a fine script, brilliant performances, technical acumen and above all an implacable restraint that is made all the more potent for the films one hundred and sixty-two minute length. All the problems with Se7en (still a great film) are obliterated in Zodiac, a far more difficult film to \"enjoy\" mostly because of the enormous cerebral pressure it places on the thinking viewer. The themes here are large: American obsession with serial killers, media interference in police procedure, pulp fictions obsession with true crime, the attention to detail of the obsessive, the reflexive nature of societies imaginations, the costs of obsession, the effects of time and memory on history, etc. If Fincher refused to turn the camera on his audience in Se7en, he does so with a cool calculated gaze in Zodiac, a film that rarely wavers into Fincher's characteristic flounces, such as helicopter shots or ambient police torch-light. Much of Fincher's integrity comes from a clear intention to tell the truth of the story, possibly because it is the first \"true story\" film Fincher will make, and his intention to avoid glamorizing the serial killer as he did in Se7en. By keeping so close to the facts of the story, by retaining a self consciousness about the end product, the meticulous perfectionism that characterises Fincher's directing style becomes the perfect vehicle for a long drawn out film about obsession on details.\n\nZodiac's opening scene is a fine example of the films merits. With Three Dog Night's lilting cover of 'Easy To Be Hard' wafting, the scene is of Vallejo, California on the fourth of July, fireworks bursting over the city. Darlene Ferrin (Ciara Hughes) is on her way to pick up Mike Mageau (Lee Norris), but the camera examines the houses celebrating fourth of July from her eye as she drives. When she drives Mike to a secluded lovers lane, another car approaches and although Mike wants to leave, Darlene claims everything is alright and doesn't make a move to drive away. Donovan's haunting 'Hurdy Gurdy Man' comes over the radio and increases as The Zodiac steps out of his car and shoots the pair. It's the scene that will become the defining murder leading to a suspect by Robert Greysmith (Jake Gyllenhaal), the cartoonist at The San Francisco Chronicle who becomes obsessed with solving The Zodiac's puzzles and then the murder itself. Opening the film with the murder that causes the films denouement is not only clever writing, it also speaks to the fascination of the Zodiac obsessives. Fincher makes a film that the obsessives will love, even as he casts a shadow over the costs of that obsession. Greysmith, the writer of the two books the film is based on, is an obsessive, and James Vanderbuilt's decision to base the story on the fanboy who writes the books rather than the story of the killer is all the more powerful because it includes the detectives working the case as complicit in that obsession. If Greysmith becomes preoccupied because he loves puzzles and can't prevent himself from falling down the rabbit hole, then even more chilling is the fate of detective Dave Toshci (a soft-spoken Mark Ruffalo) who becomes haunted by association. Both men are reflected in characters who represent an alternate choice, Paul Avery (Robert Downey Junior) who sinks into depression and substance abuse against Greysmith's vigilance, and William Armstrong (Anthony Edwards) who voluntarily gives up detective work altogether because of the impact on his family against Toshci's being demoted and barred from the case for sending his own Zodiac letters. All four men will be ruined by their obsession with Armstrong as the only one who escapes. Fincher inserts wonderfully understated images to reflect this obsession, such as Greysmith, alone in his apartment filled with files about the Zodiac case after his family have left him, flicking through his newspaper clippings chillingly preserved in a family photo album.\n\nZodiac is the film where Fincher first gets his reputation for needing seventy takes on a set, and being so fastidiously precise that he gains support from the real life Toschi as well support from Vallejo police who hope the film will spark interest from the public. The film works within the obsession, becomes the obsession if you like, making itself another media representation of what it is seeking to expose. The Zodiac killer played with the media, using it to enhance his  notoriety. From the badges Paul Avery has made that everyone wears that say \"I'm not Paul Avery\" through the comment William Armstrong makes to David Toshci when Avery supposedly discovers the Zodiac's first victim, \"It's very real. You know how I know? I saw it on TV,\" to the incredible collection images used in the montage of media lettering and zodiac puzzles sliding and moving over the top of the detectives trying to do their job.   This obsession with representation through the lens makes the Zodiac a different serial killer, a modern serial killer, and this becomes Fincher's second film that points to a problematic relationship with the camera. The Zodiac is never caught, which is interesting seeing as he calls famous people regularly, sent letters to the press, and forged personal relationships with the people obsessed with catching him. In Panic Room, David Fincher told us video surveillance becomes a self-cogitating nightmare, the lens always pointed back at us. In Zodiac he uses the media and film in the same way, revealing a relationship with technology that uses us more than we make a use of it.\n\nIt's easy to talk about Zodiac all day, but I wanted to make one additional mention of the incredible performances, which Fincher has claimed, came \"from the fifty-fourth take.\" It is a film that uses detail almost like a character, but this extends to the performances, with everyone at the top of their game, making this Fincher film the best in his collection.",
            "review_date": "2014-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gripping and filled with anxiety, David Fincher delivers another successful thriller with his style, this time through mostly dialogue and information rather than imagery, certainly a reversal of what he did in Se7en.",
            "review_date": "2014-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just finished watching this for my first time! I can't believe how light-on-its-foot this film is with it's dialogue and still incredibly tight direction. I was pulled in from the beginning to the end. I never wanted it to end once it really started going. Also, I think Gyllenhaal gave his second best performance I've seen from him in this film. That mother fucker can ACT. I don't understand any hate for that man whatsoever. Definitely in my top 5 Fincher films now.",
            "review_date": "2014-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is a very good film that has some great direction,incredible acting and some clever writing.The movie was always interesting because the dialogue was so well written.I don't think this is perfect at times it got a bit convoluted.Though overall Zodiac is a film well worth your time see it.\nGrade A-",
            "review_date": "2014-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is much grimmer and hide in the shadows to narrate the story with full of thrilling party to come, and it gets your adrenaline in turbulence.",
            "review_date": "2014-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is a slow-burn but hypnotic thriller by master director David Fincher. It's often frustrating but always riveting, with great performances.",
            "review_date": "2014-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Totally engrossing and captivating even for a 3 hour dialogue driven film. David Fincher weaves his magic once again. A+ performances all around.",
            "review_date": "2014-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A cinematic masterpiece. You could spend decades analyzing this movie, and that's the mark of a truly great film. David Fincher does it again.",
            "review_date": "2014-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just outstanding. Based off the book and the actual life events, zodiac really drives in deep to a gritty murderer that obviously kills people and the police can't figure out who it is but half way through the audience knows who he is, they don't say it but from when we see him we automatically know, \"yep that's him\" plus with a star cast and it is just a beautiful thing to watch. Well done.",
            "review_date": "2014-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really strong suspenseful mystery film with brilliant performances all around by Gyllenhaal, Ruffalo and Downey Jr!! Quite enjoyed this film, probably one of Fincher's more underrated films!",
            "review_date": "2014-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm convinced that David Fincher has chosen his filmmaking oeuvre as a way to disturb and test our senses.  Time and time again he's made movies that defy and challenge our capabilities for tolerance with an appreciation to delve into the darker underbelly of the living.  He did it most notably with SE7EN and FIGHT CLUB and has not stopped since [GONE GIRL, playing now, is his latest].  ZODIAC is certainly no exception but for the fact that it is based on a true, technically unsolved serial murder case that impacted an American nation for over a decade back in the sixties and seventies.  By setting its dark tone at the very start and building up to its frightening, inconclusive ending, Fincher manages to crawl his obsession with cruelty and madness under our skin.  It's a terrifying tale, told in a very simple step-by-step, matter-of-fact manner, painting an ugly portrait of life and then subjecting us to keep a mesmerized gaze at the screen only to realize we've been conned into watching a horrible reality steeped in a unending nightmare.  Something that's hard to wake up from or to fall asleep after. Sensational for all the right reasons, with ZODIAC Fincher once more proves he's equally smart as an artist with a vision as he is a storyteller with a lure.",
            "review_date": "2014-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fair depiction of, but more of an assessment of the unsolved Californian murders, which is the only frustrating aspect of the film given there's really nothing concrete gained after the epilogue text has concluded the long but very watchable proceedings.",
            "review_date": "2014-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Zodiac\" is one of David Fincher's best thrillers. Not only does it refer to its true-story source material accurately (probably more than most true-crime movies do) and portray the 70's realistically, but it has an evident dread and mood about it. The movie is less about the murders the Zodiac Killer committed (even though those moments are quite chilling) and more about the intense exhaustion and obsession that went into the investigation. Working from a script by James Vanderbilt, Fincher and his all-star cast knock it out of the park.",
            "review_date": "2014-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 2007 film Zodiac-about the infamous (and anonymous) hooded Zodiac serial killer who first emerged in the late 60s-is a hefty slow burn of a film about the process in bringing a mysterious murderer to justice. It is also a very dark and cynical look at the American Judicial System, where the misuse of media, coupled with mass hysteria and the lack of communication (or too much information) can lead to more harm than good. Being directed by David Fincher, his usual color palate perfectly exhibits the (lack of) hope of finding a faceless person with vague clues and intuitions into a bleak reality of false dawns and insensitive actualities. This isn't Dirty Harry-referenced in a very tongue in cheek way-were a Magnum can make a Perp squeal and confess. No, Zodiac depicts the arduous and time-consuming detective work where Due Process is the only lawful method of bringing people to justice. Showing such a time consuming process-a process that spans more than twenty years in the picture-has a fallout of the film being roughly 2  1/2 hours in length, but the viewing experience never \"feels\" long. The way Fincher glides from month to month (or year to year) is at first eye widening, then anxiousness creeps in, then it becomes darkly funny to finally wrap things up in a slightly underwhelming manner. Like Stanley Kubrick before him, Fincher isn't the most heartwarming filmmaker and he depicts things in a sterile, unflinching-or un-Finchering-way. Not to say the film is devoid of emotion as Jake Gyllenhaal and Mark Ruffalo both portray two tortured souls who commit their lives to finding out the true face behind the mask. Their descent into an endless abyss of circulated information is both cynically funny and depressing.  At the core of Zodiac is not a police procedural, nor is it a homicide mystery. Rather, it is a portrait of obsession and the lengths people will go to find solitude from their obsessions. It never really \"builds\" to anything in a traditional film watching sense, which may feel unsatisfactory. This lack of conformity leaves Zodiac sticking out like a partial fingerprint at a crime scene-there is a larger story behind it all-and Fincher patiently lets it all unwind in a grueling, timely, manner.",
            "review_date": "2014-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a long movie and it did feel long but it never felt boring.  The pacing was good and it kept you guessing throughout the full movie.  I enjoyed this movie more than Se7en but both are good films in this genre.  The scary part of this movie is that it's actually based on a true story!",
            "review_date": "2014-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Driven by dialogue rather then gore, this film is still gutrenching. A fabulous look at one of the most notorious mass murders in history. \nGrade: A-",
            "review_date": "2014-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was very long and dragged out, but had just the right amount of suspense, thrill and disturbances.",
            "review_date": "2014-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hypnotic endless story",
            "review_date": "2014-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best thing about \"Zodiac\" is how far away it goes from typical serial killer movie tendencies.  So many other films with a famed murderer as its subject tend to strive away from the real-life tragedies and make it one juicy filet of madness.  But \"Zodiac\" doesn't focus on the criminal behind the actions - it is instead like \"All the President's Men\", portraying a group of people who would not rest until the truth finally came to light.  \n\tFamously, the Zodiac was never identified, nor brought to justice, yet the film gives us closure that can't be felt through a Wikipedia page or a true crime novel.  It's a rather quiet, slow film, its 157 minutes just as long and frustrating as the investigation itself.\n\tThe film opens with a murder, bizarre and bloody, and instantly we feel the same sort of eyes-agape anxiety the public felt during the time the Zodiac was at large.  The killer shoots them, a flashlight taped to his gun.  The victims are a clean-cut couple at a lover's lane, and only the man survives.  We already begin to lock these minute details into our brain to look for patterns, inevitably.  \n\tBut Fincher isn't fixated on the killings, nor does he try to make them cinematic.  They are quick, horrifying, and almost awkward.  Real murder isn't artistic in the way the shower scene was in \"Psycho\", after all.  \n\t\"Zodiac\" is intent on solving the case, not dwelling on the carnage.  We are introduced to Robert Graysmith (Jake Gyllenhaal), a cartoonist, Paul Avery (Robert Downey Jr.), a reporter, and David Toschi (Mark Ruffalo), a detective.  The three are the most involved in the solving of the case, even if Avery eventually falls off the deep end.  Graysmith dedicates much of his life to it, which eventually disintegrates his marriage, while Toschi busies himself with other things, but can't help but still be curious about the murderer's identity.  \n\tThere are so many false leads and dead ends that they are just as maddening to us as the people who actually lived it.  Sure, the Zodiac killer eventually stopped being  pressingly infamous, but the fact that we never find out who he is is like receiving an everlasting bug-bite that you can never scratch.\n\tThe public is always fascinated with serial killers, transforming the gore into a paranoid thrill ride.  The backstories, the psychology, the mindset of the murderer can be an uncomfortably compelling thing.  Even I'm guilty of this.  But even with the most research, the most inside details, it's impossible to know the people that were touched by all the untamed danger. \n\tThe film spans over two-decades, and the beauty of it is that there are moments of terrifying intensity with others that are deadly boring.  But without boring bits, \"Zodiac\" wouldn't nearly be as good.  It's so true to life that those moments of nothingness make the film feel even more authentic.\n\tIt's a long, imperfect ride, but \"Zodiac\" has a fantastic set of actors and a top-notch director on its side to make even the dullest of bits turn into something of interest.",
            "review_date": "2014-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is a great cast line up ever with the most astonishing character development ever! I think every actors played their role really well and produce a superb thinner film to watched! This remarkable movie from David Fincher has proved that he deserves to get an oscar in his next movie, the social network. This is stunning!",
            "review_date": "2014-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this was very well done, and while I could have done without some of the language and the violence, the performances of the primary actors were excellent. What I think the director does best with this film is tell two stories: the story of the killer, and the story of those who seek to bring the killer to justice, and the obsession that develops in some of them as a result. Very engaging.",
            "review_date": "2014-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fascinating and chilling thriller that will keep you gripped from the very start.",
            "review_date": "2014-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I expected a little bit too much that this would be haunting for me. It's not.",
            "review_date": "2014-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "David Fincher delivers a suspenseful thriller that keeps you guessing, and makes you wanting to figure out who the Zodiac is as much as Gyllenhaal does.",
            "review_date": "2014-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fincher at his very best. In Zodiac he elicits superb performances from his cast. Since I first watched this at the cinema I have returned to it repeatedly. Each visit offers up something new and this is now one of my favourite films of all time.",
            "review_date": "2014-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fincher grabs you by the balls and holds you there for the duration of the movie. A slow burning mystery of one of the most infamous mysteries in history, it's a great film.\n\nThere are two detectives working this case. One, an actual detective played by Mark Ruffalo, and the second is a cartoonist played by Jake Gyllenhaal, whose character wrote the book the movie is based off of. Both men perform their roles admirably. Nobody really gives a powerhouse performance, but nobody is really given any meaty scenes to show off, though a couple of the zodiac suspects are particularly creepy, especially one that was a former film projectionist.\n\nThe real star of the movie is David Fincher. Every directorial choice he makes is absolutely perfect. We see the most famous murders committed on screen, and the ones that took place during the night are astonishing. The killer's face is never revealed, as it should be, but the way the lighting works in these shots is truly great. The cinematography is really fantastic.\n\nA great mystery, a great thriller, and a darn solid movie.",
            "review_date": "2014-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is subtle, yet haunting. It has so many mysteries that cannot be solved and add an eerie backdrop to the film. The film is dialogue-driven but leaves the viewer in suspense at every turn. David FIncher's fine direction also makes the movie excellent. He uses brilliant camera angles to worry the audience, and add a strange feeling. Zodiac mainly succeeds because of its 70's setting, and the mysterious killer that always remains silent.",
            "review_date": "2014-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is a haunting, creepy story that takes place during the Zodiac killings in the 1960's. Jake Gyllenhaal portrays a sketch artist working for a newspaper company who becomes obsessed with exposing the identity of the Zodiac killings, and does so extremely well. This is one of Gyllenhaal's best roles, and possibly one of David Fincher's best films to date.",
            "review_date": "2014-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I might have expected too much from this because of the cast and the reviews, but I have watched this movie multiple times....on accident. Not memorable enough for such a grand history.",
            "review_date": "2014-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really great all around film. From the director down to the great cast solid story, an enjoyable mystery crime movie.",
            "review_date": "2014-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "fantastic all I got to say. Jake Gyllenhaal is the most underrated actor ever. he deserves more attention for his movies.",
            "review_date": "2014-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was good but not great.  I went in having no prior knowledge of the Zodiac killer and the mood of the late 60's and 70's surrounding it.  The acting was great in it but the subject material left the plot a bit wanting.  Worth watching once.  Probably won't see it again.",
            "review_date": "2014-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Director David Fincher proves once again he is a force to be reckoned with!",
            "review_date": "2014-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I mostly watched this movie because I love Jake Gyllenhall's beard and Robert Downey Jr's wit. In a movie together? I'm sold.\n\nThe movie overall was thrilling and fascinating. While slightly slow-paced at times and a little confusing, it definitely struck a chord with me. I did feel a sense of the dread that I'm sure was felt in San Fran when the Zodiac killer was around. The ending left a little to be desired, but overall it was a great take on a terrifying true story.",
            "review_date": "2014-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies.  The actors,  direction and screenplay create a riveting and tense movie,  though long,  is worth sticking with until the end.",
            "review_date": "2014-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Would watch it again and be just as thrilled as the first.",
            "review_date": "2014-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome me psychological thriller with Jake Gyllenhaal. Can't believe it's based on a true story I would definitely recommend this movie",
            "review_date": "2014-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enjoyable but boring at times. 3.4 stars",
            "review_date": "2014-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Zodiac\" is a film that has a handful of very impressive scenes, good performances, and a fascinating story. However it also drags in multiple places. Its not really the movie's fault that all of the scenes are relevant since it is a true story but sometimes it becomes a little dull. David Fincher is a capable filmmaker and he directs the film well but he definitely has better movies under his belt. Overall, this is an intriguing look at the Zodiac killer story and its made skillfully despite various dragging moments.",
            "review_date": "2014-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a script that was made for David Fincher as a director, and he does wonders. The cast is first rate and the very understated style works. Of course about 20 people saw it in the theater but with the advent of DVD that can now be remedied.",
            "review_date": "2014-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great drama film that is suspenseful and does not have unecessary action thrown at the viewer just because. A complex story is told and does not have a huge plot twist that just throws the audience off. A great performance from a great cast bring to life this story into a film. Loved the film, very complex.",
            "review_date": "2014-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is incredible it's the story of a man who stalked San Francisco and bragged about his crimes in the newspaper. First off, this movie is extremely interesting. It will get you hooked on the zodiac killer and you will want to find out who he is just as much as Jake Gyllenhall. The acting in this movie is great especially from jake as he becomes more and more obsessed with the case. Zodiac is fascinating, engrossing, and entertaining. By the end of the movie you will want to read everything about the Zodiac Killer and who he is.",
            "review_date": "2014-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How do you make a dramatic film about a real-life serial killer who was never caught? It's a pretty tall order, but I think they found the answer to the question with Zodiac. The first way they managed the seemingly impossible task was to avoid all the Hollywood tropes you find in serial killer films, in fact this one is so far removed from those cliches that it almost doesn't fit the genre. You see the focus is not really on the killer, we get a few brief scenes of his murders, but they take up a very small portion of the story. Instead this is about the people surrounding the case. It looks into the intricacies of police work, the time spent in the newspaper office dealing with the letters they received, and even the obsession of one lone man who \"just has to know.\" There are loads of scenes that, in the hands of a lesser director, could easily have been boring or slowed the pace of the film. Yet David Fincher finds ways to make digging through paperwork, and questioning suspects seem exciting. Somehow, despite the fact that I knew the end result of the true story, they managed to keep me engaged and questioning whether they would be able to nail this next suspect.\n\nI won't waste time talking about the acting performances, because they all were amazing. In fact I would say these are the finest performances I have ever seen from Jake Gyllenhaal, Mark Ruffalo, and Anthony Edwards. But every other performance was solid as well. The visual look of the film was also amazing. Just like playing intense music, the dark look to certain scenes added to the unsettling atmosphere. It felt like at any moment someone could get murdered or someone could be revealed as the killer. It was masterfully accomplished because I imagine that was exactly the feeling that people had back in those days. Yet Zodiac isn't all perfection. There are some moments in the movie that feel unnecessary for the main storyline. I know that the director and writer met with tons of people who were there at the time in order to find out how things actually happened, but as a result of this I think they included more minute details that were completely irrelevant to the story they were telling. This resulted in a longer run-time than I think the film warranted. My only other complaint is that, yes it's Hollywood cliche, but I want closure. I like that they held to the true story, but it's so unsatisfying walking away without the bad guy being caught. It's a minor complaint in what is otherwise an amazing film, which I highly recommend.",
            "review_date": "2014-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "enjoyed this - by Mr Fincher of course",
            "review_date": "2014-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Have watched 'Zodiac' a number of times and am always gripped by the very clever use of colour, cinematography techniques (a matter-of-factness in close-up and framing) editing and very astute casting. This is a tremendously dense and fact-laden story which might have been lost sight of if not for Fincher's dedication. Less than half way through the film, the three principle detectives interview Arthur Leigh Allen at his work place and through a couple of semi-closeups two of the detectives actually speak right to the camera - displacing any pre-conceived notions the audience might be entertaining about Allen being just another suspect in a long list. Brilliant.",
            "review_date": "2014-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie all about mood and the tragic sense of not knowing. One of David Finchers' most under appreciated masterpieces.",
            "review_date": "2014-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some may find it a bit more boring than myself, but for anyone who has ever been interested in mystery, suspense or codes will find some amount of enjoyment from this amazing piece. Myself, I can't find a more absorbing, creepy and entertaining movie all based on a real life event. Defiantly not your average \"Based on actual events\" cash grab horror film, this is a masterful and consuming film, with great performances all around.",
            "review_date": "2014-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good. 7.7/10. B+. Worth seeing at the theater.\n\n\nPROS: great dialogue, very well-written narrative, overall enjoyable, great direction\n\nCONS: some boring moments, some sloppy elements of narrative, some characters with no depth",
            "review_date": "2014-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is easily the best film adaptation of the most puzzling and somewhat annoying criminal cases in American history. I say it's the best because of its story which is strong and relatively easy to follow not to mention a very successful and talented cast including Jake Gyllenhall, Mark Ruffalo and Robert Downey Jr. So with these three powerful leads it sets a high expectation for the film, and for me it never really seemed like disappointing. Going back to the story/plot everything is done really well including characters evolution, music etc. but also Zodiac sticks to the point of the story and doesn't have any surprise twists or turns which would probably mess with the story. A dark suspenseful thriller that I really enjoyed and liked how everything turned out.",
            "review_date": "2014-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A tight and epic crime drama upheld by fantastic direction and acting. Perfect pacing and truly outstanding writing.",
            "review_date": "2014-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Zodiac Killer will always be an interesting subject to me, and this movie just helped me visualise things better.",
            "review_date": "2014-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "At first I didn't like it but then I just loved it. Everyone in the movie is great. Kinda scared me when I found out at the end that this was a true story.",
            "review_date": "2014-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow paced yet very well told story. Not a classic thriller but gives you the chills time to time. Worth watching it",
            "review_date": "2014-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The talented \"Zodiac\" murder brings upon three detectives (one being an amateur since he is a cartoonist) that begin to build lives around finding the killer. A cartoonist may not seem to fit in with being a detective, but it is worth it, since \"Zodiac\" is based on a true story. Lots of mystery films rely on detectives instead of other people that would make a film fascinating. The cartoonist Robert Graysmith, played by Jake Gyllenhaal, is the amateur detective: creative, enthralled, and hooked to solving who the \"Zodiac\" killer is.\n\nAfter getting into \"True Detective\" on HBO, this drew me into watching \"Zodiac.\" The letters that the killer writes to newspapers shows how far detectives would go to solve a murder. The killer keeps up to date to find people to kill, and even broadcasts himself on the radio anonymously. This film is definitely the where a murder crosses the line.\n\nThe two other characters involved are distracted. The alcoholic journalist Paul Avery (Robert Downey JR), receives a letter from the \"Zodiac\", quits his job, and remains in solitude and does nothing, except drink. He chooses this behavior because when the \"Zodiac\" gives notifications of any of his homicides, he makes it his goal to kill people immediately. The overwhelmed detective David Toschi (Mark Ruffalo) is the head of the case, but the killer's strategy is too perfect for Toschi to solve. Safety is the major concern for both Avery and Toschi, because the \"Zodiac\" knows they are targeting him. But Graysmith is the most disciplined with puzzles to crack which person the \"Zodiac\" is.\n\nGraysmith and Toschi have a strange relationship. Toschi dislikes Graysmith. Graysmith spends days and nights with files and reports to finish the investigation. This makes Toschi to be annoyed with Graysmith because...Toschi sees the \"Zodiac\" is impossible to solve.\n\nThe script is written by James Vanderbilt and is long. This caused some of the dialogue to be talked through quickly, which was why the investigation or conversation scenes required viewer's full-on attention.\n\nThere is a reason why this film is well-played...Fincher's directing style of multiple takes to make scene have a purpose. If you remember the opening scene in \"The Social Network\" (with Jesse Eisenberg and Rooney Mara) that conversation took ninety-nine takes. The frequent takes of the fast dialogue in \"Zodiac\" is perfect. That made me watch as thoroughly as possible, and get involved with the film.",
            "review_date": "2014-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can watch this movie so many times and never be tired of it. Following the obsession and interest of Robert Graysmith into one of the most infamous murder mysteries, this film also does a great job of depicting a murder investigation process realistically rather than speeding to a conclusion.",
            "review_date": "2014-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thrilling at times coupled with a strikingly wonderful acting performance from Jake Gyllenhall, Zodiac, however, is too informative.",
            "review_date": "2014-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The suspense builds in this detailed and extremely well-done thriller about one of history's most infamous killers. David Fincher has created a gripping masterpiece.",
            "review_date": "2014-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I find Zodiac to be an incredibly engrossing film, working on many levels. I will warn you, it is probably not for everyone. SPOILER ALERT! Keep in mind the actual investigation remains open to this day and the case remains just as much of a mystery today as it ever was.  As a child who grew up during a time in which this case was highly publicized I realize I may be in the minority of people who will find this film highly intriguing.       With that said, for me, every level of this film works. All of the performances in this film are deeply convincing, with Gyllanhaal, Downey and Ruffalo perhaps doing some of the best work of their careers.  Fincher as usual, keeps this film extremely morosely tense from its opening scene and throughout the entire film. As a film, it is intelegently written following the Graysmith book, rather than the actual investigations.\nSPOILER ALERT; Keep in mind that there were many suspects in the actual Zodiac case and there is an equal amount of data dismissing much of the circumstantial evidence revealed in this film. But as a film, I find it to be highly under appreciated and consider it be be among the decades best.",
            "review_date": "2014-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dark, brilliant, and captivatingly tense, Zodiac is a nuanced crime noir that accurately illustrates the human experience amidst an historically famous backdrop.",
            "review_date": "2014-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Greatest movie all time! Spectacular performance by Jake Gyllenhaal.",
            "review_date": "2014-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fincher is probably one of my favorite directors in Hollywood, and it is movies like Zodiac that solidify him as such. The characters in this movie are ridiculously well developed. For a dialogue heavy thriller, Zodiac is every bit as entertaining as an action movie- and it is twice as engrossing. The movie is ultimately a tale about obsession. It chronicles one man's exhausting search for truth, even as his obsession begins to get the better of other parts of his life. The protagonists in this movie are sucked into the intrigue and mystery surrounding the Zodiac Killer, and Fincher captures this intensity and desperation perfectly. At times frightening, at times frustrating, Zodiac is the best police procedural I have ever seen. Gyllenhaal and Ruffalo deliver the script perfectly and manically. And in their borderline hysteria, the viewer is effectively and equally entranced as the characters.",
            "review_date": "2014-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely fantastic movie!!! One of my all time favorites!!!",
            "review_date": "2014-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lots of talking. I don't quite remember what happened after watching it but I remember liking it.",
            "review_date": "2014-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best mystery movies",
            "review_date": "2014-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fact-based mystery like no other, Zodiac deserves a watch.",
            "review_date": "2014-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Knowing the way David Fincher's movies work, I was expecting a twist at the end, and I was disappointed when there wasn't one. However, Zodiac is still terrifyingly creepy, eerie, and its suspense level rises into Hitchcockian territory. Fincher's refusal to tie up loose ends in the movie as far as leads doesn't seek to confuse; instead, it seeks for the viewer to try to solve this case in his/her head. And for that fact alone, this movie stands out above the average genre fare.",
            "review_date": "2014-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zodiac is a well crafted thriller based on the 70's manhunt for the notorious killer of the same name, with meticulous direction from David Fincher.  Boasting strong performances, layered characters, great cinematography and genuinely intense moments bound to leave viewers frozen with fear, this is a nearly perfect film.  Nearly, because it's lengthy run-time can definitely be felt at times, making slow sections inevitable.  Nonetheless, despite its slightly surplussed length, Zodiac is a chilling noir with a strong script that manages to generate genuine angst without the need of excess gore.",
            "review_date": "2014-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another suspenseful thriller film from David Fincher, for anyone interested in the Zodiac Killer, this film is perfect. On a filmmaking note, the stunning cinematography and music make a deadly combination, together with the fantastic screenplay and terrific actors. A damn good piece of work!",
            "review_date": "2014-03-25",
            "source": "rt",
            "lang": "en"
        }
    ]
}