{
    "rating": 9.1,
    "release_date": "1974-10-10",
    "num_reviews": 90,
    "genres": [
        "Drama"
    ],
    "summary": "Mabel Longhetti (Gena Rowlands), desperate and lonely, is married to a Los Angeles municipal construction worker, Nick (Peter Falk). Increasingly unstable, especially in the company of others, she craves happiness, but her extremely volatile behavior convinces Nick that she poses a danger to their family and decides to commit her to an institution for six months. Alone with a trio of kids to raise on his own, he awaits her return, which holds more than a few surprises.",
    "reviews": [
        {
            "content": "Gena Rowlands is amazing. Hard watch but  me every time.",
            "review_date": "2021-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gene's performance is golden. Mabel is a warm and loving person, and it seems like her mental illness is primarily exacerbated by the embarrassment and shame that others project onto her. She is surrounded by selfish and abusive people, the main one being her husband, yet she is always the one being derided. It's sad to see her struggling with her mental health, oftentimes seeming completely lost, but it's also sad to see the behaviour of those around her and towards her.\n!!SPOILER AHEAD!!\nMabel throws a party and dances with the kids and gets committed for it, yet it's fine that Nick can shout and bully and manhandle and ply the kids with alcohol? Such bullshit. This film made me angry. I would punch Nick in the face. Mabel is the one with the mental illness, but it seems like it's everyone around her that's wired wrong. Nick's the one with the real problem... he's deceitful, manipulative, aggressive, and just a general all-round dickhead.\nMabel's return is painful to watch - the fake fawning from the people who fucked her over; the creepy and spineless parents; the husband who sent her away for being crazy and now wants her to \"be herself\" but berates her for doing so; the doc telling her to \"calm down\", as if that ever helped anybody. None of them really care about her mental health, they just want this particular acquaintance of theirs to be \"acceptable\".\nI guess this film is a great representation of the ignorance of and stigma towards mental illness and the toll it takes on families, and the fact that just because someone is \"crazy\" doesn't mean they can't be a better person than the so-called \"sane\" people around them.\nP.S. Did I mention I hate Nick?\nP.P.S. Those poor kids.",
            "review_date": "2021-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outside of lingering annoyances, Cassavetes finds behavioral truth that dictates story. Though I believe in similar means to achieving a result, I disagree with his too loose approach, which amounts to people simply acting weird or loud on screen. There are times we really connect to empathy-worthy emotions, and other times it's a dramatic equivalent to mindless Hollywood action for the sake of action, completely losing my attention.",
            "review_date": "2021-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliantly well made just not enjoyable to watch. You'd really have to be in the mood to sit through a searingly intimate scene of a woman who is out of control and her hot headed abusive husband. It's not the light hearted and whilst it's well acted it's just too much and too little at the same time. A chore.",
            "review_date": "2021-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cassavetes' overlong semi-improvised portrait of a blue collar marriage buckling under the strain of addiction and mental illness is compromised for most of its running time by self-indulgent acting and direction. What should be seriously affecting becomes maudlin and self-important, as if everyone involved believes they are creating a cinematic masterpiece that will garner awards. Such a pity because the subject itself is certainly worth dramatising, and has been with greater artistry by others.",
            "review_date": "2021-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Woman Under The Influence - Everyone Is Under The Influence\nThere are some who regard Cassavetes movies as fine examples of improvisation but this is quite removed from the truth, they are as scripted as anything you could watch. This one is slightly more ‘connected' than some others, but still contains all his trade-marks:-  overacting, formless overlong scenes, with sloppy camerawork and editing. Many of his ‘home-movies' appear to have been made to provide work for his drinking buddies and immediate family – often they seem to play-out more like extended commercials for Booze and King-size cigarettes. \n\nWithin this same formulaic approach, his pals and family consume massive quantities of  alcohol, courtesy of J& B, with endless shots of the bottle labels placed in prime positions of each shot (often with the label facing directly to camera to make sure you get the message) They also smoke back to back, endless cigarettes and whatever else – in fact, it looks more like these movies might have been designed to keep everyone in free grog and smokes (this, from what we are constantly told, is an accepted endless pastime in Hollywoodland)\n\nThe scripts for any one of these films would be lucky to have handfuls of fully written dialogue pages, but most all run for well over two hours - with endless repetitive scenes that could easily have been wrapped up far more convincingly in 80-90mins maximum. Those who don't mind spending time with a chap who sadly drank and smoked himself into an early grave – might last the distance, others might be warned to seek more ‘accessible' entertainment.  Apologies to the fans but ticket sales suggest John was actually a better actor than movie-maker, and it's a pity we did not see more of him in quality mainstream shows such as ‘Edge Of the City', etc.",
            "review_date": "2021-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Painful watch, especially the dinner scenes.",
            "review_date": "2021-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Who is the crazy one at this house? How \"normal\" should look like?",
            "review_date": "2021-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fair to say I definitely did not expect to be sucked into this naturally raw and exquisitely shot film about a family undergoing crisis. The domestic tension Falk and Rowlands were able to create with some of the most uncomfortable scenes of marital strife I have ever witnessed in a film were beyond admirable and made it possible to become totally absorbed in these longer scenes, which when strung together create an emotional portrait of the impact mental illness can have on a family. The cinematography was exceptional as the intimate manner in which this was shot made you feel right in the middle of these private and personal moments, which many of us may never experience or witness, usually taking place in homes behind closed doors.",
            "review_date": "2020-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A striking portrayal of domestic discord told through two completely different characterizations; Rowlands' Mabel dearly loves her family but lacks the social adjustment to convey that love appropriately, while Falk's Nick similarly cannot relay his emotions, his interpersonal skills are much more conventional. Together, they share a torrid but sincere romance with their children caught in the middle, and the roles taken together offer a searing criticism of domestic life, family structure, and romance. Characters are nailed home by long, discomforting scenes that invite the viewer to squirm in their seats alongside the rotating cast of nervous onlookers. The performances put forth by Rowlands and Falk are nothing short of stellar, creating a disturbing balance in their characters' relationship that seems at first conventionally distressed but ultimately is revealed to be far more volatile, ready to fall apart at the slightest provocation. Perhaps not all of the content was necessary to hammer home the narrative, but each scene certainly contributes. Perhaps the best of the many collaborations between writer/director Cassavetes and Rowlands. (4.5/5)",
            "review_date": "2020-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1001 movies to see before you die.  Sad and powerful blue collar drama.",
            "review_date": "2020-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the greatest performance by an actor-male or female-not to win an Oscar, Gena Rowlands masterfully flows between anxious, alluring, vulnerable, pitiable, volcanic, and heartbreaking. It's difficult to recall when a star could within the same scene initiate such discomfort for the viewer that it forces them to turn away, then bring them to tears with their naked humanity. \n\nPlaying alongside Peter Falk as a married couple sharing similar levels of mental and emotional instability, writer/director John Cassavetes shows how society tolerates certain types of eccentricities and outbursts in men, but finds it both acceptable and necessary to institutionalize a woman that doesn't conform to her narrowly defined cultural role. \n\nThe two most emotionally devastating points in the film come when Falk invites the family doctor to the house for a surprise visit to assess Rowlands' mental fitness, and during an awkward and ill-conceived party after she returns home from the hospital. While the first set piece is an extended and excruciating event, featuring a shattering moment when her weeping children are literally hanging onto to her so the doctor won't take her away, and the second occurs during a quiet moment when a psychically exhausted Rowlands repeatedly pleads for her clueless father to stand up for her. \n\nOther films have tried navigating similar territory as A Woman Under the Influence, but none have been able to do so with such raw, visceral power.",
            "review_date": "2020-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a few minor changes, A Woman Under the Influence could be set in 2020 and wouldn't miss a beat. A husband (Peter Falk) loves his wife (Gena Rowlands) so much that he does whatever it takes to make her \"normal,\" even if that means putting her in situations you know aren't going to end well — I'm looking at you, dinner scene with his entire crew. I would say Gena Rowlands as Mabel Longhetti steals the show, but she's the star from the start. Mabel doesn't represent the typical association with mental illness — on the street, committing crimes, doing drugs — but the suburban housewife who can seemingly turn it off when she needs to take care of her children. Of course, there are the big moments, I mentioned one earlier, but it's the little things, the mannerisms and talking to herself, even when she isn't the focus of the shot, which makes the entire performance not just convincing, but special. During the tense scenes, of which there are ample, the Cassavetes pulls in the camera tight, as if what we're going through isn't enough already. While I think we like to believe we handle mental illness better in 2020, I was surprised to see how much more open Nick, her husband, and the rest of her family and friends handled her situation. He even threw her a welcome home party — which wasn't the wisest idea — but his heart was in the right place. Nick, the working man for the city of Los Angeles, by the end of the film, is exhausted, uncertain, but just loves his wife and seems to accept his role in the family. It's not a conventionally happy ending, but it's a satisfying one. Thirty minutes definitely could've been shaved off of this film and it would've had the same impact. I would think any movie buff would need to watch it at least once.",
            "review_date": "2020-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The performances are really good.",
            "review_date": "2020-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There may split opinions on the film's story and style, but there is no denying that Rowlands and Falk are terrific.",
            "review_date": "2020-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The performance of Rowlands, nominated for Best Actress, is really what sells the film. However, the film is overly long. There are dining scenes in the film that continue an excruciating amount of time. Some of Falk's character choices are questionable. He understands that his wife is unstable. However, he invites numerous people to his house without thinking about how his colleagues will react to her behaviour. A similar situation happens at the end of the film making the audience question if the husband has evolved as a character at all. The wife's repeated uneasy mannerisms become tiring until half way through the film where more characters are introduced and the each actor's performance can really shine. The cinematography is decent; as shaky cam and a lower FPS are used to show the manic and disorienting state of the wife. As previously stated the film seriously needed an edit and script could've have been considerably tighter. Rowlands was beaten by Ellen Burstyn at the Oscars that year in a throughly deserving win. Out of the four Best Actress performances I have seen from that year I believe Rowlands was second to Burstyn's Alice Doesn't Live Here Anymore, followed by Dunaway's Chinatown and Lenny's Petrine. The direction of the film by Cassavettes was solid if nothing special sometimes losing it's way and some scenes becoming tiresome. He was nominated for Best Director that which out of the five nominees that I have seen, I would to rank his effort last behind, in ascending order, Fosse's Lenny, Polanski's Chinatown, Truffaut's Day For Night and of course Coppolla's magnificent The Godfather Part II (winner). Overall, apart from some enthralling scenes by very capable actors, the film takes so long to get to these scenes and repeat itself over and over again that already nearly tired out. Anyway, this film should be watched for it's performances and a quite interesting take on a subject matter that has been done better both before and after this film came out.",
            "review_date": "2020-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A well made but thoroughly unpleasant and unsettling movie.",
            "review_date": "2019-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its long, painful and annoying, but i did enjoy the film",
            "review_date": "2019-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"A Woman Under the Influence\" is a film that I certainly feel that I need to watch again. It's one that proves to be so difficult to catch each and every subtlety and moment as you move through the story. I found myself liking it and hating it all at the same time. Part of why I liked it was because it proved to be a relatable story in the slow downfall of a woman stuck in the monotony of stay at home motherhood. I also disliked it for the same reasons in that it was so difficult to watch her downfall. So many people faulted her so much for how she behaved rather than sought out to get her help and guidance and help her get better. It made me feel extremely conflicted in that I empathized with Mabel, but I also empathized with Nick. I had a hard time rooting for them both at the same time. It seemed that they both wanted the same things; however, they were never able to be on the same wavelength with it. From my perspective, the film was a success in that it told a human story that we had never seen before. It broke the mold for films of that type for that time. It served to bring something more out of us as an audience rather than to just make us laugh and cry. Cassavetes made us uncomfortable. When Nick and Mabel had their climactic argument, instead of cutting away when the going got tough, Cassavetes stayed in the discomfort. It truly is a remarkable and difficult thing to be wanting and willing to tell a story like that and Cassavetes truly excelled.",
            "review_date": "2018-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Woman Under the Influence definitely has a powerful, emotionally resonant story and fantastic performances from its talented cast, but the film is ridiculously long at two and half hours and thus it is overly prolonged and dull with its impact being blunted. It has five important scenes and the rest is basically filler.",
            "review_date": "2018-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rowlands' Mabel is to talkies what Falconetti's Joan of Arc is to silents.",
            "review_date": "2017-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful movie - as deeply disturbing as it is moving and enlightening. Most reviews and summaries of this movie tell it as though a woman, Mabel, is unstable and her husband,Nick, must do something about it. However as the movie progresses it becomes apparent that Nick is the unstable one, and everyone else, as sheep in our patriarchal. suppressed and fearful society, simply conform. What did Mabel do wrong? She is nothing but love, expressed uniquely as herself. The others, with the exception of a few, express the insanity that we call conformity, status quo, and \"normal\".... What a brilliant movie.",
            "review_date": "2017-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an incredibly intense movie by Cassavetes with his signature improvisational filmmaking style.",
            "review_date": "2017-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overpowering, I had the flu and a fever while watching it, so I will have to go over the early parts that I slept/nightmared through. The domestic tension was excruciating.",
            "review_date": "2017-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's one of those rare occasions when you can safely say that the performances are perfect and don't doubt them even for a second. The performance of Gena Rowlands could easily be named legendary. Still, the movie being  highly emotional and realistic, at times it goes too far and over the top in the realm of unrealistic.",
            "review_date": "2017-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Something that fascinated me with the way that Cassavetes directed this film was the distance between the camera and the story at hand. Most things are shot on long lenses, putting a distance between us and this family, giving it an almost documentary style naturalism when paired with the harrowing performances.\n\nJohn Cassavetes was a revolutionary artist, and a true maverick of American independent cinema, and this may be his masterpiece.",
            "review_date": "2017-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very uncomfortable viewing and brilliant performances by all. it could have been a movie of the week if not for Falk s insanity in full spotlight. no one in the family is well adjusted which makes Rowland s commitment truly heartbreaking.",
            "review_date": "2017-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Marked by fierce performances by Oscar nominee Gena Rowlands and Peter Falk, it is a harrowingly heart-wrenching glimpse into the torturous deterioration of a loving family when a hypomanic housewife is wrongfully committed by her quick-tempered husband.",
            "review_date": "2016-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sometimes uncomfortable. Always acutely depicted real-life drama focussing on emotions and motivations. The precursor to Blue Valentine and any movie with long cuts and intimate close ups. Reality movie making. With people you care about. My first Cassavetes film and I understand his fame. Honestly, if you hear a director's name oft spoken, it's for worthy and deserving reason.",
            "review_date": "2016-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The absolute icon of independent film. Anyone interested in making films about human beings needs this as a guide. The emotional ups and downs this brings on me in its 2 and a half hour runtime is unlike anything else I've experienced. Gena Rowlands is one of the greatest and John Cassavettes is a master.",
            "review_date": "2016-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Woman Under the Influence is one of director John Cassavete's greatest films, made even more astounding by intense performances from Mr. Falk and Ms. Rowlands.",
            "review_date": "2016-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aptly taps into the granular, personal stories that have defined independent cinema for decades.",
            "review_date": "2016-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The self-proclaimed hipsters and 'indie' film watchers of our generation have probably never heard of the 1974 film directed by John Cassavetes, A Woman Under the Influence (and if they have, props to them). I hadn't heard of it until I did some research on the best Independent films of all time and it came up on top in several lists. I was intrigued, watched it, and came to the conclusion that this movie is a perfect example of what an Independent film should be: a work of art.\n\nA Woman Under the Influence is the story of Mabel Longhetti (played by Gena Rowlands - wife to the director), a suburban wife and mother, who is mentally unstable. She's crazy, and unusual, which you can see from the start. And her husband, Nick (played by Peter Falk - our generation may know him as the grandfather in The Princess Bride), sends her away to a mental institution for six months.\n\nThis film is full of so much emotion, and that is partly because of the budget. Budgets are something that matter when it comes to these types of films. The budget calls for things to be simpler - costumes and sets, props and makeup, music and lighting, and so on. For example, the house in the movie was an actual house that they borrowed for the movie. They didn't go out and build a new house because it simply wasn't in the budget.\n\n(A Woman Under the Influence was a low budget movie, costing only $500,000 to make. This is a drastically lower budget than, say, The Godfather: Part II - which came out the same year - with a budget of $13,000,000.)\n\nThe movie almost seems like a more realistic reality to me because the budget was so low. There are no special effects, no fancy lighting techniques, no fancy sets; everything is raw and natural, which makes the aesthetic of the movie so unique.\n\nThis movie, like other independent films, is a work of art that captures something real, and address things that large budget, big-hit blockbusters do not address. Movies from that time never really addressed mental illness in the way A Woman Under the Influence does, or any way for that matter, which is one reason that this movie makes such a good film: it challenges the conventional way that mental illness was being portrayed in mass media.\n\nI absolutely recommend this movie. Though, I'll admit it's not for everyone, it sure is a film that lovers of independent films should watch. It's sad, it's dark, and it's a rollercoaster of emotion, leaving you with teary, yet opened eyes. The film is a work of art, just as an Independent movie should be.",
            "review_date": "2015-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gena Rowlands is just a goddamn powerhouse. Rich, dark, complex and sad- a portrait of women in society as much as a portrait of mental illness and how we deal with it.",
            "review_date": "2015-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly Cassavetes best all-around film after Faces. Gena Rowlands and Peter Falk are hauntingly good as the leads.",
            "review_date": "2015-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A wonderful performance from Gena Rowlands that could have won her an Oscar any other year but was no match to Ellen Burstyn in Alice Doesn't Live Here Anymore.",
            "review_date": "2015-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the 25 best movies I have ever seen!",
            "review_date": "2014-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Long, harrowing, excellent.",
            "review_date": "2014-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cassavettes shows a disfunctional family that throws the audience into a emotional ride that lasts even after the movie has finished. The main character is Mabel, played wonderfully by Gena Rowlands. She makes the viewer feel sad and frustrated whenever his husband yells or her mother in law shouts at her, one can sense all the stress she is struggling with.  That's what the movie is about: the lack of freedom that the woman has in his own home or even society; even if she wants to just be herself she is pushed around and forced to act in a certain, socialy accepted, way. Definitely, Cassavetes at his very best.",
            "review_date": "2014-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gena Rowlands and Peter Falk each give one of the best performances I've ever seen, and they just eat up each scene they are in. Both are unpredictable in their behavior, with Rowlands expressing a childlike demeanor that is both whimsical and disturbing, and Falk giving an exhausting performance that is borderline psychotic and tiring. It's a film that explores mental health in such a vivid manner that it seems all too real, and by placing us in the shoes of both Falk and Rowland's characters, it's hard to tell which person is actually the crazy one at times. One of the greatest films I've ever seen.",
            "review_date": "2014-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All scene in this movie is miracle.",
            "review_date": "2014-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The disparity of choice for Oscars are evident here in the highest form. Else, it wouldn't have been mare nomination, thus wins!",
            "review_date": "2014-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A sympathetic and direct look at mental health issues, and the effect that they have on a family and those on their fringe. Their desperate attempts to keep things under control while Mabel (and the family) slowly unravels is heart breaking. Shows brilliantly how every day is a struggle, on a knife's edge, for people with mental health problems.",
            "review_date": "2014-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Masterpiece, a must see work of art...",
            "review_date": "2014-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "John Cassavetes' masterpiece about a suburban family crisis. The inability to communicate and express love and tender receptively, together with Gena Rowlands' devastating performance as the fragile and insane housewife, makes it a powerful family drama influencing filmmakers like Michael Haneke.",
            "review_date": "2014-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well... Looks like I have to edit my top ten again.\n\nThis is a masterpeice if I have ever seen one. From the moment she stepped on screen, I could not take my eyes off of Gena Rowlands. Her performance is simply jaw dropping. Peter Falk is also incredible here, portraying a monster of a man who the audience goes back and forth from understanding to loathing over and over again. Cassavetes directs masterfully, allowing the camera to replicate the feel of intrusive akwardness felt by the guests of this family. It's just... just... gahhh... GAHHHGHGHG",
            "review_date": "2014-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "truely a master piece in character study",
            "review_date": "2014-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A harrowing film about the effects of mental illness on one blue-collar italian family. Gena Rowlands plays the titular Woman perfectly, as she descends into psychotic mania, & Peter Falk is her brash, loving, & sometimes abusive husband who finally opts to institutionalize his wife. Although Cassavetes' films always seem in dire need of an editor's touch, the cinema verite style helps capture perfectly the subtle & distinct personalities of even the minorest characters.",
            "review_date": "2014-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can't say a single bad thing about this. Gena Rowlands and Peter Falk are amazing as is Cassavetes' direction. It's almost like not watching a movie.",
            "review_date": "2014-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A magical film that manages to be both heart-breaking and oddly heart-warming. This is John Cassavetes at his best. Gena Rowlands gives one of the best and most memorable screen performances I've ever seen. Additionally, Peter Falk bravely plays his role with such conviction and brutal love that you can go from hating him to loving him in a matter of a few seconds screen time. This is not so much a study of mental illness as it is a study of love and how two limited people can be unlimited in their capacity to love one another. Not to be missed and never to be forgotten. This is a cinematic gem.",
            "review_date": "2013-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. Blew me away. Fantastic.",
            "review_date": "2013-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have to say that this is a movie in which I felt that all of its characters behaved irrationally, not just Gena Rowlands'. Peter Falk's character is so incredibly unlikeable and ill-tempered that it's a wonder how anybody would want to have anything to do with him.  I had such an awkward feeling watching the acting from all characters in this film in that I didn't have a clue what ANYBODY was talking about, almost as if I was learning an alien language.  It seemed that no character could speak when I wanted them to nor could they emote in any way that made a semblance of sense or interest.  While it was a daring film for its time, talking mental illness and all, I felt like I was watching a supporting cast of people who were either incredibly shy or overly emotion.",
            "review_date": "2013-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gena Rowlands gives one of the all-time most powerful performances ever captured on film in her husbands masterful film.  Both brutally realistic and theatrical, this film has come to be considered a study of an emotional breakdown of the wife and mother of a blue collar family. However, it is really a free-form study of love between two very different people. One damaged by the limitations of his life-experience and the other suffering what can only be surmised as bi-polar disorder. Falk is exceptional in this movie. Both lead actors transcend their craft to a new sort of place in cinematic acting. Each gesture and movement carries power and insight into characters who \"feel\" real. Painful. Awkward. Uncomfortable. Funny. Sad. Tragic. And, ultimately, inspiring glimpse into two people trying their very best to make it all work. Unforgettable. It is interesting how Cassavetes managed to create such a realistic depiction of mental illness way back in the early 1970's before there was any real understanding toward it. Another bit of cinematic magic is the fact that every moment of this film feels as if it were improvised. In truth, every single line was scripted. Amazing film.",
            "review_date": "2013-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant. Made me walk out into traffic!",
            "review_date": "2013-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The woman is an awesome crazy.",
            "review_date": "2013-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fresh to Cassavetes' canon, A WOMAN UNDER THE INFLUENCE is tiresome and exhausting for my first-time viewing, throughout the entire running time (155 minutes), we watch a series of intense clashes between Mabel (Gena Rowlands) and Nick (Peter Falk), sometimes catalyzed by their family members or close friends, and the repercussions includes Mabel exacerbates her mental disability and the collateral damage to their 3 young children. \r\n\r\nUsing intimate and irregular camerawork to demonstrate a fly-on-the-wall authenticity opens a maximum door for thespians to show off their superlative working-class liberation of feelings and emotion, Gena Rowlands, immerses into her character with optimum dexterity, from her quirks of sputtering and word-mouthing, the fervid and persistent advocacy of opera aria to the time-bomb of her squeamish frailty, we never know when will she explode, whilst time is ticking and the wait is taxing both for the players and the spectators. She also shines in her warmer facet during the heartwarming episodes with her kids. Mabel is a dream role any actress would be ever craving for, Rowlands is the performer nonpareil for her concentrated and committed dedication of embodiment without falling into the pitfall of borderline OTT. \r\n\r\nFalk, a flawless pick for an ordinary blue-collar, bedeviled by his wife's unhinged nature and stumped by the futile and consuming communication, improperly catches the worst moment to throw a surprise party for Mabel, his quandary could be easier to be related by the audiences, besides, his trademark out-of-focus eyes betray his frustration and it is certainly the situation is at his wits' end.  \r\n\r\nThis tiny budgeted film is a family workshop, kinfolks and friends constitutes the cast, e.g. both Cassavete's mother Katherine and Rowlands' mother Lady plays the in-laws in the film. Overall the film is a challenging project which unflinchingly debunks the underbelly of the marital bond, \"till death us do apart\" is so harrowing to listen under this circumstance. During the conjugal tug-of-war, Cassavetes pluckily interposes their children into the game, at the eleventh hour, it is the kids' relentless endeavor thaws the edginess induced by the heavy volley of laborious squabbles. \r\n\r\nFinally I must bellyache about the befuddling timeline, when Mabel brings a stranger to her house at night, it is the next morning Nick and his workmates come back from working, they have an unpleasant midday dinner, then it is the morning after Mabel's mother brings the children to home before school, right? Then how come later Nick's mother accusing Mabel for adultery at \"last night\"?  Help me out here, it does bugs me, otherwise it is an indeed unique film of its own kind, although it doesn't gratify my satisfaction thanks to the frivolous and dreary altercations, I am always coveting for a bit more from the story plainly extracted from the lifelike experience, other than accentuates the tedious and irksome sensory overkill, it would be nicer if a sensible approach could lead us to a palliative nostrum to set our cerebral phase back to a normal state.",
            "review_date": "2013-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Emotionally shattering and intensely personal.",
            "review_date": "2013-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As good of a movie as it gets. \nMabel is great. I see some refer to her as a \"crazy wife\", not at all. One can scrutinize entire movie and especially that charged scene with visiting kids, role-playing, stiff parent and temper-prone husband - nothing is wrong with her, she is great. \nShe has unusual gesticulation and she's making some unusual (but fitting and expressive to the context) sounds, which puts people around on guard. Mis-communication, its causes and grave consequences is one of films main points. That central scene with neighbor kids' visit and ensuing fight is one big mis-communication. Otherwise, she explains herself, she is not \"that stiff wife\". Probably most of her antics would be nothing but fun and kindness if people were open to her means of expressing herself.\nExtremely dramatic movie: lost appeal to father to stand up for her; husband unable (in the end) to tell her that he loves him. Only kids, like her yet un-inhibited, fight for her (and thru entire movie have excellent report with her), but she refuses to leverage them. In adult world, among those who wield power Mable is alone and mis-understood.\nAnd very final scene, when husband and wife remain alone... At first I was baffled, I thought it was mute and anti-climactic. But then I felt the fakeness of its idyll and of its sanity and that finale tied the movie as probably no alternative could. \nJust great.",
            "review_date": "2013-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some of the most unswerving honesty and two of the best performances I've ever seen in a movie. 5 stars is an underrating.",
            "review_date": "2013-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cassavetes deserves a lot of credit for this film because it is so convincing but most of the credit should go to Gena Rowlands who was very impressive. The story is a bit slow and ultimately dissatisfying but it is still a classic, underrated, film.",
            "review_date": "2013-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is what happens when an entire cast/crew is on the top of their game",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gena Rowlands delivers one of the greatest performances ever committed to film.",
            "review_date": "2013-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first half of the film is really good, but it gets tedious after a while.",
            "review_date": "2013-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Cassavetes film is something to truly behold and particularly a Cassavetes film involving his life partner Gena Rowlands. The meltdown of a family unit has become commonplace in many modern films but it was unique for the time and Cassavetes was truly a ground breaker.",
            "review_date": "2013-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant essay  on human relationships.",
            "review_date": "2013-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dysfunction can be so awesomely painful to watch. Aside: props for all the Hamms spotlights!",
            "review_date": "2013-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Holy fuck. One of the most powerful films I have ever seen. Absolutely fascinating performance by Rowlands, Falk also with a superb performance. This is the Cassavetes finest work.",
            "review_date": "2013-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Woman Under the Influence is a film I've been meaning to catch for a good while now. It's about a broken home, or perhaps the end was implying that this was a normal home, either way it's about a home. In this home there's a wife, a husband, and three kids. It couldn't be more normal, except the wife is coo-koo, and the husband is an abusive prick. Both had amazing performances, but especially Gena Rowlands. If you've seen the 2010 film Blue Valentine the style is incredibly similar. I think the main draw back of the film is that it tried to be too genuine. I was shocked by the realistic feel, but I was noticing so much that I never viewed this as a real family. It never left just a movie zone for me, which I think is contrary of the intent. I felt that the film could have been trimmed down some, but the length wasn't to big of a deal. The problem was the over kill of realism, and trying to show a regular family with there baggage, been better if Cassavates toned down trying to make it 100% life like.",
            "review_date": "2013-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing performance from Gena Rowlands, and a beautiful look at acceptance and love.",
            "review_date": "2013-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nominated for 2 Oscars including: Best Actress in a Leading Role (Gena Rowlands) and Best Director (John Cassavetes). This is seriously one of greatest films of 1975!",
            "review_date": "2012-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A riveting, effective and relentless Cassavetes film with a stunning central performance by Gena Rowlands. Few films can tackle the family response to mental health issues with such genuine honesty and compassion, yet without seeking to be a shameless Oscar-bait syrup-fest.",
            "review_date": "2012-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love all the film snob reviews....everyone trying to defend the utter lack of story and uneven acting by Gena Rowlands and Peter Falk...who is Peter Falk in this role  just like every other role he had.  Rowlands is trying really hard to be tweaky, yet neurotic and fragile.  I guess it works if there was something that held the film together story-wise.  I shut it off at 45 minutes of tedious nothingness.  ....and why would like 9 guys from the plant that Falk works in just show up unexpected for dinner?",
            "review_date": "2012-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most humane screenplays ever! Flawless performances by the entire cast, literally. Disturbingly compelling.",
            "review_date": "2012-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An interesting script but...very very boring!!",
            "review_date": "2012-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"I love you. I'll lay down on the railroad track for you. If I made a mistake,which I did, I'm sorry. But so what?What's the difference? I love you.\"",
            "review_date": "2012-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the finest independent films out there, \"A Woman Under the Influence\" is a thought-provoking, ably directed and forcefully acted family drama that works just as well today as it did when it was first released, even if the subject matter isn't nearly as shocking. Both Gena Rowlands and Peter Falk have brave, completely moving performances that rank with some of the cinema's best and most realistic ones, and the scenes they share feel incredibly honest. \"A Woman Under the Influence\" still resonates with today's audiences, but its story doesn't justify its cumbersome length, which can be ponderous at times. Nevertheless, John Cassavetes' powerful tale of mental illness and domestic abuse is an accomplished work and a true stepping stone for independent cinema.",
            "review_date": "2012-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a difficult movie to watch as it is disturbing to see someone on the brink of insanity. However, it is a very powerful and moving film with commanding performances from both Gena Rowlands as the emotionally fragile Mabel and Peter Falk as Mabel's husband, Nick. Cassavetes compellingly captures the impact of Mabel's meltdown on the whole family.",
            "review_date": "2012-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a highly entertaining movie. As a person who grew up in the 70s, I was most entertained by all the 70-isms in the movie. 70-isms are things that were commonplace in the 70s that would be frowned upon today. I'll list the ones I remember:\n\nThe kids had to be reminded to put on shoes before they left with their grandmother. There was no hint of a car seat in granny's car. Nobody had on seat belts. The little girl had on a short dress and in every single scene she appeared in, her underwear were showing. At one point, she is running around the house naked and they show everything. This kid did a nude scene. In modern days, thanks to pedophiles, we would call that kiddie porn. \n\nPeter Falk's character refers to one of his black workers as a monkey behind his back. That may not be a 70-ism. The way everyone interacts at the dinner and at the party had a very 70's flow. One of the work crew playfully slaps PF's wife on the behind at the dinner. One of PF's friend's wives tongue kissed him just because at the party. \n\nPF's character had not visited his wife in the mental hospital even though she was there for months. You know this because he was surprised by her condition when she came home. She has a mental breakdown and he smacks her. This is a 70ism because there was rampant ignorance about mental illness in the 70s. People did not know what to do around someone who was mentally ill. In the beginning of the movie, she tells her husband she will become who he wants her to be. This is not a common thing in the 21st century. \n\nI had a few problems with the film. Some of the scenes went on too long. I found myself thinking, ok, I get it, she's weird, next scene please. Her symptoms seemed to be a mish mosh of multiple mental illnesses. At first I thought they were going for bipolar, then she had dementia, then she was dancing in the street playing chicken with the cars. The ending was creepy. My feeling was that she was not gonna make it through the night.",
            "review_date": "2012-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "cam lung si cam proaste personalitatile. nuia iesit\nbecareful with culture programming. socially accepted attachments / obsessions",
            "review_date": "2012-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"a woman under the influence\" has two pretty amazing performances from it's leads. the intensity of peter falk in some of the scenes feels so genuine, it's scary. but to get to those few great moments, you need to sit through a lot of filler. this is a long movie, that very obnoxiously offers no conclusion. and while the performances are fantastic, it really feels like a waste breath taking performances.",
            "review_date": "2012-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One cannot be a fan of independent cinema without acknowledging the contributions of John Cassavetes. A Woman Under the Influence, arguably his best film, sees the humanistic auteur at the top of his game (observant camera work, extending shots to pick up his characters' idiosyncrasies, mixing and matching shot scales and eye lines, etc.). I love his style of filmmaking, but if there's one criticism, it's that he can times be so observational that it allows room for viewers to misunderstand the point. This film is a perfect example of that.\n\nI didn't believe we are meant to wonder who is \"crazier,\" Mabel (played by the truly brilliant Gena Rowlands) or her husband (a terrific Peter Falk). Cassavetes makes a strong, bold (and rarely voiced) point...it is the trappings of contemporary life that makes us on the verge of insanity. Mabel loves her children, loves to dance and sing -- and for that she is committed. Her \"unidentified mental illness\" seems to intensify when her husband mistreats and was physically and verbally abuses her (in my opinion, going a bit crazy after someone slaps you is probably healthier and saner than being polite, demure, and rational).\n\nMabel loves life, shows her love without apology, and is severely punished for it. Everyone else in the movie struggles to calm everyone down and avoid showing too much emotion. While this may be more socially acceptable it isn't sane or even healthy. Humans are emotional beings, and this hallow societal expectation of \n\nCassavetes tips his hand and proves his point when Mabel comes home from the institution. She hasn't seen her children, husband, and family for 6 months and people assault her, some she has never even met, before she even leaves the car. When she does get inside the safety of her own home the people who put her away and told to forget the past greet her with small talk and politeness. Then when she finally sees her children after being told to \"wait a minute\" she says to herself that she wants to remain calm and show \"no emotions.\" It seems obvious that this is a perfectly acceptable time to be emotional but fresh from the institution she know being normal doesn't allow you to be emotional. Emotions are scary, messy, and inconvenient and I for one am thrilled that John Cassavetes shed such a great light on these ideas. It's a bold, original film in every sense of the word, and it does what all good cinema does: it makes you think about your relationship to the world.",
            "review_date": "2012-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ahhhh johnny john john what an elegant way to create characters so rich and delectable. a true gem.",
            "review_date": "2012-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "powerful. its about how you try hard to be an acceptable and lovable person for your most important person in your life. sometimes it causes you nervous breakdown. and how difficult is to deal with other person around sometimes. if just they let you to be alone everything gonna be perfect.",
            "review_date": "2012-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"A Woman Under the Influence\" boasts a superb lead performance from Gena Rowlands, but there's something about writer-director John Cassavetes' male characterizations that really grates on me. He's not interested in thinking men. Instead, he adores these old-school macho types who mask everything with bravado and believe the ultimate life moment is to crowd around a table with other loud, manly men while backslapping each other, smoking and drinking. Such scenes are like watching a Lions Club meeting.\n\nRowlands deserved her Oscar nomination (she lost to Ellen Burstyn in \"Alice Doesn't Live Here Anymore\"), but her character's inappropriate, manic, eager-to-please behavior hits its note very early and doesn't develop much further. The script reveals little about her background and doesn't give much sense of whether she was born this way or has a post-traumatic condition. A 146-minute film ought to dig deeper. Why didn't we see any of her treatment at the psychiatric hospital?",
            "review_date": "2012-06-08",
            "source": "rt",
            "lang": "en"
        }
    ]
}