{
    "rating": 9.1,
    "release_date": "1974-02-07",
    "num_reviews": 750,
    "genres": [
        "Comedy",
        "Western"
    ],
    "summary": "In this satirical take on Westerns, crafty railroad worker Bart (Cleavon Little) becomes the first black sheriff of Rock Ridge, a frontier town about to be destroyed in order to make way for a new railroad. Initially, the people of Rock Ridge harbor a racial bias toward their new leader. However, they warm to him after realizing that Bart and his perpetually drunk gunfighter friend (Gene Wilder) are the only defense against a wave of thugs sent to rid the town of its population.",
    "reviews": [
        {
            "content": "Its just fun to see a movie that lampoons everyone.",
            "review_date": "2023-04-25",
            "source": "rt"
        },
        {
            "content": "Great comedy from Mel Brooks",
            "review_date": "2023-04-24",
            "source": "rt"
        },
        {
            "content": "Its one of my all time favorite comedies! Seeing it on the big screen like it was originally intended was absolutely amazing!!",
            "review_date": "2023-04-23",
            "source": "rt"
        },
        {
            "content": "A classic Mel Brooks comedy.",
            "review_date": "2023-04-23",
            "source": "rt"
        },
        {
            "content": "Mel Brooks goes West to round-up laughs, lassos only stray snickers yet manages to corral a cool $120 million in moo-lah for range-boss, Warner Brothers. There is no accounting for taste, pardner. Stars Cleavon Little (Sheriff Bart), Gene Wilder (Waco Kid), Madeline Kahn, Harvey Korman as crooked politico Hedley \"Almost\" Lamarr, Dom DeLuise, Slim Pickens and former Detroit Lions great Alex Karras as Mongo, the ox-riding ruffian.\n\nBefore watching, best tell any PC family members or house guests to drift, i.e., leave the premises so as not to spoil the show, for Blazing goes way out & wild, forever flaunting good manners (gas gag), testing taboos (n-words) and selling a humor so broad you'd think Benny Hill was at the controls (horse punch). But the director of other irreverents like The-Producers (68) and the same year's Young-Frankenstein (74) uses the offensive, not just for chuckles but to expose our fears and foibles, all of it certified cinematic by lead Little and co-writer Richard Pryor (5). What really separates Blazing from Brooks vast comedy catalog is its music, arranged by frequent collaborator John Morris with Mel composing four songs, including lyrics for the Oscar-nominated title tune sung by Frankie Laine, the popular singer selected after he'd answered a trade-paper advertisement (2★/4).",
            "review_date": "2023-04-17",
            "source": "rt"
        },
        {
            "content": "Sadly, movies like this would never be made today. This was back when people didn't have a chip on their shoulders, and understood that everything was just for comedy. They knew how to take a joke. Nowadays, everybody is injured and upset, or have hurt feelings over things like this. One of the best comedies I have ever seen. Well done.",
            "review_date": "2023-04-15",
            "source": "rt"
        },
        {
            "content": "For those that don't understand satire, this is a highly offensive movie that should be canceled.  For those that do understand satire, this is a brilliant comedy poking fun at all sorts of bigotry, westerns, musicals, and Hollywood.",
            "review_date": "2023-04-15",
            "source": "rt"
        },
        {
            "content": "I like it！so much！！！！！",
            "review_date": "2023-04-14",
            "source": "rt"
        },
        {
            "content": "LOL, the funniest 01 hour: and 33 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Starring Mel Brooks, Gene Wilder, and Richard Pryor!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2023-04-13",
            "source": "rt"
        },
        {
            "content": "Those saddles sure blazed. Weird that it was just a live cam of a pile of horse saddles being set on fire but ok ig",
            "review_date": "2023-04-11",
            "source": "rt"
        },
        {
            "content": "One of Mel Brooks Best.",
            "review_date": "2023-04-09",
            "source": "rt"
        },
        {
            "content": "Should've had a much higher rating ! The movie is just incredibly hilarious by any standard .",
            "review_date": "2023-04-05",
            "source": "rt"
        },
        {
            "content": "One of the best movies ever made.",
            "review_date": "2023-03-08",
            "source": "rt"
        },
        {
            "content": "funny and more funny",
            "review_date": "2023-02-26",
            "source": "rt"
        },
        {
            "content": "Clever Unpredictable ending, Phenomenal chemistry between the two leads, tons of great original visual gags that hit and a film that oozes charm, wit and is daring. Everyone should give this a watch at least once.",
            "review_date": "2023-02-16",
            "source": "rt"
        },
        {
            "content": "One of Mel Brooks' best films and a must-see for any comedy and parody fan. Hilarious, authentic, well-acted, great music and beautifully politically incorrect.",
            "review_date": "2023-02-04",
            "source": "rt"
        },
        {
            "content": "There can only be one campfire scene. John Simon is an imbecile. NRJ.",
            "review_date": "2023-01-31",
            "source": "rt"
        },
        {
            "content": "Absolutely hilarious!",
            "review_date": "2022-12-30",
            "source": "rt"
        },
        {
            "content": "Funny even when watching for the 10th time. Couldn't be made today.",
            "review_date": "2022-12-20",
            "source": "rt"
        },
        {
            "content": "Creative, funny, fun movie",
            "review_date": "2022-12-11",
            "source": "rt"
        },
        {
            "content": "The laughs never stop in quite possibly the best Mel Brooks movie of all time!",
            "review_date": "2022-11-27",
            "source": "rt"
        },
        {
            "content": "A hilarious, well-acted and even groundbreaking film, Blazing Saddles is a comedy classic that gleefully lampoons Westerns with reckless abandon whilst also taking the piss out of racism in a way that would be damn-near impossible to get greenlit today (also, it has the first fart joke in a movie, according to sources so...the more you know). A fun film with manic energy that's the most fun in my eyes, when revealing where certain memetic quotes come in (i.e. the asking of where Caucasian individuals of the fairer sex are located).",
            "review_date": "2022-09-29",
            "source": "rt"
        },
        {
            "content": "I think the best I can do to describe this film is:\n\nHA! HAHAHAHAHAHAHAHAHA! HAHAHAHAHAHAHA! OOOOOOH! HAHAHAHAHAHAH!",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "Great cast, really funny film and even after all these years it's comedy gold",
            "review_date": "2022-09-02",
            "source": "rt"
        },
        {
            "content": "This is a very silly and amusing film, with a heavy emphasis on slapstick comedy. I haven't seen too many Western comedy films, other than 'A Million Ways to Die in the West' and this was definitely funnier (in my opinion) - there's a strong sense of quirkiness. Its certainly not a film that takes itself too seriously - its more of a spoof/parody film but I enjoyed that. This is a bit of a cult classic and I can understand why.  The cast performances are good too. This is a politically incorrect film, featuring multiple racial slurs, so it won't appeal to all but as parodies go, this is one of the better ones. Yes, I would certainly recommend this, for the surreal situations depicted and the madcap zany charatcers, if nothing else. It also has a bit of a comic book feel to it as well.",
            "review_date": "2022-09-01",
            "source": "rt"
        },
        {
            "content": "The ultimate western spoof that is a gag a second, housed by an iconic pairing between Little and Wilder, is just as outrageously funny and intelligent in 2022 as the day it first hit theaters.",
            "review_date": "2022-08-27",
            "source": "rt"
        },
        {
            "content": "Just saw paws of fury and made me want to watch this - I get the comments on not aging well such as fart jokes (but they still do that in comedies today…), but simultaneously it has a timeless feeling as well to it. It’s refreshing to see a movie able to take on subjects to make change, not to reinforce it as okay. I guess people have lost that sense of humor unfortunately — life was better when we could just sort of laugh at each other and whatever was wrong with that day without taking it as some personal attack, or need to protest— in actuality it’s highlighting the absurdity of it, not endorsing it and people can’t look past step 1 to see step 2-99 ",
            "review_date": "2022-08-08",
            "source": "rt"
        },
        {
            "content": "It won't make modern viewers laugh out loud much, but it's parody of westerns with its likeable leads make it worth viewing to have a word on it.",
            "review_date": "2022-07-21",
            "source": "rt"
        },
        {
            "content": "One of the best comedies of all time. Blazing Saddles does that fun thing of having characters talk directly to the camera, letting down the third wall, and is filled with fantastic singing, and a top notch script and cast. I think they make fun of almost every race, color, religion, and bigot on the face of the earth, but all done in good fun. The lead characters, Gene Wilder and Cleavon Little are the two voices of reason, and pull the whole thing together.",
            "review_date": "2022-06-10",
            "source": "rt"
        },
        {
            "content": "Mel Brook's right for the throat satire of westerns is, by today's standards, so politically incorrect that it'll make audiences quite uncomfortable with it's blatant use of the n-word and racial stereotypes.  However, if you look at it the way I did; just how stupid and pointless racism is, then you'll laugh until your ribs hurt.  This film has everything you'd expect from Mel Brooks: it breaks the 4th wall, silly sight gags and crude, vulgar musical numbers.  Now we get horses punched, old ladies beaten, a toll booth in the middle of the desert in 1874, pie fights, a Yiddish speaking Native American and farts around a campfire among countless other jokes and gags.  No matter how you look at it's subject matter, it's just plain funny.  The message is this —- we need to overcome racism as a society.  This film explains that but in the silliest way possible.  It's classic Mel Brooks and one of my favorite films of his.",
            "review_date": "2022-05-06",
            "source": "rt"
        },
        {
            "content": "The funniest parody of any Spaghetti Western or other Western movie releases!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Starring the late Gene Wilder.",
            "review_date": "2022-04-10",
            "source": "rt"
        },
        {
            "content": "While I slightly prefer The Producers and Young Frankenstein this is still a jewel in the crown when it comes to comedy. It is silly and it is not subtle at all, there are those who will flinch at some of the language used. But it is very funny, and works really well as a spoof. The story is a lot of fun, and there are enough slapstick and jokes to amuse as well as a wonderful script. The production values are very good too, while the acting is spot on. Cleavon Little and Gene Wilder are both great as the smart-as-a-whip railway worker appointed first black sheriff and the drunken gunman who helps him out, while Madeline Kahn(in a Marlene Dietrich send-up), Alex Karras and Harvey Korman are even better. Overall, not subtle but still great. 9/10 Bethany Cox",
            "review_date": "2022-03-18",
            "source": "rt"
        },
        {
            "content": "While I’m all for politically incorrect humor, I didn’t find this funny at all. I full well realize this isn’t my style of humor either. Still, Blazing Saddles hasn’t aged very well and provides an almost nonsensical plot even for a Mel Brooks film",
            "review_date": "2022-03-15",
            "source": "rt"
        },
        {
            "content": "Mel Brooks take on Classic western films in only a way Mel Brooks could coordinate.  Very funny.  Very Progressive.  This film was ahead of its time in poking fun at and highlighting racial inequality in The Old West and In Hollywood.  Harvey Korman, Alex Karas, Mel Brooks, and the cast are really good. It is visually fun to watch.  This is, by today's standards, not politically correct, and that adds to the humor of it.   The \"N\" word is used very liberally to show the ignorance of the villains in this food; however, it would not be acceptable in a comedy today.  One of Brooks' best films.",
            "review_date": "2022-03-11",
            "source": "rt"
        },
        {
            "content": "Maybe it was funny at the time? If it was, the comedy tastes have certainly changed because I didn’t laugh more than once or twice and just barely. The humor is juvenile- farts, politicians having affairs, it’s all lame.",
            "review_date": "2022-02-09",
            "source": "rt"
        },
        {
            "content": "One of the Greatest Comedies Ever, Written by two Masters, Richard Prior and Mel Brooks... You can't make this movie these days, where you can look at the over the top of something, laugh and love each other at the same time...",
            "review_date": "2022-02-08",
            "source": "rt"
        },
        {
            "content": "The ultimate western spoof that is a gag a second, housed by an iconic pairing between Little and Wilder, is just as outrageously funny and intelligent in 2022 as the day it first hit theaters.",
            "review_date": "2022-02-07",
            "source": "rt"
        },
        {
            "content": "Best movie to just enjoy and not be woke from when  joking around was legal.",
            "review_date": "2022-02-03",
            "source": "rt"
        },
        {
            "content": "Madeline Kahn is one of the greatest comedic actresses of all time.",
            "review_date": "2022-01-01",
            "source": "rt"
        },
        {
            "content": "1974:  Western spoof comedy about an evil government official trying to take control of a town and run out the citizens, in order to run a train through the land.  His idea to run the citizens out is to hire a new sheriff, who happens to be black.  Some truly funny moments in this flick, but some of the jokes (on racism and homosexuality) would never play today.  The ending breaks the fourth wall.  Good cast for the most part, including Cleavon Little, Gene Wilder, and Harvey Korman. \n\nStars:  Cleavon Little, Gene Wilder, Harvey Korman, and Slim Pickens.\n\nDirector:  Mel Brooks (who contributes two amusing cameos).",
            "review_date": "2021-12-13",
            "source": "rt"
        },
        {
            "content": "One of the funniest movies I've seen.",
            "review_date": "2021-12-07",
            "source": "rt"
        },
        {
            "content": "Funniest stinking fartin shooting riding dancing movie ever!",
            "review_date": "2021-12-04",
            "source": "rt"
        },
        {
            "content": "Fucking funny and amazing. Mel Brooks literally put on a show in this movie. Not only you got Mel Brooks, you also got a legendary Gene Wilder and Cleavon Little. This is one awesome movie. Highly recommend watching if you haven't yet. 5/5",
            "review_date": "2021-11-02",
            "source": "rt"
        },
        {
            "content": "Classic comedy. This is how you fight racism. With comedy making fun of it. An amazing movie that would never be made today.",
            "review_date": "2021-10-16",
            "source": "rt"
        },
        {
            "content": "the best comedy of all times..",
            "review_date": "2021-10-14",
            "source": "rt"
        },
        {
            "content": "Having watched this right after Tombstone, you had better believe that it was a let-down. So that may have tainted this movie a little too much. Ah well. Had some funny moments.",
            "review_date": "2021-09-28",
            "source": "rt"
        },
        {
            "content": "Awesome movie!  Love good comedies like this one!",
            "review_date": "2021-09-03",
            "source": "rt"
        },
        {
            "content": "Probably more appealing when it first came out, but by today's standards this movie is showing its age!!!",
            "review_date": "2021-09-03",
            "source": "rt"
        },
        {
            "content": "This movie could not be made today with it's ethnic jokes, amongst others.  The entire theater audience laughed throughout the entire movie.",
            "review_date": "2021-08-12",
            "source": "rt"
        },
        {
            "content": "A nonsense-filled good time.",
            "review_date": "2021-08-09",
            "source": "rt"
        },
        {
            "content": "Dumb, crude and not funny. Go ahead and watch if you like feeling like you have been ripped off or just had your pocket picked.",
            "review_date": "2021-07-06",
            "source": "rt"
        },
        {
            "content": "The epitome of overrated. Every single positive review of this movie references the social criticism aspect. Well, the problem with that is this is supposed to be a COMEDY. It does exactly what George Carlin and Stephen Colbert ended up doing, which was focusing too much on their \"message\" and forgetting to add actual jokes. The references in this movie are only relevant to World War II veterans and their children and the comedy resembles that of a Renaissance Festival vaudeville act. Oh, but your 65 year-old uncle says the comedy is just too smart for \"stupid snowflakes\" so that just makes any criticism completely unvalid. Thank God this film's fan base is nearing their graves so this movie can finally be judged rationally and not through nostalgia glasses.",
            "review_date": "2021-06-26",
            "source": "rt"
        },
        {
            "content": "This movie is one of the funniest ever made.",
            "review_date": "2021-05-24",
            "source": "rt"
        },
        {
            "content": "A cool cop is trying to teach this small town that not all cops are bad, which is cool. My only complaint is that the cop was cooler. In the sequel, maybe give him some sunglasses or a cigarette.",
            "review_date": "2021-05-12",
            "source": "rt"
        },
        {
            "content": "Mel Brooks continues his trend at punching up at idiots. This time, he goes after racism in the West and, by extension, racism in 1970s America. Unfortunately the movie is still relevant, which shows that nothing changed. But let me divert from that dour statement. Cleavon Little is perfect as Bart (it would have been interesting to have seen Richard Pryor in the role), Gene Wilder is sweet yet road weary, Harvey Keitel is having a ball as Hedey Lamar (that’s Hedley!), Madeline Kahn’s Marlene Dietrich impersonation is spot-on, and Alex Karras as Mongo is just beautiful. Every scene stands out as comedic gold, all the way to the end, but underneath it all is a genuine heart and a love for Westerns, which is what you need in parody. ",
            "review_date": "2021-02-04",
            "source": "rt"
        },
        {
            "content": "Hollywood couldn't make this movie now, so thank god Mel Brooks already did. An inspiration for so many comedies and tropes to come it is a foundation movie for comedy today.",
            "review_date": "2021-01-27",
            "source": "rt"
        },
        {
            "content": "One of Mel Brooks best, especially with Gene Wilder there.",
            "review_date": "2020-12-27",
            "source": "rt"
        },
        {
            "content": "I Love this movie. My grandfather showed me saying there was a funny scene but there were so many, The ending was not needed so if you watch it skip the ending.",
            "review_date": "2020-12-21",
            "source": "rt"
        },
        {
            "content": "I have tried this movie 3 times in the past 10 years because it just seems like the type of movie I would enjoy and every time, I come away with maybe one or two laughs for the whole film. I believe every topic is fair play for comedy, even race, but this movie is just not very funny. I think it's way overrated.",
            "review_date": "2020-10-22",
            "source": "rt"
        },
        {
            "content": "Hilarious Very quotable",
            "review_date": "2020-09-21",
            "source": "rt"
        },
        {
            "content": "A few mildly funny lines at best. The main joke in this film about Willy Wonka going back to the Wild EST is that white people used to call black people bu the n word. Every now and then that joke becomes a little bit tired. Other than that there were a few clever ideas but generally not a film that has aged well.",
            "review_date": "2020-09-09",
            "source": "rt"
        },
        {
            "content": "I want to like it, but Mel Brooks' satire about Western movies ran its course a long time ago.\n\nIf you've never seen it, I would still recommend a viewing. It may not be funny anymore, but it really was pretty funny in 1974. Call it a \"history of your grandparents' childhood\" assignment.",
            "review_date": "2020-08-08",
            "source": "rt"
        },
        {
            "content": "Best western ever and with many memorable scenes, still parodied to this day.",
            "review_date": "2020-07-18",
            "source": "rt"
        },
        {
            "content": "By far Brooks's best film.",
            "review_date": "2020-07-16",
            "source": "rt"
        },
        {
            "content": "A high point in the career of Mel Brooks. This is laugh-out-loud funny that is sure to offend the politically-correct crowd of today, which is like icing on the cake.",
            "review_date": "2020-06-12",
            "source": "rt"
        },
        {
            "content": "An inventive comedy for its time by Mel Brooks as it delivers in being both a fun and western-satirical watch during its running time without coming across as juvenile. \nThis is a comedy with brains around the same level as the British \"Monty Python\" tribe. \nGood stuff.",
            "review_date": "2020-06-07",
            "source": "rt"
        },
        {
            "content": "I actually don't think this is even close to being Mel Brooks' funniest film but damn if it isn't his gutsiest. For a satire from the mid 70s this is still a blazing hot piece of commentary on race relations in America and while I wish we could relegate the topic as a thing of the past, it is sadly still every bit as powerful and true today.",
            "review_date": "2020-06-07",
            "source": "rt"
        },
        {
            "content": "We were aware of the many legends speaking about this superior film, but experiencing it was a brand new form of entertainment. The subtle details in jokes showed that there was a large amount of love put into this. Although the film itself is 46 years old, it holds a timeless quality as the world begins to change. Hands down, best western comedy my friends and I have seen in a while. I give this movie a CLAP CLAP CLAP CLAP CLAP. I relate to the cashier man. I too hate my wife and children.",
            "review_date": "2020-05-21",
            "source": "rt"
        },
        {
            "content": "One of the best comedies of all time! This movie would never be made in today's culture, but that would explain why a majority of the comedy films coming out nowadays are CRAP!  Mel Brooks cemented his spot as a comedy genius with this film.",
            "review_date": "2020-05-18",
            "source": "rt"
        },
        {
            "content": "On the American frontier of 1874, a new railroad will soon be rerouted through Rock Ridge, in order to avoid running through quicksand. Realizing this will make Rock Ridge worth millions, the conniving attorney general Hedley Lamarr (Harvey Korman) wants to force Rock Ridge's residents to abandon their town, and sends a gang of thugs, led by his flunky Taggart (Slim Pickens), to shoot the sheriff and trash the town. The townspeople demand that Governor William J. Le Petomane appoint a new sheriff to protect them. Lamarr persuades the dim-witted Le Petomane to appoint Bart (Cleavon Little), a black railroad worker, who was about to be executed for assaulting Taggart earlier. A black sheriff, he reasons, will offend the townspeople, create chaos, and leave the town at his mercy. After an initial hostile reception (where Sheriff Bart has to take himself as a hostage to escape), he relies on his quick wits and the assistance of Jim (Gene Wilder), an alcoholic gunslinger known as the \"Waco Kid,\" to overcome the townspeople's hostility. He subdues Mongo, an immensely strong, dim-witted, but philosophical henchman sent to kill him, then he beats German seductress-for-hire Lili von Shtüpp (Madeline Kahn) at her own game, with Lili falling in love with him. Upon Mongo's release, he vaguely informs Bart of Lamarr's connection to the railroad, so Bart and Jim visit the railroad work site and discover from Charlie, Bart's best friend, that the railway is planned to go through Rock Ridge. Just as Taggart and his men arrive to kill Bart, Jim outshoots the thugs, forcing Taggart to retreat to Lamarr. Lamarr, furious that his schemes have backfired, hatches a larger plan involving a recruited army of thugs, including common criminals, Ku Klux Klansmen, Nazis, and Methodists...\n\nRotten Tomatoes consensus reads: \"Daring, provocative, and laugh-out-loud funny, Blazing Saddles is a gleefully vulgar spoof of Westerns that marks a high point in Mel Brooks' storied career.\" While the film is now considered a classic comedy, critical reaction was mixed when the film was released. Vincent Canby wrote: Blazing Saddles has no dominant personality, and it looks as if it includes every gag thought up in every story conference. Whether good, bad or mild, nothing was thrown out. Woody Allen's comedy, though very much a product of our Age of Analysis, recalls the wonder and discipline of people like Keaton and Laurel and Hardy. Mr. Brooks's sights are lower. His brashness is rare, but his use of anachronism and anarchy recalls not the great film comedies of the past, but the middling ones like the Hope-Crosby \"Road\" pictures. With his talent he should do much better than that. Roger Ebert gave the film four stars (out of four) and called it a \"crazed grabbag of a movie that does everything to keep us laughing except hit us over the head with a rubber chicken. Mostly, it succeeds. It's an audience picture; it doesn't have a lot of classy polish and its structure is a total mess. But of course! What does that matter while Alex Karras is knocking a horse cold with a right cross to the jaw?\" Gene Siskel awarded three stars out of four and called it \"bound to rank with the funniest of the year,\" adding, \"Whenever the laughs begin to run dry, Brooks and his quartet of gagwriters splash about in a pool of obscenities that score bellylaughs if your ears aren't sensitive and if you're hip to western movie conventions being parodied.\" Variety wrote, \"If comedies are measured solely by the number of yocks they generate from audiences, then 'Blazing Saddles' must be counted a success ... Few viewers will have time between laughs to complain that pic is essentially a raunchy, protracted version of a television comedy skit.\" Charles Champlin of the Los Angeles Times called the film \"irreverent, outrageous, improbable, often as blithely tasteless as a stag night at the Friar's Club and almost continuously funny.\" Gary Arnold of The Washington Post was negative, writing that \"Mel Brooks squanders a snappy title on a stockpile of stale jokes. To say that this slapdash Western spoof lacks freshness and spontaneity and originality is putting it mildly. 'Blazing Saddles' is at once a messy and antiquated gag machine.\" Jan Dawson of The Monthly Film Bulletin wrote, \"Perhaps it is pedantic to complain that the whole is not up to the sum of its parts when, for the curate's egg that it is, Blazing Saddles contains so many good parts and memorable performances.\" John Simon wrote a negative review of Blazing Saddles, saying, \"All kinds of gags—chiefly anachronisms, irrelevancies, reverse ethnic jokes, and out and out vulgarities—are thrown together pell-mell, batted about insanely in all directions, and usually beaten into the ground.\"\n\n\"Blazing Saddles\" is a satire of the western genre and a classic Mel Brooks film with some funny moments and several political comments coming from all directions. Predominantly the race question. The film received generally positive reviews from critics and audiences, was nominated for three Academy Awards and is ranked No. 6 on the American Film Institute's 100 Years...100 Laughs list. Despite the fact that the film has hailed so much praise over the years, \"Blazing Saddles\" is not really my type of humour or cup of tea for that matter. It´s an uneven messy satire with a direction more or less just based on overdriven silliness. \n\nTrivia: During production for the film, retired longtime film star Hedy Lamarr sued Warner Bros. for $100,000, charging that the film's running parody of her name infringed on her right to privacy. Brooks said that he was flattered and chose to not fight it in court; the studio settled out of court for a small sum and an apology for \"almost using her name.\" Brooks said that Lamarr \"never got the joke.\" This lawsuit would be referenced by an in-film joke where Brooks' character, the Governor, tells Hedley Lamarr that, \"This is 1874; you'll be able to sue HER.\"",
            "review_date": "2020-04-30",
            "source": "rt"
        },
        {
            "content": "Genuinely funny. Has not aged in over 45 years.",
            "review_date": "2020-04-04",
            "source": "rt"
        },
        {
            "content": "Easily one of the best comedies of all time. Mel Brooks at his finest. ",
            "review_date": "2020-04-03",
            "source": "rt"
        },
        {
            "content": "A bit out of its time, but still a pretty hilarious concept and film.",
            "review_date": "2020-03-27",
            "source": "rt"
        },
        {
            "content": "Blazing Saddles is a hilarious western comedy movie filled with racist and sexist remarks that are jokes and as long as the audience can understand they are jokes, it is a great movie. If one is easily offended, do not watch it, but overall it was a great movie filled with many laughs and great acting.",
            "review_date": "2020-03-18",
            "source": "rt"
        },
        {
            "content": "Les trente premières minutes et le segment final pourraient servir à ériger Blazing Saddles comme un des plus grands films de Mel Brooks. C'est alors extrêmement dommage qu'à l'arrivée du personnage de Gene Wilder, pourtant excellent, le film se ralentit considérablement et tourne presque à vide dans une sorte de parodie des 7 Mercenaires avec des gags de pets et des anachronismes qui se suivent sans vraiment de suite logique. Dommage pour Cleavon Little, John Hillerman & Slim Pickens, qui sont absolument parfaits. Mais Blazing Saddles, pour toutes ses bonnes idées, n'est qu'une ébauche de ce que Mel Brooks sera capable de faire plus tard.",
            "review_date": "2020-03-17",
            "source": "rt"
        },
        {
            "content": "Brooks at his peak and funniest with fantastic performances all round especially Gene Wilder as the quick drawing Waco Kid .",
            "review_date": "2020-03-02",
            "source": "rt"
        },
        {
            "content": "What a classic movie for a great cause.",
            "review_date": "2020-02-23",
            "source": "rt"
        },
        {
            "content": "the funniest movie of all-time!!!!",
            "review_date": "2020-01-26",
            "source": "rt"
        },
        {
            "content": "greatest movie of all time",
            "review_date": "2020-01-20",
            "source": "rt"
        },
        {
            "content": "Biting political commentary mixed with Brooks' signature humor make this a classic. Add to it that Richard Pryor wrote a good portion of the script, and that negates any cry of \"uncomfortable racism\" by weak minded fools. It's a shame that more people don't see that this is Brooks jabbing racists right in the face while they unwittingly laugh",
            "review_date": "2020-01-20",
            "source": "rt"
        },
        {
            "content": "It's funny in all the ways Spaceballs wasn't",
            "review_date": "2019-12-22",
            "source": "rt"
        },
        {
            "content": "In its sidesplitting takedown of racism and all-purpose ignorance, 1974's \"Blazing Saddles\" is one of the boldest and most important satires ever made. As raunchy and ludicrous as it is whip-smart, it can claim parentage of modern-day parodies from \"South Park: Bigger, Longer & Uncut\" to \"Sausage Party\" to music industry spoof \"Stadium Anthems\" in their uses of obscenity, intelligence, and song to expose inane social truths.\n\nIt's the Wild West. Hedley Lamarr (Harvey Korman) is a white business opportunist with moronic and hyper-sexed governor William J. LePetomane (Mel Brooks) in his back pocket. Lamarr wants to build a railroad through the outpost town of Rock Ridge. When he can't scare off the town folk, he incites chaos by saddling them with a black sheriff (Bart, played by the now-iconic Cleavon Little), who just days before was a railroad laborer sentenced to hanging. It turns out that the sly Bart is a rare sage in a frontier otherwise littered with dumb white people; he pairs with booze-soaked gunslinger Jim (Gene Wilder) to rally the town against Lamarr's thugs.\n\nWearing no seatbelt, \"Blazing Saddles\" rebukes the absurdity of racism with its own absurdist countermeasures. While its blueprint would never make it past present-day studio tastemakers, its defrocking of ignorance has never been better primed for mass consumption. This is a watershed comedy that presides atop any short list of film's greatest satires. - WATCHED IT? THEN WATCHLIST: \"Stadium Anthems,\" \"Borat,\" \"Sausage Party.\"",
            "review_date": "2019-12-10",
            "source": "rt"
        },
        {
            "content": "My second favorite movie of all time.  This hilarious send up of the Western Genre tackles politics, racial animosity, greed, sexism, animal abuse, and its a COMEDY!",
            "review_date": "2019-11-12",
            "source": "rt"
        },
        {
            "content": "Mel brooks made some great movies back in the day but this has to be his best. There are so many laugh out loud moments in this film and unforgettable scenes making this one of the funniest films ever made and the fact that it is still hilarious to this day just goes to show how well the gags were written. If you haven't seen this and you have a funny bone in your body it's a must watch",
            "review_date": "2019-11-12",
            "source": "rt"
        },
        {
            "content": "It has to be the funniest movie ever made.  I love it!",
            "review_date": "2019-10-24",
            "source": "rt"
        },
        {
            "content": "I had hoped we'd become better as a society since 1974, but the last few years have proven that this movie is more poignant than ever. Mr. Brooks is a genius. ",
            "review_date": "2019-10-19",
            "source": "rt"
        },
        {
            "content": "The Citizen Kane of vulgar comedy in that the film is not just a classic but instead the defining movie of an era.",
            "review_date": "2019-10-09",
            "source": "rt"
        },
        {
            "content": "Awesome, hilarious movie that deserves the praise. Also, one of the few movies where critics and audiences have the same score.",
            "review_date": "2019-09-22",
            "source": "rt"
        },
        {
            "content": "Top 3 Mel Brooks films. Epic",
            "review_date": "2019-09-21",
            "source": "rt"
        },
        {
            "content": "A clever satire commenting on racism in America.\n\nMel Brooks' Western satire Blazing Saddles (1974) is full of meta references and 4th wall breaks as well as endless social commentary on America's racism in the fields of film, Hollywood, Westerns, and politics. Blazing Saddles is Mel Brooks' cynical, yet delightful world view on full display. It's hard to believe Mel Brooks directed both Young Frankenstein and Blazing Saddles in 1974. What an accomplishment!\n\nWhile Blazing Saddles is surely Brooks' most lowbrow, slapstick, and vulgar film, it transcends its simplistic surface with deep-seated thoughtfulness for its racial commentary. Brooks and Richard Pryor wrote a script brimming with creativity as they lambaste racist politicians and townsfolk alike. They make the hateful characters the dumb morons, who are incompetent. Meanwhile, the black characters are wise and clever, just like the white allies to the minority's plight.\n\nCleavon Little is amazing as the dashing, innovative, and charming lead. He plays a black sheriff named Bart in a racist town of hateful whites. Little is always fun to watch in his Gucci cowboy suit, brilliant smile, and optimistic attitude. His casual demeanor makes his character instantly likable as he rides on his steadfast horse into the fray of racist ambushes the victory with his improvised solutions. Little even rides past Count Basie himself playing some triumphant jazz for the audience.\n\nLikewise, Gene Wilder is wonderful as Jim the Waco Kid. His quick draw gags and drunken stupor as cool, but Wilder wins you over with his sympathetic candor for Cleavon Little's situation and his drunken sob story. Wilder may be in a ridiculous comedy, but he is so memorable as Jim because he plays the character straight as if Blazing Saddles were a real Western drama.\n\nFurthermore, you will fall in love with the gorgeous Madeline Kahn, not just for her ravishing beauty as the stunning Lili von Shtupp, but also for her casual comedic performance. Her over the top German accent is too funny and her forced seduction sequences are genuinely hilarious. She was such a talented actress. I highly recommend Blazing Saddles, Young Frankenstein, and Clue to see peak Madeline Kahn.\n\nOn the other hand, Harvey Korman is riveting as the villainous Hedley Lamarr. Everyone confusing his name for Hedy Lamarr gets funnier every you hear it! He gets several long lists and monologues that are captivating for their superfluous nature and comedic intentions. He aptly portrays the incompetent politician with cruel ambition and callous methods. Similarly, Slim Pickens is perfectly cast as the redneck racist goon for Korman's Lamarr. His racist spouting is almost as funny as his allusions to anachronistic events. Pickens is given my two favorite lines in Blazing Saddles with, \"What in the Wide, Wide World of Sports is going on here?!\" and \"I work for Mel Brooks!\". I laughed the hardest at these two frustrated exclamations from Pickens' exasperated character Taggart.\n\nI have to mention the director Mel Brooks appears in three separate roles within Blazing Saddles. He's outrageous as the horny governor with cross eyes and no understanding. He's the tolerant Native America as well as the random World War pilot looking fellow in the villains sign up lineup. Brooks always makes me laugh whenever he's on screen.\n\nLastly, Dom DeLuise has a cameo role as the musical director Buddy Bizarre during Blazing Saddles' bonkers finale. His incredulous declaration of, \"This is a closed set!\" is too funny. I love his little dance and watery mistake. DeLuise never fails to make me laugh.\n\nI absolutely recommend Blazing Saddles as it delivers nonstop laughter with its goofy jokes and poignant commentary. Mel Brooks may pull apart Hollywood by reminding the audience constantly that they are just watching a movie, but he always remembers to entertain you with silly comedy of the highest caliber.",
            "review_date": "2019-09-18",
            "source": "rt"
        },
        {
            "content": "If you think this is a racist movie, you missed the point. This movie goes there in the masterful way Mel Brooks goes. Enjoy.",
            "review_date": "2019-09-15",
            "source": "rt"
        },
        {
            "content": "One of the best movies of all time.  Mel Brooks delivers some of the best comedy ever.  Very politically incorrect in a great comedic fashion.",
            "review_date": "2019-09-06",
            "source": "rt"
        },
        {
            "content": "Probably one of my favorite movies of all time. Saw it with my beloved Grandparents when it came out in 1974. Mel Brooks is a Comedic Genius and even more so if Yiddish is your first language or mama loshen as it is/was for us.",
            "review_date": "2019-09-02",
            "source": "rt"
        },
        {
            "content": "They don't make them like this anymore.",
            "review_date": "2019-09-02",
            "source": "rt"
        },
        {
            "content": "Absolutely hilarious!!!",
            "review_date": "2019-08-31",
            "source": "rt"
        },
        {
            "content": "Back in the day before political correctness was smothering us. A parody on western films.",
            "review_date": "2019-08-08",
            "source": "rt"
        },
        {
            "content": "Only Mel Brooks could of pull of this movie. It is hilarious. Great writing, Great acting, Great movie.",
            "review_date": "2019-07-18",
            "source": "rt"
        },
        {
            "content": "Totally hilarious!!! As a country boy i could not stop laughing. Loads of raunchy humour and satire that would give a modern social justice nut or liberal a brain annyeurism. Its just awesome! 5 out of 5. I have seen it 4 times now.",
            "review_date": "2019-07-15",
            "source": "rt"
        },
        {
            "content": "Wonderfully politically incorrect, this hilarious movie, sadly, couldn't be made today.  Over the top funny.",
            "review_date": "2019-07-12",
            "source": "rt"
        },
        {
            "content": "Obviously politically incorrect! But very funny! It's amazing how often it's shown on cable considering the fact that idk if a movie like this gets made today",
            "review_date": "2019-06-19",
            "source": "rt"
        },
        {
            "content": "Amazing start to finish, and some great subtle jokes that could go unheard to less observant.",
            "review_date": "2019-06-17",
            "source": "rt"
        },
        {
            "content": "As a comically exaggerated western about a black sheriff it does well. It seems to have a lot of slapstick and vulgar humor but that isn't necessarily bad. It really feels like a comedy with not much special in regards to...everything. It is comedic but really doesn't have any of the 90s charm that most comedies like this have. I hate to say it but I definitely think people remember this movie too fondly and do not think that it really holds up in comparison to movies now.",
            "review_date": "2019-06-02",
            "source": "rt"
        },
        {
            "content": "First movie I remember ever seeing. It's a times less classic and will forever be one of my favorites all because of the campfire scene. I laughed so hard when I saw that scene that my stomach hurt for days after. I was 8 years old when I first saw this. Such a classic for comedy.",
            "review_date": "2019-05-05",
            "source": "rt"
        },
        {
            "content": "Mel Brooks' \"Blazing Saddles\" is one of those movies that makes you laugh out loud so hard that you can barely breathe. But the movie has a forgettable scene where \"The Sheriff\" meets a hooker in a saloon and the hooker finds out how nice \"The Sheriff\" really is compared to all the other men she has slept with. It failed to make me laugh maybe not because it wasn't funny but because it was a boring scene.",
            "review_date": "2019-03-28",
            "source": "rt"
        },
        {
            "content": "Blazing Saddles couldn't be made today, and that's why it probably shouldn't be, because you couldn't nail the comedy as well as this could.",
            "review_date": "2019-03-27",
            "source": "rt"
        },
        {
            "content": "Mel Brooks' finest parody film and a movie that could NOT be made today, which is a shame.  If you give this movie a chance and accept that the humor is making fun of the entire concept of racial superiority, you will understand why most people who see this film put ut in their top ten list.  An absolute masterpiece, brilliantly acted by Cleavon Little, Gene Wilder, Madeline Kahn and Harvey Korman.",
            "review_date": "2019-03-08",
            "source": "rt"
        },
        {
            "content": "I will forever love this movie and have the lines memorized. It was a time in history when comedy could poke fun at the insanity and laugh at the pain of reality. I wish more comedians, writers, and directors could still make a movie like this. We need humor, we need to laugh at pain and we need to really be in touch with what gives us a healthy laugh.",
            "review_date": "2019-03-08",
            "source": "rt"
        },
        {
            "content": "The best satire movie ever done and could be never made today, because of all the damn SJW's out there. Of course, it was mocking racism by showing it, but because it made people laugh, how dare they. Even Mel Brooks said this. It is a shame too, because it was movies like this, written by a black man by the way, cannot be done today. Best satire movie ever, yea, I said it again!",
            "review_date": "2019-03-03",
            "source": "rt"
        },
        {
            "content": "funny but not that good",
            "review_date": "2019-03-02",
            "source": "rt"
        },
        {
            "content": "movie, \"Blazing Saddles\"(1974), was OK, fairly funny parts with NO REMOVED WORDS said in the movie (NOT like TVs showing REMOVING nasty, but funny words), but OK to watch it when SHOWN on TV. I saw it (starting 7:00pm(CT)) on Saturday 03/02/2019 at GREAT THEATERS PLACE, \"Alamo Drafthouse Cinema\" MOVIES PLACE (at one of them that is at:(1120 South Lamar Blvd.; Austin, Texas 78704)), all GREAT MOVIES PLACE over the U.S. now).  I saw it with OVER 200 people, but others really liked it and it was VERY FUNNY in parts, but, like I said, I thought that it was OK, maybe OK to go see it at a theater, since TVs eliminate the nasty, but FUNNY, WORDS!",
            "review_date": "2019-02-26",
            "source": "rt"
        },
        {
            "content": "In terms of style and comedy, this film is Blues Brothers meets Monty Python. Makes fun of everything it can come across. Absolutely recommend.",
            "review_date": "2019-02-04",
            "source": "rt"
        },
        {
            "content": "one of the funniest movies I've ever seen, what makes it even better is that it could not be made today because of the ever \"offended\" morons ruining all of entertainment. this kind of movie needs to be made today",
            "review_date": "2019-01-08",
            "source": "rt"
        },
        {
            "content": "The best comedy of all time could never get the green light in today's environment.",
            "review_date": "2018-12-27",
            "source": "rt"
        },
        {
            "content": "Funny, wild and at times downright offensive (comedically speaking) Blazing Saddles stands out in all Mel Brooks slapstick comedy films, coming out on top every time.",
            "review_date": "2018-12-26",
            "source": "rt"
        },
        {
            "content": "\"Blazing Saddles\" is a silly parody movie that had many moments that made me laugh. I wouldn't consider it to be my favorite in the genre, but I think this is one of the good ones. The envelope-pushing humor is just so entertaining to watch. The movie also has one of the most elaborate fourth wall breaks I've ever seen and I had so much fun with it. The movie doesn't really have much of a story and that makes it tough to watch in the moments that aren't quite as funny. However, there were enough moments that kept me smiling or laughing the whole way through, and that made it more than worth watching.",
            "review_date": "2018-12-20",
            "source": "rt"
        },
        {
            "content": "A comic masterpiece. This movie would never get made today even though it makes fun of everyone and everything in its path. I was introduced to this movie when I was 12 years old and had no interests in watching a western. I had no idea what was about to unfold but the sheer ridiculousness right from the start had me hooked.",
            "review_date": "2018-12-17",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies!!",
            "review_date": "2018-12-14",
            "source": "rt"
        },
        {
            "content": "Mel brooks is a genius in comedy",
            "review_date": "2018-12-12",
            "source": "rt"
        },
        {
            "content": "All these men always coming and going and going and cuming, and always too soon!  Lmao. Back in the 70s, before the PC Crowd, the races for the most part got along great. On Tv the Jeffersons used the N word often.. it really was better times. We all could laugh at each other and ourselves.",
            "review_date": "2018-11-24",
            "source": "rt"
        },
        {
            "content": "There are a few moments here and there that made me laugh out loud, but on a whole this raunchy comedy shoots in every direction with a bunch of silly, hit-or-miss gags whose punch lines we can see from miles away - and also, what the hell is so funny about people farting?",
            "review_date": "2018-11-17",
            "source": "rt"
        },
        {
            "content": "Hilariously offensive, nonsensical, and satirical.",
            "review_date": "2018-10-29",
            "source": "rt"
        },
        {
            "content": "A legendary film that everyone should see; Mel Brooks isn't afraid to make fun of everyone in this flick! Even after 44 years this movie still feels like it was made last week and will hold up for another 40 years. With the weak beta humans being birthed these days, you won't see anything like this again due to millennial's seeing hate in everything they look at. This movie screams freedom of speech, and freedom screams Blazing Saddles! Mel Brooks is the film maker we need, but not the one we deserve..",
            "review_date": "2018-10-10",
            "source": "rt"
        },
        {
            "content": "One of the funniest movies I have ever seen. Almost every line is something clever and wacky. This movie is an awesome satire that stands out as an all time favorite. Thanks Mel Brooks!",
            "review_date": "2018-10-10",
            "source": "rt"
        },
        {
            "content": "I see this film is held in high esteem. However it had little shock humour to me.\nIt is a spoof of traditional Western films but the American humour seems dated, and already explored in countless British films. The Carry On's for example.\nThe film is very politically incorrect. That does not bother me in the slightest, but it's just not funny hearing the n word countless times. Or whoopee cushion sounds in a scene where people are eating beans and farting!\nThe film veers into self parody and parody of other films and genres. The ending was totally weird. I mean the film has been set in 1875 or something and then goes onto the Warner Brothers studios backlot.\nI watched mainly out of respect to the late Gene Wilder who has a supporting role in the film to the late Cleavon Little, who plays a black sheriff hence the use of certain words.\nDated film.",
            "review_date": "2018-10-06",
            "source": "rt"
        },
        {
            "content": "Blazing Saddles: Pros: - Fantastic Acting - Amazing Directing - Terrific Script - Good Cinematography - Magnificent Editing - Great Set Design & Costumes - Very Funny - Clever use of political satire - Hilarious Plot - Brilliant Pacing Cons: - None Overall Grade: A+ (10/10)",
            "review_date": "2018-09-23",
            "source": "rt"
        },
        {
            "content": "If my grandma, who left during the campfire farting scene, or others of her stick-in-their-derriere ilk knew how to use a computer, I would understand the 5 rotten ratings.  Unless they have a complicit child or grandchild submitting reviews for them, I am baffled as to the source of these misguided negative ratings.",
            "review_date": "2018-09-07",
            "source": "rt"
        },
        {
            "content": "Uncomfortably funny.A little too silly and childish at times.",
            "review_date": "2018-08-21",
            "source": "rt"
        },
        {
            "content": "Only a slight percentage contains offensive and cringing humor over a serious topic, while the rest at a greater majority is genuine laugh-out-loud hilarity towards the original, non-targeted parody of the western genre that is backed up with a brilliantly demonstrated ideological message of unexpected sense of unity. (A)\n\n(Full review TBD)",
            "review_date": "2018-08-08",
            "source": "rt"
        },
        {
            "content": "One of the funniest films of all time",
            "review_date": "2018-07-26",
            "source": "rt"
        },
        {
            "content": "Just re-watched for the first time since its initial release. I do not agree it has dated but we have become so prissy this could not be made today. It is a brash film and the humour very broad. Not all of the gags work very well but it is hard to think of many more successful comedies than this. It's also way ahead of its time in the post modern deconstruction stakes and much more fun than Mulholland Drive. I bet David Lynch wishes he had the wit and verve to make this.",
            "review_date": "2018-07-18",
            "source": "rt"
        },
        {
            "content": "One of the greatest comedies EVER",
            "review_date": "2018-07-15",
            "source": "rt"
        },
        {
            "content": "Okay, it struck a nerve with me when I first saw it, but there are some genuinely good moments in the film, especually when the fight at the end spills onto other movie sets. Its not my favorite Brooks film thanks to the main topics, but one day, maybe I'll be able to appreciate it.",
            "review_date": "2018-07-04",
            "source": "rt"
        },
        {
            "content": "I love Mel Brooks, but damn was this movie not funny.  I didn't crack a smile for the entire runtime. Maybe it just doesn't hold up in 2017, but I just didn't understand all the recommendations I've gotten to watch it.\n\nI also hated the ending. I'm sure I'm in the minority here, but I was not impressed. Young Frankenstein was so much better.",
            "review_date": "2018-06-14",
            "source": "rt"
        },
        {
            "content": "Back in the good old days when spoof movies were actually funny, there were two big players in the game and I loved them both. The Zuckers had some highs that were the funniest movies ever made, but Mel Brooks was the guy with more consistency. Blazing Saddles was one of his first and set the precedent that Brooks was superb at poking fun at genre films. I appreciate that Blazing Saddles includes a number of the tropes that you’ll find in any Western, but with a humorous twist. The subject matter is a bit edgy because of the way it uses racism nonchalantly for the sake of humor, but I think it works. There are a few moments when people who aren’t the villains are aggressive in their racism, and that rubbed me the wrong way, but most of the time it’s handled well enough way to maintain the lighthearted tone of the film. Part of why we can laugh at the harsher moments is because Cleavon Little is so charming and he laughs at them with us. He has a great personality that makes it clear he is the smartest and most resourceful character in the film, so any racism leveled against him is stupid and laughable. It also helps that Gene Wilder is by his side acting like they are best friends. The bond between the two is a nice addition that also leads to a lot of humor. Harvey Korman is a great villain because he has the delivery where he could actually play this kind of role in a non-comedic Western, but he dials it up to a level where it’s just ridiculous enough to fit in this film. Mel Brooks appears in his own films all the time, and he has a hilarious role here even though he gets limited screen time. Finally, Madeline Kahn has the power to steal every scene she is in, and she is funnier than most of the actors in this movie put together. There is a slow start to Blazing Saddles, and the comedy doesn’t start clicking real big for me until Bart is appointed as sheriff. But it keeps getting better from there because the real big laughs come for me in the climax. I’ve always found strange enjoyment when comedies break the fourth wall, and in the end of this movie they shatter the fourth wall so completely it might have never existed. This is where the comedy was clicking on all cylinders for me. It’s also where any semblance of a plot was thrown out the window, so hopefully you weren’t hoping for any logical conclusion to the story. I was willing to accept how they wrapped things up because I was enjoying this sequence so much anyways. I don’t think Blazing Saddles is Mel Brooks best film, but I also don’t have as strong of an attachment to the genre it is spoofing. I also think it gets dangerously close to being offensive, but it wasn’t bad enough where I felt the need to make excuses for it like do with some other movies from the past.",
            "review_date": "2018-06-04",
            "source": "rt"
        },
        {
            "content": "Blazing Saddles is an absolutely hilarious film that's laugh out loud funny and is one of the best films of Mel Brooks and one of the high points of his career! It's a gleefully vulgar spoof of Westerns and is something all audiences of the right age can laugh at while watching. With a cast that includes Cleavon Little, Gene Wilder, Madeline Khan, this is a movie that will do everything to keep us laughing and is something a lot of us will definitely enjoy and have a fun time watching.",
            "review_date": "2018-05-25",
            "source": "rt"
        },
        {
            "content": "The often sporadic comedy feels juvenile even though its R rated and the thin plot serves it no further.",
            "review_date": "2018-03-20",
            "source": "rt"
        },
        {
            "content": "what else can you say. It's a comic masterpiece, just as funny today as it was 40 years ago.",
            "review_date": "2018-03-02",
            "source": "rt"
        },
        {
            "content": "Hilarious! Probably the best Mel Brooks movie of all. Its too bad that they wouldn't be allowed to make this movie in today's \"PC\" climate.",
            "review_date": "2018-02-19",
            "source": "rt"
        },
        {
            "content": "Okay, what am I missing here? Why wasn't I as entertained as everyone said I would be by this movie? A few killer lines, but extremely underwhelming. Maybe it fit better at the time, but this felt forced.",
            "review_date": "2018-02-12",
            "source": "rt"
        },
        {
            "content": "Beautifully hilarious and stupid.",
            "review_date": "2018-01-22",
            "source": "rt"
        },
        {
            "content": "Personally, I think this movie is vastly overrated. One of the lower Mel Brooks films.",
            "review_date": "2017-12-18",
            "source": "rt"
        },
        {
            "content": "***\n'Blazing Saddles' was undoubtedly ahead of its time, with an inspiring protagonist and an ending that turns the whole movie on its head. Plenty of humour and excellent performances go a long way, but certain aspects did unfortunately feel dated and it wasn't always as funny as it thought it was.",
            "review_date": "2017-10-26",
            "source": "rt"
        },
        {
            "content": "My favorite comedy of all time!",
            "review_date": "2017-10-12",
            "source": "rt"
        },
        {
            "content": "In hindsight, this was an effective blow to racism in America.  In it humor is dealt at prejudices with the lethality of a club with a nail driven through it; disarming even the most reactionary of us all.",
            "review_date": "2017-09-23",
            "source": "rt"
        },
        {
            "content": "So good it never should (or could) be remade.",
            "review_date": "2017-08-28",
            "source": "rt"
        },
        {
            "content": "Mel brooks character is terrible, only a few minor funny parts, I give up on these, stupid",
            "review_date": "2017-08-05",
            "source": "rt"
        },
        {
            "content": "Mel Brooks' goofy humour never appealed to me and this film is no exception, although it's considered one of his finest.",
            "review_date": "2017-07-23",
            "source": "rt"
        },
        {
            "content": "The first thing I wondered was how the hell people allowed this movie to be made. And then I chuckled at the intelligent mix of political sarcasm, teasing-but-reflective racial commentary and quality comedy.",
            "review_date": "2017-06-02",
            "source": "rt"
        },
        {
            "content": "This is the movie I hold up as an example when people whine that thinly-veiled racism badly disguised as \"comedy\" shouldn't be called out for what it is.  Mel Brooks is a master of comedy, and a master at understanding the \"never punch down\" rule.  The perfect example is found in the opening scenes of the movie, and while I won't spoil it, it's easy to spot: it features a Cole Porter song.  And it happens over and over again.  In this comedy it's the racists who are reduced to stereotypical caricatures of themselves, with the subjects of their hatred running rings around them in intelligence, charm and charisma.  And all along, the movie is consistently hilarious and endlessly rewatchable.",
            "review_date": "2017-05-30",
            "source": "rt"
        },
        {
            "content": "Hands down possibly the greatest film ever made. A large claim? Yes! No matter how dark my days have become, this movie turns my night into day and for that, I owe most of my life to this movie. It's for sure a cult classic, but for those lucky enough to enjoy it, you are truly lucky beyond most modern belief.",
            "review_date": "2017-05-17",
            "source": "rt"
        },
        {
            "content": "Funny western spoof!!",
            "review_date": "2017-05-15",
            "source": "rt"
        },
        {
            "content": "One of the most overrated and trashy movies of all time. Surprising so many Americans find this a good movie. Or sadly, maybe not.",
            "review_date": "2017-05-06",
            "source": "rt"
        },
        {
            "content": "Humour has changed with time. This movie is no longer funny. Watched on American Airlines flight to Vancouver",
            "review_date": "2017-04-30",
            "source": "rt"
        },
        {
            "content": "2017.04.29: Had to throw on cuz I've heard three raves in the last 4 days. I find it likely I will feel the humor is dated...",
            "review_date": "2017-04-29",
            "source": "rt"
        },
        {
            "content": "Airplane! humor is always fun.",
            "review_date": "2017-04-22",
            "source": "rt"
        },
        {
            "content": "Funny and progressive for its time! :)",
            "review_date": "2017-04-17",
            "source": "rt"
        },
        {
            "content": "This is a classic comedy.  I forgot how much racial matter was in it though. It caught me off guard at first, but ended up being a really smart movie.  This is possibly my favorite Mel Brooks movie.",
            "review_date": "2017-04-08",
            "source": "rt"
        },
        {
            "content": "Blazing Saddles remains by far one of the funniest satire films of all time.",
            "review_date": "2017-04-06",
            "source": "rt"
        },
        {
            "content": "An hour of jokes about black people, wacky Indians, mocking the mentally disabled and making a joke out of Hitler, and by process, spitting on the memory of the millions of deported Jews. Just a series of racist jokes, Mel Brooks should be ashamed of his actions.\nThe \"acting\" makes me want to vomit my supper. So inherently unfunny you'll laugh just for not laughing.",
            "review_date": "2017-04-04",
            "source": "rt"
        },
        {
            "content": "Mel Brooks' 'Blazing Saddles' wasn't quite as funny as i remembered from days gone by, but it will still catch you with a few gutbusters, while providing ground breaking comedic set pieces.",
            "review_date": "2017-03-17",
            "source": "rt"
        },
        {
            "content": "Will never forget the first time seeing this and the campfire scene played...still brings tears to my eyes...",
            "review_date": "2017-03-08",
            "source": "rt"
        },
        {
            "content": "Priceless. That's all I got to say. We open with a nice Western ballad, followed by the craziest Western film ever made. Basically, Attorney General Hedley Lamarr (Harvey Korman) wants to destroy a small town named Rock Ridge. To get the town out of his way, he decides to appoint a black sheriff to said town because people would chase him out (it was 1874) because they'd be offended by him. So he sends Bart (Cleavon Little) a railroad worker he decided not to have hung in order to achieve this. Bart's rejected by the town as Lemarr and Governor Le Petomane (Mel Brooks) predicted, but after Bart meets the \"Waco Kid,\" (Gene Wilder) they work together to get the townsfolk (aka, the Johnson family) to save the town in one of the most wild, wildly hilarious, high flying ist, rootin-tootin Westerns ever made, thanks to Mel Brooks' sense of humor, turning the genre on its head like he would with sci-fi in Spaceballs 13 years later, and of course, breaking the fourth wall, a part of which brings up my only problem I can't discuss without spoilers. Bart and \"Waco Kid\" prove to be a dynamic duo who clearly don't take anything seriously in this unserious world they create. Cleavon Little and Gene Wilder make for hilarious comedy that doesn't even have to play the race card (much). They do their bits and become best friends in a semi-believable manner in this fast paced comedy that doesn't need to be perfectly coherent. The soundtrack also sets the hilarious mood with John Morris' zippy tunes that stay true to the Western genre. The humor was highly controversial in theory, but hilarious in practice. Don't try these words at home or out in the streets, or anywhere except if you're watching this movie and are saying it in anticipation of hearing the line. If you take out the offensive stuff, you won't have a movie, this stuff is comedy gold. It's meant to be offensive, it's to make fun of how brutal the Wild West really was, and how it was glorified in Westerns of old. So heads up: there are a lot of slurs and a few swears here and there, so you probably didn't come across this channel surfing, or if you did, then the point was lost. Anyway, Blazing Saddles, hilarious comedy, check it out, now if you'll excuse me, I got a review to read within this review.",
            "review_date": "2017-02-23",
            "source": "rt"
        },
        {
            "content": "A comedy classic. Mel Brooks' best film.",
            "review_date": "2017-02-14",
            "source": "rt"
        },
        {
            "content": "The best comedy of all time.",
            "review_date": "2017-01-21",
            "source": "rt"
        },
        {
            "content": "One of my top 10 movies of all time. So many quotable jokes, great visual gags, and I forgot how funny the songs and dances are. I feel like an idiot laughing so much, when Sam really doesn't think it's funny. I remember the first time I watched this movie, my brother and I and some of his friends rented a few movies on VHS for a weekend movie night, and this was one, along with Monty Python's the Holy Grail. I laughed so hard at both those movies, what a weekend.\nI'm glad this film has become such the classic that it is, as there aren't many western-comedies (at least not good ones), and it's impressive how well this holds up 40 years later.\nWatched on DVD at home, with a very hungover Sam (it was her birthday party last night!), January 21, 2017.",
            "review_date": "2017-01-21",
            "source": "rt"
        },
        {
            "content": "Mabey Mel's funniest movie but not his best but a close second.",
            "review_date": "2016-12-18",
            "source": "rt"
        },
        {
            "content": "It's outrageous offensiveness and looney tunes-style goofy humour is practically guaranteed to have you laughing.",
            "review_date": "2016-10-06",
            "source": "rt"
        },
        {
            "content": "In light of Gene Wilder's recent death, AMC was honoring his legacy by premiering two of Wilder's movies in theaters: Willy Wonka & The Chocolate Factory and the 1974 film Blazing Saddles. I myself have seen Willy Wonka several times growing up, but I've never even heard of Blazing Saddles. I was given a quick and easy synopsis from someone who had seen it and grown up with it. Basically, my companion stated, \"This kind of movie wouldn't have been made today with our PC culture\".  It's very much true pertaining to this movie it contains harsh humor, openly offensive language, and is not even apologetic about it. However, the harsh humor, openly offensive language, and unapologetic attitude are entirely what makes this film work and why it is considered a classic.",
            "review_date": "2016-10-02",
            "source": "rt"
        },
        {
            "content": "Filled with often silly and a little bit subtle humor, carried by two amazingly likeable leads and capped with a fantastic climax, Blazing Saddles will occasionally encounter bumps in the road (flatulence) but still ranks well among Mel Brooks' legacy.",
            "review_date": "2016-10-01",
            "source": "rt"
        },
        {
            "content": "A true classic and staple of spoof movies, Mel Brooks creates an affectionate parodic tribute to Westerns of the 50s and 60s. While I do have the admit that the ending becomes a bit too nonsensical and wacky for my personal tastes, there are still so many hilarious moments and unforgettable characters to ignore here. Cleavon Little, Gene Wilder, Madeline Kahn, Harvey Korman, Dom Deluise: RIP. Such a talented group of actors all utilized perfectly in this film. See it!",
            "review_date": "2016-09-25",
            "source": "rt"
        },
        {
            "content": "Hilarious in tone and musical acted, Blazing Saddles defines the Western genre into great slap stick comedy.",
            "review_date": "2016-09-16",
            "source": "rt"
        },
        {
            "content": "A non-stop spectacle of joke after joke after joke after joke. WHich would sometimes make it seems less linear as a plot but that doesn't matter too much. What really matters are the timing of the jokes and how they're delivered. And man do these actors know how to deliver these lines.",
            "review_date": "2016-09-14",
            "source": "rt"
        },
        {
            "content": "Not that the movie was the least bit irrelevant over time, but it may be the seasoning needed to wash the bad taste in the mouth of today. Mel Brooks brings up the realness of the Old West. Not only is the premise provocative, but so is it's humor. Everyone in the cast, from Brooks himself to Gene Wilder knocks it out of the ballpark with the delivery of their lines, and many of the gags tickle every funny bone imaginable in the human body. It's certain in its crazy and funny to the core.",
            "review_date": "2016-09-11",
            "source": "rt"
        },
        {
            "content": "The only film I know that tackles racism and gets away with it! A classic comedy from Mel Brooks and it still holds up!",
            "review_date": "2016-09-11",
            "source": "rt"
        },
        {
            "content": "A overall funny film, with one of the most absurd and hilarious climaxes in any comedy ever.",
            "review_date": "2016-09-09",
            "source": "rt"
        },
        {
            "content": "A great comedy that, while it's not aged well, pulls in nonstop laughs.",
            "review_date": "2016-09-08",
            "source": "rt"
        },
        {
            "content": "Great Comedy!  It does an excellent job spoofing the Western Genre.",
            "review_date": "2016-09-04",
            "source": "rt"
        },
        {
            "content": "one of the best that can never be made again.",
            "review_date": "2016-09-03",
            "source": "rt"
        },
        {
            "content": "Really enjoyed it. So funny.",
            "review_date": "2016-09-03",
            "source": "rt"
        },
        {
            "content": "I'm not sure this era's mixture of immense silliness and patient pacing always hits me the way it does others. However, Brooks most (arguably) acclaimed film is a success because of two things: 1) it takes the stupidity of racism to its furthest extent in order to point out its idiocy, and 2) it is the kind of spoof that is more homage than straight parody, proving Brooks' great love for the genre. And that (literal) 4th-wall-breaking ending is gleeful, punk-rock perfection.",
            "review_date": "2016-09-02",
            "source": "rt"
        },
        {
            "content": "Still one of my favorite Mel Brooks movies.",
            "review_date": "2016-09-02",
            "source": "rt"
        },
        {
            "content": "I remember this being hilarious when I was younger and crying with laughter at the camp fire scene. Re-watching now and it doesn't stand the test of time. Shame as I really wanted to enjoy it again.",
            "review_date": "2016-09-01",
            "source": "rt"
        },
        {
            "content": "\"Blazing Saddles\" is an amazingly hilarious comedy from Mel Brooks that has a truly terrific script that is jam-packed with jokes and an amazing cast, especially the late Gene Wilder. May he forever rest in peace. If you love comedies then you will love (and probably have already seen) this classic.",
            "review_date": "2016-08-30",
            "source": "rt"
        },
        {
            "content": "Blazing Saddles is directed and co-written by Mel Brooks, and it stars Cleavon Little, Gene Wilder, Harvey Korman, Madeline Kahn, and Mel Brooks in a western satire about people not appreciating that the new sheriff is black, and there are danger lurking around the city that the citizens need him now then ever. Now after seeing Spaceballs, I figured I should watch Blazing Saddles in my DirecTV list since it's the only Mel Brooks film that I have in there. So with that said, Blazing Saddles is much better than Spaceballs. The acting is just as good as Spaceballs, especially the chemistry between Cleavon Little and Gene Wilder which brings out some interesting story and great jokes. The jokes never seem to be in a hateful way, especially the racism jokes as they got me smiling, but it wasn't in a positive aspect from those jokes as it's still a touchy subject. Characters are memorable, and the plot is interesting in the way it plays itself so outrageous, but still manages to be original enough that plays the traditional aspects of western movies while also putting in refreshing aspects that make this film stand out. Blazing Saddles is a hilarious film that it's interesting to also see the history of how it was almost not in theaters, and if that happened, then the viewers wouldn't be able to see this classic.",
            "review_date": "2016-08-30",
            "source": "rt"
        },
        {
            "content": "A true legendary comedy that is not afraid to offend everyone at the same time. A+",
            "review_date": "2016-08-30",
            "source": "rt"
        },
        {
            "content": "Fun, silly, relaxing movie",
            "review_date": "2016-08-30",
            "source": "rt"
        },
        {
            "content": "'Blazing Saddles' may not be as politically correct in this day and age, but that was the point when it debuted and it's still damned funny.",
            "review_date": "2016-08-30",
            "source": "rt"
        },
        {
            "content": "Is still an all time classic - Gene Wilder at his best! One of the few films I would give five stars...",
            "review_date": "2016-08-29",
            "source": "rt"
        },
        {
            "content": "Cheeky, spicy and flamboyant! Keep it up and I might give them some blazing sandals.",
            "review_date": "2016-08-24",
            "source": "rt"
        },
        {
            "content": "A good time to be sure. \n\nRead more at WordsonFilms.com",
            "review_date": "2016-08-14",
            "source": "rt"
        },
        {
            "content": "Looking a bit dated 42 years later but still a lot of fun.",
            "review_date": "2016-07-13",
            "source": "rt"
        },
        {
            "content": "Funny, well-directed and cleverly Meta.",
            "review_date": "2016-07-01",
            "source": "rt"
        },
        {
            "content": "Banzé no OesteBanzé no Oeste - 1974 - Gene Wilder",
            "review_date": "2016-06-30",
            "source": "rt"
        },
        {
            "content": "Widely regarded by many accounts I hear to be the best Mel Brooks movie, I found it to be by far the worst. A really over the top(even for Brooks) forced together piece of mush. Its racist vibe definitely does not stand the test of time. Men in Tights remains the pinnacle of Brooks.",
            "review_date": "2016-06-29",
            "source": "rt"
        },
        {
            "content": "Mel Brooks nos presenta todo un clásico de la comedia con \"Blazing Saddles\" la historia del primer sheriff negro (Cleavon Little en actitud Bugs Bunny) y su acompañante Jim, el pistolero más rápido del oeste (un excelente Gene Wilder), quienes se enfrentan a Hadley Lamarr (un perfecto Harvey Korman) quien quiere destruir un pueblo completo para imponer una vía de ferrocarril. Se incluye también a una inolvidable Madeleine Kahn como una cantante alemana inspirada en Marlene Dietrich.  \"Blazing Saddles\" está llena de chistes que funcionan, parodias perfectas a los clichés del género Western y un final que es la anarquía total. Imperdible.",
            "review_date": "2016-06-20",
            "source": "rt"
        },
        {
            "content": "Another Mel Brooke's classic! Gene Wilder is by far my favorite part of this movie. The comedy is light and in-your-face at the same time. Wonderful.",
            "review_date": "2016-06-13",
            "source": "rt"
        },
        {
            "content": "This film definitely could not be made now, but as a farce and a satire of the prevailing racial views of the time, it is a smash hit.",
            "review_date": "2016-06-04",
            "source": "rt"
        },
        {
            "content": "But dated, very racist... But very funny in parts",
            "review_date": "2016-06-04",
            "source": "rt"
        },
        {
            "content": "Politically Incorrect, Funny and loved it!",
            "review_date": "2016-05-13",
            "source": "rt"
        },
        {
            "content": "Caught this on cable tv tonight - funny how some old things are new again (watch this movie and see what I mean).",
            "review_date": "2016-05-10",
            "source": "rt"
        },
        {
            "content": "Mel Brooks is someone who i love, and have lots of respect for. I love all of his movies in one way or another. ''The Producer'' (1967) is one of the funniest movies ever made, and ''Space Balls'' (1987) and ''Young Frankenstein'' (1974) are one of the best spoof's ever made. (''Robin Hood: Men in Tights'' (1993), ''Silent Movie'' (1976), ''High Anxiety'' (1977), and History of the World: Part I (1981), are  decent spoofs, that have their moments)\n\n''Blazing Saddles'' (1974) is no different. It is racist, offensive, it doesn't have a lot of classy polish, its structure is a total mess, the story line is pretty shaky. But damn, this movie is one hilarious film. I was gasping for air throughout the whole film because i was laughing constantly. The writing is excellent, the dialogue on point and the story is brilliantly hilarious. The performances are incredible, every actor (even the minor ones) have impeccable comedic timing which is one of many things that make this movie excellent.\n\nThe story is fantastic, and it is something you would think, no one would think off. In this rfilm a greedy land developer named Hedley greases palms of insane an insane governor (beautifully portrayed by Mel Brooks himself, easily the funniest performance out of everyone in the film) to induce his help to snatch land to build Hedley's railroad. A key piece of land, Rock Ridge, is a town where everyone seems to be named Johnson, all deeply entrenched in the town. The governor tries to help Hedley rid himself of the townspeople; first, he appoints black sheriff Bart for Rock Ridge. Next, Hedley sics Lili von Shtupp, \"Teutonic Twit\" on Bart. With the help of his sidekick, The Waco Kid, Bart fights for his new town. But, the politicos  fight back. (The last 20 minutes, are so meta, and self referential, it could be distracting for some (me in the beginning) but hilarious to most. (me in the end)\n\nAll in all, ''Blazing Saddles'' is a hilarious movie and a masterpiece in the genre of comedy. No matter what your opinion/prejudice is of the movie, you're unlikely to be bored.",
            "review_date": "2016-05-01",
            "source": "rt"
        },
        {
            "content": "Incredible fourth wall breaking.",
            "review_date": "2016-04-27",
            "source": "rt"
        },
        {
            "content": "A classic comedy from the mastermind of Mel Brooks.A must see.",
            "review_date": "2016-04-24",
            "source": "rt"
        },
        {
            "content": "Crude, lewd, and would still be a success if it came out today. A classic example of a film pushing limits and seeing success.",
            "review_date": "2016-04-23",
            "source": "rt"
        },
        {
            "content": "Wow, this was bad.  Comedies from the 70's just do not hold up well.  I would literally challenge anyone to watch this and tell me where I was supposed to laugh.",
            "review_date": "2016-04-19",
            "source": "rt"
        },
        {
            "content": "From the brilliant mind of Mel Brooks, \"Blazing Saddles\" is a Western spoof that is obscene and hilarious in such bad taste that viewers will love it and continue to love it as it has grown to become such a cult favorite since its release in 1974.",
            "review_date": "2016-04-18",
            "source": "rt"
        },
        {
            "content": "a very funny, very clever satire.  Mel Brooks at his second best (behind Young Frankenstein)",
            "review_date": "2016-04-05",
            "source": "rt"
        },
        {
            "content": "I personally love this film but it has not aged well and some of the more colorful humor would make people cringe.",
            "review_date": "2016-03-31",
            "source": "rt"
        },
        {
            "content": "This movie might be hard for modern audiences to connect with.  In mocking racism, it portrays a lot of racism, and that might be too much these days.  I still say it's worth your time if you keep that in mind.  There's also some gay stereotyping near the end, though I would argue that it's handled pretty well.",
            "review_date": "2016-03-24",
            "source": "rt"
        },
        {
            "content": "Wild fun and hilarious at times, Blazing Saddles throws too many unfunny jokes at the wall to be considered excellent and loses itself to incoherent plot strands that are only resolved by a self aware deus ex machina.",
            "review_date": "2016-03-14",
            "source": "rt"
        },
        {
            "content": "Outdated, but definitely not one of Mel Brooks' worst; \"Blazing Saddles\" humor may not fit today's standards, but \"by golly\" it's still funny as hell. From the unexpected, hilarious black sheriff to the outrageous fight scene at the end, nothing is off limits for the director who holds nothing back from his jokes. Too bad, not much is at stakes here since the main hero seem immune to everything that comes to his way. Wished they gave him more, harder obstacles to deal with. Still, the film broke barriers and it deserved the recognition it could get.",
            "review_date": "2016-03-01",
            "source": "rt"
        },
        {
            "content": "The origins of satire are -oh- so wonderful!",
            "review_date": "2016-02-27",
            "source": "rt"
        },
        {
            "content": "Definitely one of the funniest comedies, along with Young Frankenstein, since Buster Keaton in his prime. Madeline Kahn and Gene Wilder are nothing short of outstanding. The blu ray has awesome picture and sound quality, and the extras are decent.",
            "review_date": "2016-02-24",
            "source": "rt"
        },
        {
            "content": "A comedy western movie that played by its own rules, and won the audience over. It was the time and decade where the comedy of Mel Brooks reigned supreme, and it wasn't afraid to push the boundaries at all, much like this movie. Brave performances from the cast, especially the lead actor Cleavon Little, who, alongside Gene Wilder, handles the job well.",
            "review_date": "2016-02-19",
            "source": "rt"
        },
        {
            "content": "Jan 2016 - nothing lower than 1/2 or I'd rate it that. extremely offensive with a lack of humor.  expected,  not sure, but more...",
            "review_date": "2016-01-23",
            "source": "rt"
        },
        {
            "content": "No question, this is one of the most brilliant and irreverent comedies in the history of film. Mel Brooks' epic masterpiece has me rolling from the word 'go', and seldom lets me up for air. I love this film!",
            "review_date": "2016-01-03",
            "source": "rt"
        },
        {
            "content": "Best Comedy of all time. Seen it  over 30 times and never gets old.",
            "review_date": "2015-12-25",
            "source": "rt"
        },
        {
            "content": "This is my favorite comedy. Classic Mel Brroks and star-studded.",
            "review_date": "2015-12-08",
            "source": "rt"
        },
        {
            "content": "Up there with 'Airplane!', 'This is Spinal Tap', 'The Life of Brain', 'The Jerk', 'Dumb and Dumber', 'The Naked Gun' as the greatest comedy of all time. So many quality gags.",
            "review_date": "2015-12-04",
            "source": "rt"
        },
        {
            "content": "Blazing Saddles is well shot and acted with a couple of really funny and enjoyable scenes, but it is mostly pretty boring and uneven with boring musical sequences, inferior second half, weaker humor later on and it is overall a lost potential as it never executes its premise particularly well. It is an okay picture, but a forgettable and overrated one.",
            "review_date": "2015-12-04",
            "source": "rt"
        },
        {
            "content": "Along side \"Young Frankenstein\" this is one of Mel Brooke's greatest films. A film that could never be made. People are too dense and easily offended to understand satire. Too much focus would be placed on the liberal use of the \"N\" word that to get that this was a negative critique of racism. A film that was co-written by none other than Richard Pryor.",
            "review_date": "2015-11-27",
            "source": "rt"
        },
        {
            "content": "My favorite Mel Brooks movie. The cast was excellent and funny. Madeline Kahn was hilarious, and the movie had some classic comedy bits and some of the great comedy movie quotes. This one was a genuinely funny spoof of westerns, and one you can watch over and over.",
            "review_date": "2015-11-05",
            "source": "rt"
        },
        {
            "content": "One of the three funniest movies ever made, IMHO.",
            "review_date": "2015-11-02",
            "source": "rt"
        },
        {
            "content": "beyond my favorite comedy!",
            "review_date": "2015-10-02",
            "source": "rt"
        },
        {
            "content": "I doubt the film would be executed in the same way by today's standards but with great characters, clever parody work, and a hilarious fourth wall breaking ending, Blazing Saddles is a Mel Brooks classic that may not be for the super sensitive but worth a viewing if you don't mind some of the directions it takes.",
            "review_date": "2015-09-30",
            "source": "rt"
        },
        {
            "content": "Ingeniously juvenile yet smart, this loud and crass spoof of Hollywood Westerns by Mel Brooks earns it place in comedy history for a good reasons. A game cast of comedy greats, wonderful production values that flawlessly recreate a mythic West of the screen, and a gust bustingly funny screenplay that combines great slapstick, wit and commentary on American history and Hollywood's approach to it.",
            "review_date": "2015-09-21",
            "source": "rt"
        },
        {
            "content": "Genius! The funniest movie I've ever seen.",
            "review_date": "2015-08-17",
            "source": "rt"
        },
        {
            "content": "A fun little film. Obscenely racist, but hilarious nonetheless.",
            "review_date": "2015-08-13",
            "source": "rt"
        },
        {
            "content": "Some of it works very well, other aspects, like the story and character motivations fall flat(I know, its a comedy)\n\nAlso, it needed more Gene Wilder",
            "review_date": "2015-07-31",
            "source": "rt"
        },
        {
            "content": "Saw it when I was in the 5th Grade. Left me with a warped since of humor for life.",
            "review_date": "2015-07-26",
            "source": "rt"
        },
        {
            "content": "This movie really worked out, and it was very funny, with brilliant ideas, I wish it had more information, but the movie still worked out in an amazing way.",
            "review_date": "2015-07-19",
            "source": "rt"
        },
        {
            "content": "Uneven at best, Blazing Saddles has some really great bits, (mainly involving Cleavon Little and Gene Wilder), and some really unfunny dated racist bits, (every other character). The last 15 minutes were so well done, I can almost forgive the painful first half hour... ALMOST. B-",
            "review_date": "2015-07-06",
            "source": "rt"
        },
        {
            "content": "Mel Brooks....nuff said",
            "review_date": "2015-07-06",
            "source": "rt"
        },
        {
            "content": "Mel Brook's best hands down!",
            "review_date": "2015-06-28",
            "source": "rt"
        },
        {
            "content": "It's absolutely fearless in its attempts to satire race and the western genre. It's an undoubtedly funny Mel Brooks classic.",
            "review_date": "2015-06-17",
            "source": "rt"
        },
        {
            "content": "When we where all not so tightly wound. ð~",
            "review_date": "2015-06-15",
            "source": "rt"
        },
        {
            "content": "This movie just left me wanting to watch any, I mean ANY of Mel Brooks' other movies. Not to say to racial humor and slap stick didn't get a laugh out of me, but there are enough dumb jokes which fall flat on their face that the overall experience was not good.",
            "review_date": "2015-06-13",
            "source": "rt"
        },
        {
            "content": "Mel Brooks' classic western comedy still holds up today, telling the story of the small town of Rock Ridge getting a black sheriff sent to them from an unscrupulous government official who wants to profit from sending the railroad through the middle of the town. The humor in the film is still quite good, but the pacing seems pretty lackadaisical by today's absurdist comedy standards. Still, I'll give it four stars for having some solid laughs and some classic comedic performances (particularly Gene Wilder and Harvey Korman). Without \"Blazing Saddles\" there never would have been \"Airplane\" or \"There's Something About Mary\" or \"Scary Movie,\" so this film gets major props for being what I believe is the first absurdist genre parody. There have always ben genre parody since the dawn of film, but those parodies were never at wild as this (i.e. Count Baisie in the middle of the desert, Nazis in the old west and when the film gets absolutely meta near the end of the film and the characters break the third wall). Though I singled out Wilder and Korman for their performances, Cleavon Little, Slim Pickens, Madeline Kahn, Alex Karras as Mongo and Dom DeLuise all deliver very funny performances as well. Watching this film now, it's not quite as outrageous as it once seemed, but it's still a very funny films that is still worthy it's reputation.",
            "review_date": "2015-06-08",
            "source": "rt"
        },
        {
            "content": "Mel Brooks' merrily crude western parody is a brave little movie as well as a hysterically funny one.",
            "review_date": "2015-06-07",
            "source": "rt"
        },
        {
            "content": "This is one of the funniest films ever made. I would love to see Mel do another one.",
            "review_date": "2015-06-04",
            "source": "rt"
        },
        {
            "content": "fuckin hilarious!  So politically incorrect it kills me.  If this came out today people would lose their shit.",
            "review_date": "2015-04-16",
            "source": "rt"
        },
        {
            "content": "its a goddamn masterpiece!",
            "review_date": "2015-03-21",
            "source": "rt"
        },
        {
            "content": "\"Badges? We don't need no stinkin' badges!\"",
            "review_date": "2015-03-21",
            "source": "rt"
        },
        {
            "content": "\"Blazing Saddles\" was a fun movie with its comedy and action quickly building on each other. Mel knew just would and wouldn't be funny. For example, punching horses, third-wall breaks, and eventually just cowboys sitting around a campfire eating beans and farting. The movie was VERY politically incorrect and that's why I loved it. It was offensive, but it did that well while keeping a steady plot. Take the \"Postal\" movie for example. \"Postal\" was just Uwe Boll (writer/director) doing what WAS offensive, but included very little story. (Eventually \"Postal\" just came down to being about retarded Taliban and gunplay. Because apparently nothing's funnier than a suicide bomber saying goodbye to Twinkies before he goes boom. I'm dead serious.) But Brooks on the other hand KNEW what would be offensive and gave it more of story and character development. Instead of \"Postal\" just being a guy whose name is never mentioned and his love interest that came out of nowhere, in \"Blazing Saddles,\" Bart is given a character. After his \"owner\" rescues the railroad cart he was on instead of Bart, (\"That was close! We almost lost a profit!\") Bart then whacks the \"owner\" in the back of the head with a shovel. After the \"owner\" begs Hedley to execute Bart, Hedley gets the idea to have Bart be the sheriff. There's your back-story. It just remains perfectly funny from start to finish and includes a story that keeps you interested. On my rating scale, I'd give it a 10 out of 10. (That means \"Perfect.\")",
            "review_date": "2015-02-26",
            "source": "rt"
        },
        {
            "content": "Perhaps Mel Brooks' finest work. Makes brilliant satire of the western genre while blatantly laughing at racism. Pure comic genius. The late Cleavon Little definitely picked up the ball that Richard Pryor dropped and ran with it.",
            "review_date": "2015-02-25",
            "source": "rt"
        },
        {
            "content": "Among my fondest youthful memories is sitting in a movie theater in the rural farm town east of San Diego where I grew up, watching \"Blazing Saddles\" for the first of many, many times.  A stereotypical cinematic flashback of an equally stereotypical \"Indian raid\": the chief (Mel Brooks) and his lieutenants approach a solitary covered wagon and its occupants, a terrified black couple and their little boy (who will grow up to be our protagonist, Bart). \"Schvartzes!\" he exclaims. I fall, quite literally, out of my chair onto the floor, convulsing. My bewildered friends stare, as the joke sails blithely over their heads. (Precious little Yiddish awareness in El Cajon, California in 1974.) \n\nFlash forward 20 years: After numerous pleas, my teenaged son (who can't imagine that any movie his old man likes could hold the slightest interest for him), finally sits down to watch it with me, sighing, eyes rolling.  A year later I search in vain for the DVD; he has taken it to college with him, to share with his frat brothers.  Nowadays we shout our favorite lines together as they are delivered (\"S'cuse me while I whip this out!\") to my wife's eternal annoyance.\n\nVery few movies make me laugh out loud, but \"Blazing Saddles\" does, every single time.  It just does.  Ironically, other than the \"schvartzes\" line and one or two others (\"Nine's about my limit on schnitzengrubens\"), I didn't find that first viewing all that funny, all those years ago. The ending, especially, was too ridiculous for words. Obviously it has grown on me -- or perhaps I've just caught up with Brooks and Richard Pryor (who deserves a lot more of the writing credit than he usually gets). Their masterpiece was decades ahead of its time in the deadly serious 1970s; no one ever had the inspiration -- much less the cojones -- to attack racism head on, much less with comedy, or to fill a movie with blatant anachronisms, or give all the townspeople the same surname, or even to portray a cacophony of flatulence around a campfire. \n\n\"Blazing Saddles\" is one of those rare gems that cannot be imitated, nor even remade. (For starters, they would have to leave out the N-word. And then, you've got no movie.)  In 100 years, it will be one of the few American movies remembered.  And yes, the ending does work; oh yes, it does.",
            "review_date": "2015-02-25",
            "source": "rt"
        },
        {
            "content": "One of the greatest comedies of all time! An absolute classic!",
            "review_date": "2015-02-19",
            "source": "rt"
        },
        {
            "content": "One  of few movies that can always make me laugh, no  matter how many times I've seen  it or how bad a mood I'm in.",
            "review_date": "2015-02-18",
            "source": "rt"
        },
        {
            "content": "Iconic movie, one of my father's favorite movies.",
            "review_date": "2015-01-31",
            "source": "rt"
        },
        {
            "content": "Very funny movie, love Mel Brooks way of telling story.",
            "review_date": "2015-01-24",
            "source": "rt"
        },
        {
            "content": "Irreverent, raunchy, fowl, politically incorrect - and I laugh all the way through it.",
            "review_date": "2015-01-18",
            "source": "rt"
        },
        {
            "content": "My favorite Western.",
            "review_date": "2015-01-12",
            "source": "rt"
        },
        {
            "content": "If not one the best wacko and creative slapstick comedies out there. Mel Brooks was ahead of his time in comedy and they just don't make them like this anymore. 5 stars for what it is  and if u just need a good laugh this is the movie. Great Cast!",
            "review_date": "2015-01-04",
            "source": "rt"
        },
        {
            "content": "30+ years and I'm *still* finding new things to laugh at.",
            "review_date": "2015-01-04",
            "source": "rt"
        },
        {
            "content": "I know I'm going to get a lot of hate because of this, but I don't think this is his best film. It was entertaining, but it definitely didn't live up to the hype. I find many of his other films much funnier.",
            "review_date": "2014-12-29",
            "source": "rt"
        },
        {
            "content": "Great movie. Mel brooks should win the Nobel prize",
            "review_date": "2014-12-27",
            "source": "rt"
        },
        {
            "content": "Dad would like this film! Joke cowboy film.",
            "review_date": "2014-12-23",
            "source": "rt"
        },
        {
            "content": "Movie lovers despair , the classiest most outrageous Mel Brooks film (till Young Frankenstein). Subtlety be damned.",
            "review_date": "2014-11-26",
            "source": "rt"
        },
        {
            "content": "Pretty decent movie. I really didn't like it at first, but then it grew on me. It's really silly, but deep down, it's good and it has many hidden jokes and references. The acting is pretty decent, and the story is okay. But, it did have a few funny parts.",
            "review_date": "2014-11-16",
            "source": "rt"
        },
        {
            "content": "Mel Brooks is a funny man.  He has made a lot of funny things.  But in my opinion, Blazing Saddles is his best.  It is gloriously perfect.  So many movies (and other media) try and make racism into a joke and fail miserably by playing to old, tired tropes (an example that comes to mind from a movie I recently watched and hated: Joe Vs. The Volcano, where an entire island is full of desperately unfunny, ragingly racist portrayals of 'natives').  Brooks takes the obvious - that it's the racists that should be made fun of - and turns it into a movie full of hilarious jokes at the expense of the racists.  One of many perfect examples is early on in the movie when a corrupt railroad employee demands a \"nigger work song\" out of the overworked, abused men in his employ - and is left stymied when they burst into a beautiful rendition of \"I Get A Kick Out Of You\".  But a movie full of running jokes can still be dismal, if it doesn't have a decent story to back it up - and this has a great story to back it up.  Just the right mix of adventure and wackiness and self-referential humor.  The cast is brilliant.  I could rave about each one but that would turn out long and be mostly repeating myself, so just fill in the blank: \"_____ did a tremendous job and every moment they were on screen was a pleasure to watch.\"",
            "review_date": "2014-11-11",
            "source": "rt"
        },
        {
            "content": "Not that funny, but still ahead of it's time.",
            "review_date": "2014-11-04",
            "source": "rt"
        },
        {
            "content": "Hilarious movie that was a true comedy game changer.",
            "review_date": "2014-10-31",
            "source": "rt"
        },
        {
            "content": "An African-American sheriff protects a Western town threatened by a railroad expansion.\nLet's take a look at some of the bits in this film.  First, the bad guys want to discredit the sheriff, so they employ a prostitute to seduce him.  She does, but because black men have large penises, she is grateful for their night of love-making and doesn't threaten his honor.  Second, the sheriff outwits the bad guys by dressing up as a bellboy, who goes unnoticed because black people are meant to be in servile roles.\nThere's no doubt that there's a lot of satire here, but the film nonetheless commerces in racial stereotypes in ways that I find uncomfortable.  Rather than finding the film funny, I found its social critique pedestrian, and while making fun of racism is good, repeating racial stereotypes can be dangerous even under the glass of satire.  Perhaps if I had seen this film when it was first released, I would have found it valuable, but now I find it difficult to recommend.\nOverall, with uncomfortable racial politics, i don't think this film hits the mark.",
            "review_date": "2014-10-19",
            "source": "rt"
        },
        {
            "content": "A little undisciplined at times, but still is a damn crazy funny dark spoof of the Western film genre.",
            "review_date": "2014-10-14",
            "source": "rt"
        },
        {
            "content": "Not just racial humor but a fabulously uneasy sendup of almost every stereotype, packed in more self-awareness than beans in a can. Not as laugh-out-loud funny as I expected, but challenging because of allusions I don't remember or don't get. I cannot say that I always get Mel Brooks' humor, but he seems to be reaching for both highs and lows, so much so that his movies sometimes seem cluttered. I've especially had trouble understanding his use of gay stereotypes in his movies: is he commenting or just enjoying the \"let's get them, girls\" sissy moments?",
            "review_date": "2014-09-26",
            "source": "rt"
        },
        {
            "content": "Hillarious a little Rasicsts but funny",
            "review_date": "2014-09-25",
            "source": "rt"
        },
        {
            "content": "Terrible movie. Humor? Where? Everything is predictable.....even the bad jokes. It's one thing to intentionally be campy. It's another to be able to see every joke that's coming before it happens. Personally, I think 1974 was probably the least funniest periods in the history of movie making. Brooks might have done better if he just made the whole movie as one big show tune with drag queens dressed up as Indians dancing with cowboys in a mine shaft.....I mean there is nothing original or interesting in this movie beyond Gene Wilder and Richard Pryor.....who btw went on to make really funny movies. I think Brooks might have learned something from those two.",
            "review_date": "2014-09-15",
            "source": "rt"
        },
        {
            "content": "Mel Brooks Best movie by far. A racist but hysterical movie with fourth wall breaks and N words gallore. It may be offensive to some viewers but it's great to make fun of yourself sometimes. A very funny movie",
            "review_date": "2014-09-04",
            "source": "rt"
        },
        {
            "content": "Blazing Saddles is a hilarious spoof that is well acted and stupid in the funniest way possible.",
            "review_date": "2014-08-24",
            "source": "rt"
        },
        {
            "content": "Falls short of Young Frankenstein, but still comedy genius on hand.",
            "review_date": "2014-08-22",
            "source": "rt"
        },
        {
            "content": "The funniest Western ever made!",
            "review_date": "2014-08-12",
            "source": "rt"
        },
        {
            "content": "Very funny, bit long-winded at times but defiantly a classic",
            "review_date": "2014-08-11",
            "source": "rt"
        },
        {
            "content": "Side-splitting satire at its finest!",
            "review_date": "2014-08-10",
            "source": "rt"
        },
        {
            "content": "This is one of the funniest movies I've ever seen. 4 and a half",
            "review_date": "2014-08-03",
            "source": "rt"
        },
        {
            "content": "I can never get \"tired of playing za\" movie!",
            "review_date": "2014-08-01",
            "source": "rt"
        },
        {
            "content": "One of the best spoofs created. Mel Brooks is a genius when it comes to comedy.",
            "review_date": "2014-07-30",
            "source": "rt"
        },
        {
            "content": "Ridiculous and dumb! I love it!",
            "review_date": "2014-07-27",
            "source": "rt"
        },
        {
            "content": "Ok not my favorite Brooks movie",
            "review_date": "2014-07-21",
            "source": "rt"
        },
        {
            "content": "Mel brooks is a master of comedy!!",
            "review_date": "2014-07-18",
            "source": "rt"
        },
        {
            "content": "\"Excuse me while I whip this out!\"  Absolutely classic Mel Brooks.  This is one movie that could NEVER, EVER be made today.  As always, great performances from Gene Wilder and Madeline Kahn.  Had \"10/10\" potential until the uninspiring final act where it goes too far off its rails.  Still, this is a raunchy, vulgar, very racist comedy that any PC person would absolutely hate.  \n\nGrade = 9/10",
            "review_date": "2014-06-29",
            "source": "rt"
        },
        {
            "content": "Ei oikein uppoa Mel Brooks. Hyviä yksittäisiä juttuja toki tässäkin mutta aika hit-and-miss kamaa kokonaisuutena.",
            "review_date": "2014-06-29",
            "source": "rt"
        },
        {
            "content": "I've loved Mel Brooks ever since I was ten when I watched Spaceballs, and while I haven't rewatched this movie in awhile but I remember it being pretty damn funny.",
            "review_date": "2014-06-24",
            "source": "rt"
        },
        {
            "content": "Quite possibly one of the best comedies ever. Right up there with The Great Dictator and Airplane. Mel Brooks is comedic genus.",
            "review_date": "2014-06-20",
            "source": "rt"
        },
        {
            "content": "The last 15 to 20 minutes literally collapses in on itself, but the first hour and 15 minutes is a clever and hilarious parody of westerns and their tendency to sideline the race issue.",
            "review_date": "2014-06-18",
            "source": "rt"
        },
        {
            "content": "A comedy that succeeds in being funny. Still funny 40 years later. Timeless.",
            "review_date": "2014-06-16",
            "source": "rt"
        },
        {
            "content": "Hilarious, hilarious, hilarious. Easily one of the best comedies ever made, Blazing Saddles holds up very well in spite of the fact it could never get made today due to the racist jokes. With only a few jokes falling flat, Blazing Saddles is funny from beginning to end as it gleefully deconstructs westerns and pokes fun at them, as well as the film industry as a whole. Though it can get a bit vulgar at times, it never stops the film from being great entertainment. Nobody is spared from being mocked by Blazing Saddles and in the end, that is what makes it great. Unafraid of taking risks, the film has aged well and still manages to entertain and create laughs in 2015.",
            "review_date": "2014-05-31",
            "source": "rt"
        },
        {
            "content": "Yes, a true rarity  - a parody which is actually really funny.",
            "review_date": "2014-05-30",
            "source": "rt"
        },
        {
            "content": "Irreverently hilarious from beginning to end, Blazing Saddles is a perfect example of parody, satire, and general comedy films at their finest, a quintessential comedic landmark chock full of endlessly quotable lines, goofily memorable characters, and continual nods to a well respected audience.",
            "review_date": "2014-05-22",
            "source": "rt"
        },
        {
            "content": "Said to be Mel Brooks' best film, superior even to the comedy masterpieces The Producers and Young Frankenstein, there is no possible way that I could ever miss Blazing Saddles. \n\nFor one thing, Blazing Saddles is visually terrific.\nThe production design in Blazing Saddles is terrific because it gives the film a genuine western feel. Capturing a lot of strong sets and costumes against the backdrop of dry scenery, it feels a lot like an actual western. And it is shot with a lot of common western cinematography techniques, si Mel Brooks ensures that Blazing Saddles is created in a western visual style which ensures that it is a valid piece of the genre that it is parodying as well as a parody. Blazing Saddles works as a genuine western film as well as a parody of one thanks to Mel Brooks' innovative direction and his ability to find the appropriate balance to make it work.  It feels like a real western film, and so from there it can build on its satirical edge without being simply a spoof. Although it is a slow paced film like the westerns that it parodies, it still keeps itself entertaining due to Mel Brooks' dedication to the material in terms of crafting it together and then executing it. Blazing Saddles is possibly Mel Brooks' most visually vibrant film and it captures a broad colour palette all while maintaining a dry and monochromatic look which fits into the edgy western context of the film.\nBlazing Saddles isnt a perfect film because the slow moving pace of the film makes its humour quite subtle at times, and admittedly the Western genre isnt the funniest choice to satirize. But for what it's worth, Blazing Saddles is iconic of Mel Brooks and is a film that only he could really get away with as cleverly as he did. Blazing Saddles finds the line between being a clever parody of westerns as well as a juvenile send up of them so that it isn't too subtle or too over the top. And while it is clrear that Blazing Saddles is a dated film, it is still a sufficiently funny western film and a prime example of just what Mel Brooks is all about. Thanks to his screenplay, the film is supplied a versatile list of characters which supply a lot of material for the cast to work with. And from there, he tackles the role of director and gives the material the precise kind of treatment that it needs. Fitting all of his jokes in at the right times and managing to give it all a firm exection, Mel Brooks points out a lot of humourous elements of the western genre in Blazing Saddles which usually tend to rush past my eye, and he takes a clever look at western civilisation as well as using a rich satire of the ignorance in bigotism as an underlying theme. Although a few of the jokes are hit and miss, Blazing Saddles proves to overall be a consistently funny film which is colourful and entertaining, maingy because of the talents of its cast in the material.\nCleavon Little's leading performance in Blazing Saddles covers it from start to finish. As well as being a geniune western hero, Cleavon Little manages to capitalise on the oppurtunitry in Blazing Saddles and play a parody of one at the same time. His performance is almost like a mix of Richard Pryor and Duane Jones, finding the appropriate balance for the mood of the film and the general atmosphere of each scene. You can tell that he has an intelligent and quick witted rough edge to him, and at the same time he makes the entire experience feel genuine by sinking into the role without a second thought. Cleavon Little makes a great cowboy hero in Blazing Saddles and is a very funny lead at the same time, making him one of the best actors that Mel Brooks discovered.\nGene Wilder gives a hilarious supporting performance in Blazing Saddles. Proving again simply how well he can work when teamed up with Mel Brooks, Gene Wilder is the perfect casting choice for the role of Jim, the \"Waco Kid\". The role doesn't demand his comic over the top nature, it simply emphasises his comic skills in a subtle role and it manages to easily do that well. Gene Wilder's restrained performance manages to create an example of the stoic western hero character and in the process has a nice gentle comic underside to it, so it is a great character as well as being fun to see Gene Wilder taking on the role.\nMadeline Kahn's brief supporting performance as Lili Von Shtupp is also a pretty good one because she manages to steal the screen with her vivacious sex appeal and easily please viewers with her naturally comedic charisma. Her entire song and dance number is pretty funny simply because of how it is entertaining and awkward both at once, and so she is easily memorable for her performance in Blazing Saddles.\nHarvey Korman's over the top performance as antagonist Hedley Lamarr is also really fun because it is so difficult to actually take him seriously that it is pretty hilarious in the end.\nLastly, Mel Brooks' signature supporting performance is a fairly hilarious one simply because he treats all of his scenes like a comedic monologue as if it were his last breath before he fell forever, and he puts all of his energy directly into the scenes without stopping for a second which is admirable for its dedication.\n\nSo although Blazing Saddles is rather dated and some of its jokes are a little hit and miss due to its more subtle nature in comparison to Mel Brooks' more over the top efforts, it is a clever and funny satire of western films which works as a legitimate western story as well as a hilarious parody of one simultaneously thanks to Mel Brooks finding the ideal balance between them.",
            "review_date": "2014-05-20",
            "source": "rt"
        },
        {
            "content": "Harvey Corman did stay in character. Listening Warehouse 13 \"writers\" Harvey did in all Mel Brokes films.",
            "review_date": "2014-05-12",
            "source": "rt"
        },
        {
            "content": "Ripe with rich, smart, silly satire as well as a record for a laughs per second, Blazing Saddles is one of Mel Brooks finest films, if not his most unrestrained",
            "review_date": "2014-05-12",
            "source": "rt"
        },
        {
            "content": "Sure, Blazing Saddles is one of Mel Brooks' less politically correct movies, but he does an impressive job in replicating the classic Western aesthetic (no inside-reference-turned-pun intended) for an essential twist: What if our hero were black? That forward thinking quickly trumps accusations of a racist agenda, not to mention that this is a spoof movie. Oddly enough, the film's greatest weaknesses are found in the jokes and the acting. When the movie hits, it's with flying colours. For example, *SPOILERS(?)* when the roughest thugs in the Wild West invade a movie studio of relatively scrawny, effeminate male dancers, an all-out brawl turns into a place of reconciliation. It's endearing, and quite funny. Mel Brooks clearly loves Looney Tunes, even using the closing credits theme after one gag. I might argue that this movie is equally an ode to Looney Tunes as it is to classic Westerns, with the edge of addressing contemporary racism (in a tongue in cheek fashion, to clarify).\n\nHowever, Looney Tunes had its flaws. Mel Brooks seems to try to replicate those flaws as well. The cabaret number from Lili Von Shtupp (Madeline Kahn), about how tired she is, is, ahem, tiresome. Actual cabaret is much funnier. Even more confusing is the scene that follows, when she tries to seduce Sheriff Bart (Cleavon Little) for the evil plot of Helen Lamar (Harvey Korman, and that's HEDLEY). I have no idea when her intentions changed from seducing evilly to genuinely, but when we next see her, we are to assume she is on the side of Bart. Gene Wilder, Mel Brooks, and Harvey Korman are all pretty funny, as their lines were practically written for them. Cleavon Little, however, is unfairly disadvantaged by not being Richard Pryor, incidentally one of the screenwriters for Blazing Saddles. Little does his best, and strikes gold when he can bring the stage to the screen, particularly in cartoonish moments like holding himself hostage so others withdraw guns from his face. Still, certain lines of his feel heavily indebted to the unique delivery of Pryor. Additionally, the sex and fart jokes have not aged very well. Hanging a horse rider AND his horse, on the other hand? Awesome. Segregation of carriage circles, when being raided by Native Americans? Splendid. I would watch Blazing Saddles again, though I am not blameless, if I would ever prefer to watch isolated clips from the movie.",
            "review_date": "2014-05-11",
            "source": "rt"
        },
        {
            "content": "Blazing saddles is a classic Mel Brooks comedy that skillfully uses the setting of the wild west to satirize racism in America. The jokes are smart and amazing, but will often also make you rightfully uncomfortable at the same time. It's a comedy gem, but not necessarily for those squeamish about racial satire.",
            "review_date": "2014-05-10",
            "source": "rt"
        },
        {
            "content": "A parody of westerns that explores racial prejudice. \n\nMy favourite character was The Waco Kid, played by Gene Wilder.",
            "review_date": "2014-05-04",
            "source": "rt"
        },
        {
            "content": "My favorite comedy when I need to laugh ! .. A great satire of Western Culture that is brutally honest and self aware .. Excellent selection from Mel Brooks and possibly his best film :) ..",
            "review_date": "2014-04-24",
            "source": "rt"
        },
        {
            "content": "Easily my favorite Mel Brooks film. Its raunchy,ridiculous and makes no sense but that's why its so funny.",
            "review_date": "2014-04-10",
            "source": "rt"
        },
        {
            "content": "With a mixture of surrealism, slapstick and then groundbreaking (and still quite shocking) vulgarity, Mel Brooks playfully sends up the movie western in an effective mixture of spoof and race/sex comedy that, with a liberal use of the \"N\" word and jokes mocking white prejudice makes the absurdity of racism plain.",
            "review_date": "2014-04-08",
            "source": "rt"
        },
        {
            "content": "Mel brooks at his finest",
            "review_date": "2014-03-30",
            "source": "rt"
        },
        {
            "content": "Mel Brooks goes to town with Blazing Saddles, creating a very funny, raunchy, even slightly racist comedy that hits all the right notes and never gives up the laughs. The fact that it is overdone is completely on purpose.",
            "review_date": "2014-03-26",
            "source": "rt"
        },
        {
            "content": "As with any Mel Brooks (Dracula: Dead and Loving It) film, nothing is off limits.  This one tackles racial clichés in a way that only Brooks can deliver. Packed with a cast that perfectly brings Brooks' insane brand of humor to life, including Cleavon Little, Gene Wilder (Willy Wonka and the Chocolate Factory), Slim Pickens (Dr. Strangelove), Harvey Korman (Dracula: Dead and Loving It), and Madeline Kahn (Young Frankenstein), it offends with hysterical results.  Several of my friends have theorized that this movie could never be made today.  I think they're right.  Everyone is so easily offended and everything is so sanitized by the politically correct police that something that's this funny couldn't possibly be produced today.  Oh well.  This one is a classic.",
            "review_date": "2014-03-20",
            "source": "rt"
        },
        {
            "content": "Hilarity with Mel Brooks all over it.",
            "review_date": "2014-03-11",
            "source": "rt"
        },
        {
            "content": "Has maybe 3 or 4 successful bits throughout. It's mainly slapstick humor, although there are weirdly a lot of really racially offensive scenes.",
            "review_date": "2014-02-20",
            "source": "rt"
        },
        {
            "content": "You don't need me to tell you Blazing Saddles is great.  That's a fact the world accepted long ago.  This is the pinnacle of Mel Brooks' ability to hilariously spoof a genre, and set the stage for other Brooks greats.\nCleavon Little was so funny & charismatic, it's too bad he didn't have more starring roles in films after this.\nObviously, the movie is famous for taking a funny poke at racism and racists.  What perplexed me, watching it again in 2014, is whether the homophobia built in to several scenes was also intentional.  Was Brooks taking quiet shots at homophobes as well as racists? or was his movie making gay jokes and slurs due to a lack of sensitivity toward the homosexual community of the 1970s?  I'm honestly unsure.  There are moments when it seems to make fun of gays just for the sake of it, which undermines the overall minority tolerance theme.  But there are other moments when the movie seeks to, weakly, knock down some gay stereotypes.  The scene where the male dancers get swept up in the Western street fight, at first seems to be a slur, but then shows the dancers, almost as gay stereotypes, stand up to macho bullying (of course, they're weaker and less \"manly\" than the cowboys) in spite of the odds stacked against them.  There's also a moment where we see a cowboy seemingly beat one of the dancers off-stage until the camera pans over to see them walking arm-in-arm intimately as if on a date.  That shot could either convey a joke, showing how gays are corrupting of straight men, or a joke on homosexual stereotypes, that you can't always tell who's gay and who's not and it doesn't matter.\nI'm not educated enough on Brooks or film history to know where Blazing Saddles is going with the gay jokes.  What I do know, is this movie is one of the funniest ever made. Definitely needs to be seen at least once.",
            "review_date": "2014-02-15",
            "source": "rt"
        },
        {
            "content": "Definitely one of the funniest comedies, along with Young Frankenstein, since Buster Keaton in his prime. Madeline Kahn and Gene Wilder are nothing short of outstanding. The blu ray has awesome picture and sound quality, and the extras are decent.",
            "review_date": "2014-02-12",
            "source": "rt"
        },
        {
            "content": "Blazing Saddles is a gloriously absurd and offensive spoof of westerns. The film totally embraces its politically-incorrect nature and doesn't care who it offends since it targets virtually everyone and everything. The film is absolutely hilarious, superbly performed, and outrageously entertaining from start to finish. This is a classic comedy that has definitely earned its reputation and still holds up extremely well 40 years later. If you enjoy a good comedy, this is one to see.",
            "review_date": "2014-02-09",
            "source": "rt"
        },
        {
            "content": "inappropriately funny",
            "review_date": "2014-02-06",
            "source": "rt"
        },
        {
            "content": "Full of anachronisms, staged mishaps and a plot \"structure\" that are perfect chaos, there's a lot to like about Blazing Saddles. Many of the spoofs required Wikipedia on my part and jokes rehashed since, but this is a classic comedy - even if it slightly missed the mark on me.",
            "review_date": "2014-02-06",
            "source": "rt"
        },
        {
            "content": "Bit off   (14)   TO OWN?",
            "review_date": "2014-02-02",
            "source": "rt"
        },
        {
            "content": "It's my favorite comedy film ever. I laugh my butt off every time I watch it. The characters are great and the situations are hilarious. The plot revolves around a black railroad worker who is sent to be a sheriff in a highly racist town. It's the most racist film ever but it's done in a funny way. There's no way this film could be made today  seeing how we have an African-American president. It's such a funny movie and it always puts a smile on my face and it has a surprisingly happy ending. I recommend this one.",
            "review_date": "2014-01-31",
            "source": "rt"
        },
        {
            "content": "Some of Mel Brooks' best work. Can't you see that the sheriff is a Ni...\n\n1/25/13 - Home",
            "review_date": "2014-01-24",
            "source": "rt"
        },
        {
            "content": "Mel Brooks could never make a bad movie even if he tried, enough said. This is pure comedy right here, sure it's got plot holes and some dirty humor, but it's to funny to really notice. It's also probably one of the most quotable movies of all time. I've only seen it once but long to re-watch sometime. Comedy doesn't get much better than this, and I reccomend it to anyone.",
            "review_date": "2014-01-23",
            "source": "rt"
        },
        {
            "content": "While hilariously funny and offensive on so many levels, I feel like this is a satire you have to see a few times before you actually \"get it\". I liked it the first time, but I was cracking up the second time. This movie is an ultimate classic, but I think you have to know ahead of time what exactly you're getting yourself into in order to thoroughly enjoy it.",
            "review_date": "2014-01-21",
            "source": "rt"
        },
        {
            "content": "Mel Brooks made a movie that can almost not be done these days with our overly sensitive society. A former black slave is hired as a sheriff to help prevent the town from being demolished for a railroad. It is highly offensive, but it is equally offensive to all which makes it work. There is also Gene Wilder as a gunslinger which has its moments. I felt it was a little lacking given the praise it has received, but I still enjoyed, just not as much as I thought I would",
            "review_date": "2014-01-11",
            "source": "rt"
        },
        {
            "content": "All time comedy classic by the brilliant Mel Brooks. fantastic casting and superb performances from Mel Brooks, Gene Wilder, Madeleine Kahn, Cleavon Little,Harvey Korman and Slim Pickens amongst others. I never get tired of watching this film. Superb!",
            "review_date": "2014-01-02",
            "source": "rt"
        },
        {
            "content": "Probably Mel Brooks' finest moment, and with wonderful performances throughout, this is a comedy master class.",
            "review_date": "2013-12-28",
            "source": "rt"
        },
        {
            "content": "Another great spoof from the king Mel Brooks.  The film tells the story about the assembly of a railroad that is halted due to a quicksand trap, so it must continue by building through the town of Rock Ridge, but those conflicts force the governor (played by Mel Brooks), to send over a black railroad worker there as a sheriff to handle the issue.  The film uses Mel Brooks' style of comedy and filmmaking to a maximum with epic and over-the-top fourth wall breaks, amazing satire that makes us laugh until we're out of breath, silly atmosphere, actually telling a story without satirizing its subject matter, and clever and inventive filmmaking.  The film has amazing songs, acting (especially from Cleavon Little, long-time Brooks collaborator Gene Wilder, Harvey Korman, Madiliene Kahn in her Oscar-nominated role as Lili Von Shtupp, and Mel Brooks), smart writing, perfect direction, great production values, and the incredible Oscar-nominated editing.  The film has nonstop laughs, and is a great Western satire that will live on in film history as one of the greatest comedy films ever made.  The perfect watching experience for Mel Brooks fans, as well as comedy fans.",
            "review_date": "2013-12-22",
            "source": "rt"
        },
        {
            "content": "With the exception of SPACEBALLS, I am, as of yet, not well-versed in all things Mel Brooks. I have been aware of his cultural influence through soundbites and clips of his films, but BLAZING SADDLES represents my first serious foray into the godfather of the spoof. Seeing as it is a spoof, the plot really doesn't matter too much since the entire genre is basically an excuse to poke fun at other things. And, I must say, BLAZING SADDLES does this quite well. Parts of it are kind of corny, and the middle 20-30 minutes is a bit dry, but the way it sends up the Western and makes fun of racial stereotypes more than compensates for whatever weaknesses it has. My favorite parts were Madeline Kahn as a Marlene Dietrich parody, Lili Von Shtupp, and Harvey Korman as the verbose Hedley Lamarr. Those were probably the most substantial running gags and they never got old. The opening and closing sequences (which goes more meta than I've never seen pre-90's) were also quite good. When it comes down to it, renting this was certainly a good choice but I'll probably have to add some Mel Brooks to my Blu-ray collection in the future. And for the few people who possibly haven't seen this yet, you don't know what you're missing.",
            "review_date": "2013-12-15",
            "source": "rt"
        },
        {
            "content": "Some of the humor is hit and miss, but this is still an instant classic.",
            "review_date": "2013-12-14",
            "source": "rt"
        },
        {
            "content": "Dafuq did I just watch?",
            "review_date": "2013-11-27",
            "source": "rt"
        },
        {
            "content": "Even with strong racial overtones and consistent use of the \"N\" word, Blazing Saddles remains a classic.  The entire movie is play off of everyone's learned bigotry and leaves the viewer with a lesson that there is no room for racial bias and we are all created equal.  Perhaps disturbing to some,  it's Mel Brooks at his best.",
            "review_date": "2013-11-19",
            "source": "rt"
        },
        {
            "content": "Dafuq did I just watch?",
            "review_date": "2013-11-09",
            "source": "rt"
        },
        {
            "content": "a great movie that there is no way in today's screwed up society could be made. just like the old tv show \" All in the Family\" . Because as Americans now we must forget about who we are so we don't offend anyone. Which is why I'm almost ashamed to call myself an American.",
            "review_date": "2013-11-03",
            "source": "rt"
        },
        {
            "content": "Just good old plain dumb comedy.",
            "review_date": "2013-11-03",
            "source": "rt"
        },
        {
            "content": "Mel Brooks captures comedy at its finest. Pushing the envelope with controversial topics and relatable modern day issues, this spoof shows how comedy is done.",
            "review_date": "2013-10-31",
            "source": "rt"
        },
        {
            "content": "A vulgar comedy western spoof that is saved only by it's great supporting cast. Originally written for Richard Pryor, thankfully it rose above the destiny it had as a turkey.",
            "review_date": "2013-10-30",
            "source": "rt"
        },
        {
            "content": "One of the most vulgar, crude, occasionally racist but funniest movies I have ever seen. highly recommend if you have a great sense of humor.",
            "review_date": "2013-10-16",
            "source": "rt"
        },
        {
            "content": "\"Blazing Saddles\" is probably the best possible definition of Mel Brooks's humor, but it's worth taking a shot at a verbal definition anyway: most of the sight gags are straight out of Looney Tunes, and most of the dialogue is unspeakable in polite society.  On the Looney Tunes point: Sheriff Bart (a very funny Cleavon Little) shows up in a period-inappropriate bellhop uniform, marches up to a rampaging lunkhead named Mongo, and says in a high-pitched Bugs Bunny-esque voice, \"Telegram!\"  Mongo accepts the delivery, Sheriff Bart crisply walks away with his fingers in his ears, and the package explodes in Mongo's face, leaving him sullied and smoking.  The Merry Melodies theme plays and the scene fades to black.  You might not expect that kind of thing to work in live action, but it does.  As to the dialogue, Mel Brooks hardly exaggerates when he says in a recent interview that the movie could not be made now.  Strangely, it might skate by with a PG-13 rating, going strictly by the MPAA's infamously stupid \"de facto censorship\" system: there are few or no F-bombs and no nudity.  Yet the overall impression is that far more sensitive taboos than these are being lampooned, and many are the jokes that might prompt boycotts, demonstrations, and general condemnation today.  In 1974, though, it was the highest-grossing film of the year, and Warner Brothers not only released it but was a character in it; the studio's iconic lot-tour groups, cafeteria, and all-is the setting of one of the most memorable scenes.  The movie's repeated acknowledgment that it is a movie is another Mel Brooks hallmark.  His films parody Hollywood, but they exhibit real affection for it too, and this one is full of references to the likes of Cecil B. DeMille, the Academy Awards, Douglas Fairbanks, \"High Noon,\" \"The Treasure of the Sierra Madre,\" and so on.  In other words, this film contains the kind of smart, flattering stuff that Hollywood loves to reward, the fart jokes that audiences want, and the fresh, risky content that gives critics something to write about.  It is a classic.",
            "review_date": "2013-10-15",
            "source": "rt"
        },
        {
            "content": "Blazing Saddles is a crude, hilarious, and an incredibly racist spoof of the Western genre.",
            "review_date": "2013-10-12",
            "source": "rt"
        },
        {
            "content": "The absolute best there ever will be.",
            "review_date": "2013-10-08",
            "source": "rt"
        },
        {
            "content": "A groundbreaking comedy, unafraid to target race, religion, politics and other stereotypes to reveal them as the empty negatives they are.",
            "review_date": "2013-10-03",
            "source": "rt"
        },
        {
            "content": "One of if not the best Mel Brooks movie of all times.",
            "review_date": "2013-10-01",
            "source": "rt"
        },
        {
            "content": "This is one of the all-time classic comedies, whose lines are often quoted and have become part of the lexicon.  It is a spoof of western movies, and racism.  It stars \nCleavon Little as a black sheriff in an all-white western town and Gene Wilder as his gunfighter deputy.  The bad guys are Harvey Korman, Slim Pickens, Madeline Kahn, and Mel Brooks.  Alex Karras makes a memorable appearance as the now infamous Mongo.  This is an unusual film that breaks all the rules, that remains controversial, and has many absolutely memorable, hilarious scenes.  This is not really a comedy, but an epic farce.  \"You'd do it for Randolph Scott.\"",
            "review_date": "2013-09-23",
            "source": "rt"
        },
        {
            "content": "This comedy about racial stereotypes and western parody alternates some excellent parts to many good and only a few mediocre overall makes you laugh often enough, one of the best of the genre.",
            "review_date": "2013-09-21",
            "source": "rt"
        },
        {
            "content": "I'm not a big comedy fan; I find most of it to be forced - it doesn't flow naturally - and juvenile. This fits that bill. I didn't laugh once and found the jokes more stupid than funny. Riddled with cliches, offensive labels for characters and a story too outlandish to care about, I just really didn't care for this. I've never thought Mel Brooks was a genius as others do; this cements my opinion.",
            "review_date": "2013-09-03",
            "source": "rt"
        },
        {
            "content": "This comedy about racial stereotypes and western parody alternates some excellent parts to many good and only a few mediocre overall makes you laugh often enough, one of the best of the genre.",
            "review_date": "2013-08-31",
            "source": "rt"
        },
        {
            "content": "class pure quality mel brooks classic",
            "review_date": "2013-08-24",
            "source": "rt"
        },
        {
            "content": "One of the best, if not THE best Mel Brooks movie. Marvel at the genius at work!",
            "review_date": "2013-08-23",
            "source": "rt"
        },
        {
            "content": "I CONFIRM THAT THIS MOVIE IS STILL FUNNY",
            "review_date": "2013-08-16",
            "source": "rt"
        },
        {
            "content": "one of Mel Brooks all time CLASSICS",
            "review_date": "2013-08-10",
            "source": "rt"
        },
        {
            "content": "Oh Mel Brooks you crazy motherfucka :D",
            "review_date": "2013-08-07",
            "source": "rt"
        },
        {
            "content": "It's got a few particularly memorable gags, but Blazing Saddles' padded runtime leaves the impression that Mel Gibson and company simply ran out of ideas about halfway through.",
            "review_date": "2013-08-05",
            "source": "rt"
        },
        {
            "content": "Fantastic comedy, Mel Brooks is a genius.",
            "review_date": "2013-08-04",
            "source": "rt"
        },
        {
            "content": "one of the greatest movies of all time just flat out funny from the first scene to the last.",
            "review_date": "2013-08-04",
            "source": "rt"
        },
        {
            "content": "Bringing down the time period of the expansion of the West from the golden pedestal in which it was placed, Blazing Saddles is a random and chaotic comedy that addresses social and cultural issues. While some of the comedy falls flat, there is simply too much of it to not find something enjoyable in this amusement park ride of a movie.\n\n- Details Breakdown -\n\nThe Good: This movie comes as a welcome reprieve from the typical Western film and draws attention to many of the traditional tropes that viewers have become accustomed to seeing and finding tiresome. I can probably count on one hand the number of movies I've seen where the characters literally break out of the studio set and take to the streets of Hollywood, and I have thoroughly enjoyed all of them, this movie included. There is a lot of fourth wall breaking in this movie, which should not be a surprise since it is a Mel Brooks movie. Much of the movie is rather funny to this day, which is impressive since it was released in 1974. There is just so much going on in this movie, it is hard to not find something to laugh at. The sheer randomness of some things is enough to crack a smile from the most serious cinema-goer. This movie cleverly disguises its comedic nature at the start and then slowly lets it slip out throughout the movie, eventually building to a completely ridiculous ending. There is some serious self-reflexivity going on this movie that is the very heart of the story and the comedy. This reflexivity ranges from political to cultural in nature and covers a wide variety of topics from Hollywood to racism. Speaking of racism, I absolutely must bring up that subject when dealing with this movie seeing as it is often seen as one of the most racist movies of its generation. On the surface, it would initially appear to be extremely racist against everything with any pigment whatsoever, but as the movie progresses the real nature of the movie comes to light. This movie actually spends the majority of its time poking fun at the racism and idiocracy of white people and the African Americans in the movie are really some of the only characters that make a whole lot of sense. Although I was not alive in the 1970's, I feel that this movie came out at a great time in history and hopefully sparked some self-reflection on the topic of racism and its source.\n\nThe Bad: A lot of the comedy falls flat, partially due to the dated nature of the film and partially due to Mel Brooks thinking the strangest things are funny. There are some dry spots near the middle that have very little, if any comedy, and are not particularly interesting. There is a seemingly never-ending song by Lili Von Shtupp that is painful to listen to and watch that simply needs to be cut from the film altogether. There are a lot of hanging plot-lines that never go anywhere and are a bit disappointing. The story feels a bit stupid in parts and not in the intentionally stupid way that occurs in other parts, but in a poor writing way. Some of the acting is rather poor and over the top, which takes away from some of the more subtle comedic moments.",
            "review_date": "2013-08-03",
            "source": "rt"
        },
        {
            "content": "Bringing down the time period of the expansion of the West from the golden pedestal in which it was placed, Blazing Saddles is a random and chaotic comedy that addresses social and cultural issues. While some of the comedy falls flat, there is simply too much of it to not find something enjoyable in this amusement park ride of a movie.\n\n- Details Breakdown -\n\nThe Good: This movie comes as a welcome reprieve from the typical Western film and draws attention to many of the traditional tropes that viewers have become accustomed to seeing and finding tiresome. I can probably count on one hand the number of movies I've seen where the characters literally break out of the studio set and take to the streets of Hollywood, and I have thoroughly enjoyed all of them, this movie included. There is a lot of fourth wall breaking in this movie, which should not be a surprise since it is a Mel Brooks movie. Much of the movie is rather funny to this day, which is impressive since it was released in 1974. There is just so much going on in this movie, it is hard to not find something to laugh at. The sheer randomness of some things is enough to crack a smile from the most serious cinema-goer. This movie cleverly disguises its comedic nature at the start and then slowly lets it slip out throughout the movie, eventually building to a completely ridiculous ending. There is some serious self-reflexivity going on this movie that is the very heart of the story and the comedy. This reflexivity ranges from political to cultural in nature and covers a wide variety of topics from Hollywood to racism. Speaking of racism, I absolutely must bring up that subject when dealing with this movie seeing as it is often seen as one of the most racist movies of its generation. On the surface, it would initially appear to be extremely racist against everything with any pigment whatsoever, but as the movie progresses the real nature of the movie comes to light. This movie actually spends the majority of its time poking fun at the racism and idiocracy of white people and the African Americans in the movie are really some of the only characters that make a whole lot of sense. Although I was not alive in the 1970's, I feel that this movie came out at a great time in history and hopefully sparked some self-reflection on the topic of racism and its source.\n\nThe Bad: A lot of the comedy falls flat, partially due to the dated nature of the film and partially due to Mel Brooks thinking the strangest things are funny. There are some dry spots near the middle that have very little, if any comedy, and are not particularly interesting. There is a seemingly never-ending song by Lili Von Shtupp that is painful to listen to and watch that simply needs to be cut from the film altogether. There are a lot of hanging plot-lines that never go anywhere and are a bit disappointing. The story feels a bit stupid in parts and not in the intentionally stupid way that occurs in other parts, but in a poor writing way. Some of the acting is rather poor and over the top, which takes away from some of the more subtle comedic moments.",
            "review_date": "2013-08-03",
            "source": "rt"
        },
        {
            "content": "A legendary film in the history of cinema!",
            "review_date": "2013-08-02",
            "source": "rt"
        },
        {
            "content": "One of my all time favourite comedies",
            "review_date": "2013-07-30",
            "source": "rt"
        },
        {
            "content": "HEY WHERE THE WHITE WOMEN AT",
            "review_date": "2013-07-29",
            "source": "rt"
        },
        {
            "content": "A great classic comedy",
            "review_date": "2013-07-27",
            "source": "rt"
        },
        {
            "content": "gr8 parody and a real laughfest",
            "review_date": "2013-07-25",
            "source": "rt"
        },
        {
            "content": "awesome movie! freakin hilarious and now one of my fave comedies",
            "review_date": "2013-07-23",
            "source": "rt"
        },
        {
            "content": "Slapstick/nonsensical comedy has never really appealed to me, but it's always fun when the actors are clearly enjoying the movie they're working on.",
            "review_date": "2013-07-23",
            "source": "rt"
        },
        {
            "content": "A great comedy/western that's consistently hilarious.",
            "review_date": "2013-07-18",
            "source": "rt"
        },
        {
            "content": "More than just a comedy, an excellent spoof of the classic Western genre, acknowledging the racism that they refuse to and very, very funny.",
            "review_date": "2013-07-18",
            "source": "rt"
        },
        {
            "content": "best movie ever.Afa has it listed in top 5 funniest movies of all time.",
            "review_date": "2013-07-18",
            "source": "rt"
        },
        {
            "content": "OMG!  Too effing funny!",
            "review_date": "2013-07-10",
            "source": "rt"
        },
        {
            "content": "One of the greatest comedy I've seen!  Mel Brook's best!",
            "review_date": "2013-07-08",
            "source": "rt"
        },
        {
            "content": "legendary and hilarious. they will never make a movie like this again. sad.",
            "review_date": "2013-07-04",
            "source": "rt"
        },
        {
            "content": "Brooks' best film! hilarious, racist, and just goddamn hilarious!",
            "review_date": "2013-06-26",
            "source": "rt"
        },
        {
            "content": "totally one of the more tolerable spoof movies\nthis one mainly satirizes the Wild West and throwing in a bit of racial humor even scandalous bits of it\nthe laughs are very far and few in between but thank goodness they work so well and never bring the film down once\nlove Gene Wilder and Cleavon Little, even Dom Deluise in a supporting role\nthe ending is very strange and out of place but that's the loveableness that Mel Brooks likes to toy around with",
            "review_date": "2013-06-26",
            "source": "rt"
        },
        {
            "content": "It is self-aware of being a goofy satire and that makes it work to those who know what they're getting into.",
            "review_date": "2013-06-25",
            "source": "rt"
        },
        {
            "content": "One of the best comedies ever made!",
            "review_date": "2013-06-22",
            "source": "rt"
        },
        {
            "content": "Juvenile humour and a forgettable plot do not a classic film make.",
            "review_date": "2013-06-21",
            "source": "rt"
        },
        {
            "content": "Hilarious and so self aware! Breaking the 4th wall, literally, was SOOO genius!",
            "review_date": "2013-06-20",
            "source": "rt"
        },
        {
            "content": "The political incorrectness is what makes the film so refreshing. Brooks displays such a liberty of expressing the vulgar; turning the western genre on its head, while also satirically subverting western values that targets prejudice people.",
            "review_date": "2013-06-17",
            "source": "rt"
        },
        {
            "content": "Perhaps it's because Young Frankenstein remains one of my favorite comedies of all time, but this sort of seems like a step below that high standard, even if this movie came out a little less than a year before Young Frankenstein.  Anyway, setting all that aside, this film is still absolutely tremendous with its raunchy humor and a manic, yet silly, energy about that makes this film an absolute blast.  The film could certainly be seen as controversial due to its racial humor, but it is used to illustrate a point about the western genre and it's racism, so in that way the film is far more thoughtful than its humor would imply.  This isn't unlike Mel Brooks' other spoof films, it's silly, it's over the top, features a large cast of incredibly talented comedians, with Harvey Korman, Madeline Kahn and Dom Deluise's cameo being highlights in a film that's hilarious from beginning to end.  Perhaps another reason I liked Young Frankenstein more was because of Gene Wilder's genius comedic performance in that movie and in this movie there isn't that individual performance that would take it to the next level, it's the work of the entire cast.  And don't get me wrong, Young Frankenstein is the work of the cast as well, but there's that little extra oomph when you have Gene Wilder going batshit as well.  This film doesn't have that, though, again, this film is still pretty amazing and hilarious without that aspect.  The film is really all over the place and while the climax of the film breaks the fourth wall in a pretty gigantic manner, it somehow fits with the insanity of the film.  And, in hindsight, it actually makes the film even funnier than it was after the \"twist\".  So yea I loved this movie, this might be a shitty review, and it really is, but I had tears flowing down my face because that's how funny the movie was.  Comedy gold right here.",
            "review_date": "2013-06-15",
            "source": "rt"
        },
        {
            "content": "mine and probably most peoples favorite works of mel brooks and gene wilder",
            "review_date": "2013-06-15",
            "source": "rt"
        },
        {
            "content": "Need a comedy filled with bad-taste jokes and crude humor?  This movie is for you!  One of Mel Brooks best spoof movies around.",
            "review_date": "2013-06-14",
            "source": "rt"
        },
        {
            "content": "Great performances, memorable characters and classic jokes makes this movie a classic",
            "review_date": "2013-06-12",
            "source": "rt"
        },
        {
            "content": "Like a good book, this movie should be revisited every couple years or so.",
            "review_date": "2013-06-11",
            "source": "rt"
        },
        {
            "content": "Finally saw it! It was a tad cruder than I was expecting, and all it's jokes/satire didn't quite work for me. but overall it was a lot of fun.",
            "review_date": "2013-06-09",
            "source": "rt"
        },
        {
            "content": "This is an absolute classic.",
            "review_date": "2013-06-05",
            "source": "rt"
        },
        {
            "content": "Absolutely hilarious.",
            "review_date": "2013-06-04",
            "source": "rt"
        },
        {
            "content": "This film is hilarious, ridiculous, nonsensical and partly metafictional.",
            "review_date": "2013-06-03",
            "source": "rt"
        },
        {
            "content": "Mel Brooks offends every race, creed, religion, nation and sexual orientation possible while liking everyone and turning racism and stereotypes on their head.  You can not make movies like this anymore.  South Park comes closest.\r\nPlus this movie has the funniest fart scene anywhere.",
            "review_date": "2013-05-29",
            "source": "rt"
        },
        {
            "content": "Too many stupidly silly moments crammed into one movie not to like it, a mel brooks classic.",
            "review_date": "2013-05-29",
            "source": "rt"
        },
        {
            "content": "Mel Brooks is at his best in this dated but hilarious film.",
            "review_date": "2013-05-23",
            "source": "rt"
        },
        {
            "content": "Mel Brooks classic. Work,work,work,work. That's what this movie does. Ahead of it's time when it was released",
            "review_date": "2013-05-21",
            "source": "rt"
        },
        {
            "content": "Wonderful, hilarious comedy.",
            "review_date": "2013-05-16",
            "source": "rt"
        },
        {
            "content": "Old comedy, American humor, watched it a second time recently and still laughed. Great random jokes here, it's a piece of cinematic history that i could recommend. Do note that its a Mel Brooks movie and sorta like a spoof. Set in the Wild West during... racist times.",
            "review_date": "2013-05-09",
            "source": "rt"
        },
        {
            "content": "With the exception of the ending, this movie is absolutely funny!",
            "review_date": "2013-05-08",
            "source": "rt"
        },
        {
            "content": "One of the funniest movies I've ever seen. Blazing saddles is a crude and vulgar satire that works thanks to the strength of the cast and directing by Mel Brooks.",
            "review_date": "2013-05-06",
            "source": "rt"
        },
        {
            "content": "Need a laugh watch now!!!",
            "review_date": "2013-04-28",
            "source": "rt"
        },
        {
            "content": "rips the piss out of westerns and is so funny !!!!",
            "review_date": "2013-04-28",
            "source": "rt"
        },
        {
            "content": "Cuesta trabajo seguirle el ritmo a este filme de Me Brooks, pero cuando uno lo logra se encuentra ante una comedia vulgar, racista y sobre todo esplendorosa. Una parodia del oeste creada por el maestro del género, y que cuenta con el duo de Gene Wilder y Cleavon Little como Waco Kid y Bart; esta amistad se siente fuera del filme y los actores están excelentes en sus papeles como los más cuerdos en esta irreverente película que vale la pena ver para reir y entender como era la época en la que la parodia era gloriosa.",
            "review_date": "2013-04-27",
            "source": "rt"
        },
        {
            "content": "Blazing Saddles is a film that has as so many laughs, and also many jokes that fall flat. It's really funny in some parts, and tedious in others. What makes this movie so good is the originality and unpredictability of it all.",
            "review_date": "2013-04-23",
            "source": "rt"
        },
        {
            "content": "A brilliant Mel Brookes film, full of great one liners and memorable performances. The beans round the fire part makes me laugh everytime. A classic that everyone should have. No matter how many times i watch it, i still laugh out load.",
            "review_date": "2013-04-20",
            "source": "rt"
        },
        {
            "content": "One of the funniest movies ever.",
            "review_date": "2013-04-20",
            "source": "rt"
        },
        {
            "content": "\"How did he perform such spectacular stunts with such small feet?\"\nSpoofs like Blazing Saddles are pretty much un-reviewable, you can't judge it on plot or character development or any of the things critics usually look for, you can only really decide how much it did or didn't make you laugh, and in the case of this movie, I laughed a lot!...\nThe movie feels like an extended Looney Tunes short, exempt with a tonne of vulgarity tossed into the zaniness. There is never any consistency on any level, the movie makes serious and often uncomfortable jabs at white American racism in one scene, and then follows it up with puns and fart humor in another, and then some Monty Python style randomness after that.\nAlthough there are plenty of things Blazing Saddles has over other, similar spoofs (such as recent imitators like the Scary Movies [2000-2013] and Vampires Suck [2010]), it has some legitimately good performances (a very subtle Gene Wilder for instance) to play off the hilariously over-the-top ones (an unforgettably funny Harvey Norman), a great knowledge of Movie Westerns (probably from Mel Brooks') that leads to much smarter jokes than if it had just spoofed the obvious cliches, and a sharp satirical undercurrent that has important points to make about racism in the old west, and in Hollywood itself.\nConclusion: It's like Django Unchained, exempt earlier and weirder, but also much funnier.",
            "review_date": "2013-04-19",
            "source": "rt"
        },
        {
            "content": "One of the funniest movies ever to be made!",
            "review_date": "2013-04-14",
            "source": "rt"
        },
        {
            "content": "Funniest movie ever, period!",
            "review_date": "2013-04-06",
            "source": "rt"
        },
        {
            "content": "I love this movie!!!",
            "review_date": "2013-03-31",
            "source": "rt"
        },
        {
            "content": "It's a laugh a minute gag reel with some classic one liners. Its bizarre ending lets it down.",
            "review_date": "2013-03-31",
            "source": "rt"
        },
        {
            "content": "Was lucky to be able to see this on the big screen last night.  It's just as funny today as it was back then.",
            "review_date": "2013-03-29",
            "source": "rt"
        },
        {
            "content": "funny and stupid best combo",
            "review_date": "2013-03-23",
            "source": "rt"
        },
        {
            "content": "where the white women at? lol",
            "review_date": "2013-03-22",
            "source": "rt"
        },
        {
            "content": "A classic comedy that should be on every ones watch list. Its raunchy but to funny not to watch.",
            "review_date": "2013-03-20",
            "source": "rt"
        },
        {
            "content": "Awesome movie .. still laugh at the first five minutes after seeing this about fifty times :-)",
            "review_date": "2013-03-16",
            "source": "rt"
        },
        {
            "content": "De entrada encontré algunos gags de antología (graciosos y medio incisivos). Por la mitad hay varios chistes absurdistas que debilitan la narrativa y... no me parecieron tan graciosos. Y al final, Mel desarma toda la película, el set, desparrama todo por todos lados... parece montyptyhonezco... y por momentos pareciera que incluso llega a parodiar el meta-cine o su mismo recurso de mostrar la peli desde afuera (??). No sé bien si los últimos 20 minutos son geniales, al menos son caóticos.",
            "review_date": "2013-03-15",
            "source": "rt"
        },
        {
            "content": "Hilarious with a rewatch appeal. Comedy western movie that has balls.",
            "review_date": "2013-03-14",
            "source": "rt"
        },
        {
            "content": "No encuentro esta pelicula tan graciosa como otras mas nuevas de Mel Brooks, pero por el contrario la considero mucho mas elaborada e \"inteligente\" dentro de lo posible.  Tenia hartas ganas de ver esta pelicula ya que algunos la consideraban la mejor comedia de la historia, pero no! por lo menos de mi punto de vista Life Of Brian sigue siendo la mejor :)",
            "review_date": "2013-03-13",
            "source": "rt"
        },
        {
            "content": "Hey, where are the white women at?",
            "review_date": "2013-03-03",
            "source": "rt"
        },
        {
            "content": "THE best parody of westerns ever conceived and produced. NOTHING is sacred, and everything is fair game for tart lampooning.",
            "review_date": "2013-03-03",
            "source": "rt"
        },
        {
            "content": "Funny movie. Mel Brooks makes light of every race and didn't care about being political correct.",
            "review_date": "2013-03-02",
            "source": "rt"
        },
        {
            "content": "Absolut en sjov film og en film der følger Mel Brooks' stil. Til sidst kammer den helt over og det er også genialt, men filmen mangler lidt af det som eks. 'The Producers' har, nemlig et godt tempo og endnu mere humor. Dog seværdig og fin underholdning.",
            "review_date": "2013-03-02",
            "source": "rt"
        },
        {
            "content": "Not so much funny with odd end. But I enjoyed exceptional picture (I watched BD). But Ceavon and Gene made thic movie worth it. Ok, those tits was watchable too. But that's all.",
            "review_date": "2013-02-28",
            "source": "rt"
        },
        {
            "content": "This movie is so politically incorrect, its one of the funniest movies ever!",
            "review_date": "2013-02-27",
            "source": "rt"
        },
        {
            "content": "The raunchy humor seems to compliment the plot of the movie. Without a doubt one of Mel Brooks' greatest creations.",
            "review_date": "2013-02-24",
            "source": "rt"
        },
        {
            "content": "\"A black sheriff??\" ...\r\n\r\n\"Why not? Worked in Blazing Saddles!\"",
            "review_date": "2013-02-24",
            "source": "rt"
        },
        {
            "content": "Very offbeat with jokes coming at an Airplane! like rate, but, unfortunately, this film doesn't get better with age, but seems to lose its charm the more you see it.",
            "review_date": "2013-02-20",
            "source": "rt"
        },
        {
            "content": "This is a truly funny movie, but remember it's not for everyone.",
            "review_date": "2013-02-20",
            "source": "rt"
        },
        {
            "content": "were I got my nickname... mongo ......",
            "review_date": "2013-02-19",
            "source": "rt"
        },
        {
            "content": "Love Gene Wilder! This movie is so funny!!",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "One of the funniest comedies I've ever seen. I can totally see this adapted as a Broadway musical, just like \"The Producers\" and \"Young Frankenstein\".",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "\"Excuse me while I whip this out\"\r\n\"Ahhhhhhhhhhhh!\"",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "Super funny movie, an instant classic and a must see movie.",
            "review_date": "2013-02-14",
            "source": "rt"
        },
        {
            "content": "where all the white ladies at?",
            "review_date": "2013-02-13",
            "source": "rt"
        },
        {
            "content": "Another Great Mel Brooks film. One of the last movie's I can recall a white person can get away with saying the N Word",
            "review_date": "2013-02-02",
            "source": "rt"
        },
        {
            "content": "A movie that got an originally mixed reception coming out of the gate, has gotten legendary status over the years and put another notch in Mel Brooks's belt of awesome comedies",
            "review_date": "2013-01-29",
            "source": "rt"
        },
        {
            "content": "Perhaps it is just me but I watched the movie forcing myself to laugh through most of it but it still gives some good Mel Brooks humour.",
            "review_date": "2013-01-28",
            "source": "rt"
        },
        {
            "content": "Before Django was unchained I guess really just an American classic",
            "review_date": "2013-01-27",
            "source": "rt"
        },
        {
            "content": "This is the BEST movie ever made!!!! A genius movie that showed humor and wit before its time!!!!",
            "review_date": "2013-01-27",
            "source": "rt"
        },
        {
            "content": "A predecessor to Quentin Tarantino's \"Django Unchained\" in a way, this send up of the Western and racism is a perfectly watchable film with funny performances from Gene Wilder and Harvey Korman.  I also appreciate the meta touches of this film that reward the observant.  However, I wouldn't say that it's anywhere close to being the best comedy of all time.  I think I would have liked it better had I seen it in high school. (27 January 2013)",
            "review_date": "2013-01-27",
            "source": "rt"
        },
        {
            "content": "They don't make them like this anymore.",
            "review_date": "2013-01-24",
            "source": "rt"
        },
        {
            "content": "My favorite Mel Brooks movie, hands down. I love Gene Wilder in this movie and the comedy is so good, it hurts.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "I'm not a big fan, but it is still a classic.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "Absolutely hysterical.",
            "review_date": "2013-01-20",
            "source": "rt"
        },
        {
            "content": "Very funny and offensive!",
            "review_date": "2013-01-13",
            "source": "rt"
        },
        {
            "content": "Overall a very funny movie, although some of it seems dated now.",
            "review_date": "2013-01-12",
            "source": "rt"
        },
        {
            "content": "Blazing Saddles was the peak of Mel Brooks' career, if there ever was one. Brooks' earlier and later films were pretty obnoxious and never measured up to the social satire that Saddles brought on. There are still some ridiculous scenes, particularly the last 15 minutes, which seemed like a bunch of ideas that should've been thrown out of the script, but were instead jumbled all into the same scene. However, the film still holds up today and is the classic critics proclaim it to be.",
            "review_date": "2013-01-12",
            "source": "rt"
        },
        {
            "content": "Here is a western comedy spoof that stands as rebellious today as it was when first released. Blazing Saddles is also one of the films that is most representative of Mel Brooks' very own brand of chaotic and gloriously rude comedy and creative comedy.",
            "review_date": "2013-01-12",
            "source": "rt"
        },
        {
            "content": "Highly offensive if you don't have a good sense of humor, but hilarious if you can handle it",
            "review_date": "2013-01-10",
            "source": "rt"
        },
        {
            "content": "Funny, stupid humor. But still a classic!",
            "review_date": "2013-01-10",
            "source": "rt"
        },
        {
            "content": "Although it lacks rafinement, this movie remains amusing, entertaining and a complete thrill to the viewer. Stupid yet imposible to miss.",
            "review_date": "2013-01-09",
            "source": "rt"
        },
        {
            "content": "I watched this for my classic movie night and it was pretty good but not as good as Audrey Hepburn's movies I saw for classic movie night",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "Brooks gives us a hilarious spoof with easily the most ridiculously unforgettable ending to a movie I have ever seen.",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "stupidest movie on the planet...",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "The best Mel Brooks movie. A classic parody film that's funny in almost an offensive way. Though it was a bad movie, it knew it and that gave it it's charm.",
            "review_date": "2013-01-03",
            "source": "rt"
        },
        {
            "content": "One of the funniest movies, ever.  A true Mel Brooks classic!",
            "review_date": "2013-01-01",
            "source": "rt"
        },
        {
            "content": "Mel Brooks's masterpiece.",
            "review_date": "2013-01-01",
            "source": "rt"
        },
        {
            "content": "The anything-goes-for-a-laugh style of comedy is amusingly anarchic, though doesn't necessarily deliver consistent laughs.",
            "review_date": "2012-12-31",
            "source": "rt"
        },
        {
            "content": "Full of humor and wit, Blazing Saddles is sure to be one of Mel Brook's finest films.",
            "review_date": "2012-12-30",
            "source": "rt"
        },
        {
            "content": "This is the most amazingly funny movies ever made. I watch it over and over and still laugh at the jokes every single time. I love Mel Brooks, and this is my favorite of his movies. The only thing is that I hate the ending. I usually turn it off once they go to the new set.",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "genius. mel brooks is a favorite of mine. also gene wilder is great i love watching his films. the jokes are hilarious and old school.",
            "review_date": "2012-12-27",
            "source": "rt"
        },
        {
            "content": "CLASSIC MEL BROOKS, THE BEST PARODY FILM EVER,HILARIOUS THROUGHOUT THE WHOLE MOVIE!!",
            "review_date": "2012-12-27",
            "source": "rt"
        },
        {
            "content": "fantastically funny film, but tails off towards the end",
            "review_date": "2012-12-27",
            "source": "rt"
        },
        {
            "content": "Dosen't have as much wit as Young Frankenstein, but that's not a bad thing.",
            "review_date": "2012-12-25",
            "source": "rt"
        },
        {
            "content": "13 is my limit on Scnitzengruben Baby",
            "review_date": "2012-12-25",
            "source": "rt"
        },
        {
            "content": "Excuse me while I whip this out.",
            "review_date": "2012-12-23",
            "source": "rt"
        },
        {
            "content": "One of my favorite Mel Brooks films of all time shows the harsh times of the west with some comedy mixed into it with a great cast hilarious writing and the classical Mel Brooks delivers a good time that I like to see again and again.",
            "review_date": "2012-12-23",
            "source": "rt"
        },
        {
            "content": "2nd best Mel Brooks comedy.\r\n\"Where are all the white women at?\"",
            "review_date": "2012-12-20",
            "source": "rt"
        },
        {
            "content": "Before the Chappelle show there was Blazing Saddles.",
            "review_date": "2012-12-17",
            "source": "rt"
        },
        {
            "content": "if i wanna laugh i can put this movie,anchorman and office space on loop, pobably my most watched comedy!!",
            "review_date": "2012-12-07",
            "source": "rt"
        },
        {
            "content": "A finely tuned spoof of Western films, Blazing Saddles is both hilarious and heartfelt, owing most of its success to the chemistry shared by its leads.",
            "review_date": "2012-12-02",
            "source": "rt"
        },
        {
            "content": "Blazing Saddles is Mel Brooks' typical silly entertainment, but it manages to stay interesting with a perfectly reasonable hour-and-a-half running time.",
            "review_date": "2012-12-01",
            "source": "rt"
        },
        {
            "content": "Still the original \"politically incorrect\" movie. Even 40 years later, it's still one of the funniest comedies of all time.",
            "review_date": "2012-12-01",
            "source": "rt"
        },
        {
            "content": "One of the few Mel Brooks movies, along with Young Frankenstein, that is consistently funny.   This movie is now almost 40 years old and was made long before political correctness killed off much of the American sense of humor.  There was no \"inappropriate laughter\" back then.  Modern liberals should probably avoid this movie and I have to admit that I wouldn't let kids watch it.  The musical scene with Madeline Kahn is a high point.",
            "review_date": "2012-11-30",
            "source": "rt"
        },
        {
            "content": "The ending bugged me how it went out of universe but everything before that I loved!",
            "review_date": "2012-11-30",
            "source": "rt"
        },
        {
            "content": "One of the all time great films, everything is spot on in this spoof of the Westerns of the 1950s and 60s.",
            "review_date": "2012-11-28",
            "source": "rt"
        },
        {
            "content": "You just couldn't make a movie like this in today's world. Don't try to watch it on tv. View it on DVD unedited.",
            "review_date": "2012-11-28",
            "source": "rt"
        },
        {
            "content": "bonkers always makes me laugh",
            "review_date": "2012-11-27",
            "source": "rt"
        },
        {
            "content": "Flatulence never smelled so good as with Blazing Saddles. Nearly 40 years later, I still blow a gasket when Mel Brooks as the Indian chief exclaims 'schvatzas, lezem gain'.",
            "review_date": "2012-11-26",
            "source": "rt"
        },
        {
            "content": "The funniest movie I have ever watched",
            "review_date": "2012-11-25",
            "source": "rt"
        },
        {
            "content": "i liked it cause it was soooo stupid",
            "review_date": "2012-11-25",
            "source": "rt"
        },
        {
            "content": "A very funny movie with great performances.",
            "review_date": "2012-11-18",
            "source": "rt"
        },
        {
            "content": "Starts off funny and very offensive, but quickly loses steam to the point where it is hard not to just turn it off.",
            "review_date": "2012-11-18",
            "source": "rt"
        },
        {
            "content": "Brooks couldn't let a frame go by, it seems, without reaching for a gag; some miss, but some hit so perfectly that genres crumble and stereotypes turn inside-out.  Brooks has a couple of cameos; as a Native American, looking at black settlers, his first word is predictable but perfect: \"Schvartzes.\"",
            "review_date": "2012-11-16",
            "source": "rt"
        },
        {
            "content": "A classic in every sense of the word.  I only just recently saw this movie for the first time on Blu-Ray (in letterbox widescreen, too!  I can't imagine watching it in pan-and-scan format), and I thought the movie was very funny, and as a Western/comedy hybrid I strongly feel that it works.  One of my favorite Mel Brooks movies alongside Young Frankenstein and Robin Hood: Men in Tights.  Gene Wilder is hysterical as always, and I loved the director's cameo as the governor.  A lot of the scenes and jokes are funny, Cleavon Little makes for a good lead character, and I enjoyed the size and scope of the movie.  The Western environment is effective, and I love how absurd it gets towards the last action scene.  This movie was a real blast from beginning to end!",
            "review_date": "2012-11-15",
            "source": "rt"
        },
        {
            "content": "i remember seeing this as a kid and thinking it was funny but now i can see i missed out on the real humor of the film. still funny after all these years without the crass scatological elements that fill \"comedies\" today.",
            "review_date": "2012-11-15",
            "source": "rt"
        },
        {
            "content": "So funny ,and very silly.Cleavon Little and Gene Wider in a perfect Bromance,and a sackful of classic lines and gags.I love the song.",
            "review_date": "2012-11-14",
            "source": "rt"
        },
        {
            "content": "I love the kind of humour that offends people in the process... Blazing Saddles is a perfect film for that !!! I enjoyed this film so much !",
            "review_date": "2012-11-13",
            "source": "rt"
        },
        {
            "content": "Whatever happened to Cleavon Little? I recall seeing this and having my sides hurt from laughter for days afterwards. Notably, I recall the film's ability to deconstruct racism in a way that leaves me marveling at how modern the sensibilities were for the filmmakers then and how archaic our society still remains.",
            "review_date": "2012-11-12",
            "source": "rt"
        },
        {
            "content": "While the movie is a comedic classic. I hate the ending so much.",
            "review_date": "2012-11-10",
            "source": "rt"
        },
        {
            "content": "Daring for its time, and still halirous spoof on the classic western movie.",
            "review_date": "2012-11-10",
            "source": "rt"
        },
        {
            "content": "i guess i just don't like the portion where the story spins out of control. Otherwise, it was a good show.",
            "review_date": "2012-11-09",
            "source": "rt"
        },
        {
            "content": "Hilarious and loving spoof of the classic westerns in which a black railway worker (Cleavon Little) who is roped into becoming the sheriff of a small town as part of a scheme by a corrupt attorney general (Harvey Korman) to get the land cheap to cash in on the railroad that is scheduled to run through the town.  Facing hostility from the townsfolk and danger from a posse of Korman's outlaws, the new sheriff must use all his wits to save the day, and in the most ridiculous fashion possible.   The jokes are fast and furious as writer/director/star Mel Brooks mines the story (co-written by Richard Pryor!) for laughs with nothing being sacred, all buoyed by a charming cast and some truly inspired wackiness.",
            "review_date": "2012-11-07",
            "source": "rt"
        },
        {
            "content": "Blazing Saddles is still very funny. One of Mel Brooks best!",
            "review_date": "2012-11-04",
            "source": "rt"
        },
        {
            "content": "I'm going to give it the benefit of the doubt and guess that it was probably funnier back in the day.  Cleavon Little really shines, though.",
            "review_date": "2012-11-04",
            "source": "rt"
        },
        {
            "content": "Saw this when it came out in the 70's...funny as hell ..Mel Brooks movies are hilarious",
            "review_date": "2012-11-01",
            "source": "rt"
        },
        {
            "content": "History mixed with racism in a cup and sprinkled with comedy and a terrific cast; this is Blazing Saddles!",
            "review_date": "2012-10-29",
            "source": "rt"
        },
        {
            "content": "Western spoof where a black sheriff is placed in a town to help drive its residents out so a railroad can run through it.  Clever and hits the mark at times but also has several misses.  Has a ton of racial jokes you can't really get away with now.",
            "review_date": "2012-10-27",
            "source": "rt"
        },
        {
            "content": "If you have ever wondered where the first onscreen fart occured here's your answer. Very funny movie.",
            "review_date": "2012-10-24",
            "source": "rt"
        },
        {
            "content": "This movie was created at a particular point in time, something which couldn't be made today. Hilarious! Mel Brooks at his brilliant best. Yes, some people might be offended yet it remains a stunning insight into events of the time it was made. Highly recommended, save for the PC crowd.",
            "review_date": "2012-10-22",
            "source": "rt"
        },
        {
            "content": "funny, but not that funny",
            "review_date": "2012-10-22",
            "source": "rt"
        },
        {
            "content": "\"Blazing Saddles\" is both crude and offensive, but great performances from Cleavon Little and Gene Wilder allow this film to use it to their advantage, making this film a classic.",
            "review_date": "2012-10-21",
            "source": "rt"
        },
        {
            "content": "I laughed my ass off! One funniest movies I've ever seen, and I've seen a lot!",
            "review_date": "2012-10-21",
            "source": "rt"
        },
        {
            "content": "Never get tired of watching this film",
            "review_date": "2012-10-21",
            "source": "rt"
        },
        {
            "content": "hilarious-its for the racist in all of us",
            "review_date": "2012-10-16",
            "source": "rt"
        },
        {
            "content": "Blazing Saddles is my \"go-to\" movie for when I'm having a bad day! It's a classic comedy and should be in everyones movie collection.",
            "review_date": "2012-10-16",
            "source": "rt"
        },
        {
            "content": "Cheers to my flixster buddy Emma for talking about this or I might have waited another few years before watching it again.. It's just sooo damn funny it hurts :D\r\n\r\nClassic stuff, nuff said really!",
            "review_date": "2012-10-14",
            "source": "rt"
        },
        {
            "content": "I am not necessarily saying this is the funniest movie of all time. However, if someone else where to claim that, I would have an extremely hard time arguing against that idea. Perhaps we can compromise and just say it is the best movie Mel Brooks has ever made.",
            "review_date": "2012-10-14",
            "source": "rt"
        },
        {
            "content": "One of the greatest comedies of all time.  I will never tire of watching it (and quoting it)",
            "review_date": "2012-10-10",
            "source": "rt"
        },
        {
            "content": "To me Blazing Saddles is one of the greatest American movies of all times.  It's over the top, vulgar, and absolutely hilarious and also timeless because a considerable amount of the bigotry this film parodies is still alive and well in the U.S today.  It is truly worthy of the accolade iconic and, even more telling, both the gags and jokes are still as funny today as they were when the film was made.",
            "review_date": "2012-10-06",
            "source": "rt"
        },
        {
            "content": "His best, and most famous movie. See it if you haven't already",
            "review_date": "2012-10-03",
            "source": "rt"
        },
        {
            "content": "My most all time favorite movie ever",
            "review_date": "2012-10-02",
            "source": "rt"
        },
        {
            "content": "No greater humor than Mel Brooks humor. (Well, maybe Christopher Guest is a close second)",
            "review_date": "2012-09-29",
            "source": "rt"
        },
        {
            "content": "best homework assignment I got so far :)",
            "review_date": "2012-09-26",
            "source": "rt"
        },
        {
            "content": "It works on so many levels. It's a silly western spoof  as well as a thought provoking social commentary. Comedy is both low and high-brow, while the issues are serious and still affect us today. One can get as much out of this film as one wants, whether that's a raunchy comedy classic or a piece of high art. And that is what makes this film so brilliant!",
            "review_date": "2012-09-26",
            "source": "rt"
        },
        {
            "content": "continuous laughter!!!",
            "review_date": "2012-09-24",
            "source": "rt"
        },
        {
            "content": "Could not be made today... Too bad",
            "review_date": "2012-09-23",
            "source": "rt"
        },
        {
            "content": "This, along with Young Frankenstein, are my two favorite Mel Brooks' movies!  Hysterical!",
            "review_date": "2012-09-21",
            "source": "rt"
        },
        {
            "content": "Truly revolutionary for it's brilliant use of political incorrectness, almost unendingly hilarious, and stylistically iconic, \"Blazing Saddles\" is a landmark film in the comedic genre and another smash hit from Mel Brooks and Co.",
            "review_date": "2012-09-21",
            "source": "rt"
        },
        {
            "content": "One of the best parody movies ever made that is pure random, unexpected fun that is pure heart.",
            "review_date": "2012-09-19",
            "source": "rt"
        },
        {
            "content": "Some of the humour is definitely outdated, but it's still 93 minutes of general fun.",
            "review_date": "2012-09-18",
            "source": "rt"
        },
        {
            "content": "Although claimed to be Mel Brooks' crowning acheivement, Blazing Saddles isn't as funny and original as Young Frankenstein was. The humor is very funny but also racist to a point where it becomes a little annoying. Ending scene is the funniest by far.",
            "review_date": "2012-09-17",
            "source": "rt"
        },
        {
            "content": "Funniest Mel Brooks' film and one of the funniest movies of all time",
            "review_date": "2012-09-16",
            "source": "rt"
        },
        {
            "content": "Best fart gag in any movie ever!",
            "review_date": "2012-09-13",
            "source": "rt"
        },
        {
            "content": "mel brooks  is the man",
            "review_date": "2012-09-12",
            "source": "rt"
        },
        {
            "content": "The jokes are hit-and-miss, but the set-up is quite funny, and at times, very perplexing. The end in particular, when the whole production goes from comedy to reality in the snap of of a finger.",
            "review_date": "2012-09-12",
            "source": "rt"
        },
        {
            "content": "an absolute classic in comedy films",
            "review_date": "2012-09-10",
            "source": "rt"
        },
        {
            "content": "classic\nbest movie that will never be able to be remade.",
            "review_date": "2012-09-09",
            "source": "rt"
        },
        {
            "content": "La parte iniziale e' piena di gag infantili e che non fanno piu' ridere. Mi e' piaciuta la parte finale dove la realta' si unisce alla finzione cinematografica, l'ho trovata particolarmente geniale.",
            "review_date": "2012-09-05",
            "source": "rt"
        },
        {
            "content": "the funniest movie ever made\n\n\"Give the governor hurumph!\"",
            "review_date": "2012-09-05",
            "source": "rt"
        },
        {
            "content": "A great example of Mel Brooks in his prime, this goofy gem is both racist and vulgar, but that's what makes it so great.",
            "review_date": "2012-09-04",
            "source": "rt"
        },
        {
            "content": "The best Mel Brooks comedy. A must.",
            "review_date": "2012-09-03",
            "source": "rt"
        },
        {
            "content": "mel brooks is an amzing actor isn't it funny how in most of his movies they mention another of his moving like robin hood men in tights which he directed of course they make reference to blazing saddles!",
            "review_date": "2012-09-03",
            "source": "rt"
        },
        {
            "content": "A Mel Brooks classic! So freaking funny",
            "review_date": "2012-09-02",
            "source": "rt"
        },
        {
            "content": "A true classic comedy. With so many iconic performances and performances, mainily from the Gene Wilder as 'The Wacko Kid'. This is my most favoured Mel Brooks movie and more than worth a try for those who want to see classics/ highly recognised comedy movies.",
            "review_date": "2012-08-29",
            "source": "rt"
        },
        {
            "content": "The best spoof that has ever been filmed - its crude humour and controversial subject matter make it so, aside from the fact that it is unendingly hilarious.",
            "review_date": "2012-08-29",
            "source": "rt"
        },
        {
            "content": "One of the all time great comedy films. A classic by one of the masters Mel Brooks. I have watched this movie so many times that I might not be able to count it on my fingers and toes, lets just say a lot. It still holds up very very well. Amazing performances by Gene Wilder and Cleavon Little, who play two men from very different backgrounds who become best friends and partners and come to the rescue of the town of Rock Ridge. Culminating in them and the towns folk building a fake cardboard version of Rock Ridge to fool the bad guys, classic stuff. Mel Brooks has said that he don't think he could get the movie made in today's PC culture that seems to be running rampant and permeating everything these days. Which if true is a real shame, because we may be missing out all time classics like Blazing Saddles.",
            "review_date": "2012-08-27",
            "source": "rt"
        },
        {
            "content": "Classic Mel Brooks...very funny.",
            "review_date": "2012-08-26",
            "source": "rt"
        },
        {
            "content": "A comedy classic that is both witty and ridiculous.",
            "review_date": "2012-08-25",
            "source": "rt"
        },
        {
            "content": "Piss your pants funny",
            "review_date": "2012-08-22",
            "source": "rt"
        },
        {
            "content": "The sherif is a ni,,,, bong",
            "review_date": "2012-08-21",
            "source": "rt"
        },
        {
            "content": "Raised Comic Standards!",
            "review_date": "2012-08-16",
            "source": "rt"
        },
        {
            "content": "Classic Mel Brooks comedy.",
            "review_date": "2012-08-12",
            "source": "rt"
        },
        {
            "content": "One of the funniest movies I have ever seen!",
            "review_date": "2012-08-10",
            "source": "rt"
        },
        {
            "content": "A racial and social satire wrapped up in a spoof of the western genre. Mel Brooks' genius knows no bounds and never draws a line in the sand. The comedic timing of Gene Wilder as the Waco Kid is never short of brilliant. A comedic classic for years to come.",
            "review_date": "2012-08-06",
            "source": "rt"
        },
        {
            "content": "one of the funniest films ever made.",
            "review_date": "2012-08-05",
            "source": "rt"
        },
        {
            "content": "The original fart joke scene came from this movie.  Say thank you.  Without it we would never have had stuff like Shrek.",
            "review_date": "2012-08-05",
            "source": "rt"
        },
        {
            "content": "Perfection at its most imperfect.",
            "review_date": "2012-08-03",
            "source": "rt"
        },
        {
            "content": "Some amazing jokes and some lame ones, but overall a classic.",
            "review_date": "2012-07-29",
            "source": "rt"
        },
        {
            "content": "Fantastic., in spite of being dated and with a silly ending. Madeleine Kahn, we miss you.",
            "review_date": "2012-07-29",
            "source": "rt"
        },
        {
            "content": "Mel Brooks' classic comedy is nothing short of hilariously terrific.",
            "review_date": "2012-07-22",
            "source": "rt"
        },
        {
            "content": "Probably my favorite comedy of all time!",
            "review_date": "2012-07-22",
            "source": "rt"
        },
        {
            "content": "Classic Comedy....enough said!",
            "review_date": "2012-07-20",
            "source": "rt"
        },
        {
            "content": "A hilarious movie, the jokes just kept coming. Mel Brooks does what most comedy directors can never achieve, a movie that has the amount of substance needed to have a good movie and still squeezes in a bunch of jokes and gags to keep me laughing. The only issue I had with this one is that the whole bit with the studio at the end seemed out of place and not very funny to me; I would have been fine with just a regular ending or even an ending that was a parody.",
            "review_date": "2012-07-19",
            "source": "rt"
        },
        {
            "content": "What a great film. It could never be made now due to it's irreverence to race, homosexuality and bigotry. If you can suppress you offence reflex you are in for a rare comic treat.  Mel Brooks is at his best making this one of my favorite films. The film is about a greedy railroad man who wants to destroy a town to put tracks through. He decides to put a black sheriff in charge of the bigoted town to drive them out. Then the fun begins.",
            "review_date": "2012-07-16",
            "source": "rt"
        },
        {
            "content": "The film starts strong and continues stronger. You couldn't ask for a better western satire. However, the ending just falls apart. That's not enough to ruin the movie. It's still a classic overall. It just leaves one confused and wishing it just continued naturally.",
            "review_date": "2012-07-10",
            "source": "rt"
        },
        {
            "content": "Bart is black. He works on a railroad with his friends slaved by white people. When the sherrif of a town dead, the people are stunned the he is the new black sherrif not to mention the first. He befriends the waco kid who used to be the fastest hands in the world. Later in the film, the town is up for demolition for a new railroad that Bart was originally working on, so what happens? WATCH BLAZING SADDLES! I found myself laughing, not laughing and sometimes absolutely being bored by the short plot in a hour and a half movie. But with the jokes we got they are really funny. The funniest being when a muscular man punches a horse down to the ground with was fantastic. The ending had me a bit confused. I know its suppose to be a joke but we are watching a movie, that is being filmed as shown by warner bros studios, while somehow being in the movie while watching a completely different movie. What sense does that make? I have no clue. Still, Blazing Saddles is quite funny.\n\n85/100 B",
            "review_date": "2012-07-07",
            "source": "rt"
        },
        {
            "content": "Only Mel Brooks could pack a film with rape jokes and racial epithets and make it a comedy classic. Blazing Saddles leaves poor taste in the dust and heads somewhere below the ground. Hell, here we come. I'll pack the sandwiches.",
            "review_date": "2012-07-06",
            "source": "rt"
        },
        {
            "content": "One of the best comedies ever, an all out classic.",
            "review_date": "2012-07-05",
            "source": "rt"
        },
        {
            "content": "Ground breaking comedy and film for the 1970's it loses some luster today but the all-star cast keeps you laughing at the absurdities of racism.",
            "review_date": "2012-07-05",
            "source": "rt"
        },
        {
            "content": "\"What's a dazzling urbanite like you doing in a rustic setting like this?\"",
            "review_date": "2012-07-03",
            "source": "rt"
        },
        {
            "content": "Sorry Mel Brooks;  It just wasn't funny.",
            "review_date": "2012-07-02",
            "source": "rt"
        },
        {
            "content": "Bah-jes? We don't need no stinkin' bah-jes! Hahaha!",
            "review_date": "2012-07-02",
            "source": "rt"
        },
        {
            "content": "Mel Brook's is quite the comedian. Kudos!",
            "review_date": "2012-07-01",
            "source": "rt"
        },
        {
            "content": "'What did you expect? \"Welcome, sonny\"? \"Marry my daughter\"?  You've got to remember that these are just simple farmers. These are people of the land. The common clay of the new West. You know...morons.'",
            "review_date": "2012-06-27",
            "source": "rt"
        },
        {
            "content": "Absolutely Hillarious",
            "review_date": "2012-06-26",
            "source": "rt"
        },
        {
            "content": "if you must pry...I must, I must..",
            "review_date": "2012-06-23",
            "source": "rt"
        },
        {
            "content": "This movie could never be done today.  CLASSIC!.  The campfire scene is still one of my favorites.",
            "review_date": "2012-06-22",
            "source": "rt"
        },
        {
            "content": "Another Mel Brooks classic.  This time, he takes on the western genre and once again succeeds with hilarious results.",
            "review_date": "2012-06-20",
            "source": "rt"
        },
        {
            "content": "A few hilarious scenes aside, \"Blazing Saddles\" mostly moves in simply amusing territory. The cast is good, the characters memorable and the premise engaging, but what this film should probably be best remembered for is the direct way it deals with racism.",
            "review_date": "2012-06-19",
            "source": "rt"
        },
        {
            "content": "Great movie! Classic Mel Brooks. And a black man is the star.",
            "review_date": "2012-06-17",
            "source": "rt"
        },
        {
            "content": "No matter how many times i see it, it's still one of the top 10 funniest movies ever made. I still find new and hilarious scenes every time i watch.",
            "review_date": "2012-06-15",
            "source": "rt"
        },
        {
            "content": "This is a prime example of a \"parody\" film gone right, it is (at the time) highly original and very funny. Whether a fan of westerns or not, it is a guarranteed laugh.\nTough highly racist and fairly offensive, that in itself is a parody, and should treated as a joke. The final scene is reminscient of the last scene in the marx brothers' duck soup, and is filled with madcap randomness. The great quality of acting here is something that I feel is often overlooked, there is just great chemistry between the comedy duo that is Cleavon Little and Gene Wilder, it works so well and is really funny! Just check out the Chess scene its fantastic to watch and I do love this film.\nIs it true though, you can't take another classic western seriously. Especially if its a Randolph Scott film, you'll see why in the film. It just cracks me up!\nAll in all, it is a must see and a great film.",
            "review_date": "2012-06-14",
            "source": "rt"
        },
        {
            "content": "wow... this has several messages that I'm not ok with",
            "review_date": "2012-06-09",
            "source": "rt"
        },
        {
            "content": "where all da white wimmin at?",
            "review_date": "2012-06-06",
            "source": "rt"
        },
        {
            "content": "Mel Brooks throws everything at the audience, from obscenely hilarious racial jokes to low-blow farting jokes, to randomly appearing cows and a Mongol...There are about 101,000 jokes, and it is forgivable that only about 72,000 are funny...",
            "review_date": "2012-06-03",
            "source": "rt"
        },
        {
            "content": "A hysterically controversial western.",
            "review_date": "2012-06-03",
            "source": "rt"
        },
        {
            "content": "Look everybody, the new sheriffs a ni..GONG!!",
            "review_date": "2012-05-29",
            "source": "rt"
        },
        {
            "content": "there is no end to the laughs!",
            "review_date": "2012-05-27",
            "source": "rt"
        },
        {
            "content": "Blazing Saddles was fuckin hilarious!!!!  I normally don't watch westerns, i do love Blazing Saddles.  Mel Brook's created a  comedy masterpiece that everyone should have a chance to watch it.",
            "review_date": "2012-05-20",
            "source": "rt"
        },
        {
            "content": "I own it. Hilarious movie.",
            "review_date": "2012-05-20",
            "source": "rt"
        },
        {
            "content": "Frantic, fairly racist comedy for which black cowboys and white cowboys co-exist in the dessert while building a railway. One black cowboy (Cleavon Little) becomes a victim of discrimination by a small town and then becomes sheriff, establishing an alliance with an alcoholic gunslinger (Gene Wilder). Meanwhile, a wealthy Texan (Harvey Corman) wants to continue on with the project, I think, to get rich, while his associates engage in sultry affairs. Pretty crude, strange, a lot of utterances of \"n\" word, but also funny and even in its awkward pacing, it progresses well. Falls into the same category as \"Airplane,\" which is not a clever comedy, but an insane one to spark enough intrigue and attention by me.",
            "review_date": "2012-05-17",
            "source": "rt"
        },
        {
            "content": "Nowhere nearly as good as other Mel Brooks films. Madeleine Khan's Dietrich impression was dead-on however and very funny.",
            "review_date": "2012-05-17",
            "source": "rt"
        },
        {
            "content": "The Best of Brooks at his Best",
            "review_date": "2012-05-13",
            "source": "rt"
        },
        {
            "content": "When it was made, this film was daring, subversive and bold, and I suppose in some ways that's still true. You literally cannot make a film like this anymore, and that's quite sad because this film is not only a great comedy film, but also perhaps one of the finest spoof films ever made. It viciously parodied much of the conventions of the western film, while also highlighting the racism of the Old West that cowboy films typically glossed over. The story is nicely paced and very well told, and it has the gift of being both loud and subtle in terms of its humour. The film also boasts good performances from its leads, but the film's lead villain always manages to gleefully steal the spotlight with his brilliantly silly performance. The film also recreates the western film style so well that it makes the parody all the more effective at making the western film cheesier than it already was. Armed to the teeth with genuinely funny jokes, this is a film that deserves its place in the canon of classic comedies.",
            "review_date": "2012-05-12",
            "source": "rt"
        },
        {
            "content": "This movie was both stupid and offensive. It's not worth the time or money to watch it.",
            "review_date": "2012-05-12",
            "source": "rt"
        },
        {
            "content": "Top contender for my favorite comedy.",
            "review_date": "2012-05-11",
            "source": "rt"
        },
        {
            "content": "Not funny.  I hated this movie..",
            "review_date": "2012-05-09",
            "source": "rt"
        },
        {
            "content": "I said it once and I'll say it again I LOVE MEL BROOKS movies!",
            "review_date": "2012-05-09",
            "source": "rt"
        },
        {
            "content": "classic... A must see no matter what generation you were born in",
            "review_date": "2012-05-08",
            "source": "rt"
        },
        {
            "content": "clearly the best western comedy ever",
            "review_date": "2012-05-08",
            "source": "rt"
        },
        {
            "content": "Probably one of my favorite Mel Brooks movies. He made that movie at the best time. He could not have made that move now a days. It probably would have been banned.",
            "review_date": "2012-05-07",
            "source": "rt"
        },
        {
            "content": "Awesome movie. They don't make them like this anymore.",
            "review_date": "2012-05-03",
            "source": "rt"
        },
        {
            "content": "A funny Mel Brooks \"Old West\" spoof (:",
            "review_date": "2012-05-01",
            "source": "rt"
        },
        {
            "content": "Let's see anyone try to make another movie like this now.",
            "review_date": "2012-04-30",
            "source": "rt"
        },
        {
            "content": "\"My name's Jim but most people call me.... Jim.\"",
            "review_date": "2012-04-28",
            "source": "rt"
        },
        {
            "content": "good classic mel brooks heck yes",
            "review_date": "2012-04-27",
            "source": "rt"
        },
        {
            "content": "Mel Brooks one of the earlier Comedians that could get away with using the N word because it was just so damn funny.",
            "review_date": "2012-04-24",
            "source": "rt"
        },
        {
            "content": "Happy trails Y'all!  this story is bound to make you laugh!",
            "review_date": "2012-04-24",
            "source": "rt"
        },
        {
            "content": "One of the best comedies of Mel Brooks.  Not as good as Young Frankenstein or The Producers, but certainly a great film by virtue of its madcap humor combined with its humorous treatment of racism. in a way, the combination of two such diverse elements can in and of itself show the absolutely ridiculous nature of racism in and of itself.",
            "review_date": "2012-04-22",
            "source": "rt"
        },
        {
            "content": "i love this movie, i can watch this movie over and over again and it always makes me laugh a LOT!!! Slim Pickens is my favorite in this",
            "review_date": "2012-04-22",
            "source": "rt"
        },
        {
            "content": "i love this movie, i can watch this movie over and over again and it always makes me laugh a LOT!!! Slim Pickens is my favorite in this",
            "review_date": "2012-04-22",
            "source": "rt"
        },
        {
            "content": "hilarious. wonderful western satire, and it even has a good message at the end",
            "review_date": "2012-04-21",
            "source": "rt"
        },
        {
            "content": "A classic in every respect and probably the funniest movie ever concieved. I would have liked to see more Gene Wilder in it as well but at least he was in it period, all the other actors are superb and a perfect fit.",
            "review_date": "2012-04-21",
            "source": "rt"
        },
        {
            "content": "If you haven't seen it do so. One of Brook's funniest.",
            "review_date": "2012-04-20",
            "source": "rt"
        },
        {
            "content": "Truly great film, was controversial then perhaps the same now.but funny as hell with it.\nCharacters like the waco kid and brooks himself were fantastic.",
            "review_date": "2012-04-18",
            "source": "rt"
        },
        {
            "content": "Classic! We dont need no stinkin badges.",
            "review_date": "2012-04-18",
            "source": "rt"
        },
        {
            "content": "This is a great movie!",
            "review_date": "2012-04-17",
            "source": "rt"
        },
        {
            "content": "great movie from the mind of mel brooks! up there with history of the world and the producers for his best.but young frankestein was the best mel brooks movie ever!",
            "review_date": "2012-04-17",
            "source": "rt"
        },
        {
            "content": "great comedy! all time classic...must see",
            "review_date": "2012-04-17",
            "source": "rt"
        },
        {
            "content": "Another one that is ahead of it's time. Mel Brooks is a genius",
            "review_date": "2012-04-17",
            "source": "rt"
        },
        {
            "content": "This was a funny movie! I really don't have much to say other than that. Its just funny! If you are easily offended by racial slurs however, do not watch it.",
            "review_date": "2012-04-15",
            "source": "rt"
        },
        {
            "content": "One of the greatest spoofs and comedies ever made!",
            "review_date": "2012-04-12",
            "source": "rt"
        },
        {
            "content": "\"Bart: \t\nAre we awake?\nJim: The Waco Kid: \t\nWe're not sure. Are we black?\nBart: \t\nYes we are.\nJim: The Waco Kid: \t\nThen we're awake, but we're very puzzled.\"",
            "review_date": "2012-04-11",
            "source": "rt"
        },
        {
            "content": "Did this movie forget to offend anyone?",
            "review_date": "2012-04-11",
            "source": "rt"
        },
        {
            "content": "It's twue, it's twue!",
            "review_date": "2012-04-11",
            "source": "rt"
        },
        {
            "content": "My mom was the one who reccomended this (and other Mel Brooks films) to me years ago, and she cited the baked beans scene as one of her favorite of any comedy. Considering that she is one of the last people I'd expect to laugh at a fart joke, this says a lot about the ability of Blazing Saddles to make its audience laugh. It is undoubtedly my favorite Mel Brooks movie, and one that I have every intention of one day showing to any genetic offspring of mine.",
            "review_date": "2012-04-10",
            "source": "rt"
        },
        {
            "content": "Mel Brooks at his finest! always a laugh when mel's around",
            "review_date": "2012-04-10",
            "source": "rt"
        },
        {
            "content": "OMG!!!! One of the best comedies EVER!!!! 7/5 Stars!!!",
            "review_date": "2012-04-08",
            "source": "rt"
        },
        {
            "content": "A Mel Brooks Classic...Very Funny",
            "review_date": "2012-04-08",
            "source": "rt"
        },
        {
            "content": "Pretty funny spoof of the old westerns.",
            "review_date": "2012-04-07",
            "source": "rt"
        },
        {
            "content": "One of Mel Brooks' masterpieces.  Should be seen by all.",
            "review_date": "2012-04-06",
            "source": "rt"
        },
        {
            "content": "Mel Brooks' comedy masterpiece Blazing Saddles has never lost any of its comedic value since its theatrical release in 1974. It holds just as much power of laughter as it did nearly 40 years ago. The amazing cast includes Gene Wilder, Harvey Korman, Slim Pickens, Madeline Kahn and a bit of inspired casting with Cleavon Little. Everybody is on top of their game with this one. Stories have been told that both John Wayne and Richard Pryor were asked to be in the film, with Pryor still sharing a writing credit in the final film. I can't imagine what that version of the film would have been like but it's amazing to ponder over. People consider Young Frankenstein the great Mel Brooks classic, but I still consider it second to this. It's more superior, and since it hits racism in the face and makes it funny, more important, too.",
            "review_date": "2012-03-31",
            "source": "rt"
        },
        {
            "content": "\"Excuse me while I whip this out\". First and foremost...this movie is not rated on RT in the top 100 comedies of all time....which is horrible. This movie was written by Mel Brooks and Richard Pryor. Its offensive,silly,racist,homophobic,but in a way that no one could possibly take seriously. This movie will make you laugh...",
            "review_date": "2012-03-30",
            "source": "rt"
        },
        {
            "content": "Without a doubt, one of Mel Brooks best.  If you don't like parodies, don't bother.",
            "review_date": "2012-03-30",
            "source": "rt"
        },
        {
            "content": "It's been said many times before - one of the funniest films ever made.",
            "review_date": "2012-03-27",
            "source": "rt"
        },
        {
            "content": "Easily one of the funniest movies of all time. The mocking of cliches, the over the top characters, the racial undertones, the shock gags and one the best climaxes in history all come together to form a piece of comedic gold.",
            "review_date": "2012-03-27",
            "source": "rt"
        },
        {
            "content": "Pure comedic genius from the spoof king Mel Brooks. SIde-splitting throughout and utterly entertaining.",
            "review_date": "2012-03-26",
            "source": "rt"
        },
        {
            "content": "One of the best comedies of all time.",
            "review_date": "2012-03-21",
            "source": "rt"
        },
        {
            "content": "With complete disregard for any political correctness tasteless,(and offensive) humor, this is one of the greatest comedies ever made. Gene Wilder and Cleavon Little have such great on-screen chemistry. Both the storyline and the comedic performances are both genius and hilarious",
            "review_date": "2012-03-21",
            "source": "rt"
        },
        {
            "content": "Hilarious. Simply Hilarious.",
            "review_date": "2012-03-18",
            "source": "rt"
        },
        {
            "content": "Funny movie but I will always prefer Young Frankenstein.",
            "review_date": "2012-03-18",
            "source": "rt"
        },
        {
            "content": "Wow, this movie could have never been made today. Mel Brooks is a genius.",
            "review_date": "2012-03-17",
            "source": "rt"
        },
        {
            "content": "this scene: http://www.youtube.com/watch?v=JMK6lzmSk2o",
            "review_date": "2012-03-12",
            "source": "rt"
        },
        {
            "content": "It's the movie tht got Mel Brooks famous and anyone can see why. It's hilarious and offensive, it held nothing back. From start to finish you were laughing and following the actually very decent plot.",
            "review_date": "2012-03-11",
            "source": "rt"
        },
        {
            "content": "\"Howdy Mam\" .... LMAO!",
            "review_date": "2012-03-07",
            "source": "rt"
        },
        {
            "content": "Mel Brooks is a founding father of satire and a pioneer for all of comedy. It's just so unfortunate what spoofs and satires have become now, 40 years later.",
            "review_date": "2012-03-06",
            "source": "rt"
        },
        {
            "content": "Oh the boldness of Brooks to crack these jokes in cinemas across America.",
            "review_date": "2012-02-28",
            "source": "rt"
        },
        {
            "content": "Blazing Saddles is a very silly, yet clever comedy/musical that has stood the test of time. Even the soundtrack is original and great. Many of the actors involved have either passed away or are now in the twilight of their lives, and this is a glimpse into many of them at the peaks of their careers. I will admit that this movie is not for everyone, and it is not without some flaws. But the whole really shines through and will forever remain one of my favorite comedies.",
            "review_date": "2012-02-24",
            "source": "rt"
        },
        {
            "content": "A wise cracking lampooning of racism and those that use it, as well as a finely tuned parody of the Western genre and studio filmmaking. Its very well acted and again one of Brooks' most memorable comedies and scripts.",
            "review_date": "2012-02-23",
            "source": "rt"
        },
        {
            "content": "\"Gentlemen, please rest your sphincters.\" Another satirific spoof from Brooks. With more dirty and racist jokes than you can count, this time, the Old West is on the chopping block. From the opening \"Bonanza-esque \" credits, to the almost too ridiculous ending, this movie is hilarious. The sheriff reminded me of Don Cheadle, except this guy was funnier. I only knew a handful of the cast, but it didn't matter, cuz I was laughing 99% of the time. It was especially great for me since I just finished watching season 1 of Hell On Wheels, and here this movie is, making fun of a show that wouldn't air for 30+ years haha. Hmm, guess it's gonna be a Mel Brooks weekend for me: just saw my Netflix queue and I've got History Of The World Part 1 coming nextâ¦cool. Iâ(TM)d say this was on par with Spaceballs and Men In Tights. Although my favorite MB is and probably always will be Young Frankenstein, this one has definitely earned its place amongst the classics.",
            "review_date": "2012-02-23",
            "source": "rt"
        },
        {
            "content": "Laughed internally and externally hours after this movie was done",
            "review_date": "2012-02-23",
            "source": "rt"
        },
        {
            "content": "An outrageous comedy classic that deftly parodies the western with utter and shameless confidence before poking holes and fun at any other movie assumption you can think of.",
            "review_date": "2012-02-15",
            "source": "rt"
        },
        {
            "content": "It's amazing, looking back, just how much variety this succinct satire of the western genre is able to put on display. Crammed full of every type of joke, pun and ruse imaginable, it's the perfect vehicle for an in-his-prime Mel Brooks to show off his devastatingly effective abilities in each style. More impressively, it's able to make those wild leaps from pointed, hilarious dialog to silly sight gags to dense, dark satire without disrupting the flow of the story and becoming an undisciplined series of loosely-related skits (though it does come awfully close once or twice). That it can also be so funny amidst a subject matter so heavy, (Brooks tackles racism and government corruption amidst the obvious parodies of an overpopulated genre) is further testament to his talents. I'm not a huge fan of the bizarre non sequitur ending sequence, but given the non-stop laughs that precede, it's a small price to pay.",
            "review_date": "2012-02-14",
            "source": "rt"
        },
        {
            "content": "One of the funniest films I have ever seen, a classic that I can watch over and over again! The jokes are still fresh over thirty years after the film was first released, and that is saying a lot. Not only that, its main plot of destroying a small town for the railroad so that a new town could be created is not that far from actual American West history of the 19th century. From how African Americans, Asians, and Irish were treated, Blazing Saddles got a lot of it right, which is a huge plus for me. I also feel that Brooks does not get the acclaim he rightly deserves because he makes satiric films instead of poignant dramas or character studies. Blazing Saddles has stood the test of time and it deserves all five stars!",
            "review_date": "2012-02-12",
            "source": "rt"
        },
        {
            "content": "Tried to watch this movie numerous times and I just get frustrated and turn it off.  I don't get it.",
            "review_date": "2012-02-12",
            "source": "rt"
        },
        {
            "content": "Absolutely hysterical on a number of levels. I adored Gene Wilder in this movie.",
            "review_date": "2012-02-12",
            "source": "rt"
        },
        {
            "content": "Overrated.  Seen better Mel Brooks films than this one.",
            "review_date": "2012-02-12",
            "source": "rt"
        },
        {
            "content": "After 15 years of marriage it gets rarer that you learn new things - tonight I learnt she hasn't seen Blazing Saddles!",
            "review_date": "2012-02-11",
            "source": "rt"
        },
        {
            "content": "Mel Brooks at his best.",
            "review_date": "2012-02-09",
            "source": "rt"
        },
        {
            "content": "Mel Brooks takes aim at racism in this spoof of the Western genre. Cleavon Little stars as Bart, a man sent to be the first black sheriff of Rock Ridge. This, however, is just a move by a corrupt politician (Harvey Korman) to doom the town and open it up for railway development. The laughs come furiously and heavily as Bart partners up with a sure-shot deputy (Gene Wilder) in a mad attempt to save the community. Slim Pickens, Madeline Kahn, and Brooks himself play hilarious supporting roles in this masterpiece of silly and occasionally blue-humored  satire.",
            "review_date": "2012-02-04",
            "source": "rt"
        },
        {
            "content": "It never seems to get old, even after repeated veiwings, the same jokes or the other jokes still snap.",
            "review_date": "2012-02-01",
            "source": "rt"
        },
        {
            "content": "one of my all time favorites. a classic",
            "review_date": "2012-01-31",
            "source": "rt"
        },
        {
            "content": "I've never seen a movie where white men call black men niggers pretty much the whole time in a movie. Apart from that, Mel Brooks at his best.",
            "review_date": "2012-01-31",
            "source": "rt"
        },
        {
            "content": "I really can't say much that hasn't already been said about this classic, so I'll just mention a few of my favorite moments.  First, gotta love the interplay between Cleavon Little and Gene Wilder.  The 'chess' scene reminds me so much of a similar scene in \"The Magnificent seven\".  Alex Karras just cracks me up as \"Mongo\".  Harvey Korman is excellent (and, I've got to admit, I really don't care for him too much - probably from constantly seeing him as the 'Bud Abbott' to Tim Conway's 'Lou Costello' on \"The Carol Burnett Show\").  Gad, the brilliant script (which does make liberal use of certain words, but IMO that's more to mock people who actually talk like that).  If you just flat out love comedy, you've got to add this to your dossier.",
            "review_date": "2012-01-31",
            "source": "rt"
        },
        {
            "content": "The official funniest movie ever made.",
            "review_date": "2012-01-31",
            "source": "rt"
        },
        {
            "content": "One of my favorite Mel Brooks movies. On my must see movies of all time list.",
            "review_date": "2012-01-28",
            "source": "rt"
        },
        {
            "content": "The humor is smart, the storyline is fun, and the performances are hilarious. Some of the jokes (especially the metafilm jokes) may feel a bit silly/outdated to modern viewers, but there are loads of laugh-out-loud moments that bring it all together. It's a great time.",
            "review_date": "2012-01-28",
            "source": "rt"
        },
        {
            "content": "Close to the funniest anything ever.",
            "review_date": "2012-01-27",
            "source": "rt"
        },
        {
            "content": "I was a big fan of this movie when I was young but after a recent viewing I did find it a bit flat. Don't get me wrong it is a very funny movie and it would have to be one of Mel Brook's best.\r\nThe standout performance for me was Madeline Kahn whose part is all too short, and Gene Wilder is hilarious as always.\r\nWhen I first saw Blazing Saddles on tv in the early 80's, the farting scene was edited out so it was great to see it for the first time fully restored. Oh how times have changed.\r\nI do think the 'N' word has become more offensive since 1974 which is ironic as it does provide for one of the funniest scenes.\r\nIt's all very witty and wonderfully silly, I just wish we had more Lili von Shtupp.",
            "review_date": "2012-01-24",
            "source": "rt"
        },
        {
            "content": "Mel brooks at his best",
            "review_date": "2012-01-24",
            "source": "rt"
        },
        {
            "content": "Brilliant!  This has to be the funniest movie Mel Brooks has made, well, Young Frankenstein may be just as funny.",
            "review_date": "2012-01-21",
            "source": "rt"
        },
        {
            "content": "Good Mel Brooks action.",
            "review_date": "2012-01-19",
            "source": "rt"
        },
        {
            "content": "Comic genius!  The only movie better for fantastic satirical laughs is The History of the World Part 1 or possibly Monty Python and the Holy Grail.  I love Chris Farley, but Mel Brooks is the king.",
            "review_date": "2012-01-17",
            "source": "rt"
        },
        {
            "content": "If a 37 year old comedy still makes you laugh, it ought to be good.",
            "review_date": "2012-01-15",
            "source": "rt"
        },
        {
            "content": "A true frickin' irreverent classic.  Mel Brooks at his absolute best.",
            "review_date": "2012-01-07",
            "source": "rt"
        },
        {
            "content": "Mel Brooks, Richard Pryor (writers), need I say more?",
            "review_date": "2012-01-04",
            "source": "rt"
        },
        {
            "content": "As I have grow older I have found that I am less and less interested in Mel Brooks' work",
            "review_date": "2012-01-02",
            "source": "rt"
        },
        {
            "content": "Mel Brooks' silly spoof of westerns is about as lowbrow as you can get, yet it succeeds because of its genuinely funny comedy. Cleavon Little and Gene Wilder steal the film, and their performances have become models for other comedy actors. Other Brooks regulars like Madeline Kahn, Harvey Korman, and even Brooks himself are able to hold their own with Little and Wilder, and are great supporting actors.",
            "review_date": "2011-12-30",
            "source": "rt"
        },
        {
            "content": "https://www.youtube.com/watch?v=0FmjcA7B2WY",
            "review_date": "2011-12-29",
            "source": "rt"
        },
        {
            "content": "Mel Brooks crazy western comedy Blazing Saddles is the unconventional story about a black railroad worker named Bart (Cleavon Little) who is elected sheriff of a troubled town which is soon supposted to be treard down and made into a railroad. He's simply there to fails. But the movie language as most of us knows it, it's always the underdogs that wins. Bart also gets help from the drunken outlaw Jim the Waco Kid (Gene Wilder). Blazing Saddles is a funny parody western that is so funny that it some times literary comes out of hands. The race humor in this film is articulacy funny. And also Mel Brooks also does a funny performance as the incompetent governor Lepetomane. Thumbs up.",
            "review_date": "2011-12-28",
            "source": "rt"
        },
        {
            "content": "Another hilarious Mel Brooks film!!  Badges, we don't need no stinkin badges!",
            "review_date": "2011-12-27",
            "source": "rt"
        },
        {
            "content": "Mel Brooks once said that his brand of comedy \"rises below vulgarity\". This is especially true in \"Blazing Saddles\", a comedic take on old Hollywood Western epics whose plot is merely a way of tying one raunchy joke to the next. I mean that seriously - there's not a lot of polish structurally in this film, and at times the editing leaves a lot to be desired. But what does it matter? No one watches Mel Brooks movies for the story anyways. All you need to know is that a black sheriff (Cleavon Little) has been sent to a small town to drive the racist residents out so that a bunch of real estate dealers can run a railroad through that part of the country. And hilarity ensues ... for the most part anyways. The late Harvey Korman does scene-stealing work here as the chief villain, with the lovely Madeline Kahn also administering gut-busting material as a Marlene Dietrich sound-a-like. There are slow stretches, but unlike a lot of Brooks' later work (I'm talking to you, \"Spaceballs\") this movie is also one of his most consistently funny works. However, reader be warned: \"Saddles\" is easily the most offensive entry in the Mel Brooks canon. Those who are adverse to racial, religious and scatological humor might not enjoy this one (in other words, if the likes of \"Borat\" offended you, look elsewhere). Those people, however, are also missing out on one hell of a good laugh.",
            "review_date": "2011-12-26",
            "source": "rt"
        },
        {
            "content": "A true piece of comedic genius. Mel Brooks soars with Blazing Saddles. It's hilarious and acts as a great satire to how ignorant and pointless racism is. This movie is a timeless classic and an essential for comedy lovers.",
            "review_date": "2011-12-24",
            "source": "rt"
        },
        {
            "content": "Great movie, best part when he says \"Where the white women at?\"",
            "review_date": "2011-12-20",
            "source": "rt"
        },
        {
            "content": "A big problem with making fun of a genre of film is they try to mimic every detail. And while you admire it, it just doesn't come off as funny. 'Blazing Saddles' instead tries to be as relentless and ridiculous as it can while sorta making fun of Westerns. Everyone is very funny but Harvey Korman dusts them all off screen. The only person that stands up to his wrath is Mel Brooks. Gene Wilder and Cleavon Little play off each other magnificently. I wasn't a big fan of the kitchen sink type ending and i might be the only person in the world that didn't find Madeline Kahn hilarious. Its a spot on Marlene Dietrich impersonation but her scenes just weren't that funny to me. Also hilarious how Mel Brooks puts a mirror right up to the face of racism. Groundbreaking comedy for the time and its still funny as hell 35+ years later!",
            "review_date": "2011-12-17",
            "source": "rt"
        },
        {
            "content": "Doesn't quite stand up to what people made it out to be, but still had some good laughs throughout.",
            "review_date": "2011-12-17",
            "source": "rt"
        },
        {
            "content": "the funny thing is when Hitler joins the party",
            "review_date": "2011-12-15",
            "source": "rt"
        },
        {
            "content": "There's some outdated humor, but overall still a pretty funny movie today.",
            "review_date": "2011-12-10",
            "source": "rt"
        },
        {
            "content": "Excuse me while I whip this out, I get no kick from cocaine, mongo, it's true it's true....funny",
            "review_date": "2011-12-09",
            "source": "rt"
        },
        {
            "content": "overrated and out of date",
            "review_date": "2011-12-08",
            "source": "rt"
        },
        {
            "content": "Hillarious. Not politically correct but you will laugh your butt off.",
            "review_date": "2011-12-04",
            "source": "rt"
        },
        {
            "content": "As Mel Books movies go, they are funnier in hindsight. 567",
            "review_date": "2011-12-03",
            "source": "rt"
        },
        {
            "content": "Blazing Saddles is an american classic, it may be one of the funniest spoofs ever made, and is also one of Mel Brooks best film.",
            "review_date": "2011-12-02",
            "source": "rt"
        },
        {
            "content": "Mel Brooks has directed some of the greatest comedies ever made and this is the best of the best. It's most definitely one of my favorite comedies. I think it's on the AFI list of greatest comedies of all time too and for a reason. I have to admit the comedy may rub people the wrong way. A lot of it seems and is a little off color and even sometime downright racist, but I don't think it's gratuitous. It's also so darn witty, it's easy to look past the racist under and over-tones. It's kind of a spoof on old 50's and 60's western movies. Harvey Korman is a corrupt politician who wants to build a railroad, using slave labor through a little town of Rockbridge leaving the residents homeless. They obviously resist this, so Korman sends Cleavon Little to the town to replace their sheriff who had been killed by Korman's cronies. Cleavon Little, being black does not go over so well at first, but after a while everyone comes together to defeat Korman and the idiot Mayer played by Mel Brooks. The jokes are some of the funniest I've ever heard and there are so many quotable lines in the movies. It's one you will want to watch over and over unless you are offend by the humor. I hope not though. Times have kind of changed and the humor isn't accepted anymore, but I just take it for what it is.",
            "review_date": "2011-12-02",
            "source": "rt"
        },
        {
            "content": "Another great comedy by Mel Brooks. All the characters will make you laugh and there are a numerous amount of laugh out loud moments. Just a balls out comedic western spoof comedy.",
            "review_date": "2011-11-29",
            "source": "rt"
        },
        {
            "content": "Hilarious from beginning to end.",
            "review_date": "2011-11-27",
            "source": "rt"
        },
        {
            "content": "Ya, it's an old movie, but it was still pretty funny.",
            "review_date": "2011-11-25",
            "source": "rt"
        },
        {
            "content": "I give it an extra star for being seriously ballsy.  This film could never be made today (or re-released for that matter).",
            "review_date": "2011-11-25",
            "source": "rt"
        },
        {
            "content": "Funny take on the western, but maybe age has caught up with it.",
            "review_date": "2011-11-25",
            "source": "rt"
        },
        {
            "content": "'Doc a chinks pay for nappin' on the job'",
            "review_date": "2011-11-21",
            "source": "rt"
        },
        {
            "content": "Although this is not my personal Mel Brooks' favorite film, it's an enjoyable effort with brilliant comedic performances by Madeleine Kahn, Gene Wilder, Little, Brooks, Korman, etc. The movie is really stupid. It's a weird mix of present with past, fiction with reality, movie industry in and out, crazy parodies, racial prejudice and too many other absurd situations that made me laugh.",
            "review_date": "2011-11-19",
            "source": "rt"
        },
        {
            "content": "It's Mel Brooks alright, but this one is just so controversial that some of its jokes might not be respected by everyone",
            "review_date": "2011-11-10",
            "source": "rt"
        },
        {
            "content": "Not as much of a delight for me as 'Young Frankenstein', but this still good for several laughs and a mad wonder of a climax.",
            "review_date": "2011-11-09",
            "source": "rt"
        },
        {
            "content": "funniest movie ever!",
            "review_date": "2011-10-26",
            "source": "rt"
        },
        {
            "content": "We need more comedies like this. Politically incorrect to the extreme with a mix of silly and clever humor. All of which make for one of the funniest comedies ever filmed.",
            "review_date": "2011-10-23",
            "source": "rt"
        },
        {
            "content": "One of the greatest comedies ever made.",
            "review_date": "2011-10-19",
            "source": "rt"
        },
        {
            "content": "Rounds up all the westerns and shows 'em what's what. Watch this at all costs if you're a fan of westerns.",
            "review_date": "2011-10-18",
            "source": "rt"
        },
        {
            "content": "This is a great movie. Although i found it's more vulgar than I remembered. If you don't like a movie with racist language then this isn't your movie. But if you like racy comedies then this is a must see",
            "review_date": "2011-10-15",
            "source": "rt"
        },
        {
            "content": "blazing saddles is a hilarious western spoof that always entertains",
            "review_date": "2011-10-14",
            "source": "rt"
        },
        {
            "content": "So politically incorrect and wonderful. Has to be one of the funniest movies ever.",
            "review_date": "2011-10-13",
            "source": "rt"
        },
        {
            "content": "Due to political correctness, I'm not sure that this movie could be made today. That's a shame, because it's smart and hilarious. That's not always easy to do, especially when the issue of race is a topic.",
            "review_date": "2011-10-12",
            "source": "rt"
        },
        {
            "content": "I really tried to enjoy this movie but I just can't. It's more smile funny or chuckle funny than laugh out loud funny for most of the movie. Cleavon Little is fine, as is Gene Wilder but I just don't think this matches up to Young Frankenstein for pure entertainment and big laughs.",
            "review_date": "2011-10-09",
            "source": "rt"
        },
        {
            "content": "Absolutely wonderful. There is a reason so many people are able to quickly quote this movie: it has dozens of memorable lines.",
            "review_date": "2011-10-07",
            "source": "rt"
        },
        {
            "content": "quite possibly the funniest movie ever",
            "review_date": "2011-10-07",
            "source": "rt"
        },
        {
            "content": "This is a prime example of a \"parody\" film gone right, it is (at the time) highly original and very funny. Whether a fan of westerns or not, it is a guarranteed laugh.\r\nTough highly racist and fairly offensive, that in itself is a parody, and should treated as a joke. The final scene is reminscient of the last scene in the marx brothers' duck soup, and is filled with madcap randomness. \r\nAll in all, it is a must see and a great film.",
            "review_date": "2011-10-07",
            "source": "rt"
        },
        {
            "content": "For some reason American comedies are not funny in the same way this movie is funny.",
            "review_date": "2011-10-06",
            "source": "rt"
        },
        {
            "content": "Racist, crude, but amazingly funny Saddles is a comedic gem",
            "review_date": "2011-10-03",
            "source": "rt"
        },
        {
            "content": "Maybe not my favorite Mel Brooks movie, but that is matter of opinion and there are many great movies to pick from when you choosing your favorite Mel Brooks movie.",
            "review_date": "2011-10-01",
            "source": "rt"
        },
        {
            "content": "I'm a big Mel Brooks fan. I love Spaceballs and Young Frankenstein. Never quite got this one though...",
            "review_date": "2011-09-21",
            "source": "rt"
        },
        {
            "content": "Over time, Blazing Saddles has lost its ability to shock. It's still amusing enough, and it has its moments of true comedic excellence, but it simply cannot stand up to Brooks' better works, such as The Producers.",
            "review_date": "2011-09-21",
            "source": "rt"
        },
        {
            "content": "Vulgar,  but one of the funniest Mel Brooks movies of all times. Positively hysterical.",
            "review_date": "2011-09-18",
            "source": "rt"
        },
        {
            "content": "This early film from Mel Brooks was one of his first turns at doing parody, something he really wouldn't leave for a long while.  \"Blazing Saddles\" is funny, even if it isn't my favorite (not being the hugest fan of westerns, I can't say that a parody is going to have me in stitches) it is still pretty damn good.  The satire of both racial issues and of just general cinema is where this film shines the best.",
            "review_date": "2011-09-12",
            "source": "rt"
        },
        {
            "content": "You guys know I love this movie. Just wanted to see if my ratings are posting.",
            "review_date": "2011-09-11",
            "source": "rt"
        },
        {
            "content": "The funniest movie since Monty Python and the Holy Grail. Hell, it's an hour and a half of nonstop hilarity! Mel Brooks' best film.\nIn chaotic spirit, this is the tale of Black Bart, a slave who becomes the first black sheriff. He gains an unlikely ally and must save the town from an evil plot, which involves scaring away the townspeople.\nWinning direction from Brooks and a fun spin on the usual Western story are the first thing that glues one to this movie. The second is that it assembles a great cast and plays off of their strengths. Thirdly, there's... Yes, humor! You cannot forget the humor! It has variety, with gags being racial, crude, lewd, anachronistic, or just plain funny. Plus, it's so frequent that it's hard (incredibly difficult, actually) not to burst out laughing. Kudos to the opening song and the inspired (and over-the-top in a terrific way) last 15 minutes, which keep this film good-natured.\nA slight detraction is Madeline Kahn being the weak link here, and also the movie bides its time, sometimes feeling like it won't end. Actually very minor flaws for such a hysterical film. \nWith mad-cap energy and great wackiness, the film takes off and never lets up. Now, this is the funniest comedy I've ever seen!",
            "review_date": "2011-09-11",
            "source": "rt"
        },
        {
            "content": "Western satire and racial vulgarity are the crux of what makes Mel Brooks's Western spoof funny. The story, set in 1874 (100 years prior to the film's release), is of Bart (Broadway star Cleavon Little), an African-American slave in the Old West. After being appointed sheriff by political boss Hedley Lamarr (Harvey Korman), he strikes a friendship with fictional Western legend Jim the Waco Kid (Gene Wilder), and realizes immediately that Lamarr is completely overbearing and wants him out of the West.\n\nWhat I personally love about BLAZING SADDLES is the unfathomably odd ways in which it made cinematic history. Who knew: the infamous bean dinner scene held the first \"bloozers\" (Mel Brooks's unique term) ever to appear in film. I find even funnier the scene in which one man tells another man he can't \"park [his] animal there,\" and the second man responds by punching the first man's horse in the face. Make sure to thank Mr. Brooks the next time you see, \"No animals were harmed in the making of this film.\"",
            "review_date": "2011-09-10",
            "source": "rt"
        },
        {
            "content": "I always find it much harder to review comedy films than other genres. Sometimes it maybe a great comedy for many people, but for some it's just not their type of humor. Well I am delighted to say Mel Brooks's humor works just fine for me in this brilliant parody of westerns. It is consistently hilarious throughout and has some great references to specific westerns or general cliches (Such as the Authentic Frontier Gibberish ala Walter Brennan or the \"Head em off at the pass!\"). The film also has some great laughs yet commentary on the subject of prejudice and racism. The cast is fun with the Mel Brooks usual Gene Wilder, Slim Pickens (or \"King Kong\" as us Kubrick fans know), the unforgettable Madeline Kahn,  and the first man to fart in a major motion picture Burton Gilliam. I thought the plot was a little wild and not as funny as soon as The French Mistake begins, but the rest of the film more than makes up for it. I feel for the non film buffs since a lot of the jokes are referencing films or stars that many do not know these days (i.e. the Laurel and Hardy joke, We ain't got no stinkin' badges, Douglas Fairbanks' small feet). Despite the flaws Blazing Saddles remains a groundbreaking (especially during the fart scene) riot.",
            "review_date": "2011-09-09",
            "source": "rt"
        },
        {
            "content": "The funniest movie of all time!! If you don't laugh your head off, go to the lost and found to look for your sense of humor.",
            "review_date": "2011-09-09",
            "source": "rt"
        },
        {
            "content": "I must have killed more men than Cecil B. DeMille.",
            "review_date": "2011-09-06",
            "source": "rt"
        },
        {
            "content": "the dont make comedies the way they use to . . .",
            "review_date": "2011-09-05",
            "source": "rt"
        },
        {
            "content": "Mel Brooks' Blazing Saddles is an essential comedy classic. The film is a must see spoof of the Western genre.  Blazing Saddles is a brilliant film with plenty of laughs. Mel Brooks has assembled one terrific cast and they all deliver great performances. The thing that really stood out for Blazing Saddles, that I thought was very humorous was the deliberate use of many anachronisms. I thought the fact that it did so many times; it made this film so much funnier. The film is crude, but you can't deny its terrific use of comedy. This is one of the best films that Mel Brooks has made. Blazing Saddles is filled with hilarious comedic moments, and the cast involved definitely make this film worth seeing. If you're a fan of Westerns, but a more comedic element to the point it's a spoof, then Blazing Saddles is the film for you. There's a strong cast on screen, and they all deliver something, funny and clever that will appeal to viewers. If you're a fan of Mel Brooks' work, then give this one a viewing, or if you already have seen it, then pop it into your DVD player and revisit this timeless Western spoof. There's so much to love about Blazing Saddles and the comedy displayed on screen, is of course crude and vulgar at times, but its all in good fun. If you're a fan of Brooks' work, then you're most likely going to enjoy this real comedy classic. This is definitely not a comedy to miss out on. Superbly well acted and with sharp, witty comedy will make this a film that you'll remember for a long time.",
            "review_date": "2011-08-27",
            "source": "rt"
        },
        {
            "content": "I find that with many Mel Brooks movies these days, they just havent aged that well. Blazing Saddles was funny at one time with it's many different \"Lets see how many ethnic groups we can offend\" schtick, but in this day and age, do we really need this? Maybe I'm just being a sourpuss. There are still lots of great gags in this, Brooks has a ball playing up the many Western cliches, but some of the other stuff I an better do without.",
            "review_date": "2011-08-23",
            "source": "rt"
        },
        {
            "content": "Yay for intentional awkwardness and racism!",
            "review_date": "2011-08-22",
            "source": "rt"
        },
        {
            "content": "After becoming interested in westerns, I watched this spoof of them and lived it.  OF course, some of the sophmoric Brooks humor lands off-target, but there's more hits than misses.  My favorite scene was the one where the applicants standing in line.  \"Where the white women at..'",
            "review_date": "2011-08-20",
            "source": "rt"
        },
        {
            "content": "This is one of the greatest comedies ever put on fim!  It's certainly the jewel in Mel Brooks' crown.  It's not comedy Ã¡ la Chaplin, but intellectual comedy.  It helps to KNOW things to understand some of the jokes, remember the real Marlene Dietrich from \"Destry Rides Again,\" as well as knowledge of French.  Mel Brooks' character of Governor William J. LePÃ (C)tomane is a play on words.  \"Le PÃ (C)tomane\" translates to \"The Farter,\" as it was originally a nickname hung on a Frenchman, Joseph Pujol (pronouned poo-hole), with an anus that could emit musical gas at will.  So yes, the film is full of potty humor, but is one of the funniest you'll ever see, even of you don't understand some of it.  \"Blazing Saddles\" satirizes virtually every western in the genre!",
            "review_date": "2011-08-20",
            "source": "rt"
        },
        {
            "content": "All shall praise the Brooks. When you can make a comedy that still shocks after 37 years, you made it",
            "review_date": "2011-08-18",
            "source": "rt"
        },
        {
            "content": "One of the funniest movies ever made! Bart (Little) is a black railroad worker who is suddenly thrust into the job of being a sheriff for a town called Rock Ridge, a city which the governor (Brooks) plans on destroying. The town, at first has a racist reaction to their first black sheriff, but when a gang lead by Hedley Lamarr (Korman) plans to take over the town, they warm up to him. And on the plus side, he has a has-been gunslinger (Wilder) on his side, but on the down-side, the gang hires sexy saloon singer Lili von Schtupp (Kahn) to distract him from doing his job. What do you get when you get comedy greats Mel Brooks, Gene Wilder, Slim Pickens, Harvey Korman, Madeline Kahn, and Dom DeLuise working on the same movie? The answer is \"Blazing Saddles\". This is without a doubt the funniest western spoof satire out there, and is a must-watch for any film fan (it was ranked #6 on the AFI's list of funniest films ever made). There's something very \"Airplane\"esque about it, and at the time time there's a bunch of Preston Sturges like one-liners that make this film so darn funny. Every performance is superb (especially Madeline Kahn's \"Lili von Schtupp\", which is seriously one of the funniest performances ever), and this is a heck of a well-written film, so why don't you just see \"Blazing Saddles\" and laugh your head off? I did.",
            "review_date": "2011-08-18",
            "source": "rt"
        },
        {
            "content": "well not my fave of brooks' spoofs - \"spaceballs\" being #1, so far - but still quite funny, albeit also stupid.",
            "review_date": "2011-08-17",
            "source": "rt"
        },
        {
            "content": "Extremly funny, a great all-star cast and ten times better then any modern comedy considered good these days.",
            "review_date": "2011-08-17",
            "source": "rt"
        },
        {
            "content": "Blazing Saddles is an american classic, it may be one of the funniest spoofs ever made, and is also one of Mel Brooks best film.",
            "review_date": "2011-08-17",
            "source": "rt"
        },
        {
            "content": "Where are all the white woman at?",
            "review_date": "2011-08-16",
            "source": "rt"
        },
        {
            "content": "\"The sheriff is a ni-[bell clangs]\"\"You hear that? The sheriff is near!\"",
            "review_date": "2011-08-16",
            "source": "rt"
        },
        {
            "content": "Only Mel can break the 4th wall on a scale as big as the West... and West Hollywood.",
            "review_date": "2011-08-15",
            "source": "rt"
        },
        {
            "content": "LOL it was pretty funny. Blazing Saddles gets a 4.1 from me.",
            "review_date": "2011-08-14",
            "source": "rt"
        },
        {
            "content": "One of the more chaotic Mel Brooks films (which says a lot), \"Blazing Saddles\" is a fantastic spoof on the western genre. It is evident that Mel Brooks really had fun with this film, (especially when he plays 3 characters). Almost every character is a cliche, but the cliche is acted out so humorously well, it seems to reduce the cliche into a satire of itself...if that makes sense. The misunderstood hero (Cleavon Little), the corrupt businessman (Harvey Koreman), the washed up hero (Gene Wilder), the strong moron (Alex Karras), and many more. Special praise must be given to the fabulous Madeline Kahn, as the saucy Lili von Shtupp, and Gene Wilder, as the cool as heck cowboy. Once again, Mr. Brook's sense of humor is uncanny, which is what makes the whole film work perfectly. One must marvel what goes on in his head, as he comes up with these fantastic jokes and gimmicks, and how sometimes, he can get away with offensive ones (my personal favorite involving KKK members). Where the film loses me though, is at the end. I don't believe I can even describe it accurately. Looking past it though, I loved and enjoyed the rest of the film. It really is one of those movies that gets better every time I view it, and while it's not my favorite Mel Brooks film, it's certainly one of my favorite comedies, and I believe that says a lot. I give it 4 \"candy-grams\" out of 5.",
            "review_date": "2011-08-08",
            "source": "rt"
        },
        {
            "content": "A very funny film, with a clever plot and clever parody, though at times a little slow or too drawn out.  For example, the song and dance number of the German lady, though hilarious initially, went way too long. Definitely just a solid comedy by Mel Brooks.",
            "review_date": "2011-08-07",
            "source": "rt"
        },
        {
            "content": "\"Hey fellas, look what I got!\" \"Hey where the white women at?\"",
            "review_date": "2011-08-02",
            "source": "rt"
        },
        {
            "content": "Why did I wait so long to see this movie?! it's ALWAYS going to be perfect.",
            "review_date": "2011-07-31",
            "source": "rt"
        },
        {
            "content": "Good times, but the ending was a little weird.",
            "review_date": "2011-07-29",
            "source": "rt"
        },
        {
            "content": "Best comedy ever made",
            "review_date": "2011-07-28",
            "source": "rt"
        },
        {
            "content": "Mel Brooks' terribly vulgar spoof of Westerns seems just that on the surface: vulgar. But there's an array of truly funny & original content in there. \"Blazing Saddles\" , while still perhaps risquÃ (C) today, was groundbreakingly shocking in its racial humour at the time, and not always appreciated for it. It has its place in cinematic history if only for pioneering a brand of humour that didn't have a place in cinema until it came along. It holds the distinction of being named as the first mainstream film in which there was farting. Whether we are particularly happy about it or not, \"Blazing Saddles\" blazed a trail for many movie-makers & movie-goers, and changed the visage of film in no small way.\n\nFart.",
            "review_date": "2011-07-25",
            "source": "rt"
        },
        {
            "content": "I know people love this movie but i think its the 2nd most racist movie out there that I\"VE SEEN (1st being \"Vampire Girl vs. Frankenstein Girl\")",
            "review_date": "2011-07-25",
            "source": "rt"
        },
        {
            "content": "The classic Mel Brooks gem, a totally politically-incorrect slapstick, just gets funnier with each viewing, and in retrospect, takes a lot more chances with its material than comparable comedies today, particularly toward the subject of race relations - in fact, it may perhaps be the most eloquent film of the 70's on the subject as it raises a satirical mirror to the real-life lunacy of segregation and racial animosity. Co-written by Richard Pryor, the film is an equal-opportunity offender towards blacks, whites, Indians, Christians, Jews - and even horses and cattle as Cleavon Little's Sheriff Black Bart, aided by Gene Wilder's dipsomaniac Waco Kid, take on the inequities and small-mindedness of the town of Rock Ridge, the possession of which Harvey Korman's greedy surveyor Hedley (not Hedy) LaMarr almost literally lusts after, with the aid of Madeline Khan's hysterically droll Marlene Dietrich spoof, Lili Von Shtupp. Brooks madcap pace is positively inspired in its tastelessness.",
            "review_date": "2011-07-24",
            "source": "rt"
        },
        {
            "content": "I hate to fall back on cliches, but \"what can I say that hasn't been said\" pretty much covers it. It's a beloved classic for a reason, folks.",
            "review_date": "2011-07-22",
            "source": "rt"
        },
        {
            "content": "LOL, still funny after all these years.",
            "review_date": "2011-07-19",
            "source": "rt"
        },
        {
            "content": "a nice funny western spoof, well when I say nice I mean, vulgar, crude and shockingly racist. Fun though",
            "review_date": "2011-07-17",
            "source": "rt"
        },
        {
            "content": "One of the funniest movies ever made.",
            "review_date": "2011-07-12",
            "source": "rt"
        },
        {
            "content": "Through out it was quite silly as it should be but not funny enough. But the ending steps it up big time with plenty of laughs and a smart finish. Madeline Kahn song routine was pretty cool too.",
            "review_date": "2011-07-10",
            "source": "rt"
        },
        {
            "content": "A genuine comedy. Period.",
            "review_date": "2011-07-07",
            "source": "rt"
        },
        {
            "content": "\"Blazing Saddles\" is a never ending series of jokes that constantly work. Well-made and well-written, the film might fall into madness for the final act, but at the point, it works in the movie's favor, not against it.",
            "review_date": "2011-07-05",
            "source": "rt"
        },
        {
            "content": "Hilarious movie. I saw this two Years after spaceballs. I totally misunderstood how funny Mel Brooks was.",
            "review_date": "2011-07-04",
            "source": "rt"
        },
        {
            "content": "An absolute parody classic",
            "review_date": "2011-07-02",
            "source": "rt"
        },
        {
            "content": "One of Gene Wilders all time greatest films. And i think mel brooks's best. Funny, witty, fresh, cliche free and an all around entertaining film",
            "review_date": "2011-07-02",
            "source": "rt"
        },
        {
            "content": "A classic! You've gotta love it",
            "review_date": "2011-07-01",
            "source": "rt"
        },
        {
            "content": "A classic! You've gotta love it",
            "review_date": "2011-07-01",
            "source": "rt"
        },
        {
            "content": "Not the best Mel Brooks film, but it'll do.",
            "review_date": "2011-06-30",
            "source": "rt"
        },
        {
            "content": "This movie will never be outdated. Classic.",
            "review_date": "2011-06-29",
            "source": "rt"
        },
        {
            "content": "Before there was Seth MacFarlane, there was Mel Brooks. And this movie is one of his defining works, along with Spaceballs.",
            "review_date": "2011-06-29",
            "source": "rt"
        },
        {
            "content": "I dont know I just couldn't get into this movie... it was funny but I didn't get some of the humor",
            "review_date": "2011-06-29",
            "source": "rt"
        },
        {
            "content": "Straight from the golden age of Mel Brookes",
            "review_date": "2011-06-28",
            "source": "rt"
        },
        {
            "content": "I was ready to hate it, I really was. But you know what, this just barely made it. No, it's just fine, but I'm still not the biggest Mel Brooks fan and this thing has a deal of his usual technical and humor flaws. The film is underdevloped and slow, but still features a decent soundtrack and good production designs. As for the humor, a lot of it is Mel Brooks-tastic. Translation: Tell us a joke grandpa.\" There are some of his traditional cornball jokes to make the more mature themes seem radically out of place. Maybe the mature themes would have worked better if there wasn't cornball humor to go with the raunchy jokes and the race jokes. Speaking of which, let's touch on the racier (so to speak) jokes.\r\n\r\nThere are some raunchy jokes and they're probably least likely to hit. They feel forced, out-of-place and predominantly fall-flat. The funny thing about it is the race jokes are more in-place and organically added. You know, I am actually pretty glad I saw this so that I can get people off of us Alabamians' backs by saying that these racist jokes, more-often-than-not fall-flat, because they're so awkward and leave you saying \"how did they get away with that?\" However, like all of the other jokes, (except for the raunchy ones) they do have their highlights. Really, as much as I've been complaining about the film, most of the jokes in general do hit. I did find myself chuckling quite a bit and sometimes flat-out laughing hard, but ultimately that's not enough to totally redeem the film, though make it moderately likeable.\r\n\r\nUltimately, \"Blazing Saddles\" has a deal of Mel Brooks' traditional flaws, but ultimately comes out as one of his better films, being generally entertaining and predominantly effective with its humor.",
            "review_date": "2011-06-27",
            "source": "rt"
        },
        {
            "content": "Racist humor and fart jokes? No thanks. The few good moments are lost among a tediously paced story that never held my interest.",
            "review_date": "2011-06-27",
            "source": "rt"
        },
        {
            "content": "Probably the most politically incorrect (by today's standards) movie I've ever seen.",
            "review_date": "2011-06-27",
            "source": "rt"
        },
        {
            "content": "It's all good movies tonight!",
            "review_date": "2011-06-25",
            "source": "rt"
        },
        {
            "content": "I recently saw this movie again and was reminded many great jokes are politically incorrect and, frankly, \"wrong\" on many levels.  This movie would have to be censored so much to make it on network TV, it's no surprise you almost never see it.  :)",
            "review_date": "2011-06-24",
            "source": "rt"
        },
        {
            "content": "Politically-incorred, vulgar, crude, infamous, nonsense. And I had a terrific time watching it.",
            "review_date": "2011-06-23",
            "source": "rt"
        },
        {
            "content": "I did not know Clevon Little died in 1992",
            "review_date": "2011-06-23",
            "source": "rt"
        }
    ]
}