{
    "rating": 9.5,
    "release_date": "1998-04-22",
    "num_reviews": 30,
    "genres": [
        "Drama"
    ],
    "summary": "When young Ali (Amir Farrokh Hashemian) accidentally loses the only pair of shoes his little sister Zahra (Bahare Seddiqi) owns, the siblings attempt to hide the bad news from their poverty-stricken father (Mohammad Amir Naji) and ill mother (Fereshte Sarabandi). They devise a scheme to share Ali's own pair of worn sneakers until they can find a new pair of shoes for Zahra. This documentary-like film was shot on location in some of Tehran's poorest areas.",
    "reviews": [
        {
            "content": "It was kinda bad it didn't really have a plot and is pretty much a waste of an hour and thirty minutes its pretty pointless and it just ends like there is no ending it just stops with him dipping his feet in a pool. Like what????",
            "review_date": "2022-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Verified as a family drama, which makes this a nice way to introduce young audiences to foreign, subtitled films or present an international glimpse into another culture and/or country's own daily lives with hardships for educational understanding while demonstrated sibling love for resonating appliance. It essentially checks off through a familiar structure that teases hope and mess with our emotional cores through its own realism in clever imagery, emphasized and spirited mainly by the young dynamical sibling pair with gripping performances through their infectious worrisome. (B+)",
            "review_date": "2022-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everything is pretty straightforward in Children of Heaven.  A young boy loses his sister's shoes.  Considering that his family lives in abject poverty, unable to pay their rent or debts, he understands the financial impact that this will have on all concerned and develops a plan to hide the truth from his parents.  The acting is great, especially from the youngsters, and the movie is lovely to look at and is generally well made. Criticisms?  How much times needs to be devoted to watching children run around?  Seriously, it's ridiculous how many shots there are of young kids clopping about the streets in a hurry to get somewhere.  Just when you think you've had enough of children darting about, the climax of the film involves…wait for it…here it comes…a running race involving hundreds of kids that goes on seemingly forever.   It's a fine movie if you are able to fast-forward through the running.",
            "review_date": "2022-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Beloved bubbles, glorious goldfish and the peerless potency of the youth establishes oneness along the fine Tehranese rugs of the South. Past economical disturbances and twitchy educators, a honeyed quality of benevolence stretches through each and every neighborhood, each & every painful stride, an honest fortune.",
            "review_date": "2020-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everyone here absolute must watch this epic movie!!!!\n\nThere are many lessons that I can learn from this film, starting from the poverty that has been told in this film, then the gratitude that we must exemplify from these 2 poor younger siblings, and we as younger people must respect our parents and even have to be concerned  when the circumstances of our life are complicated.  Thank you for the work of this film, I really appreciate the storyline that this film has provided..",
            "review_date": "2020-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the look of the film is good and the story is entertaining enough, it's mostly underwhelming.",
            "review_date": "2019-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cheesy acting, anoyying, lazy editing, waste of time.LAME",
            "review_date": "2018-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "my tears up when see this movie",
            "review_date": "2018-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First of all, these child actors in Children of Heaven are some of the best I’ve ever seen. I was so in love with them from early on, and their sweet personalities just endeared me to them a little more each minute. I was worried about them, and could not stand watching them struggle. I completely bought into their entire journey and how the simple act of losing a pair of shoes led to so much adventure for both of them. Each time they faced another dilemma I was rooting for them to overcome it, and I was brought close to tears once or twice. I cannot say enough about how much these two young actors sold the story and kept me connected to the film. There were some side stories that I originally thought were odd distractions and I could not comprehend how they mattered to the main plot, but by the end I found there was a purpose. When it hit the climax, I cannot express how much I was cheering aloud at the screen. And when I wasn’t hollering with excitement I was holding my breath with anticipation. This one moment had more thrills for me than any I’ve watched in the entire 2018 Olympic games, and I wasn’t even rooting for the protagonist to win (for those who’ve seen the film, you know what I mean.) The emotion that overwhelmed him at the end swept over me as well, because I was so invested in that scene. My one complaint was the conclusion of the film. I’ve seen too many movies like this lately where we know what the end is going to be so they just decide to stop everything early and force you to just imagine what comes next. Sometimes I want the joy of seeing it play out. After all the stuff that went on, I felt like our characters earned that moment, but the film-maker decided to deprive us of that. One might argue that the reality could never live up to what we might imagine, but I wish they had at least tried. Despite the disappointment I felt when the credits rolled, Children of Heaven was an emotional film with enough charm to fill up a dozen other movies.",
            "review_date": "2018-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "These children remind us that 'Only what is important is important', everything else is just there.",
            "review_date": "2018-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simple, beautiful, and heart-warming Children Of Heaven makes you smile on the Connection Of siblings and dealing with tough times",
            "review_date": "2017-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is so magnetising that it's almost impossible not to put yourself in our young main characters' shoes (pun intended).",
            "review_date": "2017-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ali has a problem.  He has just lost the prized pair of shoes of his sister, Zahra.  He tries to find them but to no avail.  Now he and Zahra have to share shoes at school, a situation which causes all sorts  of problems.  Ali comes up with other plans to get Zahra a pair of shoes.  Meanwhile, Zahra thinks she may have tracked down the new owner of her shoes.\n\nSweet movie from Iran.  The spin-off events from the loss of the shoes and the adventures of the kids are quite entertaining.  Also a great, warmth-filled reminder of life's simple pleasures and how things which may seem unimportant to one person in one culture and/or socio-economic sphere can be vitally important to someone with different circumstances.\n\nNot particularly profound though.  The movie doesn't really come up with much in the way of profundities or even a powerful conclusion (in fact, the conclusion is fairly weak).  It's a simple, linear story with very few frills or great twists, told engagingly and with great warmth.\n\nThe movie was nominated for Best Foreign Film at the 1999 Oscars, losing out in the end to Life is Beautiful.",
            "review_date": "2017-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Captivating, and heart-wrenching.\n\nThis movie will take you to Ali & Zahra's lives, and leave you there for a while. Their dreams & fears, their very few smiles, and their recurring disappointments will flood you and sweep you off your feet.But most definitely will make you wish for their sincerity, forgiveness, and contentment. \n\nAli & Zahra will remind you of the most important things in life; the things that are really worth racing your heart out for, and will remind you that being a winner might mean nothing at all.\n\nBrilliant piece of art!",
            "review_date": "2017-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A heartwarming, expertly directed and refreshingly humble film from Pakistan that boasts an ingenuous story that counts it as one of the most moving kids' films from across the world.",
            "review_date": "2017-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Throughly a tender and sweet movie about family, determination, and love.",
            "review_date": "2017-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Children of Heaven is flawed in structure and pacing, but the film is so effective in its simple storytelling and very good characterization that it becomes such a moving tale that can really affect you emotionally. Watching the two children was so heartwarming and at times heartbreaking, the child actors gave very good performances, the film is mostly very well made and it succeeds as such an emotional family drama with a couple of truly powerful sequences.",
            "review_date": "2016-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It feels almost impossible not to love these two adorable young children who carry on their shoulders this beautiful tale of innocence, poverty and compassion - a film that pulls us with such power into the situation faced by its characters that we can't be left unmoved.",
            "review_date": "2016-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very Cute and Extraordinary performance by the kids in this movie.",
            "review_date": "2016-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rating: 59%\nThe acting and direction is pretty decent in Children of Heaven, but the characters are from likable and the story isn't that impressive.",
            "review_date": "2016-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The simplicity, the expressions and the innocence - Children of Heaven banks upon all three and proves to be a gentle reminder that to portray a deep sense of humane connections, one doesn't need to resort to complicated events. I believe I have never seen a movie with a simpler plot yet so touching and relatable. One can simply watch the movie and proclaim \"yes, this can totally happen with me!\" Iranian movies have always surprised me with their elegance and style of storytelling, I will surely look forward for more!",
            "review_date": "2015-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "exceptional.\ni happened to see the Singaporean version first, years ago. and i found it amazing. but this, being the one the SG version adapted it to, awesome. the acting was stunning.",
            "review_date": "2014-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enchanting film, makes you appreciate what you have & realize what we take for granted",
            "review_date": "2014-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie that shows life in Iran after revolution. Shows the beauty of people there especially kids. The struggles of common man and child in Iran. There were some parts that were unanswered; possibly because they were gaps in script but not enough to take away from its beauty.",
            "review_date": "2014-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The way a director juxtaposes innoncence with poverty is simple and touching.",
            "review_date": "2014-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that spring to my mind whenever I'm thinking about Iran, not without reason, because this is my first Iranian movie and come from one of my favorite director Majid Majidi.\n\nI really love how Majid portray the innocence of children mind and how he chooses not try to explain the meaning behind what and why it's happening. Nice touch at the end of the movie, by not showing children's reaction, giving viewer opportunity to imagine sweetest reaction they will have.",
            "review_date": "2014-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Children of Heaven serves as a heart warming meditation about real goodness in humanity",
            "review_date": "2014-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film, which put Director Majid Majidi on the World Cinema map, is a piece of gem. The story revolves around a pair of shoes, or rather its absence; never did I imagine that a pair of shoes can sustain my interest for 90 minutes. Writer/Director Majidi tackles issues like poverty, necessity, selflessness, purity of childhood, sibling-love, perseverance and determination with such aesthetic and charm, without being melodramatic.\n\nAfter five minutes into the movie, the kid Ali confesses to her sister Zahra that he lost her shoes and he couldn't find them; the innocence and sadness portrayed in this scene draws you into their lives immediately. The two kids are the heart and soul of the movie, and carry the movie forward with their range of genuine and varied emotions; the director draws out such powerful and sublime performances out of them. Even the supporting performances of Ali's father and the-small-girl-in-school are quite commendable.\n\nLosing something you're entrusted to, getting into trouble at home/school, asking your sibling/friend to cover up for you, sharing responsibilities when someone you care is sick, determination to win something with a larger goal in mind - these themes are so universal that a kid or adult from any place could easily relate to. The story might seem too linear and optimistic to some, but it portrays a world of love and selflessness. People, especially kids, with lesser means are often more selfless and helpful than their fellow beings with more riches; they appreciate and understand the value of even the simplest and smallest of things.\n\nThe incidents, the adventures, and the whole running around due to the missing pair of shoes teaches them a lot of things. All the running around eventually pays off when Ali gets selected into the school race team; we never really realize how we acquire certain talents.\n\nOther than the brilliant acting, the artistically shot scenes and the remarkable background score add to the beauty and feel of the movie. The seven-minute kids' race sequence towards the and is quite craftily shot and directed. There are so many scenes which are memorable, and stay etched in your mind for a long time.",
            "review_date": "2014-04-25",
            "source": "rt",
            "lang": "en"
        }
    ]
}