{
  "title": "Alone in the Dark",
  "rating": 1.7,
  "release_date": "2005-01-28",
  "genre": [
    "Action",
    "Fantasy",
    "Horror"
  ],
  "summary": "Based on the best-selling Atari videogame series, this film features Edward Carnby (Slater), a private investigator specializing in unexplainable supernatural phenomena.  (Lions Gate Films)",
  "critic_reviews": [
    "Since the film is based on the Atari video game of the same name, it also has much to appeal to headbangers: fast pace, lots of gadgets, monsters, explosive special effects, plenty of inscrutable plot twists and turns.",
    "Here is the horror-action genre at its silliest and most uninspired.",
    "Fans of the source material probably won't be switching platforms to catch this bizarre Lions Gate pickup, and non-fans definitely won't.",
    "Too lazy to play your own d--- video game? Lucky for you there's horror director-for-hire Uwe Boll, who's making a career out of adapting successful Atari and Sega games into tedious popcorn fare that's the ultimate in cinematic passivity.",
    "A fairly faithful adaptation of what a game is like, but without the pleasure of getting to play or the much-needed option of pressing the \"off\" button.",
    "Director Uwe Boll (House of the Dead) pulls off a nicely staged fistfight in an open-air market at the start, but soon loses his way amid mind-glazing exposition and endless gunfire aimed at bulletproof giant lizards.",
    "That this bit of pustulence is based on a video game of the same name is no surprise. It explains the thin plot, characters and abundant gunplay.",
    "Slater narrates as if reading a restaurant menu. Reid seems to have learned each long sentence in segments, so she wouldn't be overtaxed.",
    "Even Boll seems to lose interest as the story unravels. By that time, the supernatural cliches, plot inconsistencies, dead ends and red herrings have piled up so high you can barely see the screen.",
    "Director Uwe Boll (\"House of the Dead\") has made a cottage industry out of this kind of junk. Maybe it's time for him to close up shop.",
    "No better than whatever you might pick up while wearing a blindfold at Blockbuster, even if you happen to reach into a trash can.",
    "Think of the lamest horror movie you've ever seen. Now think of Tara Reid in the lamest horror movie you've ever seen. See how much worse it could have been?",
    "Alone in the Dark will be the worst movie of 2005. The idea that anything could be worse is the only genuine scare the movie has to offer.",
    "One of those rare instances of a movie being so bad ... it's still really bad.",
    "This is definitely for people who 1) love the video game, 2) think Slater and Dorff are eminently watchable, no matter what bad flick they're in and 3) are wearing industrial-strength ear plugs.",
    "Tedious, derivative exercise, stolen from a dozen or so horror/action films.",
    "An embarrassingly unscary monster mash, is desperate to frighten its laughing audience any way it can.",
    "So inept on every level, you wonder why the distributor didn't release it straight to video, or better, toss it directly into the trash.",
    "Brain-dead adaptation of a popular video game.",
    "Just Tara-ble.",
    "So mind-blowingly horrible that it teeters on the edge of cinematic immortality.",
    "Supremely idiotic.",
    "Just as the book is usually better than the film, one suspects the video game is probably more entertaining and coherent than the movie. In the case of Alone in the Dark, this is a certainty.",
    "Far be it from me to dismiss a man's effort (Uwe Boll) in a sentence, but the film on your teeth after a three-day drunk possesses more cinematic value.",
    "It's just the most inept filmmaking you can catch in theatres right now, or probably all year long."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "People sometimes talk about Boll's film as \"so bad it's good\", but actually they're not that good. I've seen two of his films - Alone in the Dark, and one starring that guy who was in Starship Troopers - and I have to People sometimes talk about Boll's film as \"so bad it's good\", but actually they're not that good. I've seen two of his films - Alone in the Dark, and one starring that guy who was in Starship Troopers - and I have to conclude that Boll has no sense of empathy, no understanding of human relationships, and a childish sense of drama. His movies look like they were made by someone with the mentality of a sociopathic teenage boy - your typical internet troll, in fact! Funny how the trolls hate him... Jealousy?",
      "review_date": "2008-01-20"
    },
    {
      "review_title": null,
      "content": "Completo absurdo, um dos piores filmes que vi em toda minha e com certeza um dos piores já feitos. Um vergonha que filmes como esse sejam produzidos...",
      "review_date": "2014-01-03"
    },
    {
      "review_title": null,
      "content": "Alone in the Dark; it strikes fear in me the fact that every night I live with this complete crap in my DVD collection. I can't believe I bought this waste of film. I swear it's haunted too because I can't sell it for more Alone in the Dark; it strikes fear in me the fact that every night I live with this complete crap in my DVD collection. I can't believe I bought this waste of film. I swear it's haunted too because I can't sell it for more than 50 cents.",
      "review_date": "2005-10-20"
    },
    {
      "review_title": null,
      "content": "I was really looking forward to renting this on Netflix, since I heard it was the horror film equivalent of 'Showgirls' but alas, it was not. It was just bad...not the 'so bad it is good' variety..just really really bad.",
      "review_date": "2006-03-02"
    },
    {
      "review_title": null,
      "content": "This \"Uwe Boll\" is making games look bad to critics that do not know about games. If Uwe Boll gets its hands on a game that could actually make a great movie, it would be like a .50 caliber shot in the face of the gaming world!",
      "review_date": "2005-10-26"
    },
    {
      "review_title": null,
      "content": "I think I could make a better movie with a 240p camera. Terrible in every way. I would never make anyone watch this movie...............................",
      "review_date": "2012-03-19"
    },
    {
      "review_title": null,
      "content": "Uwe Boll will always be remembered as one of the most horrific, stupid and pathetic directors of the decade, seriously, try this as an experiment, rent Alone in the Dark, then rent something like Meet the Spartans, or Mortal Kombat:Uwe Boll will always be remembered as one of the most horrific, stupid and pathetic directors of the decade, seriously, try this as an experiment, rent Alone in the Dark, then rent something like Meet the Spartans, or Mortal Kombat: Annihilation, watch Alone in the Dark first, and the others will be much less painful to watch...",
      "review_date": "2012-04-13"
    },
    {
      "review_title": null,
      "content": "I don't even know why I feel compelled to reviews this, it's already been torn to shreds enough, from the looks of it. In short, it's terrible. The games (1-3 and The New Nightmare) were awesome, this movie has nothing to do with them, andI don't even know why I feel compelled to reviews this, it's already been torn to shreds enough, from the looks of it. In short, it's terrible. The games (1-3 and The New Nightmare) were awesome, this movie has nothing to do with them, and it's cheesy and boring to an unimaginable extreme. Stay far away.",
      "review_date": "2012-05-31"
    },
    {
      "review_title": null,
      "content": "Absolute garbage. NOTHING in this movie is any good! The only reason I give it a 1 is because Christian Slater in it, and I like him. A shame he wasted his time on this filth!\r Overall:\r\nI would say, if you see a copy of this anywhere, itAbsolute garbage. NOTHING in this movie is any good! The only reason I give it a 1 is because Christian Slater in it, and I like him. A shame he wasted his time on this filth!\r Overall:\rI would say, if you see a copy of this anywhere, it is your duty as a film lover to destroy it. This is the anti-movie. It must be purged from the Earth!!!!!!",
      "review_date": "2013-04-03"
    },
    {
      "review_title": null,
      "content": "honestly i question whay this is an action film when the game was a slow paced horror.\roh wait i forgot. Uwe bowl does not give a f@%$ about the movies he makes, because he knows there are gullible gamers out there who will see this piece of sh@$.",
      "review_date": "2014-12-10"
    },
    {
      "review_title": null,
      "content": "Uwe Boll's infamous \"Alone in the Dark\" is a movie that will be known for centuries as 'one of the crappiest movies in cinema history'. From terrible performances and trash story (do you even call that a story?), it's a movie you will NEVERUwe Boll's infamous \"Alone in the Dark\" is a movie that will be known for centuries as 'one of the crappiest movies in cinema history'. From terrible performances and trash story (do you even call that a story?), it's a movie you will NEVER want to see again. Avoid at ALL COSTS!!!!",
      "review_date": "2011-10-09"
    },
    {
      "review_title": null,
      "content": "Wasnt a scary movie, story line was stupid, and the characters were inept.",
      "review_date": "2005-10-20"
    },
    {
      "review_title": null,
      "content": "This movie is really dumb...\r Is not even the good kind of dumb, is just moronic dumb; like one of does movies you see and feel like you are just getting dumber by just watching it... I mean, you have to be really uncreative to ripoff theThis movie is really dumb...\r Is not even the good kind of dumb, is just moronic dumb; like one of does movies you see and feel like you are just getting dumber by just watching it... I mean, you have to be really uncreative to ripoff the design of the synomorphs from the alien franchise, why are all the action scenes shoot in the dark? whats the point of recording an action scene if your audience is not going to be able to watch it? Is like showing your dad a drawing you made in the dark, how is he going to see it?\r To have in title the word \"Alone\" the main character is always in company... It's so dumb I eventually ended up laughing at it. If you are looking to laugh out with your friends while having pizza and beer, then this movie is for you...",
      "review_date": "2014-06-07"
    },
    {
      "review_title": null,
      "content": "Arguably the most notorious Uwe Boll film and the one most directly responsible for his disastrous reputation. As such I expected it to be a lot worse. It's still a bad movie. The acting is terrible, the plot makes no sense, the action is tooArguably the most notorious Uwe Boll film and the one most directly responsible for his disastrous reputation. As such I expected it to be a lot worse. It's still a bad movie. The acting is terrible, the plot makes no sense, the action is too ridiculous for its own good, and for what's supposed to be based on a horror video game franchise there's no atmosphere or terror to be found. It's just that unlike so much of his later work I didn't find it painful to sit through.That's because this came out around the beginning of Boll's career when he was still making movies with the best of intentions. Meaning it's free of things like his genuinely frightening political ideologies, the toxic personality he developed in response to the overwhelmingly hateful criticism he received from his detractors, and the overbearing self-defense blanket of unjustified arrogance that only served to make his following flicks that much harder to watch. Alone in the Dark is just an extremely unsuccessful attempt at a big Hollywood blockbuster from a man who, while likely able to recognize a good film when he sees one, had no idea how to actually make one.4.5/10",
      "review_date": "2020-03-10"
    },
    {
      "review_title": null,
      "content": "Dont get me wrong, this movie is terrible. But it makes me laugh to much for me to give it a bad score. The only bad thing in the movie that I dont like is Tara Reid's painfully bad acting. everything else is HILARIOUS! So this movie gets a 9.",
      "review_date": "2012-06-23"
    },
    {
      "review_title": null,
      "content": "Okay, look if you went and paid to see this in theaters then u probably hated it... I, on the other hand, saw it for free on Showtime and unlike Uwe Boll's other movies this one actually was entertaining. Uwe Boll is a terrible Okay, look if you went and paid to see this in theaters then u probably hated it... I, on the other hand, saw it for free on Showtime and unlike Uwe Boll's other movies this one actually was entertaining. Uwe Boll is a terrible director, and this is his only film that falls into the so friggin bad its entertaining category.",
      "review_date": "2006-09-12"
    },
    {
      "review_title": null,
      "content": "A very nice mix of action, adventure and horror. A good sequel to the 4th game. Very good performance by Christian Slater.",
      "review_date": "2006-12-28"
    },
    {
      "review_title": null,
      "content": "For all the bad comments about this movie most do not seem to realize or know this is from an old Atari game.  Bad plot, bad plot you scream. It",
      "review_date": "2006-09-15"
    },
    {
      "review_title": null,
      "content": "I just saw this movie on Showtime and I didn't think it was that bad. Yes, the sloppy acting is a minus, but the plot was really really good the special FX were not that bad. I actually like this film and think Uwe Boll is about 3 films I just saw this movie on Showtime and I didn't think it was that bad. Yes, the sloppy acting is a minus, but the plot was really really good the special FX were not that bad. I actually like this film and think Uwe Boll is about 3 films away from being mentioned in the same breath as James Cameron, Ron Howard and Steven Spielberg. I really like this movie. Uwe Boll is a genius!",
      "review_date": "2006-09-10"
    },
    {
      "review_title": null,
      "content": "the truth the only reason I saw this movie was because I wanted to see how bad it was and I must admit that uwe boll has a natural talent for making bad movies that not only has a bad direction with boring dialogue and weak performances tothe truth the only reason I saw this movie was because I wanted to see how bad it was and I must admit that uwe boll has a natural talent for making bad movies that not only has a bad direction with boring dialogue and weak performances to critical sets were seen as seriously false",
      "review_date": "2013-10-20"
    },
    {
      "review_title": null,
      "content": "I watched this back in 2008 and 2017 and it does kinda grow on you in a weird way.",
      "review_date": "2020-07-06"
    },
    {
      "review_title": null,
      "content": "That this was made by Uwe Boll is no surprise. That Slater, Tara Reid and Dorff were so desperate for work that they agreed to star in it is amazing. Most ridiculous part of the movie - Tara Reid as a scientist.",
      "review_date": "2006-12-17"
    },
    {
      "review_title": null,
      "content": "Terrible, TERRIBLE movie, dont waste or money nor time. Only reason I did not rate it 0 was coz de soundtrack and one of the first scens, where the main character tells a little girl to BE afraid of the dark.",
      "review_date": "2006-07-20"
    },
    {
      "review_title": null,
      "content": "This is the most ridiculous, repugnant film I have ever seen. Wikipedia states that Uwe Boll considers the end of the film 'Lynchian'. I think this just about perfectly sums up what a deluded, talentless man he is. I watched this This is the most ridiculous, repugnant film I have ever seen. Wikipedia states that Uwe Boll considers the end of the film 'Lynchian'. I think this just about perfectly sums up what a deluded, talentless man he is. I watched this film after hearing it referred to one of the worst films ever made. I can't quite put into words how angry it makes me that anyone would have the aestheic sensibilities to allow this film to be made when it could possibly have been stopped.",
      "review_date": "2007-01-10"
    },
    {
      "review_title": null,
      "content": "This is definitely the worst movie I have ever seen, and quite possibly the worst movie of all time. I wish I could say I was exaggerating, but it's the honest truth. I'm not sure where people are getting the idea that the plot is This is definitely the worst movie I have ever seen, and quite possibly the worst movie of all time. I wish I could say I was exaggerating, but it's the honest truth. I'm not sure where people are getting the idea that the plot is bad because of the video games, because the movie's plot is completely different. It might not have been such a horrible movie if it were actually based on the video game. But it wasn't based on the video game, and it is a horrible movie. I can't really recommend this movie to anyone. It's not even so bad it's good. It's just plain bad.",
      "review_date": "2007-07-07"
    },
    {
      "review_title": null,
      "content": "Absolute crap, one of the worst movies ever released, ever. Special effects, story (story, where?), acting... Everything stinks. Somebody stop Uwe Boll!",
      "review_date": "2005-09-16"
    },
    {
      "review_title": null,
      "content": "Absolutely jaw-droppingly awful. This movie is about as much fun as getting hit with a rock in the dark while you're drunk. If you like this movie, you should not be allowed to vote or drive cars because you are a danger to society, and Absolutely jaw-droppingly awful. This movie is about as much fun as getting hit with a rock in the dark while you're drunk. If you like this movie, you should not be allowed to vote or drive cars because you are a danger to society, and I pray that you die trapped underneath a massive ice floe alongside Uwe Boll (AKA, \"The Master Of Error\").",
      "review_date": "2006-01-20"
    },
    {
      "review_title": null,
      "content": "I only watched this movie because I was bored while working on my own RPG based on my novels. I think Christian Slater is a good actor, in general, but this movie was definitely the worst thing he's ever done. Tara Reid is nice to look I only watched this movie because I was bored while working on my own RPG based on my novels. I think Christian Slater is a good actor, in general, but this movie was definitely the worst thing he's ever done. Tara Reid is nice to look at, but she's about as convincing a scientist as Jessica Simpson would be. Which is to say, hahaha. The choreography in the opening fight scene was a little off, but not too bad, overall. It's sad that it was apparently the high point of the movie. I'm not sure whether or not I'd consider it worse than Bloodrayne, though the contest is certainly a close one.",
      "review_date": "2006-12-28"
    },
    {
      "review_title": null,
      "content": "I give this film a lot of credit. It really can't be easy making a horror movie that is this incoherent, but the filmmakers pulled it off, kudos.",
      "review_date": "2006-09-10"
    },
    {
      "review_title": null,
      "content": "Uwe Boll = 0",
      "review_date": "2006-09-26"
    },
    {
      "review_title": null,
      "content": "Ridiculous and abysmal can't even BEGIN to describe how amazingly BAD this film is.",
      "review_date": "2007-04-19"
    },
    {
      "review_title": null,
      "content": "Please God make Uwe Boll stop. He's trying to buy the rights to Half-Life now. This may well predicate the biblical Apocalypse. Weep for the future, Carnby. Weep for us all.",
      "review_date": "2005-12-13"
    },
    {
      "review_title": null,
      "content": "This movie was not compelling at all. I found myself to be bored during most of the movie. Good job Uwe Boll.",
      "review_date": "2005-09-28"
    },
    {
      "review_title": null,
      "content": "Slater is a likeable actor, as he is in this. But overall the movie's bland and out of proportion. The girl (Tara Reid) is hot, but a BAD actor. And the plot, well there isn't one, the good acting only comes from Slater, he's Slater is a likeable actor, as he is in this. But overall the movie's bland and out of proportion. The girl (Tara Reid) is hot, but a BAD actor. And the plot, well there isn't one, the good acting only comes from Slater, he's one of my favorite actors and there's nothing to dislike about him in this. But everything else is just terrible! Terrible CG graphics and (ofcourse) let's not forger Uwe Boll, JUST GIVE UP! He can't make anything good!! However I liked the part where the army guy shouts \"get more bodies down here now\" I don't know why. Anyway this get 3/10 stars! But what do I know, I liked Doom!",
      "review_date": "2008-12-04"
    },
    {
      "review_title": null,
      "content": "In my opinion: This is the worst video game film ever made. This film was an abysmal atrocity of cinema; so mind-blowing in failure, it's difficult to comprehend the sheer level of its ineptitude. The storyline is a hackneyed, garbled, In my opinion: This is the worst video game film ever made. This film was an abysmal atrocity of cinema; so mind-blowing in failure, it's difficult to comprehend the sheer level of its ineptitude. The storyline is a hackneyed, garbled, and confusing mess. The action scenes are loaded with bad camera angles, lame martial arts fighting scenes, a boring car chase scene, and shootouts that some how made the film worse than it already was. The acting was horrendous in every way. The only actor who should showed some kind of talent was Stephen Dorff, and even he sucked. Christian Slater seemed bored and uncaring about his role. As for Tara Reid, she makes the performances in House of the Dead look Oscar-worthy in comparison. She's nothing more than a ditzy, stupid blonde chick who has glasses so she looks smart, but can't act worth a damn, or show even the slightest bit of intelligence. Avoid this horror film at all costs.",
      "review_date": "2009-06-15"
    },
    {
      "review_title": null,
      "content": "Really awful. One of the worst films i've ever seen. There wasn't wasn't anything good in it to be honest and it was nowhere near a horror film. I've also found a lot of flaws in it like that time when a possessed(?) Really awful. One of the worst films i've ever seen. There wasn't wasn't anything good in it to be honest and it was nowhere near a horror film. I've also found a lot of flaws in it like that time when a possessed(?) person tried to attack this commander person and the main character (i didn't catch the names) shot the person and missed(you could see the bullet streak) yet the person fell down.",
      "review_date": "2008-12-29"
    },
    {
      "review_title": null,
      "content": "how the hell does uwe boll keep making films??? this is one of the few directors who actually make micheal bay seem good. this movie is nothing even close to the Alone in the dark game . which i played many years ago on the 3DO . the wholehow the hell does uwe boll keep making films??? this is one of the few directors who actually make micheal bay seem good. this movie is nothing even close to the Alone in the dark game . which i played many years ago on the 3DO . the whole movie was just a gaint turd .",
      "review_date": "2010-09-15"
    },
    {
      "review_title": null,
      "content": "I don't know what would be better; a world without Uwe Boll or a world with him.  The movies he makes are nothing but fodder for professional critics to stretch their comedy writing chops, and I love to read articles on how much they hate hisI don't know what would be better; a world without Uwe Boll or a world with him.  The movies he makes are nothing but fodder for professional critics to stretch their comedy writing chops, and I love to read articles on how much they hate his movies and make fun of them.  When I first saw Alone in the Dark, I almost couldn't believe what I was watching.  It was like my 8 year old nephew was handed a decent sum of money to make the most \"super cool action alien movie of the year!\"  The whole thing is an object lesson on what not to do in a movie, from the directing, special effects, casting, and sound.  It does it all, and it does it all badly to the point of wondering if you're being punk'd by Ashton Kutcher.  I can safely say that I found nothing to be redeeming in this movie: from Christian Slater's outfit and dialogue, to the fact that Tara Reid is supposed to be a scientist because she puts on glasses to make her \"look smart\".  They might as well have had her attempt an English accent, but then I'm sure the United States would be forced to apologize profusely for that insult to their country and accent.  That being said, I actually love to watch this movie, if only for the chance to laugh.  Maybe I'm sick, but movies like these make me appreciate the real gems even more so.  Much like Pink Flamingos, I'd say to at least see it once...but bring the brain bleach (or the brain and eye bleach if you watch Pink Flamingos).",
      "review_date": "2010-10-29"
    },
    {
      "review_title": null,
      "content": "This movie is like made with Uwe Boll's feet; the story has nothing to do with the movie, the cliches are endless and the action scenes makes no sense whatsoever.Its embarassing to watch this huge pile of shooting guns and the videogame'sThis movie is like made with Uwe Boll's feet; the story has nothing to do with the movie, the cliches are endless and the action scenes makes no sense whatsoever.Its embarassing to watch this huge pile of shooting guns and the videogame's story is far better from the movie one, while the movie just l ooks like an action steven seagal film with aliens similar to tremors putted on without any logic.Watching a playthrough of the game is way more entertaining than this.",
      "review_date": "2011-01-15"
    },
    {
      "review_title": null,
      "content": "This is, without exaggeration, a million times worse than any other movie I've ever seen. That said, it has generated some impressively sarcastic \"positive\" reviews.",
      "review_date": "2011-03-09"
    },
    {
      "review_title": null,
      "content": "this movie is crap. grade a crapage. what i mean by this is that I, unlike the other people that said that this was good, played the original game for the computer, and played the re-make for the xbox 360. (very good console) and found myselfthis movie is crap. grade a crapage. what i mean by this is that I, unlike the other people that said that this was good, played the original game for the computer, and played the re-make for the xbox 360. (very good console) and found myself transported to a dark and sureal story line with horror, suspence, mystery, and even religous lingo thrown in, and the survival aspect was best ever. this movie on the other hand had little to no suspence, the answer to the mystery was obvious, and the acting........ Is undescribably bad. there is no redeeming qualities in it. the story was nothing like the game, the remake was about the devil rising, and all of it was set in central park new york. the old game was set in a mansion. this one was set in a city. no central park, just a city. Is there anything that i can say that describes how stupid and assonine that is? The answer is no, I can not. And that's just the start of the crap, including the fact that it has the biggest loop hole in the world. So big that the grand canyon is a little crack in the pavement compared to it. At the end of the movie, there is a city that all the residents have been aparently eaten by the monsters. And there are no bodies, or blood. Oh my god. How does that work. If godzilla raged through that city, it would be destroyed. And there might be survivors, but there is no one there, and everything is intact. Great clean up job, guys. I am impressed. It would be like having a house of the dead movie with barely having the house of the dead. Wait, that exists. Okay... It would be like having a resident evil movie with no Chris Redfield, or Jill or wesker. Wait, that exists! What is wrong with movies today!",
      "review_date": "2011-09-13"
    },
    {
      "review_title": null,
      "content": "With movies like these, if you can handle then it's either a test of your manhood or just plain stupidity. If you finish it you're either a man or just stupid for having watched it in the first place. Take your pick. It could be both.With movies like these, if you can handle then it's either a test of your manhood or just plain stupidity. If you finish it you're either a man or just stupid for having watched it in the first place. Take your pick. It could be both.Acting/characters: Well, I don't need to tell you how bad it is because you've heard it a million times before. The characters are very laughable and they have no motive for doing what they do at all. They make the stupidest choices without any reason at all. The acting is just as bad as the characters. I normally cut actors a bit of slack because bad acting is usually (not always) 50% a bad screenplay and maybe 25% a bad director who controls all of the emotions and acting choices of the actors. But that still doesn't change the fact that everyone in this movie acts as stupid as their characters are. 0/10Plot: This plot is as nonsensical as you get. You're expected to know a lot of things that you are never told. They attach significance to a lot of things without telling the audience why they are important or what happens if things go wrong. Do the bad guys want to take over the world? Do they want to just kill the good guys and just leave it there? Who is behind it and why? Is the main villain we see just some pawn or a host body or is he the mastermind of all of this? Why do a highly trained army of government secret alien defense soldiers never have to reload and can't hit anything? The plot holes are bigger than George Clooney's head when he won Best Supporting Actor (the same year this came out actually). It was just a mess. Plus the ending just added another giant plot hole to everything. Nice going. I looked on 5 or 6 different websites trying to get a decent plot explanation for this film. I found pretty much nothing. I did find this though. It's as close as we're going to get. 0/10http://thatguywiththeglasses.com/videolinks/thatguywiththeglasses/nostalgia-critic/11343-aloneScreenplay: This was the worst part. The screenplay of this film made the acting and the plot very bad. There were many many cringe-worthy lines. I expected to laugh at a lot of the 'serious' lines, but they didn't even deserve that. They sounded like they were written by a drunk 8 year old. 0/10Likableness: Like I said before, the plot was stupid, the acting was bad, and the screenplay was horrid too. I expected to come in at least laughing at the lines and getting entertainment value that way, but I didn't. Plus the special effects were some of the worst I've seen in a long time. I wouldn't suggest this one (although I don't mind that Irukandji suggested this one to me). It's fun to bash films like this. They certainly deserve it. 0/10Final score: 0/40 (H)TRIVIA TIME: 1. The lengthy opening text crawl was added after numerous test audience members said they were confused by the plot.2. After execs read the green draft of the shooting script, the film got an additional $10 million. Uwe Boll poured the money into special effects.3. Every piece of body armor worn by the various extra foot soldiers during major battle scenes is paintball body protection made by JT USA.4. Nuclear Blast spend $30,000 on the soundtrack rights to promote their bands.",
      "review_date": "2011-09-27"
    },
    {
      "review_title": null,
      "content": "The worst thing about this movie was not the directing that at its best was derivative. It wasn't the bad to mediocre acting. It wasn't the horrible music in the credits. It was the fact that the plot made no sense. I still don't reallyThe worst thing about this movie was not the directing that at its best was derivative. It wasn't the bad to mediocre acting. It wasn't the horrible music in the credits. It was the fact that the plot made no sense. I still don't really understand what the relics and monsters had to do with each other, or how tons of them appeared out of nowhere and killed all of humanity or something. I gave it a one instead of a zero because it was kinda entertaining in a trainwreck sort of way.",
      "review_date": "2016-08-01"
    },
    {
      "review_title": null,
      "content": "Tara Reid... Ugggg One Of The Worst Movie's I Have Ever Seen!\rSadly This Could Be A OK Movie The Plot Was Ok.. Some Of The Worst Acting Ever!",
      "review_date": "2013-03-24"
    },
    {
      "review_title": null,
      "content": "As its based on a video game the movie is going to be awful. Since Uwe Boll is the director its going to be awful. The movie is awful. Loud, Matrix-style action scenes, poor acting, a ridiculous plot and a long introductory scroll for theAs its based on a video game the movie is going to be awful. Since Uwe Boll is the director its going to be awful. The movie is awful. Loud, Matrix-style action scenes, poor acting, a ridiculous plot and a long introductory scroll for the illiterate audience who are the only people ignorant enough to see it (I only watched it for purely scientific purposes).",
      "review_date": "2013-04-08"
    },
    {
      "review_title": null,
      "content": "First off, this movie is based off Alone in the Dark: The New Nightmare (2001, Infogames) NOT Alone in the Dark (2008, Atari), however, the fact that it bares the title \"Alone in the  Dark\" should be enough to make any fan of the series toFirst off, this movie is based off Alone in the Dark: The New Nightmare (2001, Infogames) NOT Alone in the Dark (2008, Atari), however, the fact that it bares the title \"Alone in the  Dark\" should be enough to make any fan of the series to abandon everything. The movie doesn't even try to use the source material, instead going for something that shouldn't even exist. I mean, they went as far as to have a dead person get up again, and even animating bullets missing people WHO SAID BULLET JUST KILLED. What really takes the cake is the non existing storyline, pre-into to acting actors, and a gods awe-full music score. In fact, I'm sure the only reason that Uwe Boll made this movie, was so that he could exploit a loop hole and use it as a tax write off, so that he gets paid a lot of money in compensation. And this isn't the first time he's done this to a video game. Seriously, avoid at all costs, even if those costs are vital organs, loved ones, or having to be wide awake for a root canal, in a truck, in a high speed chase being preformed by Orin Scrivello.",
      "review_date": "2013-07-02"
    },
    {
      "review_title": null,
      "content": "The most atrocious, lame, boring, dry, dull, repetitive, badly acted, terribly directed, overwhelmingly awful horror film that I have ever sat through. A film I forced myself to sit through after wanting to turn my head in disgust at thisThe most atrocious, lame, boring, dry, dull, repetitive, badly acted, terribly directed, overwhelmingly awful horror film that I have ever sat through. A film I forced myself to sit through after wanting to turn my head in disgust at this godawful mess of scenes slapped together to be called a movie.",
      "review_date": "2014-02-14"
    },
    {
      "review_title": null,
      "content": "A videogame adaptation from Uwe Boll. Uwe Boll is a legendary director. He is famous for making some of the worst movies in recent history, using a German tax shelter to fiance his movies (German stupid money was the applied term) andA videogame adaptation from Uwe Boll. Uwe Boll is a legendary director. He is famous for making some of the worst movies in recent history, using a German tax shelter to fiance his movies (German stupid money was the applied term) and challenging his critiques to a boxing match including inviting Quentin Taratino and Roger Avary. It was called “Put up or shut up”. He took 5 challengers and defeated them all by beating them all up. One was even an amateur boxer with some skills / experience (Uwe Boll also is an amateur boxer and has lot of years of training on his resume). This was the stuff of legends and you will find it on YouTube (Uwe Boll boxing). Back to the movie. The movie is loosely based on the really good “Alone in the Dark The new Nightmare” videogame. You get what you expect. His movies have no good stories, acting or coherence. The only decision for you is if it is just really bad or so bad that it is entertaining. For me I enjoyed this movie while I must admit that it is a guilty pleasure. I should have not rated this above a 3 and even that is maybe to good. Overall a silly and enjoyable movie. I must say that I respected Uwe Boll and say you should learn from him because he had success. Machiavelli said something like “Learn from the sucessful people no matter if you like or dislike them because they know the game”.",
      "review_date": "2020-06-25"
    },
    {
      "review_title": null,
      "content": "This movie is so bad that it's good. There are parts of this movie that made me just laugh my ass off. Even though Christian Slater and Stephen Dorff play parts in this movie, they still do not save this garbage.",
      "review_date": "2015-10-01"
    },
    {
      "review_title": null,
      "content": "Movies like Alone in the Dark should've been fun, horrifying, and energetic like the video game, not stupid, pleasing, and dead like they literally killed the video game adaption wish for everyone.",
      "review_date": "2016-04-18"
    },
    {
      "review_title": null,
      "content": "Think about it this way, I have never seen anything like this. Is it good? is it bad? I don´t know",
      "review_date": "2021-11-25"
    },
    {
      "review_title": null,
      "content": "the look is not bad but the problem is the actors the storry and this movie.conection to the game dosen´t exist or did i dont see them. its an uwe boll movie this say everything. but its not the weackest crap this man brought us.(sorry forthe look is not bad but the problem is the actors the storry and this movie.conection to the game dosen´t exist or did i dont see them. its an uwe boll movie this say everything. but its not the weackest crap this man brought us.(sorry for the bad englisch:-)",
      "review_date": "2018-07-25"
    },
    {
      "review_title": null,
      "content": "Painful movie to watch. It lasts for an hour and a half but it seems as long as a complete 10-season series. Sceanrio is disparate, inconsistent, impossible to clearly understand. Lighting is remarkably awful: 80% of the scenes are shot inPainful movie to watch. It lasts for an hour and a half but it seems as long as a complete 10-season series. Sceanrio is disparate, inconsistent, impossible to clearly understand. Lighting is remarkably awful: 80% of the scenes are shot in almost total darkness. All protagonists are unattractive and have this strange emotionless acting. Decors and environments are terrible, and espacially the costumes since Boll used paintball armors to equip policemen. Music and sound effects are horrible and incoherent too. Dialogues are dull and flat. There is absolutely no link between the actual movie title, the eponymous video game and the plot of the movie. Who could have bet on the fact that a movie called 'Alone In the Dark' would show dozens of warriors against thousands of creatures? No one is actually alone, even if we are actually in the dark all along.Only good point I found is that special effects on creatures are not that bad. However I can't say the same for special effects on deaths. A few (and only a few) frames and scenes are actually inspired. It deserves a 2/10 because of this and because this film does not have the real petty intention towards us. We have much to learn from the countless mistakes it makes.",
      "review_date": "2021-01-31"
    },
    {
      "review_title": null,
      "content": "Uwe Boll's worst movie and that's quite the feat. The less said about the casting of Tara Reid the better.",
      "review_date": "2022-03-22"
    }
  ],
  "num_reviews": 79
}