{
    "rating": 9.2,
    "release_date": "1976-01-01",
    "num_reviews": 390,
    "genres": [
        "Drama"
    ],
    "summary": "Two green reporters and rivals working for the Washington Post, Bob Woodward (Robert Redford) and Carl Bernstein (Dustin Hoffman), research the botched 1972 burglary of the Democratic Party Headquarters at the Watergate apartment complex. With the help of a mysterious source, code-named Deep Throat (Hal Holbrook), the two reporters make a connection between the burglars and a White House staffer. Despite dire warnings about their safety, the duo follows the money all the way to the top.",
    "reviews": [
        {
            "content": "Director Alan J. Pakula handles matters in All the President's Men the way any good journalist tackles a story – factually, objectively, succinctly.  The story is centered around Bob Woodward (Robert Redford) and Carl Bernstein (Dustin Hoffman), reporters for the Washington Post who help to unveil the biggest scandal in American politics – Watergate.  While it may be helpful to have some background on the story before watching the movie (there are a ton of players involved that may be hard to keep track of), it remains a gripping story, even fifty years after the scandal originally broke.  Hoffman and Redford are great, the supporting cast is impressive, and William Goldman's screenplay keeps things moving at a nice clip.",
            "review_date": "2023-03-06",
            "source": "rt"
        },
        {
            "content": "I'm not into politics, but this was gripping. I kept watching. The plot, dialogue, and character interactions were all good. The ending is quite haunting, with the cut off of no music. I think it's appropriate considering this is the reality of the situation. There is no flashy finale, just contrast of Nixon being reelected with silence.",
            "review_date": "2023-02-09",
            "source": "rt"
        },
        {
            "content": "Solid acting, solid story. Not a classic, but enjoyable nonetheless.",
            "review_date": "2023-01-05",
            "source": "rt"
        },
        {
            "content": "Journalism movies are my second favorite type of movies and this might be the best one I ever watched, together with of course Spotlight. The screenplay is smart and still mysterious, you really don't know till the end hoe they are going to expose them, the camera work in particular was incredible and the editing, flawless movie",
            "review_date": "2023-01-03",
            "source": "rt"
        },
        {
            "content": "Great movie and really well done. Well acted and a cool perspective for a true story",
            "review_date": "2022-12-11",
            "source": "rt"
        },
        {
            "content": "Stunning, big budget docudrama, the kind we don't see much of any more.  Most of the dialogue is improvised; Pakula gives the actors bullet points to bring out in a scene, and then the actors stumble through the conversations live like that for the audience; which gives the film a real immediacy.  Great acting and production values but the star here is really the story.  An important film which helped galvanize the public in their collective referendum on Nixon's guilt in the Watergate scandal.",
            "review_date": "2022-11-16",
            "source": "rt"
        },
        {
            "content": "This is masterpiece. Solid direction, glueing, and great cinematography. One of few films you can watch multiple times. This film just made the scandal interesting even I born decades after that.",
            "review_date": "2022-10-25",
            "source": "rt"
        },
        {
            "content": "Incredibly Well Done Political Thriller Classic. The cinematography on display here is exquisite. Along with phenomenal acting, amazing editing and a very well paced plot that is hard to turn away from despite knowing the outcome of this historical event. This film is more a salute to investigative journalism rather about Watergate and that is where the one flaw of this film occurs. This movie is VERY heavy if not one of the heaviest on exposition and there are many different names your expected to remember and time of events and its hard to put a mental picture in your head because you can't put a face to all these people and it isn't really something you can just leave up to your imagination like the shark in Jaws for most of the film. This makes it feel VERY dry at certain points and more than likely these names were very well known and common knowledge only 2 years after Watergate but harder for someone who didn't grow up during these events. Despite that it is still extremely well done and keeps you engaged despite the exposition overload and is a great classic New Hollywood Film and a classic Political Thriller. Very Highly Recommended.",
            "review_date": "2022-08-30",
            "source": "rt"
        },
        {
            "content": "I feel like it most definitely could have used more film editing. I suppose they were going for the more raw film to make it feel more real but it didn't work for me. Also, even if you're interested in the Watergate scandal, this movie is exceptionally boring with a really lackluster air-out-of-the-balloon ending.",
            "review_date": "2022-07-22",
            "source": "rt"
        },
        {
            "content": "Robert Redford and Dustin Hoffman portray Carl Bernstein and Bob Woodward in this excellent film adaption of the book \"All the President's Men.\" This movie focuses on the unraveling of the Watergate Scandal by the Washington Post staring Robert Redford and Dustin Hoffman. The pair work off each other seamlessly in this excellently acted, directed, and produced to bring the political thriller to audiences. This movie cemented the idea that political thrillers can be as entertaining and fun as  other dramas during the 1970's. I highly recommend audiences go out and see this movie as younger audiences will be informed and older audiences will be nostalgic of the Watergate Scandal.",
            "review_date": "2022-07-05",
            "source": "rt"
        },
        {
            "content": "Fantastic movie. Perfect acting and plot. The fact that it requires no music or dramatic sound effects to create genuine suspense and interest speaks to its quality. Flawless masterpiece - 5/5",
            "review_date": "2022-06-01",
            "source": "rt"
        },
        {
            "content": "Behind the story, All the President's Men a non-fiction book, Robert Redford is having a great credit...\n\nWriter, William Goldman did a good job for the script...\n\nDirector, Alan J. Pakula supervises with excellency...\n\nThis film has a strong supporting casting and well equipped facilities, e.g. Jason Robards being \"Ben\", George C. Jenkins and George Gaines as Art Direction, Arthur Piantadosi, Les Fresholtz, Dick Alexander and James E. Webb as film sound...\n\nOf course, Dustin Hoffman as Carl Bernstein as well as Robert Redford as Bob Woodward should gain all my credits...",
            "review_date": "2022-05-05",
            "source": "rt"
        },
        {
            "content": "* 100/100 ------------",
            "review_date": "2022-04-11",
            "source": "rt"
        },
        {
            "content": "I saw this movie again for the second or third time tonight. It really holds up well in my view, and they say that a lot of other films have taken inspiration from it over the years, among them Spotlight and The Post. \n\nI really love the scenes in the newsroom. They claim that the filmmakers went to great lengths to recreate the offices of the Washington Post, and it really does look and feel like what a newsroom may have been like in that era. \n\nOn a side note, I'd be interested in knowing a little more about the influence that the novel All the King's Men might have had on this film. It seems likely that it takes its title from that book, which explores a corrupt governorship in Louisiana in the 1940s.",
            "review_date": "2022-03-03",
            "source": "rt"
        },
        {
            "content": "An incredibly well-crafted paranoia thriller about one of the greatest real-life political scandals in America. You may know the ending, but it's the thrill of finding out how we got toward that conclusion in the first place which makes this film so appealing. Our two protagonists don't transform or go on any character arc, but they're played by talented performers and their earnest pursuit of getting to the bottom of things is enough to align us with them. It's not an easy film to follow, and I think that adds to it. You feel like you're alongside Woodward and Bernstein, trying to keep track of all the names and all the remaining leads and how they all connect and make sense. It's a delightful scavenger hunt that brings out some of the most raw tension there is, aided by the realistic dialogue from William Goldman and the lack of a score. It's better on second viewing and I imagine it will be  so on the third.",
            "review_date": "2022-02-28",
            "source": "rt"
        },
        {
            "content": "\"Hold it.\"\nThe Watergate story which made tremble America. A nearly naturalistic movie, very close to reality (as the two journalists were there and Hoffman spent weeks at Bernstein sides). It's a page of history, printed on celluloid, written by two unknown journalists. It's the power of people, democracy.",
            "review_date": "2022-01-26",
            "source": "rt"
        },
        {
            "content": "Based on the true story of two reporters who wouldn't give up on the story of Watergate, this movie is as gripping as any detective novel.  Producer/star Redford was so intent on authenticity that he even flew actual garbage from the Washington Post waste baskets out to the set.  The movie does a good job of showing how much of the work of the reporters was dull persistence and it also does a good job of showing us what went in to the decisions of editor Ben Bradlee and publisher Katharine Graham about what they need in terms of proof in order to publish the story.\n\nThe movie showcases an interesting range of moral choices and calibrations.  The famous Deep Throat still unidentified when the movie was filmed, is someone from the inside who won't allow himself to be identified or quoted but is willing to confirm what the reporters are able to find elsewhere.  Others involved int he scandal, both the corruption itself and the cover up, must decide what to do and how much to disclose.  One key development is the decisions made by someone identified only as, \"the bookkeeper\" to talk to Bernstein.  The participants must also deal with the consequences of their choices.  Donald Segretti manages to evoke sympathy when what began as juvenile pranks leave him in disgrace.  Woodward and Bernstein also make mistakes and must deal with consequences.",
            "review_date": "2021-12-11",
            "source": "rt"
        },
        {
            "content": "Singularly, one of the best movies ever made. The corruption around the Kennedy and King assassinations ultimately ended up here and tricky dicky was sent packing. He should never been anywhere near the presidency.",
            "review_date": "2021-11-25",
            "source": "rt"
        },
        {
            "content": "A distanza di pochissimo tempo da uno degli scandali peggiori che ha investito la storia degli USA, questo capolavoro si pone come pietra miliare per coraggio e per lo straordinario impatto sul pubblico.\nMai prima di allora, un atto del genere, fu riportato sullo schermo in maniera tanto fedele da poter sembrare un vero e proprio documentario se non fosse per i volti noti degli attori; un nuovo genere cinematografico fu creato, e venne mostrato al mondo quanto questo strumento potesse essere utile anche per riportare ciò che realmente accade.\nOvviamente la sceneggiatura è unica e anche i protagonisti sono di un livello altissimo e completano alla grande l'opera. Capolavoro.\nPeccato per il finale agrodolce e con alcuni aspetti solo riassunti nei secondi finali.",
            "review_date": "2021-10-12",
            "source": "rt"
        },
        {
            "content": "Really liked the work of Gordon Willis.",
            "review_date": "2021-06-14",
            "source": "rt"
        },
        {
            "content": "86%. Kind of hard to decide because very well made and a lot of excitement and intrigue but doesn't have quite enough to push it over. Learned a lot about watergate so was very interesting. Definitely glad I watched it. Not something I'd seek out rewatching on my own but worth a rewatch if I wanted to learn about the scandals again or someone else wants to see it",
            "review_date": "2021-05-24",
            "source": "rt"
        },
        {
            "content": "one of my all time favourites - great rendition of a real event",
            "review_date": "2021-05-13",
            "source": "rt"
        },
        {
            "content": "Powerfully acted and masterfully written. All The President’s Men shines a light on a dark era in politics that was relevant at the time and even more so today.",
            "review_date": "2021-04-07",
            "source": "rt"
        },
        {
            "content": "a technical wonder that impresses deeply and leaves lots to chew on.",
            "review_date": "2021-03-21",
            "source": "rt"
        },
        {
            "content": "Robert Redford and Dustin Hoffman play the real life reporters Bob Woodward and Carl Bernstein who began investigating the mysterious break-in at the Watergate building which eventually led to the resignation of President Nixon. \nNot only are the leads excellent in the roles, this film is riveting from start to end.  Excellent supporting cast including Jack Warden and Jason Robards.  \nExcellent film.",
            "review_date": "2021-02-19",
            "source": "rt"
        },
        {
            "content": "Good movie. Hoffman and Redford do two great performances.",
            "review_date": "2021-02-15",
            "source": "rt"
        },
        {
            "content": "I first saw this movie when it was released here in the UK. I struggled to follow it as a 15 year old, but I was mesmerized nonetheless - understanding it was a significant film about an equally significant event. Now into my 60s I really can't say how many times I've viewed it - maybe 100 times or more - and there's always something there I hadn't clocked before. I've already watched it twice this month. Anyway, who cares what I think - just go for it - my only advice - listen to every word, take notes and watch it sober. Hugely rewarding on every level.",
            "review_date": "2021-02-12",
            "source": "rt"
        },
        {
            "content": "There is some great acting here but the bottom line, the story is confusing, and the ending to be is very strange. It seems to end with denials from everyone as if nobody has taken the allegations seriously. We then see captions stating dates of when the individuals involved resigned. Surely there was more to the events that needed to be included in the film?",
            "review_date": "2021-02-08",
            "source": "rt"
        },
        {
            "content": "Another brilliant movie portraying the role of true journalism in countering the fallacies and political manipulation of the government along with great performances . Given the details of facts it almost feels like a documentary turned into a movie .",
            "review_date": "2021-01-30",
            "source": "rt"
        },
        {
            "content": "Makes you want to be a journalist... Robert Redford is magnificent here.",
            "review_date": "2021-01-28",
            "source": "rt"
        },
        {
            "content": "This movie will make you believe in the power of the pen and the profound importance of journalistic integrity. In a world where misinformation spreads like wildfire and even the most reputable publications are called into question, it's a breath of fresh air to revisit a time when the fourth estate meant something.",
            "review_date": "2020-12-29",
            "source": "rt"
        },
        {
            "content": "This might be the most boring thriller I have ever sat through which is meant as an absolute compliment to Pakula who was able to, as Woodward and Bernstein did with the source material, create extreme tension and interest with the dull and unsexy type of crimes that usually won't make it into the films. This is an excellent book and I was surprised how well the film was able to hold up to it.",
            "review_date": "2020-11-07",
            "source": "rt"
        },
        {
            "content": "A good journalism and investigation film, good performances, ambience and a certain dynamic; I believe that to fully enjoy it you need to understand the real story on which the film is based, (for those who are not Americans like me), but I recommend studying after seeing the film because it spoiled my experience, took away my element of surprise and the step by step of the investigation; but I recommend understanding this moment in the history of the United States because it influenced all pop culture, which includes films, series and music.",
            "review_date": "2020-08-23",
            "source": "rt"
        },
        {
            "content": "This movie tells how Bob Woodward and Carl Bernstein worked to see what really happened at Watergate. It is a good movie about journalism and how it can be to try to uncover stories. In my opinion, they could have shortened it a couple of minutes, but still a great movie.",
            "review_date": "2020-08-07",
            "source": "rt"
        },
        {
            "content": "Well acted, powerful, and really intense.",
            "review_date": "2020-07-16",
            "source": "rt"
        },
        {
            "content": "An intriguing story carried well by the lead actors, enriched even more by its real-life mirror. Slow, overly mechanical at times and, yet, the excitement of Hoffman keeps you involved.",
            "review_date": "2020-07-08",
            "source": "rt"
        },
        {
            "content": "Though many can't deal with writer's or how they operate, this movie was phenomenal in it's day and age and still works as it is. Part suspense, part intriguing, and being fact based it leads credence to it. Both actors play off each other and submit well to it. A well solid piece of entertainment.",
            "review_date": "2020-05-25",
            "source": "rt"
        },
        {
            "content": "Has certainly losts its pang for over 4 decades ago but nonetheless a well acted and interesting political thriller, if not bogged down. And, I hate to say it, but quite slow/hard to get into. Certainly works better in novel format. Suprisingly striking visuals.",
            "review_date": "2020-05-20",
            "source": "rt"
        },
        {
            "content": "I decided to watch this after seeing all the funny moments in ''la classe américaine''. Interesting topic, boring movie. All they do is make phone calls and note things down the whole time. I didn't feel the thrilling, scandal moments at all.",
            "review_date": "2020-04-20",
            "source": "rt"
        },
        {
            "content": "With charismatic leads and a very fresh, timeless feel, All the President's Men crackles with a modern feel and a palpable relevance.\n\nLittle details, such as the difference in the way Redford and Hoffman type is a great indicator of their differences, and the film is moody and yet also brisk.\n\nThe split diopter shots are always excellently conceived and used, doubling down on the notion that intimate and powerful moments occur in an open plan and busy arena, all night filled with the kind of intensifying the glare of these artificial environments and their depth and parallel lines.\n\nThe photography is stunning, the colours in what must have been a 4K remaster, popped and felt realistic and perfectly tuned. The film is very very funny and the score stays out of the way to make the story the focus and the emotions muted even if the effect of their work was loud.",
            "review_date": "2020-02-04",
            "source": "rt"
        },
        {
            "content": "Brilliant movie, and the discussion before and after was also wonderful.",
            "review_date": "2019-11-05",
            "source": "rt"
        },
        {
            "content": "How funny that two films tackling the direction of journalism in the late 1970s were released in the same year and took completely different stances on the nature of journalists and the reaction of the public to them. This film is earnest and treats journalists as idealistic social justice crusaders who want the public to know the truth while Network (1976) is far more cynical and presents us with ratings-obsessed businessmen who want a good story at any cost. Of the two I must say that I found a lot more to enjoy in Network which despite being a satire felt more realistic and had more to say about journalism. This film presents us with two romanticized figures who are so by the book in their pursuit of the truth that it is hard to believe them as real people in addition to not being drawn in by their false perfection. Adding to this lack of interest was the film's extraordinary length as a story that could have been told in a tidy 100 minutes, thriller elements and all, is stretched out over 138 minutes. All in all a film that will satisfy aspiring journalists hoping to ‘save the world' but for a slightly more cynical viewer they may take agin the phony ideals the film offers.\n\nWashington Post journalists Bob Woodward, Robert Redford, and Carl Bernstein, Dustin Hoffman, investigate government corruption in 1972 after the Watergate Hotel is broken into. Woodward uncovers a trail of corruption leading to the White House after discovering that the burglars are connected to former government employee E. Howard Hunt. Using \"Deep Throat\", a shifty government employee, Woodward is able to verify information and is encouraged to \"follow the money\" in order to connect the break in to President Nixon. With the help of bookkeeper Judy Hoback Miller, Jane Alexander, they put together a story they can put to print and expose the corruption of the President.\n\nThe free press clearly have something to offer society as they supposedly provide us with un-biased information on political and social issues that educates us and holds the government accountable. However I do not believe that journalists are actually altruistic in their pursuit of a good lead. They have egos like everybody else and considering the amount of self promotion that Woodward and Bernstein dished out I believe that they knew they were onto something and felt a certain amount of satisfaction at having found a story that would make them famous. None of this is present in the film as our two crusaders are angelic in their commitment and devotion to their work and other than references to Bernstein being a womanizer and Woodward being to uptight they lack humanity. The great journalists in cinema have been flawed, tragic individuals such as J.J. Hunsecker in Sweet Smell of Success (1957) who are riveting even as they abuse the ethics of their profession. Seeing two ‘nice' men go about their job while facing very few barriers or challenges was hardly compelling and one would like to see more out of a film featuring Hoffman and Redford.\n\nRemarkably the conspiracy they uncover seems less interesting than it should be as although it was a shocking bombshell at the time you never feel the abject horror that the public must have felt in the film. I wanted to be shocked and horrified as I was at the end of The Conversation (1974) but Pakula lacks the ability of Francis Ford Coppola to convey mental turmoil in the minds of characters. When Woodward runs down a darkened street in fear of being attacked by one of Nixon's associates I felt certain that nothing would happen to him and even if he had been beaten I doubt I would care. His ambitions were direct and straightforward, his reactions limited and this meant that even the moments of supposed excitement in the film are not as joyous as they should have been. Were Pakula to explore the idea that journalists are so jaded that they aren't exhilarated by a conspiracy of this scale I could have appreciated the dour, glum tone but instead he plays everything straight faced and that just wasn't enough. \n\nIf you want a fascinating Pakula directed thriller that manages to explore the emotional struggle of the main character effectively please seek out Klute (1971).",
            "review_date": "2019-10-24",
            "source": "rt"
        },
        {
            "content": "An exciting film about journalism, based on the true Watergate story.\n",
            "review_date": "2019-10-16",
            "source": "rt"
        },
        {
            "content": "William Goldman's direction in \"All the President's Men\" stays focused on the Watergate investigation by the Washington Post with impressive technical skill as well as benefits from the power of its two leads (Redford and Hoffman), but we already know the ending so the payoff isn't as satisfying as you'd like from such a significant moment in American politics.",
            "review_date": "2019-09-30",
            "source": "rt"
        },
        {
            "content": "A masterclass film anchored by the two leads, especially Redford.  Also, Redford directs this film the best possible way you could of.  Based on the true story that's clouded with webs and webs of information and motives, this film wonderfully explains all of it with style and excitement",
            "review_date": "2019-09-24",
            "source": "rt"
        },
        {
            "content": "The movie is an accurate representation of how important print media was before the internet came along. Media as information is the root of this movie. The entire movie is a good example of media as information. A majority of it is filmed inside the Washington post office space where journalists are dedicating their life's work to investigating and writing stories for the public. ",
            "review_date": "2019-08-30",
            "source": "rt"
        },
        {
            "content": "It's an important story, and everything is done well. It just is slow-paced and could've benefited from more (character) conflict.",
            "review_date": "2019-08-28",
            "source": "rt"
        },
        {
            "content": "All The President's men is a beautifully made, complex, well acted, political thriller. One of the best of the year. ",
            "review_date": "2019-08-06",
            "source": "rt"
        },
        {
            "content": "In the beginning, Redford and Pakula said, \"let us make the journalistic thriller in our image, in our likeness, so that it may rule over all the theater screens across the country and all the shelves at the Best Buy 'classics' rack, over every wannabe Spielberg pre(?)-make and over every lowly serf that thinks you absolutely need explosions or killings in your movie for it to be any good.\" \"All The President's Men\" is just plain ol' cracker-jack storytelling. Though, yes, it most certainly helps that the story in play is already fascinating enough -- and true, to boot -- it also doesn't hurt to have one of the world's greatest screenwriters staging your scene dynamics, drafting up your dialogue, and structuring your overall narrative. Aside from William Goldman's expertly constructed screenplay, this also just so happens to represent Alan J. Pakula putting on an absolute clinic in how to make a seemingly dry movie look incredible. From the dank, expressive corners of a darkened parking structure, to the blindingly bright interiors of the Washington Post's office floor, it all feels expertly staged and shot. Oh, and Redford and Hoffman are pretty damned good as well. Not that that needed clearing up or anything. In the end, \"All The President's Men\" is an engrossing, beautifully realized story of power, journalistic integrity, and the importance of getting/making things right.",
            "review_date": "2019-08-03",
            "source": "rt"
        },
        {
            "content": "A highly-enthralling portrait of one of America's most controversial moments.",
            "review_date": "2019-07-30",
            "source": "rt"
        },
        {
            "content": "This movie is a premiere example of the precocity of 1970's filmmaking.  It is long.  But it's long because it tells a complicated story.  Each scene really takes it's time.  But it uses this time to create, through fast realistic dialogue and overworked pauses, an amazing consternation. The acting was world class.  Hoffman and Redford really work off each other fantastically.  Their performance reminded me of Matthew McConaughey and Woody Harelson in the critically acclaimed 2014 TV series, True Detective.\n\nNowadays, with the flood of movies and media it's easy to overlook the classics but we need to remember the massive amount of work and care it once took to put together a film of this caliber.  That effort and care really translates when you watch it.  It's an experience that you just don't get in today's movies.  So make some popcorn, turn down the lights, and give this movie a watch.  You deserve it and you might learn some history in the process.\n",
            "review_date": "2019-07-10",
            "source": "rt"
        },
        {
            "content": "During the U.S. presidential campaign of 1972, Washington Post reporters Karl Bernstin and Bob Woodward investigated the break-in at the Democratic National Committee headquarters at the Watergate office complex in Washington, D.C.\n\nAn anonymous source from the FBI, nicknamed Deep Throat, began to leak information indicating there is something much more sinister hiding behind the scenes, but in the beginning journalists found it hard to belive and grasp the scale of it all. Through their investigation, the case of an ordinary burglary has grown into one of the biggest political scandals that have ever shook the U.S.\n\nIt turned out that the Committee to Re-elect the President (Richard Nixon) has engaged in serious political dirty tricks, harassment, espionage, etc. and that the Justice Department, the FBI and the CIA are involved in the cover-up. Scandal continued to unravel until it became clear that in the whole thing involved highest officials of the White House, including President Richard Nixon personally.\n\nMovie All the President's Men was made in 1976, four years after the outbreak of the Watergate scandal and only two years after Richard Nixon was forced to resign because of this (and thus becoming the only U.S. president who resigned). The film received a great public attention, made a huge political influence in the United States, set new standards of journalism and became one of the most commercially successful political films in history.\n\nIn the scene when the two journalists are going towards the house of one of the key people in the scandal, one of them says: \"All these neat, little houses and all these nice, little streets... It's hard to believe that something's wrong with some of those little houses.\" to which the other replies: \"No, it isn't.\" This conversation sums up the disillusionment in the political system and the outrage of an entire generation. Based on actual events.",
            "review_date": "2019-04-19",
            "source": "rt"
        },
        {
            "content": "I'm biased due to the genre. An engaging watch from start to finish.",
            "review_date": "2019-03-13",
            "source": "rt"
        },
        {
            "content": "In the run-up to the 1972 elections, Washington Post reporter Bob Woodward covers what seems to be a minor break-in at the Democratic Party National headquarters. He is surprised to find top lawyers already on the defense case, and the discovery of names and addresses of Republican fund organizers on the accused further arouses his suspicions. The editor of the Post is prepared to run with the story and assigns Woodward and Carl Bernstein to it. They find the trail leading higher and higher in the Republican Party, and eventually into the White House itself. \n\nRobert Redford (Bob Woodward) approached  Carl Bernstein (book), Bob Woodward (book) about making \"All The President's Men\" . Carl Bernstein insisted that Redford and Director: Alan J. Pakula follower the book and for the most part they did . This film captures the essence of a newspaper reporter and  journalism very well. A bonafide hit the political thriller \"All The President's Men\" garnered a total of Eight Oscar nominations including Best Picture and won Four including Best Supporting Actor, Best Adapted Screenplay, Best Sound and Art Direction.\n\n Dustin Hoffman as Carl Bernstein and Robert Redford as Bob Woodward ! Perfect.Jason Robards shines as their boss Ben Bradlee, and Hal Holbrook is quite great as Deep Throat- the key information provider to Woodward who managed to remain anonymous until 2005. \n\nAll the President's Men is a quintessential American movie.",
            "review_date": "2019-03-07",
            "source": "rt"
        },
        {
            "content": "A suspenseful film take on Nixon's conspiracy for Watergate.\n\nAll the President's Men (1976) is director Alan J. Pakula's noir take on a political thriller centered around Watergate. The Nixon scandal changed American politics and how the public views The White House. The journalists Woodward and Bernstein are mostly responsible for enlightening and informing the American public about Nixon's criminal undertakings through their reporting at The Washington Post. All the President's Men chronicles the deep investigative reporting experience and the research that went into Woodward and Bernstein's work in uncovering the Watergate scandal. It's a riveting film from start to finish with moments that relate to modern day criminal proceedings in the Trump administration.\n\nPakula's direction is a gorgeous noir look with an espionage tale atmosphere akin to spy films instead of movies about journalists. All the President's Men has more in common with The Conversation, The French Connection, and Tinker, Tailor, Soldier, Spy than it does with films like The Post or Spotlight funnily enough. Pakula's direction sees dark nights and long hours of conversing with witnesses, meeting with Deep Throat in dark smoky garages, and interviewing sources for investigative reporting. If the intrigue and scandal does not interest you, the fast paced footwork of these two reporters doing incredible and influential work certainly will. Pakula's direction is compelling as he pits journalists against their editor, readers, and their government. It's all interesting from any angle.\n\nRobert Redford and Dustin Hoffman are phenomenal as Woodward and Bernstein, respectively. Redford captures Woodward's cool and thoughtful style of journalism with a kindly and clever reasoning process. Hoffman gives Bernstein a persistent and precocious attitude that is entertaining and insightful into the mind of a man that uncovered numerous Nixon accomplices. Redford and Hoffman both give engaging acting performances that are so realistic, you feel like you are just watching the events unfold on screen in front of you instead of watching a film. They captivate your attention with endless monologues of facts and lines of questioning. Redford and Hoffman's empathy is evident for Woodward and Bernstein's long hours of tireless and thankless work.\n\nOverall, All the President's Men is worth watching just for the historical facts presented to you in an interesting way to give you everything you need to know about Watergate in the span of a film. All the President's Men just happens to entertain and engage you with creative noir filmmaking, stellar performances, and William Goldman's biting script.",
            "review_date": "2019-02-19",
            "source": "rt"
        },
        {
            "content": "I will say that you do takeaway from the film a bit more if you know your Watergate Scandal facts as well as having read the articles talked about in the film. That being said, I greatly enjoyed the film. To see the investigation from the point of view of Woodward and Bernstein is something that is rarely tackled in film. And when it does, the focus is mostly on the mystery of \"Deep Throat\" or the Nixon implications. This film does not do this and instead focuses on the intricacies of their investigation and everything they had to do to even get the first article out in the presses. My favorite aspect of the film would have to be the disuse of a traditional film score. This film relies on the diegetic sounds in order to not only build tension but also create a sense of realism. I would say that the only film to match this in recent memory to be David Fincher's The Social Network. Overall, I greatly enjoyed the film and want to say that Dustin Hoffman and Robert Redford did an amazing job playing some of the biggest whistleblowers in history.",
            "review_date": "2019-02-13",
            "source": "rt"
        },
        {
            "content": "A classic film about politics and journalism",
            "review_date": "2019-02-05",
            "source": "rt"
        },
        {
            "content": "Movie night with Iris.\n\nCompanion piece to The Post, but it blows The Post out of the water. Would never get green lighted these days. Two guys, no chemistry; reel off names for 2+ hours. It's gripping and brilliant.",
            "review_date": "2018-11-17",
            "source": "rt"
        },
        {
            "content": "This film was solid.",
            "review_date": "2018-11-06",
            "source": "rt"
        },
        {
            "content": "Pakula creates a remarkably absorbing drama that moves without hurry, following each step of a real-life journalistic investigation that should remind us of the absolute importance of a free press in democratic countries where powerful people still believe they can rise above the law.",
            "review_date": "2018-10-26",
            "source": "rt"
        },
        {
            "content": "Redford and Hoffman are excellent in this real life take on the watergate scandal which resulted in the axing of President Richard Nixon. Adapted from a book by the chief perpetrators that brought down the presidency, Journalists Bob Woodward and Carl Bernstein, this film is so good you'd think it was a documentary. Stylishly shot by Alan J Pakula it has a documentarist vibe and feel (probably the filmstock) and the actors are all excellent- as they were back in the day. Robert Redford and Dustin Hoffman are really good as the two-investigative journalist's hell bent on finding the truth and everyone from Jason Robards and Hal Holbrook lend in finely tuned performances to give a lot of deft to the film. If you like political thrillers, then All the President's Men is a must watch.(One of the best political films ever made).",
            "review_date": "2018-09-25",
            "source": "rt"
        },
        {
            "content": "Such an important story to told, and it's fortunate that two major actors worked together to make it transcend generations.  Very interested to see the sequel - due out sometime during or after the 45th president's time in office.",
            "review_date": "2018-09-07",
            "source": "rt"
        },
        {
            "content": "This movie is about reporters doing their job, and really that's it.  It's incredibly well acted and directed, making it fun to watch if you like wonky history, or want to see how two hours of short conversations can be made actually fairly exciting.  But don't expect to learn much of anything about the men involved, personal struggles, or how they fit into larger issues in society.  To be sure, there are some subtle cues that are brilliant to watch, but the narrative sticks to its one track fairly obsessively.  The dialogue and acting are so good and so realistic that you feel like you are watching recordings of these conversations taking place.  Impressive, but the complete lack of exposition is actually a little painful to watch.  Finally, the ending was very disappointingly abrupt.  Did they just run out of steam, or what?",
            "review_date": "2018-08-12",
            "source": "rt"
        },
        {
            "content": "Very well done movie. Story flowed smoothly, movie seemed realistic, fine acting, and entertaining overall. Very interesting and thought provoking.",
            "review_date": "2018-07-23",
            "source": "rt"
        },
        {
            "content": "It's a 'life is stranger than fiction' story. So much intense stuff happens, if the film was fiction it would be condemned for being too fantastical. It's an intense, well acted mystery.",
            "review_date": "2018-07-11",
            "source": "rt"
        },
        {
            "content": "Alan J. Pakula made a very smart decision by not making this movie longer. Because I think Oliver Stone made a mistake by making the runtime of JFK three hours and nine minutes, and the director's cut even longer by 17 minutes! The result, in the case of JFK, was that the movie focused more than it should do on some subplots that really didn't add too much to the story. All the President's Men, instead, made a good use of every minute in it with its reasonable runtime. \n\nThe Oscar-winner script, with all its cleverness, isn't the only powerful aspect about the movie. Alan J. Pakula directing is very entertaining. Besides building the tension, he shot many long scenes that really deserve to be of the most iconic scenes in film. \n\nThe performances are all great; Redford has the most of the screen time, and I wouldn't have been surprised if he had an Oscar nod. He has a particular scene in which he changed his face expressions so gracefully. Hoffman is one of my favorite actors and he gave one of his best performances in this movie; his character is so energetic and impulsive and he just got it right. But the performance that really standout is Jason Robards' performance as Ben Bradlee, the executive editor of The Washington Post. Robards, without a doubt, deserved his Oscar for best supporting actor.\n\nAt the middle of its third act, I think the movie suffered a little bit moving between two sub-plots; it moved very fast between them and I think it should have made a small breather to keep me gripped, and to make me invested in the new sub-plot from its beginning.\n\nThere were many secondary characters in this movie and they were all great, except one character that I felt it should have given some more depth because it has an important role near the end, and a background could have filled some logical gaps. With that being said, this character is very interesting and you may be interested to search about it after watching the movie.\n\nOverall, All the President's Men can be described as a \"Hitchcockian\" political thriller. Its tension and suspense are unprecedented in this sub-genre. And I loved it!\n\n(8.5/10)",
            "review_date": "2018-06-03",
            "source": "rt"
        },
        {
            "content": "Good movie, good story, good actors. Then why I didn't like it? Because I am not into investigative journalism films, basically. There are a lot that I like anyway, but movie will not go to that list. Because of it's age is a slow film, the story is repetitive (and now well known) and 2 hours and 20 minutes felt like 5 to me. Classic or not, I have to bin it.",
            "review_date": "2018-04-30",
            "source": "rt"
        },
        {
            "content": "good enough movie. payoff was awful. hated the ending. we are not invested in journalist being journalist. we are invest in watergate and teh story they are investigating. it was a mistake not to give us the big breakthrough at the end. dont tell us they are heroes. let us see them do something heroic and we will decide that for ourselves.",
            "review_date": "2018-04-30",
            "source": "rt"
        },
        {
            "content": "It can be pretty confusing with so many people involved. But it's a well directed and amazingly acted political thriller",
            "review_date": "2018-04-25",
            "source": "rt"
        },
        {
            "content": "Excellent film about one of the biggest news story ever to be revealed",
            "review_date": "2018-04-07",
            "source": "rt"
        },
        {
            "content": "This film will make you dizzy. If you're not too familiar with the Watergate scandal you might, like me, find all the name dropping totally confusing. Also, there isn't enough explanation of the events in the film.  But it's still intriguing, and the acting is very good",
            "review_date": "2018-03-14",
            "source": "rt"
        },
        {
            "content": "A true Real-life story, All The President’s Men leads you in old-school journalism, smart writing from William Goldman, and towering performances from the cast. It is also surprisingly accurate",
            "review_date": "2018-03-12",
            "source": "rt"
        },
        {
            "content": "A great film with top notch direction, acting and script. But honestly, I was expecting a little more. By the end this felt more like a documentary than journalistic film because it didn't quite took advantage of the tools that the seventh art brings in terms of mystery and intrigue.",
            "review_date": "2018-03-04",
            "source": "rt"
        },
        {
            "content": "***CLASH OF THE POLITICO TITANS & THE FREE PRESS OLYMPIANS... VERY PROPHETIC***",
            "review_date": "2018-01-28",
            "source": "rt"
        },
        {
            "content": "All The President's Men thrives on its slow build and its elaborate subtlety, allowing the audience to trust its winding story, and root for the truth.",
            "review_date": "2018-01-16",
            "source": "rt"
        },
        {
            "content": "A fascinating film about one of the craziest times in United States history, All the Presidents Men is both very well acted and directed anchored by the leading duo of Hoffman and Redford. A film that does the most that it can with a story that does not lend itself well to the big screen, it does suffer from pacing issues at times but as a whole is an intriguing dive into journalism and politics. 4/5",
            "review_date": "2018-01-01",
            "source": "rt"
        },
        {
            "content": "Best political thriller ever. Stands test of time. Everyone talks about Redford & Dustin Hoffman, but Robards is a tour de force. ",
            "review_date": "2017-12-03",
            "source": "rt"
        },
        {
            "content": "do you want to be bored to death? then watch this",
            "review_date": "2017-11-10",
            "source": "rt"
        },
        {
            "content": "Deftly-handled. This movie is smooth and lilting. For being from the 70s, it felt so modern and crisp. Bill Goldman's script shines, and all the acting is top-notch. The two leads are here in their prime. A classic film.",
            "review_date": "2017-10-10",
            "source": "rt"
        },
        {
            "content": "Seemed like an apt time to watch this one again...and it didn't disappoint.  Director Alan Pakula and famed screenwriter William Goldman manage to turn the gruelling legwork of the investigative journalist into a gripping thriller, despite it being all talk and no action (thanks also to the cinematography of Gordon Willis).  Of course, the focus of that investigation, as it uncovered more and more clues, was provocative and dangerous - as we know, reporters Bob Woodward (played by producer Robert Redford) and Carl Bernstein (played by Dustin Hoffman) effectively brought down Richard Nixon and his crooked administration.  Their source for \"deep background\" information (referred to as Deep Throat and played by Hal Holbrook) was a shadowy figure within the Executive Branch, not revealed in the movie nor by Woodward himself until 2005 when at age 91, former FBI Deputy Director Mark Felt outed himself.  Of course, all of the unattributed and off-the-record sources that they had to rely upon were immediately denounced and denied by the White House, but they were backed by gutsy Ben Bradlee (Jason Robards), editor of the Washington Post, their paper.  The filmmakers don't shy away from showing the grind of the investigation, the concern with journalistic ethics, the pressure from those trying to cover-up the links from the Watergate burglary at the Democratic National Committee headquarters to those higher up in Nixon's government - but it is never less than exciting as the pieces of the puzzle fall into place.  And rather than stretch out the story from its early beginnings (the break-in was 17 June 1972) all the way to Nixon's resignation (8 August 1974), the film ends with a series of teletypes showing the later dominoes falling.  Forty years later, the film itself has had an amazing cultural impact (perhaps beyond the book), giving us the phrase (and investigative plan) \"follow the money\" and influencing other scripts (notably The X-Files) and the training of journalists (apparently they watch the film).  So, the question arises - where are our Woodwards and Bernsteins today? We need them.",
            "review_date": "2017-09-08",
            "source": "rt"
        },
        {
            "content": "Great performance, great screen writing, intense and still very fresh. The duo Dustin - Redford is very powerful. A movie about the process of investigative reporting of what became a major historical event.  Definitely a must see.",
            "review_date": "2017-09-04",
            "source": "rt"
        },
        {
            "content": "Very good movie. Fantastic acting, fantastic writing, and fantastic research. The movie was just a bit too dry for me though.",
            "review_date": "2017-08-14",
            "source": "rt"
        },
        {
            "content": "Phenomenal movie. The fact-based story is thoroughly compelling and fascinating to watch, accurately portraying the nuances and struggles all journalists (especially Woodward and Bernstein) go through on their big stories, as well as quietly stylish direction from Paskula and great performances from Hoffman and Redford.",
            "review_date": "2017-06-05",
            "source": "rt"
        },
        {
            "content": "A gripping drama with two great leads about a subject which is ever so relevant today.",
            "review_date": "2017-06-04",
            "source": "rt"
        },
        {
            "content": "Intriguing insight into an event I have airbrushed from my history repertoire - The Watergate Scandal that brought about the resignation of then United States President Richard Nixon in August 1974.\nThe scandal was unearthed largely thanks to reporters at the Washington Post newspaper Robert Woodward (Robert Redord) and Carl Bernstein (Dustin Hoffman) and it is their story that forms the main structure of the film.\nMade in 1976 in an analogue world before even the most basic desktop computers and cellular phones we see the inner workings of a newsroom with its noisy typewriters and rotary telephones.\nThe two and a half hour runtime should provide hope to some and a warning to others how the mighty inner circle of the U.S. Government can be brought down.\nRedford and Hoffman deliver excellent performances as the two hacks who literally won't take no comment as an answer in their reporters notes.\nThe film was rightly recognised with several awards and award nominations.\nDirector Alan J. Pakula delivers a suspenseful film despite the outcome being ultimately known.",
            "review_date": "2017-06-01",
            "source": "rt"
        },
        {
            "content": "A mesmerizing film of precision and subtle nuance.",
            "review_date": "2017-05-18",
            "source": "rt"
        },
        {
            "content": "Alan J. Pakula's ALL THE PRESIDENT'S MEN is a movie that demands your attention, and fortunately for us we're sucked in involuntarily. Sure, with all the names that link to the McGuffin it does get somewhat confusing, but by the end you've sorted everything out. The film is structured like a Russian doll, you start with the largest piece of evidence and work your way down. The movie is shot like a documentary that was somehow cut to look like a suspense film. There are no personal subplots that get in the way, just straight information. It's clear that the writer was just aiming for the bare bones. In some ways it's episodic, but from what I know journalism is very episodic. The picture feels somewhat like straight-facts Andromeda Strain, minus the science fiction but plus the paranoia and determination. There are no moments of tension crafted in the editing room, although some of it can be accredited to that, it is straight drama depicted through the performances, which are incredible. When thinking that this and Network lost to Rocky for the Best Picture Oscar is frustrating.",
            "review_date": "2017-04-14",
            "source": "rt"
        },
        {
            "content": "Story about the Watergate scandal told from the side of two news reporters who are the one's who actually bring the truth to light. Its kind of ironic because today we have thousands of Woodward and Bernstein's. All of them are trying to find out what's \"really going on\" at the White House. Obama's or Trumps. Problem is, back then, Nixon wasn't near as cautious as presidents are today. This will never happen again. Great movie. One of my all time favorites.",
            "review_date": "2017-04-14",
            "source": "rt"
        },
        {
            "content": "Great opening sequence filled with confusion and mystery. It's so cool how as the story progresses, it gets more and more interesting. Seeing how these reporters investigate and take notes is kind of inspiring as well.\n\nIt still amazes me that people don't want to believe that their are cover stories that are covered up and kept secret from the public. Especially those in high powers who don't want word to get out about a certain event taking place or what's really going on.\n\nWith every conversation, the plot gets more interesting and everything starts to unfold. Pretty damn serious movie. Jokes are very scarce and seldom. Amazing how the reporters were able to make the people involved speak even with their subtle tactics.\n\nNot really the kind of movie that interests me and that I jump on but I found it pretty interesting.",
            "review_date": "2017-04-12",
            "source": "rt"
        },
        {
            "content": "Can't wait for the sequel!",
            "review_date": "2017-04-06",
            "source": "rt"
        },
        {
            "content": "Riveting from the start, all the way through End was a little anticlimactic? But given it's realism you can't get much better/ask for more!",
            "review_date": "2017-03-28",
            "source": "rt"
        },
        {
            "content": "Story/Screenplay: (3.5/5) A historical drama about The Washington Post's investigative coverage following the break in of the Watergate Office Building.  After almost 50 years, it still holds up to scrutiny and is fairly accurate.\n\nDuration/Tempo: (2.5/5) At 2 hours and 18 minutes, it's a long movie that felt about the same.  Would have liked to see some trimming.  The film is jammed with so much detail that it became difficult to follow at times.\n\nCast & Crew: (4.5/5) Robert Redford and Dustin Hoffman were very good.  Jack Warden, Martin Balsam, and Jason Robards also shined.\n\nSummary: (3.5/5) A great cast and a decent story coupled with a film that was a little long.  Overall, a thumbs up.",
            "review_date": "2017-03-28",
            "source": "rt"
        },
        {
            "content": "Bogged down by over-plotting in its second half, but nonetheless well acted and shockingly relevant in today's political climate.",
            "review_date": "2017-03-22",
            "source": "rt"
        },
        {
            "content": "Finally got round to watching this. Rightly regarded as a classic. A great thriller and visually interesting, for what is basically a bunch of typing.",
            "review_date": "2017-03-10",
            "source": "rt"
        },
        {
            "content": "This is a great movie about Nixon and Washington Post.Two reporters fought against Nixon administrarton.They won.\n\nI liked offices in the 1970's.There was no computer.People used typewriter. Of course, they didn't have any smart phone.They use only landlines which people had to dial. No social media! Trump is lucky enough to tweet. Unfortunately, Nixon could not  tweet. \n\nIf foreigners watch this movie, they need to learn Watergate scandal on the internet.It makes this movie more interesting.\n\nIt is well done. I love this movie.",
            "review_date": "2017-03-10",
            "source": "rt"
        },
        {
            "content": "?????????\"???\" \"Spotlight\"????????????????????????????????????????????????????????????????????????????????????????????????????????????·????Robert Redford?????·????Dustin Hoffman??????????????????????????????????????????????Machiavelli?????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????·??????????",
            "review_date": "2017-02-26",
            "source": "rt"
        },
        {
            "content": "I likhet med filmen Spotlight jeg så i fjor, denne klassiske politiske filmen viste nok en gang at pennen er mektigere enn sverdet. Disse filmene kan ikke understreke nok hvor viktig det er for å få sånn demokratier å ha fri presse å være se hunder av regjeringer eller noen herskende organer som Vatikanet og deres kardinaler. Frihet og uavhengighet presse alene er ikke nok, men også behovet for god undersøkende, ansvarlig journalistikk. Ivrige journalister i Washington Post handlet med Robert Redford og Dustin Hoffman kontrollert av kloke og erfarne redaktører utsatt Watergate-skandalen av Nixon som bare handlet om Machiavelli prinsipp gjør hva å holde seg ved makten. I hans tilfelle, for å spionere på sine politiske motstandere. Skandalen malt republikanerne i et svært negativt lys. Men er Liberaldemokratene hellige i sammenligning? Absolutt ikke, og pressen er ikke upartisk i skitt de avdekke. En virkelig lurer på om Washington Post ville ha vært like ivrige til heksejakt Nixon om han var demokrat. I alle fall, en fri presse er en nødvendig støtte i alle gode forhånd demokratier fordi hvis vi har lært noen ting fra historien, er det alt menneske med makt  som den amerikanske regjeringen eller kardinaler i den katolske kirken, vil etter hvert bli korruptert hvis de var ikke i begynnelsen.",
            "review_date": "2017-02-26",
            "source": "rt"
        },
        {
            "content": "Like the film Spotlight I saw last year, this classic political film demonstrated yet again that the pen is mightier than the sword. These films cannot emphasise enough how important it is for free democracies to have free press to be the watch dogs of the governments or any ruling bodies such as the Vatican and their cardinals.   Freedom and independence of press alone are not enough but also the need of  good investigative, responsible journalism. Eager journalists of Washington Post acted by Robert Redford and Dustin Hoffman vetted by wise and experienced editors exposed the Watergate scandal of Nixon who merely acted on Machiavelli principal of doing whatever to stay in power. In his case, to spy on his political opponents. The scandal painted the Republicans in a very negative light. But are the liberal Democrats saints in comparison? Absolutely not and the press is not impartial in the dirt they uncover. One really wonders if the Washington Post would have been just as zealous to witch hunt Nixon if he was Democrat. In any case, a free press is a necessary pillar in all good advance democracies because if we have learnt any thing from history, it is all in power such as the US government or cardinals in the Catholic church, will become corrupt even if they weren't in the beginning.",
            "review_date": "2017-02-26",
            "source": "rt"
        },
        {
            "content": "Still holds its merit after 40 years!",
            "review_date": "2017-02-19",
            "source": "rt"
        },
        {
            "content": "Tremendous performances and tight scripting in this story about two writers and the lengths they both go to in order to crack the Watergate scandal wide open.",
            "review_date": "2017-02-04",
            "source": "rt"
        },
        {
            "content": "A very well made film that unfortunately becomes a bit repetitive and overlong with an ending that felt too abrupt. Some of the shots here are pretty amazing and is worth seeing despite the faults.",
            "review_date": "2017-01-27",
            "source": "rt"
        },
        {
            "content": "The last 3 scenes shifted this in my mind from a 90 to 100 score. \n\nIts amazing how apt its lesson is to the Trump reality of today & how utterly vast todays technical capacity is to do harm to our rights & freedoms in comparison to the primayive tools of just 40 years ago.\n\nIt tells me without a doubt that there willl be far more presidential history in the next 4 years than in all of that last 40. And that almost certainly will not be good.",
            "review_date": "2017-01-05",
            "source": "rt"
        },
        {
            "content": "Takes the complex details of a true story and allows the gravity of its importance percolate into a thrilling, solid suspense flick.\nGreat direction and performances.",
            "review_date": "2016-12-10",
            "source": "rt"
        },
        {
            "content": "Investigative journalism at its finest, for Watergate buffs.",
            "review_date": "2016-11-26",
            "source": "rt"
        },
        {
            "content": "Pretty good considering how old it is. \n\nI particularly liked how authentic it was in sound quality. There was an airplane going overhead for instance, and they just kept rolling, having to shout a little bit. Most movies would just have a steady perfect sound clip rolling. \n\nI thought it did end rather abruptly though. Would have liked for it to play out more.",
            "review_date": "2016-11-20",
            "source": "rt"
        },
        {
            "content": "Uncovering Richard Nixon and Watergate. What's not to like?",
            "review_date": "2016-10-23",
            "source": "rt"
        },
        {
            "content": "A great thriller about journalism and politics, it draws us in beautifully and gets us pulling for the protagonists, even when we know the outcome - it's as if we watch and listen in order to understand how they did it.",
            "review_date": "2016-10-14",
            "source": "rt"
        },
        {
            "content": "The dry tone of the film may turn off some people, as it does not have any actual action or over-the-top sequence. Other than that, this film is a good example of the excellent quality of the New Hollywood period (from around 1969 to 1979) - a period full of films with perfect cast, thoughtful script, next-to-none fanciful yet useless details, social awareness, and resistance against political correctness. That is also what \"All the President's Men\" was all about. Having two of the most prominent faces of the New Hollywood generation clearly did not hurt, but the way Redford and Hoffman were selected for two totally opposite yet fully complementary characters really elevated the quality of the film and helped show the everyday dilemma that journalists have to face - be quick (but lack of credible and verified information) or (trying to find the root of the matter and) be dead? Despite the recency of the events depicted in the film, \"All the President's Men\" is also very commendable for avoiding the unnecessary dramatisation of the fact, and rather following the fact closely by unveiling event by event, character by character to the audience with utmost care, especially regarding the script logics of a journalistic investigation, the authentic ambiance of a biographical cinematic work, and the value of true journalism. Much less dramatic (and with way fewer accolades) than \"Spotlight\", but \"All the President's Men\" to me really is a superior film about journalism.",
            "review_date": "2016-09-07",
            "source": "rt"
        },
        {
            "content": "A little slow but good",
            "review_date": "2016-08-26",
            "source": "rt"
        },
        {
            "content": "All the President's Men is an excellent film. It is about reporters Bob Woodward and Carl Bernstein who  uncover the details of the Watergate scandal that leads to President Richard Nixon's resignation. Dustin Hoffman and Robert Redford give fantastic performances. The screenplay is well written. Alan J. Pakula did a great job directing this movie. I enjoyed watching this motion picture because of the drama and history. All the President's Men is a must see.",
            "review_date": "2016-08-24",
            "source": "rt"
        },
        {
            "content": "You may have heard of Watergate. This movie is based on the real-life experiences of Washington Post journalists Bob Woodward and Carl Bernstein, who were the primary investigators of the scandal. I could tell you that this is the story of how they uncovered the truth of the Republican re-election committee's crimes in spying and sabotaging the efforts of the respective Democratic committee. However, that would not be entirely representative of what the story tells and how it is told. All the President's Men does not go into much detail about exactly how they cornered several committee members, including Nixon himself, to pleading guilty. See, this is not a feel-good movie. Instead, among their efforts to find on-record proof, we are treated to the details of their dead ends and shaky inferences. They barely have a clue as to what is truth and what is conspiracy; the closer they get to confirming the truth, the more fearful they are of the consequences of their actions. Director Alan Pakula crafts an atmosphere of paranoia through a figurative gas leak -- initially, an odd smell pervades the airs in attempts to interview witnesses, and overtime, Pakula seals the enclosure to test how much longer Woodward and Bernstein can breathe. And boy, do Rob Redford (Woodward) and Dustin Hoffman (Bernstein) choke. (Not as actors, to clarify.) The dark side of Washington DC shines best -- that is, the least -- in Woodward's visits to his government cohort Deep Throat (Hal Holbrook). These are the most hopeful times for Woodward to reach a revelation, but the revelations keep getting darker and darker, upon each visit. All the President's Men highlights how unglamorous the lifestyle of even the most heroic journalists is, as well as the sick, sinking feeling that comes with such investigation. The interpolations of real-life coverage on the government's responses to this investigation only further emphasize the horrors of their actions.",
            "review_date": "2016-08-08",
            "source": "rt"
        },
        {
            "content": "There's a scene in All the President's Men which lasts five minutes, contains four phone calls and is recorded in one take. It's a moment which speaks to what makes Alan J. Pakula's true to fact political thriller so affecting. It's a scene of piano string tension which refuses to blink, its drawn out take the visual equivalent of one holding their breath. It gives us no reprieve as the plucky journalist Bob Woodward pivots between callers, sensing he's on the cusp of a revelation as he surely begins to put one foot in front of the other. And when did that camera get in so tight to Bob's features? It slithered in, ever so gradually, from a medium shot to an extreme close up, just as we slowly lean forward in our chairs watching it. The fact that the camera is moving goes over our heads because it seems so natural, so befitting of the mounting excitement. \n\nIt's this brand of theatrical flair which makes every minor moment of progress so dramatic in All the President's Men, where something as simple as ascertaining a name or receiving a nod of the head could set in motion a chain of events that has the weight to send America into disarray. It makes us covet every fact, it charges every second of the journalistic process with significance. The scene in question, as many scenes in the film do, risks being overwhelmed with information, it's confusing even for Bob who crosses the names of his callers, but it remains so completely thrilling because the film has installed in us an appreciation of our heroes and the fight required for even an inch of forward movement.\n\nThe action in the film amounts to little more than ink being scratched into paper and discussions of committee funds between reporters and government officials, but All the President's Men is never dry, never less than utterly absorbing. It's the story of two crusaders working for The Washington Post, a new comer Bob Woodward (Robert Redford), and a cutthroat veteran Carl Bernstein (Dustin Hoffman), who together dig into the Watergate break-ins and soon discover that whatever happened at the Democratic National Committee headquarters was far from a routine burglary. Of course the scandal was foul play from America's most important men, perhaps the pivotal moment in America's cancerous disillusionment which had become such a focal point for so many films in the preceding years. \n\nWilliam Goldman's screenplay is one of extreme density, an endless spewing of names and locations and minute specifics, but it's dense to a fastidious end, not a tiring one. It's this amazing appreciation for detail that aligns us so tightly to our two investigators. We are with them for every forward step and backwards step, swimming in disparate information, begging for a rope as Woodstein (their adopted team name) themselves tread to keep the heads above water. We are so enveloped in their journey, so tremendously synchronised with them, that we almost forget where it is that the scandal, one of the most well known in history, is headed.\n\nSo much of the tension stems from the fact that Pakula and Goldman never do offer us a line. The film never leaves its circle of phone calls, note taking and interviews. We're never given a chance to see Woodward and Bernstein operate in their personal lives, their existence is instead constricted to the investigation. We only get to know them through subtle characterisations, like the chain smoking, coffee slurping Bernstein's hair which slowly grows out sideways as the case wears on; like Woodward's increasingly sloppy apartment which was a mess to begin with; through Woodward's relenting on interviewees while Bernstein wants to take no prisoners, as though to keep their morality in check as they stumble into increasingly immoral territory.\n \nThere's also a spookiness to the film, a spookiness at times painted with sub horror strokes that stray from realism. Woodstein are delving into an abyss, tackling a force which omnipotently presides over their every move like an Orwellian nightmare. The shadow enclosed Deep Throat (Hal Holbrook), the famed inside man who meets with Woodward in blackened car parks to nudge him in the right direction, registers like a Poe creation, a noir inflected ethereal presence who warns of danger and vanishes into darkness. Another element of what makes All the President's Men so thrilling is the fact that all men are the President's, a notion captured in Pakula's reoccurring pull back of his camera into a distant bird's eye view, reducing the journalists to specks in a Washington labyrinth that consumes them. They're waging a war against a dangerous, evil force which has them surrounded, a truly scary proposition.\n \nIt all makes us appreciate the tenacity of our battlers. In the end All the President's Men is most effective as a taut love letter to the tireless work of two men who never gave up on the truth. What Pakula and Goldman offer us are two working stiff heroes with an insatiable hunger, who like the filmmakers themselves, never underestimated the power of the smallest detail. It's a portrait which brings clarity to the near impossibility of dredging up morality in a changed America, and it brings clarity to the amazing bravery required for the task.     \n          \n         \nIf you enjoyed reading this, please head over to https://filmfracas.wordpress.com for more.",
            "review_date": "2016-07-25",
            "source": "rt"
        },
        {
            "content": "This is a great political film that everyone should see. This film is still relevant to what is happening with our corrupt federal government today",
            "review_date": "2016-07-21",
            "source": "rt"
        },
        {
            "content": "Hoffman + Redford = magic",
            "review_date": "2016-07-06",
            "source": "rt"
        },
        {
            "content": "It should be known that it has a very surprising vocabulary for a less-than-R film, but this is still a very important piece of filmmaking that covers a thoroughly truthful and fearless investigation into one of the biggest conspiracies in US history.",
            "review_date": "2016-06-30",
            "source": "rt"
        },
        {
            "content": "Todo un clásico del género conspiranoico paradojamente basado muy fielmente en los hechos reales del Watergate. Todos los hombres del Presidente destaca no solo por el hecho de contar con dos grandísimos actores liderando la película con una gran química entre ellos, o por tener un fantástico, sino también por tener una puesta en escena y realización muy típica de los 70, que transmite una sensación de documental/realidad que casa perfectamente con el tono de la película.\n\nSoy os gusta el género periodístico esta es de obligada visión.",
            "review_date": "2016-06-19",
            "source": "rt"
        },
        {
            "content": "Two reporters uncover the Watergate conspiracy in this docudrama that delivers great performances despite a lackluster plot.",
            "review_date": "2016-06-13",
            "source": "rt"
        },
        {
            "content": "I can see why this was or is a highly regarded movie, but watching it for the first time in 2016, I was disappointed in it. The filmmaking was a bit rough in places. But I definitely see the influence this film and director Alan J. Pakula had on filmmaking for decades after its release. 2015's Best Picture winner Spotlight is definitely a modern stylistic brother to this film, but it is far superior in almost every way to me. From the writing to the performances to the technicals. I think Pakula's work and style vastly improved with Presumed Innocent, Consenting Adults and The Pelican Brief in the 1990s.",
            "review_date": "2016-06-06",
            "source": "rt"
        },
        {
            "content": "Quite an engrossing account of the reporters who broke the Watergate scandal wide-open, this film has a remarkable sense of the humanness of interactions, and a minimalist style serves the authenticity well. An informative and engaging film that provides insights into both human vices and mistakes that led to the scandal, as well as the courage and doggedness required to break the story.",
            "review_date": "2016-05-28",
            "source": "rt"
        },
        {
            "content": "A tensely drawn-out look at a newspaper's investigation into the biggest scandal in American politics.",
            "review_date": "2016-05-27",
            "source": "rt"
        },
        {
            "content": "A solidly crafted suspense with great performances all around, All The President's Men is a milestone on the journalism genre that relies on its striking real-life events.",
            "review_date": "2016-05-24",
            "source": "rt"
        },
        {
            "content": "All the Presidents Men is a film based on the Watergate scandal from the perspective of the reporters who broke the story. With Robert Redford and Dustin Hoffman as the leads, the film remains interesting because we can relate to their plight. But watching interview after interview (and more so a large group of people who refused to be interview) does not make for interesting entertainment. Like most history, I took the information, just with little enjoyment.",
            "review_date": "2016-05-16",
            "source": "rt"
        },
        {
            "content": "Filmado quase que em meio à crise que conta, Pakula constrói um dos grandes filmes sobre jornalismo, contando com elenco de altíssima qualidade.",
            "review_date": "2016-05-15",
            "source": "rt"
        },
        {
            "content": "Who knew a movie about the investigative process into Watergate would be sooooo boring. Two hours of typing, phone calls, interviews with people saying they won't talk..  ugh. They should have got Jack Bauer on the case, it would have made it a lot more interesting.",
            "review_date": "2016-04-19",
            "source": "rt"
        },
        {
            "content": "Great performances by Redford and Hoffman. A must watch!!",
            "review_date": "2016-04-09",
            "source": "rt"
        },
        {
            "content": "I've seen this movie three times - the first time, I was too close to the book to appreciate the film. But years later, it is a gripping film with wonderful performances. It is an inspiring and demoralizing tale about dogged courage and perseverance.  In the days of NSA and PACs, it is more important of a film than ever about the importance of independent and credible newspapers.",
            "review_date": "2016-03-22",
            "source": "rt"
        },
        {
            "content": "The classic investigative story -- important. Great performance by Robert Redford.",
            "review_date": "2016-02-11",
            "source": "rt"
        },
        {
            "content": "The third film in Alan Pakula's 'paranoia trilogy', this measured, naturalistic look at the breaking of Watergate might disappoint those looking for a more action-packed thriller. But it's a remarkable film and its unmannered style serves the subject matter well. Based on Woodward and Bernstein's own account, and released just two years after Richard Nixon's resignation, the film has become inextricably linked with Watergate itself. For many people, Redford and Hoffman ARE Woodward and Bernstein. Such is the power of  Hollywood to instantly mythologize the American past. William Goldman's taut screenplay deservedly won an Oscar and the acting and cinematography is excellent throughout. Like Oliver Stone's Nixon, which looks at Watergate from the other side, It can be hard to follow if you don't already know the basics of the scandal and the names of the various characters involved. Alternatively, you can forget about all that, and simply be borne along by the performances. It's a great film and the you can see its fingerprints all over later biopics, such as Spotlight from 2015.",
            "review_date": "2016-01-29",
            "source": "rt"
        },
        {
            "content": "A thrilling look at the Watergate scandal, on behalf of the hungry Redford and Hoffman duo. Should have been a touch more frightful.",
            "review_date": "2016-01-14",
            "source": "rt"
        },
        {
            "content": "The chemistry between Redford and Hoffman is very appealing.",
            "review_date": "2016-01-11",
            "source": "rt"
        },
        {
            "content": "A film more for politicos and those who incorrectly believe that journalism can change the world than for those interested in an exhilarating procedural.",
            "review_date": "2015-12-20",
            "source": "rt"
        },
        {
            "content": "I can't figure out what we've got.\n\nTwo Washington Post reporters uncover a money laundering scheme the president uses to persuade key political figures to buy his way into office.  The people who know how it works feels they are being watched closely and their lives and family are at risk.  It will be near impossible to get anyone to talk, but the legendary deep throat gives them just enough information to talk to the right people follow the smoke to uncover the fire.\n\n\"When you handed out the money, how was it handled?\"\n\"Badly.\"\n\nAlan Pakula, director of Klute, The Pelican's Brief, The Devil's Own, Orphans, Rollover, Sophie's Choice, The Parallax View, and Dream Lover, delivers All the President's Men.  The storyline for this picture is very interesting and well told.  The characters and situations are well portrayed and delivered.  The cast delivers excellent performances and includes Dustin Hoffman, Robert Redford, Jack Warden, Ned Beatty, Hal Holbrook, and Martin Balsam.\n\n\"The police are nervous.\"\n\nI DVR'd this off cable not too long ago.  This was a bit long but does a great job portraying the events of Water Gate.  Overall, this isn't an epic masterpiece that belongs in your DVD collection, but is a substantial picture about American history that is a must see due to the historical significance.  I recommend seeing this once.  \n\n\"If you fuck up again I'm going to get mad.\"\n\nGrade: B",
            "review_date": "2015-12-03",
            "source": "rt"
        },
        {
            "content": "I happen to find the Watergate scandal fascinating. Not that I am the master of all things Watergate and Nixon, but I have read a good number of books on the subject of Watergate and Nixon himself. Including the book that this movie is based on. I was not alive when this was all happening, in fact I probably was not even a though at this point in my parents mind. But for someone who got into reading about history, specifically this topic as they got a little older to have a movie to watch about it is just an added bonus. Everyone knows most of the details behind Watergate, how could a movie about newspaper reporters investigating it be any good ? Well, its not just good, its incredible. I am in the minority of course when I say this, but I never really was a big Dustin Hoffman fan, I like a few of his movies here and there, but I honestly feel he is a tad overrated. But not in this film. Both Hoffman and Redford who play the newspaper reporters do an excellent job. Although you already know the outcome of the movie, it is still exciting and tense. Almost to the point of making All the Presidents Men a thriller in some aspects. Sometimes a history teacher in school will put on a movie, some lame PBS Documentary on whatever subject they happen to be teaching about. Well there are plenty of good films that do justice to history as well, this is one of them. All The Presidents Men not only shows the unbelievable job these two reporters did with this story and how they basically risked everything to uncover what was going on. But it also brings us back to a time when journalism was at its peak. I know my father being a former journalist for 30 years was greatly influenced by these two men. And I know it influenced an entire generation of journalist. These days journalism is all but dead, real journalism that is. Everyone is on twitter and has their own blog, and there is rarely any true investigative groundbreaking reporting. This is a great movie, give it a watch, and you may also learn something as well.",
            "review_date": "2015-12-03",
            "source": "rt"
        },
        {
            "content": "I happen to find the Watergate scandal fascinating.  Not that I am the master of all things Watergate and Nixon, but I have read a good number of books on the subject of Watergate and Nixon himself.  Including the book that this movie is based on.  I was not alive when this was all happening, in fact I probably was not even a though at this point in my parents mind.  But for someone who got into reading about history, specifically this topic as they got a little older to have a movie to watch about it is just an added bonus.  Everyone knows most of the details behind Watergate, how could a movie about newspaper reporters investigating it be any good ? Well, its not just good, its incredible.  I am in the minority of course when I say this, but I never really was a big Dustin Hoffman fan, I like a few of his movies here and there, but I honestly feel he is a tad overrated.  But not in this film.  Both Hoffman and Redford who play the newspaper reporters do an excellent job.  Although you already know the outcome of the movie, it is still exciting and tense.  Almost to the point of making All the Presidents Men a thriller in some aspects.  Sometimes a history teacher in school will put on a movie, some lame PBS Documentary on whatever subject they happen to be teaching about.  Well there are plenty of good films that do justice to history as well, this is one of them.  All The Presidents Men not only shows the unbelievable job these two reporters did with this story and how they basically risked everything to uncover what was going on.  But it also brings us back to a time when journalism was at its peak.  I know my father being a former journalist for 30 years was greatly influenced by these two men.  And I know it influenced an entire generation of journalist.  These days journalism is all but dead, real journalism that is.  Everyone is on twitter and has their own blog, and there is rarely any true investigative groundbreaking reporting.  This is a great movie, give it a watch, and you may also learn something as well.",
            "review_date": "2015-12-01",
            "source": "rt"
        },
        {
            "content": "Even if the story of Watergate itself wasn't as interesting as it is, this film would probably be just as good.  All the President's Men is a fascinating portrait of how two men took down a president.  But more importantly, it really captures the chaotic life of an investigative journalist.  The story is obviously devastating for many people across America, but by far the best part about this film is watching the events unfold in a unique way through Alan Pukula's directing.  So much of films now in days take and are inspired from this movie.\n\nCentered around Carl Bernstein and Bob Woodward, who were for all intents and purposes two of the most important men in the history of American journalism, but also ironically some of the only people who dared even go near the Watergate Scandal.  The film can get confusing sometimes with all the dozens of names that are thrown around and who's working for who or who is telling the truth, but that's why the film works.  Not only does it keep you on the edge of your seat even when we all know the ending, but you find yourself raising your eyebrows at events that seem absolutely unreasonable.\n\nIt won the Oscar for best screenplay which is fine, but I think it's a crime Pukula didn't win for directing.  I think Pukula took what is probably a great book, and enhanced it significantly.  The screenplay is solid, but it's the camera angles, editing, and acting that take the film to the next level.  It's a rare film in which I'm more interested in how it was made over the actual story the film is based on.\n\nAside from the great technical aspects, it's interesting to watch Dustin Hoffman and Robert Redford's performances change over the course of the film.  Hoffman is evidently more aggressive than Redord, but as the story takes it's many turns and tensions arise, the roles are reversed.  As a writer myself, it was just very interesting to watch the tactics each writer used in order to get information.  All the President's Men has a great story, performances, and many other things, but I was most impressed with the technical side of this film.\n\n+Directing\n\n+Camera angles, long takes\n\n+Role reversal with the two writers\n\n8.5/10",
            "review_date": "2015-11-19",
            "source": "rt"
        },
        {
            "content": "Excellent movie. Hoffman and Redford make a great team. Based on the true life story of events surrounding the impeachment of President Nixon. If you're in the mood for a realistic political drama, this one is excellent.",
            "review_date": "2015-11-11",
            "source": "rt"
        },
        {
            "content": "Some people ventured, actually forced the opinion upon the general populance, that any further actions against Prsident Nixon would destroy the \"fabric of society.\" It should be understood that the fabric of society is meant to be those who are foisting the whole concept upon whoever will or will not listen by the medium of industrial mass communications and that any further actions against Nixon would have resulted in those promoting the fabric concept themselves being arrested.\nBasically, All the President's Men renews the concept that Robert Redford could have a second career as a male model and Dustin Hoffman is a schlub destined for limited romantic roles.",
            "review_date": "2015-11-02",
            "source": "rt"
        },
        {
            "content": "What is investigative journalism? \"All the president's men\" give us a clear picture. Maybe the film could seem a little untidy, but it should be the way like journalist do their work. Great political thriller.",
            "review_date": "2015-10-09",
            "source": "rt"
        },
        {
            "content": "Great re-telling of the Watergate scandal and the story of two men who brought the entire country to a standstill. Does justice to the book and all the work that Bob Woodward and Carl Bernstein did",
            "review_date": "2015-09-26",
            "source": "rt"
        },
        {
            "content": "For the past couple months I've been obsessed with the 70's. Nixon and Watergate especially. Thanks to the tapes, I've heard Nixon's side of the story. His paranoia and his vindictive attacks on his perceived enemies by abusing his power are astounding to listen to. He was a criminal President who didn't hesitate to use government agencies to exact revenge and spy on civilians. Craziest of all, this could have all stayed a secret from the nation. Nixon had been getting away with his tax fraud and surveillance for years before Watergate exposed him. We only know all this stuff now because of the journalists who doggedly pursued what seemed like a minor story to begin with. Well, this movie is their story.\n\nIt isn't a documentary. It's a fast-paced drama with some editorial freedoms, but to see a movie released only a few years after the scandal tell the other side of the story is incredible! It's very well done. And it's \"period feel\" is authentic, which gives it a \"glimpse into the past\" feel. Overall, the story ends a little early for my tastes, but they did capture a great amount of the excitement around uncovering the Watergate scandal. I would have included more of the court events, like releasing the tapes, but the movie is great as-is. I'd watch it again.\n\nAlso, Redford is so very easy on the eyes. That doesn't hurt!",
            "review_date": "2015-08-25",
            "source": "rt"
        },
        {
            "content": "One of the 10 best films I've ever seen.",
            "review_date": "2015-08-05",
            "source": "rt"
        },
        {
            "content": "Dready, drab and dull. An important and oft-referenced moment in US history reduced to a boring film.",
            "review_date": "2015-07-21",
            "source": "rt"
        },
        {
            "content": "Excellent film, incredibly well-acted and believable. However the pacing is poor, the cinematography bizarre and the direction baffling.",
            "review_date": "2015-07-11",
            "source": "rt"
        },
        {
            "content": "Well made film, strong message still resonates today about free press.",
            "review_date": "2015-06-28",
            "source": "rt"
        },
        {
            "content": "Based on the true story of the journalist duo that pursued the truth behind what happened at the Watergate hotel, All the President's Men is like catnip to aspiring journalists.  \n\nBut this one feels more like a police procedural than that of crusading journalists relentlessly pursuing the truth along the lines of Walter and Hildy from \"His Girl Friday.\"   This one shows Woodward and Bernstein pursuing leads, getting doors shut in their faces and going down blind alleys in the quest for a story.  It also gives a hint of the frustration of waiting for things to come in, all while the ticking clock of deadline looms above.  \n\nAnd yet for all of that, the film is never dull.   A lot of the credit goes to director Alan J. Pakula and the script by William Goldman.  Even knowing how it all ends, it's still compelling to watch how it all unfolds. \n\nMy high school journalism teacher showed this to us in class over the course of several days.  Back then, we came away shocked that she'd be allowed to show us a movie that used the f-word this much.  This time around, I'm impressed by the acting, writing and directing.",
            "review_date": "2015-06-27",
            "source": "rt"
        },
        {
            "content": "A very well-crafted political drama/thriller about the Washington Post's uncovering of the Watergate scandal. I love it when a movie is mostly all talking and it still gets you so wrapped up in it, and that's what this movie's dialogue does. And it's made even better by the great cast and the tense direction by Alan J. Pakula, helping you feel the paranoia creeping into your mind like the characters as the movie goes on.",
            "review_date": "2015-06-27",
            "source": "rt"
        },
        {
            "content": "I feel like deep down I would absolutely love this movie but unfortunately I became too confused as it went on. Of course, that was the case with Zodiac too but now it's one of my favourites. So maybe I'll have to come back to this someday and pay more attention. It is excellently made however.",
            "review_date": "2015-06-22",
            "source": "rt"
        },
        {
            "content": "Quietly brilliant and subtly thrilling, \"All the President's Men\" is an expertly synthesized and acted dramatization of one of the greatest journalistic triumphs in American history. Among the many noble qualities of the film, its dedication to veracity is its most notable; there are no obvious cinematic tricks or embellishments employed to overstate what's already profoundly interesting material. It's a gripping condemnation of political/journalistic inbreeding and the reliance on conventional wisdom and a championing of truth that stands among the best works of American cinema in that it speaks to our faults and points out our successes in righting those wrongs, the system of checks and balances working thanks to constituent oversight.",
            "review_date": "2015-05-26",
            "source": "rt"
        },
        {
            "content": "This is my favorite political thriller. It's so much fun watching Redford and Hoffman exchange dialogue and follow the clues. When I was younger I was a fan of the X-Files so Deep Throat was a highlight for me. But Redford and Hoffman really steal the show. They're on fire. Next time there's a Superman reboot they should check out this film to inspire Lois and Clark.",
            "review_date": "2015-03-25",
            "source": "rt"
        },
        {
            "content": "A classic whodunit that will keep you guessing until the end.",
            "review_date": "2015-03-21",
            "source": "rt"
        },
        {
            "content": "55%\nAll the President's men writes off a commited cast and a riveting premise over a lethargic pacing and an absolute lack of energy. It's workmanlike execution makes it extremely boring and it's greatest disadvantage is that only those people who know about the events clearly would be able to comprehend it.",
            "review_date": "2015-03-20",
            "source": "rt"
        },
        {
            "content": "This is a true classic film.  Only my 2nd time seeing ti, so well made.  Hoffman and Redford are great.  Anyone who hasn't seen this needs to seek it out!",
            "review_date": "2015-03-07",
            "source": "rt"
        },
        {
            "content": "One of the top three best films about Journalism.",
            "review_date": "2015-03-05",
            "source": "rt"
        },
        {
            "content": "The perfect political thriller.",
            "review_date": "2015-03-02",
            "source": "rt"
        },
        {
            "content": "Hot-blooded Carl & super-cool Bob join forces to write about a little burglary and inadvertently destroy a President in this tight political thriller.",
            "review_date": "2015-02-23",
            "source": "rt"
        },
        {
            "content": "Finally got this off my list. Excellent game of cover-up and intrigue in the times not so far away. truth is much much more entertaining than fiction. And once more, Robert Redford and Dustin Hoffman. They should do more films, while they sell can!",
            "review_date": "2015-02-15",
            "source": "rt"
        },
        {
            "content": "My favorite movie of all time!  The direction is outstanding.   The tension sizzles.  Great story telling.",
            "review_date": "2015-02-12",
            "source": "rt"
        },
        {
            "content": "Somebody like Oliver Stone would've made this a more visually precise film.  It's very hard to keep track of all the names and not made cinematically, but more theatrically.  This is a great piece of writing from William Goldman with some solid and some poor directing choices by Pakula.  I don't care for this use of his split focus in most cases.  The best use of this is near the end of the film as Nixon is inaugurated for his second term on TV left frame FG while right frame BG Woodstein work at their desks.  There are some tremendous dollies in the office, including one that moves across the entire room to the elevator where Robards is about to leave, but Woodstein have the info on the fifth name Haldeman.\n\nThere's a desperation to make the film feel more grounded in reality to make up for the stupid decisions of the alleged hitmen that is more real world than we'd accept in the cinema.  Having a conversation that reveals someone's whereabouts with a woman inside the antagonizing Washington Post office is pretty stupid, but in the real world, where paranoia doesn't have us acting as cleverly as a movie character, this is not uncommon.  But I would've liked to see the direction reflect that paranoia, something more frenetically paced, distorted.\n\nGreat performances all around, very grounded and realistic - I especially love Jason Robards as the owner of the paper, a tricky part that involves just the right balance of antagonism and protagonism.",
            "review_date": "2015-01-31",
            "source": "rt"
        },
        {
            "content": "Robert Redford and Dustin Hoffman have an amazing chemistry onscreen as the movie around them displays incredible restraint and relies on brains to get its highs rather than shocks. Full review later.",
            "review_date": "2015-01-29",
            "source": "rt"
        },
        {
            "content": "You want to know about the investigative journalism?? Why not watch this masterpiece???",
            "review_date": "2015-01-12",
            "source": "rt"
        },
        {
            "content": "A truly gripping detective story despite the fact that about 70% of the movie involves men talking on the phone, it's over 2 1/2 hours long and almost everybody knows how it ends.  There's a few reasons for this.  All of the central performances are strong.  Alan J. Pakula was at the height of his directorial powers.  The material is incredibly strong.",
            "review_date": "2014-12-28",
            "source": "rt"
        },
        {
            "content": "Makes you want to be a journalist.",
            "review_date": "2014-12-11",
            "source": "rt"
        },
        {
            "content": "Highly effective political thriller that benefits from strong performances and a potent script that explores the fascinating rides journalists may take.",
            "review_date": "2014-12-06",
            "source": "rt"
        },
        {
            "content": "Very interesting and informational.",
            "review_date": "2014-12-02",
            "source": "rt"
        },
        {
            "content": "I found it hard to really care about anything. Watergate is a fascinating subject but my god this is boring",
            "review_date": "2014-11-30",
            "source": "rt"
        },
        {
            "content": "It wasn't hard to see how meticulous All the President's Men's story was regarding governmental corruption and political conspiracies.  Centered around two reporters who exposed the Watergate scandal, this is a well acted and interesting thriller.  However, I felt its running time was overlong and being someone completely uninterested in politics, I found myself bored in many parts and distracted easily.  It's not a bad movie whatsoever and Redford/Hoffman work well off each other, but its subject matter simply isn't my cup of tea.",
            "review_date": "2014-11-30",
            "source": "rt"
        },
        {
            "content": "The topic and importance of this movie is huge. Shows not only the dogged and brave solid work of the great journalists, but the intimidation and corruption of power during that time. Good acting and chemistry btw the two main characters. What I didn't like was it was pretty slow and confusing with all the name throwing and fast talking. I'm into politics and history and even I was like is this going somewhere at times, come on speed up or do something other than interviewing the same damn thing! That being said even though it dragged at times, it did drive home that they were so persistent. Instead of getting discouraged, the secrecy pushes them further thankfully. I can't believe this happened in our history, just embarrassing and worse than I thought! No wonder Nixon was impeached!",
            "review_date": "2014-11-20",
            "source": "rt"
        },
        {
            "content": "First rate political thriller that remains one of the standards of the genre, thanks to a non-flashy approach & surprisingly non-partisan take.  All the actors give excellent performances but never show-boat.  The late, great Jason Robards is particularly superb as legendary Post editor, Ben Bradlee, playing him as a newsman who know Woodward & Bernstein are onto a big story but wants to make sure they get it right.  Behind the camera, Pakula's direction & Goldman's writing keeps the story straight-forward, focusing the non-glamorous aspects of investigating reporting, pounding the pavement & making endless phone calls.  Most notably, the film is political but not partisan, never specifically implicating Nixon & even pointing out many in the administration thought they were doing the right thing (at one point, even Woodward admits he's a Republican).  The only flaw is an abrupt & rather anti-climatic ending that fits with history but leaves you a bit unsatisfied.  Nevertheless, one of the best political thrillers ever made.",
            "review_date": "2014-11-16",
            "source": "rt"
        },
        {
            "content": "The two main actors are two icons of the period, the story caused a great scandal at the time and is considered one of the breaking point in the American history. The film is directed well, but it's too long by far! I just arrived to the end only because I was curious by I surely lost connection with it during all its lasting.",
            "review_date": "2014-11-06",
            "source": "rt"
        },
        {
            "content": "It is really an awesome film that based on the true story\nand the story just make u don't know what's gonna happen next",
            "review_date": "2014-11-02",
            "source": "rt"
        },
        {
            "content": "In a day and age when TMZ arguably does some of the media's best investigative reporting - All the President' Men is a reminder of how important good journalism is to our society.  Democracy doesn't work if there isn't a free press that is allowed to report on the inner working of power.\nThe story itself is a bit cumbersome and at times feels a bit complicated.  But even with a partial understanding of the events surrounding Watergate the story still manages to create some tension and drama.  Also its worth just watching Hoffman and Redford act. They are certainly masters of their craft.",
            "review_date": "2014-10-28",
            "source": "rt"
        },
        {
            "content": "This is the classic film about Woodward and Bernstein, the Washington Post reporters who uncovered the conspiracy behind Watergate. I must say, the movie is presented expertly. The visuals are great, and the set design is spot on. I feel like I'm back in the 70s. They even go so far as to accentuate out-dated technology like the rotary phones and typewriters. It's amazing how much tension and excitement the director was able to create from phone conversations and awkward face-to-face meetings. This perfectly helps the viewer understand how much of a struggle these guys went through just trying to get information from a plethora of witnesses who were too afraid to say anything. I enjoy the idea of watching two reporters piecing together a puzzle little by little, it taught me about this moment in history and got me interested in researching it more. They do a good job of focusing the story on Woodward & Bernstein and how this news report is affecting their reputation with their colleagues.\n\nThe acting is superb in All the President's Men. I'm always impressed with Robert Redford and Dustin Hoffman, and they don't disappoint at all in this movie. It works well that they have very distinctly different personalities, and yet we see them learning to work together and appreciate one another's strengths. So, you must be asking yourself why my rating is not near perfection if I loved everything about the story. It's quite simple...I HATED the ending. You see, when Woodward has his final conversation with Deep Throat they raise the stakes. He implies that this conspiracy reaches even higher than they expected, and their lives may be in danger. This is classic movie magic, you increase the danger in order to increase the tension. Now I'm even more invested and excited about how these guys will get the rest of this story despite the danger, and then the movie just ends. We are given nothing but audio of some news reports and a few headlines typed on screen so we can read about everything else that happened. I literally hit rewind on the DVD thinking I missed something, or somehow an entire chapter was skipped. Imagine my irritation when I found that it does just end on that note, leaving the audience hanging. Such a disappointment after a very strong film. I'd still recommend it for someone curious about Watergate, but that ending left such a sour taste in my mouth that I don't know if I'll ever watch it again.",
            "review_date": "2014-10-03",
            "source": "rt"
        },
        {
            "content": "\"All The President's Men\" es una de las mejores películas de periodismo y uno de los mejores thrillers políticos en la historia del cine.  La química entre Dustin Hoffman y Robert Redford, quienes interpretan a los reporteros Woodward y Bernstein que destaparon el escándalo de Watergate es espectacular y este recuento de hechos verídicos lo pondrá al borde de la silla sin necesidad de recursos pirotécnicos.",
            "review_date": "2014-09-28",
            "source": "rt"
        },
        {
            "content": "A bit boring at times, but pretty good.",
            "review_date": "2014-09-09",
            "source": "rt"
        },
        {
            "content": "A remarkable film on the Watergate Scandal, thanks to Pakula's great direction and great performance from the whole cast.",
            "review_date": "2014-09-06",
            "source": "rt"
        },
        {
            "content": "Despite being based on political scandal with a well known conclusion, All the President's men is a deft and compelling thriller with the ability to keep it's viewers on the edge of their seats thanks to taut direction and solid performances from it's two well matched leads.",
            "review_date": "2014-08-29",
            "source": "rt"
        },
        {
            "content": "One of the best films I've ever seen, strangely enough.",
            "review_date": "2014-08-10",
            "source": "rt"
        },
        {
            "content": "Yes, it's a very observant piece on the journalist's methods, it's very informative, and it has a degree of intrigue, but that doesn't necessarily mean it makes for good cinema. All the President's Men may be solidly performed and solidly directed, though it's incredibly dry, straight forward, and a bit dull.",
            "review_date": "2014-08-03",
            "source": "rt"
        },
        {
            "content": "A powerful and often tense history lesson, Pakula's 'Men' is a gripping 70s gem.",
            "review_date": "2014-07-05",
            "source": "rt"
        },
        {
            "content": "A very smart film, well crafted... but in the end, I really couldn't care less; it's too long and becomes dull.",
            "review_date": "2014-06-19",
            "source": "rt"
        },
        {
            "content": "\"I'm tired of your chickenshit games.  I don't want hints.  I need to know what you know.\" Bob Woodward (Robert Redford), a rookie journalist of the Washington Post, exclaims in frustration.  Speaking to the infamous source \"Deep Throat\", Woodward has just about had it, along with colleague Carl Bernstein (Dustin Hoffman).  The two have been determined to uncover what we now know as the Watergate Scandal, and after a flurry of false leads, double-crosses, and vague communication, it's a story that could arrive with much gusto and alarm - it's a story that could propel them to journalism stardom in a flash and rip the dishonest Richard Nixon out of office.  They are frantic, and so are we.\n\t\"All the President's Men\" is now 38 years old, but it still holds the same power it did back in 1976.  When the facts came on display, it was a bold headline, jarring Americans everywhere.  Most of us don't realize exactly how long and how hard many journalists worked simply to tell the world that Richard Nixon is not a man you want in office - by the time the film is over, Woodward and Bernstein's triumphant findings are not only a landmark, but a showcasing of enduring patience that most would eventually give up over.\n\tJournalism today isn't the same as it was in the '70s, now that we can blog, use the assets of social media, and even more depressingly, glittery headlines with celebrities names stamped across them bring more attention than even the most important revelations about higher issues.  Woodward and Bernstein lived in a time where you had to find the phone numbers of leads, go to their houses to interview them, and jot down their quotes, while today we can simply email a person of interest in just a few minutes.  The pair of journalists have doors slammed in their faces, an uninterested public, and possible whistleblowers that would rather not talk to contend with.  \n\tThe film is two-hours and 18 minutes, a reminder that \"All the President's Men\" isn't a regular political thriller, one that states the facts so fervently that we're constantly remember that this mystery took years to solve, not just a few days.  Pakula directs with patience that is covered in thickly spread tension - there are plenty of moments where we can feel the goodness of an aha moment that is felt by the reporters, with only seconds later finding that it's just another key to the puzzle and not a complete resolution.  The film is full of these disappointments, only reminding us that this isn't simply a product of Hollywood lure, but an absorbing piece of non-fiction.\n\tRobert Redford and Dustin Hoffman, two of film's biggest names, may be starring, but \"All the President's Men\" isn't merely a vehicle.  There are no love interests, no big-budgeted side steps; Redford and Hoffman transform from movie stars into average people on a mission in seconds.  Jane Alexander portrays a woman who has been silenced by her employers, fraught with guilt, showing us the side of the individuals who were told not to talk, frightened for their life if they do so.  Hashbrook's shadowed and enigmatic portrayal of \"Deep Throat\" gives the film the blackened, stone-cold question mark of a character that gives the mystery even more juice than it had before.\n\tIt seems nearly impossible to write a review for \"All the President's Men\", because there are so few movies that move along and speak for themselves with such clarity and believability.  It's a gold mine of everything it takes to be a film for the ages, and to anyone who hasn't seen it, it's a must.",
            "review_date": "2014-05-18",
            "source": "rt"
        },
        {
            "content": "A raiz del escándalo de Watergate y la investigación que surge a raíz de ese momento. Dos periodistas Bob Woodward (Robert Redford) y Carl Bernstein (Dustin Hoffman) iniciarán su propia investigación en pos de encontrar la verdad y a todos los implicados en un caso que va más allá de la irrupción en la sede del partido demócrata y que un simple robo, sino que resultò tener serias connotaciones políticas que determinaron al salida de Nixon del poder. Con la ayuda de un informante secreto conocido como 'Deep Throat' (Garganta Profunda), lograrán llegar a la verdad de uno de los casos de corrupción más mediáticos de la política norteamericana",
            "review_date": "2014-05-11",
            "source": "rt"
        },
        {
            "content": "Though hard to follow at times, it is nonetheless gripping and intriguing.",
            "review_date": "2014-04-26",
            "source": "rt"
        },
        {
            "content": "Though hard to follow at times, it is nonetheless gripping and intriguing.",
            "review_date": "2014-04-26",
            "source": "rt"
        },
        {
            "content": "exceptional movie loved this the whole way.   dustin Hoffman and Robert Redford were amazing classic classic film",
            "review_date": "2014-04-16",
            "source": "rt"
        },
        {
            "content": "Perfectly cast, highly entertaining drama. Not quite as good as 'Frost/Nixon,' but it's certainly not too far off.",
            "review_date": "2014-04-14",
            "source": "rt"
        },
        {
            "content": "William Goldman, Dustin Hoffman, AND Robert Redford? It doesn't get better and this film is an absolute masterpiece.",
            "review_date": "2014-04-13",
            "source": "rt"
        },
        {
            "content": "It's best as a study on print journalism, rather than a history lesson on such a complicated, baffling scandal.",
            "review_date": "2014-04-11",
            "source": "rt"
        },
        {
            "content": "Intelligent political thriller that also portrays in convincing fashion, newsrooms, and the world of investigative journalism.",
            "review_date": "2014-03-28",
            "source": "rt"
        },
        {
            "content": "Crafted very well like how those journalists crafted the story, while exclusively for this kind of crafting in film is the solid acting but may've been hard to follow, with a requirement to have another viewing to understand the really good political drama better. (A-)\n\n(Full review coming soon)",
            "review_date": "2014-03-23",
            "source": "rt"
        },
        {
            "content": "If so much as half of this film is true, than Woodward and Bernstein are legends for a reason.",
            "review_date": "2014-03-23",
            "source": "rt"
        },
        {
            "content": "All the President's Men (Alan Pakula, 1976)\n[originally posted 19Feb2001]\n\nWe have met the enemy, and they is more ours than we realized they was. Pakula's fact-based look at the way Woodward (Robert Redford) and Bernstein (Dustin Hoffman) uncovered the story behind the Watergate break-in is a classic piece of filmmaking that's influenced almost every, if not every, piece of film and television dealing with journalism that's come since in America. Most, thankfully, are a little more coherent than this, but the confusion factor doesn't make All the President's Men any less a film.\n\nMuch of what allows All the President's Men to straddle the line between confusing mush and classic\nfilmmaking is in that everpresent devil, the details. Want an example? The main theme of the film is that words are weapons; the unforgettable opening sequence, in which the typewriterkeys strike the paper with seemingly epic force, is the result of mixing whip and shotgun sounds with the actual sounds of typewriter keys. Now that's attention to detail, folks. As well, Pakula never allows the story to stray from the straight and narrow. Woodward and Bernstein remain the focus throughout, and while some minor characters get enough screen time to be memorable (Jason Robards' performance as Ben Bradlee garnered him a very well-deserved Best Supporting Actor oscar), we don't need to know who they all are; their function in the film is solely to either funnel information to, or keep information from getting to, Woodward and Bernstein. We don't need to know anything else about them. It adds a little kick to know trivial details, such as the guy playing Frank Wills (the security guard who discovers the break-in initially) actually was the late Frank Wills, but it's not necessary to comprehend the story of what started as a routine newspaper article about a hotel burglary and ended up being a series of articles that won the Pulitzer Prize, changed the face of political reporting in America, and incidentally saved Bob Woodward's job at the Washington Post. ***  1/2",
            "review_date": "2014-03-03",
            "source": "rt"
        },
        {
            "content": "All the President's Men has good acting, a solid story, and is accurate to the real events.",
            "review_date": "2014-03-01",
            "source": "rt"
        },
        {
            "content": "Learned so much about Watergate.",
            "review_date": "2014-02-10",
            "source": "rt"
        },
        {
            "content": "Altri tempi; ormai, ingiudicabile: un classico.",
            "review_date": "2014-02-04",
            "source": "rt"
        },
        {
            "content": "A fantastic and flawless film, Redford and Hoffman work together to discover the real story of the Watergate scandal in the early 1970's. If you are a history or political junkie you will especially enjoy this masterpiece.",
            "review_date": "2014-02-04",
            "source": "rt"
        },
        {
            "content": "A sharp, solidly acted thriller that investigates arguably the biggest political scandal of all time. A political thriller that follows the two Washington Post reporters that uncovered Watergate, while watching this film it is hard to believe that these events actually happened.",
            "review_date": "2014-01-28",
            "source": "rt"
        },
        {
            "content": "\"All the President's Men\" is a very gripping drama film surrounding the Watergate scandal, that may move along too slowly for modern audiences, but is well worth the effort for those willing to sit through the film.\n\nFeaturing powerful performances from the cast, led by producer Robert Redford and his co-star Dustin Hoffman, as Bob Woodward and Carl Bernstein respectively, \"All the President's Men\" offers a strong insight into both the political climate at the time in the USA, and also the mechanics of the press at the time.\n\nA classic film.",
            "review_date": "2014-01-24",
            "source": "rt"
        },
        {
            "content": "rápida, intrigante, con recursos acotados y al mismo tiempo muy norteamericana",
            "review_date": "2014-01-23",
            "source": "rt"
        },
        {
            "content": "as far as journalism films go, this one is a classic. Truly shares the story of the risks a journalist goes through and the excitement of having a lead, and being a part of something that is bigger then you!\n\nwas great. both actors were superb and I see my self watching this again.   would totally recommend for anyone looking for a good classic",
            "review_date": "2014-01-05",
            "source": "rt"
        },
        {
            "content": "Smartly written by the brilliant, William Goldman, and featuring wonderful performances from its cast, this is a wonderful film that is as equally entertaining as it is intelligent.",
            "review_date": "2013-12-29",
            "source": "rt"
        },
        {
            "content": "I've never really fully understood the Watergate Scandal. It's not I don't want to, it's I have never found myself fully understanding why it happened and who were involved and how. It's been confusing for me, and when people discuss Watergate I never find myself in a place to add any comment. Now, with my viewing of All The President's Men, I think I do understand. Don't get me wrong, if someone asked me to explain Watergate to them, I would tell them I'm not the right guy to ask about it. If I honestly had to say something, though, I'd say that Watergate was uncovered by great journalism and truth and stubbornness and hard-work from two amazing American journalists: Bob Woodward and Carl Bernstein. I will never forget these two men's names, for they are forever etched into my head. With nicknames like \"Woodstein\" and with ferociously fun quotes thrown out from these characters in the film, it's hard to forget who these guys were. The film makes me feel like I might understand Watergate now, but it moved a bit to fast with the names and moved from place to place with purpose, but also with confusion at times. It goes to show Watergate was never fully understood by these reporters for months, never fully understand by the public still, and I never fully understood it either. It's one of America's largest screw-ups, something many people have heard about but do not know about. And although this film does it's best to show the audience what it's about, it's hard to truly understand what went behind all the commotion of the Watergate scandal. But it makes one heck of a good movie.\r\n\r\n   All The President's Men is a 1976 political thriller directed by Alan J. Pakula and written by William Goldman. IT stars Robert Redford, Dustin Hoffman, Hal Holbrook, Jack Warden, Jane Alexander, and Jason Robards. Redford and Hoffman play two investigative journalists working at The Washington Post. Redford plays Bob Woodward, a young, determined reporter with a passion for hard work and not giving up. He is thrown upon the job to investigate the Watergate Scandal with his co-worker, Carl Bernstein. Bernstein is played by Dustin Hoffman, whom at the time was well known for such films as The Graduate and Midnight Cowboy. Hoffman, who may quickly become one of my favorite actors, gives a great performance here. Redford and Hoffman's chemistry works well, and Redford gives a strong, determined performance as Woodward, and it shows no fault. Hoffman keeps up the \"cool guy\" feel throughout the film, and his hair adds much more to it. At first, the film felt like a Redford film, but not much. Slowly, though, it improved to become a side-by-side, duo partnership extravaganza, keeping a real partnership. At times, though, I felt a bit disconnected from the two and the two from each other. They worked together throughout the entire film and become strong partners, but it's hard to tell if they became \"friends\". They did, it's very well possible, and I can see it in the film, but the two discussed mostly only facts and opinions about the case, and not much about each other. The character development here was a draw back, for I did not learn much of either throughout the film, and while it kept the audience rooting, it couldn't keep me from caring much about these guys as personally as I would've. If not for their work to uncover Watergate and their familiar faces, I would not have cared much at all for either Bernstein or Woodward for I didn't anything about them personally and who they were outside of their work life. I'm not sure if this was from the acting, but Hoffman and Redford's chemistry both worked well, and I enjoyed them greatly. Jason Robards also starred in this film, and as I watched him in the movie, I thought to myself 'He could have been nominated for an Oscar.\" And sure enough, he had won the Best Supporting Actor Oscar. He absolutely deserved it as well, though, for his portrayal of a newspaper executive was the most hard and full performance in the film. All the other characters were pushed on by either mystery, need, desire, or progress, but Robards's character did not need these characteristics throughout the film to push him in the movie. Winning the Oscar the same year \"Network\" was released, Robards beat his way through tough competition and won the Oscar. I enjoyed him in his only other film I've seen him in, Once Upon a Time in the West, and seeing his change in character from that one to this was great and I enjoyed it. Robards to me brought a different character to the film that it needed, and he added life to it, not more investigation. The rest of the cast did well, such as Jane Alexander playing a startled and worried woman who has been thrown into the Watergate scandal. She was nominated for a Best Supporting Actress Oscar, and while I don't think it was to memorable to get the Oscar, it was a fine performance. Hal Halbrook and others play other mysterious characters, and a lot went into the casting of this film. And in total, the casting was actually made very well.\r\n\r\n   Alan J. Pakula directed this film. And he directed other directors through this film, as well. One of the firs things I noticed about the direction of the film was how it must have greatly inspired one of my all time favorite directors David Fincher. The way the cameras moved through the journalist and writing tables was very much how it moved through films such as Zodiac and The Social Network. The direction truly was ahead of it's time, for if not for the seventies style of acting, I would've believed the film was made in the late eighties or nineties. Pakula uses not only excellent track shots through the journalists desks, but he also uses aerial shots, pans, excellent lighting to shroud actors, and much more. This film inspires many films today, for not only did the plot and acting change inspire many films, but the cinematography and the use of focus and zoom and many other cinematic tricks that films use today originated from this movie, and it shows all these achievements well. I had never heard of Pakula, though, before this film. Maybe his name sounded familiar, but I never heard of any great films from him, and whenever I heard of All The President's Men his name  never came up. It's a shame, for Pakula gave some fantastic direction in this film, and if not for the competition filled year of 1976, I'm sure Pakula would've won the Best Director Oscar. He  is very underrated and very under the radar, but if anything, he should be remembered for his work in this film. It is some work  that is hard to be rivaled.\r\n\r\n   All The President's Men is adapted from a book of the same name, written by Bob Woodward and Carl Bernstein. William Goldman took that book and wrote it the best he could to the film. I have never read the book, so I have no comment on the accuracy, but the writing in All The President's Men was real good, whether it was adapted well or not. The writing throws facts after facts after facts at you, which deterred from the character development, but it kept these facts coming at a steady pace. The memorable dialogue and quick-response dialogue show true through these characters, especially through Jason Robard's character. His lines are furious, hard, and well-written, and whatever he says on screen really mattered. To keep a plot like All The President's Men aligned, and to show everything that could've been shown about this long reaching scandal was difficult, and the viewer had to stay intact and listening to catch everything. The Watergate Scandal proves to be one of America's dark moments of the nineteenth century, and Goldman does a good job of keeping it in mystery throughout, slowly building it up to what the public fully realized in the seventies. One hardship of the writing, though, was the names and the confusion. At times, the film got a little to fast to keep up with, and many names and titles were thrown around. The audience could not keep up with all them, and although Goldman did good in rounding the plot up here and there through the movie, his screenplay was the weakest part of the film. Woodward and Bernstein went a little to fast themselves with the uncovering of the investigation, causing them to lose track and stumble here and there, therefor causing the viewers to lose track and stumble as well. It was something that could've been fixed if Goldman relaxed and let the audience watch and understand the film play out, instead of making them listen hard and struggle to keep up. Richard Nixon, though, resigned a mere two years prior to this films release, as well, so Goldman had a lot of work to do to uphold a film with a recent conflict such as Watergate. But Goldman, despite his pace and bulk in writing, took the recent events of Watergate, and made them timeless through his writing.\r\n\r\n   All The President's Men came off to be a work of precision and good film. Redford and Hoffman worked together along with the rest of the cast to show the audience how journalists changed not only news, but the nation itself. The cast showed strong integrity and likeness throughout the film, despite lack of character development at times, and some of the cast also kept the film up and honest. Alan J. Pakula's direction should not go a missed, as it was strong and solid, only at times did it waver. His direction through the movie inspires many directors today, as he works with audience to keep them the way Woodward and Bernstein felt throughout the unfolding of the scandal. Woodstein would feel frustrated, and so would the audience. They'd feel relieved, and so would the audience. Pakula does this as well as paves the way for different directing work for many films to come, such as the use of aerial shots, focus, and much, much more. Alan J. Pakula directed ahead of his time, and at the same time bringing out a plot in a movie at it's time. Goldman writes well, only writing difficultly for the audience to keep up with at times, but his use of dialogue and facts in the movie keeps the film from going off track and keeping the film in focus of the bigger picture. Watergate was a long, hard difficult event to unfold, eventually resulting in one of America's largest embarrassments. From the break in to the hotel, to the resigning of Nixon, the audience sees how it all happens from the brilliant work of two investigative journalists. Pakula shows he can work a problem and mold it into a film so everyone can see how the problem truly came to light. And whether it be through film, through reporting, through word of mouth, or through public disapproval, it's hard to truly understand all of Watergate. But the people behind this film didn't find it to hard to still let the audience know that something like this did happen, and bring justice to the facts in which it was unraveled. It can almost make someone happy that it did happen. 8/10.\r\n\r\nAnd please, if you are interested in hearing my thoughts or listening me talk more about this film, check out my podcast! The Hostile Monkey Movies Podcast is every Sunday, so listen to the previous ones and check out this weeks for my thoughts on some other great films out there: http://hostilemonkeymovies.podomatic.com \r\nAnd like our facebook page too at facebook.com/hostilemonkeyentertainment",
            "review_date": "2013-11-28",
            "source": "rt"
        },
        {
            "content": "Set during the times of the Watergate scandal, All the President's Men (1976) follows the investigative reporting exploits of Washington Post journalists, Bob Woodward and Carl Bernstein.  Based on the true story of both men exposing the White House in the Watergate scandal, the actors and script kept tight suspense throughout the entire movie.  Director Alan J. Pakula who was known for his conspiracy films (The Parallax View, 1974) makes the film seem as real as possible.  The audience gets to see every single detail of the reporting process and this has the viewer really wanting both of these journalists to expose the corrupt government.  Beyond this is the significance of the film that has turned it into a classic.  It is the best portrayal of American journalism in American film.  There are other films that come to mind that represent the power of journalism (Mr. Smith Goes to Washington, 1939 and The Man who shot Liberty Valance, 1962, just to name a couple) but All the President's men looks in depth at what effort journalists need to exert when exercising this power.  The chemistry between Hoffman and Redford in the movie is perhaps its greatest strength and the scripts twists and turns help keep viewers on the edge of their seat the whole movie.  And while cinematography might not seem important in this movie, the camera work is great especially in scenes that involve Woodward talking to deep throat in the shadowy garage.  All the President's men is a intense, investigative thriller that not only entertains, but educates audiences on the importance and effect of the media in America.",
            "review_date": "2013-11-27",
            "source": "rt"
        },
        {
            "content": "Despite knowing the ending, this movie is an edge-of-your-seat thriller that never lets up. Well written, well cast and well directed!",
            "review_date": "2013-11-21",
            "source": "rt"
        },
        {
            "content": "Great one! Loved Hoffman and Redford. Obviously loved the journalism aspect of it. Great movie!",
            "review_date": "2013-11-15",
            "source": "rt"
        },
        {
            "content": "While not quite as shocking as when first released,  it's still a great historical drama - and an insight on investigative journalism in the pre-internet years.  How can budding reporters think of a search engine as snooping when it can only reveal what someone else has entered into the world-wide-web?",
            "review_date": "2013-11-13",
            "source": "rt"
        },
        {
            "content": "This movie left me speechless. A gripping true political and social story, told so well and so effectively.",
            "review_date": "2013-10-20",
            "source": "rt"
        },
        {
            "content": "An excellent, and very well-done political film.",
            "review_date": "2013-10-19",
            "source": "rt"
        },
        {
            "content": "True, intense, dedicated filmmaking right there.",
            "review_date": "2013-10-18",
            "source": "rt"
        },
        {
            "content": "The story itself is great, but the plot lacked punch; events became a bit repetitive and the climax didn't quite work. Picture of the period is convincing, as they really knew how to portray 70s in the 70s.",
            "review_date": "2013-09-29",
            "source": "rt"
        },
        {
            "content": "Very detailed and complex look at the Watergate scandal. One of my favorite \"based on a true story\" movies.",
            "review_date": "2013-09-26",
            "source": "rt"
        },
        {
            "content": "The real-life story of the Washington Post's exposé on the Watergate scandal is filmed as tense, strongly acted appraisal of the freedom of press and the perils of unimpeded political power.",
            "review_date": "2013-09-16",
            "source": "rt"
        },
        {
            "content": "Solide. J'en aurais voulu plus.",
            "review_date": "2013-09-07",
            "source": "rt"
        },
        {
            "content": "All the President's Men is one of the most acclaimed films of its time for being a depiction of the lead up to the Watergate scandal at a time when people had been truly shocked by the ordeal. So for a person with a large curiosity towards Watergate which had not been answered by many other films such as Oliver Stone's Nixon which really should have considering that it was a Richard Nixon biopic, I had hopes to really learn a lot from All the President's Men. And with a cast containing both Dustin Hoffman and Robert Redford, it was simply a political thriller that I could not miss.\n\nThe issues that source from All the President's Men are the usual ones of a political thriller, being that the film maintains a slow pace over an extended period of time and is reliant more on talking that anything else to explain the story and the important meaning behind the effect it had on the world. So audiences who, like me, have not learned to adapt to the very theoretical nature of political thrillers may fail to find themselves immersed in the story of All the President's Men.\nAlso, the film suffers the same troubles that The Manchurian Candidate does today by being dated and featuring a story which would make a significantly stronger imact in its own time, or more appropriately in America where the story is more likely to be drilled into the brains of every High School Student for generations.\nAlso, All the President's Men can't decide whether it should be a film which maintains the large scale which reveals the impact of the Watergate scandal on the protagonists and the wider world or a character drama which reveals just the challenge it was for protagonists Carl Berlstein and Bob Woodward to bring forth a story that changed the world. It fails to truly find a balance and ends up dwindling between the two without settling on one or succeeding as both.  It's hard to connect to the film because the importance is more in the story than the characters, but it's also hard to feel the impact of the Watergate scandal since the emphasis is placed on the characters more than anything, so unfortunately I have to say that Alan J. Pakula's direction on All The President's Men is not some of his finest and fails to tie together enough of the story for it to truly seep into the minds of viewers.\nMuch like Robert Redford's 2007 political drama film Lions for Lambs, All the President's Men felt to me to be a rather distant film which felt like a series of lectures one after the other which never really reached the scale that it aimed for. Unfortunately though, All the President's Men deals with the truth in the story of Watergate escaping to the public from the people who know the truth, so the story is significantly more important. Yet still its scale feels all too small and it doesn't feel like there is ever energy in the development of the film. The atmosphere feels blank and lacking in the tension that should be there, and the only time I ever really felt something was when there was a musical score there to benefit the film. Unfortunately it barely ever makes an appearance when it could have made All the President's Men, and this is bad because it shows to make an impact when it is actually present.\nWhile the story does succeed as a visual depiction of the events leading up to revealing the Watergate fiasco and the true story of Carl Berlstein and Bob Woodward as they changed the world, it doesn't really feel like it captures the essence of the impact they made it essentially reduces the story to the level of office politics. The scale of the film is too small for a historical event in which the scale and impact was so big, and so in my opinion All the President's Men was simply an overlong slow bore which I learned nothing from. Even though it was a well scripted one.\nBut I can say that I appreciated the acting in the film.\nRobert Redford's lead performance is a powerful which is full of all the necessary tension in his facial gestures and line delivery, as well as a real tenacious look of promise to succeed in changing the world for the better. As Bob Woodward, Robert Redford embodies the role with a political passion and makes the film better. His ability to engage with the complex political universe and the people within it comes naturally to him, so his performance is a beneficial one for All the President's Men.\nDustin Hoffman is always going to be one of my all-time favourite actors, and while I didn't enjoy All the President's Men too much there is no denying the strength in his performance which makes him an amiable and friendly lead when he tackles the role of Carl Berlstein. I was a little disappointed that he didn't enter the film for a slightly long period of time, but he still did a good job.  His chemistry with Robert Redford is one of the key highlights of the film as they have a combination of determination and dedication put into both their roles make the film a more compelling effort in terms of its character drama, even though the film doesn't deliver as much as it should.\nHal Holbrook has to face a challenging role, simply because at the time the film was created the identity of \"Deep Throats\" had not been identified and so his account of the character is unidentified, but Hal Holbrook's successful characterisation of him has a certain grittiness andtense facial gestures reminiscent of Frank Sinatra in his prime. Hal Holbrook does a strongly effective job in the role.\nAnd Jason Robards' natural talent as an actor is easy to see in All the President's Men because whilst his screen time is small, is confidence and talent is large and so he is definitely a memorable sight in the film.\n\nSo All the President's Men will find minimal trouble appealing to Watergate aficionados and fans of political thrillers, but as neither of those I honestly can begrudgingly say that I did not find All the President's Men as insightful, intelligent, educational or entertaining as I really hoped to.",
            "review_date": "2013-09-04",
            "source": "rt"
        },
        {
            "content": "Watching this movie made me want to be a journalist.  The hustle and bustle of the newsroom.  This is an intriguing story of how Nixon was brought down and how investigative journalism was done a generation ago.  Now it really doesn't exist in the traditional sense which makes this movie an unintentional commentary about how lame our news media is today.",
            "review_date": "2013-08-09",
            "source": "rt"
        },
        {
            "content": "A good solid story.  I enjoyed Woodward and Bernstein's persistence and ways to get around people who wouldn't talk to them.",
            "review_date": "2013-08-01",
            "source": "rt"
        },
        {
            "content": "One of the greatest films I have ever seen. The tireless, tedius work of the two journalists show how the tireless search for truth is essential in the democratic system. Iconic scenes and the perfect chemistry between the gifted actors make a memorable experience, catapulted into movie history by the fact that it's rooted in real-life events.",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "Forty years after the fact, Watergate's still fascinating.",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "Thrilling and well directed, acted, and produced.\nThis movie is a masterpiece.",
            "review_date": "2013-07-18",
            "source": "rt"
        },
        {
            "content": "I really really enjoyed this move a lot. All the  President's Men had a very good screenplay and good actors for the part. While it's no Argo the movie is really good on a lot of scales. Never really gets boring either.",
            "review_date": "2013-07-15",
            "source": "rt"
        },
        {
            "content": "Hoffman, and Redford manage to pull off one heck of a superb movie.",
            "review_date": "2013-07-07",
            "source": "rt"
        },
        {
            "content": "Nixon falled down in hell forever!",
            "review_date": "2013-07-06",
            "source": "rt"
        },
        {
            "content": "One of the best screenplays of the last fifty years. William Goldman is a master. Like Zero Dark Thirty in that it remains suspenseful even though the eventual outcome is well-known.",
            "review_date": "2013-06-24",
            "source": "rt"
        },
        {
            "content": "Without a doubt, the best journalistic thriller ever.",
            "review_date": "2013-06-14",
            "source": "rt"
        },
        {
            "content": "One of the best journalism films ever made. Every general journalist should aspire to act like Bernstein and Woodward and how they were so investigative and determined to discover the truth with every little fact they could pick up on the way.\n\nA great point that was made in the end is that news becomes old news very quickly or at least people stop talking about it or it would no longer be the water cooler topic of discussion.\n\nI need to see this movie again, to get a better feel for it overall and also because I dozed off a bit. I'm sorry.\n\nAll the President's Men, I give you a 90%.",
            "review_date": "2013-05-29",
            "source": "rt"
        },
        {
            "content": "Redford and Hoffman in a conspiracy film which is a classic.",
            "review_date": "2013-05-20",
            "source": "rt"
        },
        {
            "content": "Equally as exciting as the correlating Wikipedia entries.",
            "review_date": "2013-05-04",
            "source": "rt"
        },
        {
            "content": "It's filmed really well and the actor's do a really good job but warning, it's a really slow movie",
            "review_date": "2013-05-01",
            "source": "rt"
        },
        {
            "content": "Compelling and great!!!!",
            "review_date": "2013-04-29",
            "source": "rt"
        },
        {
            "content": "If you loved this movie- read the book. They only did the first half of the book for the movie, but they did it so well it feels like reading the script.",
            "review_date": "2013-04-05",
            "source": "rt"
        },
        {
            "content": "With hollywood heavyweights and personal heroes Robert Redford and Dustin Hoffman giving more than fantastic performances, great subtle and ingenious direction and a meticulous, thrilling and gripping screenplay filled with excellent dialogue. All The President's Men is a showcase of 70s filmmaking, and a powerhouse political thriller in every aspect of it. A great true story is a memorable movie with so many memorable moments in it, I won't forget this movie. It's a near masterpiece if not a masterpiece.",
            "review_date": "2013-04-02",
            "source": "rt"
        },
        {
            "content": "carefully paced info dumping character piece",
            "review_date": "2013-04-01",
            "source": "rt"
        },
        {
            "content": "Can watch this over and over and over,... and I do!",
            "review_date": "2013-03-30",
            "source": "rt"
        },
        {
            "content": "Redford and Hoffman make a terrific team in \"All the President's Men\"-- perhaps the best, most insightful film about the journalistic process ever made. William Goldman's script is top notch, the cinematography and sound design are excellent, and the supporting cast (Robards, Holbrook, Alexander) are superb. A true classic.",
            "review_date": "2013-03-20",
            "source": "rt"
        },
        {
            "content": "DifÃ­cil de seguir si no se tiene mayor conocimiento sobre los involucrados en el caso.  De todas maneras es bien interesante de ver, Dustin Hoffman fue lo que mÃ¡s me gustÃ³.",
            "review_date": "2013-03-13",
            "source": "rt"
        },
        {
            "content": "Tight and taut, with a directing style that turns on a dime to fit  the nuances and flow of the story.",
            "review_date": "2013-03-10",
            "source": "rt"
        },
        {
            "content": "An absolute classic, All the President's Men features phenomenal acting from both Dustin Hoffman and Robert Redford, great direction, and fantastic writing. Incredibly intense, it manages to be both dramatic and thrilling. Well-paced and  feeling nowhere near its two and a half hour length, this one is incredibly captivating. Well deserving of its status as a classic.",
            "review_date": "2013-03-04",
            "source": "rt"
        },
        {
            "content": "I never tire of watching this .It pulls you in from the start and keeps hold of you..Redford and Hoffman utterly believable .",
            "review_date": "2013-02-25",
            "source": "rt"
        },
        {
            "content": "A classic story about discovering the truth and damning politics forever. It's a golden bonus that we get Hoffman and Redford as the leads.",
            "review_date": "2013-02-17",
            "source": "rt"
        },
        {
            "content": "Starring Robert Redford and Dustin Hoffman, this political thriller follows two young investigative journalists as they try to uncover the truth after a mysterious break in at the Watergate Hotel. The Washington Post is the only paper covering the issue that many have dismissed as an isolated event. These two men try to follow all the leads they have but they reach a dead end since no one seems willing to talk. However, with the help of the anonymous source Deep Throat, tireless searching, and a few witnesses, the pieces begin to come together. Little do they know the extent of what they have happened upon. Ultimately, their story about Watergate would lead to the scandal that ended in Richard Nixon's resignation. This is not only an intriguing film, but it also holds tremendous historical importance.",
            "review_date": "2013-02-03",
            "source": "rt"
        },
        {
            "content": "Although it is a difficult film to sit through if you're not familiar with the details embedded in the Watergate scandal, it is still worth it for the performances alone, especially from Redford. That, and you might learn something as well.",
            "review_date": "2013-01-20",
            "source": "rt"
        },
        {
            "content": "1976 Oscar winner. The tension starts from the beginning of a true story. At stake is the Republic.  In this case, it wasn't fiction. Can be watched more than once, a mark of a great film.  Maybe not as thrilling today as it was released, but those that saw it then had to be shaken to their roots.\r\n\r\nReporters Woodward and Bernstein uncover the details of the Watergate scandal that leads to President Nixon's resignation.\r\n\r\n\r\nSee this fascinating clip which sums up my view:\r\n\r\nhttp://www.youtube.com/watch?v=FEdL1_zOyz4\r\n\r\nThe book that started it all:\r\n\r\n[img]https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcSGsPakmQuBokhaSGtns2hQ_2tObcM8ttloORMUOlyGNYENxH6R[/img]\r\n\r\n\r\n\r\n\r\nOther reviewers on RT:\r\n\r\n.....you have to be patient with this one - but worth it - they don't make them like this anymore.\r\n\r\n80%\r\nA smart, tautly-paced celebration of American journalism.\r\n\r\n100%\r\nMost of the time with films based on true stories, you find yourself engaged, but only because Hollywood is quietly pulling the strings and filtering .\r\n\r\n[img]https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcS9N_Xtyi2Wn1z0gaNiYsYR7HLAq1n1BzB-yABK47nSVf818dy77g[/img]\r\n\r\n100%\r\n The most important journalism movie ever made.\r\n\r\n\r\n\r\n90%\r\n Watching this movie made me want to be a journalist. The hustle and bustle of the newsroom. This is an intriguing story of how Nixon was brought down...\r\n\r\n100%\r\n Briliant Conspiracy Theory drama! This thriller is without any action scenes or rip-roaring fight sequences yet it helds your attention till the end. ...\r\n \r\n \r\n\r\nNOTES:   \r\n\r\n1   All the President's Men is a 1976 Academy Award-winning political thriller based on the 1974 non-fiction book of the same name by Bob Woodward and Carl Bernstein, the two journalists investigating the Watergate scandal for The Washington Post. The film starred Robert Redford and Dustin Hoffman as Woodward and Bernstein.\r\n\r\n[img]https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcQu1PyKkDi_0Zgxd_RwAbbX8aytCbGANxjVKEQC9f0LNjlBHfCZIg[/img]\r\n\r\n\r\n2   Dustin Hoffman and Redford visited the Washington Post newspaper offices for months, sitting in on news conferences and conducting research for their roles.\r\n\r\n3   The Post denied the production permission to shoot in its newsroom and so set designers took measurements of the newspaper's offices, photographed everything, and boxes of trash were gathered and transported to sets recreating the newsroom on two soundstages in Hollywood's Burbank Studios at a cost of $200,000.\r\n\r\n4     The filmmakers went to great lengths for accuracy and authenticity, including making replicas of phone books that were no longer in existence. Nearly 200 desks at $500 each were purchased from the same firm that sold desks to the Post in 1971. The desks were also colored the same precise shade of paint.\r\n\r\n[img]https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcQVptrjTTag8R6kANxhFRAkdaoVXe73ZXHKkn0d2O2SlH3cO5wD8w[/img]\r\n\r\n\r\n\r\nCast\r\n\r\nRobert Redford as Bob Woodward\r\nDustin Hoffman as Carl Bernstein\r\nJason Robards as Ben Bradlee\r\nJack Warden as Harry M. Rosenfeld\r\nHal Holbrook as \"Deep Throat\"\r\nJane Alexander as Judy Hoback\r\nMartin Balsam as Howard Simons\r\nMeredith Baxter as Debbie Sloan\r\nNed Beatty as Martin Dardis\r\nPolly Holliday as Dardis' secretary\r\nStephen Collins as Hugh W. Sloan, Jr.\r\nPenny Fuller as Sally Aiken\r\nRobert Walden as Donald Segretti\r\nFrank Wills as Himself\r\nF. Murray Abraham as Sgt. Paul Leeper\r\nDavid Arkin as Eugene Bachinski\r\nHenry Calvert as Bernard Barker\r\nDominic Chianese as Eugenio Martínez\r\nRon Hale as Frank Sturgis\r\nJames Karen as Hugh Sloan's lawyer\r\nBasil Hoffman as Assistant metro editor\r\n\r\n[img]https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcT4UTS5zz_hd55C-puoJpfWEbJzg6JhPoLTxTW9oBJGltwbSRum[/img]\r\n\r\n\r\nDirected by\tAlan J. Pakula\r\nProduced by\tWalter Coblenz\r\nScreenplay by\tWilliam Goldman\r\n\r\nBased on\tAll the President's Men by\r\nBob Woodward and Carl Bernstein\r\n\r\nMusic by\tDavid Shire\r\nCinematography\tGordon Willis\r\nEditing by\tRobert L. Wolfe\r\nStudio\tWildwood\r\nDistributed by\tWarner Bros.\r\n\r\n\r\n[img]https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcQZ2TAsM_gb8KKlX4SlVsWyiv6vzMRatGqPS55DoKF7Q9ZT1dKL[/img]\r\n\r\n\r\nRelease date(s)\t\r\nApril 9, 1976\r\n\r\nRunning time\t138 minutes\r\n\r\n\r\nBudget\t$8.5 million\r\nBox office\t$70,600,000 (United States)\r\n\r\n\r\n[img]https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcTBRMeDnpDnFrs_i8jCVzxKBygNzJKFx1M32qh_b7GqGuSwIJfo[/img]",
            "review_date": "2013-01-16",
            "source": "rt"
        },
        {
            "content": "gripping drama on the nixon scandal",
            "review_date": "2013-01-10",
            "source": "rt"
        },
        {
            "content": "A great film that manages to make a lot of people reading news and interviewing people interesting despite the fact that you already know how it ends. Made me want to be a journalist.",
            "review_date": "2013-01-04",
            "source": "rt"
        },
        {
            "content": "The most exciting, political thriller I have ever seen. Every minute, every dialogue always keep you at the edge of your seat. Robert Redford and Dustin Hoffman are the perfect duo to tackle and investigate the Watergate scandal. They share perfect chemistry with each other. \"All the President's Men\" is a film that everyone should witness.",
            "review_date": "2013-01-04",
            "source": "rt"
        },
        {
            "content": "Hoffman and Redford are both great, and while it's a very dialogue heavy movie, it kept my attention.",
            "review_date": "2012-12-30",
            "source": "rt"
        },
        {
            "content": "Redford and Hoffman incredible acting duo, transport you to the very heat of the 70s Washington Big Government",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "History put onto film.",
            "review_date": "2012-12-28",
            "source": "rt"
        },
        {
            "content": "A great movie that shows what journalism is all about, it is more than a political movie, it is a movie that is compelling and suspenseful, a must see for everyone!!",
            "review_date": "2012-12-27",
            "source": "rt"
        },
        {
            "content": "Good movie!\nhttp://en.wikipedia.org/wiki/Watergate_scandal",
            "review_date": "2012-12-24",
            "source": "rt"
        },
        {
            "content": "The heralded classic about the Watergate scandal is a riveting journalistic thriller.  This is probably one of the best films on journalism, and the impact it could have, that has ever been made.  Dustin Hoffman and Robert Redford are nearly perfect as Carl Bernstein and Bob Woodward.  They risk their reputations and perhaps lives in uncovering the Watergate scandal.  I love the long, lonely shots in this movie of big newsrooms and empty parking garage lots. The tone and pacing really suck the audience in.  A great film!",
            "review_date": "2012-12-22",
            "source": "rt"
        },
        {
            "content": "Most of the time with films based on true stories, you find yourself engaged, but only because Hollywood is quietly pulling the strings and filtering out all the extraneous detail that separates boring fact from exciting fiction. This is not one of those movies. All the President's Men is so riveting, pinpoint-accurate and endlessly watchable that it has become as referenced over time by those wanting to understand the Watergate scandal as any novel, archival footage or living witness. Dustin Hoffman and Robert Redford join forces to spawn one of the greatest detective teams in film history, and the razor-edged writing earns its Oscar less than halfway in. Perfect journalism, meet perfect filmmaking.",
            "review_date": "2012-12-17",
            "source": "rt"
        },
        {
            "content": "They don't make movies like they used to. This movie is a prime example of the use of silence and pausing to think.",
            "review_date": "2012-12-14",
            "source": "rt"
        },
        {
            "content": "One of the best of all time! The small segment of people who won't like this movie are the ones who can't let a great story be the action in place of things blowing up.",
            "review_date": "2012-12-08",
            "source": "rt"
        },
        {
            "content": "Briliant Conspiracy Theory drama! This thriller is without any action scenes or rip-roaring fight sequences yet it helds your attention till the end. One of the best I have ever seen!",
            "review_date": "2012-12-07",
            "source": "rt"
        },
        {
            "content": "All the President's Men is an immense disappointment. It has its moments, it is well filmed and well acted, but it is also incredibly boring from beginning to end, it is difficult to follow because it assumes that you already know this story and it is never a thriller because it never has anything intense or exciting in it whatsoever. It is such an overrated film.",
            "review_date": "2012-12-03",
            "source": "rt"
        },
        {
            "content": "a well written and absolutely fascinating journalist story of how the Watergate break in went from strange crime to national issue. with great suspense, pacing and well placed spurts of humor, along with legendary performances from \"Hoffman Redford and Robards, along with a great supporting cast, this is a journalism nerd's holy grail of a movie",
            "review_date": "2012-11-22",
            "source": "rt"
        },
        {
            "content": "En seg men väldigt intressant och välgjord film.",
            "review_date": "2012-11-22",
            "source": "rt"
        },
        {
            "content": "This movie doesn't need my review to solidify its stance as one of, if not the, greatest films about journalism.  I did enjoy it though.",
            "review_date": "2012-11-21",
            "source": "rt"
        },
        {
            "content": "I must say that while I was definitely expecting something very good, it exceeded my expectations. Excellent film that has aged well. What's amazing is that the outcome is known before you watch the film, yet it doesn't detract from the palpable tension and suspense. I also love how it takes you from wanting to find out the mystery of a press story to fearing for the main characters lives. Great transition that can only be pulled off in one hell of a tight screenplay. Not to mention the great cinematography going on in the picture. Every element works together very well. Dustin Hoffman (damn, he was a great actor) and Robert Redford were brilliant, not to mention an incredibly solid supporting cast, and nice directorial touches. Pakula's film is a perfect example of a director (similar to Sidney Lumet) who without any flashy direction, but a simple, subtle and well-coordinated approach makes a great film.",
            "review_date": "2012-11-20",
            "source": "rt"
        },
        {
            "content": "Un film di spionaggio giornalistico basato su quel susseguirsi di vicende che dallo scandalo watergate portarono alle dimissioni di Nixon. Il tutto ricostruito in maniera pulita e minuziosa con ottimi attori e buone invenzioni registiche. Bella la scena in cui alle immagine televisive del giuramento di Nixon per la sua rielezione con i cannoni celebrativi, viene contrapposto il suono delle macchine da scrivere dei giornalisti che rimbombano come una mitragliatrice e saranno destinate a modificare così gli eventi.",
            "review_date": "2012-11-16",
            "source": "rt"
        },
        {
            "content": "Haven't seen a movie this good in a long time. The script, music, atmosphere, acting. Everything was a perfection.",
            "review_date": "2012-11-10",
            "source": "rt"
        },
        {
            "content": "Certainly an interesting subject matter with a good script and excellent acting.  The problem is that the directing of the movie fails to create the tension that should be building over the course of the movie.  Now this is just personal preference, but it is my belief that proper music helps to set the tone for a movie, but in this instance the director chose to have almost no music.  And most of the music that was used seemed a bit off.  A small compliant, but I felt it had a huge effect on the movie.  Plus, I felt that it ended somewhat abruptly.  Choosing when to end this story I'm sure was difficult, but it seemed to stop at the height of it's drama.  Still, it is entertaining and, more importantly, very imformative.",
            "review_date": "2012-11-09",
            "source": "rt"
        },
        {
            "content": "Yes, we can be set on the edge of our seats by a thriller where we know exactly what is the outcome, and that shows the artistry of everybody involved.",
            "review_date": "2012-11-03",
            "source": "rt"
        },
        {
            "content": "Great suspense, great pacing and plotting, masterful direction and photography that all leads to... what? \nThe abrupt ending to end all abrupt endings. No arrests made, no courtroom indictments... okay, maybe that means no cliches, but... just to have no ending at all? A fantastic political drama with one of the worst conclusions ever. Still worth seeing though.",
            "review_date": "2012-11-01",
            "source": "rt"
        },
        {
            "content": "The film deals with the Watergate Scandal. If you are interested in today's history, this could be a good chance to learn it.",
            "review_date": "2012-11-01",
            "source": "rt"
        },
        {
            "content": "One of the smartest political movie i've seen with outstanding performances.",
            "review_date": "2012-11-01",
            "source": "rt"
        },
        {
            "content": "A portrait of a time long gone.  This could never happen today and that is sad.  But this is an important movie about exposing Nixon's corruption.",
            "review_date": "2012-10-31",
            "source": "rt"
        },
        {
            "content": "Intense screenplay/script. The entire cast shines.",
            "review_date": "2012-10-29",
            "source": "rt"
        },
        {
            "content": "The measuring stick against which all political thrillers ought to be meaured, this film set the bar also for the investigative journalist procedural!!! A touchy subject at the time, this story of how the Watergate scandal came to prominence is so engrossing & captivating from beginning to end with its strong direction & superb script. Featuring two of Hollywood's finest ever leads at their peak & a great supporting cast, this is nothing short of an undisputed classic & a fine example of great 70s cinema!!!",
            "review_date": "2012-10-29",
            "source": "rt"
        },
        {
            "content": "A classic. No review needed. Just see it...",
            "review_date": "2012-10-26",
            "source": "rt"
        },
        {
            "content": "well crafted and acted political thriller still holds up well",
            "review_date": "2012-10-24",
            "source": "rt"
        },
        {
            "content": "Brilliant movie. A must watch.",
            "review_date": "2012-10-21",
            "source": "rt"
        },
        {
            "content": "Great movie, a classic, gripping from the beginning to the end. Very few fiction films have been this suspenseful and more remarkably it was all true!!",
            "review_date": "2012-10-16",
            "source": "rt"
        },
        {
            "content": "How amazing is it to take such a potentially boring subject as the Watergate scandal and turn it into a brillant thriller.  I always find myself on the edge of my seat as they continue their investigation.  Great cast, direction, and dialouge.  Recommend it all around.",
            "review_date": "2012-10-15",
            "source": "rt"
        },
        {
            "content": "1993's Schindler's List Is My Fifth Favorite Film Of All Time.",
            "review_date": "2012-10-05",
            "source": "rt"
        },
        {
            "content": "Det Ã¤r nÃ¥got speciellt med Robert Redford...\n... och bra Journalistik",
            "review_date": "2012-09-30",
            "source": "rt"
        },
        {
            "content": "Good stuff, but the film-to-DVD transfer sucked.",
            "review_date": "2012-09-29",
            "source": "rt"
        },
        {
            "content": "A smart, tautly-paced celebration of American journalism.",
            "review_date": "2012-09-29",
            "source": "rt"
        },
        {
            "content": "Awesome picture has a riveting script and awesome chemistry between Redford and Hoffman. Supporting performaces of Robards and Holbrook also add to this historical take on the Watergate Scandal.",
            "review_date": "2012-09-17",
            "source": "rt"
        },
        {
            "content": "★★★★ (out of four)\r\n\r\nWonderfully adaptation of the book by the journalists who investigated and broke the story of Watergate.  Though the events are true, it plays like a thrilling investigative drama that surprises and shines despite knowing the eventual outcome.\r\n\r\nOne of history's biggest news events, the Watergate breakin captivated the media and brought down a president, causing the first and only resignation by a commander-in-chief.\r\n\r\nDirected by Alan Pakula, the parts of the Washington Post journalist are played by Robert Redford as Woodward and Dustin Hoffman as Bernstein.  Everyone should know the story, but if you don't...shame on you.\r\n\r\nThrough their investigation and the aid of an informant, known as Deep Throat, their pieces uncovered the breaking into of the Democratic National Headquarters which ultimately led back to President Nixon.\r\n\r\nThe subject matter is interesting, but the movie is more than just the event.  The writing is sharp and the performances are right on the mark.\r\n\r\n[IMG]http://img.photobucket.com/albums/v48/Zeppo1/AllthePresidentsMen.jpg[/IMG]",
            "review_date": "2012-09-09",
            "source": "rt"
        },
        {
            "content": "this is an actor's movie, just to see Redford & Hoffman in their prime play off each other is worth watching...",
            "review_date": "2012-09-07",
            "source": "rt"
        },
        {
            "content": "The first time, I have managed to watch this film the whole through. It is a very absorbing movie. I particuarly enjoyed Jason Robards as editor Ben Bradley. They do the end particulalrly well, with the teleprinter (remember them?) giving news updates.",
            "review_date": "2012-09-03",
            "source": "rt"
        },
        {
            "content": "Classic piece of history in compression mode. \nHow wonderful a movie could be when it swallows you entirely to the end. This movie sure made inspiration to many would be investigative journalism and it sure made the world better place.",
            "review_date": "2012-08-31",
            "source": "rt"
        },
        {
            "content": "History's biggest scandal!\n\nBased on the real-life story of the two reporters who wouldn't give up on the story of the Watergate break-in, ALL THE PRESIDENT'S MEN is as gripping as any detective novel. Producer/star Redford was so intent on authenticity that he even flew actual garbage from the Washington Post wastepaper baskets out to the set. The movie does a good job of showing how much of the work of the reporters was dull persistence, and it also does a good job of showing us what went in to the decisions of editor Ben Bradlee (Jason Robards, in an Oscar-winning performance) and publisher Katharine Graham about what they needed in terms of proof in order to be able to publish the story.",
            "review_date": "2012-08-29",
            "source": "rt"
        },
        {
            "content": "This is my favorite Redford film and my favorite Hoffman film. It's almost my favorite film. Every second is exciting and we are excited about a freaking news story. How dumb is that? I'm not sure why Robards got a supporting actor award for this because Hoffman and Redford really were the focal point of every second of this movie. Maybe it was the speech before the credits roll, I don't know.",
            "review_date": "2012-08-28",
            "source": "rt"
        },
        {
            "content": "Tittade till denna klassiker igen. Lysande in i minsta detalj, Redford och Hoffman briljerar, oavbrutet fÃ¤ngslande, made in the glorious 70's!",
            "review_date": "2012-08-16",
            "source": "rt"
        },
        {
            "content": "Wow this was impressive it grabbed ahold of my attention in the first five minutes and never let go! The movie is all dialog but the narrative is so tightly wound that I hardly realized 90% of the scenes are people sitting around talking. This is a very unique film and one of the best movies I've seen period.",
            "review_date": "2012-08-16",
            "source": "rt"
        },
        {
            "content": "Not only the movie brings light onto the Watergate scandal but also shows us how the media works. Robert Redford and Dustin Hoffman are perfectly casts as the journalists investigating the case.",
            "review_date": "2012-08-14",
            "source": "rt"
        },
        {
            "content": "did not care for it to much..",
            "review_date": "2012-08-13",
            "source": "rt"
        },
        {
            "content": "Thrilling, suspenseful and realistic narrative that puts two men on collision course against USA Most Powerful Man. Never seen something like this until Stone's JFK!!!!!",
            "review_date": "2012-08-13",
            "source": "rt"
        },
        {
            "content": "Great film. Emirates in-flight classics ftw! On the next leg, I'm thinking The Dirty Dozen.",
            "review_date": "2012-08-09",
            "source": "rt"
        },
        {
            "content": "Damn fine movie.  Yes mom!  Finally saw this one.",
            "review_date": "2012-08-06",
            "source": "rt"
        },
        {
            "content": "A solid insight into the journalistic world and a through examination of the real-life events that lead to president Nixon's resignation in the Watergate scandal. The pairing of Redford and Hoffman is right on the spot. It shows the great power of the free press and how hard it might sometimes be to cover up the dark truth.",
            "review_date": "2012-07-24",
            "source": "rt"
        },
        {
            "content": "This is sporadically compelling and in parts it is great, in fact Hoffman and Redford are great throughout, however there just doesn't seem to be enough story here to make for a great two and a half film.",
            "review_date": "2012-07-18",
            "source": "rt"
        },
        {
            "content": "The most important journalism movie ever made.",
            "review_date": "2012-07-17",
            "source": "rt"
        },
        {
            "content": "The movie depicted a triumphant journalism at its time but the Watergate issue doesn't interest me at all maybe I live on another generation.",
            "review_date": "2012-07-16",
            "source": "rt"
        },
        {
            "content": "Two words: Deep Throat!",
            "review_date": "2012-07-15",
            "source": "rt"
        },
        {
            "content": "When journalists actually made a difference in this Country.",
            "review_date": "2012-07-11",
            "source": "rt"
        },
        {
            "content": "One of the best movies ever",
            "review_date": "2012-06-30",
            "source": "rt"
        },
        {
            "content": "Directed by Alan J. Pakula, this film formed the third part of an unofficial trilogy on paranoia that Pakula started with Klute (1971) and The Parallax View (1974). Based on the book by journalists Bob Woodward and Carl Bernstein, adapted for film by William Goldman. It's a slow moving but well made and ultimately suspenseful film focusing on a few months which nearly compromised the American government. In June 1972, when five burglars are arrested for breaking into the Democratic National Committee headquarters at the Watergate Hotel in Washington. The Washington Post's editor Ben Bradlee (Jason Robards) assigns news reporter Bob Woodward (Robert Redford) to investigate why they did it, he learns that one of the arrested men James W. McCord, Jr. (Richard Herd) worked for the CIA, and that President Richard Nixon's Special Counsel Charles Colson, also has ties with the burglars. Bradlee assigns Carl Bernstein (Dustin Hoffman) to work with Woodward, and they work brilliantly together, but the complexity of the case makes it impossible to crack, but Woodward finds an anonymous source in \"Deep Throat\" (Hal Holbrook), who is able to help out. It's a good thriller, one where there's nary any action or murders, but it manages to be uncomfortable and intriguing. Hoffman and Redford play well off each other, and it captures the paranoid mood of America at the time. You can see where David Fincher got his inspiration for the look and feel of Zodiac (2007) from this.",
            "review_date": "2012-06-20",
            "source": "rt"
        },
        {
            "content": "BORRING. and so confusing. too many characters.",
            "review_date": "2012-06-15",
            "source": "rt"
        },
        {
            "content": "Dustin Hoffman steals the show...",
            "review_date": "2012-06-14",
            "source": "rt"
        },
        {
            "content": "great script! Terrific acting duo!",
            "review_date": "2012-06-01",
            "source": "rt"
        },
        {
            "content": "Thanks to David Fincher favorite movies list I came to know about this gem of a movie... Fincher have taken a clear inspiration from this movie in his feature \"Zodiac \".",
            "review_date": "2012-05-20",
            "source": "rt"
        },
        {
            "content": "Remarkable adaptation of Watergate case into a political thriller. Great cast, especially Robards as Ben Bradlee, and a powerful final scene that is a true statement on freedom of speech and public opinion power.",
            "review_date": "2012-05-13",
            "source": "rt"
        },
        {
            "content": "Brother Redford is awesome!",
            "review_date": "2012-05-02",
            "source": "rt"
        },
        {
            "content": "In the search for truth, sometimes we have to be willing to go the extra mile. Woodward and Bernstein, like countless other journalists around the world, even had to risk their lives in order to uncover the rotten eggs behind the facades shown by Nixon's presidential re-election team. They still went ahead despite the fact that even their sources were too afraid to have their names publicised (a condition that even attested more to how courageous the reporter duo were). Overall, an engaging political ride.",
            "review_date": "2012-05-01",
            "source": "rt"
        },
        {
            "content": "A film as well crafted and engaging as Robert Redford's hair.",
            "review_date": "2012-04-26",
            "source": "rt"
        },
        {
            "content": "Seeing two best actors of their time is just brilliant. Solving the political conspiracy ain't easy though! I'm happy I've finally found some time to watch this classic must see film.",
            "review_date": "2012-04-25",
            "source": "rt"
        },
        {
            "content": "This film is thrilling and addictive despite being a long, detailed recap of an actual US political event. Almost 40 years later, Watergate is recalled as a singular event, but this film educates us as to how deep and corrupt the scandal was. The story is told from the point of view of the two young and hungry Washington Post writers (Woodward and Bernstein) who broke the story. It is eye-opening how persistent the writers needed to be in order to break through the silence and corruption to nail a story the FBI was still trying to solve. Redford and Hoffman are great as Woodward and Bernstein because they not only epitomized the writersâ?? confidence and enthusiasm, but added enough charisma to make a political film entertaining. I also love the performances from Robards and Holbrook, who play a Washington Post senior editor and Deep Throat, respectively. I suggest not only watching to find out who was responsible and charged for the wrongdoing, but to enjoy the process that investigative journalists must go through (sources, confirmations, deadlines, etc.) to break their story.",
            "review_date": "2012-04-21",
            "source": "rt"
        },
        {
            "content": "Just short of the all time list...great acting, great plot...great suspense even though you know the outcome...",
            "review_date": "2012-04-19",
            "source": "rt"
        },
        {
            "content": "Historically accurate and well acted, this is definently a movie that every American should see.",
            "review_date": "2012-04-10",
            "source": "rt"
        },
        {
            "content": "Hoffman and Redford are magnificent as two rookie reporters sniffing out the biggest scandal in US history. It takes a special film to make an effective thriller out of a story to which everyone knows the ending. Near perfect.",
            "review_date": "2012-04-04",
            "source": "rt"
        },
        {
            "content": "Engrossing drama with brilliant performances from Dustin Hoffman and Robert Redford. The story may lose those who are unfamiliar with the Watergate scandal, but the superb direction and outstanding production values keep viewers absorbed throughout.",
            "review_date": "2012-04-04",
            "source": "rt"
        },
        {
            "content": "A movie that shows the first amendment in action and that the system did work!",
            "review_date": "2012-04-01",
            "source": "rt"
        },
        {
            "content": "Trata de mirar como se hacia periodismo hace 30 aÃ±os... no computadoras, no celulares, no internet... era una chamba alucinante",
            "review_date": "2012-03-30",
            "source": "rt"
        },
        {
            "content": "a fascinating true story that, while the audience knows how it will end, manages to stay suspenseful and keep you intrigued, partly thanks to it's lead performances from dustin hoffman and robert redford.",
            "review_date": "2012-03-27",
            "source": "rt"
        },
        {
            "content": "Well acted, well written, and intense, this classic is exactly that. Classic.",
            "review_date": "2012-03-19",
            "source": "rt"
        },
        {
            "content": "Brilliant tension. 627",
            "review_date": "2012-03-13",
            "source": "rt"
        },
        {
            "content": "A good film with a excellent cast.  As a journalism major, I appreciate the ethical questions involved throughout this investigation.  I feel like sometimes the film can be one-sided, but if this is what happened in real life w/o considerable dramatization, then it can't be helped.  One problem I have with this film is that it takes its time to tell the story--there's a lot of unnecessary shots and lengthy sequences of people just typing or walking to places.  Considering that this film is roughly 2 hours and 20 minutes long, I feel that sizeable portions of this film could have been shaved off.  Anyway, aside from that, I thought this was a good film.  Check it out if you're into dramas, or interested in journalism or the Watergate incident.",
            "review_date": "2012-03-08",
            "source": "rt"
        },
        {
            "content": "This is what filmmaking is all about",
            "review_date": "2012-02-29",
            "source": "rt"
        },
        {
            "content": "One of my all-time favourite movies.",
            "review_date": "2012-02-26",
            "source": "rt"
        },
        {
            "content": "Who'd have thought that a movie like this would be so damn good?",
            "review_date": "2012-02-25",
            "source": "rt"
        },
        {
            "content": "Must See! At times it looked like it might cost them their jobs, their reputations, and maybe even their lives.",
            "review_date": "2012-02-21",
            "source": "rt"
        },
        {
            "content": "it was slow at times for me.  however the theme and message behind the storyline was really good.",
            "review_date": "2012-02-20",
            "source": "rt"
        },
        {
            "content": "A truly wonderful film.",
            "review_date": "2012-02-19",
            "source": "rt"
        },
        {
            "content": "Les Hommes du Président est le testament parfait de son époque, un film si ancré dans les 70s qu'il pourrait dérouter plus d'un spectateur contemporain. Avec son rythme particulier, sa propension à privilégier les plans fixes pendant de longues minutes pour se laisser porter par la narration, son refus du happy end et son montage plusieurs fois abrupt (la fin tout particulièrement), le film d'Alan J. Pakula est un modèle du film de journalisme, porté par l'interprétation formidable du trio Robert Redford, Dustin Hoffman & Jason Robards. Entourés d'un casting de supporting roles formidables, ils rendent hommage à un script qui fait la part belle au réalisme quasi documentaire. Les Hommes du Président est parfois trop lent pour son propre bien et parfois un peu dépassé, il n'en demeure pas moins un film remarquable.",
            "review_date": "2012-02-18",
            "source": "rt"
        },
        {
            "content": "A fantastic political thriller with great performances by both Dustin Hoffman and Robert Redford. The movie is about the two Washington Post journalists, Woodward and Bernstein, who discovered and investigated the Watergate scandal, and the whole movie does a great job of using the real events in the investigation to create a constant sense of mystery and excitement, even for the viewer who already knows how the scandal ended.",
            "review_date": "2012-02-17",
            "source": "rt"
        },
        {
            "content": "Brilliant film. I cant believe it took me this long to finally see this film, but it is absolutely one of the best films to come out of the 70's and that is saying a lot. Reviewed 2/5/13. Rated 4.75 out o 5.",
            "review_date": "2012-02-16",
            "source": "rt"
        },
        {
            "content": "A political thriller about two reporters covering the Watergate Scandal in 1971.  This one is a must watch for all journalists and journalism enthusiasts.",
            "review_date": "2012-02-16",
            "source": "rt"
        },
        {
            "content": "This video is on Ronn Torossian, CEO of 5WPR's Top 10 PR Movie List.",
            "review_date": "2012-02-14",
            "source": "rt"
        },
        {
            "content": "One of the best films I have ever seen. Redford and Hoffman's portrayals as Woodward and Bernstein was very good but it is Jason Robards as Ben Bradlee that steals every scene. I love Nixon administration history so I am biased in my rating of the film but the pacing and the directing by Alan Pakula was great and phenomenal. Not all thrillers need guns and shooting, but the great dialogue and acting really sold the film. I am also glad in the way the film ended. We all know how Watergate turned out, why show that? Great film.",
            "review_date": "2012-02-12",
            "source": "rt"
        },
        {
            "content": "An excellent and important motion picture about the potential power of investigative journalism...Redford and Hoffman are of course excellent...",
            "review_date": "2012-02-08",
            "source": "rt"
        },
        {
            "content": "Long before Good night and Good luck, here was non violent  political thriller. Although now, you probably already know the outcome in this true story, the quest for the truth and thrill of the chase through this film will keep you on the edge of your seat.",
            "review_date": "2012-02-07",
            "source": "rt"
        },
        {
            "content": "The pre-eminent cultural document of one of modern America's most notorious political scandals, All the President's Men treats the Washington Post's gradually-accumulating Watergate investigation as the detective story it was. Visually arranged with clear-eyed economy by noted conspiracy-thriller director Alan J. Pakula from a script by William Goldman (writer of The Princess Bride and Butch Cassidy & The Sundance Kid), it proceeds with irresistible inertia and charm and not really a whole lot of simmering liberal outrage.\n\nIndeed, considering the characterization of the Watergate investigation in general by movement conservatives as being driven by a liberal ideological vendetta against the reviled Richard Nixon, there's nary a hint of partisan affiliation at all in Bob Woodward and Carl Bernstein's reporting efforts. Indeed, Robert Redford's Woodward even confesses to being a Republican to assuage such doubts raised by a potential source. Liberal Hollywood can be nothing if not careful when it comes to covering their collective political tracks in the effort to appeal to as wide an audience as possible, and this is evident here, despite the charged subject matter.\n\nWhat the film does accomplish is the nearly-instant mythologizing of the reporting of \"Woodstein\" (a portmanteau for the two junior reporters amusingly coined by their irascible editor Ben Bradlee, a role which won Jason Robards a Best Supporting Actor Oscar). What ensues is a complex and intermittently tense narrative pitting plucky, smart good against smug, powerful, faceless evil, complete with plenty of earnest but reticent conservative functionaries agonizing over whether to reveal the extent of their own knowledge of official wrongdoing.\n\nIts depiction of the moral agonies of the upper-middle-class aside, All the President's Men is iconic for more simple cinematic reasons. There's memorable visual touches, like the long crane shot pull-back of the reporters poring through documents in the Library of Congress, or Woodward's deeply atmospheric meetings with \"Deep Throat\" in a parking garage at night (both of which were parodied in a classic episode of The Simpsons). The dialogue is not as demonstrative in its cleverness as other Goldman scripts could be, but it skews towards sharp realism in its exchanges. So many of the key plot moments are marked by razor distinctions in language, and so much convoluted and clandestine detail from the book upon which it is based must be boiled down into more basic filmic terms, that Goldman's task was more to be precise and careful than to wheel free with unfettered wit.\n\nWe also have the stars, Redford as the presentable, stand-up Woodward and Dustin Hoffman as the hyperkinetic, suspicious Bernstein. Their portrayals have settled the respective public profiles of this most famous reporting team in American history for all time, although their subsequent career paths have helped that process. Woodward has become a venerable scion of Serious Journalism, regularly offering milquetoast conventional wisdom on current affairs talk shows and most recently penning sober stenographical non-exposés from inside of the Bush Administration, whose wasteful pre-emptive wars based on false premises and illegal detention and torture regime puts that infamous \"second-rate burglary\" in perspective a bit. Bernstein is not exactly a non-establishment figure, but has shown a more consistent distrust of institutions than Woodward has since Watergate, at least. One can mostly extrapolate their professional trajectories from the way the actors have approached them as characters.\n\nIf the film has a particular problem, it's with how it ends, with the clacking teletype exposition of the eventual unraveling of the Watergate cover-up that led to Nixon's historic resignation as President. The more specific focus that Goldman and Pakula have chosen makes for the tighter film, but also prefigures a story larger and more unwieldy than film narrative can quite accommodate (some of the more bizarre details of the larger story can only be hinted at; Kenneth Dahlberg's apparent evasive tactic of claiming to be traumatized by his neighbour's kidnapping drops like a joke, but he wasn't kidding, she really was kidnapped for a ransom). As with much of the political world, the truth is not only stranger than fiction but more labyrinthine and multifarious as well. Even as All the President's Men displays an understanding of this, the film pushes for simplification whenever it can. As such, strong as it is, it's more of an engaging synopsis of Watergate than a comprehensive document of it. Could a movie be anything more, or anything less?",
            "review_date": "2012-02-05",
            "source": "rt"
        },
        {
            "content": "A perfect reconstruction of the book and true story.  The best political film ever made.",
            "review_date": "2012-02-02",
            "source": "rt"
        },
        {
            "content": "Two of the best in a true tale of political crime.",
            "review_date": "2012-01-29",
            "source": "rt"
        },
        {
            "content": "The political film that really set a standard that all similarly themed films have tried (and most have failed) to meet. It manages to convey a sense of tension and high stakes in a completely authentic and realistic way. Everything about it is executed at a fantastic level, from the script, to the powerful acting, to the atmospheric direction. A brilliant depiction of what journalism should be, and a stark reminder of how far the fourth estate has fallen. \n\n4.5/5 Stars",
            "review_date": "2012-01-26",
            "source": "rt"
        },
        {
            "content": "Good, but perhaps dated in its pacing.",
            "review_date": "2012-01-17",
            "source": "rt"
        },
        {
            "content": "Good, but perhaps dated in its pacing.",
            "review_date": "2012-01-17",
            "source": "rt"
        },
        {
            "content": "While the movie may be historically accurate (at least much research was done), All the President's Men is very slow with very little excitement. Even though it is ranked #77 on the AFI Top 100, I would only recommend this film to those who are truly interested in politics and the Watergate scandal.",
            "review_date": "2012-01-15",
            "source": "rt"
        },
        {
            "content": "Dustin Hoffman and Robert Redford run for 138 minutes.",
            "review_date": "2012-01-09",
            "source": "rt"
        },
        {
            "content": "For whatever reason we never got as far as Watergate in most history classes I have taken so I find any information on that time period fascinating.  Loved seeing the inner workings of the Washington Post as they took this story from nothing to a full blown scandal toppling the President.  All star cast which is amazing.  A must see, and an American classic.",
            "review_date": "2012-01-08",
            "source": "rt"
        },
        {
            "content": "A solid, powerful film, alarmingly poignant in these times of declining journalistic integrity.  The DVD extras are worth it alone, buy it, don't download, it's worth it.  The only question this film doesn't ask is: nearly 40 years on, was the truth worth the detriment the countries confidence suffered?",
            "review_date": "2012-01-05",
            "source": "rt"
        },
        {
            "content": "For whatever reason we never got as far as Watergate in most history classes I have taken so I find any information on that time period fascinating.  Loved seeing the inner workings of the Washington Post as they took this story from nothing to a full blown scandal toppling the President.  All star cast which is amazing.  A must see, and an American classic.",
            "review_date": "2011-12-29",
            "source": "rt"
        },
        {
            "content": "A first rate script and cast come together to make an engaging film based on the book \"All The President's Men\". Long on realism, intelligence and logic, however, short on suspense. Almost entirely a dialogue and character driven film. From the perspective of two Washington Post reporters played convincingly by Robert Redford and Dustin Hoffman. Slow pacing helps create a realistic feel for how long a complicated story about powerful people can take to eventually come together. The teletype ending provides effective story closure without resorting to a dramatization of a well known historical event in modern American history.",
            "review_date": "2011-12-29",
            "source": "rt"
        },
        {
            "content": "Movies don't get any better than this.",
            "review_date": "2011-12-29",
            "source": "rt"
        },
        {
            "content": "good movie.  oh a side note...i'd marry robert redford.",
            "review_date": "2011-12-23",
            "source": "rt"
        },
        {
            "content": "Deep Throat. Who knew a great movie could be made about newspaper reporters. Well it takes a case like Watergate to make it work.",
            "review_date": "2011-12-22",
            "source": "rt"
        },
        {
            "content": "This is the story of a couple of journalists for the Washington Post named Bob Woodward and Carl Bernstein who, in the wake of a break in at the Watergate Hotel, stumble upon a deep and major conspiracy that eventually led to the first ever resignation of a U.S. President. It's a compelling and fascinating story, made even more potent, compelling, and biting by the fact that it's all true. \n\nThis films gets all kinds of (deserved) accliam, but I must be honest and say that this is a difficult film. You have to be able to sit through something that is both lengthy and deliberately paced, and is more about plot, dialogue, and atmosphere that is heavy on suspense, yet light on visceral action and payoffs. For the most part, I was able to sit through it just fine. I did start to get antsy, but the film never really fully lost my attention or pushed me to the breaking point.\n\nIt takes a lot of talent to make a film that is mostly people taking notes, typing, and talking (usually on phones) watchable and interesting, and that's the case here. Again, it helps that this film is about a real event, making it relatable to audiences (especially those who sawe it when it came out). It''s not really all that dated though, at least not in a bad or even kitschy way. It's a love letter to patience, determination, investigative journalism, and following a story, even if the odds seem overwhelming and the outlook grim.\n\nThe art direction is pitch perfect, and the way the films shows the workings of a 70s newsroom is awesome, or at least I thought so. I want more movies like this that have a high sense of realism in capturing a workplace. The conematography by Gordon Willis is absolutely brilliant, and everything comes alive thanks to some excellent use of shadows and light, nice framing, and effectively employed camera angles. Aside form the actors, it's the real star of the show...and speaking of stars: Dustin Hoffman as Carl Bernstein and Robert Redford as Bob Woodward? Perfect. The two have great chemistry together, and a real sense of comraderie, even though they aren't best friends or have the same views, opinions, and beliefs. Woodward is less experienced, but still very determined, even if self involved. Bernstein is more experienced, but sometiimes a bit too sharp for his own good. The performances are wonderful though, and perfectly embody these characters. Jason Robards shines as their boss Ben Bradlee, and Hal Holbrook is quite great as Deep Throat- the key information provider to Woodward who managed to remain anonymous until 2005.\n\nIt's no secret (to a lot of people) that I have a love for the 70s and 70s cinema that might be a little detrimental on my judgment. However, this is still an excelelnt film, and remains the high water mark for films about journalism. It's an important film that not only does a great job of capturing the investigation into one of the most notable events in 20th Century American history, but also works as a great cultural and historical tool, providing insight into the time period (both that it portrays and the one it was made in). As I said, this is a hard one to endure, but if you have the fortitude, it's profoundly rewarding.",
            "review_date": "2011-12-22",
            "source": "rt"
        },
        {
            "content": "I love watching movies like this. Getting all the names, dates, phone conversations, interviews and being challenged to keep up. And the movie is filled with great performances, i thought Hal Holbrook was outstanding. I wasn't a big fan of the ending how it just wraps up but i understand if they would've done it another way it would have to be 30+ minutes longer.\r\n\r\n\r\nOne of my all time favorite scenes is when Robert Redford gets Kenneth Dahlberg on the phone. The way the camera slowly pans from showing you the entire office to just Redford's face is amazing. Plus there are 4 conversations on the phone and tons of choreographed work by the extras and the entire scene is 1 take, just brilliant!",
            "review_date": "2011-12-17",
            "source": "rt"
        },
        {
            "content": "Rock solid conspiracy movie on one of the notorious conspiracy in history.\"The Watergate conspiracy'.. superb performance by two lead actors and conducted stunningly well by arguably the greatest conspiracy movie director of all time .. Alan J. Pakula'\n9/10",
            "review_date": "2011-12-17",
            "source": "rt"
        },
        {
            "content": "Classic Masterpiece.... A time in history when the oldest democracy was threatened by it's own supremo!!! Robert Redford and Dustin Hoffman's brilliance a feast to movie lover! When you see such a movies senseless regional nonsense is purely idiotic!",
            "review_date": "2011-12-17",
            "source": "rt"
        },
        {
            "content": "All the President's Men begins with the break in of the Democratic Part Headquarters at Watergate, and then goes on to two unlikely journalists covering the event - Dustin Hoffman's Carl Bernstein and Robert Redford's Bob Woodward. The two, especially Hoffman, may appear naive and inexperienced, but as the plot went on, I could at once see what a gross underestimation that was. From beginning to end, these two personify and symbolize the champions of a free press. And here's the icing on the cake - Woodward was a real-life Republican even then: but that never stopped him and Bernstein to courageously track down and encumber the hidden corruption in the Nixon Administration. That should serve as a lesson to all those politically affianced journalists of today, to whom objectivity is but a mere thing of the air. Hoffman and Redford act together with such clarity, that in the end, I felt All the President's Men to be one very definitive based-on-real-life-events film. The ending was superbly done - a montage of typewritten newspaper headlines culminating in Nixon's impeachment. This is one very good journalism-oriented film, and with some elements of life-and-death thrills, plus some very suspenseful and nail-biting speculations (especially with Hal Halbrooks' Deep Throat hanging around with Woodward), I highly recommend this.",
            "review_date": "2011-12-10",
            "source": "rt"
        },
        {
            "content": "One of the finest political thrillers ever made.",
            "review_date": "2011-12-01",
            "source": "rt"
        },
        {
            "content": "\"All the President's Men\" is one of the finest conspiracy thrillers out there, exhibiting a tone of paranoia like no other film I've ever seen. There are a fine array of performances, especially from the two leads, with Hoffman even overpowering Redford from time to time. Pakula is a fine director, and while I don't exactly see a \"masterpiece\" here, I certainly see a great film.",
            "review_date": "2011-11-29",
            "source": "rt"
        },
        {
            "content": "A very fine political film with brilliant performances... Not the easiest to watch though, you need to keep focused!",
            "review_date": "2011-11-21",
            "source": "rt"
        },
        {
            "content": "One of the finest political thrillers ever made.",
            "review_date": "2011-11-18",
            "source": "rt"
        },
        {
            "content": "It's a wonderful piece of time travel to an era that was muddled in controversy and intrigue. All your investigative instincts will be let loose in this one, and you may find yourself even wanting one of these haircuts.",
            "review_date": "2011-11-17",
            "source": "rt"
        },
        {
            "content": "Intriguing, and somewhat compelling, this fact-filled movie moves at a nice, brisk pace, utilizing the interaction between Hoffman and Redford to full effect.",
            "review_date": "2011-11-17",
            "source": "rt"
        },
        {
            "content": "Complexe but compelling.",
            "review_date": "2011-11-06",
            "source": "rt"
        },
        {
            "content": "A great Movie. Old time classics...",
            "review_date": "2011-11-05",
            "source": "rt"
        },
        {
            "content": "Two names any journalist knows: Bob Woodward and Carl Bernstein, the men who took down Nixon.  Walking the thin line between honest reporting and unethical practice, these two young reporters (played by Robert Redford and Dustin Hoffman, respectively) defied The Washington Post's expectations and broke open arguably the biggest story in American political history, by dedicated investigative reporting and a commitment to the truth.  This multiple award winner is a must see.",
            "review_date": "2011-11-05",
            "source": "rt"
        },
        {
            "content": "Just the fact I knew this story, had nothing else I wanted know from it (this stuff is happening daily these days), but somehow when Dustin Hoffman is at the top of his game adding tremendous life to everything he touches with a fascinating and wonderfully written script by Goldman and topped off by brave, smart, and precise skills of one Gordon Willis there's not much wiggle room for complaints. That's just picking favourites, everyone here is at their best making a known story more intriguing than one would ever expect. One of the best heavy dialogue driven movies from the 70's, almost topping 'Network'.",
            "review_date": "2011-10-28",
            "source": "rt"
        },
        {
            "content": "the 70s most overrated film.",
            "review_date": "2011-10-26",
            "source": "rt"
        },
        {
            "content": "Hoooooly crap that was awesome!",
            "review_date": "2011-10-17",
            "source": "rt"
        },
        {
            "content": "This movie had a lot of names to follow but it was great. The chemistry between Bob and Dustin is incredible.",
            "review_date": "2011-10-16",
            "source": "rt"
        },
        {
            "content": "Dustin Hoffman and Robert Redford are great in this pretty decent political drama about the two real life reporters that investigated and exposed the Watergate scandal, and essentially brought down the presidency of Richard Nixon.  Pretty strong drama with a good cast.",
            "review_date": "2011-10-16",
            "source": "rt"
        },
        {
            "content": "Complicated and insightful, All The President's Men shows a frightening yet entertaining look into the world of corrupt politics.",
            "review_date": "2011-10-13",
            "source": "rt"
        },
        {
            "content": "la primera nota fue en junio, en agosto renunciÃ³ nixon.",
            "review_date": "2011-10-09",
            "source": "rt"
        },
        {
            "content": "Buena representacion de la conspiracion del Watergate, narra bien como los reporteros fueron atando los cabos sueltos empezando por una simple supocision... lenta pero buena...",
            "review_date": "2011-10-08",
            "source": "rt"
        },
        {
            "content": "The movie was a half an hour too long.  Good performances by Redford and Hoffman.  Influential film that speaks the need for free press and the trouble a corrupt government can cause.",
            "review_date": "2011-09-28",
            "source": "rt"
        },
        {
            "content": "Slow and tedious, and it feels like it just repeats itself over and over again. Hoffman and Redford still give good performances, but I don't think they're Oscar worthy. Not a terrible film, but a highly over rated one.",
            "review_date": "2011-09-19",
            "source": "rt"
        },
        {
            "content": "As a fan of great detective stories, this film was delightful and interesting despite the audience's knowledge of the outcome. Redford and Hoffman play Woodward and Bernstein respectively very well with snappy reporter dialog ala His Girl Friday. The film is also very educational and useful for someone my age who had not yet been born during the time of the Watergate scandal, so many of the names are unfamiliar which makes the story more of a mystery for me than others who already know the entire history. The scandal itself is another reason the story may be more intriguing due to it being a true story. The atmospheric scenes especially in the garage were suspenseful and well done. Despite all of these great things going to it there are some glaring flaws, most notably the run time. For a film that has nothing that actually happens other than the conspiracy unraveling the 2 hr. 18 min mark is quite a drag. I also felt the whole thing about their lives being in danger could have been stepped up higher, but I guess keeping it minimal was purely for accuracy purposes. In my opinion accuracy isn't always good for keeping a film suspenseful though.",
            "review_date": "2011-09-19",
            "source": "rt"
        },
        {
            "content": "Very good movie.  I had a hard time staying interested in the movie because it was pretty slow most of the way.  Still I thought is was a good movie. =)",
            "review_date": "2011-09-10",
            "source": "rt"
        },
        {
            "content": "The film serves as a great history lesson to an event that rocked a nation and the world. In this age of the internet, it also serves as a great reminder about the hard work of the newspaper journalist.",
            "review_date": "2011-09-02",
            "source": "rt"
        },
        {
            "content": "Smart political thriller, brilliantly written engaging your mind as the complex conspiracy unravels in a coherent and logical way. Redford and Hoffman play it in a straight but intense manner and compliment each others characters. Well told story.",
            "review_date": "2011-08-31",
            "source": "rt"
        },
        {
            "content": "Fascinating, if only for its historical significance. Great for teaching, but not necessarily for pure enjoyment. Worth watching once.",
            "review_date": "2011-08-24",
            "source": "rt"
        },
        {
            "content": "An excellent and important motion picture about the potential power of investigative journalism...Redford and Hoffman are of course excellent...",
            "review_date": "2011-08-17",
            "source": "rt"
        },
        {
            "content": "A gripping, very interesting and thoroughly realistic political thriller, featuring whirlwind performances from Hoffman and Redford. The ending was rushed though. full review on the way.",
            "review_date": "2011-08-14",
            "source": "rt"
        },
        {
            "content": "A great history lesson on the Watergate scandal, it's just too bad the ending is so abrupt.",
            "review_date": "2011-08-07",
            "source": "rt"
        },
        {
            "content": "A brilliant film. A gem of a political thriller. You have to be a good writer to make present investigative journalism in such a compelling way. And you have be a great writer to present the worst scandal in American history in such a delicate and eye-opening way. For those watching in 2011, to watch All the President's Men is to know the horror and disappointment Americans felt in the early 1970s. It's to see how shocked and betrayed America felt like in the eyes of journalist Bob Woodward (Robert Redford) as Deep Throat (Hal Holbrook) told him in that dark parking garage that the corruption went all the way to the top, forever shaking people's faith in the White House. The acting was superb. Holbrook, even with his face in shadow captured the menacing words and feel of Deep Throat perfectly. Jason Robards played the senior editor of The Washington Post well and there was also Dustin Hoffman (Midnight Cowboy, The Graduate). This film bookended by historic video reels of President Nixon and damning newspaper headlines captures the irony of Nixon's re-election in the face of his sins. Viewers will feel the weight of his hubris in blatantly deceiving the American people and thinking he could get away with it, despite Nixon never appearing in the film. All the President's Men will continue to astound for decades more to come; no other film since has ever been able to tell this painful chapter in American history quite as well.",
            "review_date": "2011-08-04",
            "source": "rt"
        },
        {
            "content": "Appreciators of tense dialogue driven stories won't be able to resist this masterpiece.",
            "review_date": "2011-07-13",
            "source": "rt"
        },
        {
            "content": "An excellent example in pacing, characterization and buildup. Goldman's script is amazingly smart in its approach to the Watergate affair, Pakula's filmmaking is timeless and Hoffman and Redford make for an interesting, albeit uncanny, team. Some of the best work of the nineteen seventies.",
            "review_date": "2011-07-09",
            "source": "rt"
        },
        {
            "content": "This movie is some serious stuff. A great script that will make you go to the edge of the seat! This is the story behind real journalism.",
            "review_date": "2011-07-02",
            "source": "rt"
        },
        {
            "content": "Quiet but powerful, All The President's Men is a thoroughly engaging film.",
            "review_date": "2011-06-28",
            "source": "rt"
        },
        {
            "content": "I love this film. A classic political thriller with two of the best actors of their time as the leads, Robert Redford & Dustin Hoffman. Jason Robards shines in this film, which got him an oscar win. I really like how it ends...you never actually see Nixon resign...it just tells you the aftermath of Woodward & Burnstein's near obsession with the story, and how it affected American history.",
            "review_date": "2011-06-28",
            "source": "rt"
        },
        {
            "content": "A brilliant film.Must see",
            "review_date": "2011-06-21",
            "source": "rt"
        },
        {
            "content": "Historically accurate for the mostpart, and great directing by Alan Pakula. On the other hand, bad hair by Dustin Hoffman.",
            "review_date": "2011-06-19",
            "source": "rt"
        }
    ]
}