{
    "rating": 6.9,
    "release_date": "1976-12-01",
    "num_reviews": 530,
    "genres": [
        "Drama"
    ],
    "summary": "Rocky Balboa (Sylvester Stallone), a small-time boxer from working-class Philadelphia, is arbitrarily chosen to take on the reigning world heavyweight champion, Apollo Creed (Carl Weathers), when the undefeated fighter's scheduled opponent is injured. While training with feisty former bantamweight contender Mickey Goldmill (Burgess Meredith), Rocky tentatively begins a relationship with Adrian (Talia Shire), the wallflower sister of his meat-packer pal Paulie (Burt Young).",
    "reviews": [
        {
            "content": "The first film in this saga is a little confusing in dialogues and narrative, but I like the performance of the characters. They all deliver the unique personality of each one well to tie the story well, but I was a little disappointed with the final fight that lasts a few minutes and with many cuts, making the fight lose the potential that the script developed throughout the plot.",
            "review_date": "2023-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rewatched the entire Rocky catalog recently. \n\nEvery fight begins and ends the same. \n\nRocky never learns to defend.\n\nRocky is a blathering idiot. \n\nThere you go ... An entire generation of underdog films spawned from this template.",
            "review_date": "2023-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, it's rocky, and it's good.",
            "review_date": "2023-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolute classic. Music from beginning to end is outstanding",
            "review_date": "2023-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm giving it four stars because of its place in cinematic history. And it was interesting, too. I'm not understanding the low audience score. It won Best Picture back when the award actually meant something. It's probably too slow for contemporary audiences, and the movie just ends in an awkward spot. I only watched it because Creed 3 was coming out, and I'm glad I did. It was quite worthy.",
            "review_date": "2023-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Rocky,\" directed by John G. Avildsen and written by and starring Sylvester Stallone, is an American sports drama film released in 1976. The film follows the story of Rocky Balboa, a down-on-his-luck boxer from Philadelphia, who is given the opportunity of a lifetime to fight the heavyweight champion of the world, Apollo Creed.\n\nThe movie's main strength is its captivating story and well-written characters, particularly Rocky. Stallone's portrayal of Rocky is nothing short of brilliant, and his performance earned him an Academy Award nomination for Best Actor. Rocky is a complex character who is both tough and vulnerable, and audiences cannot help but root for him as he struggles to make something of himself in the world of boxing.\n\nThe supporting cast also gives outstanding performances, with Talia Shire as Adrian, Rocky's love interest, and Burgess Meredith as Mickey, Rocky's gruff but caring trainer, standing out in particular. The chemistry between Rocky and Adrian is sweet and genuine, and their love story is an integral part of the film's emotional impact.\n\nThe film's cinematography and editing are also noteworthy. The iconic training montage sequence set to Bill Conti's stirring \"Gonna Fly Now\" theme is an indelible part of cinematic history, and the fight scenes are filmed with intensity and realism that are a testament to the filmmakers' dedication to accuracy.\n\nOverall, \"Rocky\" is a timeless classic that stands the test of time. It's a movie that is not just about boxing, but about the human spirit and the ability to overcome seemingly insurmountable odds. It's a movie that will inspire and move viewers, and its impact on pop culture cannot be overstated.",
            "review_date": "2023-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest underdog story ever told. Keeps you glued to the beginning and end. Rocky is also such a enjoyable guy to watch, he's the type of guy we all aspire to be. Really good fight cinematography and amazing ending. One of maybe the best sports movie ever.",
            "review_date": "2023-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While I didn't really like some of the acting and some of the script, rocky was a down to earth film and seemed to work well. It has aged but was still good.",
            "review_date": "2023-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most inspiring films of all-time, Stallone IS the American dream.",
            "review_date": "2023-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A little slow paced and some sense feel a little to long but besides that, Rocky is pretty good.",
            "review_date": "2023-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great acting, well visioned and great drama which is a must see of all ages.",
            "review_date": "2023-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i really think rocky is a good movie it's just some of the characters are bad the fighting is great the story is good i recommend but if you don't like fighting don't recommend",
            "review_date": "2023-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film is not just about boxing, but it's a character-driven story that explores themes of self-discovery, redemption, and the power of determination. Stallone's portrayal of Rocky is simply outstanding, and he brings a depth and vulnerability to the character that makes him so relatable and endearing. From his awkward attempts at wooing Adrian to his heart-wrenching conversations with his coach Mickey, Stallone's performance is nothing short of incredible.\n\nThe supporting cast is also impressive, with Talia Shire giving a nuanced performance as Adrian, Rocky's shy love interest, and Burgess Meredith stealing the show as Mickey, Rocky's tough-talking coach. The chemistry between the characters is palpable, and their relationships are beautifully developed over the course of the film.\n\nThe boxing scenes are also expertly crafted, with Avildsen using close-ups and slow-motion shots to capture the raw emotion and intensity of the fights. The climactic bout between Rocky and Apollo Creed is a true masterpiece, with both actors giving it their all and making every punch count.\n\nOverall, \"Rocky\" is an inspiring and uplifting film that celebrates the human spirit and reminds us of the power of perseverance. It's a must-see for anyone who loves sports films, character-driven dramas, or just great cinema in general.",
            "review_date": "2023-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly, an almost perfect film In my opinion. Maybe it's too slow-paced for modern audiences, but it's a tender, big hearted film that gets its hands dirty when it needs to.",
            "review_date": "2023-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "excellent classic, that should be viewed by everyone to ever exist",
            "review_date": "2023-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best motivational, sports, uplifting and wholesome film ever made. This story was a real underdog story for sylvester stallone that cemented his place in film legacy. No matter who you are you will get motivated from this film to do better with your life.",
            "review_date": "2023-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Rocky\" is fantastic. Everything in this movie screams to your face 'classic!' and it totally deserves the hype. Sylvester Stallone proves that everything is possible. Recommended to watch it right away with \"Rocky II\" which is the best sequel ever made.",
            "review_date": "2023-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First off, the story behind the film itself is already entertaining with Sylvester Stallone writing the script/story but was unwilling to sell it if he wasn't given the lead role of Rocky. \n\nIn terms of the film itself, it's great. Rocky is successfully introduced to the audience as  a character we sympathise with. This being Sylvester Stallone's first big film, his acting is excusable, however I feel that the lack of acting skill adds to the character of Rocky, his awkward delivery of lines and lack of confidence adds to the character and makes it more realistic. The storyline, while extremely unlikely is still probable is is not an absurd series of events like the story's of the cinema today.\n\nOne of my biggest highlights of the film is the ending. It was somewhat unpredictable and in my opinion one of the best endings in the whole franchise. \n\n\"Rocky\" provides some of the most iconic scenes in cinema history as well as one of the most recognisable soundtracks of all time.",
            "review_date": "2023-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "meh; idk. i'm not really sure why so many people rave about this movie to be completely honest. i've read a ton of reviews & i understand where people are coming from, but watching it for the first time today i just wasn't impressed. i also have a slight aversion towards people yelling/loud people in general, which there are a lot of. so I'll take full responsibility for this review: it's not the movie, it's me.",
            "review_date": "2023-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An All Time Classic. The investment and pacing put into developing Rocky is perfect. While the film at times in the middle can meander it doesn't really matter because of how sincere, well done, and heartwarming it builds towards a great ending and a great message. Easily one of the best montages ever in a film with amazing music to boot. There isn't much more to be said. Everyone should see this once.",
            "review_date": "2023-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had a really good experience watching the movie so that May or may not have affected my review but genuinely An entertainment and inspiration movie with lots of little great moments A really great case of simple but effective 9/10",
            "review_date": "2023-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A magnificent novel of the modern era. Stallone shows a piece of forgotten humanity to the world with irony and emotion.  \n\nA hymn to those who think they are last.",
            "review_date": "2023-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie serves as a character study for Rocky, and it delivers. Slow, but super well developed and written.",
            "review_date": "2023-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In light of subsequent sequels there seems to be a revisionist history associated with the original Rocky. People forget how gritty and emotional the film actually is. While Stallone will never be confused with Lawrence Olivier he was never better than he was here and Burgess Meredith delivers a masterful performance. It may not be on the level of raging Bull when it comes to cinematic art but it sure leaves the audience feeling better at the end. Snobs love to hate on this movie because of what they think are cliches but at the time of it's release these cliches did not exist. They came later in movies that tried to copy the Rocky formula for success. A beloved treasure that's a must see movie for every new generation.",
            "review_date": "2023-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is so iconic and the training montage and end fight are both great, but before the training montage the movie is so boring. I still like this movie",
            "review_date": "2023-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is an inspiring story about an ordinary man who takes advantage of a once-in-a-lifetime opportunity.\n\nI do have to say, the movie has a rocky beginning, as the dialogue is pretty clunky and awkward at times. But after about twenty minutes, the movie really gets into its groove and had me locked in till the end. My favorite aspect of this film is the humanity it has; it takes a look at a big and intimidating fighter in Rocky and explores his emotions and insecurities. My favorite scene is when he lays in bed next to Adrian with the sudden realization that he cannot win this fight. It was an incredibly vulnerable moment for him and worked really well.\n\nAs I said before, the dialogue is very inconsistent, especially in the scene at Rocky's house with Adrian. It was very unsettling to watch because she is written as if she does not want to be there, but then the next second she is in love with him. It was very weird and creepy. On the other hand, in some scenes, the dialogue is written very well, which lends itself to boosting the actors' performances. But when it is off, the acting on display is negatively affected. Despite that, this movie gets a lot more right than it does wrong in the script department.\n\nTechnically, this film excels. The score is fantastic, with one of the most iconic songs in cinematic history. The cinematography is top-notch, with some incredible shots in the city and very creative angles used during the training sequences. \n\nOverall, this film lived up to every ounce of hype it had behind it, and I thoroughly enjoyed every second spent with these characters.\n\nScore: 98%\nVerdict: Masterpiece",
            "review_date": "2023-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I feel like I'm going to get crucified for this review especially because I'm a boxer, but I thought it was good, not great. I feel like it just doesn't hold up to today. What did bring it up to a 3 out of 5 for me was the messages and the role it played in history, Rocky Balboa is forever iconic for a reason, he didn't want to win, he wanted to go the distance. This movie isn't one I'll probably ever go back to unless it is because I forgot the plot.",
            "review_date": "2023-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is a drama about a lonely boxer with not much in his hands. Later on, he falls in love with a girl and a guy named Apollo Creed, a famous champion in boxing, wants Rocky to fight with him. This film is incredibly fun to watch and after the film ends you will have a lot on your mind. In a good way of course. One thing that did suprise me was the fact that you do not need to be a boxing fan to enjoy this, anyone can. It truely is a classic.",
            "review_date": "2023-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is a great underdog classic that features a knockout performance from Sylvester Stallone. The pacing is a bit slower than I remember but with a well written story and a satisfying conclusion. Rocky throws just the right hook. B+",
            "review_date": "2023-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favourite movies",
            "review_date": "2023-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky (1976) still remains an all-time classic with its simple but great story, writing, and performances.",
            "review_date": "2023-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A small-time boxer gets a chance to fight the world heavyweight champion and he blindly jumps into the ring in a bid to earn respect and glory.\n\nRocky is probably the most talked about sports movie of all time and for a good reason. I had sky high expectations for this movie and still it surpassed them. Sylvester Stallone is absolutely brilliant as Rocky and gives probably my favorite sports performance of all time. Rocky surely is a sports movie, however at its core it's more of a character study, what happens with a normal guy, when he gets the opportunity of a lifetime. Rocky has some fantastic editing and the best training montage of all time of course, I can't see anyone not being pumped after that one montage, which ends with one of cinema's most iconic shots of all time. Sure the boxing hasn't aged the best maybe, but for the time being, this movie was revolutionary and set the tone for all sports movies to come, so inspiring!",
            "review_date": "2023-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie To Start Off The Rocky Movie Series it's a good movie before Rocky and Apollo became friends excellent classic sports movie can't wait to see Creed 3 when it comes out I've been watching all the Rocky Movies this is definitely a good sports movie classic I recommend",
            "review_date": "2023-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Apart from Rocky just being a classic of both film history and pop culture history, it also holds a special place in my heart as the first film I ever saw that ever made me truly love cinema. And, seeing it again after God knows how many rewatches, it's still just as masterful as it ever was!\nThe acting by the entire cast is so authentic and genuine, the writing is simple but with so much emotional complexity to it, the direction and cinematography are gorgeous and make Philly a character in it of itself, and the music by Bill Conti is one of the best scores ever put on film!\nThe words  \"classic\" and \"masterpiece\" get thrown around vicariously nowadays concerning movies. Rocky stands out above most by being both a legitimate classic and a legitimate masterpiece!",
            "review_date": "2023-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is an all time Classic I highly recommend for all to see.  It's one of those movies you walk out feeling good about yourself and the underdog!",
            "review_date": "2023-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the best and most transformative films of all time.   Written and starring Sylvester Stallone as the underdog fighter given the chance of a lifetime it succeeds in every area.   The acting is heartfelt.  Stallone, Burgess Meredith, Talia Shire, Burt Young, and Carl Weathers all give top notch performances.   The Direction by John Avilson is great.  The boxing choreography was very engaging.  The soundtrack is sharp.   The joy of Rocky is that the movie being made, like the movie's substance, is an underdog story of epic proportions.   The movie spawned an entire franchise and, while, Quentin Tarantino calls Rocky II the best movie of the franchise there is no substitute for the original in my book.  This one holds up.",
            "review_date": "2023-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story and great characters! Writing was awesome!",
            "review_date": "2023-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true classic that should be seen by the new generations.",
            "review_date": "2023-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite film. A masterpiece! Rocky is more than a character, it's a moral of life, the ending is spectacular and the whole film is beautiful!",
            "review_date": "2022-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The seventies was the best era for sports movies.  You've got Bad News Bears, North Dallas Forty, Brian's Song, the Longest Yard, Bang the Drum Slowly, Breaking Away; The Greatest; Fat City, Le Mans, Pumping Iron; and then the list goes on....   Those just aren't some of the best sports movies ever made; those are some of the best movies made, period!  Topping that list was Rocky.  A gritty; new-wave; 70s ciname verite type movie; almost a documentary; about a part time hood; a loser from the streets of Philadelphia; Rocky Balboa; that no one likes;  who is handpicked from the publicity firm of Apollo Creed; the current reigning champion; (who is supposed to represent a cocky Mohammed Ali); to fight him in a big, hyped up celebrity match.  And so the bulk of the movie feels like a Cinderella Story.  (The sports announcers even call it a Cinderella Story in the movie itself!). Rocky is lifted up from obscurity; and anointed by the press as the new David who will slay Goliath.  And David and Goliath stories aren't new for sports movies.  Heck Casey at the Bat was a similar David and Goliath, underdog-coming-from-behind type story; and it infact had a similarly shocking, downbeat ending; and that poem was written by Ernest Thayer in 1888!  So none of this is new.  But Stallone; (who refused to let anyone else star in Rocky; even after his buddy Henry Winkler had it optioned by ABC in 75); gives this story such intensity and veracity.  And the plot; where Rocky knows he's out of his league; but he's going to put it all on the line to go the distance.  He knows he's going to lose.  But he's going to stay alive for 15 rounds; and not get knocked out.  He'll do anything literally to go the distance.  Leading to the stunning ending where he's being pummeled and punished by Apollo, but, to everyone's surprise, he does not give up.  What a heartbreaking and inspiring ending! That's what sets this Rocky apart.  The goal is not to win; the goal is to never give up; very different from the other movies; it's got that epic; mythological Sisyphus pushing the Rock up the hill against all odds feeling! That paired with his iconic training scene; jogging through the streets of Philadelphia at the dawn; running up the stairway at the Philadelphia Museum of Art like a wild bull unleashed in Spain, as Bill Conti's thunderous sports anthem \"Gonna Fly Now\" booms viscerally in the background; and then turning; to the dawn; and the blazing sunrise; as he lifts his arms triumphantly in the air; this is a pure adrenaline rush few other movies can deliver!  Raging Bull might be more artfully made; and Million Dollar Baby might be more tragic; but Rocky has them all beat in terms of pure, raw inspiration.",
            "review_date": "2022-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fun and inspiring movie",
            "review_date": "2022-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wooden acting at times, combined with its predictable story and poor pacing of its first act makes Rocky not as exquisite as some might say, nevertheless, it is inspiring, riveting and filled with rough themes with a famous score surrounding Stallone's knock-ass performance.",
            "review_date": "2022-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky' enjoys a good simple story, there is nothing else to complain about, only an ending that feels rushed and without any convincing message.",
            "review_date": "2022-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Rocky' enjoys a good simple story, there is nothing else to complain about, only an ending that feels rushed and without any convincing message.",
            "review_date": "2022-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a classic. Was able to show this awesome movie to a younger generation and I'm sure they are fans now. Just wished Starlight was showing all of the Rocky movies in theaters.",
            "review_date": "2022-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The single greatest movie in the history of movies.",
            "review_date": "2022-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing score, great actors, and an powerful message. This film is cinema.",
            "review_date": "2022-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A inspiring story mixed with good acting and also a good story. Has a very iconic score. Overall a good movie.",
            "review_date": "2022-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes this is a classic film, perhaps even a cult classic and yes there are undeniably some cliches present but I found myself rooting for Rocky and I liked seeing his relationship with the introverted Adrian develop. Of course there's the famous scenes of him pounding the streets in the very early morning, practicing day after day in the build up to the match which happens at the end of the film. I could see how this could be viewed as a 'living the American dream' type watch, or perhaps moreso an 'underdog' tale. Its quite a solid watch. Given im not a particular fan of sports, especially boxing, I wasn't expecting a great deal of this but I reckon I enjoyed it more than I perhaps imagined I might because the majority of the film isn't set in the ring, as it were and instead it concentrated on Rocky's life outside the ring, his clearly low-ish standing and it shows how he did what he could to try and raise himself above that.\n\nIt is a bit cheesy but for the most part, its a reasonably solid watch and I respect that. Yes, I'd recommend this to others.",
            "review_date": "2022-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very inspirational movie with a very likeable protagonist. The score is phenomenal and the training montage is great. The side characters are not great, the movies plot is not the strongest and the movie feels very dated.\n\nAn Overall great movie that deserves the legacy it has however has not aged as well as classics from the same era",
            "review_date": "2022-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "greatest theme song ever sylvester stallone is great",
            "review_date": "2022-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first half was very meandering and slow, and the payoffs are not nearly as high or entertaining as they need to be. Every scene with Carl  Weathers was awesome.",
            "review_date": "2022-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not the best but still great ",
            "review_date": "2022-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "7 years ago- The ultimate underdog story that is always compelling.",
            "review_date": "2022-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this is Sylvester Stallone's Best Role.",
            "review_date": "2022-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The people who gave his a bad rating obviously didn't see it as a little kid and get excited when Rocky took off Adrian's glasses and - voila! - a beauty. Punching frozen meat. Having the guy who played the penguin as your manager. Running up the steps of Philly in grey sweatpants. And portraying yourself as the underdog who's discriminated against and underestimated while your Black opponent has all the advantages, endorsements and love?  That's creative writing, Sly.",
            "review_date": "2022-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky (1976) is phenomenal",
            "review_date": "2022-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's A bit slow in the beginning but picks up towards the end.",
            "review_date": "2022-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic, a great film with a great storie on a low budget, acting gods and great chemistry, a storie for the ages, all them sequels are warranted, mabe I am a bit biased for this movie as I seen it so much over the years, but I do love it,",
            "review_date": "2022-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of my all time favourite films.  I'd love to own the script.  I honestly think it's one of the best pieces of writing in Cinema.  It's a great story, a love story. It appears a simple film and a simple story.  There are loads of little bits that make it a gem.  Like Rocky's jokes, or the way he plays with a tennis ball.  The music is also excellent.  It's a feel good film full of hope.",
            "review_date": "2022-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just cannot believe how the audience scored this movie so low. I mean, here you have a classic underdog, a club fighter and knuckle-buster for a low-time loan shark. He's not a bad guy, just sort of hopeless and his life looks like a dead end until given the oppty to fight the boxing champion!\n Throw in his relationship with the awkward Adrian (Talia Shire, who was perfect) and Burgess Meredith as his trainer was inspiring.\nThe only losers in Life are those who don't try!",
            "review_date": "2022-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is the movie that, at the time, was the definitive boxing movie, and in many ways still is. It takes an everyman fighter from Philly Rocky Balboa, someone the audience can connect with, and uts him in the biggest spotlight-a title match with the Heavyweight champ Apollo Creed. It follows Rocky as he trains for his fight, while leaving plenty of room for character development, relationships, and romance. Sylvester Stallone does a great job in both acting in the title role and writing the script, and the supporting cast is also excellent. The score is one of the best in cinema history, especially when played behind the ionic Rocky training sequence. Rocky also has tons of iconic imagery and diolague, too. And the final fight is also thrilling, even if it has a somewhat predictable ending.  There are some issues, though. There are only two boxing fights in the whole movie, the very beginning and very end. And the rest of the movie, though it has some fun moments, feels slow and dragged-on at times. Overall, Rocky is the movie that kickstarted a franchise, and while it had some low moments, the high ones soared.",
            "review_date": "2022-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ICONIC!!! The film that birthed an iconic franchise. Sylvester Stallone deserved his Oscar for this performance. The underdog story grips the audience into instantly caring for Rocky, and I challenge anyone to watch this film and not cheer for him by the end.",
            "review_date": "2022-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest 01 hour: and 59 minutes ever!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "69%? wild, this movie is a classic with TONS of rewatch,",
            "review_date": "2022-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie itself had a good story, but the characters were not enjoyable. Didn't love the movie until the last 15 minutes.",
            "review_date": "2022-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie has an iconic scene of Rocky preparing for the big fight, and a cute scene of a date alone at the ice skating rink. Aside from that, there is little to the story, poor  character development, bad and/or over-the-top acting, and a flimsy, abrupt ending.",
            "review_date": "2022-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's much talked about and idolised, but while it's interesting for Stallone's performance alone, it doesn't have the described punch.",
            "review_date": "2022-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This about a bum from Philadelphia given a chance of a lifetime to fight the heavyweight champion of the world, Apollo Creed. Rocky Balboa is a underdog from Philly who goes through a character arc of learning to take responsibility for his life, don't make excuses, and keep trying. During his time training, he gets in a relationship with the shy Adrian, gains a friendship with Paulie (brother of Adrian), and gets a father figure in Micky who trains Rocky.  This movie has a remarkable soundtrack from Bill Conti (songs like Gonna Fly Now, Philadelphia Morning, Going the Distance). This movie, even though it's a bit boring in parts, carries remarkable heart and life lessons. The heart in this movie is beyond excellent, and the care put into it is outstanding. The morals of this movie to never stop trying, and winning isn't anything reigns true to this day.",
            "review_date": "2022-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though this film is popular, that doesn't necessarily mean it's good. It's too predictable for me, and never had me on the edge of my seat. Sylvester Stallone gave a good but not great performance. With a few nice montages that are slightly overrated, I give this film 2 stars, as it could've been so much better.",
            "review_date": "2022-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic 70s film. Warrior/under dog archetype.",
            "review_date": "2022-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Led by the amazing performance of Sylvester Stallone, Rocky is a story that shows the life of an ordinary boxer.",
            "review_date": "2022-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While the boxing is great, it's the time spent with the lovable Rocky that really make this movie special.",
            "review_date": "2022-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The quintessential underdog story and one of my favorite films of all time.",
            "review_date": "2022-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There isn't much that hasn't been said about this film in the last forty-four years. From the story, to the characters to the score to the moral message. It all blends together to produce a wholesome, inspiring film. One which dares to say that sometimes going the distance and refusing to stay down is more important than winning or losing. Sylvester Stallone in what would become his career-launching and defining role delivers a true, raw and passionate performance. Adrian is played to perfection by Talia Shire who was  really on a role in the 70s. You can see how much she and Rocky compliment one-another.  Burgess Meredith brings the character of Micky to life, a bitter trainer turned father figure to Rocky. Burt Young is solid as Paulie, and the charismatic adversary to Rocky, Apollo Creed is well-played by Carl Weathers. Bill Conti's iconic score helps to further engross you into the experience as well as inspire you. I absolutely love this film, and whether you're a boxing fan or not, I'm sure you will too.",
            "review_date": "2022-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best and most iconic lower budget films ever.",
            "review_date": "2022-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wooden acting at times, combined with its predictable story and poor pacing of its first act makes Rocky not as exquisite as some might say, nevertheless, it is inspiring, riveting and filled with rough themes with a famous score surrounding Stallone's knock-ass performance.",
            "review_date": "2022-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie of all time . The greatest American Dream/Love story of all time . Rocky is the ultimate underdog movie .",
            "review_date": "2022-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Paul Rudd was not in this movie.",
            "review_date": "2022-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a beautiful depiction of a underdog story in the 1970s America.",
            "review_date": "2022-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite all the hype, this movie is workable but not one of the greats. It was a hit at the time because movies of the 1970's typically said what a terrible place America was, and this was different in that it was still possible for someone in the gutter to make it to the big time-honestly.\n\nBased on a real-life story, a champion boxer is unable to fight his rival in a big match when the rival is injured. Nobody else is available, so Rocky is found and he has to be trained to be able to face him. There is a romance between Rocky and his best friend's sister as well.\n\nThe movie is rather predictable and provides no real surprises. Interesting to watch, but don't expect anything wonderful.",
            "review_date": "2022-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely a classic and moving story.",
            "review_date": "2022-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is one of the best movie series the world has ever seen in my opinion. \nSylvester Stallone is for sure the best of the \"muscle actors\" from the 80's. \nWith \"muscle actors\" I mean lads like Arnold Schwarzenegger. If you ask me, Sly is way better than Arnie. Rocky is one of Sly's best movies and he's produced it himself. The 4 first Rocky movies are bangers but the 5th is not very good. Then \"Rocky Balboa\" and \"Creed I & II\" are great as well. I think Rocky is one of the best Rocky movies. I highly recommend!",
            "review_date": "2022-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All the Rocky movies are gritty and heartfelt! Don't miss!",
            "review_date": "2021-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So slow, dialogue is off, like 40 minutes of dialogue that tosses this amazement train right off the rails. I like Sly in movies like Rambo but this movie was not a movie I'll rewatch any time soon, I just think that it's trash. It's from the 70s and I like a whole lot of movies from the 70s like Jaws, Close Encounters, Willy Wonka, Blazing Saddles & Led Zeppelin The Song Remains The Same but this movie was a big disappointment.",
            "review_date": "2021-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The satisfying, classic boxing movie offers some decent messages.  Rocky is realistic about his goal.  He does not need to win.  He just needs to acquit himself with dignity, to show he is in the same league as the champion.  In order to achieve that goal he will risk giving everything he has, risk even the small pride of an unbroken nose.  He develops enough self-respect to risk public disgrace.  This is a big issue for teens, adolescence has been characterized as the years in which everything centers around the prayer, \"God, don't let me be embarrassed today.\"  Rocky begins as someone afraid to give his best in case it is not good enough, and become someone who suspects that his best is enough to achieve his goals, and is willing to test himself to find out.\n\nIt's worth taking a look at Creed as well. Like here in the Aesop fable, he underestimates his opponent.  He is so sure of himself, and so busy working on the business side of the fight that he comes to the fight unprepared.",
            "review_date": "2021-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, its even better if you know Sylvester's life story",
            "review_date": "2021-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "OK it's predictable but the great performances and sheer joy make up for it. It's a classic. And a must watch. Love the theme song. Love Sly performance, directing and writing. Shy Adrian is cute, and mick is a great old school boxing trainer. Apollo Creed is a likeable opponent. All in all, its a must watch\n\n-Adrian, ADRIAAAAAAN!!",
            "review_date": "2021-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie ever made - period!",
            "review_date": "2021-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Love it.",
            "review_date": "2021-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is by far one of the greatest movies ever made. I remember reading articles about the Oscar’s and apparently people were upset that raging bull didn’t win. But Rocky is better in every way. When people catch raging bull on tv do they stop and watch it? Probably not. But when Rocky is on, people stop and watch. Every single time. Why? Because it’s motivational. It’s literally one of the greatest films ever made. Stallone should’ve won best actor, twice for his portrayal of Rocky.",
            "review_date": "2021-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film to start it all… The legendary Rocky franchise! This film encompasses so much greatness. One of my favorite movies of all time. Thank you Rocky!!",
            "review_date": "2021-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really fun and motivating movie. It might no have any complex story writing and have some clichés but it is a iconic movie and you could clearly see why this is a classic.",
            "review_date": "2021-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Undoubtedly a great underdog sports movie, but I enjoy Rocky best as a document of a time and place.",
            "review_date": "2021-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No body plays Rocky Balboa better than Sylvester Stallion!!!!",
            "review_date": "2021-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is the pure embodiment of fun, really nice underdog story, a true classic",
            "review_date": "2021-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't comprehend why the audience score is so low. This film perfectly depicts the underdog story of Stallone's life and rockys low budget. It's so powerful and uplifting this story and imo is one of the best films you'll watch.",
            "review_date": "2021-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies of all-time.  Deserves seven stars.",
            "review_date": "2021-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe the best movie of all time!!!",
            "review_date": "2021-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films ever made!!!  It was so good that it spawned five successful sequels and a spinoff series in Creed.  Can any other film series outside of Star Wars say that???  Maybe Harry Potter or LOR???  Rocky is perfect from start to middle to the end!!!",
            "review_date": "2021-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love these sweet movies about the human spirit. Rocky was always such a great person through it all. Congrats Sly for making films that prove morals in a movie doesn't mean a lack of entertainment value.",
            "review_date": "2021-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can always rely on me for the controversial film takes. Here's another classic film that somehow I've only just gotten around to watching. I may get hate for this but it's just my opinion and immediate reaction after finishing watching this.\n\nThe first hour of this is very slow and felt like an overly bloated introduction to the world and characters before the main plot had even begun. It could have benefited from being 20 to 30 minutes shorter. Rocky is the only character throughout who I could feel any sort of connection with, and even then I wasn't particularly compelled due to Stallone's unconvincing performance.\n\nThe only part of this film I can say I genuinely enjoyed was that training montage; now one of the most iconic moments in cinema. Problem is that it's about an hour and a half into the film, with little positives beforehand. Even the ending climactic fight which is one of the more enjoyable aspects of the film felt silly and overly melodramatic.\n\nI cannot really understand how this film is held in such high regard. I can see how people could enjoy enjoy this more than I have, but it is far from a great film. I found Raging Bull to be far superior in every regard.",
            "review_date": "2021-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All ages admitted, despite the swearing & fights!!!!!!!!!!!!!!!!!!",
            "review_date": "2021-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky, for me at least, is one of the most over-rated movies ever made. I don't think it doesn't anything horifically bad, but I also don't think it did anything paticulary good either. On one hand, the ending is quite satisfying and the character of Rocky is brought of life by Stallone. On the other hand, the whole story feels incredibly predictable, and if not played by Stallone, the actual character of Rocky is incredibly mediocre. Overall, this film isn't terrible, but it isn't good either - just painfully average.",
            "review_date": "2021-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best sports movie ever produced. The story is engaging, the characters are relatable and well developed and the score is legendary.\nThank you Stallone for this masterpiece.",
            "review_date": "2021-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Need to get motivated? Watch this movie!",
            "review_date": "2021-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a must-see if you are from Philly, love underdog stories, or love boxing. Of course, this movie has a great cast, and still holds up pretty well.",
            "review_date": "2021-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can see why Rocky endures in people's memories and hearts all these years later. https://letterboxd.com/josephtomastik/film/rocky/",
            "review_date": "2021-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WONDERFUL!!!\n\nI RECOMMEND TO YOU...",
            "review_date": "2021-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What I liked the most about this film was seeing the great introduction they gave to Rocky, I feel that everything in this story flows naturally and all the characters that come out are entertaining and well introduced as well.",
            "review_date": "2021-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie in my opinion is one of the best sports movies ever. The thing that holds me back from giving this movie 5 stars is how Rocky treats Adrian in the scene where they are in his apartment, but that's it. This is a great movie in my opinion.",
            "review_date": "2021-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't understand why people say this is one of the best sports movies of all-time. in my opinion, this is one of my least fav Rocky Movies.",
            "review_date": "2021-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How can you not love this stoty of the underdog ?\nStollone's Rocky is just a great character especially in the first two installments. We meet Rocky as a down on his luck amateur fighter unexpectedly given the chance to challenge for the heavyweight title against the great Apollo Creed. What elevates this from similar scripts are the performances, the characters & the tear jerking music.",
            "review_date": "2021-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie of all time! Sylvester Stallone shows his talent in writing and acting in his first popular film.",
            "review_date": "2021-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing feel good movie! One of my favorite movies!",
            "review_date": "2021-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this film was amazing it showed it just takes 5 weeks to beat a champion  this film had good characters like rocky apollo adrain and much more its some problems but the film is amazing",
            "review_date": "2021-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I do not like how much I liked this. This was not what I was expecting. While I did know how it ended with him losing, but I still was really impressed with the film. It was such a simple film which is something that I love. Performances are fine, the writing is good, and the shots are really good. Everything about it is just good. Only a couple things are incredible but its just a really solid movie.",
            "review_date": "2021-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was based on Ali's fight with Bob Foster. Stalone was in the crowd and the rest is history. Very far fetched but it is very enjoyable. A great movie inspired by the Greatest of All Time. Rumble young man, rumble!",
            "review_date": "2021-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing film, one of the best imo. To the screenplay, to the direction, to the execution, to the scenery, to the plot, to the message, to the acting it all is something that is a simple story that is all it needs to be and executed on such a grand and amazing scale that makes Rocky a timeless amazing classic. Rocky 100% A+",
            "review_date": "2021-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not going to lie, it took me a long time to get around to watching Rocky and after watching it for the first time, I'm only sad I didn't watch it sooner! This movie is highly deserving of all the praise it has gotten. This underdog-hero story is so beautifully written and directed, it makes you feel as though it's based on true events for that short lived period until reality kicks back in. This first installation will make you feel a range of emotions from anger, sorrow and jealousy to pity, determination and lust. The onscreen chemistry between Stallone and Shire is very real and I can't imagine anyone else playing their roles better than they did. It's one of those movies that stays with you long after it has ended. What are you waiting for? Go watch it!",
            "review_date": "2021-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The one that started it all and in my opinion one of the best one if not the best one. There's not a lot to say that's already been said, Just that its awesome.",
            "review_date": "2021-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Critics loved it and the Academy lauded it, but audiences did not go crazy over Rocky -- except at the box office. Stallone cashed in -- leaving the inspiration for the movie, Wepner, out. In hindsight, it's a good-enough movie, but it wasn't as good as \"All the President's Men,\" \"Network\" or \"Taxi Driver.\" It just happened, as the title character in Rocky, to have a good night.",
            "review_date": "2021-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films I have ever seen. Beautiful directing, iconic music, fantastic screenplay and brilliant acting.  Must Watch",
            "review_date": "2021-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is a triumph, simply magnificent.",
            "review_date": "2021-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why is Rocky getting review bombed?",
            "review_date": "2020-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Before I saw this film, I expected a half-baked boxing plot about some dude. Then, I was blown away by the raw style of film making and the realistic approach to tough subjects like poverty and domestic violence. By the end, I wept with joy and a renewed sense of purpose. This movie is about finding the will to rise above your circumstances even when the world has decided you're a loser and finding love just when you think all hope is gone. It lives up to the hype.",
            "review_date": "2020-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of my favorite movies of all time. Everything about it is timeless.",
            "review_date": "2020-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably not for Gen Z but filled with some good wit and classic moments we all know and love.",
            "review_date": "2020-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the first part of the movie I could find terrible scenes due to bad screenwriting and also it was hard to sympathize with Rocky Balboa at first because the way he behaves is dumb and the way he treats Adrian is terrible, how could she fall in love with him? Anyway, then things started to fix gradually and I started thinking that it was not totally bad because at least it gives emotions. And the script got better, too.",
            "review_date": "2020-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a great movie, one of my personal favourites, I can't believe it has a 69% (nice) on audience score.",
            "review_date": "2020-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Rocky\" made Sylvester Stallone a household name and I think it's one of the best boxing movies. The story, acting, and especially the make-up work is incredible. The final fight between Rocky and Apollo Creed (Carl Weathers)  is iconic and definitely my favorite part of the movie and Rocky's relationship with Adrian (Talia Shire) is— strange, yet nonetheless satisfying.The only problem I have with the movie is during some points of the movie I find that is drags, but overall, the film is fantastic. For that, I give \"Rocky\"... 4 stars.",
            "review_date": "2020-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most inspirational movies ever made with great performances. Incredibly successful script with a clever direction on a very low budget and yet it feels so rich every way. A true classic.",
            "review_date": "2020-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Of the best movies ever\nIt has a great soundtrack, a script with very good characters, a great story, good performances, good settings and it leaves a great message that is to never give up because anything is possible.",
            "review_date": "2020-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is a good story of becoming, but a lot of it felt unnecessary for me.",
            "review_date": "2020-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stallone's screenplay, silver screen debut performance and Bill Contri's epic score make this 70's sports drama a bonafide gem of American cinema.",
            "review_date": "2020-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is a brilliant story. It sends a message about strength and determination, showing us that everything is possible as long as you want it and work for it, and the story is told in a creative, fun and interesting way. I would have liked to see more action, more boxing scenes, but I also understand they had to tell more about Rocky Balboa's life first, as it is the first Rocky movie ever made.",
            "review_date": "2020-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The definition of a crowd-pleasing drama which holds its place in cinema for beating the odds both on-screen and off.",
            "review_date": "2020-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is a masterful and amazing classic. Every scene feels so iconic for some reason. Sylvester Stallone does a fantastic job as Rocky and the screen writing. It is just a unskippable gem.",
            "review_date": "2020-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the kind of romantic movie to watch with your girlfriend",
            "review_date": "2020-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky, is a amazingly acted, crafted, and written. From its iconic montage to its amazingly talented boxing scenes, and a good emotional core that puts a nice bow around the movie. You care for Rocky, and who he likes, and you want to help him succeed in beating Apollo. Sure he loses but, he knew that just doing his best has developed him the most, and that if he won, or did not win, he would still be proud of himself and what he has accomplished. The only problem I have with this movie is that the scene were Apollo picks Rocky, it would be a terrible marketing decision, and it makes it feel more fake when the men in his room like the idea. So 9/10, I just got interested in boxing for once.",
            "review_date": "2020-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is known as the ultimate underdog story for very good and truthful reasons. Its characters and story are unforgettable, leading up to an ending so excellently crafted it might be the best in any movie ever.",
            "review_date": "2020-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once you get past the ridiculously implausible plot and the unrealistically staged fight scenes, of which there are only two, Rocky is a surprisingly likeable look into a lovable underdog (Sylvester Stallone) who goes up against seemingly insurmountable odds to make his dreams come true, all while falling in love with the equally likeable but socially awkward pet store employee Adrian (Talia Shire).  What makes the film so entertaining is its sheer grittiness and some great performances, most notably Burgess Meredith as Rocky's trainer Mickey and Burt Young as Paulie, Adrian's brother.  While it's not perfect and hasn't aged particularly well, it's a pretty decent character study that will have you cheering by the end, whether you want to or not.",
            "review_date": "2020-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Have not watched this movie in years! It's still great. A great story of someone who is thought of as a loser, especially from himself. But, he gets someone to believe in him, his girlfriend, and that makes all the difference. Then, he goes to work to make something out of himself by getting into shape to box. The ending is terrific. Cannot wait to watch Rocky II.",
            "review_date": "2020-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't see what anyone might not like about this film. Besides the now dated, grainy picture and audio quality, this film stands out as a classic exsmple of solid character building. You don't just want him to win the fight, you want him to succeed in life too.",
            "review_date": "2020-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love love love this movie!!! Hopefully they will play 2-5 as well!",
            "review_date": "2020-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic I love how you’re playing the old movies again",
            "review_date": "2020-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best if all time.",
            "review_date": "2020-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good film, the story of overcoming and hope, Stalone wrote the script and acted in this film, it is simple but it was done with a lot of affection and dedication; in addition to talking about the story of the actor himself, it also reflects the American feeling that was well fallen at the time; it is mandatory for those who are in a difficult time in life and need to be inspired, also mandatory for film lovers in general",
            "review_date": "2020-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "an entertaining sports flick with good acting and an awesome fight scene, but the films rather abrupt credits roll is pretty annoying.",
            "review_date": "2020-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yo! One of the best sports dramas, if not THE BEST, with perfect writing, acting, and directing. ‘Rocky’ will never go down without a sensational fight!",
            "review_date": "2020-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "AFI 100 Greatest Films - #78: I have seen this many times growing up and, until I recently watched Raging Bull, would consider this the best \"boxing\" movie I had seen. It seems every year a movie is released with a plot revolving around the tortured fighter who starts off on top, falls from grace, and then must overcome personal and professional struggles to regain his belt. Some of these films are even pretty good but none of them ever seem original or interesting and I think, being judged against Rocky, is why they usually come up short for me.\n\nThis was the first time watching in awhile and while I always love Mickey, I think I appreciated just how great this ending was more than any other viewing. I thought it was an excellent choice when the announcment of the decision of the bout is pushed completely into the background, and is barely even audible, as Rocky's confusion and anxiety to find his real prize, Adrian, is the main focus on screen. I don't think I've ever watched Rocky as more love story, than sports story, but on this viewing that proved interesting and new to me as I would argue that any of the success Rocky achieves in this film, or any future films, would have never been possible without finding that connection with Adrian. 8.5/10",
            "review_date": "2020-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Back in 2007, I traveled to the City of Brotherly Love, during which I paid a visit to the Philadelphia Museum of Art. I bring this up because back then I never saw the movie Rocky despite knowing where the iconic scene with the steps came from. Now, having finally seen the film, I can honestly say Rocky is one of my favorite sports movies of all time. Rocky Balboa (Sylvester Stallone) is an underdog Philly contender who's set up to fight Heavyweight champion Apollo Creed (Carl Weathers). Meanwhile, he hits up a date with shy pet shop owner Adrian (Talia Shire) and hires an old grouchy boxing manager Mickey (Burgess Meredith) to help him warm up for the Bicentennial Super Battle. What I loved so much about the movie, aside from Rocky's likable sweet-hearted persona, is that the majority of it centers on character interactions and relationships as well as the build-up to the boxing tournament. When it got to the match, I didn't expect Rocky to knock out Apollo first round nor Apollo winning the bout via split decision despite everyone, including Adrian, cheering for the Italian Stallion. That ending changes a whole new meaning in storytelling where the loser wins yet loses. Unfortunately, the sequels and the Creed films followed that conventional cliched ending where the protagonist wins the fight and loved ones. Maybe that's for the best because no matter how many sequels or spin-off movies get produced, we will always remember the first Rocky movie.\n\n(4 ½ Apollo Shorts out of 5)",
            "review_date": "2020-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A bit simplistic but it works.",
            "review_date": "2020-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I fucking love everything about this movie, I love the story, I adore the characters, I love the dialogue throughout this movie, I love the montage in this one, I enjoy the funny scenes and finally, I love the fight scenes throughout this movie. \n\nOverall, it's a great fucking movie, one of my honest favourites, it's honestly worth the watch.",
            "review_date": "2020-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect for all ages. This movie is timeless and very engaging. The storytelling is perfect and it has fun moments even young ages can enjoy.",
            "review_date": "2020-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Adrian!!! God bless you Sly, for giving us this masterpiece.",
            "review_date": "2020-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny good action awsome music good old classic",
            "review_date": "2020-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Calm and satisfying masterpiece!it was slow at start the build-up and nostalgic vibes with amazing moments and great dramatic end it was great experience!the training scenes were chillingly calm and awesome and the use of opportunity in extreme way was brilliant,the music specially theme song was amazing and the characters and there ups and downs with Rocky was amazingly showcased.it 's a beautifully developed amazing movie A Masterpiece!",
            "review_date": "2020-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is an excellent film. Furthermore, the film is exciting, fascinating and real even today, as we all want to win in life.",
            "review_date": "2020-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best part about this movie is the journey and not the ending, though, an ending matters a lot for a sports athlete and in a sports movie. If viewed from the lens of sheer competition, then you will be missing the point. It is a life's journey with a boxing backdrop and not the other way around.",
            "review_date": "2020-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't say this often about a movie, but I wouldn't change a frame of the original Rocky. The film is perfect. From its inception to completion, it represents the hope of all underdogs that can bask in the dream that is Rocky. In 1976, Sylvester Stallone was an unknown actor and screenwriter, Burgess Meredith was washed up just like the role he plays in Mickey, Rocky's trainer and the only movie of merit directed by John Avildsen before this was Jack Lemmon's Oscar-winning performance in Save the Tiger. Sure, it's one of the most popular Cinderella stories of all time, but it's so good on its own right. The music, the cinematography, the casting, and direction are all top notch, and the screenplay—written by Stallone in three days—is one of the best of all time. All of the latter were not left unnoticed with the film receiving 10 Academy Award nominations in a strong Oscar year. It rightfully won best picture and made Stallone the superstar that he is today.",
            "review_date": "2020-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie of all time. ",
            "review_date": "2020-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "bizarrely overrated in my opinion",
            "review_date": "2020-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From the gritty streets where Rocky lives and his house with only the comfort of his pets. The streets laid with rubbish with homeless people, its feels very raw and real. Talia Shire is the love interest, shes shy but Rocky and Adrian have a connection which is very sweet. There are drawn to each other, they both appear lonely and vulnerable. She becomes stronger throughout the movie. Rocky and Adrian's initial kissing scene is uncomfortable and then tender. The music is an anthem and very uplifting. There are elements of on the waterfront, he starts as a bum, there is work on the docks but in this case becomes the contender. Stallone plays Rocky with enough passion, drive and emotion to make me fully care about him. He has nothing to lose and feels very natural in his role. He sometimes over talks though and the film has some very random dialogue. Its an effective underdog story which entertains and is still the best of the series. You can see why people like the film but don't think it deserved Best Picture at the Oscars. Burt Young as Paulie at times just overacts and shouts and i like Burgess Meredith as Mickey who's loud spoken but in the end has Rocky's back.The moment as Mickey wants to help Rocky is one of the best scenes, Rocky talking about his prime and his house stinking and Mickey chatting about his boxing career. It says so much about both of them, its sincere and emotional. Carl Weathers is the arrogant and at times cliche champion who is more interested in the media. The running up the steps is a very iconic scene as the camera follows Rocky with Philadelphia as the backdrop. Rocky's training sequences as he runs through streets, by the water and by the docks with the music playing. The moment with Rocky at the empty arena is sentimental.   The boxing scenes are well staged, using camera angles to great effect. You can feel the punches. At times you feel the amount they get will cause damage or they shouldn't recover. An entertaining movie that's feel good.",
            "review_date": "2020-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first time we see Rocky all the odds are against him. He is a well fleshed out character that many can relate with. Stallone's is a delight and this is the movie that made him a household name. The Rocky series is still going to this day. Must watch for any sports fan.",
            "review_date": "2020-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is spectacular sport film that shows an underdog willing to fight against all odds no matter what. The romance in this film is something else that makes this film great",
            "review_date": "2020-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is Rocky the strangest film ever to win the Academy Award for Best Picture? As an underdog sports movie its Oscar appeal seems obvious, it remains highly acclaimed by many critics, and it was successful enough to both catapult its star to superstardom and to launch an entire movie franchise. But for all of this – and for all that its critics dismiss it as schmaltz – the most striking thing about the film is how odd it is.\nSylvester Stallone is often type-cast as an action hero due mostly to the subsequent Rambo franchise, a fact that he capitalised and poked fun at in The Expendables and its sequels. But at various times throughout his career he's proved that he can actually act and Rocky is the most prominent demonstration of this. Moreover, Rocky proved that he can also write: the script and Stallone's central performance are the two key factors that make the film as enjoyable as it is. It's interesting that in a story that is often predictable, it famously ends with Rocky failing to beat his opponent in the ring, but nevertheless gaining his respect and keeping his dignity. And of course, his real triumph at the end is when his girlfriend tells him that she loves him. \nBut it is the actual character of Rocky that is the film's most striking feature. Stallone is effortlessly convincing as the somewhat dim-witted amateur boxer who works as a debt-collector but is too soft-hearted to be really good at it. Rocky is not a typical hero, nor is he a typical anti-hero: he's brooding, socially awkward and quietly eccentric. This is at its most obvious when he starts chatting up Adrianna \"Adrian\" Pennino – he sounds alternately shy and just weird, enthusing about his two pet turtles and deeply proud that his nose has never been broken. Theirs is one of the strangest and yet most convincing movie romances ever filmed. Talia Shire's Adrian is no more a conventional romantic lead than Rocky is: she's shy to the point that one of Rocky's acquaintances cruelly describes her as \"retarded\". Rocky's clumsy pursuit of her shows how well matched they are – his own confidence is skin deep, as their scenes together demonstrate and there are few movie dating scenes as frankly bizarre as the ice rink sequence.\nIt is this quirky characterisation that makes both Rocky and Adrian so endearing. Stallone fits this role perfectly, giving a naturalistic performance that includes a whole spectrum of emotions, his tender scenes with Adrian contrasting with his later fury at trainer Mickey and his obvious nervousness as the fight with Apollo Creed approaches. Stallone the writer's other characters are all quirky in their own way, from Adrian's brother Paulie to confident and egotistical showman Creed, and he pens dialogue for them that often sounds like the sort of realistically inconsequential and irrelevant small talk that real people engage in. \nShire is as convincing as Adrian as Stallone is as Rocky, and strong support is provided by Carl Weathers as Creed and Burt Young as Paulie, although Burgess Meredith mostly just rasps a lot and looks grumpy as Mickey. During the climactic boxing match, Stallone and Creed both look genuinely battered and exhausted: it's a tribute to the acting and make-up, but nonetheless it isn't surprising that both incurred injuries whilst filming the scene. \nThe climactic fight is very well choreographed. Carl Weathers plays up to the camera perfectly as Apollo Creed. It looks convincing – it's no wonder that both actors sustained injuries – with the pair looking realistically sweaty and exhausted. John G. Avildsen rarely crops up on people's lists of their favourite directors and his career can be fairly accurately described as variable, but he does a solid job here and delivers some scenes that have become iconic, most notably Rocky's training montage with its equally iconic \"Gonna Fly Now\" theme. Indeed, the soundtrack is sparingly used, so when it is deployed it packs – if you'll pardon the pun – a real punch. Cinematographer James Crabe's camerawork helps, since his reliance on medium and long shots helps to give the film the look of a documentary which adds an air of realism and the use of the Steadicam benefits the picture enormously.\nI'm not sure that Rocky is a great film: it doesn't quite have the right mix of quality ingredients. But it's a lot less predictable than a summary of its plot might suggest, and a lot more interesting too. The credit for that is mostly due to the central performance and impressive script-writing of Sylvester Stallone and the overall result is a film that whilst not entirely deserving of its impressive reputation is nevertheless rather enjoyable.",
            "review_date": "2020-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original story of the triumph of the nobody, this ignited my love for the entire series. Iconic characters and a grossly underrated romance.",
            "review_date": "2020-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great underdog story, combined with Avildsen's direction, Stallone's script, the performances of the cast, Conti's score, Crabe's cinematography, Halsey and Conrad's editing, Cassidy's production design, Molyneaux's set decoration, Cambel and Hutchinson's costume design, underdog mentality, emotional weight and boxing sequences, Rocky proves that it deserved to win the three Oscars that it won and that it truly ranks amongst the greatest films ever to grace the silver screens!!!",
            "review_date": "2020-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps the most well-known soundtrack in the world, simply fantastic film due to the character's tragedy and his way of fighting the difficulties that appear",
            "review_date": "2020-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true classic and the greatest sports movie ever made.",
            "review_date": "2020-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great boxing movie, this and Rocky II are my favorite sports movies of all ttime i really enjoyed these two and watched it countless times and it never gets old",
            "review_date": "2020-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "will remain in history",
            "review_date": "2020-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Today's formulaic is yesterday's blockbuster; Rocky had the cojones to do the unthinkable in the '70s: create a working-class hero that loses. Still an inspiration decades later. (4/5)",
            "review_date": "2020-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Favorite series from Sylvester Stallone! Rocky Balboa and his boxing matches, along with his training! Pretty cool to see him doing pretty well against Apollo Creed!",
            "review_date": "2020-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Story fulfills the dream of all mediocre athletes dream to make it to compete at the highest level, emphasizes how skill isn't everything and that heart and try matter also. Story also portrays nicely the mental problems people suffer with and that addressing these problems and dealing with them will make the life better.",
            "review_date": "2020-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wait a minute, this isn't baseball.",
            "review_date": "2020-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Rocky movie. Storyline was prefect and acting was spot on.",
            "review_date": "2020-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hehehe at the time of this review the audience score is 69 percent!",
            "review_date": "2020-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's so rare to see an honest man in a movie or in real life.",
            "review_date": "2020-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This classic sports drama is very good. Sylvester Stallone shines as Rocky Balboa and the rest of the cast did a spectacular job as well. The plot to the movie was very good and it gets better throughout. This movie is about determination and a chance to show the world that you can be more than just a fighter by believing in yourself. It's a feel good movie that everyone should see. If you haven't seen this movie yet, check it out. You'll love it.",
            "review_date": "2020-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One the best movies of all time .\nI give me rage every time I watch it ,\nEvery sport movie after rocky have a piece of rocky in them .",
            "review_date": "2020-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic movie about a guy who grows up with nothing and as a nobody, and works hard to go up against the best boxer in the world and go the distance. This movie foretells a powerful story with great acting and writing.",
            "review_date": "2020-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its very good i like me much very fresh",
            "review_date": "2020-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie it has the best moments in this film if everyone loves the 70's they gotta love this.",
            "review_date": "2020-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked Rocky, but I feel like there were a lot of scenes and character moments that seem to come and go out of nowhere.",
            "review_date": "2019-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A profound, beautiful, heart jolting, boxing movie with a great cast and score. This film is a must watch for anyone who knows what a movie is. This movie will touch every inch of your heart.",
            "review_date": "2019-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great series! The first one is a little slow for me at times, but sets the stage nicely.",
            "review_date": "2019-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is one of the best films ever made,with an outstanding cast,direction,and story,the character of Rocky Balboa steals your heart with his heart of gold and personality from the very beginning,and by the end of the film you're cheering for Rocky,the film is full of interesting and likeable characters from the shy but secretly beautiful Adrien,to the suave and cool champ himself,Apollo Creed. The writing is all 100% and genuine,putting you in the time and place of the story. All together Rocky is just one of the movies that you gotta see.",
            "review_date": "2019-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "He didn't even win. I thought he was going to knock him out. That was disappointing. The boxing scene was good even though I don't like boxing. Adrian was lame and Rocky was a bum. ",
            "review_date": "2019-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heading into this, with it being my first time watching 'Rocky', I was wondering if it was an overrated film from yesteryear. It isn't. Sylvester Stallone excels as Rocky Balboa, in a film that is paced perfectly and develops the characters very nicely. Some cracking music in it, with more to come I believe. A must-watch.",
            "review_date": "2019-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Totally one of the best movies That Sylvester Stallone Movies I’ve ever seen ",
            "review_date": "2019-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was absolutely amazing I absolutely loved it so good I definitely recommend it and I am going to give rocky an A+",
            "review_date": "2019-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Who doesn't love Rocky! Classic movie that has to be seen by everyone. ",
            "review_date": "2019-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once you really get into it, Rocky is very enjoyable as a great movie.",
            "review_date": "2019-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can't hate Rocky, it's one of my favs. Sylvester Stallone went from a nobody to an absolute actor hall of famer. The only troubles with this is the audio quality, but it's fixed in the second. (I assume they didn't have a huge budget) A great underdog story, great cast, great music. Even filled with a great love story. ",
            "review_date": "2019-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What more can be said about this classic? It spawend a franchise that i feel has been so natural from the second all the way to Creed. But as for the movie itself, its top noch, the craftsman ship put into Stallone's passion project really shows, and it succeeds. Stallone is a fantastic writer. more then people give him credit for.",
            "review_date": "2019-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A timeless, classic boxing flick that can be equally enjoyed today.",
            "review_date": "2019-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The much beloved Rocky saga from Sly Stallone began with this film and it is indeed a great film, the best of the series in my opinion. What makes Rocky special is that it concentrates on characters, not sports. It would be disingenuous to say that the climactic boxing match is unimportant - it is, after all the movie's centerpiece - but that's not all Stallone's movie is about. There are only two fights - one at the beginning and one at the end. In between, every screen moment is used to develop Rocky as a person. He is not traditional hero material - he's crude, stupid, boorish, and has limited aspirations. Nevertheless, there's something likable about the guy, and it has its root in the gentle, caring way he treats Adrian. And it's this relationship that's the key to making Rocky's ending triumphant. He may lose the fight, but he gains so much more. This is movie magic at its finest. ",
            "review_date": "2019-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies ever made.",
            "review_date": "2019-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Call me sappy but I absolutely love this movie! It's so heartwarming and enjoyable to watch. Although you may have to turn on captions when you do, the voices are a bit mumbled. However it's perfect :D",
            "review_date": "2019-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The BEST Rocky movie! Beautiful story! A must-see for anyone and everyone! Very motivational!",
            "review_date": "2019-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is a slow burn but a very interesting one.  Every character is very well written plus the character of Rocky you always want to see succeed.",
            "review_date": "2019-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film revolves around Rocky, one of the most compelling characters in cinematic history, as well as an engaging group of supporting characters. Director John G. Avildsen puts the characters over the sport, just like any great sports film should. By the end, you're rooting for Rocky, which shows just how powerful the film is at developing him as a person, and how likable and relatable he is. Overall, Rocky is a motivating film for everybody and can be rewatched over and over again.",
            "review_date": "2019-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "HEY YO MAN ADRIAN!!! If you don't watch this movie you have no personality and you are disrespecting Sylvester.",
            "review_date": "2019-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is a fictional character, but as real as any man from the mid 1970's era. The film captures Philadelphia in a beautiful but raw time. Rocky is timeless...Rocky is truly a love story first and foremost. The story completely unbelievable as far as boxing is concerned, over shadowed by a man who wants to become something better then who he believes he actually is, which is a bum. Love propels Rocky to fight, endure, battle, and never give up, because of the love from his woman, Adrian. Rocky strives to be a better man, which is true for almost every man who has a loving woman on his side. Rocky, is a film of what people and relationships used to be about. Sticking together through hard times, being humble, and ultimately coming through to the other side!",
            "review_date": "2019-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed this film , watching again after all these years , I think it still hold up pretty well. It actually has a lot wrong with it . The choreography makes it pretty obvious that nobody is actually fighting . Talia shire is not my favorite actor, neither is Stallone , but the dialogue is great , and it's really got a charm that's hard to put into words . Especially after I saw how bad some of the sequels were. Burt Young and Burgess Merideth are two of the best character actors ever.",
            "review_date": "2019-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is a classic underdog story. One of the best films of the 1970s. ",
            "review_date": "2019-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love the whole Rocky series.",
            "review_date": "2019-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies, this is a movie everyone knows and true classic",
            "review_date": "2019-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest sports movie of all time.",
            "review_date": "2019-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best underdog stories.",
            "review_date": "2019-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This down-to-earth classic love story holds up better than nearly all modern films and continues to inspire and tear pull to this day.\nA+",
            "review_date": "2019-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a little hard to understand maybe it just hasn't aged very well but it had some good scense",
            "review_date": "2019-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sylvester Stallone goes the distance in this powerful and entertaining masterpiece!",
            "review_date": "2019-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is way more than just a sports movie. I've seen people write Rocky off as a by the numbers sports movie with no quality or intelligence to be found, but it is much more. Every second of screen time you can feel the heart put into this movie from the amazing behind the scene story of Sylvester Stallone making Rocky to the love of Philidelphia poured in. If heart isn't enough for you, have no fear because Rocky is chocked full of outstanding and memorable characters. Almost every single character in this movie will draw you in and make you root for them from Sylvester Stallone's humble and lovable Rocky Balboa to Carl Weathers's charismatic and charming portrayal of Apollo Creed. Rocky features some of the most realistic and well-written characters in recent cinematic history. The movie starts off a bit slow but when it really starts, there's no stopping it with iconic training montages and an emotional climax of a final fight all of which resulted in Rocky being they underdog movie. If you like stories based on well-written and likable characters with iconic cinematic moments, Rocky is the movie for you, give it the chance it deserves.",
            "review_date": "2019-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stallone's best film, this has a predictable plot, but with some great acting, and the will of the underdog to never give up, this shows you personal goals can be achieved, even if you don't come out on top.",
            "review_date": "2019-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quirky, fun and feel good movie with a great story and characters",
            "review_date": "2019-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked Rocky, but I feel like there were a lot of scenes and character moments that seem to come and go out of nowhere.",
            "review_date": "2019-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sylvester Stallone did something great by sticking to his will of playing Rocky Balboa, as he incarnates him perfectly. And he has made a masterpiece. It's one of the most interesting sports films I've ever seen, it tackles themes of despair, self-confidence and victory. And it's not just a sport flick, the script is very well written and shows us the hypocrisy of the American Dream and the reality of the blue-collar society. And that last fight at the end was pretty suspenseful. Overall, Rocky is a good classic for sure. Recommended!!",
            "review_date": "2019-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a big, warm crowd-pleaser with a surprisingly charming lead character and a beautiful love story at the center of it's narrative. I had seen this twice in full previously and I've witnessed snippets of it several times whether on TV or at a recreation center but re-watching it I was able to appreciate just how good Talia Shire is as Adrian and yes, be inspired in a very clichÃ (C) fashion. If you have a father born some time in the last 60 years then you will almost have definitely seen this film but even if you're a teenage girl with little to no interest in sports, like myself, it's still a very enjoyable film to watch.\n\nRocky Balboa, Sylvester Stallone, is an Italian-American man working in Philadelphia as a Mafia enforcer while chasing dreams of being a heavyweight boxer. His manager and trainer is Paulie Pennino who pushes him to make more public appearances and hype up his fights more. Rocky also romantically pursues Paulie's sister Adrian, Talia Shire, as he prepares to fight the fearsome Apollo Creed in a match that may or may not be fixed. Rocky begins to doubt himself as the fight approaches but encouragement from those around him cause him to believe in himself.\n\nThe most interesting part of the film was, to me, the love story as we see an unintelligent but sweet oaf fall in love with the shy, bookish young woman. Their first date, on which she ice skates around an empty rink whilst he runs along side her and tells her about boxing, contains better dialogue than you would expect from a sports film and the chemistry between Stallone and Shire is so great that this somewhat unbelievable love story feels genuine. Yes, their â~love' scene does seem a little non-consensual in today's #metoo era but I believe that Adrian does show consent and we see two people grow more comfortable with themselves in a healthy and loving relationship. Adrian does begin to dress more like a 1970s model towards the end of the film but Shire retains her sensible, motherly attitude in how she approaches the character and the final scene in which they embrace gets my tear ducts flowing.\n\nRocky's relationship to his community is another touch that makes this film special as the film makes an effort to display what makes Philadelphia special as a city. The iconic scene in which Rocky runs all the way up the steps to the town hall and throws his fists up in the air can still create a real rush of excitement in any viewer and as we see a wide shot overlooking Philadelphia we understand why Rocky is proud to be from this city. Seeing him punch meat on local television is funny but it also gives you the sense that people in this city really do care about the plight of this uneducated boxer because they can identify with him. The only other films I really associate with Philadelphia are those of M. Night Shyamalan and those quickly decreased in quality.\n\nStallone's central performance isn't what you would call great acting as he appears to be playing a semi-fictitious version of himself but he injects the character with a gentle giant persona that makes it hard not to root for him. All of the supporting players are great as we get a lot of unexpectedly sweet tough men and as previously mentioned Shire is worth the price of admission alone. The film is more than the sum of it's parts in this way in that most of the acting isn't on the level of Henry Fonda, the writing is pretty basic and the film doesn't look exceptional and yet it's a truly great film.\n\nThis is a film that can be watched at any time, in any place with or without company. It doesn't require a huge amount of engagement or analysis to be enjoyable and will probably tug at the heartstrings of even the most cynical audience member.\n\nConsidering this as a Best Picture winner however is more difficult as it was up against the hugely influential classics Taxi Driver (1976) and Network (1976) both of which wrestle with weightier themes and are widely considered two of the best films of the 1970s. I would have awarded Taxi Driver because it is a great film that's darker and more interesting than Rocky and rewarding Scorsese for one of his best films would mean that Gangs of New York (2002) didn't earn a Best Picture nomination.",
            "review_date": "2019-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This dramatic boxing film is one of the best performances of Stallone",
            "review_date": "2019-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The pinnacle of boxing / sports films. A true underdog story with so much meaning and merit being conveyed from start to finish. I can really empathize with Rocky, from being forced to do the dark deeds of a bookie, to feeling like a nobody in their career of choice. The acting is phenomenal. The pacing is great and there are moments and pillars of this movie that push the movie to the end, making each scene crucial to the finished product. The last 5 minutes of this movie are an achievement to cinema. To avoid spoilers, but to get to the heart of it: Rocky truly won that day. Who's cutting onions in here?",
            "review_date": "2019-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This franchise is a mast",
            "review_date": "2019-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky, one of the most iconic films ever made, is one of the greatest underdog stories ever told, offering an incredible performance from Stallone and the entire cast, while also delivering a great character drama and a moving romance at its core, making Rocky a cinematic classic, even if the sports aspect of this sports drama seems fairly light.",
            "review_date": "2019-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty much as slow as it gets, Rocky feels like two completely different movies. Although with an unnecessarily long background story for its main character, the thrills of the second half and the charming performances mainly by Stallone, are enough to make this classic film worthy.",
            "review_date": "2019-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First boxing movie I ever saw and still one of the best.",
            "review_date": "2019-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Without a doubt the very best of the lot, in fact one of the greatest films ever.\nNo messing with super cameras , same music, slums, down town Philadelphia . A great story.\n\nIf no squeals had been made this would now be classified in the the top 10 films of all time surly",
            "review_date": "2019-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie of all time!!!!",
            "review_date": "2019-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(95/100)\nRocky is perhaps the greatest boxing movie of all time. John G. Avildsen really knew what he wanted to make and it shows, Sylvester Stallone's script is great too and it elevates the movie to an emotional level that you don't get out of most boxing movies. Overall just a classic story of an underdog and a great one too.",
            "review_date": "2019-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky has become a part of popular culture for so many years its hard to look at the first film as a standalone low budget entry in the boxing genre. This is a great film and put the writer and main lead Sylvester Stallone into the stratosphere of Hollywood. Considering what the Rocky series became - popcorn action films with little heart, less intelligence, and a lot of testosterone - it's a somewhat refreshing experience to go back and re-connect with the original, which offers a lot more substance than the sequels. Rocky is not a flawless motion picture, but it is a feel-good classic, and well worth another look. The basic storyline has been done to death over the years; this is still one of the most effective and successful applications of the formula.",
            "review_date": "2019-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Rocky\", released in 1976, follows underdog Rocky Balboa as he sets out to fight a heavy-weight champion. The film made me root for Rocky and made me feel that you can achieve your dreams, even as an underdog and fits into the dramatic genre that way. As professional work, I don't feel that there is anything that could or should have been done differently with the film. Somehow, I never knew that this film was written by Sylvester Stallone and enjoyed the story. I particularly liked the scene where Rocky and Adrian are on their first date. Rocky is trying so hard to make conversation with her and relate to her that he shows her his dislocated finger. I laughed out loud watching that scene! Directed by John G. Avildsen, I appreciated that he chose to use a lot of shots where the characters favor one side of frame. To me it clues us into moments of isolation that the character is experiencing. This is evident in the scene where Rocky and Paulie are arguing in the hallway over Rocky dating Adrian. Edited by Scott Conrad and Richard Haley, my favorite edit was when the scene was cutting between the interview with Rocky and following his training methods to Apollo watching Rocky's interview to men taking bets on rocky. It added so much to the story to have insight into each person's perspective on the match and see what's at stake. Acting-wise, I particularly enjoyed Talia Shire's performance as Adrian. My favorite scene of hers was when Rocky first comes to see her for dinner with Paulie. Adrian comes out of the kitchen, sees Rocky, and turns right back into the kitchen in one fluid motion. It immediately clues us into her feeling bashful without her having to say anything. In regard to cinematography, I enjoyed the scene where Rocky and Apollo have a TV interview. James Crabe captured the aesthetics of how interviews on TV looked then and it created a great contrast for the rest of the scenes in the film. One of my favorite examples of sound design was when Rocky and Adrian say good night to each other, and you can hear a train slowly getting closer to where they are in the background. The trains are a huge part of the city and that touch brings us as an audience even deeper into the story. Overall, I think the production value is of great quality considering the period that the film was shot in, as well as the minimal budget it was shot with. You can tell that the shots of Rocky running through the streets of Philadelphia were shot separately from the rest of the film (they were done guerilla style) as the production value isn't as high as the other shots. The guerrilla shots are much grittier.",
            "review_date": "2019-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jaw Dropping, Edge On Your Seat, Excitement",
            "review_date": "2019-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is pneumatalily known as a great classic. It stars Sylvester Stallone who plays the underdog Rocky who gets a chance to fight Apollo Creed in the ring for a shot at the title. Sylvester Stallone doesn't only give an outstanding performance (which got him an Oscar nominee) he even was able to write a script which was very good. Despite Rocky's lines getting quite repetitive at times. This film is actually loosely based of a true story, about the fight between Muhammad Ali and Chuck Wepner. Here is the story about Sylvester Stallone's inspiration. At a theater in Los Angeles, struggling actor Sylvester Stallone watched the Ali-Wepner fight and promptly went home and banged out the script for a little movie called \"Rocky.\". It wasn't based on a true story -- not directly. But it was inspired by and borrowed heavily from a true story.\n\nI do not know who done the boxing choreography in this, but who ever did, done a brilliant job. Sylvester Stallone done the boxing choreography in the third one, so I am not sure if he done the first. I got one problem with this movie and that is the romantic plot between Rocky and Adrian (played by Talia Shire). The problem with the romantic side of the film is that you focus more on what is happening with Rocky's love life, other than you worrying about Rocky training for his fight. Every single actor went there hardest into this film and gave the best performance out of the five in the franchise.\n\n The training sequence in the final is the most memorable training sequence in the entire Rocky franchises because all the others are basically copies of the first but with a twist. The final fight scene with Rocky and Creed was the only non predictable final fight in the saga because as this is the first and if there was a sequel confirmed at the time, you would think that he would win. That is what the final is jaw dropping excitement, which will always keep you on the edge of your seat wondering what will happen next. \n\nSo overall Rocky is jaw dropping excitement. I would go as far as to call this a classic alongside (Jaws, Back to the Future, E. T, Jurassic Park etc.) But isn't as good as them. It is definitely the best one in the saga because it is a classic and the others tend to get same old, same old. \n\nGrade A+ Jaw Dropping",
            "review_date": "2019-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My experience with the Rocky series is only just the beginning but this movie is worthy of a 4 star rating cause of the characters are excellent, the acting not that bad and the story is really well written",
            "review_date": "2019-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny and heartwarming, Rocky is a classic underdog film that boasts Sly's most complex performances. With well developed characters and a solid rivalry between Balboa and Creed Rocky is a a dramatic and fun film.",
            "review_date": "2019-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant this is more than just a fun sports drama it is an emotional journey about two people who love one another and Rocky's desire just to last the full fight.",
            "review_date": "2018-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4.5/5.  A classic for a reason.",
            "review_date": "2018-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For the budget and for the acting, it did what it could. But the characters are lovable, and of course the fight is a great build up for a 2nd round. Rocky is no doubt, one of the best sport films of all time.",
            "review_date": "2018-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LOVE THIS MOVIE!!! I admire Sylvester Stallone for his courage and work well done throughout the years.",
            "review_date": "2018-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true landmark in American cinema, Rocky tells an engaging story with memorable characters and will keep you hooked long after the credits roll (which is good since this is a franchise). 5/5 stars",
            "review_date": "2018-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I remember watching the first time of Rocky, when I was 15 years old. Also, I liked the theme song of training, before boxing game.",
            "review_date": "2018-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best sports movie of all time.",
            "review_date": "2018-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still holds up as one of the most influential sports films of all time. John G. Avildsen has made a fantastic touching story, with Sylvester Stallone's best performance as the famous champ.",
            "review_date": "2018-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my third time seeing Rocky and I’ve never really liked it as much as I really wanted to... until now. I have somewhat of a bias on this one, but I don’t necessarily think it will affect my review. Rocky is my girlfriend’s favorite movie of all time and I’ve had several conversations where I confess that I think the film’s just... fine. However, I’ve owned the whole series for a couple years now and I’d never seen the other movies. So with Creed II coming out next week, I’m gonna binge my way to the finish. So expect a lot more Rocky reviews soon. What made this experience different is instead of just watching the movie again, I listened to the commentary track by Sylvester Stallone. That is what made this film a great experience. Stallone explained the little things that I’d never really considered. It’s so obvious that he poured so much into this film. His indepth analysis is very engaging and really brings out the true character of Rocky and Adrian. I still think the cinematography is very well done (those steadicam shots are gorgeous) and the iconic shots at the Philadelphia Art Museum are still so magical. The sound design is very well done as well as the editing. The acting from Talia Shire is really great, Stallone is alright but his weakness is in the writing. Burt Young, who’s character is annoying as hell, gives a solid performance and his subtle facial expressions explain everything he wants to say. Carl Weathers absolutely deserves a shout out for his work in the film. Despite his little screen time, his presence is felt throughout. My biggest issue is mainly the writing. Rocky’s dialogue is so dumb and unintelligible. Like, I get that’s his character but it’s difficult to cheer for a creepy dumbass. I still find the scene in Rocky’s apartment where he flirts with Adrien cringey and creepy as hell. He’s dull and boring and the only reason I really liked him this time around was because Stallone explained his decisions and thoughts. Overall, I still don’t really love Rocky. However, I definitely appreciate it a lot more, enough to give it a 4 star review (AKA a certified good movie in my book). Stallone’s passion is eminent, even if the writing isn’t always on point. The cinematography is fantastic and revolutionary, the fight scenes are electric and satisfying. I can’t wait to watch the rets of the series. 8.0/10",
            "review_date": "2018-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film was almost good.",
            "review_date": "2018-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first 3/4 was a little slow but the finale was a great way to end the movie",
            "review_date": "2018-11-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the original and best,\nrocky overcame the odds both on and off screen\nif you haven't seen rocky you're missing out,\na cinematic masterpiece",
            "review_date": "2018-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing movie that defined Sylvester Stallone's career ",
            "review_date": "2018-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably one of the best and most iconic sports movies of all time. Sylvester Stallone definitely show's his skill as an actor in this.",
            "review_date": "2018-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Here again one of my favorites.. Probably the movie about boxing, about love, about dedication. very inspirational. I love it.",
            "review_date": "2018-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you ever feel that you’ve lost in life, watch Rocky and get back on your feet because boy this movie will boost you morally, emotionally and physically! ",
            "review_date": "2018-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On the one hand Rocky fits seamlessly into the New Hollywood era, with its gritty depiction of a down-on-his-luck boxer in mid-70s Philadelphia. But unusually for its time it has a big feel good ending, although tinged with melancholy, and Stallone impresses as both writer and actor in the film that saw him deservedly hit the big time.",
            "review_date": "2018-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great underdog story enhanced by some gritty direction and great performances by Stallone, Talia Shire and others. What many do not realize is how little Rocky is about boxing. In fact the boxing doesn't even take center stage until well into the second half. This is a character study first and foremost and Stallone should be commended for penning such a heartfelt screenplay. Rocky has entered pop culture lexicon but its important to remember that it started off as an independent feature with a minuscule budget. This is a great start to the career of a fantastic actor.",
            "review_date": "2018-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great touching and enlightening story. If you have not seen it yet, you have nothing to brag about.",
            "review_date": "2018-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky shot a then struggling actor and writer Sylvester Stallone into the A list. This is a great underdog story enhanced by some gritty direction and great performances by Stallone, Talia Shire and others. What many do not realize is how little Rocky is about boxing. In fact the boxing doesn't even take center stage until well into the second half. This is a character study first and foremost and Stallone should be commended for penning such a heartfelt screenplay. Rocky has entered pop culture lexicon but its important to remember that it started off as an independent feature with a minuscule budget. This is a great start to the career of a fantastic actor.",
            "review_date": "2018-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has aged poorly but is still enjoyable",
            "review_date": "2018-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a complete fucking idiot I am for having put off watching this for so long. And what an idiot I am for going in expecting this to just be about a \"boxing match.\" \"Rocky,\" like the other boxing masterworks, is much more than just that. This is a terrifically acted and incredibly sophisticated in terms of narrative. It's a welcomed surprise when most of the best bits in a boxing movie are just scenes of two characters talking. This also ages supremely well as far as movies of this era are concerned. Again -- leaving this out of my life for so long? Big mistake. Long live the champ.",
            "review_date": "2018-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though it could drag, it was a wonderfully inspiring movie with great acting and writing",
            "review_date": "2018-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky shot a then struggling actor and writer Sylvester Stallone into the A list. This is a great underdog story enhanced by some gritty direction and great performances by Stallone, Talia Shire and others. What many do not realize is how little Rocky is about boxing. In fact the boxing doesn't even take center stage until well into the second half. This is a character study first and foremost and Stallone should be commended for penning such a heartfelt screenplay. Rocky has entered pop culture lexicon but its important to remember that it started off as an independent feature with a minuscule budget. This is a great start to the career of a fantastic actor. (Rocky is one of the most inspirational films out there).",
            "review_date": "2018-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie is awful but not in the way you might think it isn't unforgivably terrible it's just super boring there are two fights in the whole movie and one of them is a two minute montage",
            "review_date": "2018-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the first rocky and its not the best but good",
            "review_date": "2018-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good he fight was short but intense the lead up to the fight was great",
            "review_date": "2018-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite Rocky movie that packs plenty of punches and a great script from Sylvester Stallone!",
            "review_date": "2018-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "original never fails",
            "review_date": "2018-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this film is amazing how has it got a 69% why not 70% and above",
            "review_date": "2018-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "old school but a fighter's story, includes adrian",
            "review_date": "2018-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky took a well-worn story and redefined it by delving deep into the characters.\n \nRocky's character arc is so familiar that everyone, even who don't watch many movies, knows every single detail about it. But the movie adds a simple twist, yet a very effective one, in the character's motivations.\n\nBut it didn't stop here, as the movie keeps raising the stakes by making an advantage of all the developments that have been given to all the characters.\n\nThe movie could have easily used the ups and downs of Rocky to evoke our feelings. Instead, the movie succeeded to be very moving by taking advantage of the very new twist that has been added to Balboa's motivations. The result is an underdog heroic character that is by no means clichéd. And Stallone shines in this movie and gave his best performance in his career. There are some moments when Rocky's confidence has been shaken a little bit and the hero starts to tell the message of the story and these moments somewhat worked, and they could have never worked without Sylvester Stallone's superb acting.\n\nI said that Rocky takes advantage of the developments of all its characters. Yes, all its characters!\n\nThe character of Adrian, for instance, has some realistic and genuine details that make the romance between her and Rocky works very well, although the relationship proceeds so fast. Talia Shire performance made Adrian even more realistic,unique and very compelling character.\n\nPaulie is another great character that made the movie even more poignant as it gave some depth for Rocky too.\n\nWhat I didn't like so much is Apollo Creed. In contrast to the rest of the characters, he is nothing but the stereotypical undefeated Champion. Also, all decisions he made exposed the movie's clichéd story. With that being said, his scenes are masterfully directed and he has a very catchy style.  \n\nThe final fight scene is maybe the most realistic fight scene has been shot at that time. And those who think it's not, please watch a boxing match and you'll find that boxing punches make sounds different from the comic book punches sounds that are still used in movies today.\n\n(9/10)",
            "review_date": "2018-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wowzers this movie. Just watched it recently, and I gotta say, this movie resonated with me in a big way. I love the pacing and just the humanity of all the characters in this film. They're not one-dimensional, they all feel like real people. It's not hard to see why this film is regarded as a classic. Now that being said, there's no denying this is a MANS film. I doubt women will extract the same kind of enjoyment and impressions that men will get from this film. Sorry, ladies. But that being said, the themes in this movie are very universal and can be enjoyed by all sexes, it's just that there's no denying this film is aimed at the male soul. Also, soy boys need not apply.",
            "review_date": "2018-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a David and Goliath story on many levels. Man's struggle to get out of a condition he was born into, man's struggle to be significant not only in his community, but to himself. When offered a chance of a lifetime, he has to answer the question to be or not to be. Through a wonderfully chosen cast of characters who act as his guides through a well thought out script, Rocky answers this question.",
            "review_date": "2018-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is an inspirational film that is excellent on every level. The whole theme of never giving up in the face of obstacles has been duplicated, but never equaled. The cast has great chemistry and the final fight is truly remarkable and heartwarming. An absolute classic of the 1970s.",
            "review_date": "2018-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nevermind that Paulie is a raging alcoholic and nobody seems to care enough to even point it out, much less get him the help that he needs. - or that Adrian suffers from crippling social anxiety, only to find herself cured and a strikingly normal person just scenes into the movie. Nevermind that Rocky is a nice/honest person with a passion for animals, yet maintains an unscrupulous job out of unapparent necessity. - Or that his bloodthirsty Loan Shark boss actually seems like a pretty swell guy........Or that his first date with Adrian looked like highlights from a #Metoo incident. It's not about any of that. It's about a blue collar American finding an opportunity. A true underdog story - One that we can all appreciate.",
            "review_date": "2018-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still holds up well to this day..A movie buff really needs to watch this",
            "review_date": "2018-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest sport films ever made.",
            "review_date": "2018-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much like the titular boxer, the film suffers from a lumbering pace combined with an all-around predictable plot/outcome. However, with that being said, this film has a heart, soul, and passion thanks to its moments of vulnerability, character bonding, environment establishment, and music montages.\nSpecial highlights I must acknowledge go to Burgess Meredith delivering a brilliant performance and Sylvester Stallone's solo writing contribution to the entire film....and yes, he is the one and only Rocky Balboa.",
            "review_date": "2018-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie.  Inspirational and possible the greatest underdog movie ever.",
            "review_date": "2018-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterpiece that will never be forgotten.",
            "review_date": "2018-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky, a story of a poor boxer that doesn't have much gets a shot at the world heavyweight title against the world champion Apollo Creed. Rocky Balboa starts the movie working as a debt collector in run down Philadelphia, who's trying to make it big time in the boxing arena. Struggling to do so, his coaches, friends and employees fail to give him the time of day. When Apollo Creed, Heavyweight Champion of the World, comes to Rocky looking for a chance to turn a \"nobody\" into a \"somebody\". The match is suppose to be an easy fight for the champ, but the Rocky \"The Italian Stallion\" Balboa takes this fight as his only shot to make it big time, and gives Apollo a run for his money. This storyline is one reason that Rocky is considered one the the greatest movies on the 1970's and I believe that it is one of the greatest ever. This movie is an all time great because of the amazing storyline and the emotional connection you feel towards the characters, the incredibly small budget they had to produce this movie and all of the awards that Rocky has won.\n\tThe story of a poor man, who becomes rich and gets the the girl, might sound cliche but it feels far from it due of the emotional connection that pulls the audience in. In the review of rocky by Roger Ebert, a creditable critic, says the reason that this movie is great is because the audience feel connected (Ebert,1976). A movie with a good storyline and a bad connection with the audience is a bad movie, a movie that connects to the audience but has a bad storyline is also a bad movie, Rocky has an amazing storyline and the audience feels to be apart of the story. Roger Ebert also states that movies from the 70's lacked that emotional side, so rocky sort of came during a \"emotional drought\". The movie audience loved this movie when it came out because they felt something that the haven't felt in a while, a love for the characters. This emotional side of the movie helps put rocky on the all time great list because people remember how they felt watching this movie and the feel to be apart of the movie. \n\tRocky is one of the most successful movies of all time with a cumulative world wide gross of  over two-hundred twenty-five million dollars. To put that into perspective The Terminator, a movie made around the same time as rocky, and still considered a successful movie made forty million in sales. A reason that Rocky's two-hundred twenty-five million dollars in sales is so impressive is because of their budget on the movie. Rocky was produced with less than a million dollars. Terminator was produced with over six million dollars. The producers of Rocky had to take a mortgage on their homes to come up with money to produce this movie. Rocky also didn't have any really big and famous actors in the movie at the time, so because of that they didn't have to pay them too much money. Just like the movie, these actors were looking for their chance to make it big time and this movie was their chance to make it. They all put everything they had into this movie and it payed off. This movie proves that it doesn't need a lot of money to make a successful movie.\n\tRocky has won several awards and is one of the winningest movies of all time. It has won an Academy Award for Best Picture, Academy Award for Best Director, Academy Award for Best Film Editing, David di Donatello for Best Foreign Actor, Directors Guild of America for Outstanding Directing, and a Japan Academy Prize for Outstanding Foreign Language Film (IMDB,2018). This movie won are was nominated for most of the awards in 1977.  These awards back up the statement that Rocky is one of the greatest film ever created.\n\tMany people view this as just another fighting movie and that this one is just falls in line behind other great boxing movies. This movie is another boxing movie but it is responsible for the birth of the four other Rockys and the new boxing movie creed.\nIn conclusion in a time when not many great emotional attaching movies were out Rocky was produced. The movie didn't need a ton of money and amazing CGI effects to make it great. The movie has a great storyline and some actors and producers that want a shot at making it big time. It won several awards and was one of the best movies of the decade. But Rocky remains one of the greatest movies of all time because of the amazing storyline and the emotional connection you feel towards the characters, the incredibly small budget they had to produce this movie and all of the awards that Rocky has won.",
            "review_date": "2018-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Offers a boldly impactful story, great supporting cast, and one of the all time best characters in cinema with Rocky Balboa.  Reminds me of the internet's response to the last Super Bowl when the Philadelphia Eagle's triumphed over the New England Patriots.  Philly \"must\" truly be a city of under-dogs.",
            "review_date": "2018-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A plain feel good, not complex but yet still compelling and interesting movie",
            "review_date": "2018-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of those rare films that should please everyone, a true underdog story perfectly executed by both director and cast.\nStallone's performance as Rocky is so endearing and has you on the edge of your seat until the final rounds.\nA remarkable movie that deserves to be celebrated.",
            "review_date": "2018-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One Of The Best Boxing Movies Ever Made Up There With Raging Bull IMO",
            "review_date": "2018-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "don't want one..\n\nRocky\n\nThere are some dreadful scenes like cutting an eye for clear vision which is not easy to watch but on the other side it has probably one of the best first dates ever portrayed in a movie; the relation between Rocky and Adrian is easily the best thing in here. Rocky is a smart movie; which came off as a surprise to me, the whole movie is a build up to the much awaited fight giving the perfect value and gravitas to the event that it deserved but fails on living up to the expectation for the choreography is way too lose. John seems like an amateur when it comes to execute physical sequences but does a decent job for the rest of it maybe because he probably didn't have to do much since the writing is good enough to sail on its own and Sylvester is amazing on both the roles with a good enough supporting cast. Rocky is the slow ride that is comfortable and in an appropriate tone to its characters and plot giving enough space for the actors and the audience to chew it in.",
            "review_date": "2018-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For the most part, I really liked this movie. Stallone does a wonderful job making the audience fall in love with the character he plays. The story line is a little predictable, but I believe that isn't always a bad thing. Especially when it's the underdog \"nobody\" vs. the world champ.",
            "review_date": "2018-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "saw it, so long ago.  Think up near Fresno, maybe small theater in Taft.  Not sure.  maybe that was a later Rocky.  Yea, cuz i was in Virginia then.",
            "review_date": "2018-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Five stars.\n\n- Dickey Sauce",
            "review_date": "2018-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the great sports movies off all time",
            "review_date": "2018-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "69% for the best series in the whole world",
            "review_date": "2017-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "rocky is an okay guy but what this movie really needed was more scenes with paulie. he was in about 50% of the film but we didn't get to see enough of him and his reactions. the movie should have been called Paulie instead of Rocky. I would like to see the film center more on Paulie and his life story. Perhaps a new series could be made about Paulie and his various activities.",
            "review_date": "2017-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best screenplays ever written.",
            "review_date": "2017-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In a world full of underdog movies this is at the top of the mountain. \n\nStallone is as good as he ever was in this film and it's a motivating masterpiece! Boxing was at an all time high in the late 70s early 80s and this franchise was a big reason why.\n\nTo hear us yell \"YO ADRIAN!!\" head on over to broforcesquad.com",
            "review_date": "2017-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is a truly outstanding story about a down on his luck boxer starring and written by Sylvester Stallone! Stallone's amazing script and fantastic performance give the film exactly what it needs to be one of the best and most famous movies of all time. Everything that's good about the film brushes aside any complaints there might be and is a must watch!",
            "review_date": "2017-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'ts very predicable, and maybe has a few oddly paced scenes. But, by the time you reach the iconic steps/montage sequence, you just can't help but push those flaws aside, and be caught up in the story & the characters journey.",
            "review_date": "2017-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Zero chemistry between the two leads, hammy acting, and a boring storyline make this one of the most overrated films of all time.",
            "review_date": "2017-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie with unpredictable ending.",
            "review_date": "2017-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie of all time.",
            "review_date": "2017-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crap movie. Stallone is a crap actor",
            "review_date": "2017-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The perfect underdog movie",
            "review_date": "2017-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful, emotional, exciting, and unforgettable experience. Flawless and easily Stallone ' s  best film.",
            "review_date": "2017-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dramatic, interesting, touching and most of all INSPIRING movie. This is the first movie I ever saw and what a great one it was.",
            "review_date": "2017-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's more of a love story for poor unappreciated folk.  Don't expect brainwashed millennials to understand.",
            "review_date": "2017-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4.5 stars. Because it is iconic, unforgettable and beautifully powerful, 'Rocky' achieves it all. Strong, emotional, and authentic, Stallone's film is both simple and magnificent, both obviously American and universal, both a little dated and definitely timeless. And no other film shows a man's determination like 'Rocky' does.",
            "review_date": "2017-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A much better 'Marty' if you ask me. Tells the story of a penniless fighter who gets lucky and gets one shot at the heavy weight title. Yeah the scenes where Stallone is hamming it up are silly, but I love this movie. One of my favorites.",
            "review_date": "2017-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its a great movie about a boxer trying to proof that he's a champion. its smart written, great acted, and isnt just a sport movie... its a inspirational one",
            "review_date": "2017-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While not my favorite movie, I still really like it and think it's great. The best Stallone movie, by far. So touching and cool. Every man should see this.",
            "review_date": "2017-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best Stallone movie, definitely the most influential.",
            "review_date": "2017-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My opinion---\n\nFor all this beautiful saga \"ROCKY\" deserves a beautiful 5/5 and it\nis necessary especially to be well said and realize that at the exit of\nthe film, this one was a huge world success and the actor Sylvester\nStallone propelled to the Zenith of the world's biggest stars and still\nmarks all the spirits of those who followed him and still follow the\nimmense career of world cinema giant Sylvester Stallone because his\nwhole career is exceptionally good Completed. Thank you, Mr. Stallone.\nThanks Sly - \"We will never forget you\"",
            "review_date": "2017-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Funny, Inspirational, And Determination is this film in three words. This is about a man and his struggle to go the distance as best he can which is something lots of young viewers need to see to follow your dreams and not give up.",
            "review_date": "2017-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing first performance by Stallone and others, very motivational movie.",
            "review_date": "2017-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you don't like this movie, you're either a cynical prick or just some nitwit who is pissed off because he didn't win the fight at the end.",
            "review_date": "2017-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Believe it or not but I hadn't seen this film until now. I'm not a fan of boxing, so have no interest in boxing related movies. This film was okay, but not as good as many would claim IMO. Maybe it was back in the day, but not in 2016.",
            "review_date": "2017-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With Sylvester Stallone's unforgettable performance as the titular character, a good script, an amazing soundtrack (with the theme song \"Gonna Fly Now\" leading to one of the best cinematic montages ever) and some iconic sequences, Rocky is one of the best, if not necessarily THE best, inspirational sports dramas to date. This movie will certainly have you going the distance. If it doesn't, I don't know what will.",
            "review_date": "2017-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A heartwarming story of an everyday amateur that gets his chance and makes the most of it. Stallone gives an incredible performance, even if he is hard to understand sometimes.",
            "review_date": "2017-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I will have to give this film a 4.5 rating. This movie is really good. Although the story is a bit slow, the acting is exceptional, the characters are memorable, and the script is fine. Sylvester Stallone did a fantastic job as Rocky Balboa, the main character in this film. This is such a great film, and if you haven't already watched this movie, I suggest you do.",
            "review_date": "2016-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best boxing film of all time!",
            "review_date": "2016-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "John G. Avildsen's now classic boxing melodrama is without doubt the greatest underdog story in cinematic history. It concerns a 30 year old, two-bit club fighter from Philadelphia named Rocky Balboa, played brilliantly and with true conviction by Sylvester Stallone in a breakout performance that earned him a richly deserved Academy Award nomination for Best Actor. Rocky gets a supremely rare \"million-to-one shot\" for fame in a championship bout against the Heavyweight Champion of the World, Apollo Creed, played terrifically by Carl Weathers. It is Apollo who dreams up this publicity stunt to give a nobody a title shot during the bicentennial celebration of America. No one takes Rocky serious, but he trains hard with his old trainer Mickey Goldmill, played sensationally by the late great veteran character actor Burgess Meredith in memorable turn that earned him an Academy Award nomination for Best Supporting Actor. Rocky will gain his self-respect and prove to everyone that he can go the distance. The lovely Talia Shire received an Academy Award nomination for Best Actress for her marvelous performance as Adrian, the painfully shy pet store worker who falls in love with Rocky, and Burt Young received an Academy Award nomination for Best Supporting Actor for his superlative performance as Adrian's older brother Pauline who is a pain-in-the-ass drunkard. Skillful Academy Award winning direction by Avildsen, with a compelling Academy Award nominated original screenplay by Stallone, and an evocative Academy Award nominated score by Bill Conti. A triumphant film that is so inspiring and moving, it perfectly demonstrates the strength of the human spirit to overcome all odds. This low-budget cinematic gem became a surprise mega-hit box office sensation at the time of it's release and was followed by 5 sequels and a 2015 spin-off hit sequel \"Creed.\" Winner of 3 Academy Awards including Best Picture. Highly recommended.",
            "review_date": "2016-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unbelievably effective still, for a movie made 40 years ago. So many gritty hallmarks of '70s cinema meet a completely offbeat premise that isn't afraid to mix meat bag street life with lofty, almost twee romanticism. Sad it took me so long to watch this, given my love for Rocky IV, Rocky V (ironically - Tommy Gunn baby!) and Creed.",
            "review_date": "2016-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "rocky,one of the best films of all time, without a doubt the best sports film ever. Brilliant acting from stallone, burgess meredith as micky the manager. The training scenes and the music are inspirational. Carl Weathers as Apollo Creed is amazing and an ending that could be watched over and over again. Stallone is one of the best stars of all time",
            "review_date": "2016-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love it, when aspiring film makers get to get their projects off the ground and Rocky is very aspiring.",
            "review_date": "2016-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film deserves its accolades. ROCKY is an excellent sports drama that is worth watching at least once. The film could be a bit less predictable (save Rocky not emerging victorious in the climatic fight against Apollo Creed, which was a bit left-field but not much when you consider Rocky stated several times over the course of the film he only wanted the distance with Creed.) but it shines in many other areas. For example the casting is spot on, most of the characters deliver a memorable and skillful performance (Especially Stallone) and the ones that don't usually aren't dwelled upon too much. The film's age shows and it may get a little boring for younger ones and those watching it today who might be used to cg heavy special effects extravaganzas but it can still be appreciated with the right mindset. the soundtrack is excellent though at times distracting and the drama and other interesting sequences are sometimes dragged down a bit by boredom stemming for earlier parts, but the script is great and acting superb so these complaints start to seem meaningless after further examination. This type of quality IS worth repeat viewings for some as said before is fine to watch just once to get a great cinematic experience and get the film's message. the boxing action and visuals might feel a little dated, but a remaster might take some of the film's charm. ROCKY is an amazing motion picture that you should definitely see. I'd give ROCKY a 9/10.",
            "review_date": "2016-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's a moment in Rocky where Carl Weathers (evoking Muhammad Ali as the sharp tongued champ Apollo Creed), hatches a plan for his next main event fight in the absence of any high profile opponents. He'll fight an unknown, a random local contender, and it'll work. It'll work because, as Apollo says \"I'm sentimental, and a lot of other people in this country are just as sentimental.\" The scene plays like an admission from writer Stallone and director Avildsen. Rocky is here to prey on our sentimentalities. It's completely predictable, hopelessly clichéd and glaringly transparent in its schmaltzy coaxing of our sympathies. You'd be forgiven for thinking of Rocky as On the Waterfront's parallel universe, in which Terry was able to break away from his seedy world just long enough to become a contender. What Sylvester Stallone and John G. Avildsen offer us is by no means anything new, yet for all its missing subtleties, it's impossible to deny that Rocky works. \n\nWhy is this? It's because it speaks to a fantasy that's innate in all of us. It's a film which gives us the right moment, and the right characters, in which that story we all wish to lose ourselves in can be realised. How easy is it to place yourself in Rocky's shoes? How fun to release your cynicisms and live those childhood fancies if only for a short while? \n\nAnd we get the perfect  vicarious underdog in Stallone's title character. His is a fantastically charming performance. As well as Terry Malloy, there are also traces of Herman Munster in Stallone's benign but droopy features, and Rupert Pupkin in his clumsy talkativeness and lame humour. \n\nRocky would like to think of himself as an older brother to those dwelling in Philadelphia's chilled streets. He spouts his advice and tries to help, but we know he's really trying to convince himself he's something more than a two-bit debt collector working the docks. He thinks of himself as a bum, as do most people, and he fights nobodies for little money. Boxing is his real passion. \n\nIn other hands the plight of Rocky Balboa could have been an awfully ham-fisted one, but Stallone allows us to fall in love with his character. We want Rocky to succeed, to prove everyone wrong and realise his self worth; when we see Rocky raise his arms in fantasy atop of those famed stairs, there's little doubt as to how affected we've been by his story. \n\nRocky gets his chance to become something more when Creed selects him as the local contender who gets a shot. Rocky is gifted an opportunity to be \"somebody\" (as Brando would say) by stepping in the ring with the champion, but this isn't where the true drama lays. What's surprising about the film is how little of it is about boxing.\n\nMost impressive about Stallone's writing and Alvidsen's direction is how devoted they are to their characters, letting them materialise into much more than the mere archetypes they so easily could have been. It's the attention they pay to their characters that allows the championship fight to be so dramatic, to become something much more than a punch-up for a belt. \n\nTalia Shire plays Adrian, the love interest of Rocky, a painfully shy pet store clerk who he drops in on like clockwork to crack \"dad\" jokes and babble to. Their story is the true heart of Rocky, and it's one of genuine romance, the two finding a much needed appreciation for themselves in their affection for each other. Burt Young plays her belligerent, heavy drinking brother Paulie, a friend of Rocky's and a volatile schlub who's at once envious of Rock's new success, and latches to it like a determined leach. Burgess Meredith plays the trainer at Rocky's gym, the irritable, gravel voiced Mick who resents Rocky for never fulfilling his potential. He senses a chance for Rocky to finally redeem himself, but It's also an opportunity for his own underachieving self to find redemption. In the film's most downbeat moment, Mick grovels to Rocky, begging for the chance to train and manage him, despite so many years of browbeating. It's a harrowing moment of vulnerability, and the film is drip fed moments just like it, moments which bring our sympathies to life for the characters.\n\nRocky's transparency is a problem. It swings sentimentality around like a flail and it treads narrative ground that has been stomped to the crust, its obviousness in doing so always threatening to take us out of the moment. But Apollo's right. We are sentimental, we love being sentimental, and Rocky has enough passion and enough heart to make such sentimentality warranted. \n\nIf you enjoyed reading this, please head over https://filmfracas.wordpress.com for more.",
            "review_date": "2016-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky and Adrian are so bloody cute. I honestly thought this was a story about a boxer who was a meanie but he's such a sweetheart.",
            "review_date": "2016-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What sets the original apart from the rest of the series (with the exception of Rocky Balboa and Creed) is the emotion and depth. You feel for Rocky because he's supposed to represent the average person facing the world. He's supposed to be us. He's fighting not for his ego, but for himself to live. He's been fighting all his life. Rocky is a beautiful piece of cinema and one of the best and most historic movies ever made.",
            "review_date": "2016-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky one is beautiful, the soundtrack is spectacular, the photograph showing a depressing Philadelphia is sensational, Stalonne showing that it is a good actor, the script though halfway cliche, is perfect, showing the angusitias and dramas of each character in the film, the fight is fantastic scene to the time, worthy of oscar, Rocky one is almost perfect, maybe some angles of camera (common) and the rhythm is not good, it's still a very movie, very good.",
            "review_date": "2016-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the biggest classics in cinema that never gets old. After rewatching it after so many years I was pleasantly surprised that I really enjoyed it. Stallone plays such a great character that is humbling and refreshing to see. 5/5",
            "review_date": "2016-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie. But pretty slow and boring in many scenes. Love the theme song, training, performances, & fight",
            "review_date": "2016-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Since I saw Rocky in 1976 it's the only movie that I have been to where the audience stood up and cheered.",
            "review_date": "2016-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good film! I wanna rate higher but the film is quite slow and boring in parts.",
            "review_date": "2016-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolute all-time classic. One of the best sports movies ever. Sylvester Stallone is a maestro for bringing Rocky Balboa to life.",
            "review_date": "2016-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This isn't a unique storyline, but it is done in an emotionally impactful way.   The combination of some beautifully shot scenes - I especially loved the ones of Rocky running through working class Philadelphia - and Sly Stallone's heartfelt performance throughout, compels us as viewers to cheer for Rocky's success.  He represents the working class American of an immigrant family, who comes to America seeking out opportunities for a better life.  Sure, there are some minor scripting flaws, but they're negligible.  I absolutely adore Talia Shire as Adrian.  She's so lovely.",
            "review_date": "2016-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's always important to be aware of what you are about to watch whenever you are going to watch a Sylvester Stallone movie. There are multiple movies on his resumé that could have easily been thrown out of the window. \"Rocky\" is definitely not that movie! This is a movie that he wrote and starred in and showed his talent on both sides of the camera. It is a classic, but beautiful story about the hero who fails but still gets the girl in the end. Stallone plays the main character of Rocky Balboa and he shows all of his talents this time around. He proves that he is someone who is to be taken serious by the audience. The supporting cast, which includes stars like Talia Shire, Carl Weathers and Burgess Meredith helps the story forward and helps give our main guy a good sense of accomplishment in the end. Oh, and a lot of challenges! The twist to the classic love-rival story, ended up being one of the most successful accomplishments of all time. Who would have known...??",
            "review_date": "2016-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the best boxing movie ever",
            "review_date": "2016-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky brings a story that is not simply a sports film with some problems along the way as it ussually happens. This is the story of a guy that is in a bad position and is willing to give everything, even his life, to prove to himself that the world has still a lot to keep moving forward.",
            "review_date": "2016-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Although by today's standards probably not too original, it's a great underdog story and really not even a boxing movie.",
            "review_date": "2016-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm going to come out and say it. I didn't like this film. I know that\nthis is going to get me hate, but it's the truth. I don't have any\ninterest in boxing, so the film's content or Rocky's struggle didn't\nreally resonate with me, as well as it could have done. I didn't\nparticularly like Stallone's portrayal of Rocky either. Between his\nmumbling and his shouting, I couldn't understand anything that he was\nsaying. This didn't really help with me empathising with the character.\nAlthough all credit to the set-designers. Rocky's apartment did look\nlike a horrible place to live with the peeling wallpaper.\n\nJust thank God, Burgess Meredith was in it.\n\nRead my full review for more: http://goo.gl/mM9IxQ",
            "review_date": "2016-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is great, as it tells you that you can keep trying if you make the choice to. It inspires you to keep going when your in doubt. This is an amazing warm-hearted film.",
            "review_date": "2016-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An all time classic truly standing the test of time.",
            "review_date": "2016-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I must be missing something here. Obviously this is one of the biggest film franchises ever, but for some reason I never really had much desire to see this until Creed came out. That plus this being a Best Picture winner made me decide to finally watch it and if I'm being honest, I felt it was pretty horrible. I don't get it. All of these iconic characters and moments are wasted in an incredibly sloppy film.",
            "review_date": "2016-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Finally watched that classic movie!",
            "review_date": "2016-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie should of gotten 100 academy awards for best all time movie.",
            "review_date": "2016-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic film that set the standard for sports dramas, specifically in the realms of boxing. Stallone is excellent in the lead role, and does a terrific job in writing the film. It deserves all the praise it gets. A clear knock-out!",
            "review_date": "2016-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What retards didn't like this movie? Fuck, it's better than Creed, at least by a little bit. Easy five stars. Not really much wrong with it.",
            "review_date": "2016-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It takes a while to get into but when you do you will see just how amazing Rocky is!!!",
            "review_date": "2016-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What most people don't realize is that Rocky isn't so much of a boxing movie as it is a love story. Well, that's what I got from it, anyway. The boxing is a big part of it, but we don't even get to the real meat of that story until about an hour in. And without even realizing it, we're getting a whole lot of character depth during the first half of the film. \n\nForget the creepy way that Rocky forces Adrian to give him that first kiss. The story as a whole is sweet. She's a true diamond in the rough. It's almost not even believable at first, but the two have so much chemistry that it works. \n\nBut like most of the movie, their relationship is without much conflict. Rocky doesn't overcome any crazy obstacles. He's a lazy boxer who hasn't made anything of his life, and when some freak opportunity presents itself, he finally works hard and gets what he wants. There isn't anything really standing in his way. Perhaps if they threw some conflict in there it may come off as contrived, but how it is now, it seems too easy. Maybe that's the point. I don't know.\n\nUndefeated heavyweight champion, Apollo Creed (Carl Weathers) needs a new opponent for the title fight after his current one drops out. But he wants this new competitor to be a no name amateur, so that the public will get into the underdog story. \n\nAnd it's a good underdog story at that. You root for Rocky undeniably. But there could just be a little more in terms of a struggle. The biggest risk he takes is handed to him. And what does he have to lose, anyway?\n\nMuch of the film is dated with the fake punches and the already antiquated dialogue. There are points where the patter is so rhythmic that it sounds like it's from the '40s or '50s. It's a slow moving film, and some scenes just drag on for way too long. It helps add to the character development, but it does a number on our attention span. \n\nThen there's predictability. The end result is telegraphed from a mile away. We can guess what's going to happen for most of the film. And we are usually proven right--another side effect of there not being any unexpected drama. \n\nNowadays, we have a quixotical view of Rocky, the all-American hero. Even the Academy was lost in its gaze with this film winning Best Picture back in 1977. But sadly, it's not as good as we want it to be. But that's not to say it's not good. It's still a cool underdog story, albeit not paying off as well as its predictability wants it to. However, corniness aside, this film set the pace for countless stories that came after it. And most of all, it has a lot of heart. You can't knock it for that.  \n\nTwizard Rating: 74",
            "review_date": "2016-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ace movie. Great story. Classic performances. Ace.",
            "review_date": "2016-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Film. No wonder it won best picture",
            "review_date": "2016-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best movie i've ever seen. It's amazing soundtrack, plus it's wonderful transitions make it a truly life changing feature.",
            "review_date": "2016-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Arguably the greatest sports movie of all time.  So this is about a small time boxer named Rocky Balboa (Sylvester Stallone).  He doesn't have a whole lot going on for him, but he gets by.  One day, the chance to fight the heavyweight champion, Apollo Creed (Carl Weathers), falls in his lap, and he must start training immediately for this momentous occasion.  I went a very long time without watching this movie.  Not because I had any bias against it, it was just a film that I never took the time to sit down and watch.  As far as popularity goes, I do think this was my biggest blind spot in film, and people have given me a hard time on a number of different occasions for not having seen this.  With the release of Creed, I couldn't think of a better time to rectify this, and what do you know, it really is the greatest boxing movie ever made.  I don't usually go for boxing movies and that is entirely because so many of them follow the same exact template.  With movies like Southpaw or The Fighter, you know exactly what you're going to get, which is a story that goes a little something like this: an unlikely protagonist rises up and overcomes struggles and hardship to bring their personal life around through their sport and craft.  There, I just described almost every film in an entire genre.  The thing is that they all got it from Rocky, as it is the original and still remains the best.  Not even just boxing movies lift from Rocky, sport movies in general do; we wouldn't have one of my favorite films in The Wrestler if we didn't have Rocky.  I love less-than-intelligent protagonists when they are earnest, and this has one of the best examples out there; you can see all of the emotions right there on his sleeve, and Stallone play it masterfully.  The training montage to this is amazing; I've seen it by itself on its own, but in the actual context of the film, it is even better.  That music is like no other, and when the brass section starts playing, it is like instant energy flows into your body as soon as you hear it.  It is more than just a boxing movie, and the thought did cross my mind: for a boxing movie, there's really not all that much boxing.  You have a fight at the beginning and the climactic fight at the end, and that's really about it.  The middle is almost entirely drama and training, and that is the meat of the story.  You get a great feel of all of the characters so you can really rally behind them and root for them, and you also get a really good feel of Philadelphia as a city.  I am still of the mindset that once you've seen one boxing movie, you've seen them all, but this is the one that did it best.",
            "review_date": "2016-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's too simplistic and drawn out, but rocky has a gritty quality that is made all the more effect by Stallone's masterful performance and chemistry with the other characters.",
            "review_date": "2016-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Predictable in the fact that filmgoers will always root for the underdog if they love that underdog, Rocky stands heads and shoulders above all of the boxing tales that try replicating its singular charm...including, ironically, its own sequels. Remarkable not for its originality but for making a Capra-esque human drama that inspires rather patronizes, Rocky isn't the first underdog sports story but it does define the genre from here on-in. Indeed, if it had premiered 30 years earlier, this film very well might have been titled It's a Wonderful Life, You Bum.\n\nIn this PG-rated sports drama, a small-time Philadelphia boxer (Stallone) gets a supremely rare chance to fight the heavy-weight champion, Apollo Creed (Carl Weathers), in a bout in which he strives to go the distance for his self-respect. \n\nSylvester Stallone's script and performance, ahem, punch up pure character out of a caricature and provide a heart-warming tale that impossibly sports a blue collar Can-Do human spirit that seems unbeatable, even in a very cynical age. Arriving in a decade populated with hard-edged terminally pessimistic dramas such as The French Connection, Serpico, Network, All the President's Men, Taxi Driver, and Apocalypse Now!, Rocky's optimism in presenting the simple unshakable drive of an everyman's champion makes it an underdog of a different sort. The fact that it won the Oscar for Best Picture and became a blockbuster stands testament to the fact that filmgoers responded to it even if the material stands a slight step below quality-wise. Still, director John G. Avildsen's guiding hand gives film history one of the most indelible scenes of all time when our challenger reminds us what's more important than winning by screaming out to find his true love amid the maddening crowd: \"Adrian!!!\" \n\nBottom line: Right Hook of God",
            "review_date": "2016-02-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest films ever made (in my humble opinion)",
            "review_date": "2016-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Is there a better movie?",
            "review_date": "2016-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How the hell does Rocky only have a 69% fan approval rating? It won best picture for a reason. Sorry if it's a little too slow for you, millenial plebs.",
            "review_date": "2016-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great start to a great series, this film combines a deep and compelling back story with a rough and tough in-your-face storyline.",
            "review_date": "2016-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky portrays a classic theme of a poor bum making it into the big time.  The film is realistic and the acting and script from Sylvester Stallone defined his career,  Its classic lines and scenes are now cemented within the cinematic annals.  The film has been parodied since its release and will continue to be for an eternity.",
            "review_date": "2016-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bizarrely overrated, but with some great performances and a rousing final fight.",
            "review_date": "2016-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a dramatic love story, with boxing, but it does everything right. Stallone rocks the roll, but the other characters are equally finely cast. It may take a little bit for the action to start up, but it's interesting and gripping enough to keep up with.",
            "review_date": "2016-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fantastic sporting film about amateur boxer Rocky Balboa (Stallone) who gets the unexpected call to challenge Apollo Creed for the heavyweight title. Not only does he look to win the fight for the title but also for the fight for the heart of Adrian (Shire), a shy pet shop worker. \n\nThis is a film full of soul and a feel good factor which is one of the true legends of film which set a very high bar for sport based films. Stallone does brilliantly and no wonder it was nominated for so many Oscars.",
            "review_date": "2016-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Rocky\" is a feelgood underdog kind of movie that is sure to leave you with a smile on your face and the urge to start saying \"yo\" a lot more. In this film you see Rocky, a no-body boxer, get the chance to show what he's really made of in the hardest fight he's ever fought. With a fantastic story and outstanding acting (specifically on Sylvester Stallone's part), \"Rocky\" is a movie you simply cannot miss seeing. 8/10",
            "review_date": "2016-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sylvester Stallone's signature role, a film which stands the test of time, and an unforgettable journey to the top that other films couldn't replicate successfully!",
            "review_date": "2016-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Boxing Classic is Undoubtfully Predictable, Yet Endulgingly Entertaining, with a Dynamic Script and Sylvester Stallone's non-action natural acting is what makes Rocky an old, yet fresh sports flick.",
            "review_date": "2016-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic ! Nice love-story between the shy Adrian and Rocky , He did not win the fight by points bud lasted 15 rounds and got Apollo to his knees ! He maid his point . Interesting Bonus-extra's on the DVD ! SOMDVD",
            "review_date": "2016-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is the epic sports movie about a boxer and his life it has an outstanding performance from Sylvester Stallone and is an overall incredible movie",
            "review_date": "2016-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kind of slow at times as is the pace of some much older movies, but kept me hanging on. Very much a documentary style rise of a boxer",
            "review_date": "2016-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a polished film in any way, Stallone makes this one a classic despite its many flaws. Winning the Oscar for best film, Stallone was wrongfully snubbed for Best Actor. Not that he is in any way a great actor, the sheer power of his presence here is undeniable.  Sometimes a film is a winner despite all else because it speaks to the human experience and raw emotion. Rocky is a simple guy that we can all relate to, and his pursuit of self-respect is a universal experience that even the Academy could not deny. Stallone turned down many lucrative offers insisting that he and only he could play Rocky. He was right. This epic film is an underdog that became an undeniable winner, just like Rocky himself.",
            "review_date": "2016-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Doesn't hold up in the slightest.",
            "review_date": "2015-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautifully directed film with Sylvester Stallone anchoring the film down with a groundbreaking performance. Recommended",
            "review_date": "2015-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The great underdog story. Some many iconic scenes such as Rocky running up the steps of the museum of art in Philadelphia, the raw eggs, the meat factory and \"Adriiaaaaaan\" and not too mention that soundtrack. I first seen this over thirty years ago and it still makes the hairs stand on the back of my nutsack.A real feel good flick with great characters like Mickey and Paulie. Plus it is always great seeing Joe Spinell.",
            "review_date": "2015-12-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's nothing I can say about this gritty classic that hasn't already been said. \"Rocky\" is a masterpiece and, alike The Italian Stallion, Stallone goes the distance to make it such.",
            "review_date": "2015-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was really good. It had really good humour and drama at the same time",
            "review_date": "2015-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie never gets boring or old.  Perfect mix of romance and action....neither of which I generally like, but just so well done.",
            "review_date": "2015-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When I came to watch this film I wanted to see boxing! And apart from the beginning and the end there isn't any! However the fight with Apollo Creed at the end is superb. Stallone is great as Rocky and will always be known as Rocky Balboa no matter what! There is some iconic shots in this movie (Balboa standing on the top of the stairs celebrating in front of Philadelphia) the music is iconic and infectious as well, which is when the movie really starts to pick up pace.",
            "review_date": "2015-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "DREW'S REVIEWS\n\n9.2\n\n\"The Heart of a champion can overcome anything\"",
            "review_date": "2015-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The character Sylvester Stallone plays in this film is probably the most likable character in movie history.",
            "review_date": "2015-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really enjoyable. Not a sports movie",
            "review_date": "2015-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it has not aged very well (the theme song has the worst lyrics I've ever heard), it's predictable and uneven, and some of its performances are a glaring reflection of its time and budget, Rocky is still a relentlessly charming, triumphant underdog story that earns its status as a classic. Stallone carries the film with a phenomenal performance as a sympathetic, relatable every man.",
            "review_date": "2015-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My first time watching this movie and everything about it is great. Stallone has the depth of a suffered but not broken soul who's determination is rare but pure.\nIt's too bad the rest of the franchise lost the solid integrity of such a powerful beginning.",
            "review_date": "2015-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everyone loves a good underdog story. When someone who is at the bottom, rises up and becomes what they are meant to be and proves everyone who doubted them wrong in the process. Rocky is not just a great movie, but for someone like myself who has lived in Philadelphia his entire life, as silly as it sounds, it is more than a movie. Rocky defines my city and embodies everything about the city of Philadelphia. Sure, Philly is a major city but is it kind of stuck in the shadow of New York and Boston. Maybe you have to be from my town, but seeing Rocky Balboa run through the city and the Italian market during his training scenes makes the hair on my arms stand straight up. Although it is a fictional character, it gives me a sense of pride that Rocky takes place in my city. Which is an underdog city to begin with. Ok, I know they probably have made too many sequels in the Rocky franchise and it got really silly with Rocky 5, but this is one of the best movies of all time. Not just the best sports movie of all time, but of any genre. A small low budget project that was shot in a few weeks in Philadelphia, and it won Best Picture at the Oscars. Talk about a true underdog right there. Sometimes music it good in a movie and sometimes it literally defines a movie. The latter is the case here. Everyone and I mean everyone knows the Rocky theme. There is no way when you hear that music that you don't automatically think of Rocky Balboa running up the Philadelphia Art Museum steps",
            "review_date": "2015-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'd give it a 10 if I could. Best movie in history.",
            "review_date": "2015-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "http://letterboxd.com/zbender/film/rocky/\n\nRocky Balboa, The Italian Stallion, Rock. Philadelphia's favorite son is known by many names, and he is also known far outside his own movie universe. Seriously, have you seen how many times people have pretended to down a glass of raw eggs? Or how many times I've turned on the music from the film when I'm on my fifth try at a diet, in the same year? Movies like Rocky get all the hype. How couldn't it? It has the lovable comeback kid whose face got ran over by a truck, love interest, a montage (this film basically invented the montage), and it is oh so quotable. Some which don't even make much sense to me. I have never heard someone get called a tomato before. Everything in this film I've seen parodied. It gets me so giddy when I see iconic moments. You see a guy punching meat and jogging Philly streets. Yep, that's Rocky Balboa. \n\nThe fact that this was written and starred Sylvester Stallone amazed me while I watched. This was a story I could get behind and that ending is so satisfying. Rocky is such a fun film, and a sin to cinema if not watched.",
            "review_date": "2015-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everyone loves a good underdog story.  When someone who is at the bottom, rises up and becomes what they are meant to be and proves everyone who doubted them wrong in the process.  Rocky is not just a great movie, but for someone like myself who has lived in Philadelphia his entire life, as silly as it sounds, it is more than a movie.  Rocky defines my city and embodies everything about the city of Philadelphia.  Sure, Philly is a major city but is it kind of stuck in the shadow of New York and Boston.  Maybe you have to be from my town, but seeing Rocky Balboa run through the city and the Italian market during his training scenes makes the hair on my arms stand straight up.  Although it is a fictional character, it gives me a sense of pride that Rocky takes place in my city.  Which is an underdog city to begin with.  Ok, I know they probably have made too many sequels in the Rocky franchise and it got really silly with Rocky 5, but this is one of the best movies of all time.  Not just the best sports movie of all time, but of any genre.  A small low budget project that was shot in a few weeks in Philadelphia, and it won Best Picture at the Oscars.  Talk about a true underdog right there.  Sometimes music it good in a movie and sometimes it literally defines a movie.  The latter is the case here.  Everyone and I mean everyone knows the Rocky theme.  There is no way when you hear that music that you don't automatically think of Rocky Balboa running up the Philadelphia Art Museum steps",
            "review_date": "2015-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A boxing film to stand the test of time, Rocky has built itself as a classic among a wide array of sports films by giving it's characters dramatic depth heightened by Stallone's legendary portrayal.",
            "review_date": "2015-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky's release in 1976 took audiences into the journey of a down-on-his-luck boxer getting his chance at the big league against the famous: Apollo Creed. At the time, it won 3 Academy Awards and is a home stable to Americans everywhere since. However, does it still hold up after all these years? Yes, yes it does. While it's easy to point out it's fairly predictable story, lacking antagonist, and also lacking in grip in its finale, the title character's heartwarming and terrific performance, great soundtrack (the most iconic: Gonna Fly Now,) inspiring tone and message, well developed and heartwarming romance, and superb writing and acting from Sylvester Stallone and direction from John Avildsen make this a film that while maybe had a unbalanced trilogy of films to follow on the emotional and inspiring tone of this film, say for maybe the final film, this reminds us of the Italian Stallion man that gave audiences a broken down and relatable character to cheer for all the way to the end.",
            "review_date": "2015-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is a classic drama that defied the cliques of these types of sports/underdog movies and delivered one of the most compelling dramas of its time. Sylvester Stallone is great in this movie, as he delivers one of the most iconic movies characters in a near perfect way, and his script is brilliant, with it blending drama and boxing action perfectly. The rest of the cast is great, the direction is amazing, and the score is so iconic that it is become a being of its own. This is a classic and a must see for fans of dramas, sports films, and underdog stories.",
            "review_date": "2015-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It only took me 28 years, but I finally got around to watching Rocky. I can certainly see why it has the legacy and gets the love that it does. I was actually really surprised by how little it focuses on boxing and is more about the drama surrounding Rocky's life.",
            "review_date": "2015-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome film but had a lot of sound issues",
            "review_date": "2015-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good characters, Great cinematography, but the atmosphere it creates is bitter, so not a perfect film, but still a must see",
            "review_date": "2015-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such an amazing film, one of my all time favorites.",
            "review_date": "2015-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite sports films of all time!",
            "review_date": "2015-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Where man meets man, and nothing but pure heart and fire can win.",
            "review_date": "2015-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't even know how to start a review for Rocky. It's one of those rarities that always leaves me genuinely feeling something when it's over, no matter how many times I see it. I saw Rocky for the first time when I was around seven years old. Surprisingly, I wasn't bored. Even then, I knew it was something special. I grew up with these films and there was just something about them that just had so much heart, especially the first one. Sylvester Stallone wrote this screenplay in just three days which is pretty amazing. He wanted desperately to play the title character and fought for it. Thankfully, he did and if he didn't, not only would the movie not be the same but it would not have been nearly as successful, let alone forerun six sequels. Stallone as Rocky Balboa is one of the most special portrayals in cinematic history. Throughout the movies, he creates such a character that makes me feel like I know him. From the way all the characters are written, you feel like you get to know them. What helps is that the whole cast really do become their characters. Even though \"Taxi Driver\" and \"Network\" are probably more talked about in film classes, \"Rocky\" absolutely deserved to win Best Picture in 1977. It also has such an excellent message. It's not necessarily about winning, it's about going the distance with the best. If Rocky could go the distance, he feels like he's already won in a way and he is better than what people think of him.",
            "review_date": "2015-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great characters performed by good actors, Rocky is the ultimate underdog story told with heart and executed very well.",
            "review_date": "2015-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You're going to eat lightening and you're going to crap thunder.\n\nRocky Balboa is a small time amateur fighter with fifty amateur fights with about thirty wins and twenty losses.  Apollo Creed, heavy weight champion of the world, wants to put on an Independence Day show in Philadelphia and give an amateur a shot at the title.  Rocky is in the process of falling in love when this fight falls in his lap.  This fight will change his life forever and help him form an amazing bond.\n\n\"Why do you want to fight?\"\n\"Because I can't sing and dance.\"\n\nJohn Avildsen, director of Karate Kid 1-3, The Power of One, 8 Seconds, Happy New Year, Foreplay, Joe, Okay Bill, and Slow Dancing in the Big City, delivers Rocky.  The storyline for this picture is amazing, well written, and brilliantly executed.  The script fits the characters perfectly and the plot comes together well.  The cast includes Sylvester Stallone (writer of this film), Talia Shire, Burgess Meredith, Thayer David, and Carl Weathers.\n\n\"Your nose is broke.\"\n\"How does it look?\"\n\"It's an improvement.\"\n\nThese were all recently added to Netflix online and I was so excited to watch these for the first time again in a long time (I may purchase these when the new Creed movie comes out and it's in one set).  I loved these movies while I was kid and still find myself excited and emotionally drained at the end of this movie.  I love this picture and consider it an all time classic.  \n\n\"Cut me, Mick!\"\n\nGrade: A+",
            "review_date": "2015-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is a true underdog story that transcends the sports movie genre. Rocky Balboa has become an iconic character who has inspired so many people, thanks to this movie. It spawned a beloved franchise and is held dearly in the hearts of so many people.",
            "review_date": "2015-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Often portrayed as a bit low brow it is far from it. A fantastic account of a lower class guy from Phildelphia scraping by, the boxing element is almost secondary.",
            "review_date": "2015-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good fighting movie.",
            "review_date": "2015-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Regarded as one of the original, and certainly most celebrated, sports biopics, Rocky tugged its audience's heartstrings and prized out every last one of their tears. Watching it today, I can understand why people fell for it so badly, but I can't really see why it's thought of as a traditionally 'great' movie. It's takes a long time to get going, has a very sluggish pace and is very often bogged down by scenes of wallowing in pity and self-doubt. These are very familiar to anyone who's seen a modern sports bio, and back then they obviously weren't as well-worn as they are now, but the entire film still comes off as entirely predictable. Rocky is the stereotypical underdog, he's going to struggle, he's going to have people doubt him and tell him he'll ever make it, he's going to get angry and alienate those close to him but in the end he's going to win everyone's respect.  I do like the twist at the end, but aside from that the whole film is by-the-numbers. Rocky starts out a very likable character, full of pep and always cracking jokes despite his destitution, but after a while he becomes the typical downbeat, I'll-never-make-it-so-why-should-I-even-try guy, and it sucks the life out of what could have been a much more entertaining film.",
            "review_date": "2015-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a great movie! You see why it really kicked off Stallone's career!",
            "review_date": "2015-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this for the first time ever in 2015. I liked it a lot and thought it deserved 4 stars, but given the age of this movie I think it gets 5 stars for still being awesome so many years later!",
            "review_date": "2015-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic movie with so many memorable scenes that even our current generation knows the famous \"run-up-the-stairs-like-a-freakin'-champ\"-scene and the legendary theme song \"Gonna Fly Now\", which is essential for every workout-playlist since 1976.\nThe plot itself is nothing special, but it's the dialogue, the characters and the cinematography that stands out in \"Rocky\". It wouldn't be a Rocky movie, without a well filmed and well scored workout scene.\nOf course Sylvester Stallones depiction of his alter ego Rocky is genuine and remarkable. You can really see that he cares not only about his character, but for the whole movie. I couldn't imagine Rocky being played by another actor, so thank god Stallone didn't sell the script, when he had the chance.\nEven though for me Rocky II is one of those rare sequels that surpasses the original in every aspect, but no one can deny the impact of \"Rocky\" in movie history and american culture. It still manages to inspire and motivate people all around the world and that's something only a few movies can claim to achieve.",
            "review_date": "2015-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The ultimate underdog story that is always compelling.",
            "review_date": "2015-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an must see movie, probably one of the greatest sport movies out there actually it manages to be alot more than just an sport movie it has heart it has soul. It shows that you can accomplish anything as long as you really go for it, so this is an underdog story about an bum looking guy called Rocky wich gets the opportunity to fight the champ  called Apollo Creed. You get to see Rocky do all kinds of training montages and it's just great you really want Rocky to win the fight. As the movie progress we learn that Rocky is not just some \"strong looking dude\" we learn that he has heart he has soul. Must see movie.",
            "review_date": "2015-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A motion picture classic, about a down on his luck guy, who gets the chance of a lifetime to take on the undefeated heavyweight champion of the world. This Movie shows about what great things can happen when you go the distance.",
            "review_date": "2015-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies",
            "review_date": "2015-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is an underrated classic. Great story with incredible performances with a great message. This movie can be watched by anybody and be enjoyed. Amazing characters that you can relate to and you can really get almost any emotion while watching this film. You can be happy, sad, excited, angry, scared, uplifted, nervous, and much much more. Best film of 1976 and one of the best of all-time.",
            "review_date": "2015-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first entry into the series, Rocky provides a satisfying balance of heart, drama, and tension. The story may be predictable but it's still worth giving a chance.",
            "review_date": "2015-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great sports movie. It could be a little faster, but I can get past that.",
            "review_date": "2015-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I personally don't enjoy most boxing movies, but - WHAT AM I TALKING ABOUT?! GOTCHA! THIS MOVIE'S AWESOME!",
            "review_date": "2015-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing start to this series! It's really hard to go the distance.",
            "review_date": "2015-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true sports movie gem, Rocky is still a dynamite film spectacle to this day. The story of a character who overcomes the odds and makes a name for himself in the process is told and portrayed beautifully by Sylvester Stallone in this triumph.",
            "review_date": "2015-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing and great movie to watch, with slight humor, and a huge and brilliant classic, about boxing, and kind of sad as well as doing some fighting spirit, so yeah.",
            "review_date": "2015-07-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rating: 96%\nWith the right amount of drama, an attention-grabbing premise, and near-perfect performances from Sylvester Stallone and the rest of the cast make Rocky one inspirational sports film that you can't miss.",
            "review_date": "2015-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is the start to one of history's most famous movie series and franchises, and together with Rambo secured Sylvester Stallone a place in history and pop culture. It's a very good movie, has the feel for the time, good acting and performances, and unlike most other movies of the subject, doesn't just focus on the training.  He's trying to make a life, get a girl, start a family, and help his friends and town.  He's a great character and is fun to watch, even if he seems a bit emotionless.  The training is tough and well shown as well in it's own glory, but it's outside the gym dealing with his best friend and girlfriend that the movie does it's best.  It's awkward at times when it should be, and using emotion right.  The final fight we have all been waiting for is great too, well shot, and entertaining.  It doesn't offer the underdog beats all ending we all excepted but to my surprise and joy the champion stayed the champ and Rocky was proud to have given him his best fight and the chance for the title.  Of course if spawned many more sequels, which although get repedative and eventually stop offering much difference, it's a great series to watch.  Having Stallone show up for Grudge Match recently was completely influenced by this movie, and gives off a couple of references. But it is more humor based and although a good film is not at all what this is.  Classic for many years to come and one of Stallone's best",
            "review_date": "2015-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best motivational and inspirational movies of all time. A great story and script and,a great song, \"gonna fly now\". This movie is a work of art that every parent will probably tell there kid about.",
            "review_date": "2015-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic even to this day.",
            "review_date": "2015-07-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though it's often cheesy and it's nothing we haven't seen before, Rocky benefits greatly from Stallone's stellar performance and surprisingly well-written script.",
            "review_date": "2015-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie with a colorful cast of characters and the best underdog movie ever",
            "review_date": "2015-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply the best fictional underdog film ever.",
            "review_date": "2015-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An inspirational boxing movie my favorite Sylvester Stallone movie of all time.",
            "review_date": "2015-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Come on??? Who doesn't like Rocky!?",
            "review_date": "2015-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first sports picture to win Best Picture, \"Rocky\" has always been an iconic character piece.",
            "review_date": "2015-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "92% on my Tomatometer.",
            "review_date": "2015-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is the best boxing movie ever that will change your heart. Love it, a heartwarming classic.",
            "review_date": "2015-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Underdog-story about mediocre fighter who gets that one chance every young and hungry pugilist dreams about. At times the film is very dark, but still realistic to the very end. Acting performances are impressive in their rough way, and the simple, but down-to-earth and kinda captivating personality of Balboa does not only show Stallone's true acting skills, but also is what really makes this movie an enjoyable and iconic legend.\n\nRocky's laid-back and unhurried storyline might not be the best entertainment for today's movie audience, but that doesn't take the film's position as an ultimate classic of this genre.",
            "review_date": "2015-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much more of an internal movie than I was expecting, but good all the same.",
            "review_date": "2015-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps the most inspirational film ever. A Classic that launched a film series where almost every film that came after it was better than the last.",
            "review_date": "2015-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is arguably nothing more inspiring than the American Dream.  And when it comes to inspiring movies, there are arguably none more inspiring than \"Rocky\".  The story of this down-on-his-luck boxer's pursuit of a better life is a heart-warming story, filled with love, redemption, and feel-good moments.\n\nThe film's real triumph is the winning performance of Sylvester Stallone as Rocky Balboa.  His ability to make the character a likeable everyman that anyone can relate to will win you over.  For folks who aren't in to sports movies, fear not.  \"Rocky\" isn't really about boxing.  It's about determination, believing in yourself, and the human spirit.  \"Rocky\" is a really inspiring film.  It is THE underdog story.  And who doesn't love an underdog.",
            "review_date": "2015-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it may be slow at first, Rocky soon picks up and becomes a true underdog story. Fantastically directed, well-acted and deserving of its Oscar win, if you haven't seen Rocky, stop what you're doing and put it on.",
            "review_date": "2015-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Every element of the movie may be a cliche, but it somehow gets all the cliches right and works on an elemental level.",
            "review_date": "2015-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one the most overrated movies I have seen. it is boring and has an awful story. Why do people like this movie I do not knew?",
            "review_date": "2015-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest sports film ever made. Stallone was at one point a good actor until he started making ridiculous action films.",
            "review_date": "2015-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A real powerhouse film with a strong leading performance, but boxing still isn't entirely to my interest.",
            "review_date": "2015-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film. Although it's a bit cliche and tacky, you can't help but love it",
            "review_date": "2015-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One word: Inspirational. Not only does this film give me the courage to walk into a gym and better myself, it inspires me tackle my aspirations, to never let anybody change who I am; it even inspires me to make a film. Most of all, it makes me want to be an all around better person. Such a simple piece of work, and a great piece of art. Don't call this a sports movie, it's so much more.",
            "review_date": "2015-03-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It has all of the ingredients to fall flat into forgettable corners, but Sylvester Stallone's wonderful charisma and action-pack performance, as well as his writing bathed with simple but heartfelt moments, as well as John G. Avildsen effective direction, Rocky is an immortal classic that represents the cornerstone of every underdog-rising story, combining with exhilarating training sequences, a beautiful score and a breathtaking third act, all to accomplish pure classic material.",
            "review_date": "2015-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky (Sylvester Stallone, who also wrote the screenplay) is an amateur boxer who supports himself by working on the docks and debasing himself as collection muscle for a local loan shark. He gets an unexpected shot at greatness when the heavyweight champ (Carl Weathers) randomly chooses him for a fight as part of a promotional gimmick. Depending on your tastes, Rocky is a heartening underdog fable or a sentimental fountain of sports cliches that inexplicably won the Oscar for Best Picture. I found myself enjoying this film thanks to Stallone's grounded performance and the story's insistence on keeping things character-driven. The sequels, which get exponentially more cartoonish with each further installment, often lack either of these components.",
            "review_date": "2015-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has the eye of the tiger! Meow!",
            "review_date": "2015-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is a well made and memorable film. Stallone is very good as the likable hero Rocky, and there are various other well portrayed god characters. The movie is also inspiring, as it shows the story of a nobody who got a chance to  fight a great boxer. The final fight is very intense and satisfying. There is a slow build up, and its fairly predictable. But Rocky is a memorable and rewatchable drama that will make you root for the hero. It's great theme song to go along with the pic training montage is sure to get you pumped for the final fight, and when it goes down, it does not disappoint. Rocky gets 4.5/5 stars (A).",
            "review_date": "2015-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much more of an all-around great movie than I expected, but I'm a little surprised it got Best Picture.",
            "review_date": "2015-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is a great movie with a buch of cool scenes in them. Rocky is my favorite out of them all because it is well of course the original and it has some good quotes and stuff like that. Rocky (Sylvester Stallone) plays the role so good in this movie. Rocky does not have much to do in life he has one friend named Paulie (Burt Young), he likes this girl named Adrian (Talia Shire) that is shy, and has a trainer named Mickey (Burgess Meredith) who doesn't have really nobody to train. So when the Champion Apollo Creed (Carl Weathers) picks Rocky to fight Rocky decides he will fight him. While Rocky is training while trying to get Adrian to like her. So near the end of the Movie he trains with a great song Gonna fly now and run the Philadelphia Art Museum steps and rises his arms. Then Rocky says all he wants is to go the distance with Creed because he knows he can't win. When he fights Apollo Creed Apollo Creed thinks he does not have a chance to win so he goes more easy on Rocky and tries to make it a show. Rocky ends up  knocking Creed down and losing the fight but doesn't care because he want the distance. This is a great movie 5 stars",
            "review_date": "2015-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sylvester Stallone has never been better though the film falls down in some sections. Full review later.",
            "review_date": "2015-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stallone's finest. Success comes through fighting really hard and really hard only. The film is an inspiration for all ages. It couldn't have been any better. A true classic for the history.",
            "review_date": "2015-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Come on, it's Rocky. Unreal obviously",
            "review_date": "2015-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good movie but the ending is abrupt",
            "review_date": "2015-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sylvester Stallone is spectacular and makes ROCKY a classic never-give-up movie.",
            "review_date": "2014-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky was a triumph of the spirit.",
            "review_date": "2014-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a \"feel good\" movie. It takes its time, but as soon as Rocky starts his rigorous training the film really picks up.",
            "review_date": "2014-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing, well acted, well directed movie. Five Stars",
            "review_date": "2014-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inspiring and uplifting, this drama earns it's seat in the history of cinema.",
            "review_date": "2014-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First of all, the users that criticize this movie (like Jennifer Xu) are morons. What these people \"who watch a lot of sports movies\" fail to understand is that this movie came out in 1976, way before any of the movies they are even referencing came out. That's right- what you find so cliche is actually groundbreaking because it was the first to do it. This movie essentially created the genre. Do these morons know that this was the first movie to use a steadicam? Of course not- I doubt they even know what that is. There is really nothing that I can say about the movie that has not been said a million times before: we all know that it's brilliant, engaging, deep, inspiring, and innovative. What I can say is that the people criticizing this movie are idiots. I am sure they would also  criticize Die Hard for being too much like Under Siege 2, or Birth of a Nation for having too many closeups and flashacks. I feel stupid for having read their \"reviews.\"",
            "review_date": "2014-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Rocky\" is the quintessential boxing film, the blue print for all the Rocky rip-offs and sequels that would follow over the next 4 decades. And the film still holds up today, despite the overuse of its tropes, and becomes a very enjoyable uplifting film.\n\nThe story follows amateur struggling boxer Rocky Balboa, who is contemplating retirement due to the lack of opportunities. However, when heavyweight champion Apollo Creed pulls his name out of a hat and offers to fight him in a showcase event, Rocky finds himself pushing further than he ever had before, while dating his best friend's sister.\n\nSylvester Stallone, who also wrote the screenplay, stars in the title role, in what would become his breakout performance in Hollywood. Alongside him are Talia Shire, Burt Young, Carl Weathers and Burgess Meredith, all putting in solid performances - particularly Weathers as the flamboyant and arrogant Apollo Creed.\n\nDespite the surprise ending, this film is ultimately an uplifting feel-good movie - something modern boxing/fighting films seem to lack in their dark and gritty tones. The comedy in this film is primitive in nature, but wonderfully executed anyway, and the relationships and characters are suitably fleshed out.\n\nThis is a classic film, and remains strong to this day. A must-have addition for any film buff. 9/10",
            "review_date": "2014-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest films ever made!!",
            "review_date": "2014-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "80%\n----------\n4.0  -  Sylvester Stallone\n4.0  -  Burgess Meredith\n3.5  -  Burt Young\n3.5  -  Talia Shire\n3.0  -  Carl Weathers\n3.0  -  Joe Spinell\n3.0  -  Thayer David\n3.0  -  Tony Burton",
            "review_date": "2014-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While his acting has always been considered laughable, it fits Rocky to a T. Add to that an Oscar winning screenplay and you have a heady mix. It might be almost 40 years old now, but it's still the best David vs Goliath movie.",
            "review_date": "2014-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "cool romantic awesome movieâ(TM)¥",
            "review_date": "2014-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With powerhouse performances, a great.  script and a dramatically effective story, Rocky is a classic that still remains a classic",
            "review_date": "2014-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awful. Boring and stupid",
            "review_date": "2014-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its easy to forget that Rocky won the best picture in 1975 - which initially was kind of surprising to me.  Movies about underdog athletes don't usually resonate with Oscar voters.  But watching Rocky this time around I realized something - this isn't a sports movie.  This is a movie about a self proclaimed 'nobody' finding love.  Rocky before it is anything else is a love story.  Sure there is the boxing, Apollo Creed, the emotional music and Mickey the trainer all of the stuff that makes for a good sports movie.  But this movie is about Rocky and Adrienne - two of the least likely lovers in all of Hollywood.  And that's what makes this movie Oscar worthy.  There are nuances in this movie that you just don't always see in other places.  For example when Mickey offers to manage Rocky.  Mickey is desperate to bring meaning to his own life, Rocky is angry that he's been overlooked for so many years; angry that Mickey only wants to be a part of his life now that he's fighting a big fight.  But there's that moment of quiet reconciliation when Rocky chases Mickey into the street - a reconciliation between two 'nobodies.'  I loved that scene and that's why its hard not to love Rocky.  He gives voice to the \"nobody\" in all of us - and reminds us that we are indeed a somebody.",
            "review_date": "2014-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When it comes to Sylvester Stallone in \"Rocky\" you know this movie is classic and it would always be a classic film. Great acting by Sylvester Stallone and the rest of the cast ate great as well. What a great way of determination and inspiration and toughness in every way Rocky is an absolute triumph. So for this being one of my favorite classics of all time going along with Rambo, I give \"Rocky\"a B-.",
            "review_date": "2014-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yea it is quite predictable, but Sylvester Stallone really gives a outstanding performance with such a great, quite realistic story that is full of cheer;  and that's more then enough to make this movie a favorite.",
            "review_date": "2014-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It may be predictable but Sylvester Stallone's performance makes everything so likable that you actually care about what's happening, it's funny and holds so much charm, it's a timeless classic",
            "review_date": "2014-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best inspirational movies ever made. Gritty, emotional, and above-all, honest.",
            "review_date": "2014-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "95%\n\nMovie Performances:\n\nSylvester Stallone (4.5)\nBurgess Meredith (4)\nTalia Shire (3.5)\nCarl Weathers (3.5)\nBurt Young (3.5)",
            "review_date": "2014-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a low budget movie, this is one great film.  It tells the story of a \"nobody\" boxer who is given the shot of a lifetime.",
            "review_date": "2014-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you can get passed the somewhat akward pacing and cutting, this is one of the best films ever made. The story itself is anything but a classic. And the score is nothing but absolute brilliance. Bill Conti shows his prowess as one of the best film composers of all time. Stallone has written characters that you can relate to, and a story that is not only a feel good sports story, but a story full of inspiration. Just pure inspired writing. And that's what this movie is, inspired brilliance.",
            "review_date": "2014-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The soundtrack and story told in this film makes it all the better. And spawned off Stallone and made him into a star and definitley helped him find his niche in Hollywood as a guy who plays unusual characters in action movies.",
            "review_date": "2014-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Anyone who rates this film under three stars is high. \n\nAmazing movie. \n\nRocky has heart and vulnerability which makes him one of the greatest underdogs in the history of cinema. Also, probably one of the greatest characters of all time. \n\nThe rest of the movies in the anthology are meh. \nBut this one is nearly perfect.",
            "review_date": "2014-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The American underdog classic!",
            "review_date": "2014-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inspiring and uplifting, this drama earns it's seat in the Room for Good Movies.",
            "review_date": "2014-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is at this point entirely predictable and cliched, but it is nonetheless a pleasant film with involving story, thrilling score, some charming moments, solid drama as well as Stallone's quite good acting and character which is surprisingly likable. It is a nice little film, but it is also a head-scratching choice for Best Picture by the Academy over excellent Network and not to mention Scorsese's masterpiece Taxi Driver.",
            "review_date": "2014-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "78%\nAlthough its story is dated and cliched, Rocky is an inspiring story, and one that has been integrated into our culture.",
            "review_date": "2014-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thanks to an amazing performance by Stallone and a script that makes you care about its protagonist, Rocky is a classic.",
            "review_date": "2014-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is great because it is not about boxing at all.",
            "review_date": "2014-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great old movie. Lives through the test of time.",
            "review_date": "2014-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie which  deserves the awards it got. The movie Rocky is legendary, with a great storyline and the cast did a splendid performance.Sly did a nice job writing it too.",
            "review_date": "2014-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved this movie so much. It was fantastic. There maybe a lot of rocky movies but I don't care I love all of them. This movie was great. It had a solid story with great acting. If you want to rent any movie rent this you'll love it.",
            "review_date": "2014-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie and best Stallone movie. I love boxing and wrestling. Stallone boxing, that's awesome. Can't wait for second movie! Great boxer!! Awesome!!",
            "review_date": "2014-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A little slow-paced to begin, but gradually Stallone's performance begins to tug at the emotions and draw you into a character and a story that climaxes with a glorious fight and finale.",
            "review_date": "2014-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "best movie of all time",
            "review_date": "2014-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stallone at his finest.",
            "review_date": "2014-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic. The best one in the series in terms of plot. Starts everything off with a bang.",
            "review_date": "2014-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I give this movie a solid three. Even though I defiantly did not hate it, I don't really think it is amazing like I think most people do. I like the philly setting that they use, perfect city to set it in. Good movie.",
            "review_date": "2014-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic I love it!!! The end was very satisfying. I loved the character development in rocky.",
            "review_date": "2014-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How the f**k this beat Taxi Driver for the Academy Award for best picture, I don't know. But it's alright... no Raging Bull though.",
            "review_date": "2014-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The start of an awesome series.\n\nSly shows why he deserved his award in this movie.",
            "review_date": "2014-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "On Netflix, Rocky 1 through 5 are going to expire, so I guess if I'm going to review another series, even though the sixth is not in Netflix, I'll start with Rocky. This is an underdog film at the very best. Sylvester Stallone is great in it and his script is amazing. It spends time on the characters which does it well enough to get to know Rocky. The chemistry between him and Adrian is very well done and make it seem like its own thing. One of the best parts of the film is also the chemistry between Rocky and Mickey as Burgess Meredith is fantastic in this and really makes me want to see more of them. The fights in it are exciting to watch, and the characters are well-developed to the point of being memorable. Rocky is one of the best underdog films of all time and has memorable sequels too.",
            "review_date": "2014-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good movie with a home run performance by stallone, but to be honest i prefer rambo.",
            "review_date": "2014-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is definitely one of my personal favorite ever! This movie inspires me the first time I see it, and it still inspires me now. The crown jewel of Stallone's long and successful career.",
            "review_date": "2014-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Getting stronger, fighting harder. So inspirational.",
            "review_date": "2014-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I will say that was awesome I like the part when she comes to him and says I couldn't stay away!!!",
            "review_date": "2014-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is one of the greatest movies ive ever seen!!! filming at its finest",
            "review_date": "2014-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's hard to believe that there was a time where Sylvester Stallone was thought to be the new Marlon Brando, where he was an Academy Award nominated actor and writer and that he managed to defeat Taxi Driver in the \"Best Film\" category in 1976! I am talking about the beloved classic: \"Rocky\".\nThe year is 1975; heavyweight champion Apollo Creed is preparing to defend his title in the world heavyweight championship in Philadelphia, but his opponent drops out because of an injury. With no professional boxer willing to accept because of the short time they would have for training, Apollo decides to give a local underdog a shot at the title. Based only in his nickname \"The Italian Stallion\", Apollo chooses the unknown boxer Rocky Balboa.\nThe first installment of the franchise is not what you would expect from a Rocky film nowadays, (lots of training montages and a long but well choreographed boxing match at the end resulting in a victory for Rocky) I even argue that this is not a sport film, this is well executed and engaging drama. It has a well told and relatable story; a variety of characters that you care for, acting that is pretty good with Sylvester Stallone giving the best performance of his career, a theme that still has the same power than in 1976, a memorable score, an iconic ending, great directing and the most important; it has a lot of heart that will get some sentiments out of you. This is not a sport film that is all about the underdog winning the match; it's deeper and smarter than that, it talks about the big opportunities that you get in life and that alone makes you care about the path that Rocky will take. It is not a masterpiece but still is one of the greatest films of the 70s. My big complain is that there are not enough of certain characters and they deserved to have more screen time.\nOf course it has people saying that it is overrated, but it really isn't. If you enjoy sport films, you need to be warned that this is drama. Undeniably the best of the franchise and arguably the best \"sport\" film ever made.",
            "review_date": "2014-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film, inspirational",
            "review_date": "2014-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great ending, great soundtrack, great main character, boring everything else",
            "review_date": "2014-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It may be predictable, but you can't deny that Rocky is one of American cinema's most iconic movies and it is inspirational, heartfelt, and has unforgettable characters.",
            "review_date": "2014-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rocky is an absolute classic. When you think of great boxing movies Rocky comes to mind. This film is near perfect, the acting is fantastic from Sylvester Stallone, who while not the most diverse actor is still fantastic in this film. He has this brilliant scene when he screams at Mickey, it's just amazing, Rocky is also one of the best and most likeable underdogs ever. The actors who play Adrian, Paulie and Mickey are all great. Carl Weathers is great as Apollo Creed and he's extremely likeable. The direction, writing and cinematography are all fantastic. The music is amazing. The main theme is one of the best pieces of music ever. The training montage is great. The end boxing match is brilliant. This is a fantastic film and while it drags a bit in places it's brilliant. A",
            "review_date": "2014-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was the best boxing movie",
            "review_date": "2014-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite movie of all time. Amazing in every way.",
            "review_date": "2014-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a classic! Loved it",
            "review_date": "2014-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story of a underdog rising up very inspirational",
            "review_date": "2014-06-21",
            "source": "rt",
            "lang": "en"
        }
    ]
}