{
    "rating": 9.1,
    "release_date": "1976-06-30",
    "num_reviews": 150,
    "genres": [
        "Western"
    ],
    "summary": "Josey Wales (Clint Eastwood) watches helplessly as his wife and child are murdered, by Union men led by Capt. Terrill (Bill McKinney). Seeking revenge, Wales joins the Confederate Army. He refuses to surrender when the war ends, but his fellow soldiers go to hand over their weapons -- and are massacred by Terrill. Wales guns down some of Terrill's men and flees to Texas, where he tries to make a new life for himself, but the bounty on his head endangers him and his new surrogate family.",
    "reviews": [
        {
            "content": "As a film it is well made but this southern revisionist history never works for me.",
            "review_date": "2023-03-16",
            "source": "rt"
        },
        {
            "content": "I absolutely adore this movie. It is a favorite classic Western of mine & I've seen a ton. Josey Wales is a terrific character. This follows the first book (i.e. \"Gone To Texas\") well. It's fantastic.",
            "review_date": "2023-02-09",
            "source": "rt"
        },
        {
            "content": "One of the BEST westerns of all time. My favourite movie with Chief Dan George by far and one of my favourite Clint Eastwood westerns. Everyone should see this movie. Its an absolute classic piece of cinema from the golden age of theatre!!",
            "review_date": "2023-01-02",
            "source": "rt"
        },
        {
            "content": "It's worth watching must to get the post Civil War historical context as to what was going on in the Western States. Very well acted and I liked the plot.",
            "review_date": "2022-11-28",
            "source": "rt"
        },
        {
            "content": "Every American boy should be shown this movie.",
            "review_date": "2022-10-14",
            "source": "rt"
        },
        {
            "content": "there were good people on both sides. there were bad people on both sides.\nand, frankly, its astounding to see hollywood having had released a film this good with that fact in mind.\nplus: Eastwood. \n\nA",
            "review_date": "2022-09-26",
            "source": "rt"
        },
        {
            "content": "I liked this Western in terms of it showing the titular character getting on with the natives and that not all the characters were young and attractive, as I imagine must have been the case back in the days of 'wild west'. There are some good pieces of dialogue, some thoughtful. There is of course strong violence (some quite bloody) and some strong language. I thought this was a good film and so I'd recommend it.",
            "review_date": "2022-09-01",
            "source": "rt"
        },
        {
            "content": "Clint Eastwood delivers here on both fronts, as an actor and as a director and what we get is a top-notch Western that has it all and some! This is a great tale of vengeance and man's destiny. Once his family is brutally taken from him, Josey Wales (Clint Eastwood) learns to shoot and over the course of joining the Confederates rebel group nearby becomes known for his battle prowess. He isn't scared to die because he has lost all he held dear but finds a cause to fight for, avenging not only his comrades who are tricked and murdered by the Union army, but also his family that was taken from him. He meets a Cherokee man and another Indian woman during his journey and also a white woman and her outspoken grandmother whom he saves from a terrible fate. The film delivers in so many ways with it's direction, cinematography, story and some of the best Western quotes in quite some time. Eastwood's Josey Wales is cool, calm, and most importantly skilled in battle which makes for a thoroughly entertaining and awesome film!",
            "review_date": "2022-08-29",
            "source": "rt"
        },
        {
            "content": "Western duro come il suo protagonista; Clint Eastwood forse come mai più in carriera si mostra dal lato degli sconfitti; dal meno ben visto dall'americano medio.\nIntorno a lui mutano estremamente le location in modo notevole per il genere, e i personaggi, tra spietati villain e bizzarri compagni di viaggio.\nAlla fine non c'è grande originalità nella trama, ma questo poco importa visto che tutto è al posto giusto.\nA livello attoriale, Eastwood di un altro pianeta rispetto al resto del cast.",
            "review_date": "2022-08-15",
            "source": "rt"
        },
        {
            "content": "Best western ever made period.",
            "review_date": "2022-07-16",
            "source": "rt"
        },
        {
            "content": "What the HELL was Eastwood thinking.  Because according to this story, the people who went half way across the world to abduct, beat, chain and put into forced labor based only by the color of their skin were the victims the whole time.  It was the EVIL Union who wanted to free the slaves.  Seriously what was the reason why randomly attack the Wale family?  Then ran off to join the Union army?  That makes no sense. Movie fails to mention one of the biggest reasons for the Civil War, SLAVERY!  There isn't even black people in it.  Plus, no white Southern would be friends with Native Americans.  Considering they too were killing as fast as the union for their land.  It was mentioned \"revisionist\" history.  Only problem is that it's well known that Slavery was the biggest cause that the North did the Emancipation Proclamation which freed all the slaves.  Like during the signing of the Declaration of Independence the South was against so they declared their own independence in order to keep their slavery status quo.   No slaves no Civil war.  No revision of history will work where the South isn't racist and in the wrong and it was really, really wrong.  I know fight the power was big in the 70s but siding with the south is like siding with the Nazis, so wrong on so many levels.",
            "review_date": "2022-06-09",
            "source": "rt"
        },
        {
            "content": "Clint Eastwood has turned in some great performances in some great movies, these include Unforgiven, Dirty Harry, and this film The Outlaw Josey Wales. Eastwood himself gives one of his finest performances here, and he is well served by a very talented cast who turn in equally impressive performances and also the film is superbly directed.\n\nThe film looks wonderful, the production values are very meticulous and the film is beautifully shot. Jerry Fielding's score compliments the film perfectly, and the dialogue and characters are all memorable.\n\nI must also give credit to the story. The story here for me has very rare a dull moment and, from the shocking opening sequence to the ending that appeals to me every time I see this film, is swiftly told.\n\nOverall, great and one of Eastwood's best. 10/10 Bethany Cox",
            "review_date": "2022-05-04",
            "source": "rt"
        },
        {
            "content": "While never short on action sequences and intensely choreographed shootouts, \"The Outlaw Josey Wales\" somehow fails to inspire engagement with its viewer, resulting in a tiresome ordeal that leaves one ever aware of their alienation from the action. The recipe for success would seem to be in place; we're given a dramatic backstory at the start of the action, loathsome villains, and even a touch of comic relief. Yet despite such apparent strengths, a murky and lifeless feeling permeates virtually every moment of the film, and the experience for the viewer just isn't very much fun. Much of the time, we feel ourselves lost in a haze of activity and extended story sequences that seem strangely aloof and adrift despite the passion at the core of the material. Despite the expert hand of Clint Eastwood at the helm, \"The Outlaw Josey Wales\" somehow manages to die a slow death of implosion regardless of the heightened action that seems almost like a desperate countermeasure.",
            "review_date": "2022-04-20",
            "source": "rt"
        },
        {
            "content": "An entertaining western that doesn't follow the generic path of typical revenge films. Instead of a simple shootout movie where the main character kills those who have wronged him 1 by 1, Wales must go on a long journey, both physically and spiritually, picking up unlikely allies on his way. Clint Eastwood once again gives an amazing performance as the stoic \"man with no name\" style character that made him famous.",
            "review_date": "2022-02-21",
            "source": "rt"
        },
        {
            "content": "A little overlong, though 'The Outlaw Josey Wales' is an entertaining watch - with cool action sequences and a pleasing ending.\n\nYou have a strong performance from Clint Eastwood and good support showings from the likes of Chief Dan George and John Vernon. The plot is interesting and the road-esque nature of it keeps it moving well. I do think they could've trimmed the run time slightly, while Eastwood's character really didn't need to spit so much - on a dog and some insects, no less. Just bizarre, it adds zero and simply becomes an irritation.\n\nA sequel, without the involvement of Eastwood, was released ten years after this - I'm intrigued to check it out.",
            "review_date": "2022-01-28",
            "source": "rt"
        },
        {
            "content": "I like this movie when I was a kid, and I still like it now as adult.",
            "review_date": "2021-11-24",
            "source": "rt"
        },
        {
            "content": "A unique Western and an Eastwood epic!",
            "review_date": "2021-10-31",
            "source": "rt"
        },
        {
            "content": "Arguably Clint Eastwood's best work besides the good the bad and the ugly this movie establishes him as one of the biggest BadAsses in cinema history during his unstoppable quest for vengeance against the soldiers that murdered his family in cold blood there are plenty of well choreographed shootout scenes Josey Wales sweats raw testosterone if your a die hard Eastwood fan it doesn't really get much better than this",
            "review_date": "2021-10-07",
            "source": "rt"
        },
        {
            "content": "High ratings all around, and very deserving, indeed. With a depth of story little found in most westerns, Eastwood as actor and diretor brings the west to life with great depth and breadth of historic vitality via a detailed look at the post-war gun slinging soldier, destitute settler, and indigenous tribes people caught between two cultures. If you don't see the beauty of the film, you're probably just looking for the same old same old of the desperate gun slinger/revenge montage.",
            "review_date": "2021-09-25",
            "source": "rt"
        },
        {
            "content": "Of all the westerns both with and by Clint Eastwood, The Outlaw Josey Wales is probably the very best. His character even has a name and the plot is based more on actual history than the typical western myths. Many of the circumstances with the post Civil War and ex confederat soliders ending as outlaws and villains are true, however the main character is totally fictional and quite a fantasy figure. With a very good plot based on the Forrest Carter novel Gone To Texas, together with fine performances from a brilliant cast, where the late Chief Dan George stands out as the most memorable, Clint Eastwood again manages never to step away from his iconic character as the ultimate western anti hero.",
            "review_date": "2021-09-04",
            "source": "rt"
        },
        {
            "content": "By now, everyone's aware of my Eastwood infatuation. Suffice to say, The Outlaw Josey Wales is terrific. It's a while since I've seen the man himself in a western, and this one is also directed by Eastwood, who took over directorial duties from Philip Kaufman early in the production process. Based on the 1972 novel The Rebel Outlaw: Joesy Wales (later changed to 'Gone To Texas') we see Joesy Wales' (Eastwood) family murdered by Union militants in a pre-credit sequence. Wales then joins a Confederate guerrilla band and makes a name for himself as a feared gunslinger, hell bent on revenge, before events conspire to leave him on his own. Soon after, he befriends an Indian man and tries to evade capture, now an infamous outlaw. The first half an hour or so drags a little as the film tries to shoehorn in a comedy style that doesn't fit, but it quickly shakes this off as it moves into sweeping western mode, and I found myself laughing several times as you grow to thoroughly enjoy the characters company in the second half. The action sequences are terrific, and the two hours flew by. It's not quite in the same league as Unforgiven (1992) or The Good, The Bad, and The Ugly (1966) but then again, very few westerns are I guess.",
            "review_date": "2021-08-19",
            "source": "rt"
        },
        {
            "content": "The Outlaw Josey Wales seems to suffer from an identity crisis; our protagonist needs to avenge his dead family (we know he's capable of shooting down armies) yet he ignores revenge until the film's climax.\nThe story blazes past any details about Wales' family or his service to the Confederacy, but then gains much needed traction from a vivid ensemble. Although the gang gets a bit crowded, Dan George anchors the cast with undeniable charisma. \nOther noteworthy aspects include memorable one-liners, striking yet extrinsic locations, jaw dropping horse stunts, and a gallon of projectile saliva.\nThis film is not a grand epic nor some grounded yarn and in spite of its perverted production and the ugly adaptation source, I reckon Josey Wales is fine by me.",
            "review_date": "2021-07-22",
            "source": "rt"
        },
        {
            "content": "This classic Western was really good. Clint Eastwood, Chief Dan George, Sondra Locke, Bill McKinney, John Vernon, and the rest of the cast did a fantastic job in this movie. The plot of the movie was action-packed, thrilling, and dramatic. It's about fighting to survive and protecting your friends. If you haven't seen this classic movie yet, check it out sometime. It's a definite must see.",
            "review_date": "2021-07-21",
            "source": "rt"
        },
        {
            "content": "I'm a big Clint Eastwood fan but this movie was just not good. Everybody on here is defending it by saying it's a classic. Yes it is but I have to wonder why. Dialogue is decent for sure. Other than that there's not much else to write home about. If you want a Eastwood western just watch The Good The Bad and The Ugly or Few Dollars More because this movie was dull ",
            "review_date": "2021-07-13",
            "source": "rt"
        },
        {
            "content": "Beautifully shot +1. Poorly acted -1. Long and boring -1. A storyline that makes little to no sense -1. Oh! Lots of animal cruelty too -100.",
            "review_date": "2021-07-08",
            "source": "rt"
        },
        {
            "content": "Clint Eastwood directs and stars again in a plethora of western revisionist flicks \nHere he plays Josey Wales, a man with a wife and child during the 1800s\nBut the movie doesn't waste any time as they are killed off very quickly by thugs and his house burned to the ground by Captain Terrill\nWales has nothing left but to go with members of the Confederate army to avenge his family \nThe war is over but he doesn't wish to surrender, he's got his own 'war' to finish \nAs a result he flees after gunning down Terrill's associates to Texas trying to start over \nBut he officially becomes an outlaw endangering a new surrogate family he makes a connection with \nEastwood is still king of this genre \nThe gun fights are really cool, it's got that tough gritty feel, and the psychologically tortured soul robbed of what's dear to him \nThe problem is that this movie is too long and they stretch out this chase more than it needs to \nThere's a lot of elements of Sergio Leone heavily borrowed \nBut Eastwood does a splendid job recreating his original stepping into the western world of cinema",
            "review_date": "2021-07-01",
            "source": "rt"
        },
        {
            "content": "The classic western.   Wars are painted in terms of winners and losers, but in truth nobody wins.   The movie, though superficially sympathetic to the South, resolves on this point:  \"... I guess we all died a little in that damned war.\"",
            "review_date": "2021-04-09",
            "source": "rt"
        },
        {
            "content": "Pretty good movie that hasn't aged too poorly.",
            "review_date": "2021-02-01",
            "source": "rt"
        },
        {
            "content": "The best Clint Eastwood movie I’ve seen so far. This role actually showed a little bit of range as an actor for once.",
            "review_date": "2021-01-06",
            "source": "rt"
        },
        {
            "content": "People LOVE this Western starring the great Clint Eastwood.  Put me in the category of \"It's just okay\".  He made so many better Westerns than this one.  It's not bad by any means, but it's just not this amazing must see Western.",
            "review_date": "2020-12-21",
            "source": "rt"
        },
        {
            "content": "The development in the Clint Eastwood's filmmaking abilities are evident in this compelling western. The stories bases in the breakdown of moral standards and promotion of the corrupt, has lost non of it impact or relevance in our current times!",
            "review_date": "2020-11-30",
            "source": "rt"
        },
        {
            "content": "Really weak. Amateur cinematography, artificial dialogues, very bad acting with the exception of the chief native American, forgettable soundtrack, boring and pointless narrative...",
            "review_date": "2020-11-14",
            "source": "rt"
        },
        {
            "content": "Unlike many earlier Clint Eastwood Westerns where he appears as a nameless and mysterious character who materializes over a horizon of shimmering heat to either wreak havoc or save the day, Josie Wales is a refreshingly relatable and fully developed character.   Directed by Eastwood, the film benefits from plenty of sprawling vistas, nicely choreographed action sequences, and interesting secondary characters, including Chief Dan George as the cerebral and smooth-talking Lone Watie.  The film is marred slightly, as so many Westerns are, by the protagonist surviving in situations that present impossibly insurmountable odds, but that is okay if one can simply suspend belief for a short time.  After Unforgiven, The Outlaw Josie Wales is probably one of his best directorial efforts in the genre.",
            "review_date": "2020-10-17",
            "source": "rt"
        },
        {
            "content": "The Outlaw Josey Wales is honestly a masterpiece and a half, the movie's plot is great and it's about Josey Wales (Clint Eastwood) going to help the Indians who are in need of help and he does so. \n\nAlso, the movie's got some great acting from all the cast especially the legend Clint Eastwood. \n\nFinally, the movie has got a great love interest which features the man himself Josey Wales and throughout this movie, it's got some bloody but brilliant action scenes from start to finish which are honestly amazing. \n\nOverall, it's a masterpiece and a half of a western with a great plot, great acting from all the cast, a great love interest and some bloody but brilliant action scenes throughout. It's honestly worth the watch, I'd honestly recommend this one.",
            "review_date": "2020-07-15",
            "source": "rt"
        },
        {
            "content": "I don't see this as one of the all-time great Westerns. It almost feels deceptive right off the bat, trying to paint a Confederate raider as some sort of wronged antihero, more than happy to show the loss of his family at the hands of violent Union soldiers and the massacre of his allies, but curiously glancing over the entire actual wartime period, where such figures were known to be among the most violent and unregulated guerrilla fighters championing the pro-slavery cause. Not off to a great start. Then the villains are painted as horrible for ... deceiving this band of raiders well after war ends, when they still take up arms? Yeah, I already empathize with the antagonists, at least with the benefit of hindsight. Then much of the rest of the film attempts to establish greater humanity in its titular character, and greater vulnerability, but at literally every point of conflict (no matter the odds against him) he pulls the same routine, spitting and then unloading into whatever's in front of him, and always coming out on top. Virtually no need to adapt to his surroundings or make sacrifices. It feels like Eastwood wanted to invite greater nuance into his same character from the Spaghetti days, but was reluctant to veer out of familiar waters, as if his on-screen persona were to lose control for a second it would completely invalidate him (Unforgiven would be a far more contemplative, mature film in this regard). Apart from Wales himself, the rest of the film is great; brutal, well-designed, with a host of interesting characters that each manifest a different perspective on the West. Chief Dan George as Lone Watie feels like a particularly interesting addition. (3.5/5)",
            "review_date": "2020-07-12",
            "source": "rt"
        },
        {
            "content": "The Outlaw Josey Wales is a good Western movie that shows the themes of revenge, determination and sacrifice. I love Clint Eastwood's performance and his directing, the Western style shots, the gun duels, the good representation of Native Americans and unique storytelling. This movie was made during the time Westerns were on he verge of dying out. Thanks to this film, Westerns made a revival. Overall, The Outlaw Josey Wales paid me a bounty to give the movie a perfect score.",
            "review_date": "2020-06-23",
            "source": "rt"
        },
        {
            "content": "A proper classic Western. Whispering Clint at his best here, an outlaw on the run, killing everyone who comes after him pow pow pow. He gets the woman, he makes friends with the Indians, he kills loads of bad cowboys, what's not to love?",
            "review_date": "2020-06-08",
            "source": "rt"
        },
        {
            "content": "While not as good as Eastwood's earlier A Fistful of Dollars (1964), it's still a classic, well crafted and pretty enjoyable revisionist western. It's a film which shows us some of the scummiest traits in humanity, and the theme of justice is very present. The characters are well developed, with director Clint Eastwood himself giving another iconic and manly cowboy performance. And chief Dan George along him also is very good. While the movie is a little bit too long in its run-time, especially for its time, it offers some very beautiful landscapes, and some classic cowboy shootouts. Overall, if you're either a western fan, or an Eastwood fan, or just a film goer in general, this is a classic movie and a good one. Recommended!!",
            "review_date": "2020-05-07",
            "source": "rt"
        },
        {
            "content": "it's a good movie, Clint can play characters like this very well",
            "review_date": "2020-04-14",
            "source": "rt"
        },
        {
            "content": "A mostly quiet, fun adventure piece. I don't think it captures the excitement like Eastwood's other Westerns around the time such as \"Pale Rider\" or \"High Plains Drifter,\" and I know it's supposed to be somewhat somber of a film but the cathartic moments seem half-ass. Otherwise, very enjoyable.",
            "review_date": "2020-04-11",
            "source": "rt"
        },
        {
            "content": "One of my top 5 favorite movies of all time. ",
            "review_date": "2020-03-26",
            "source": "rt"
        },
        {
            "content": "One of the best and most realistic Western movies of all time.  The raw and gritty nature of the story and dialogue, coupled with the marvelous cinematography, is tied together with fantastic direction and editing.  Clint Eastwood at his absolute best.",
            "review_date": "2020-03-26",
            "source": "rt"
        },
        {
            "content": "A cool Western, but a dated revisionist story.\n\nClint Eastwood's revisionist Western The Outlaw Josey Wales (1976) is a cool slow burn with exciting shootouts of impossible speed and riveting chases across Texas. On the other hand, The Outlaw Josey Wales is a horribly dated film full of conservative politics that Eastwood and writer Phil Kaufman just cannot hide. Turning the Confederates fighting to preserve slavery into these lone wolf heroes rallying bravely against the wild Union army hunting them down like savages is gross revisionist history. \n\nNot even trying to be fair, Eastwood makes the Union scum that burns down homes and steals women, while ruthless gunning down unarmed soldiers who surrendered. Not to mention the fact that the other villains are Native Americans, despite two Native heroes tailing along with Clint for mostly comedy relief and the occasional backup, on top of the Union all while not giving any attention or lines to the women in the story. Sondra Locke literally only says 5 lines in the entire film. I particularly loathe how women are only present to be raped or saved. The Outlaw Josey Wales is all machismo and no thought. It feigns at maturity by declaring all war bad and worth abandoning in the end, but that doesn't excuse an entire film of reactionary nonsense from Eastwood.\n\nI will say that the sudden shootouts are exciting and well shot, pun intended. Whether Eastwood is getting ambushed or just stumbling upon enemies by the dozen, his calm and collected hero is ready for a quickdraw. I am always entertained by Eastwood gunning down men bullet after bullet and there's just enough action to keep you interested. So, I must admit Eastwood is an impressive director that lets you enjoy the old West in all its grit and glory despite his hatred. The Outlaw Josey Wales is well shot and creatively directed, so hopefully you can still find someone neat among all the cruel racism and vile sexism.\n\nClint Eastwood himself is the highlight of The Outlaw Josey Wales and probably the only reason this movie has stood the test of time for most audiences. He is his classic quiet hero like \"The Man with No Name\" from Sergio Leone's Dollars Trilogy of Westerns once more. Eastwood just looks too cool squinting his eyes, reaching for his dual revolvers, and blasting away entire groups of foes. I can at least recommend The Outlaw Josey Wales for Clint Eastwood's genuinely awesome lead character in this solid Western.",
            "review_date": "2020-01-03",
            "source": "rt"
        },
        {
            "content": "It is too bad that our younger generation does not care about these type of classic movies. ",
            "review_date": "2020-01-01",
            "source": "rt"
        },
        {
            "content": "The Man with No Name, but more reflective and thoughtful. Eastwood at his best and grittiest. ",
            "review_date": "2019-12-26",
            "source": "rt"
        },
        {
            "content": "A great Western that shows the southern view and side of things unlike modern movies that portray only the yankees as heroes. history is written and twisted by yanks. A great movie that remedies this injustice",
            "review_date": "2019-12-20",
            "source": "rt"
        },
        {
            "content": "Best westerns ever made. \n1. Outlaw Josey Wales\n2. Jeremiah Johnson\n3. Unforgiven\n4.  Tombstone\n5. The Good",
            "review_date": "2019-11-23",
            "source": "rt"
        },
        {
            "content": " A great western. hands down. One of my favorite.",
            "review_date": "2019-10-10",
            "source": "rt"
        },
        {
            "content": "Great movie. A little preachy. It's a shame that a movie like this can't be made today given cancle culture.",
            "review_date": "2019-10-07",
            "source": "rt"
        },
        {
            "content": "The Outlaw Josey Wales is so well made you don't have to watch it twice to see it's appeal",
            "review_date": "2019-06-19",
            "source": "rt"
        },
        {
            "content": "One of my all time favourites,   \n\"Are you gonna pull those pistols or whistle Dixie?\"",
            "review_date": "2019-02-24",
            "source": "rt"
        },
        {
            "content": "Loved it, One of his best in my opinion.",
            "review_date": "2019-02-24",
            "source": "rt"
        },
        {
            "content": "rare 5-star ***** rating. Classic movie made in 1975 post-war. In all aspects of the horse-opera film genre it is almost a perfect picture. Some of the best one-liners in movie history. I gave it to 15-yr. old son to watch, as a right-of-passage.",
            "review_date": "2019-01-22",
            "source": "rt"
        },
        {
            "content": "Exactly everything a western should be. Revenge driven coldheartedness turned into character",
            "review_date": "2019-01-13",
            "source": "rt"
        },
        {
            "content": "Classic Clint!  Probably 15 watches now over the years.  Just a flat-out great western. Period.",
            "review_date": "2018-12-22",
            "source": "rt"
        },
        {
            "content": "An outstanding portrayal of a divided period in American history where actions on both sides led to not only a divided nation but also post-war reprisals which continued the damage from war.",
            "review_date": "2018-12-20",
            "source": "rt"
        },
        {
            "content": "Much like High Plains Drifter this is one of the more underrated Clint Eastwood westerns. This is a thrilling and thought-provoking film that will stand the test of time. It's a story about personal redemption in the face of stark tragedy, injustice and revenge. Although it is set more than 130 years ago, the key elements are played out every night on the news in many parts of the world, most recently in Kosovo. This movie is about a lot more than the post-Civil War period. Wales had a long, violent journey to find people he could make peace with and want to give his life serving. The texture of this film was deep and rich with fine colorful characterizations from Eastwood's supporting cast, particularly the Lone Waite and Fletcher parts. I consider it Clint Eastwood's finest film, both in front of and behind the camera.",
            "review_date": "2018-11-28",
            "source": "rt"
        },
        {
            "content": "Out of all the Wild West movies I have seen, The Outlaw Josey Wales was the most action packed funniest WW movie Iï¿ 1/2 1/2 1/2(TM)ve seen 10/10",
            "review_date": "2018-11-24",
            "source": "rt"
        },
        {
            "content": "I've started to watch this about five times and the first hour each time is utterly incomprehensible. His wife and lad die in a fire, or his wife is raped and murdered, or also taken away, or also a corpse. Then he joins up with not a posse but for some reason that relates to a plot, then the guy is usurped by the Union and tries to kill him. And then some other guy is killed but is sent on a horse as a corpse and then an Indian is suprised by Outlaw Josey Wales. And then another couple hours of such inexplicable nonsense. Maybe Outlaw Josey Wales next meets an alien who he'll take revenge upon the killers of his family (who were those again), the killers being from Ganymede 1A. Or whatever. This movie might get better but the first hour is 100% boring nonsensical horseshit.\n\nAnd I saw this as a big Eastwood fan, including his Westerns and even Dirty Harry. This movie? I feel valid at adding this review as one of maybe millions who just turned the channel, looking for something more sane.",
            "review_date": "2018-07-15",
            "source": "rt"
        },
        {
            "content": "Maybe it's just because I've been watching a lot of Westerns lately, but The Outlaw Josey Wales doesn't strike me as anything special. It's a run-of-the-mill revenge tale with Clint Eastwood playing the same role he has a dozen times before. This isn't a bad movie-it has an interesting story, good acting and sweeping landscapes-it just doesn't really stand out from the rest.",
            "review_date": "2018-06-06",
            "source": "rt"
        },
        {
            "content": "clint eastwood, as always is one of the greatest heros",
            "review_date": "2018-01-11",
            "source": "rt"
        },
        {
            "content": "I FOUND THIS TO BE ONE OF MY LEAST FAVORITE CLINT EASTWOOD FILMS. IT HAD ITS MOMENTS, BUT I LACK TO FEEL ITS OSCAR NOMS AND ITS 1001 MOVIES TOO SEE BEFORE YOUR DIE RIGHT. IT WAS DIFFERENT BUT NOT IN THE WAY THAT CHANGED CINEMA.",
            "review_date": "2017-12-14",
            "source": "rt"
        },
        {
            "content": "Chief Dan Gorgeous George says it all.",
            "review_date": "2017-10-28",
            "source": "rt"
        },
        {
            "content": "Clint Eastwood stars and directs this 1976 western that I would say ranks up amongst his very best including 1992's Unforgiven.\nIt is rather opposite to Unforgiven in that in that film he plays an older character who has long since left his gun slinging days behind in order to find solace after the death of his family yet here he goes in full gun slinging overdrive at times.\nThe cinematography is very polished and matches all the great films from the genre.\nSome of the cast members are native Indian actors. What a good job they do.  I am thinking of Chief Dan George as Lone Watie, Geraldine Jeans as Little Moonlight and Will Sampson as Ten Bears.\nThe story concerns Josey Wales (Eastwood) who sees his wife and son murdered at the start of the film by Union soldiers in the American Civil War.\nEastwood has this great ability to deliver some great sarcastic one-liners in his films. However in this film we yet again see his macho side in doing this and killing a few people but making friends along the way to an escape to Mexico.\nI always have admired actors who direct the film as well and deliver a great film.\nA truly great western film.",
            "review_date": "2017-09-14",
            "source": "rt"
        },
        {
            "content": "Fantastic film and a great Western!",
            "review_date": "2017-09-01",
            "source": "rt"
        },
        {
            "content": "Eastwood’s gritty performance as Josey Wales is one of many fantastic attributes of the film. Along with a good cast and great direction, this outlaw adventure sure is fun. This film is not only one of Eastwood’s better films, but one of the better westerns I’ve seen. My only complaint is the length",
            "review_date": "2017-08-05",
            "source": "rt"
        },
        {
            "content": "He has a name in this one, but everything you love about a gunfighter western is here!\nWatch it!!!",
            "review_date": "2017-05-20",
            "source": "rt"
        },
        {
            "content": "Fantastic characters and writing.  Almost perfection.",
            "review_date": "2017-03-05",
            "source": "rt"
        },
        {
            "content": "Awesome western - Clint Eastwood doing what he does best!",
            "review_date": "2017-02-07",
            "source": "rt"
        },
        {
            "content": "Probably my favorite of all the Clint Eastwood westerns. I enjoy them all but his is awesome.",
            "review_date": "2017-01-25",
            "source": "rt"
        },
        {
            "content": "Young Clint is colddddddd",
            "review_date": "2016-11-23",
            "source": "rt"
        },
        {
            "content": "Another excellent Clint Eastwood western directed by himself.",
            "review_date": "2016-09-01",
            "source": "rt"
        },
        {
            "content": "Story/Screenplay: (4.5/5) A great western film that still holds up four decades after its release.  At the end of the Civil War, a guerrilla fighter is pursued from Missouri to Texas as he makes his way to Mexico.  Along the way, he adds a diverse and interesting range of characters to his company.  An original to this day.\n\nDuration/Tempo: (4/5) At 2 hours and 15 minutes, it's a very long movie that felt about average in length.  Plenty of action, but the characters make the difference in this film.\n\nCast & Crew: (4.5/5) Clint Eastwood and Chief Dan George were excellent, as was John Vernon.\n\nSummary: (4.5/5) The story and cast were excellent, and while the film wasn't short, at no point did it feel slow.  A strong thumbs up.",
            "review_date": "2016-08-27",
            "source": "rt"
        },
        {
            "content": "The Outlaw Josey Wales is very well acted, directed and competently made and the film looks really good, but it is such an uninspired and typical western feature with not a single original or memorable thing in it. The characters are forgettable, the action is overwhelming and the film is too boring at times despite having some genuinely great moments. It is in the end a very dull, overrated movie that favors style over substance.",
            "review_date": "2016-08-24",
            "source": "rt"
        },
        {
            "content": "Eastwood's best film -- as actor & director.",
            "review_date": "2016-06-16",
            "source": "rt"
        },
        {
            "content": "Josey Wales (Clint Eastwood), a Missouri farmer, is driven to revenge by the murder of his wife and young son by a band of pro-Union Jayhawker militants. The Union murderers were from Senator James H. Lane's Kansas Brigade, which included Captain Terrill (Bill McKinney). After grieving and burying his wife and son, Wales joins a group of pro-Confederate Missouri Bushwhackers led by William T. Anderson and fights in the Civil War. At the conclusion of the war, Captain Fletcher (John Vernon) persuades the guerrillas to surrender, saying they have been granted amnesty. Wales refuses to surrender. As a result, he and one young man are the only survivors when Captain Terrill's Redlegs massacre the surrendering men. Wales intervenes and guns down several Redlegs with a Gatling gun. Senator Lane (Frank Schofield) puts a $5,000 bounty on Wales, who is now on the run from Union militia and bounty hunters. Along the way, despite wishing to be left alone, he accumulates a diverse group of companions. They include an old Cherokee named Lone Watie (Chief Dan George), a young Navajo woman (Geraldine Keams), and an elderly woman (Paula Trueman) from Kansas and her adult granddaughter Laura Lee (Sondra Locke) whom Wales rescued from rape by Comancheros. Wales need to handle Captain Terrill´s posse out for his head before they catch up with him and kill him...\n\nUpon release in August 1976, \"The Outlaw Josey Wales\" was widely acclaimed by critics, many of whom saw Eastwood's role as an iconic one, relating it with much of America's ancestral past and the destiny of the nation after the American Civil War. The film was pre-screened at the Sun Valley Center for the Arts and Humanities in Idaho in a six-day conference entitled Western Movies: Myths and Images. Academics such as Bruce Jackson, critics such as Jay Cocks and Arthur Knight and directors such as King Vidor, Henry King, William Wyler and Howard Hawks were invited to the screening. The film would later appear in Time magazine's Top 10 films of the year. Roger Ebert compared the nature and vulnerability of Eastwood's portrayal of Josey Wales with his \"Man with No Name\" character in the Dollars Trilogy and praised the atmosphere of the film. On the Merv Griffin Show, Orson Welles lauded the film, calling Eastwood \"one of America's finest directors.\" \"The Outlaw Josey Wales\" depicts so many topics such as love, hate, revenge, forgiveness, sorrow, life, death, racism, the result of war, betrayal, redemption, solidarity and friendship. Eastwood is his usual self as the quiet but action driven character, close to his \"Man with No Name\" character as Roger Ebert pointed out in his review. The idea of having Wales lose his family in the beginning and \"adopt\" a new one along the course of his destiny is quite nice which ends up with fine support by an excellent ensemble cast including Chief Dan George, Sondra Locke, Geraldine Keams and Paula Trueman. There´s twists and turns and the cunningness of Wales is a great touch as well. For example his action towards the redlegs when they are crossing a river on a raft which he cuts lose in the middle of the river after just waiting on the other side. Josey Wales is a man who becomes tired of all the violence he has had to see and to take part in, but yet he wants to revenge the killing of his family to be able to move on and leave the violence behind him and to be able to live in peace. I saw \"The Outlaw Josey Wales\" when I was a kid and I haven´t seen it for years, until I decided to re-see it the other week. I reckon it´s suffers partly from Eastwood´s direction at times as he hadn´t managed to find his solid direction skills back in 1976 and the acting is not always top notch. The action is full on and I like how Eastwood puts the camera \"behind\" the guns putting you right in the action. Then again the action is not either fully believable at times. \"The Outlaw Josey Wales\" is good, but I can´t say I think it´s one of his best westerns or for that matter one of the best westerns ever made. There´s plenty of other western films in my book that steals the limelight in that genre. Trivia: This movie received a lot of high praise among Native American viewers for its non-stereotypical portrayal of Native Americans in the film.",
            "review_date": "2016-05-28",
            "source": "rt"
        },
        {
            "content": "Clint reminds me of my dad, I like all his stuff",
            "review_date": "2016-05-17",
            "source": "rt"
        },
        {
            "content": "Another pretty fantastic western from Eastwood.  It's a little longer than it needs to be, but I'm glad Eastwood took the time to let it breathe.",
            "review_date": "2016-03-16",
            "source": "rt"
        },
        {
            "content": "Just an outstanding Western. Eastwood is amazing. Great storyline. Loved it!",
            "review_date": "2016-02-28",
            "source": "rt"
        },
        {
            "content": "89%\nWatched this on 25/1/16\nA forgotten classic, perhaps the best western directed by Eastwood, The Outlaw has a layered story, much denser than what you can expect in the genre with a lot of characters and a relatively fast pace, but with some sort of a slow epic feel. Eastwood's character is as mysterious as his characters from the early westerns and it's extremely well shot. It's really dark at times, surprisingly with nudity as well. It's more action packed and violent than your average western.",
            "review_date": "2016-01-25",
            "source": "rt"
        },
        {
            "content": "This movie was an excellent film. Despite the one scene were the characters looked like they were shooting at nothing in the early scenes on there horses galloping in war, everything about Joe is amazing. He is very interesting, and it had Will Sampson. It was historically interesting film, and just one of my favorites.",
            "review_date": "2016-01-10",
            "source": "rt"
        },
        {
            "content": "A good adventure film with cool lines and cool cowboys. Trim 15 minutes and its great",
            "review_date": "2015-08-03",
            "source": "rt"
        },
        {
            "content": "I loved it one of favorite westerns",
            "review_date": "2015-04-03",
            "source": "rt"
        },
        {
            "content": "One of the best western movies of all time.",
            "review_date": "2015-03-31",
            "source": "rt"
        },
        {
            "content": "A very respectable Eastwood western. His directing skill is just as manly as his screen presence. Straight to the point with no fancy shots. His acting is very restrained and you could argue that he's not a good actor at all. Like other actors like Jack Nicholson, the man has the face of a star. Very authentic. He doesn't say much, but when he does speak it's a memorable one-liner. As director and actor Eastwood knows what is too little and what is too much, and he delivers what is necessary. He has enough confidence in the story to let it sell itself without the help of gimmicks and western cliches. The film is very dark, but Eastwood plays his character in a light-hearted way, when he's not in a violent confrontation or witnessing something tragic, and there's a lot of violence and tragedy in this movie. It paints a very hellish picture of the old west. Some characters are even traumatized. Everyone who joins Eastwood has some emotional damage and have lost everything. The depressing nature of the movie makes the finale feel all the more triumphant because once you've made it that far you might be feeling a little angry at the world and how cruel it can be.",
            "review_date": "2015-03-25",
            "source": "rt"
        },
        {
            "content": "classic movie. If you like westerns, good acting, interesting characters, or any clint eastwood movie, I would definitely recommend.",
            "review_date": "2015-03-14",
            "source": "rt"
        },
        {
            "content": "One of the great westerns. Dan George is amazing.",
            "review_date": "2015-03-01",
            "source": "rt"
        },
        {
            "content": "One of the best westerns of all time, great story and cast. Tell Shomi to change the description of the movie though, its totally incorrect.",
            "review_date": "2015-02-01",
            "source": "rt"
        },
        {
            "content": "An odd Western, but I dug it.",
            "review_date": "2015-01-25",
            "source": "rt"
        },
        {
            "content": "An American Western masterpiece!!",
            "review_date": "2015-01-04",
            "source": "rt"
        },
        {
            "content": "This is an important part of why I like Westerns: their \"revisionist\" history.",
            "review_date": "2014-12-28",
            "source": "rt"
        },
        {
            "content": "Epic movie, timeless classic tale from the Wild West period. Eastwood's best performance that I've seen as a lead role.",
            "review_date": "2014-12-24",
            "source": "rt"
        },
        {
            "content": "Like every other Eastwood western, it's great!",
            "review_date": "2014-12-15",
            "source": "rt"
        },
        {
            "content": "The best Eastwood western is crisp,well written and well......Clint's just soooooo bad ass in this classic story of revenge.",
            "review_date": "2014-10-13",
            "source": "rt"
        },
        {
            "content": "A really dumb shoot-em-up western, complete with gatling guns. Hard to believe that this is from the same director as \"Flags of Our Fathers!\"",
            "review_date": "2014-10-03",
            "source": "rt"
        },
        {
            "content": "Eastwood Directs And Stars As A Hard-Hitting, Fast-Drawing Loner, Recalling Traits From His \"Man With No Name\" Character From His Spaghetti Westerns. After Avenging His family's Brutal Murder, Wales Is Branded An Outlaw & Must Stay On The Run. He Travels Alone Until A Group Of Outcasts Are Drawn To Him. Wales Must Now Protect His Surrogate Family, From The Bounty Hunters After Him & Indians Who May Attack At Any Moment. Eastwood's Skill Before & Behind The Camera Connects With His Audience Through The Films Dry Humour, Tenderness & Its Action Sequences.",
            "review_date": "2014-09-30",
            "source": "rt"
        },
        {
            "content": "Love how he gobs on all manner of creatures",
            "review_date": "2014-09-29",
            "source": "rt"
        },
        {
            "content": "(63%)\nWithout doubt a Eastwood movie. The plot is simple, the characters are simple, the direction is very unfussy and it tells its story well. This is a 70's PG so expect a fair amount of violence, a couple of rape scenes, and a message that if people wrong you then bloody vengeance is the only answer. The pacing isn't exactly sharp, but there's at least a realistic, gritty edge throughout. And old Clint    plays an old west wronged man like no other, and it's clear that he has learned a thing or two from all those spaghetti westerns. Overall a good watch that all true fans should track down.",
            "review_date": "2014-09-03",
            "source": "rt"
        },
        {
            "content": "It's not Clint Eastwood's best Weston but it's still a good film.",
            "review_date": "2014-08-04",
            "source": "rt"
        },
        {
            "content": "From spit, to grim death, to battle, to laughs a journey with the great Josey Wales is a fun ride and a classic good old fashioned western.",
            "review_date": "2014-07-26",
            "source": "rt"
        },
        {
            "content": "Add another perfect role into Eastwood's canon. He is as quick with his wit and tongue as he is with his pistol.",
            "review_date": "2014-07-22",
            "source": "rt"
        },
        {
            "content": "It takes some guts to make a Western where a Confederate soldier is the hero and the Union army are the bad guys. They pull it off relatively well by having the Union soldiers do multiple despicable acts to Josey and his friends. These awful acts of the Union also offer a strong revenge motivation behind Josey's service in the war, so they don't have to address any political leanings in the characters. Josey Wales is a man who had everything he cared about taken from him, so he learns to fight and vows to take out the men who took his family. Along the way he faces a lot of opposition including bounty hunters, slick salesmen, and Native Americans. But he also attracts a number of admirers and companions. It's an interesting tale of a man who wants revenge but also seems to just want to be left alone. I love Clint Eastwood's portrayal of the titular character, because he has perfected that no-nonsense look as if he is always in control and opposing him is foolish. He also hints at a decent amount of emotion behind his eyes. He might seem calm and composed, but there are times when you can see that he really cares about the people around him. Perhaps the longest and most developed relationship in the film is between Josey and Lone Watie (played by Chief Dan George.) They have a nice comedic banter between them that I absolutely loved, and this built into a strong bond where the 2 characters trust one another implicitly and can almost predict what the other will do.\n\nI must admit that there were some slower scenes in this film. I wasn't to the point of boredom or anything, but I was itching for some action at times. Don't get me wrong, I like the character development scenes, but there were times where it felt like nothing of value was being added and they could have edited down some of the slower moments. But perhaps this is just a genre thing, part of giving that old west feel to a film could be infusing it with a more leisurely pace. My only other complaint wasn't anything major, but I didn't buy into all the characters' motivations for latching onto Josey Wales. There were some of the people that were introduced later in the story that seemed to have no logical reason to be devoted to him instead of cashing in on his bounty. Yet the story was so good, and the characters were so diverse and entertaining, I didn't mind. It was a strong Western that continued my education in the genre and helped me discover that Clint Eastwood knows how to make these films better than most. I think I still like Pale Rider a bit more than this film, but not by much. I'd gladly watch The Outlaw Josey Wales again any time. If you are a Western fan and haven't seen it, this should be on your must watch list.",
            "review_date": "2014-07-01",
            "source": "rt"
        },
        {
            "content": "My all time favorite Clint Eastwood and one of my favorite westerns. Wish they had stuck to the book but they didn't change much.",
            "review_date": "2014-06-26",
            "source": "rt"
        },
        {
            "content": "One of Clint Eastwood's most fun westerns.",
            "review_date": "2014-06-25",
            "source": "rt"
        },
        {
            "content": "This is Clint Eastwood at his best in a classic western that isn't in any way farfetched, and driven more by story and character development than it is action. Definitely one of the finest westerns ever.",
            "review_date": "2014-06-21",
            "source": "rt"
        },
        {
            "content": "The greatest Western ever made.  Eastwood is the star, but Chief Dan George often steals the show.",
            "review_date": "2014-06-03",
            "source": "rt"
        },
        {
            "content": "While perhaps hamstrung by some weaker supporting roles and lethargic pacing, Josey Wales still boasts a witty script, a light-hearted tone and a typically compelling performance by Eastwood.",
            "review_date": "2014-05-14",
            "source": "rt"
        },
        {
            "content": "Though it gets repetitive in its plot, Clint Eastwood delivers a solid entry in the revisionist western genre as both actor and director.",
            "review_date": "2014-05-04",
            "source": "rt"
        },
        {
            "content": "LOVE IT! Chief Dan George really shines in this film.",
            "review_date": "2014-05-03",
            "source": "rt"
        },
        {
            "content": "One of the greatest westerns of all time.",
            "review_date": "2014-04-22",
            "source": "rt"
        },
        {
            "content": "Clint Eastwood once again kicks ass in The Outlaw Josey Wales: a well crafted and entertaining western",
            "review_date": "2014-02-27",
            "source": "rt"
        },
        {
            "content": "When a brigade of Union soldiers pillages & kills one man's family, he starts a violent journey to revenge & redemption in this non-too-subtle antiwar western.",
            "review_date": "2014-02-24",
            "source": "rt"
        },
        {
            "content": "I was looking for http://ReviewOutlaw.com but instead found this site, if you are looking for Hacks, Reviews, How to's and more. then Check out review Outlaw",
            "review_date": "2014-02-18",
            "source": "rt"
        },
        {
            "content": "Eastwood's fifth directorial effort is a vastly over-rated revenge western that carefully glosses over most of the racism but annoyingly preserves all the right-wing paranoia and revisionist history of Confederate sympathizers. Still, the mood is perfectly pitched and the action, particularly the violent climactic shootout is quite exciting and certainly a visual feast, the ending is one of the most satisfying payoffs to a Western ever.",
            "review_date": "2014-02-04",
            "source": "rt"
        },
        {
            "content": "Clint Eastwood's portrayal of Josey Wales is exactly what you'd expect (stoic intensity along with terrifying one-liners) but the rest of the characters are all wonderfully strange and unique . . . so while Wales is a familiar character, the world he occupies is not. Ultimately, what makes \"The Outlaw Josey Wales\" far more complex and daring than your standard revenge story is that it actually portrays the negative effects of violence on individuals and communities.",
            "review_date": "2014-02-04",
            "source": "rt"
        },
        {
            "content": "Who is the communist pickle-puffer who doesn't like Josey Wales?!  A man, his Schoefields and his quest for justice and peace....what's not to love?",
            "review_date": "2014-01-31",
            "source": "rt"
        },
        {
            "content": "eastwood at his best - stark, cold, and charming with an endearingly understated humor and sense of compassion",
            "review_date": "2014-01-05",
            "source": "rt"
        },
        {
            "content": "Directed by, and starring, the great Clint Eastwood, this portrayal of a man seeking redemption is superbly handled, and balanced beautifully against the violent backdrop of the old west. A wonderful movie.",
            "review_date": "2013-12-29",
            "source": "rt"
        },
        {
            "content": "This movie was great!  I just really liked everything about it.  Clint Eastwood was his typical badass self, and while that's always fun to watch when you pop in an Eastwood movie, it's the supporting cast here that really gives the film its heart.  Josey Wales picks up some misfits on his journey west, including the Native American Lone Watie, played by Chief Dan George.  He was a great counter to Wales and was fun to watch.  He had that awesome line, \"Get ready, lady.  Hell is comin' to breakfast.\"  I love that.  John Vernon was also awesome as the villain pursuing Wales across the country.  He brought that same sinister snarl that made us hate him in Animal House.  How could you not love Vernon's performance?\nI've never been big into Westerns, but The Outlaw Josey Wales is definitely one to watch multiple times.  It's well put together as one of the first movies Eastwood directed, and sets the stage to establish him as one of the best filmmakers of the modern years.",
            "review_date": "2013-12-17",
            "source": "rt"
        },
        {
            "content": "Quality through and through",
            "review_date": "2013-11-27",
            "source": "rt"
        },
        {
            "content": "Eastwood's \"Unforgiven\" is a masterpiece, but so is this and its more fun. It contains one of the greatest collection of characters in any western. I love the way Eastwood, as director, uses adaptations of folk tunes and hymns to mix with the story. \"The Outlaw Josey Wales\" is not a cowboy movie. You could argue that it is a western super hero movie with the same amount of heart and character as \"The Dark Knight\".",
            "review_date": "2013-11-23",
            "source": "rt"
        },
        {
            "content": "A classic that still stands strong compared to modern films.",
            "review_date": "2013-11-15",
            "source": "rt"
        },
        {
            "content": "Best movie Clint ever made!",
            "review_date": "2013-11-10",
            "source": "rt"
        },
        {
            "content": "Once again giving a few minor twists to the established genre, The Western.",
            "review_date": "2013-10-30",
            "source": "rt"
        },
        {
            "content": "The Outlaw Josey Wales is very interesting to contrast to Clint Eastwood's earlier western films with Sergio Leone because of how in those films he portrayed the famous Man with No Name whereas in The Outlaw Josey Wales his character?s name is his legacy and is spread wide in the story's universe.\nThe Outlaw Josey Wales is a strong western because of its titular character who is a true cowboy that holds all the values that a cowboy does in a revisionist society, including the individualistic freedom that can carry one to ride the high country like Josey Wales does. The film makes him a really strong character, one that is up to the standard of Clint Eastwood as an actor and action hero. \nClint Eastwood pours a lot of effort into the story behind this revisionist western, and it comes off very well. The Outlaw Josey Wales is a lot of things. It's clever, original, entertaining, powerful and visually spectacular. One thing it is certainly not is boring.\nAlthough it is a long journey and there are times where thing may seem confusing or half explained, the premise is consistently entertaining and it is built on good themes, themes that are key to western mythology and to the entertainment value of The Outlaw Josey Wales. \nAnd as traditional with Clint Eastwood westerns, The Outlaw Josey Wales is ridden with the entertainment of some top notch action, a fine musical score, some skilful editing and fine cinematography, and on top of it all a bravado lead performance from Clint Eastwood.\n__________. also does a good job, as does ________.\nThe Outlaw Josey Wales is really just a film that any western fan or Clint Eastwood fan wouldn't want to miss, and anyone studying his films at all should definitely view it in comparison to his work with Sergio Leone.",
            "review_date": "2013-10-27",
            "source": "rt"
        },
        {
            "content": "Clint Eastwood er altid - ALTID - sej, men resten af filmens hold spiller ikke synderligt godt. Filmen er til tider også lidt langtrukken, men den giver til gengæld en god skildring af livet på den tid, og måske en af de mest fair skildringer af indianere. Filmen har også udmærket action og især scenerne med duellerne på heste er godt lavet. OK underholdning.",
            "review_date": "2013-10-23",
            "source": "rt"
        },
        {
            "content": "A different western.",
            "review_date": "2013-10-06",
            "source": "rt"
        },
        {
            "content": "A terrible disappointment of Western cliches.  Man wronged seeks vengence on the entire West by overcoming all odds.  Suggest this one for children and naive adults.   Good cinematography however helps this worn out tale of savior with a six gun righting all wrongs.\r\n\r\n[img]http://images3.static-bluray.com/reviews/4391_4.jpg[/img]\r\n\r\n\r\nWhile Eastwood himself thought this his favorite film, it backfired for me his most ardent supporter and fan. Hoped for so much more. Just another not credible Western.  \r\n\r\n\r\n[img]http://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Pahreah_%28Paria%29_Town_Site%2C_Utah1.jpg/220px-Pahreah_%28Paria%29_Town_Site%2C_Utah1.jpg[/img] filming sight in Utah\r\n\r\nLook for legend Royal Dano in a minor role.  Sandra Locke plays a major role in the film and others to follow with Eastwood ultimately becoming his wife and then ex-wife.\r\n\r\n[img]http://upload.wikimedia.org/wikipedia/en/thumb/f/f0/The_outlaw_josey_wales.jpg/220px-The_outlaw_josey_wales.jpg[/img]\r\n\r\n\r\n\r\nSEE the entire film here:\r\n\r\nhttp://www.youtube.com/watch?v=ehZELRFkfUg\r\n\r\n\r\nEastwood has called The Outlaw Josey Wales an anti-war film.\r\n\r\n\r\n[img]https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcSjq4MdgmVymT2G_HiW50FfNcDlqE4x4Atse2GatsH3Jr8yWYnr[/img]  Lots of killing in this one and done by Wales\r\n\r\n\r\n\r\nReviews:\r\n\r\n1  80%\r\n One of Eastwood's earlier films is also one of his best. A compelling western about a man joining a gang of confederate raiders to get revenge on the ...\r\n \r\n2   60%\r\n One of the few old westerns that I can watch and enjoy.\r\n\r\n[img]https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTAfD_U9dB2P0Xrsyr1zyxxtQZUXb9zx-KYrncrsjBoJ4-L46LJ[/img]\r\n\r\n\r\n\r\n\r\nNOTES:\r\n\r\n1  The Outlaw Josey Wales is a 1976 American revisionist Western film set during and after the American Civil War.\r\n\r\n2  In 1996, the film was selected for preservation in the National Film Registry of the Library of Congress.\r\n\r\n3  The Outlaw Josey Wales was inspired by a 1972 novel by Forrest Carter, originally titled The Rebel Outlaw: Josey Wales and later retitled Gone to Texas. \r\n\r\n4  ... one of the few Western films to receive critical and commercial success in the 1970s at a time when the Western was thought to be dying as a major genre in Hollywood.\r\n\r\n5   The Outlaw Josey Wales was nominated for the Academy Award for Original Music Score.\r\n\r\n\r\n[img]https://encrypted-tbn1.gstatic.com/images?q=tbn:ANd9GcTKlXi72meTOKioPZsSiERsUAd9VASZr9PWB2gdWvqhBxvxMW4sAQ[/img]\r\n\r\n\r\n\r\nClint Eastwood as Josey Wales\r\n Chief Dan George as Lone Watie\r\n Sondra Locke as Laura Lee\r\n Bill McKinney as Terrill\r\n John Vernon as Fletcher\r\n Paula Trueman as Grandma Sarah\r\n Sam Bottoms as Jamie\r\n Geraldine Keams as Little Moonlight\r\n Woodrow Parfrey as Carpetbagger\r\n Joyce Jameson as Rose\r\n Sheb Wooley as Travis Cobb\r\n Royal Dano as Ten Spot\r\n Matt Clark as Kelly\r\n Will Sampson as Ten Bears\r\n John Quade as Comanchero Leader\r\n Richard Farnsworth as one of the Comancheros\r\n Kyle Eastwood as Josey's son\r\n Len Lesser as Abe\r\n Doug McGrath as Lige\r\n John Russell as Bloody Bill Anderson\r\n John Chandler as first bounty hunter\r\n\r\n\r\n[img]https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcR6sWCwD99K-qtaUQNurqVAalUg2ZHKZjGT6frIRou4lr4SL5LDWQ[/img]\r\n\r\n\r\nDirected by\r\n Clint Eastwood\r\n \r\nProduced by\r\n Robert Daley\r\n\r\nWritten by\r\n Forrest Carter\r\n\r\nScreenplay by\r\n Philip Kaufman\r\n Sonia Chernus\r\n\r\nMusic by\r\n Jerry Fielding\r\n\r\nCinematography\r\n Bruce Surtees\r\n\r\nEditing by\r\n Ferris Webster\r\n\r\nStudio\r\n The Malpaso Company\r\n Warner Bros.\r\n\r\nDistributed by\r\n Warner Bros.\r\n\r\nRelease date(s)\r\n June 30, 1976\r\n\r\nRunning time\r\n 135 minutes\r\n \r\nBudget\r\n $3.7 million\r\nBox office\r\n $31,800,000\r\n\r\n\r\n[img]http://screencrave.com/wp-content/uploads/2011/05/outlaw-josey-wales.png[/img]",
            "review_date": "2013-08-15",
            "source": "rt"
        },
        {
            "content": "One of Eastwood's earlier films is also one of his best. A compelling western about a man joining a gang of confederate raiders to get revenge on the group of outlaws that killed his family, this is the tale of a man that want to live in peace but has no trust in the institutions to help him achieve piece of mind. Resembling a more pacifist version of a Leone thriller, this film also has surprisingly witty dialogue and a Clint Eastwood in top form behind and in front of the camera who shows great sensitivity to the subject and to a structure that was hardly ever rendered as human as it is in The Outlaw Josey Wales.",
            "review_date": "2013-08-02",
            "source": "rt"
        },
        {
            "content": "Clint Eastwood makes pretty good old westerns.",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "One of the few old westerns that I can watch and enjoy.",
            "review_date": "2013-07-27",
            "source": "rt"
        },
        {
            "content": "The Outlaw Josey Wales stands out as one of Clint Eastwood's best movies for its interesting plot, awesome characters, and cool action.",
            "review_date": "2013-07-24",
            "source": "rt"
        },
        {
            "content": "Clint Eastwood knows how to make westerns",
            "review_date": "2013-07-04",
            "source": "rt"
        },
        {
            "content": "Clint Eastwood stars as a rancher and is out to get revenge on the people who killed his family.",
            "review_date": "2013-05-08",
            "source": "rt"
        },
        {
            "content": "Clint Eastwood continues to show he is a badass in this movie.  Whatever you do, do not ask the Outlaw to give up his guns or you may be just another victim.",
            "review_date": "2013-04-27",
            "source": "rt"
        },
        {
            "content": "I'm so used to the man with no name, that i hold those movies to a high standard but this is still a good western.",
            "review_date": "2013-04-21",
            "source": "rt"
        },
        {
            "content": "So many classicly-cheesy one-liners in this western flick. Must see. 4/5",
            "review_date": "2013-04-10",
            "source": "rt"
        },
        {
            "content": "The Outlaw Josey Wales is a timeless classic....",
            "review_date": "2013-03-26",
            "source": "rt"
        },
        {
            "content": "A slightly flat attempt from Clint. The headline roles are played well, mixing some comedy in with the legend of the west (this time also sitting in the directors chair). Yet the story appears to be stuck in a never-ending loop of build up to anti-climax. The ending is the highlight of the film, but not only because it presents a step forward in the story. Worth a watch, yet the film has a certain emptiness about it. Especially when compared to Clints previous western triumphs.",
            "review_date": "2013-03-26",
            "source": "rt"
        },
        {
            "content": "Great western of all time",
            "review_date": "2013-03-08",
            "source": "rt"
        },
        {
            "content": "A strong precursor to Eastwood's revisionist western experiment with a more positive finale. Indian-American relations and South-North relations as well are confounded to good effect. But due to the length an editor however was sorely missed. first time rating: 7.4/10",
            "review_date": "2013-02-22",
            "source": "rt"
        },
        {
            "content": "Possibly my new favorite western.",
            "review_date": "2013-02-09",
            "source": "rt"
        },
        {
            "content": "dying ain't much of a livin'",
            "review_date": "2013-02-05",
            "source": "rt"
        },
        {
            "content": "One of the Best Westerns EVER!",
            "review_date": "2013-02-01",
            "source": "rt"
        },
        {
            "content": "Eastwood has now gone to post Civil War era and is still great to watch.",
            "review_date": "2013-01-28",
            "source": "rt"
        },
        {
            "content": "A pretty slick western. A little bit fun and a little bit serious.",
            "review_date": "2013-01-25",
            "source": "rt"
        },
        {
            "content": "Kick ass western. Favorite western pre-Django.",
            "review_date": "2013-01-23",
            "source": "rt"
        },
        {
            "content": "8.5. What a fantastic story. It's not the most intelligent one, but it's the kind of story that really pulls you in and makes you feel for a character, and at the same time love the pure awesomeness that he shows.",
            "review_date": "2013-01-21",
            "source": "rt"
        },
        {
            "content": "It pales in comparison to The Good, The Bad, and The Ugly, but The Outlaw Josey Wales has some welcome humor added into the mix that is a welcome addition to the previously somber Eastwood westerns.",
            "review_date": "2013-01-18",
            "source": "rt"
        },
        {
            "content": "\"The Outlaw Josey Wales\" is a great Action Western film starring and directed by Clint Eastwood, as a man who is on the run from the Union after the civil war has ended and he is the last man left from his band of rebels exacting revenge on the Union.  Eastwood isn't giving a performance he hasn't already given before, but he is good in that role, and when the film has a better storyline around him, all the better.  He is also a competent director, which gives the film a decent visual sense.  It is an excellent Western, quite entertaining.",
            "review_date": "2013-01-09",
            "source": "rt"
        }
    ]
}