{
  "title": "Midnight Cowboy",
  "rating": 8.2,
  "release_date": "1969-05-25",
  "genre": [
    "Drama"
  ],
  "summary": "A naive hustler travels from Texas to New York to seek personal fortune but, in the process, finds himself a new friend.",
  "critic_reviews": [
    "Superb performances and a compelling script have made this film a strange mix of Oscar-winner and Cult Classic.",
    "This multi-Oscar-winner nails its characters, time period, and locale so perfectly that it becomes even more compelling as time goes by. Fueled by two riveting character studies and its exposure of New York City's seamy underbelly, the movie screams “contemporary” and “eternal” at once...It's one of those rare movies that comes together just about perfectly, so check out this theatrical release while you can.",
    "To watch Midnight Cowboy is to find one of the great rewards of the movies, two of the finest performances ever seen, and a city made new every time you watch it.",
    "A great picture, 113 minutes of stirring stuff, set to the ironic lilt of Jean \"Toots\" Thielemans's harmonica and Harry Nilsson's theme tune, \"Everybody's Talkin'.\"",
    "Even as a kid, I could see that Midnight Cowboy’s true subject isn’t decadence but loneliness...Midnight Cowboy’s peep-show vision of Manhattan lowlife may no longer be shocking, but what is shocking, in 1994, is to see a major studio film linger this lovingly on characters who have nothing to offer the audience but their own lost souls.",
    "It is a mark of Voight's intelligence that he works against his role's melodramatic tendencies and toward a central human truth. In the process, he and Hoffman bring to life one of the least likely and most melancholy love stories in the history of the American film.",
    "This is really Schlesinger's achievement. He has caught on film a slice of America as well, if not better, than one had any right to expect.",
    "The performances and presences of Voight and Hoffman are so extraordinarily affecting that their scenes together generate more emotional power than the dramatic wiring of their relationship deserves. [29 May 1969, p.47]",
    "There is no question that this film is flawed by the inclusion of the party scene and Ratzo's dream, but I cannot recall a more marvelous pair of acting performances in any one film. Dustin Hoffman deserves the Oscar for a role that is prickly on the outside, but tender on the inside.",
    "Talented Englishman Schlesinger had an unerring eye for capturing the grimy reality of New York, even if his directorial style is more jittery than is really necessary.",
    "Midnight Cowboy often seems to be exploiting its material for sensational or comic effect, but it is ultimately a moving experience that captures the quality of a time and a place. It's not a movie for the ages, but, having seen it, you won't ever again feel detached as you walk down West 42d Street, avoiding the eyes of the drifters, stepping around the little islands of hustlers, and closing your nostrils to the smell of rancid griddles.",
    "Whew! It’s shocking - a horror film but extremely well done by producer Jerome Hellman and John Schlesinger, the British director who uncannily captures the feeling for tragedy in this locale, the forced gaiety of some who have sunk to the lower depths of despair and sympathy for the two disillusioned protagonists.",
    "All of these criticisms exist entirely apart from the performances of Dustin Hoffman and Jon Voight. It is a tribute to them, and to the core of honesty in the screenplay, that Ratso and Joe Buck emerge so unforgettably drawn. But the movie itself doesn't hold up.",
    "The sometimes amusing but essentially sordid saga of a male prostitute in Manhattan,...Midnight Cowboy is of the modern moment moderne. It has a hot topical theme; a popular actor from last year’s greatest film comedy; a miscellany of competent bit players, a good deal of both sly and broad humor. If the women object, and some will, that it accords their sex scant courtesy, the story hardly presents males as admirable. Indeed in this film the scenery is lovely and only the human race is vile.",
    "The acting, showy and instinctual, is most of the movie; the visual style is too forced and chicly distended to let the drama acquire much natural life of its own. It's a film that expresses a great deal of disgust toward homosexuals, while placing a sympathetic homosexual relationship at its core.",
    "Outrageously overrated... the film indulges in bland satire, fashionable flashiness, and a sodden sentimentality that never admits either to its homosexual elements or to the basic misogyny of its stance. Add to that a glamorisation of poverty and an ending that makes Love Story seem restrained, and you have a fairly characteristic example of Schlesinger's shallow talent."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Dark, grimy, and disturbing, Midnight Cowboy is not exactly the film I thought it was going to be. I knew it was about a male prostitute, but I thought both Jon Voight and Dustin Hoffman were going to be prostitutes, not just Voight. It wasDark, grimy, and disturbing, Midnight Cowboy is not exactly the film I thought it was going to be. I knew it was about a male prostitute, but I thought both Jon Voight and Dustin Hoffman were going to be prostitutes, not just Voight. It was also my assumption that he was not some wannabe prostitute who does not really work, but rather an established one in New York City. Naturally, in line with this, my expectation was to see a lot more sex than I actually got. Now, none of these are bad things, in fact rather good. By not meeting these expectations, Midnight Cowboy manages to actually tell a far more interesting story of a young, hurt Texan boy coming to New York City to try to become a prostitute and meeting an ill loser with a limp who becomes his best friend. As a startling counter-point to the American dream at the height of the Vietnam War, Midnight Cowboy is a very good character study and a pure technical showcase for director John Schlesinger.With this young Texan cowboy Joe Buck (Jon Voight), Midnight Cowboy creates the quintessential American male. Name dropping Gary Cooper or John Wayne as similar ideals of what a man is supposed to be, it is only natural that in the counter-culture 1960s, Schlesinger would take this example of masculinity and throw him into situations unfit for men. Sleeping with women as a prostitute or even partaking with some men when times are hard, as well as going to seedy underground parties with drugs, Joe Buck seems to be a man who could not be further from the old school definition of masculinity even if his look and style of dress say otherwise. Compounding this, he steals readily. Inspired by friend Enrico \"Ratso\" Rizzo (Dustin Hoffman), Buck begins to rob people or steal small items to attempt to get any small number of funds for the two of them, Buck flies in the face of classic cowboy western stars Cooper and Wayne. Known for playing Sheriffs or simply passer-bys who fight against men who steal land/cattle from others, Cooper and Wayne are strictly on the \"right\" side of morality. Buck, however, by trading in sex and stealing stands as the complete foil to those classic men, to the degree that he would be an appropriate antagonist in one of their films. Schlesinger certainly hints at this dark villainy by the film's title of Midnight Cowboy. Dark and ominous, the addition of \"Midnight\" makes it read as being the darker version of a cowboy and, as it plays out, it is very appropriate.In the process, Midnight Cowboy stands as a critique of the American dream. With a small town boy coming to the big city on a bus ride that takes him through quintessential American items - commercial billboards, oil, diners, etc. - the film presents Americana and then shows the polar opposite: the dark underbelly. Showing how this unassuming and innocent boy is quickly corrupted and spit out by the big city, the film shows Joe's journey from renting a small hotel room to being kicked out and having to stay in a condemned building with Ratso. Going from the penthouse in which he spends an afternoon with a rich cougar to the literal sewer with a man nicknamed rat, Joe goes from king of the hill to bottom of the heap in no time whatsoever. As easily as he walked in, New York City and its high barriers to entry spit him out into the gutter with drug-infested parties, dirty homes, and grime around every corner. On the surface, for men such as Joe or others who journey to the big city to achieve their dreams, it all seems so easy. Once they arrive, however, the city and its machinations put up barriers all around that make \"making it\" a challenge few can accomplish. Unfortunately for Joe, he is not one of those and, as a result, he must live in what can only be defined as \"squalor\" on a good day.To capture the horrors seen by Joe - even if he does not believe them to be horrors - Schlesinger uses hectic and pretty nifty camera work throughout. Constantly cutting with jarring flashbacks revealing Joe's horrifying past in Texas with his unstable girlfriend, Midnight Cowboy can really only be described as a kaleidoscopic descent into the madness of this grimy and dark world of sin that he has found himself trapped within. Yet, perhaps most interesting is the party sequence. Using what is best described as a picture-in-picture approach at times, Schlesinger shows a shrunken version of the shot in the middle of the screen with the blown up, out-of-focus version of that shot playing in the background. It is deeply unsettling, off-putting, and greatly unique to watch. It really captures the mind-altering and vision-altering impact of drugs and makes what is already a deeply unsettling sequence to watch feel even grimier and more distorted.",
      "review_date": "2017-09-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Midnight Cowboy is both an interesting and excellent piece of film history. As the first X Rated (at the time) award winning film, this movie provides both great insight into the past, and a timeless story of outcasts trying to find their wayMidnight Cowboy is both an interesting and excellent piece of film history. As the first X Rated (at the time) award winning film, this movie provides both great insight into the past, and a timeless story of outcasts trying to find their way in the world. Jon Voight and Dustin Hoffman give performances that are beyond belief. The script and world of the movie are brutal, raw, unforgiving, and surprisingly hopeful. The direction is peerless. This is a movie any movie buff would be proud to watch. Midnight Cowboy will stick with you long after the credits roll.",
      "review_date": "2018-11-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is a very fine film with a lot of merits. The film does look great, with beautiful scenery and crisp cinematography and the lighting is very atmospheric and always fits perfectly with every scene. The music is wonderful, with theThis movie is a very fine film with a lot of merits. The film does look great, with beautiful scenery and crisp cinematography and the lighting is very atmospheric and always fits perfectly with every scene. The music is wonderful, with the highlight being the excellent Everybody's Talking', the story is very strong focusing on the friendship of the two main characters and well-paced and the dialogue is thought-provoking and poignant. The direction is top notch using every trick in the book and wonderfully and the characters constantly captivate. And this is helped by the magnificent playing of Jon Voight and Dustin Hoffmann, especially Hoffmann who I personally think should have got the Best Actor Oscar that year. Overall, a truly fine film. 10/10 Bethany Cox",
      "review_date": "2022-03-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "and none of my own..Midnight Cowboy\n\nIt is not your usual character driven feature; its bold and brutal decisions that it makes on script cringes you on your seat and still feels utterly palpable to its tone and the pragmatic charactersand none of my own..Midnight CowboyIt is not your usual character driven feature; its bold and brutal decisions that it makes on script cringes you on your seat and still feels utterly palpable to its tone and the pragmatic characters that it is based upon. John Shlesinger; the director could have done a lot better than he did on execution for the adapted screenplay is written explicitly by Waldo Salt. Jon Voight is going \"all in\" in his portrayal but the real game changer is Dustin Hoffman that shines all over the screen because of the depth of his character too prior to his performance. Midnight Cowboy had an interesting concept with a smart approach that captures audience's attention from the first frame and if it was supervised a bit more strictly and better, it would have easily entered the major league.",
      "review_date": "2018-04-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This a feel-bad movie. Don't watch it if you're looking for any kind of positive emotions, because there are none in this movie. It's constant sadness, suffering and hopelessness, and it's only made bearable by Joe Buck's naive optimism,This a feel-bad movie. Don't watch it if you're looking for any kind of positive emotions, because there are none in this movie. It's constant sadness, suffering and hopelessness, and it's only made bearable by Joe Buck's naive optimism, which also kinda makes it hurt even more.It's also a must-watch. Jon Voight and Dustin Hoffman give truly magnificent performances and the film goes into unexpect psychedelic places. Hoffman's peformance in particular as a sick man who's condition slowly deteriorates over the course of the movie is so believable that I felt like I got a fever just from watching him.",
      "review_date": "2020-09-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A grim and at times a disturbing look into the life of two complete opposites who become friends on the streets on New York. This movie is about loneliness as much as it's about friendship.Hoffman delivers in spades in what is arguably hisA grim and at times a disturbing look into the life of two complete opposites who become friends on the streets on New York. This movie is about loneliness as much as it's about friendship.Hoffman delivers in spades in what is arguably his greatest performance.",
      "review_date": "2021-01-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Seems impossible that this was made in 1969, besides some poorly aged dialogue the filmmaking and editing are so fresh and innovative. As far as the story goes its whatever. The main song was dope.",
      "review_date": "2023-01-26",
      "source": "metacritic"
    }
  ],
  "num_reviews": 23
}