{
    "rating": 9.2,
    "release_date": "1958-09-18",
    "num_reviews": 90,
    "genres": [
        "English"
    ],
    "summary": "After Brick Pollitt (Paul Newman) injures himself while drunkenly revisiting his high school sports-star days, he and his tempestuous wife, Maggie (Elizabeth Taylor), visit his family's Mississippi plantation for the 65th birthday of his hot-tempered father, Big Daddy (Burl Ives). Cantankerous even with declining health, Big Daddy demands to know why Brick and Maggie haven't yet given him a grandchild, unlike Brick's brother Gooper (Jack Carson) and his fecund wife, Mae (Madeleine Sherwood).",
    "reviews": [
        {
            "content": "Paul Newman's great performance",
            "review_date": "2023-02-16",
            "source": "rt"
        },
        {
            "content": "Two points for Liz Taylor at her peak and Two points for Paul Newman at his peak. And another point for the story because I hear it's a classic. Great film",
            "review_date": "2022-08-13",
            "source": "rt"
        },
        {
            "content": "Either Elizabeth Taylor or Grace Kelly was  the most beautiful woman to EVER walk this Earth, I couldn't argue with either choice.  Liz positively smolders in this film, and she's the only reason to watch it.  I'm told it's even more remarkable that she pulled this performance off since her husband had recently died in a plane crash.  Paul Newman may or may NOT have been great in this but his character is such a loathsome individual it's hard to tell.  Burl Ives is surprisingly good, although since he was best known as a singer, he may have been chosen for his outsized girth rather than his acting chops;  Slim Pickins wasn't going to portray Big Daddy! Everyone else in the supporting cast is just annoying.  Ten minutes into the movie I'm watching Liz undress in front of a disinterested husband and I'm screaming: \"This guy is gay!\"  Word is that that aspect of the Tennessee Williams play was downplayed here due to the still active Hollywood Production Code,  which cuts the heart out of this screenplay.",
            "review_date": "2022-04-12",
            "source": "rt"
        },
        {
            "content": "A wonderful and intense film. Cat on a Hot Tin Roof was an incredible film with the excellent acting from Elizabeth Taylor, Paul Newman, and Burl Ives. Not only that, the costume designs were subtle and nuanced (especially for Elizabeth Taylor's character). Cat on a Hot Tin Roof is an extraordinary remarkable film that one will enjoy.",
            "review_date": "2022-04-05",
            "source": "rt"
        },
        {
            "content": "A powerful movie with a perfect cast and great direction.\nGreat to see Elizabeth Taylor, Paul Newman and Burl Ives at the peak of their careers. \nOne of the truly great movies of the 1950's.",
            "review_date": "2021-11-28",
            "source": "rt"
        },
        {
            "content": "A wonderfully acted film. Yes it would have been nice had some of the homosexual subtexts from the play were kept in but such was the time and the Hays Code they had their hands tied. Three supreme performances at the heart of film by Elizabeth Taylor, Paul Newman and Burl Ives. Taylor especially gives a performance dripping with anguish opposite the always outstanding Newman. Taylor and Newman were approaching their professional peaks and their scenes were laced with subtexts of sexual repression and bitterness that they played perfectly.\n\nIves gives a powerful performance ably supported by Judith Anderson who gives a fabulously understated performance.\n\nEnjoyable watch.",
            "review_date": "2021-09-27",
            "source": "rt"
        },
        {
            "content": "Hints of Gay for Paul Newman that can only be hinted at that day and age, this movie is well deserving of the Academy Awards it garnered!",
            "review_date": "2021-08-09",
            "source": "rt"
        },
        {
            "content": "Cat on a Hot Tin Roof deftly brings to life the classical Tennessee Williams' play to the big screen, scalding the audiences in the conflict between Paul Newman and Elizabeth Taylor.",
            "review_date": "2021-08-05",
            "source": "rt"
        },
        {
            "content": "Contemporary themes with raw acting ahead of its time!\n\nRichard Brooks' Southern Gothic drama Cat on a Hot Tin Roof (1958) beautifully adapts Tennesse Williams' play of the same name. Brooks brings all the humor of the endless saying of \"Big Daddy\" to life alongside the completely enthralling dramatic performances here. I found each moment captivating and moving by the end. Cat on a Hot Tin Roof is peerless writing delivered by iconic actors and actresses in their prime. Brooks' direction is sincere and captures each moment in an intimate way. It's all talking and moving about this one manor as only a Tennesse Williams play could be. \n\nTennesse Williams' writing is like unhinging the jaws of every Southern person of wealth and redneck alike as they bear their souls through their restless maws. These characters feel raw and realistic for a fresh new style back in 1958. His honest words come at each other like poison spewing forth from hostile family members. I actually think Cat on a Hot Tin Roof might be Williams' most enjoyable and straightforward story. \n\nSuddenly Last Summer, A Streetcar Named Desire, The Long, Hot Summer are all excellent, but Cat on a Hot Tin Roof rekindles the flames of passion and deep understanding of a turbulent family in one brutally honest day. Williams' play is as poignant as they come as fathers and sons come to terms, while wives ardently defend their husbands. I like the implication that Brick and Skipper had homoerotic undertones to their close friendship. Cat on a Hot Tin Roof talks about infidelity, homosexuality, fatherhood, death, love, marriage, parenting, sterility, and truth like only Tennesse Williams can write.\n\nPaul Newman is fantastic as the dour Brick, unable to cope with the death of the man he loved named Skipper, he turns to drinking and shutting out his wife Maggie the Cat. All the hurt is in Newman's translucent blue eyes. He wears repressed emotions on his sleeve like a scarlet letter. Elizabeth Taylor's lead actress role as Maggie the Cat is so feminist and empathetic towards her feelings and situation that I'm amazed this came out in 1958. You feel her every glance of longing for the handsome Newman, while feeling her hurt as this family casts her aside. Taylor is drop dead gorgeous, quick witted, and dazzlingly forward in a dynamite display and one of her finest actress performances.\n\nBurl Ives' blunt manner and brute gravitas alongside his deep booming voice are perfect as Bid Daddy. He shuns his grandchildren and wife hilariously over and over again to entertain what is wrong with his favorite son Brick. Ives' heartfelt reminiscing about his tramp father to Paul Newman in the basement is some of the most touching acting I've ever seen. Ives' screen presence is a powerful aura that is undeniable. You are mesmerized by his strength of character and perceptive ability to spot lies except for the one told about him.\n\nJudith Anderson is great as the hysterical Big Momma in denial about her terminally ill husband Big Daddy. Jack Carson is great as the foolish Gooper, who loves his father and brother, but who desperately wants control of his father's wealth in his will. Madeleine Sherwood is a riot as the overly affectionate and pushy wife to Gooper named Mae. She's so unbelievably callous and mean in Cat on a Hot Tin Roof, you'll hate her for sure! Larry Gates is excellent as Dr. Baugh, who doesn't want to tell his patient about his imminent demise.\n\nFerris Webster's editing is brisk and quickly cuts around each scene in a natural and unobtrusive way. Cat on a Hot Tin Roof feels less than its already short 108 minute run-time. William H. Daniels' cinematography is great as he basically follows all the action and dialogue with clever angles and perspectives. Charles Wolcott's score is pretty with minimalist piano and melodies to merely suggest scandal and emotion, all provided already by the killer actors and sizzling script. Helen Rose's pretty costumes and William Tuttle's make-up look authentic to the time and place in hot Southern Summer weather attire and sweat.\n\nIn conclusion, Cat on a Hot Tin Roof is a triumph of verisimilitude in acting and genuinely earnest writing. The endearing acting from Elizabeth Taylor alone is worth seeing Cat on a Hot Tin Roof.",
            "review_date": "2021-05-04",
            "source": "rt"
        },
        {
            "content": "Vintage Tennessee Williams. Great cast, great story. It’s great everything I see it!",
            "review_date": "2021-03-18",
            "source": "rt"
        },
        {
            "content": "Confederate flag waving, dixie song singing, NOT my kind of entertainment.",
            "review_date": "2021-03-17",
            "source": "rt"
        },
        {
            "content": "Tennessee Williams takes a careful look at complex family dynamics and interpersonal relationships within an extraordinarily wealthy southern family.  Flawless acting performances by Elizabeth Taylor and Paul Newman.  A must see period piece for avid movie fans, but all others could probably do better watching a new action movie.",
            "review_date": "2021-02-12",
            "source": "rt"
        },
        {
            "content": "Already I like the style of the movie with the music and art at the beginning. Wow, Liz Taylor was a knockout. She's fine as hell. Magnetic and almost entrancing with her acting. Big Daddy almost looks like Phillip Seymour Hoffman lol. Interesting to see how all of Big Daddy's family members are showing an enthusiastic interest in him mainly because of inheritance and the estate. I don't understand why Brick is reprising his love for Maggie so harshly. If it were me, I'd be making love to Maggie like every 30 minutes lol. Jeez, Paul Newman was a beautiful man, a beautiful man indeed. His eyes are like oceans. God damnit, those kids and their mother are annoying as fuck singing all the time, trying to entertain Big Daddy. The actor who played Big Daddy was so good. I love how he plays the detective in all this. How he figures out everything that went on between Maggie, Brick and Skipper. The dynamic between him and Brick is explosive. This movie proves how unhealthy it is to be repressed. Jesus Christ, I hated Mae. She was like a little demon, even looked like one. Her and Cooper don't deserve the estate. \n\nThis movie's very funny at times especially with all its sharp dialogue. Terrifically and powerfully acted. This movie is almost like a mystery being solved. I love it. And all the explosive family drama that unfolds once people start talking is what makes this movie so entertaining to watch. I was glued the whole time. I thought it was very clever that the room where the explosive discussions took place was the same where the guns were stored. I thought it was a fantastic and real look at family matters and the importance of being open. This is a must watch and a must own.",
            "review_date": "2020-11-25",
            "source": "rt"
        },
        {
            "content": "Okay, it takes some liberties with the original play, but this is a fantastic film.",
            "review_date": "2020-07-27",
            "source": "rt"
        },
        {
            "content": "The great cast makes the most of the great material.",
            "review_date": "2020-07-20",
            "source": "rt"
        },
        {
            "content": "It's vintage Tennessee Williams and probably his best work as it deals with the legacy of the people involved. It loses something from stage to screen, but still packs a solid punch.",
            "review_date": "2020-07-01",
            "source": "rt"
        },
        {
            "content": "Every line of dialog drips with significance: who are these characters, what motivates them, what past events have led us to the present, and each always evolving as lies are brought into the light. Taylor and Newman get plenty of praise, but the entire cast is excellent, particularly Burl Ives. (4/5)",
            "review_date": "2020-02-27",
            "source": "rt"
        },
        {
            "content": "I am somewhat divided on the work of Tennessee Williams as while I could appreciate most of A Streetcar Named Desire (1951) I found the female protagonist to be over the top to the point of being completely unbelievable. This story has the same issues as Maggie Pollitt never seems like a real woman and in the hands of an actress as hammy as Elizabeth Taylor this does not bode well. The tale surrounding her is also less than enchanting as while warring families and overbearing patriarchs are generally the stuff of great soap opera it all builds to an unsatisfying end and the same themes have been better explored in other films. Despite it's iconic status I have to say that I wouldn't recommend this film as it never really pulls you in and a lot of the performances are shockingly bad.\n\nAlcoholic former football star Brick Pollitt, Paul Newman, is married to the fiery Maggie, Elizabeth Taylor, who wants him to sexually and emotionally desire her so that she can have children. Tensions flare up when Pollitt's father Big Daddy, Burl Ives, who is rumored to be dying arrives in Mississppi after a stay at the hospital and Maggie becomes determined to secure a fortune for herself and her husband before his brother Gooper, Jack Carson, and his large family take everything. Pollitt's alcoholism worsens when they are forced to spend a few days on Big Daddy's estate and the reason for his treatment of Maggie comes to light. He had a possibly homosexual relationship with a fellow football player whom Maggie became jealous of and attempted to seduce so that her husband would feel betrayed. He shockingly killed himself and Pollitt has been unable to forgive his wife since while dealing with his own difficult relationship with his father.\n\nWilliams has a very specific type of man he likes to write, a sexually powerful, brooding man with repressed homosexual desires, and a specific type of women, a loud, needy woman who lives in a fantasy world. Maggie is a variation on Blanche DuBois and Pollitt is a version of Stanley Kowalski as they go around in verbal circles and many of their conflicts seem the same. From the beginning of the film we understand that their estrangement is due to them not being able to sit down and have a five minute conversation in which Pollitt explains his close friendship and Maggie accepts the fact that she will have to share him. Unlike A Streetcar Named Desire this film doesn't have the will to end realistically as the likely homosexual Pollitt happily agrees to have sex with his wife and have a child. We are meant to believe that all of his struggles with his sexuality and his alcoholism have disappeared suddenly and the obsessive Maggie has become a regular wife.\n\nThe characters in the periphery are also considerably less interesting than Stella and Mitch with the broad caricatures that are Gooper and Sister Woman, Madeleine Sherwood, not offering any nuance. Where Stella provides a nice counterbalance to the wild characters surrounding her and Hunter gives possibly the second best performance in that film behind Brando. Mitch is also a regular, well meaning man, for the 1950s at least, who contrasts nicely with Stanley and grounds Blanche in reality for a while. Here Sister Woman is just as crazy as Maggie with her obsession with having her children perform for Big Daddy and snipes at Maggie over her lack of children. The film was never grounded in reality at all and I was never particularly engaged in the theatrics carried out by Taylor, Ives and Newman.\n\nSpeaking of the performances I was greatly let down as Taylor gives one of her most atrocious performances, which is saying something as I have a real hatred for her style of acting. Her southern accent slips into British often and every emotion is spelled out in capital letters as she simply can't help herself with her big hand gestures and pinched expressions. Newman is slightly less awful but he seems adrift in a film that asks him to ham up as he is frankly too good for the material. Ives quickly fades from your memory as while he is a dominating force in the world of the film he doesn't add anything that Lee Marvin or Rod Steiger could not have brought to the role. \n\nIt is clear that I had a real antipathy for the film and while those who are enamored of Taylor may be satisfied I felt disgusted and bored.",
            "review_date": "2019-11-26",
            "source": "rt"
        },
        {
            "content": "Paul Newman and Elizabeth Taylor work wonderfully together as the two leads that tells a story filled with revelations and emotions.  A must see",
            "review_date": "2019-09-29",
            "source": "rt"
        },
        {
            "content": "Watered down nonsense that caused even it’s author to tell people to not see. Steamy acting from Taylor, Newman, Ives. But because the real story has been diluted so much, its all for nothing, and no one cares. Hollywood could not handle any gay theme back then, so we are left with nothing much at all. Brick has a line that says ‘All this talk is painful. And nothing ever comes of it’. Truer words could not be spoken about this film. The blah blah blah goes on so long we stop listening. Some of the humor and good writing remains and Liz pulls her battles with Sister Woman and the No Neck Monsters off with camp class.",
            "review_date": "2019-06-19",
            "source": "rt"
        },
        {
            "content": "There are few things that I dislike more in a film than constant bickering. Constant family bickering is even worse. Constant family bickering with old-fashioned southern accents and I’m searching for earplugs. Cat on a Hot Tin Roof was like sitting through Who’s Afraid of Virginia Woolf all over again, but with a southern drawl. It’s tedious and infuriating, because the entire film is just screaming and yelling for hours. When used in moderation (or confined to specific scenes) a good fight can be a big highlight in a film, but when it is all that a movie has to offer, I’d rather watch a blank screen. If that’s not enough, it’s as if the writer/director was searching for ways to annoy me more, because the fighting was interrupted occasionally for screeching children who can’t sing, shrieking the most repetitive and awful music you’ve ever heard. Now I suspect this was the one part that was actually intended to be a little annoying, because we’re supposed to see this big family of kids as obnoxious, but it almost pushed me over the edge. There isn’t much story to Cat on a Hot Tin Roof other than two families fighting to secure an inheritance from Big Daddy. (As an aside, can I just say how ridiculous it sounds for grown adults to call their father “Big Daddy”? It just makes me think of Blanche from Golden Girls, but I always took that as a humorous character choice, not something actual humans would do.) Then there’s the subplot of an alcoholic who would rather shun his wife based on an assumption rather than have one conversation with her. *Apologies, but I’m just going to spoil the end of the film here* The “happy” ending, that I think we’re supposed to celebrate, is that the alcoholic (who’s had enough to drink during the movie that he’s probably drunk) relents and decides to try and impregnate his wife. Thank God, he has swallowed his pride enough to deign to sleep with the woman he has been abusing in every meaning of the word. I mean, if she can’t bear children then she has no worth! It was the cherry on top of this frustrating sundae that made Cat on a Hot Tin Roof something I did not enjoy at all. I know it is a highly-regarded and well-loved play/film, but it’s clearly not meant for me.",
            "review_date": "2019-04-12",
            "source": "rt"
        },
        {
            "content": "Too much talk. This is cinema, not a stage.",
            "review_date": "2019-01-02",
            "source": "rt"
        },
        {
            "content": "Tennessee Williams apparently disowned this movie version of his play, because any clear or direct references to homosexuality were eliminated to appease the Production Code censors, still holding sway over Hollywood in the 1950s (even though his Broadway hit, directed by Elia Kazan, remained intact onstage).  Paul Newman took over Ben Gazzara's part for the film and Richard Brooks directed.  Newman, Brooks, and Elizabeth Taylor (taking over Barbara Bel Geddes' part) were nominated for Oscars. Brooks does a reasonable job transferring the play to the screen, though most of the action takes place in one room in a Mississippi manor and by action, I mean dialogue.  Newman (Brick) is a former football star, now an out-of-work alcoholic, married to Taylor (Maggie) who he bluntly does not love and with whom he is not interested in having a physical relationship (hence they have no children).  They have come up from New Orleans to hear the results of the cancer screening for Brick's father, \"Big Daddy\" (played by folksinger Burl Ives, whose harshness here is definitely against type - at least from what I remember of the LP we had as kids).  Brick's brother and sister-in-law and their five kids are also there, making a bid for the inheritance.  On one stormy night, all of the tensions implicit in these family relationships are inflamed and explored and, to some degree, resolved.  Although we don't really get told that Brick's guilt over letting down his friend Skipper (ultimately a suicide) years earlier is exacerbated by their same sex love, it isn't hard to read between the lines, if you are tipped off (as most audiences would be).  Newman puts in a sullen performance and Taylor is shrill and anxious - but both relax by the end of the picture.  I'm not sure whether the ending rings true, perhaps not.  But there is no denying the drama and fine acting on display here.",
            "review_date": "2018-07-12",
            "source": "rt"
        },
        {
            "content": "An over-the-top steamy Southern drama, but the great cast enter into the spirit of the thing, making it a treat to remember. Liz looks a million dollars and Jack Carson, Judith Anderson, Burl Ives and Madeleine Sherwood deliver the over-wrought lines as though they were said by actual people. It has a pretty dodgy ending, though, which I doubt was in the original play.",
            "review_date": "2018-07-06",
            "source": "rt"
        },
        {
            "content": "Boring, no action, lots of silly southern accents, over acted drama.",
            "review_date": "2018-04-21",
            "source": "rt"
        },
        {
            "content": "(((I was intensely disappointed by the way woman was made not as good as man from the sexists tenIssee Wilams (wot kinds a name dat anyway ?.?????.? \nps. i write this onli one hand cos i got sesuj in other 1 ;))))))))\n)xxx000)",
            "review_date": "2018-01-31",
            "source": "rt"
        },
        {
            "content": "Dirigida por Richard Brooks (USA, 1958, Color, 108 min), Cat on a hot tin roof es considerada la obra maestra del dramaturgo Tennessee Williams, quien sin embargo es mejor conocido por Un tranvía llamado deseo (otra obra suya llevada a la pantalla es La noche de la Iguana, estelarizada por Ava Gardner y Richard Burton).  En 1955, \"Cat\" llegó a 700 representaciones en Broadway, y le valió a Williams un segundo premio Pulitzer.\nLa adaptación cinematográfica de hecho es considerada inferior, \"diluida\", por los críticos que han visto la obra de teatro; sobre todo porque al pasarla a la pantalla los guionistas disimularon el transfondo de homosexualidad y represión sexual de la historia original.\n\nA pesar de dicho tratamiento, \"Cat\" es un dramonón nominado a 6 Oscares: Mejor película, director, cinematografía, actor, actriz y guión adaptado (nótese: se podría decir que estos son los 6 mayores premios de la Academia).  Las actuaciones de los tres actores principales Paul Newman, Elizabeth Taylor y Burl Ives, son soberbias, capaces de sostener las escenas de gran tensión, llenas de diálogo, y claustrofóbicas (así se nota que se trata de una obra de teatro adaptada para el cine).\n\nEn una mansión rodeada por una gran plantación sureña, Brick (Newman) vive alcoholizado, recordando viejas glorias de sus tiempos como atleta joven; se niega a complacer o perdonar a su esposa (una joven Liz Taylor despampanante), y se niega a hablar de la muerte de su amigo inseparable Skipper (el del trasfondo homosexual disimulado).  Su padre, Big Daddy (Burl Ives, quien también interpretó este papel antes en Broadway), está cumpliendo 65 años y vive rodeado de mentirosos y avariciosos (la palabra del día es \"mendacity\"); él se niega a aceptar que está muriendo de cáncer, y se niega también a marcharse sin haber enderezado a su hijo predilecto, y enderazado las cosas con su hijo y la familia; de haber hecho las paces con su padre el vagabundo muerto, y con la vida.\n\nCat on a hot tin roof es uno de esos clásicos que componen una biblioteca bien surtida: pesados, antiguos, y trascendentales.  4 mapaches y medio.",
            "review_date": "2018-01-10",
            "source": "rt"
        },
        {
            "content": "Exceptional story about the relationship between a desperate woman and her brooding man, who has a serious drinking problem. Elizabeth Taylor and Paul Newman are amazing in this movie. One of my all time favorites.",
            "review_date": "2017-10-16",
            "source": "rt"
        },
        {
            "content": "A classic. superbly directed acted and compelling to watch from beginning to end. so well-written they just don't make them like this anymore.",
            "review_date": "2017-09-02",
            "source": "rt"
        },
        {
            "content": "William's plays truly look great on the big screen, and 'A Cat on a Hot Tin Roof' is one of the efficient examples of the phenomenon, Brooks' adaptation catching faithfully the melodramatic spirit of the play.  In a 'Cat on a Hot Tin Roof', human relationship, implicit homosexuality and sexual desire are vividly portrayed by a hot tin cast (Taylor and Newman), all in a confined, boiling hot realm, which is just the signature of the playwright.",
            "review_date": "2017-08-20",
            "source": "rt"
        },
        {
            "content": "Hypocritical when the crux of the theme is hidden, but suffice to describe as a classic in all aspects.",
            "review_date": "2017-07-04",
            "source": "rt"
        },
        {
            "content": "Steamy story about Big Daddy dying and his money grubbing family.",
            "review_date": "2017-06-24",
            "source": "rt"
        },
        {
            "content": "One of the best films I've ever seen.",
            "review_date": "2017-05-20",
            "source": "rt"
        },
        {
            "content": "Solid film making with nary a wasted breath ... well, almost. There's a lot of dramatic pauses and hemming and hawing at the top, but once this rollercoaster gets going the going is good. And Liz Taylor when it hurt your eyes to look at her glory.",
            "review_date": "2017-03-12",
            "source": "rt"
        },
        {
            "content": "Paul Newman looks like a Greek God in this film, and Elizabeth Taylor is no slouch herself.  The combination of his blue eyes and her violet eyes alone make this film worth at least something.  Personally though, I think it's overrated - reasonably good, but far from great.  Tennessee Williams' play is a brilliant portrait of a family fractured by frustrations, alcohol, unfulfilled dreams, and sorrow.   The adaptation suffers from removal of references to homosexuality, an important part of the story, and by the addition of 'feel good' elements in the ending which I disliked (as did Williams and Newman).  It also suffers from emotional fire in the performances.   Williams' words are there (at least sometimes, and minus profanity), but they're not always delivered with the intensity they deserve.  If you want to see Taylor really deliver, watch 'Who's Afraid of Virginia Woolf?', which is night and day better.   Even in diluted form, the story is still compelling, but I think you'd be better off reading (or seeing) the play.",
            "review_date": "2016-11-29",
            "source": "rt"
        },
        {
            "content": "Paul Newman and Liz Taylor at their prime",
            "review_date": "2016-10-02",
            "source": "rt"
        },
        {
            "content": "While there are sure to be deviations from Williams' play, you can't deny the good-natured attempt to bring as many ideas of his as possible into the light while still making a sensical film and not pissing off the censorship bureau. All in all, this is a wonderfully acted, edgy family drama. And a meaningful one at that.",
            "review_date": "2016-04-09",
            "source": "rt"
        },
        {
            "content": "One of my all time favorite movies, I first saw it as a young child and liked it and since I've watched it numerous times I'm now in my 30s and I still watch it from time to time and I haven't grown any less fond of it. If you haven't seen this movie go out and rent it or buy the DVD now",
            "review_date": "2016-03-23",
            "source": "rt"
        },
        {
            "content": "There ain't nothin'Â moreÂ powerful than theÂ odorÂ of mendacity.",
            "review_date": "2016-01-27",
            "source": "rt"
        },
        {
            "content": "I really hate that kazoo song, or whatever it is the children would play.",
            "review_date": "2016-01-19",
            "source": "rt"
        },
        {
            "content": "A great vehicle for Burl Ives.  A natural fit as \"Big Daddy\"",
            "review_date": "2016-01-04",
            "source": "rt"
        },
        {
            "content": "A strong play, equally as strong on film here, with Burt Ives and Paul Newman giving the strongest performances.",
            "review_date": "2015-12-09",
            "source": "rt"
        },
        {
            "content": "A phenomenal, classy production of a play that's really badly neutered due to the interference of the Production Code.  The whole center of the plot ... why Brick and Maggie are estranged and why Brick is drinking himself to death ... is quite frankly rendered more than a little nonsensical.  That said, this is an amazing ensemble cast.  Burl Ives in particular, reprising his role from the Broadway production, is so good I wish he'd acted in films more often.  Richard Brooks does not get much praise these days, but he was a fine director, especially at making literate films for adult audiences.",
            "review_date": "2015-10-04",
            "source": "rt"
        },
        {
            "content": "What an acting piece!",
            "review_date": "2015-07-23",
            "source": "rt"
        },
        {
            "content": "A very enjoyable film with Paul Newman at his best I have seen. Elizabeth Taylor is great as well and great supporting performances from Burl Ives and Judith Anderson. It has a great score, cinematography, and production design.",
            "review_date": "2015-07-16",
            "source": "rt"
        },
        {
            "content": "Despite committed performances from all, this film is deeply flawed -- or, perhaps dated. The real issues and situation at play is forced to conform to the restrictive and oppression of the time in which it was made. It still has merit, but as everyone dances around the obvious it comes close to veering into camp.",
            "review_date": "2015-05-31",
            "source": "rt"
        },
        {
            "content": "Gloriously melodramatic and touching on themes of mendacity, sexism, and repressed homosexuality, \"Cat on a Hot Tin Roof\" is a fantastic piece of filmmaking who's setup revolving around a family trapped in a sweltering house is practically its own genre today. That being said, the compromised third act robs the film of some of its power, a tragedy considering the excellence that had preceded it.",
            "review_date": "2015-05-05",
            "source": "rt"
        },
        {
            "content": "I guess waiting for the Hays Code to be irrelevant sort of helps get over the differences from Script and Screenplay.",
            "review_date": "2015-04-30",
            "source": "rt"
        },
        {
            "content": "Riveting drama with stellar performances. Liz is dynamite hot.",
            "review_date": "2015-04-28",
            "source": "rt"
        },
        {
            "content": "I recently read this play for college, so I figured I might as well watch the film since it was nominated for so many Oscars back in the day and had such big stars in it. I was pretty disappointed to find that this adaption is lacking some of the elements that make the play compelling. The acting is inconsistent with really only Elizabeth Taylor impressing me really. Paul Newman and Burl Ives both got acclaim for their portrayals, but I didn't find them to be anything special. The film doesn't have very good pacing either. I was very disappointed to find the homosexuality elements completely eliminated because it made the story really intriguing and gave it an element of surprise that is lacking in this film. It does get the relationship between Big Daddy and Brick right and I genuinely liked their conversations, but not much else impressed me. Elizabeth Taylor had her breakout role and I thought she was really good in this, but it could have been better.",
            "review_date": "2015-04-24",
            "source": "rt"
        },
        {
            "content": "so, so well acted by Ives, Newman, and Taylor. A pleasure to watch even if the ending is eh",
            "review_date": "2015-04-19",
            "source": "rt"
        },
        {
            "content": "It crackles.  Good plane viewing.",
            "review_date": "2014-12-23",
            "source": "rt"
        },
        {
            "content": "Movie was extremely dramatic n u can tell it was a play adapted to a film. My main problem is mostly the ending how everything ties up all clean n neat in 5 minutes. The acting was superb n the dramatic layers about family, heroes, adulthood, and money all wove together so nicely. I loved the setting of an antebellum south mansion and storm n I loved the dark characters who everyone knows in their family I feel like. Anyways it was a very good movie about family n how money doesn't buy the real stuff that matters in this life n u cant run away from ur life/truth forever unless u want to kill urself ( of course I'm simplifying the message).  Elizabeth n Paul are so good-looking it hurts. Really loved the interactions btw Brick n big daddy. Not a huge fan of plays into film but this one gets my stamp of approval.",
            "review_date": "2014-11-20",
            "source": "rt"
        },
        {
            "content": "With legendary actors Paul Newman and Elizabeth Taylor headlining the film, Cat on a Hot Tin Roof sounded like I should prepare for top notch acting.\n\nCat on a Hot Tin Roof is a lot like the later Elizabeth Taylor film Whose Afraid of Virginia Woolf? for which she won an Academy Award. By that I mean that both films are based on plays and stay very true to the theatrical style of a play. It may stay less true to the playscript as the film is said to have removed practically all of the homosexual themes as well as adding an unnecessary scene involving reconciliation between Brick Pollitt and Harvey \"Big Daddy\" Pollitt, but there is no denying the dramatic strength of the film. I never saw the original Tennessee Williams play or studied it, and based on his criticisms the film could have been a lot better if it failed to omit the themes and concepts that ended up absent. And I will say that for me, films which stay true to theatrical styles evoke mixed feelings with me because they stay true to the source material but also fail to elevate themselves as films all that much. Still, Cat on a Hot Tin Roof does maintain a strong production design with all the appropriate props and scenery to give a sense of atmosphere as well as the fact that the cinematography is a nice mix of traditional stage style and cinematic which gives viewers a good sense of being in the situation. All in all the visual style of the film is nice because it is subtle yet beyond the simplicity of a stage production which means that it finds a balance between cinematic and theatrical.\nCat on a Hot Tin Roof does not feel as complicated as it could have. Despite having a strong depiction of the relationship between Brick Pollitt and his father Harvey \"Big Daddy\" Politt, the characters outside of the predominate three figures in the story are not explored all that well, nor is the relationship between Brick Pollitt and Margaret \"Maggie\" Pollitt. All we get from the latter is that there is a level of tension involved, partially due to Brick Pollitt's self-destructive alcoholism, but it is clear that there is more to it than strictly what is projected in the film. I'm not sure if there is more complications explored in Tennessee Williams' original playscript, but considering the other omissions made, I would not be surprised if that was the case. Still, the screenplay is good enough because it does maintain a lot of strong characters and gives the actors firm dialogue to work with in the roles.\nSeeing as it is a very theatrical feature, the most important elements of Cat on a Hot Tin Roof boil down to what the cast can bring to the film, and fortunately they are all in top form.\nPaul Newman is just spot on in Cat on a Hot Tin Roof. Even as a drunk and selfish man, it is easy to sympathise for his character Brick Pollitt in Cat on a Hot Tin Roof because he is just such a naturally charming actor. He has the most beautiful blue eyes in Hollywood history and a line delivery which is stern without ever being melodramatic. But what's most impressive is his projection. Paul Newman finds the perfect balance between theatrical acting and cinematic acting in Cat on a Hot Tin Roof which is brilliant because that means he ties directly into the general theme of the rest of the film. His line delivery is dramatic with certain elements of subtlety that never go as far as melodrama, and he makes such a compelling case that his performance is unforgettable. Paul  Newman's charming performance in Cat on a Hot Tin Roof is just refreshing, and it reveals the legendary actor's keen abilities for theatrical acting. Cat on a Hot Tin Roof is really one of his best performances, and you can expect nothing less from him.\nElizabeth Taylor is also top form. Her performance in Cat on a Hot Tin Roof reminds viewers why she is considered both one of the most beautiful women to have ever lived and one of the most talented actresses of all time. She is able to constantly maintain an appropriately heightened level of dramatic tension in her role which she uses to project the distress of being a wife who is emotionally isolated from her husband and left with the curse of being barren. Elizabeth Taylor easily makes her role a very sympathetic one and has the ability to draw the viewer's attention to her as she grips the part with such tenacity that when she engages with any of the surrounding cast members, the result is easily impressive. Her performance and particularly her chemistry with Paul Newman prove to be some of the most powerful dramatic forces behind the film, so she is just perfect in the part of Margaret \"Maggie\" Pollitt. \nBurt Ives is also terrific. The endeavour of his role is largely predicated on the scenes where he interacts with Paul Newman due to the tension of the shattered father son relationship they share being one of the film's most important themes. He is really gritty in his role and as the story progresses you can see him gradually coming to terms with his own mortality and the nature of his relationship with his son. He is constantly developing throughout the story without a moment where he steps out of line, and his line delivery is really tense in the appropriate manner for the character. Burt Ives brings a powerful effort to his role in Cat on a Hot Tin Roof.\n\nSo although Cat on a Hot Tin Roof is not as deep or complex as it could be and omits Tennessee Williams' homosexual playscript themes, it is a well-crafted and firm drama film with the benefit of astounding performances from both Paul Newman and Elizabeth Taylor.",
            "review_date": "2014-10-09",
            "source": "rt"
        },
        {
            "content": "Tennessee Williams got very famous for writing plays about characters who work extra overtime to destroy their own lives, often with strong reasons to do exactly that. This film is about a very wealthy family in the American deep south that is totally miserable and dysfunctional. There is so much anxiety, stress, tension it is palpable. That, along with all the yelling and screaming can give one a serious headache. However, once the story finally unravels it becomes quite powerful. The patriarch of the family, called big daddy, (burl Ives) centers the film. There is a darkly hilarious scene early on in which a group of children are annoyingly playing the song Dixie over and over, and holding a Confederate flag. And there is enough eye candy for at least four movies as it features a young Paul Newman, and Elizabeth Taylor.",
            "review_date": "2014-08-20",
            "source": "rt"
        },
        {
            "content": "An emotionally charged drama with great acting. Paul Newman, in particular, was outstanding. (First and only viewing - 9/3/2014)",
            "review_date": "2014-08-11",
            "source": "rt"
        },
        {
            "content": "Beautiful. Blue-eyed Newman and violet-eyed Taylor. The film good, too!",
            "review_date": "2014-07-30",
            "source": "rt"
        },
        {
            "content": "Wow! A true classic that raises the bar so high that any remake would pale in comparison. One of the best closing lines!",
            "review_date": "2014-07-12",
            "source": "rt"
        },
        {
            "content": "\"Aint nothin more powerful than  the odour of mendacity.\"\n\nA bit shrill in places, but an absolute classic.",
            "review_date": "2014-06-23",
            "source": "rt"
        },
        {
            "content": "Paul Newman è il figo per eccellenza",
            "review_date": "2014-06-23",
            "source": "rt"
        },
        {
            "content": "Who didn't want to see Liz Taylor and Paul Newman speaking Tennessee's great dialogue?",
            "review_date": "2014-04-03",
            "source": "rt"
        },
        {
            "content": "★★★★ (out of four)\r\n\r\nThough not quite as exceptional as Tennessee Williams \"A Streetcar Named Desire\", his 1958 film version, directed by Richard Brooks, is still one of the great films of the 1950's.\r\n\r\nBurl Ives plays Big Daddy Pollitt, the head of a wealthy southern family.  He is dying as the family gathers together ib order to jockey for position to gain his favor.  Brick (Paul Newman) is Daddy's favorite, but has fallen into alcolholism over his past defeats.  The other son, Gooper (Jack Carson), is being pushed by his bossy wife to get everything.\r\n\r\nBrick has his own wife to contend with.  Maggie the Cat (Eliabeth Taylor) tries to push her own husband out of his self loathing bitterness.  The fireworks explode as the family gathers for Big Daddy's birthday.\r\n\r\nThe dialogue is sassy and the family sparks are electrifying.  It goes on a bit too long, but what an amaizng drama it is when it clicks just right.  I should also mention that Elizabeth Taylor has never been more stunning!\r\n\r\n[IMG]http://img.photobucket.com/albums/v48/Zeppo1/CatonaHotTinRoof_zpsed3b6786.jpg[/IMG]",
            "review_date": "2013-11-15",
            "source": "rt"
        },
        {
            "content": "Newman, Taylor, & Ives. The usual top-tier performances with taboo laden subjects this time.",
            "review_date": "2013-11-13",
            "source": "rt"
        },
        {
            "content": "Despite being considerably toned down due to film censorship of the time, Cat On a Hot Tin Roof stands as a compelling and well-acted adaptation of Tennessee Williams' play that is still entertaining today.",
            "review_date": "2013-09-08",
            "source": "rt"
        },
        {
            "content": "A poignant confrontational drama featuring the charismatic Paul Newman and glamorous Elizabeth Taylor. Featuring a number of taboo subjects, including impotency, homosexuality, avarice and falling short of expectations, the confrontations in the flat are still superb to contemporary viewers. These taboos, after all, are all human nature, aren't they?",
            "review_date": "2013-09-02",
            "source": "rt"
        },
        {
            "content": "There is nothing like family and in this Tennessee Williams adaptation, the truth comes out on a hot Southern night as tempers rise and secrets are revealed. When Paul Newman and Elizabeth Taylor are on the top of their game, it is hard to take your eyes off them as a couple dealing with their own personal issues. Burl Ives is also a presence as Bog Daddy. overall, a great ensemble cast lead by two superstars doing justice to the original text.\n\nGrade: A",
            "review_date": "2013-08-23",
            "source": "rt"
        },
        {
            "content": "It starts off somewhat boring and it is too noisy because of too many arguments, but Cat on a Hot Tin Roof is a meaningful film with its wonderfully realistic observation of family relations, money obsession and troubling parenting and marriage and it features superb acting from its well-rounded cast.",
            "review_date": "2013-08-08",
            "source": "rt"
        },
        {
            "content": "I can never say this enough. Paul Newman was a beautiful man.",
            "review_date": "2013-07-08",
            "source": "rt"
        },
        {
            "content": "The film that dares us to believe that any man wouldn't desire the lovely Liz Taylor as she's parading around in a negligee! But, since Paul Newman's Brick is gay, he is able to, drowning himself in alcohol instead of Ms. Taylor. I personally cannot raise any sympathy for Williams' overheated white trash characters. Taylor's only wants to get impregnated so she can have power over her brother in law and get all the money. The only reason she married Brick was for the cash. So, quite unpleasant on many levels. Plus, it's almost absolutely stagebound, which shows a complete lack of imagination by the filmmakers.",
            "review_date": "2013-06-13",
            "source": "rt"
        },
        {
            "content": "Interesting movie, but not great, featuring Paul Newman and Liz Taylor as a bickering husband and wife and what happens when her father returns after time away. I found this yap fest a wee bit boring.. Just a wee bit too much yappin' and not much going on. Burl Ives saves this as Big Daddy though. He's awesome.",
            "review_date": "2013-06-08",
            "source": "rt"
        },
        {
            "content": "What a great film!!! Paul Newman & Elizabeth Taylor are two very beautiful people.",
            "review_date": "2013-05-22",
            "source": "rt"
        },
        {
            "content": "Another absolute favorite of mine. This movie wonderfully gets to the heart of real, familial love. Sure doesn't seem that way through most of the movie, but it has possibly the best conflict and resolution of any film I've ever seen.",
            "review_date": "2013-04-20",
            "source": "rt"
        },
        {
            "content": "At first I questioned why this was worth watching, because the characters began as rather unlikeable, but they improved, and I actually began to care about them.",
            "review_date": "2013-04-19",
            "source": "rt"
        },
        {
            "content": "what can I say, I have a thing for paul newman : )",
            "review_date": "2013-04-07",
            "source": "rt"
        },
        {
            "content": "This is a fantastic movie. One of the best I've seen in sometime. Burl Ives carries so much of it, too. I may be overrating it simply because I was so surprised at his performance. Of course he is not the center of the action. That's carried equally as well by Newman and Taylor. Loved it.",
            "review_date": "2013-03-15",
            "source": "rt"
        },
        {
            "content": "The truth is as dirty as lies\n\nMaggie and Brick are two lovers with no children that continuously argue.  Brick's father is dying of colon cancer unbeknownst to his dad.  Brick is a drunk due to reasons unknown to the family.  He has quit his job and has no real ambitions.  His family is too busy fighting for the dying father's assets to care about Brick and Maggie.  Is there any chance to repair their relationship and place in the family or will the family go up in flames with the death of the father?\n\n\"I don't trust a man that don't drink.\"\n\nRichard Brooks, director of In Cold Blood, The Professionals, Elmer Gantry, Bite the Bullet, Fever Pitch, The Happy Ending, Sweet Bird of Youth, and Battle Circus, delivers Cat on a Hot Tin Roof.  The storyline for this picture is very good and concludes brilliantly.  The acting is absolutely amazing and the cast includes Paul Newman, Elizabeth Taylor, Burl Ives, Jack Carson, Judith Anderson, and Vaughn Taylor.\n\n\"Maggie the cat is alive.\"\n\nI recently DVR'd this picture which was airing on Turner Classic Movies (TCM).  I am a huge Paul Newman fan and this was the perfect role for him.  His characters transformation and revelation was delivered perfectly and Elizabeth Taylor was brilliant as the lead actress.  I strongly recommend seeing this picture.\n\n\"What is the victory of a cat on a hot tin roof?\"\n\"Just staying on it, I guess, as long as I can.\"\n\nGrade: A",
            "review_date": "2013-02-27",
            "source": "rt"
        },
        {
            "content": "Great story and great acting! Thoroughly enjoyed this film.",
            "review_date": "2013-02-27",
            "source": "rt"
        },
        {
            "content": "Excellent dialogs and performances. A must see",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "Solid adaptation of Tennessee Williams' play. Could have been even better if there wasn't any omission of the homosexual themes. Paul Newman (apart from the fact that he plays an alcoholic but never appears drunk), Elizabeth Taylor (my first film of her's) and Burl Ives all deliver superlative performances. Well directed too. Worth seeing.",
            "review_date": "2013-02-17",
            "source": "rt"
        },
        {
            "content": "Solid adaptation of Tennessee Williams' play. Could have been even better if there wasn't any omission of the homosexual themes. Paul Newman (apart from the fact that he plays an alcoholic but never appears drunk), Elizabeth Taylor (my first film of her's) and Burl Ives all deliver superlative performances. Well directed too. Worth seeing.",
            "review_date": "2013-02-17",
            "source": "rt"
        },
        {
            "content": "The film that dares us to believe that any man wouldn't desire the lovely Liz Taylor as she's parading around in a negligee! But, Paul Newman's Brick is able to, prefering alcohol to the beautiness that is Ms. Taylor! So, given that premise, you have to really suspend disbelief! The rest of the movie is standard overheated Tennessee Williams material, lots of drama about characters who aren't generally that sympathetic. The film is, of course, an adaptation of Williams' play, and it's pretty stagebound. There is little attempt to open it up, which is unfortunate. Good overall, but mainly to gaze at Liz for a while!",
            "review_date": "2013-02-17",
            "source": "rt"
        },
        {
            "content": "Maybe it's just dated but this was too slow and took way too long to get anywhere near good.",
            "review_date": "2013-02-15",
            "source": "rt"
        },
        {
            "content": "STAND ALONE REVIEW: Again, i dont do well if older films, i try though.  Paul Newman is a pimp in this, good looking guy no homo, and Elizabeth Taylor is incredibly hot in the film as well.  I found it to be a little boring but i could definitely se the appeal for this movie\n\nWATCHING WITH YOUR BOYS: Na, just dont do it\n\nWATCHING WITH A CHICK AT NIGHT: Girls, Paul Newman will be added to their \"guys id have sex with\" list, if they he wasnt on it already",
            "review_date": "2013-02-03",
            "source": "rt"
        },
        {
            "content": "Entertaining yet reveals a lot about the family institution. And man is Liz smoking",
            "review_date": "2013-01-28",
            "source": "rt"
        },
        {
            "content": "taylor/newman combo is electric still looks daring even 4 today.",
            "review_date": "2013-01-24",
            "source": "rt"
        },
        {
            "content": "Brick, an alcoholic ex-football player, drinks his days away and resists the affections of his wife, Maggie. His reunion with his father, Big Daddy, who is dying of cancer, jogs a host of memories and revelations for both father and son.",
            "review_date": "2013-01-08",
            "source": "rt"
        },
        {
            "content": "Burl Ives at his best!",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "Based upon the Pulitzer Prize winning play by Tennessee Williams, and directed by Richard Brooks (Elmer Gantry (1960) and $ (1971)), this is a powerful drama with 3 brilliant performances at the centre of it. While Williams disliked the film because it toned down the some of the more mature qualities of the play, it's still a good film to watch, never forgetting it's theatrical roots. In Mississippi, Brick Pollitt (Paul Newman) and his wife Maggie (Elizabeth Taylor) return to his family's plantation to celebrate the 65th birthday of his father, Harvey \"Big Daddy\" Pollitt (Burl Ives). Brick is an alcoholic, and he recently broke his foot while trying to hurdle in the dark, and he spends most of the day inside drinking. Big Daddy has just returned from the hospital after having a cancer scare, and Big Mama (Judith Anderson) tells everyone that Big Daddy is not dying from cancer, but that's not true, because Big Daddy IS dying from cancer, but he doesn't know that. Brick finds out, and tensions between Big Daddy and Brick reach breaking point, because of Brick's drinking. It's a powerful drama, and it's a picture of an old fashioned side to America. Newman and Taylor give brilliant performances, but it's Burl Ives who steals the show as Big Daddy, this man is such a force of nature. It's a shame he won an Oscar for The Big Country (1958) over this, as he gave a superior performance in this.",
            "review_date": "2012-12-30",
            "source": "rt"
        },
        {
            "content": "There isn't a single bad character in the movie, and they're all perfectly cast.",
            "review_date": "2012-12-20",
            "source": "rt"
        },
        {
            "content": "Maggie the Cat (Elizabeth Taylor) is going to explode.  It's summertime in the Deep South, and her father-in-law, the big-mouthed Big Daddy Pruitt (Burl Ives), is back in town in time to celebrate his birthday following a health scare.  She loves Big Daddy and his wife, Big Mama (Judith Anderson), but hates everyone else staying at their sprawling southern property for the festivities.  She hates Gooper (Jack Carson), her self-serving, money-minded brother-in-law.  She hates his wife, Mae (Madeleine Sherwood), a big-headed, ball-busting busybody.  She hates their goddamn kids, who are noisy, no-neck monsters.  And she especially hates her husband, Brick (Paul Newman), a has-been football star who's taken to the bottle to wash his problems away and who has decided that their sex life is over.\n\tShe deserves better than this.  She's alive.  \"You're a drinker and I'm childless,\" Maggie sighs to Brick at the climax of one of their countless fights.  She's at a crossroads in her life: part of her figures that she's at her youthful prime and would be happier playing house with a man who fulfills her emotionally and sexually, but another figures that Brick is fixable, handsome, and can only work his way out of his funk with her leading the way.  For now, though, she's miserable.  Sometimes she feels like a cat on a hot tin roof, in agony but without a cool place to land.\n\tAdapted from the Tennessee Williams's play of the same name and written and directed by Richard Brooks, \"Cat On a Hot Tin Roof\" remains vexing despite its watering down of its source, a watering down so noticeable that Williams himself ran down ticket lines of 1958 just to melodramatically warn consumers that the adaptation would set the industry back fifty years.  But contrary to Williams's opinion, this isn't the kind of film that needs to stick with being ahead of its time to stay inflammatory (though it would be nice if its taboo themes were kept intact).  This is the kind of film, better labeled as an acting film, if we're being particular, able to incur hair-raises solely from the puissance of its monologues and its exchanges and its actors.  It's an organic, necessities-only practicing of filmmaking.\n\tSome persist that the film version of \"Cat On a Hot Tin Roof's\" skirting over of Williams's more fomenting detours, paired alongside its stagey production, deter its potency.  But because its central cast is so blustering and because it always seems to be on the verge of detonating, I'd be pressed to decide that it doesn't overcome its stage roots - it's far too tempestuous of a force to be reckoned with.\n\tIt erupts with high-powered drama, controlled, moving, and Southern-fried.  I lapped up every minute of it.  Movies in which characters are confined to a single setting, unable to avoid the conflicts coming at them at the speed of light, and in which dialogue is an art in and of itself, are movies I cannot withstand so long as they're done right.  Expectedly, \"Cat On a Hot Tin Roof\" is done right, though I can't imagine it going wrong when a cast this magnificent is leading the way and when all involved histrionics are rooted in familial discord.  Brooks keeps tensions high without interfering with the superiority of his performers.\n\tThe film isn't just perturbed with the marital woes of Maggie and Brick - also decisive is Big Daddy and company's dealing with the later-revealed fact that he's terminally ill - but it's \"Cat On a Hot Tin Roof's\" most unforgettable feature and certainly its most exigent.  Paul Newman and Elizabeth Taylor are so abominably beautiful that their sexual frustration practically explodes off the screen.  These desirable people should be fornicating - they're the poster children of the passionate embrace and the idealized, silk sheet enhanced romp - and so their bursting at the seams sexual tension doesn't just shout at us: it screams, like it's got nothing left to live for besides one last roll in the hay.\n\tIn 1958, no actors were as electrifying as Newman and Taylor.  Though Newman was still in the process of rising in the ranks of the industry, while Taylor, by comparison, was the most famous woman in the world (and the most famous widow in the world after her husband, producer Mike Todd, was tragically killed in a plane crash), both were equally driven to prove themselves as severely pretty faces that could also act.  As Maggie and Brick, a pair of knockouts struggling with differing carnal dilemmas, Taylor and Newman are galvanizing.  \n\tTaylor, raven-haired, tiny voiced but capably loud, is every man's fantasy: she's a firearm of sex, locked and loaded with temptation and drive.  Newman is an embodiment of classic masculinity subtly being destroyed by alcoholism, severe depression, and hidden homosexuality (which is glossed over in the film).  Taylor's Maggie can't understand why her husband won't make love to her; Newman's Brick knows exactly why he's incapable of making love to his wife, and it's killing him.\n\tAdd this erotic discontent to an already strained family gathering and you've got yourself a hell of a film, dynamically haughty and as tight as a Hitchcock thriller.  Sure I like it less when attitudes even out and emotions stop running so high - I'm more turned on when it's about to rupture than when it's cooling itself off - but there's no point in challenging the brilliance of \"Cat On a Hot Tin Roof.\" Sparse are films as zestfully written and as expertly acted as this one, and when the material is so flavorful and when the acting is so robust, I'll take what I can get.  More, please.",
            "review_date": "2012-12-19",
            "source": "rt"
        }
    ]
}