{
    "rating": 0.0,
    "release_date": "2005-11-18",
    "num_reviews": 140,
    "genres": [
        "Drama",
        "Family"
    ],
    "summary": "N/A",
    "reviews": [
        {
            "review_title": "\"When a person grows up, do his dreams become smaller?\"",
            "content": "I'm gradually becoming less and less surprised when I see a foreign film that's every bit as good as those produced by Americans or the Brits. This was my first Turkish film, and for those of you struggling to find it, I would direct you to Youtube where you can find it in it's entirety with English subtitles. As the translated title suggests, the story is about a man struggling to come to terms with a father who disowned him, and his feelings of growing away from his own seven year old son. The back story of Sadik's (Fikret Kuskan) personal history does not fully come to light until well into the picture, when we learn that he became an anarchist journalist, much to the dismay of his father, who had designs for his son to take over the family farm upon attaining an agricultural degree. For viewers with a Turkish background, the conflict that resulted in Sadik's jail time and torture will probably be understood better within the context of that country's history, so for someone like myself, a lot of that perspective is lost. However that doesn't affect the impact of the story when it's finally revealed that Sadik's reconciliation with his father occurred because of his impending death due to a pulmonary edema condition. The man did a noble thing for his own son Deniz (Ege Tanman) by returning him to the village of Sadik's childhood to remain with family and friends. I would challenge the viewer to maintain a dry eye as the mystery of father/grandfather Huseyin's (Çetin Tekindor) 'secret room' reveals Sadim's happy and hopeful youth before he left his family. One comes away from the film with a serene sense of family bond that transcends nationality, as in the end, we are all humans subject to the same emotions of love and loyalty.",
            "review_date": "2018-04-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A masterpiece that must be seen by everyone!",
            "content": "A masterpiece that must be seen by everyone!It's the better film I have seen so far. It's not only about the relationships between fathers and sons, or the sequences from a coup d' etat, especially against leftist people. There are a lot of things and ideas included. For example the attitude of a former lover, wounded, married to another man, but still carrying. Its an insight to the human relationships as a whole, the role of the family in Mediterranean countries. This does not mean that people from the North for example will not understand or will not be moved. But the situations depicted, fit especially to Turks, or Greeks (like me), or perhaps Italians. The director is really one of the highest class. I had previously watched his later film Issiz Adam (Always alone), and I was so impressed that I looked for another of his movies, so I found this film. I found very good the actor who played the young boy. I was really shocked from the scene of the father regretting for his behavior, it looked very much like a Greek ancient tragedy. Also the music of the film was excellent. Everyone must see this film. Not only he will like it, but I am sure that he will be moved.",
            "review_date": "2010-01-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best Turkish movies ever",
            "content": "The movie starts on the days of military government, which started Sep.12th, 1980, and lasted 3 years (Effects of this action against democracy lasted more than 15 years). A young socialist newspaper writer (Fikret Kuskan) loses his wife on birth of his only son on the very first day of the military action, because he can not find any help for delivery of the child. After 6 years past, the father was desperate to find any jobs on the papers, which are now supporters of the new order, and decides to return his father (Çetin Tekindor)'s home in a small village near Izmir: A house that he has left years ago fighting his father's wills to make him a person that his father would like him to be.I can not even summarize the rest of the movie, since one should see the movie himself/herself to understand the encounters of two strangers, father and son. One should notice the mother (Humeyra)'s role on the relationship (or non-relationship) of these two different men, and the grandson (Ege Tanman).If you have a Mediterrenean blood, Greek, Italian, whatever, you will find many things in this movie. You don't have to be Turk to understand the emotional rivers in this movie. It really touches hearts of the Turkish people.",
            "review_date": "2005-12-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This movie will touch your soul and will not let go!",
            "content": "**** 10 out of 10 for this movie **** One of the best movies ever made worldwide.I write this review right after seeing this movie because I want to put down the emotions that stir me this second. I must admit that before watching this masterpiece I was a bit skeptical about it being a drama because most dramas I have seen evolve around irrelevant topics - but this movie will change the way you think.The story is so heartwarming and real that it will move you far beyond anything you have probably ever experienced before. The actors do such an amazing job that you will sympathize with them and might indulge in some crying even if you are a male.Even if you don't cry this movie will touch you and will make you think about your own life.Movies that are able to and make you REFLECT and THINK about yourself, for my taste, are part of the best movies of all time because their messages are delivered in a way so that you will never forget them.Go see this movie and vote because this is not only the best Turkish movie ever, but one of the best movies ever made.",
            "review_date": "2006-10-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An Incredible Movie",
            "content": "As I watched that movie, I saw the Turkish relationships in the best way that it could be shown. A very good choice of cast is the most powerful criterion of the success of the movie. Humeyra, the grandmother is a very talented woman in acting. Emotional scenes become more frequent while we see the movie to get to the end. Unfortunate events make the Turkish people get closer to each other. The movie shows that perfectly. Hospitality, love, grief, laughs... Everything is included in this movie. An emotional breakthrough. The movie also points on the elderly reality -now an impossibility- the torture, made by the cops.Better to be watched by fathers and sons. Also, crying may occur, don't worry; too many people who watched the movie had the same.",
            "review_date": "2005-12-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Clever, poignant, brilliant and \"human\"..",
            "content": "A simple story becomes a sad and poignant movie about ordinary people.. Every person I know who had the chance to watch this wonderful movie have cried -especially during the second half.. I applause everyone involved in the production of this magnificent piece of work.. Really brilliant work, presenting some top-notch performances (esp by Humeyra and Cetin Tekindor) and a clever collection of spectacular moments. No special effects, no superhuman strengths no fantastic landscapes.. Just human and the ordinary feelings. I felt some rush to call my mom and dad just after the movie to be sure that they are OK and to make them know once again that I really care about them. This movie makes you think deeper on values that make us human and also etches itself irreversibly to your memory by touching the deepest possible regions of your soul.. Highly recommended; a must-see! Do not forget your tissue papers because you probably will not be able to keep your tears from flowing...Thanks Cagan Irmak, and continue to blow our minds away..",
            "review_date": "2005-12-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Must See!",
            "content": "Having seen a lot of Turkish films, I do agree with someone writing in this site that this is perhaps the best Turkish movie ever and one that can hold proudly its place amongst the best worldwide. Everything is perfect, direction, photography, acting, you cannot help but feel for its characters and identify with them, especially if you share the same location in the map, similarities in history and personality traits.I loved the child actor, he can make you smile and cry, but also the whole movie is about feelings, pain, sadness, anger, love, forgiveness and most important the joy of life.Another strong point is the music, made by the Greek composer Euanthia Reboutsika. Gave the movie wholeheartedly a 10 rating! I wish there were more of its kind.",
            "review_date": "2012-12-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "AWESOME - the word is not enough",
            "content": "I have never seen a movie ever before, that brings a tear to anybody who sees it, at the sound of a violin, or a single word uttered.Babam Ve Oglum.Director: Cagan ImrakLead Characters: Ege Tanman ... Deniz Çetin Tekindor ... Hüseyin Fikret Kuskan ... Sadik Hümeyra ... Babanne Serif Sezer ... Teyze Yetkin Dikinciler ... SalimI Salute them all. I have always despised the entertainment industry, most of all the Film industry, at the back of my mind, though I fancy a career there. I have always thought that half the money that goes into movie production or theatres or things like that could feed so many people out there or give them a job, get a living for them.If someone's going to bring to the screen a movie like Babam ve Oglum, I'd never ever utter a single word against the industry. You won't believe that one movie can affect you so much for the moment that you, even if you haven't cried since 5th grade, would be overwhelmed so much that you'd cry more than the characters on screen. Especially when you watch it alone, without anyone to distract you from the scenes. I have never felt the urge to cry for a long time. This movie reminded me of a lot of things that were hidden in me, that I strongly urge everyone who has had even a glance of this page to watch it at any cost. A must watch movie.Apart from the Director, who deserves to be recognized at the highest level, I must mention a few words about the background score. NO other BGM I have heard has ever got even close to this. . Out of this World.Finally, Coming to the story, this movie is about a father, who, after the loss of his wife, takes his little son back to his hometown (from where he had run away, defying his dad) because he suffers from a lung disorder. He wants to ensure that his child has a home when he's gone, and decides to confront his father and tell him about his condition and reconcile one final time before the final goodbye. And the characters portray the situations and experiences so convincingly that I couldn't help but put their names on top of this post.I am sure that this will remain my most favourite movie of all time for a long time to come.Bravo.",
            "review_date": "2009-03-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An emotional roller-coaster of epic proportions!",
            "content": "Very rarely can you find a movie that can make a person shed tears of sorrow one minute, then laugh out loud the next. This is a heart wrenching tale that will make people look at themselves and how they can better their own family units. Viewers will find that they will relate to one of the many stories within the movie. It's been a long time since a movie has made me feel this type of sadness and sorrow, followed by a warm fuzzy feeling right in my chest. An amazing film, with amazing people. The supporting actors complete what is truly an inspirational film. It has inspired me to be a better father and a better son. Watch this movie.",
            "review_date": "2006-06-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "In case you come across 'Babam ve Oglum'...",
            "content": "This movie came out in Turkey late 2005, without much advertising. It's a small family drama, set largely in western rural turkey in 1987. Within a couple of weeks, the film became a smash hit solely through word-of-mouth. Since then, it has received every national award and has become the third-biggest grossing film of the country's history by mid-March (it could go even higher, considering it's still playing in theaters after several months). It is indeed a good movie, but i doubt it'll reach the same kind of wide audiences outside the country. It's well-written, well-acted and well-shot; but some of the jokes, and especially the local accent that adds the movie a lot of its charm will be lost on international audiences i'm afraid. Similarly, the film doesn't give much information about the political events that unfold in the background. I think one of the reasons the film did so well is that it reflects the atmosphere of the older Turkish films, from the industry's heyday in the sixties. Its mixture of comedy and tearjerker melodrama catches a very subtle balance. Granted, the melodrama bits are rather manipulative, but effective nonetheless. I heard that a tissue company did a campaign where they distributed tissues to the ingoing audiences, don't know if it's true though. My one (small) problem with the film is a few anachronistic details, but i guess they wouldn't even be noticed by someone who wasn't around then and there. If you come across this movie at a local festival or some other way (not very likely, but anyway), give it a shot. It's worth watching just to see the little kid in the leading role.",
            "review_date": "2006-03-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Haven't seen it? oh watch it already.",
            "content": "I am always in search of great foreign movies.I had never seen a Turkish movie and then I decided to watch The Bandit(1996) and loved it! Without any effort i was able to find this masterpiece. I laughed, cried, loved every single minute of it! I first watched it in 2013 and today decided to watch it again. I have recommended this movie to many friends and each one of them liked it and each one also cried. I have always loved drama movies but this movie is more than that.Great performances from everyone.Simple and Remarkable,a must-see! I will recommend everybody to watch this movie.These type of movies are the victory of Cinema.",
            "review_date": "2014-12-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Mediterrenean way of life..",
            "content": "This is a very good movie without any doubt! During the recent years there have been made some movies that clarifying Turkey's 70s - 80s. As a person who has been experienced those years, the film became a very big sentimental burden for me. Those were the tough days for many. It is a very touchy story..However, it is not that what makes this film good one.. You don't need to know all Turkish history to feel the movie.. You don't need to be Turkish either.. This is emotion.. This is life.. The Mediterrenean way of life.. I guess in a Mediterrenean perspective the movie would appeal to many. I myself watched a lot of Italian movies with similar scenario. The life from a 7-8 yo kid's eyes gather things in a three-generational dimension.... There are many scenes that are going to be remembered long.. The first encountering of the kid and grandfather is really touchy.. The blood is thicker than water.. This is what so called about a FAMILY..By the way\u0085 for the international audience.. Deniz is name of Turkey's one of the most famous leftish youth leaders in 70:s with a great charismatic personality. So, that's why the name of the kid is not at all a coincidence..",
            "review_date": "2008-01-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Simple and Remarkable",
            "content": "Anyone who watches \"My father and my son\" will eventually relate the movie to a family relationship they have lived. It is a perfect visualization of what people do because of their ego and what can actually destroy that ego. The movie makes the viewer ask \"what if\" questions about almost everything and the answers will be different for everyone. The acting is definitely remarkable with less experienced characters (including the little kids) putting on a display to remember when aiding patriots of Turkish movie industry. Overall I can say that \"Babam ve Oglum\" is a blending of great acting, wonderful script, and a real life story.",
            "review_date": "2006-01-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "impressive",
            "content": "a family. trace of past. lines of present. and a touching end. Father and son is a collection of themes. and a splendid example to define each in a delicate and precise manner. it is touching and special film in contemporary Turkish filmography. it is special for the art of a young director to use old ingredients in a new manner. nothing spectacular, only old truth sides. but the result is a profound exploration of viewer universe - the relationship with the other, the family importance, the new chance, the error and its price, the miracle. sure, it is a Balkan movie. but its message is universal. its beauty is out of definitions. the inspired acting, the force of images, the music are only parts of an impressive story , a fairy tale with strong roots in reality.",
            "review_date": "2013-10-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "great movie",
            "content": "i am from India and i saw this movie at Bangalore film society, its the most emotional drama i have seen till date and there wasn't one moment where i didn't have tears, i do feel though that the end was dragged. i feel the movie should have ended when the kid videotapes's his dad's exit in the end nevertheless its a beautiful movie with wonderful actors and a great director and every human should watch itit speaks about father and son, family, love, youth, i has everything that a life has and i must say that one great part of the film is that there is no violenceits a FIVE STAR movie along the likes of \"eskiya\" \"the edge of heaven\" \"head-on\"WATCH IT",
            "review_date": "2012-01-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The State as a Tool of Terror...",
            "content": "The profound consequences that a state, in fear of its people, can have on those people. Achingly sad and sincere, riven with sorrow and emotion, the tragic effects on a rural family in Turkey in the1980s as a result of tyranny, despotism and control. Be prepared to bleed tears into a bucket as your outrage, sorrows and disbelief take hold, in a wholly believable story that could be retold in far too many places around the world, still is unfortunately and, most sadly, still will be while true democracy is ignored - although it is particular poignant the way it's performed here.",
            "review_date": "2020-10-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great acting in an entertaining drama",
            "content": "The acting was perfect in this movie from the kid (Deniz) to Çetin Tekindor (Hüseyin Aga). All player did their job in a great performance. Also the places the film shot was great. My grandfather lives in a similar village, and I used to go to there in summers in my early ages. I went to back again to my childhood when I was watching the movie. It reflects the life style of those places in a very good manner and reality. No detail was skipped. Also the director mixed the drama and joy in the movie very well so that you can laugh suddenly when you pity for something you see in the movie. This was, I think, a great directing success for the new generation director, Çagan Irmak. So, this a \"must to see\" film I think, especially for the Turkish viewers (It includes so much domestic features). But international viewers can also get a real good taste of it, because main themes (such as family bonds, love of son) in the movie are humane things.",
            "review_date": "2005-12-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Life as it is...",
            "content": "This film was a real surprise for me. I only saw one other Turkish film before this one (Vizontele Tuuba). The story may not be all that original but the way it is told is just wonderful. Lot's of humor (we laughed a lot) and real tragedy (we really needed that handkerchief at the end). I love the parts where you get carried away in the little boy's dreams. That surreal view shows us the differences in thinking between an adult and a child. The music is what you can expect from a Turkish film. You either like it or you don't. But it's never overwhelming. I really recommend this movie to everyone. And no, I am not Turkish!",
            "review_date": "2006-03-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Unabashed Melodrama with its Roots in Yeşilçam",
            "content": "A huge hit on its first release in 2005, BABAM VE OĞLUM (MY FATHER AND MY SON) is an unabashed melodrama with the emphasis on excess.The story is a straightforward one: Sadık (Fikret Kuşkan) has to deliver his first child alone, when there is no one to take his wife Aysun (Tuba Büyüküstün) to the hospital. The wife dies, leaving Sadık a single parent on the first day of the military coup taking place in the Republic of Turkey on 12 September 1980.Time passes: Sadık is imprisoned and tortured for his political views; but on his release, he leaves İstanbul with his son Deniz (Ege Tanman) to return to the family home near İzmir. He receives a frosty welcome from his father Hüseyin (Çetin Tekindor) who has never forgiven Sadık for quitting his studies in agriculture in İstanbul and turning to politics instead. The rest of the movie focuses on the way familial relationships change, as well as how people cope with an unexpected tragedy.Director Çağan Irmak looks at the oppressive influence of the past on the present; not only does it affect relationships between Sadık and Hüseyin, but it significantly dictated Sadık's love-life too. Returning to his home-town, Sadık is at once attracted and repelled by its familiarity; those who have never left - even for a short time - remain blinkered in their world-views. On the other hand BABAM VE OĞLUM shows how families stick together in times of crisis, and can resolve their own problems so long as they are prepared to acknowledge them in the first place.The narrative contrasts Sadık's story with Deniz's imaginative fantasies, in which the little boy positions himself as the hero. In the first part of the film they can be read as a retreat from reality, as Deniz tries to cope with the trauma of moving to a new town and coping with a new life. By the end, however, he has discovered that such fantasies might change, once he grows up. They will remain fantasies, but they will fulfill a different function in his life.The film is full of major scenes of confrontation and reconciliation, with Irmak's camera-work designed to achieve maximum dramatic effect through the use of close-ups, panning shots, dissolves, and two- shots, complemented by a florid musical score (by Evanthia Reboutsika). Although the narrative celebrates excess - of emotion, of feeling and of reconciliation - it does not seem in any way forced. In fact, it is as convincing and emotion-provoking as the best Yeşilçam melodramas of the past. Clearly Irmak planned BABAM VE OĞLUM as an homage to the genre, and he accomplishes his task with élan. Definitely worth more than one viewing.",
            "review_date": "2016-01-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Never Felt Like This In a Movie",
            "content": "This is the best Turkish Drama I have Ever Seen. In fact this is the best movie of Turks. Story, Acting, Music etc. everything was perfect.It is about 3 generation. Father, Son n Grandpa. Most of the theatre cried many times and in the same scene we suddenly start smile sometimes they were more than smile. This is my reaction in a scene :) => :( => :(( => :('' => :)I would like to celebrate Cagan Irmak and all the actors even childrenTurkish Movies are commonly made for money but this is not one of them but this will be the most movie ever watched in Turkey this year. I think this is also better than Gonul Yarası which is a nominie for Oscar nominies.",
            "review_date": "2006-01-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Simply amazing, drama at its best!",
            "content": "It's one of those films which really affect you deep. The movie somehow makes ordinary places, ordinary people and ordinary events become interesting. I think it's due to the way Cagan Irmak (writer and director) cleverly and carefully blends everything. The movie is definitely not like a Hollywood production, maybe more like a European film. The film has many enjoyable moments but it's mainly emotional. The actings are magnificent, the story is heart-breaking and the places are so real. All performances were remarkable, but I should say I was over impressed by Cetin Tekindor's (Huseyin Aga) acting. While the bitter truths about life and family relations are portrayed perfectly, the movie also reflects life from the innocent eyes of a child. Personally, the local rural village life took me back to my some good memories. There is no need to tell what happens in the film as enough is said in the plot summary. More would only spoil it. But, it should be noted that even though the plot may sound political, the film is actually not.The movie came out without much advertising, but in short time became very popular - won many awards in Turkey and some in Europe. Not much to say... brilliant work. If you haven't seen it, I advise you watch it whenever possible. If you don't feel like crying in this movie, you will feel sorry for yourself.",
            "review_date": "2007-02-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing movie",
            "content": "I've never really been a fan of Turkish movies.I always thought they weren't good enough, but I knew that some good movies were done in recent years.And I heard everyone talking about this movie, low budget but a great movie they said.I wanted to see it myself, and so i did.The movie is really great.It tells us feelings, family, joy, laughter, sorrow, grief...It tells us life, but in a very sad way.I'm a cold blooded person, i cry rarely and never in public.I didn't cry watching this movie, but I really tried hard not to.The movie, scenes are incredible and also the music is wonderful.Acting is very very good.Cetin Tekindor (grandfather) is the best in my opinion.He's one of the best actors in Turkey, but I think he did his best job in this movie.He talks Aegean Turkish accent perfectly.Cagan Irmak, director of the movie did an outstanding job.I want to congratulate him for this masterpiece.",
            "review_date": "2006-03-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An intense emotional drama",
            "content": "At its core \"My Father and My Son\" is another old man - young kid story done just right. While it is not as amazing or as stunning as many reviews proclaim it is still a very good movie. It is prone to sentimentality sometimes, but that is more of a cultural thing. While acting wasn't spot on in a couple of places, mostly everybody has done a very good job and though it may appear that the actors are overacting you have to keep in mind that different cultures have different norms and different ways of expressing emotions.\"My Father and My Son\" is not groundbreaking, but It is both touching and humorous without falling in too many clichés. A very good movie and a treat for foreign movie lovers.",
            "review_date": "2011-05-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "please watch this film..",
            "content": "I think,this movie is very special for Turkish cinematography.Cagan Irmak(If I were you,I would be careful with him.He is great man) told us dying for opinions and the importance of the family.While I had watched the movie,I perceive that I want to believe my imaginations in my childhood and never want to grow up.Congratulations Cagan Irmak!Because of you touched our hearts in a very beautiful way.In addition,I should thank Çetin Tekindor( If he was born in an other country,he will certainly be an actor such as Anthony Hopkins),Fikret Kuskan(no comment),Hümeyra,Serif Sezer,Ege Tanman(Sadik's son)..Please don't be prejudiced against Turkish movies and watch this movie.You won't certainly be regretful.I think,everybody should watch this movie.",
            "review_date": "2006-01-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One more chance for fathers and sons",
            "content": "Give him a room dad, he do not have any else place to go... Is the best and the most important Turkish movie written and directed by CAGAN IRMAK... He is a wonderful writer and director. Although his young age, he is more successful than other older directors. I recommend everybody to watch this perfect movie! Actors and actresses were wonderful, time was expressed very well. It is impossible not to be touched and cry after watching the movie.Developing Turkish movie sector will have a very important affect on European movies especially with the help of this movie.Cagan Irmak had proved his talent with his previous movie \"Mustafa Hakkinda Hersey.\" I hope more these kind of movies will be created in Turkey and Turkish movie sector will be developed with the help of good quality moviesA PERFECT film surely not to be missed!",
            "review_date": "2005-12-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "useful",
            "content": "touching. realistic. profound pledge for the values of family. one of films with status of mirror. because it use the soap opera tools for a simple story about relations, regrets, decisions and build of peace as result of hard wars against yourself. because it preserves and use the Turkish spirit for an universal story about a father and his son. because it propose not entertainment or answers. only a lot of not very comfortable questions. because it is a high useful film. about the courage to choice the right decision. because it has the flavor of old times and reminds the basic truth. a film who must see. for discover a chain of challenges. and theirs limits.",
            "review_date": "2015-12-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Although this film has it's moments of magic, it's riddled with overly-sentimentality and melancholia",
            "content": "As a Turkish viewer residing in the United Kingdom, promising word of mouth/reviews of Turkish films are always a delight for me to hear. After much hype and recommendation of Babam ve Oglum, I was pretty anxious to watch it.Babam ve Oglum deals with Father/Son relationships and is charged with story-values of Life/Death. The relationship and chemistry between Huseyin, Sadik and Deniz are not only believable but poignant. It is by far the strongest point of the film, and if I were to review this film on this aspect alone, I would have given it a 9/10. Unfortunately, the script and some misdirection provide crucial mistakes, with the former underpinning the films over melancholia.Despite the credible relationships and fantastic performances from the lead fathers and sons, the script implements cliché and melancholic Acts that stray from believability and feel a tad forceful to elicit an emotional response from it's audience. It's partly reminiscent of the old Hülya Koçyiğit, Turkan Soray type Turkish films. Whilst paying homage to old films is one thing, I felt this film unintentionally did that with some conventional, dated storytelling. I believe Turkish Cinema is currently evolving with directors such as Nuri Bile Ceylan, but conventions used in this movie is a step backwards.In terms of it's direction, it's got a nice classical feel which complements its Arch-Plot themes and even delivers absolute movie magic. The scene where Tarik has his first meal with his family coalesceds humour and drama in an accurate fashion. The scene of Sadik and Tarik's first night at their new home, is an undeniably sad moment. However, what contradicts these realistic, subtle scenes are Anti-plot elements such as the convenient collapse of Sadik at that very moment, or the hammy scene of when Huseyin demonstrated how he could have stopped Sadik from leaving before. Exposition is one thing, but be overly visual breaks the films realistic aspect, which is what worked in the first place. That is not to say the film cannot implement experimental features, the resolution of the boy confronting the notion that he has to deal with moving on without his father at the end, was a touching moment of the loss of a father.Overall, Babam ve Oglum is a good film but misses out on being a great film due to over-sentiments and melancholia. Had it maintained balance and stuck with a realistic/subtle direction, it would have been a fantastic film.",
            "review_date": "2009-10-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bored of those genetically modified tomatoes?",
            "content": "What makes this film \"exceptional\" is the diversity of human state. It bares the drama, the comedy and the tragedy in every single frame. One of the only titles I can think of is the Korean make \"Memories of murder\" in same sort.It's not artificial, in fact I found it very humanistic in many senses. In todays cinema we are all bored of those genetically modified tomatoes and this is very important for especially Turkish cinema as it would hopefully be the first step of a new line.I hope you will all get a chance to see this title, but bare in mind that the amount of entertainment offered isn't as high but will teach you a lot.",
            "review_date": "2006-02-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A perfect portrait of family and problems associated",
            "content": "This is a movie that has a crying guarantee on almost anyone who would watch it. It portrays a family in turkey in the early 70's mainly concentrating on the relationship between the dad and the son.It is by far the best Turkish movie i watched, and i really did not like most of them. This one is definitely in my top 10 best movies ever made.The drama and comedy genre is so perfectly mixed that many times one will get the feeling of laughing and crying all at once.If you have not watched this movie yet, get it. No matter what you will like it. Actors do a very good job and the director's is one which is not even one to mention, just EXCELLENT.This movie will relate to everyone and will give you an emotional vibe.Enjoy",
            "review_date": "2006-05-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wonderful Film!",
            "content": "The director of Babam Ve Oglum is Cagan Irmak.Cagan is the best and the youngest director of Turkey.I believe that one day,all people will notice his ability.Before Mustafa Hakkinda Hersey and than Babam Ve Oglum... I don't remember crying like that before.Subject of the film is not only Turkey's problem,all families' problem. Subject is wonderful,music is wonderful,actors and actress are wonderful,director is wonderful so the film is wonderful! I hope most of people in the world saw that film and put in order their family's life.Picturegoers must saw that film....You LOVE this film like me!(don't forget to take with handkerchief to go to the cinema.)",
            "review_date": "2005-12-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "emotional eruption",
            "content": "Sadik struggles to find help as his pregnant wife gives birth. There has been a military coup and no one comes. His wife dies in the streets. He is a leftist writer and the military tortures him. Years later in poor health due to the torture, he takes his son Deniz back to his rural family home. He has been estranged from his conservative father since leaving for school in Istanbul. Intending to leave Deniz with his parents, his mother forces him to stay. The father and son struggle to come to terms in their relationship.This is digging into a deep family rift and finds a compelling movie. I would prefer Sadik to look more sickly when he arrives back at the village. It meanders as the plot lacks an obvious ticking clock. That's why Sadik's sickness should be played up to make his end more inevitable. It culminates with one oddly riveting emotional eruption by the father. It is breath-taking in its rawness. It helps that these actors are unknown to me which creates a realism despite the surreal emotional eruption.",
            "review_date": "2017-09-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "May God Bless Turkish Cinema for delivering The BEST FAMILY-EMOTIONS FILM EVER !",
            "content": "My Father and My Son (2005) :\nBrief Review -May God Bless Turkish Cinema for delivering The BEST FAMILY-EMOTIONS FILM EVER ! I love those moments when the film is over and i am sobbing & sniffing. I love it writing a film review with teary eyes and wrenched heart. After seeing more than Ten Top class Family dramas in Hollywood, Bollywood and Indian Cinema finally i found something which i can call 'The Best Family Drama Ever'. Family emotions were never so new and never so touching before. I know Emotional Family Drama is nothing new, it's the same old story but i don't know how this film managed to pull off the same old stuff with such a new and innovative way? My Father And My Son is story of Sadik who left his father and Mother years ago and now is blessed by a Child. He returns to his Father and Mother's house so that his Son can have a Home. See there is nothing new or outstanding in the plot but the storytelling is New and Outstanding. The way film is narrated by a Child who is living Real Life and Fantasy together, the way things are mixed up, the way memories from old days are used, the way Father and Son relationship is explored, everything is so Emotional and for a change so Clever. I don't remember watching such an intelligent narrative in this genre. All actors make this one look like a real family, they create thier place in your heart because every character is different in nature and you are forced to love them all. Background Music is so beautiful and mesmerizing, i could feel it in all those emotional moments. Direction is Top Notch. A rare case when i don't have any complaints to make. My Father and My Son is a story for everyone who love thier kids, fathers and thier family and that's why it is Universal subject. It would be shameful for you if you miss this MASTERPIECE..RATING - 9/10*By - #samthebestest",
            "review_date": "2020-07-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Simply, a gem",
            "content": "Moms say it all what they feel for their children. but father-son love is always silent.once i read in a book that if you find two people sitting together and are not talking with each other, most probably they will be father and son.\"My father and my son\" truly shows the intricacies of father-son relation, which is felt by most of us in an oriental society but this is how life is...............Perhaps sadik's father was right who doesn't dared to be radical when young which has kept him from being conservative when old.loved it..........",
            "review_date": "2011-09-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Really good but overrated for sure..",
            "content": "i don't know if you watched the movie but i can easily say that this movie is one of the best of Turkish movies ever seen..good acting, good directing..etc. However it is not a perfect movie. I watched this movie 4 times.I enjoyed all of them but if i give a 10/10 it can be unfair. Nice traditional things, Good actors and actresses, very good directing and one of the movies which really enforces you to cry! I did not cry when i watched it but i m not gonna say that it will not make you cry..İt will probably..So watch it..Enjoy it..And for sure wait the director Cagan Irmak's real masterpiece!..He is really talented and gonna show you the real Turkish cinema..",
            "review_date": "2007-02-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good movie",
            "content": "Greetings from Lithuania.Even if sometimes \"My Father and My Son\" (2005) goes a bit to sentimental, and some actions at the end of some characters feels more like a funny then real, i never lost interest in it when watching this movie. Script here is great - it is involving movie and directing was also top notch. Acting was pretty good mostly by actor who played grandfather and the one who played brother was a bit over the top i think. Overall, \"My Father and My Son\" is a good movie at the end despite some of its flaws. Its a touching story well made.",
            "review_date": "2017-09-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A spectacular movie which deserves to be seen all over the world. , our hats are taken off !",
            "content": "Although that I am an Egyptian and I was not a fan of the Turkish movies until I watched this movie, I felt while watching the movie that I was in Egypt. The village life and the relations between the family members which are sometimes full of contradictions between the old and young generations of the same family. The role of the strong mother (Hümeyra) who is trying to do her best to retain the relation between her husband and her son into its normal course and how she is keen to get her family back together was brilliant that she make you cry and laugh in the same time. The father (Çetin Tekindor) whose sorrow when he lost his son made me cry although I tried to control myself. The oldest brother (Çetin Tekindor) his natural simplicity which he conducted in his role of a loving older brother whose ill youngest brother was being fed by his own hands while he is waiting for his destiny at the hospital. The little boy (Ege Tanman), no one can deny the ability of this young boy who is living in his dreams that his father is his hero even after his death, his maturity in acting is quite spectacular. Finally, I would like to that the brilliant director and the writer (Çagan Irmak), his control over his cameras and conducting the actors accordingly was above imagination. Sincerely, all the members who worked in this movies deserves our hats to be taken off for them. It will be a pity if that movie is not nominated for Oscars. Simply a spectacular movie which deserves to be seen all over the world.",
            "review_date": "2006-03-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Stunning Film Ever Made",
            "content": "As a men that don't like dramas much, I really have been impressed so much. What a great film about a rebellious men, facing reality of life and his past. Maybe best style of expression cultural abyss between somebody and family. Almost all cast has strong background of theater of cinema. Huseyin (father of rebellious men) and his naive brother really acted worldwide quality. Especially naive brother was played so naturally. I wish, if it were nominee for Oscar as best film. In Turkey film awarded so many prizes in film festivals as best film, best actor, best actress, best supporting role ...etc. I think this film is really a milestone of a Turkish Film Industry. One of the best film ever seen without a doubt. I recommend everybody to watch.",
            "review_date": "2008-05-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very soap operish.",
            "content": "This film while not bad, but was just cringe soap opera alike. Yes it has some good morals, but the cheesyness ruins it.",
            "review_date": "2021-02-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Did we have to wait that long to make a decent movie on our \"coup d'etats\"?",
            "content": "Kenan Evren,the the leader of the coup d'etat on 12 September 1980 and the 7th president of Turkey let the cat out of the bag before a press member a couple of months ago:\"Under the same circumstances I would lead the same coup d'etat without hesitation.\" Naturally the DA opened an investigation but the gory leader of the 80s saved himself based on recently made constitutional changes related to \"freedom of speech\". What's ironical is that he was saved by some concept he repressed for years.I am not necessarily a member of Generation Y which could understand the sufferings of the period better but I know what a coup d'etat is and what it did to the people of this country.Kenan Evren and his troupe(!) of force commanders which were named \"our boys\" in the CIA headquarters after the coup led just another 'stumbling block\" which caused Turkey's democracy to lag behind for another fifteen years.Evren seemed to have great admiration for the founder of Turkey, Kemal Atatürk, but he shut down some institutions founded by Atatürk and is often accused of deforming the country's legal system against Atatürk's principles. Thousands of people who were remanded in custody were killed or heavily injured in the prisons. I wonder why the Turkish movie makers have waited for more than twenty years to make a movie out of this calamity. You see it's not more than five years since the USA invaded Iraq but there have been lots of TV series,movies,plays which have a little of that theme in it. They just know how to stand up for the actual course of things.An example: There is still a Guantanamo prison and there are still many prisoners there who have no right to appear before a court-martial but Michael Winterbottom-the British film-maker made a 2006 docu-drama named \"The Road to Guantanamo\". He did not really wait for US officials to shut down this prison to make his movie. I know a lot of people have already seen \"Babam ve Oglum\" and most people know what it's all about but I just wanted tell something on the plot too.Sadik is sort of a free-spirited person. In a period where people find every opportunity to fight with each other on capitalism-communism conflict he gets into continuous clashes with his father. This is what we learn during the course of voice-over in the movie.His family as a village family sends him to Istanbul to study agriculture. He loses his wife on the night of coup d'etat just because he cannot find any taxi to take her to the nearest hospital.Probably nobody was outside because of the general curfew,he was a bit tipsy at the time and he did not hear of anything.He helps his wife to give birth.His wife dies but his son survives the birth. In a coup d'etat period where people have been charged based on their political beliefs he is tortured in custodial prisons.After his release he develops a chronic lung disorder.After losing his job and when his health deteriorates heavily he decides to go back to his village, to his father's home. Actually this is a plot developed by flashbacks and some kinda voice-over because the whole 2 hours nearly is set in the village specifically on the father-son relationship. Sadik feels like he could never leave the village neither could he stay there. He feels to be trapped in a limbo.He does not seem to understand his father neither does his father attempt get his son under the skin.By way a voice-over for example we hear their discussion on \"serfs.\" The son accuses his father of being kinda capitalistic power the father defends himself by telling \"Have we ever treated them different? Have we ever prevented them from sitting at our dinner table and eat?\" He has a point.In Anatolian culture field workers have not been seen as indentured servants mostly.So the son does not get his father's point but the father has not offered him some \"latitude\" either so that his son could have made his life on his free-will. Two hours cinematic feast flows on this father-son relationship,their final efforts to understand each other in the final days of Sadik before his death.",
            "review_date": "2006-07-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An Evocative Portrait Of Father-Son Bondings That's As Heartwarming As It Is Heartbreaking",
            "content": "Crafted with tenderness, told with composure & sincerely brought to life by its cast, My Father and My Son (also known as Babum ve Oğlum) is a story of loss, grief & broken relationships that paints an evocative portrait of father-son bonding, and is as heartwarming as it is heartbreaking.My Father and My Son tells the story of Sadık, a Turkish man who returns to his hometown with his son to reunite with his estranged family. Although everyone at home is elated to have him back, his relationship with his father still needs mending, which he hopes to accomplish before it's too late.Written & directed by Çağan Irmak, the film features a simple premise but packs a lot of emotions that's honestly captured. All the characters are embedded with meaty arcs but it's the sum of their relationship with each other & a sense of history between them that provides the necessary weight to it.The father-son dimension between Sadık & his son as well as Sadık & his father is portrayed in an earnest manner, and all the actors play their part responsibly to make their interactions genuine & share a wonderful chemistry together. Camera-work is no slouch, pacing is steady, and music really complements the whole narrative.On an overall scale, My Father and My Son is a skilfully directed & deftly scripted family drama that pays proper attention to its characters & their relationships, develops those bonds at a steady rate, and at times even indulges in a child's imagination to add more depth to its tale before finishing on an emotionally hefty note. Definitely one of Turkish cinema's finest works, My Father and My Son is absolutely worthy of a broader audience.",
            "review_date": "2017-06-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "never-to-be-forgotten",
            "content": "In Turkey this film is still remembered and missed. And also hard to watch again because of its realistic scenario. People tried to hide their tears from others. Friends had gone together to cinemas but at the and of the film they left in a big silence.Of course you can say 'it's a local taste' but I said in that film there is a big universal issue for all people: family relation. I want to advice that film everybody that need to cry and thinking about the father, mother, brother, son, ...And absolutely this is the best Turkish movie ever. In Turkey that film never will be forgotten...",
            "review_date": "2007-12-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A warm drama almost no one can resist to cry...",
            "content": "Probably the best Turkish movie of the season 2005-2006. With very less public announcement, the movie grabbed the audience and the rest is history. I couldn't find the opportunity to watch it on the silver-screen, but the recently published DVD is also awesome with all aspects.Cagan Irmak, with his movie \"Mustafa Hakkinda Hersey\" already put forward his magic in Turkish cinema industry, but \"Babam ve Oglum\" takes you to some place else, where you cannot stop the tears in your eyes. He is a genius in many ways, from the scenario to the realization...All the cast, without any exemption are totally fit and every little detail, every gesture is almost precisely calculated... The little boy ( Ege Tanman )is a marvel, and I hope he's gonna stay that way all through his career.Çetin Tekindor ( the granddad ), is a theatre based actor and performs one of his best. Fikret Kushan ( the dad ) is already a Cagan Irmak favorite and is just perfect with no exaggeration. Humeyra ( the grandmom ) also performs one of her best in her career and let's you put a smile on your face in all those dramatic occurrences.I hope this movie will find a way to exhibit itself worldwide and warm up many hearts who need to examine the fragility of a father-son relationship. Bravo Cagan Irmak !!! Thanks Avsar Film...PS. For anyone who reads this critic: if you have no way to watch the movie, insist on having the DVD, that'll be a classic in no time.",
            "review_date": "2006-06-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "my father and my son",
            "content": "I thought I would never forgive my father, and when I came out of jail in October, he came to see me. We met at Liuliqiao. His hair was white and his eyes were cloudy. The man full of power had disappeared. At that moment, I forgave him.",
            "review_date": "2020-06-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "About the meaning of home",
            "content": "Babam ve Oglum, or My Father and My Son, takes place at the start and in the aftermath of the 1980 Turkish coup, where the existing government was overthrown and a military junta took power. This took place on September 12th, and on that same night a left-wing journalist, Sadik (Fikret Kuskan), lost his wife in childbirth. We jump some years into the future as Sadik returns back to his childhood home in the countryside with his son Deniz (Ege Tanman).What I appreciate the most about this movie is how layered it is. How it tells so many stories at once. First of all, it's a great story about returning back home after having left it years ago. I too grew up in the countryside, and this movie tells it just like it is. About how it feels so alien, like the place has been frozen in time, but at the same time there's immediacy to it, certain purity even. It feels like home in a way city never can.It's also a story about three different generations trying to build and rebuild bridges. About grandparents finding a connection with a grandson they've never met. About a son trying to reason with his father, both Deniz with Sadik and Sadik with Hüseyin (Çetin Tekindor), Deniz's grandfather. And as a sidenote, can I just state how much I loved the character of Salim (Yetkin Dikinciler), Sadik's brother, who stayed when he left. What a kindhearted, honest and utterly likable character.And yes, it's also a story about a certain period in Turkish history. But that stuff is not at the foreground. It plays a part in the narrative, but more as a source of causality. It's the reason why things happen, but not the focus. And I think that was the right call to make, in order for these other stories to have enough room to grow and shine.This movie isn't widely known as of writing this review. And that's a shame. It has the depth, the expertise and the purity of message to be a true classic. I hope more people find it in years to come, because it surely deserved to be watched and appreciated.",
            "review_date": "2019-12-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not spesific as it is exaggerated",
            "content": "In our country good films are shown as excellent because the absence of really good films.Certainly,this film is a good film but not deserve concept of \"cult\" or \"excellence\".I watched this film and thought that such stories are available in all of us.I don't understand why these kind of films are demanded in high density when adapted to moviescreen.The reason that giving six point is the skill of actors and actress and some moments in scenario.For example stressing the damage of military stroke is affective.Cagan Irmak gained remarkable prizes and prices from inner and outer authorities and saloons,lastly from FOX TV at about 1.000.000 $.According to me this film can be a good pre-news film,not the farther.Inasmuchas before I watched this film,surroundings by me had said that your tears would not cease to the end of the film.Although I am a sensitive man in my life,I was not affected as Turgenyev's \"Fathers and Sons\".Already I think that the actioners of the film inspired from the book with one difference that there was no little child in scenario.As looking at the comments in IMDb about this film,people in Turkey don't has film comment culture.Repeting that this film can be wathced as pre-news film on TV.",
            "review_date": "2007-03-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This is victory of Turkish Cinema History",
            "content": "What can we say about Babam V Oglum... Tears and sometimes smiles narrate to us everything about movies. Thanks Çagan Irmak to present us what a great life story. By the way, Have you ever watch Tim Burton's movie of Big Fish??? If you watch to Babam V Oglum, You should see Big Fish. I mean both of the movies try to explicate father and son disagreement. Big Fish contains much more fantastical components then Babam V Oglum. If a foreign citizen watch the this movie, He or she can understand the real Turkish lifestyle and real warm-blooded society. We can not introduce ourself to foreign societies perhaps this movie introduce ourself more then us.",
            "review_date": "2006-04-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "above average",
            "content": "indubitably, cagan irmak is one of the best directors in Turkey. It is quite clear that he is a talented person whose films are discernible from the other junk films. His TV-series called cemberimde gul oya was his masterpiece. Even though i am not a cry-baby, every Friday when it is aired, i cried so much that i usually have headache after each episode. His first short-cut film was also quite remarkable called bana old and wise i cal. When all of these considered, i went to babam ve oglum with high expectations yet i could not find something just above the average. The performances were perfect but the movie itself exploits feelings. If you want to cry do not miss it because it is nearly one hundred percent possibility that you will.",
            "review_date": "2005-12-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Average",
            "content": "Emotional but i find nothing special about it. Good story but I think it is very average movie so its a 7/10 from me.",
            "review_date": "2018-09-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Warm and human",
            "content": "If you liked \"Life is beautiful\" you will love this movie too. My suggestion is to forget everything you heard about it before watching. Just let yourself to the warm effect of the movie without any prior expectations. Nothing is as exaggerated as told in some comments. All the events in the movie could have been or is being experienced by ordinary people. The difference is that we ordinary people are trying to overlook our feelings but the writers and the directors slam us in the heart by showing how close we are, how our fears are alike. Maybe some day we can learn not to put any distance between the people we love whatever the conflict is between. Cause nothing is permanent in this world, but irreversible regret is. So question your ideals and principles and try compromising before letting them tear you apart from your loved ones.",
            "review_date": "2007-06-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Simply Life",
            "content": "As unique as it was made, this film's message was simply about what life is. People were born, have families, dreams and have conflicts along the way as they grow up. We get to see life in the perspective of a child who lives a life full of fantasy, an old men who lives his life in the past, and the man who contemplates about his old life and decisions but also looks forward to the future of his son. Though sometimes scenes were a little over dramatic, this is one film which was simple but meaningful.",
            "review_date": "2021-12-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "melancholy and vigorous emotion",
            "content": "Cagan Irmak seems to stir drama and comedy in correct dose. When you live intense emotion, there is comedy right behind. In this way, you are giggling, right behind when you fell with great sobs.Coup d'étates are always full of tragic and full of resentment. People separate each other with external factors and it takes time to bandage wounds and to forget about what were lived. 12th of September was such kind of phenomenon. Cagan Irmak did fine work on making movie about this fact.Using local accents, authentic music in background, accomplishment of actors and actress are the main factors for being liked. The characters are very familiar to us and they are certainly assimilated from the life itself.Dramatic wave walk with a swaying movement along the movie.One of the last scene in which Sadik come out of camera and make a speech to this son should have been eliminated. This scene does not contribute to the story. If the marginal contribution of scenes is zero, cut them and make the movie simpler. This is the golden rule of film-making.I am pleased that Babam ve Oglum is a worldwide movie and we are in the right way to find a good position in this art world.",
            "review_date": "2005-12-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Truly remarkable!",
            "content": "Plot: After a young disgraced left-wing revolutionist loses his wife, and after a dark military coup goes to his fathers farms and try to reconcile with his own family, old family bitterness and tearful joys comes together. Cagan Irmak's Father and Son, is like watching a good painting, it's get your feeling all messed up, with joy, tears and loneliness. The most powerful thing about the film is the great script and a incredible actors. Movie about loneliness, family problems and lost of loved ones. It's in my book of the best films of the 21st century, surely not to be missed.",
            "review_date": "2021-06-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If your father treats you like rubbish you should still respect and love him (apparently)!",
            "content": "OK, this is a good film. Lots of people have already commented that this is a good film so I don't need to add to that, but I did have some problems with it.The film is very Turkish, while that is not a bad thing I do think it appeal to audiences from other countries is limited. That nearly all the comments here about the film are from Turkish people shows that it appeals mainly to Turks.The theme of the film is: blood is thicker than water. The moral of the story is: even if your father treats you like rubbish you should still respect and love him. The father/grandfather is unpleasant and self-centered. If my father was like this man I would never trust him with my son. But this is why Turks will understand this film better than some other people. This is not about being 'warm blooded' (as Turks like to believe they are), it is about being unable to survive without a family support system (even if that system is dysfunctional).Towards the end of the film the old man seems to have a turn around of character; but we have to assume that this is only temporary, and that he will later go back to be a horrible old man, because it is noticeable that no one likes him. And they have good reason not to like him.The film is not really political, it dodges the political issues. The military coup is only used as a melodramatic backdrop. If fact the film also dodges the issues about family, about why we treat people they way we do and instead uses sentimental melodrama to pull on our heart-strings. I do not believe this can be the best film made in Turkey (as many people have written).",
            "review_date": "2009-01-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "the triumph of unconditional love",
            "content": "The story of how people can love without expecting a return, unconditionally and how sacrifices can be done for this aim. A story which is an ode to family bonds. The movie is a superb mixture of splendid acting, touching script, divine melodies and unspoiled landscapes. Although it is closely related to the last 20 years of Turkey's realities and Aegean culture of the country, the story is highly above any borders, a true universal praise of humanity. Both laughter and tears exist and are very deeply knitted in almost every scene, resembling real life: you can find something of yourself in every character of the movie, you can watch your childhood within the eyes of Denis and realize that you have lived similar pains, sorrows and joys. A must see for everyone who considers her/himself to be a humanist.",
            "review_date": "2006-03-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This movie will pull your emotional strings.",
            "content": "The beginning of this movie wasnt so great for me, it seemed like a cheap drama series. The music was overbearing trying to make you emotional, and it felt kinda cheesy. But as that was over and the movie started you got an actual feeling of the movie that was more authentic than the first part. Even then the music could sometimes be overbearing but it fitted more since we got to know the characters and things had more weight for us. Overall it was well shot, the acting was good. I expected this movie to be more political but it was mostly family drama about relationship between father and son. Although some things were exaggerated for the sake of emotional impact, the movie still held together without being a typical spanish or turkish soap opera, but it still has elements of them none the less. Although it pulled my emotions, I cant rate it very high overall. It gets 10/10 for emotional manipulation but it falls on other parts. Its a 7/10 for me.",
            "review_date": "2018-10-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I have cried first time watching a movie in my life!!!",
            "content": "The film is famous with its ability to make people cry from beginning to an end. Although it may not affect a foreigner in the same way, for people who lived the era described in the film are moved. The film focus on the coup d'etat of 1980, and how it ruined the lives of idealist people, especially leftist. However, there is more than that... The drama of the small family is based on a contradiction between the traditions of the Turkish rural families and the thoughts of the youngsters of these families. This contradiction is in the minds of these young people as much as it is in their relationship with their parents. Thus, the film both judges and defends the Turkish traditional family structure, first by showing how cruel they can be when a family member is against the \"tradition\", and secondly by showing how compassionate they are when the same member of the family is in trouble. Consequently, the film may not mean much for foreigners but I should mention the fact that I have cried first time watching a movie in my 28 year long life!",
            "review_date": "2006-07-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great movie from a genius director-writer...",
            "content": "\"When people get bigger, do their dreams get smaller...\" Great movie from a genius director-writer...Cagan Irmak.He is a really genius.I think he will be the new face of modern Turkey.He is young and talented absolutely.I can not describe this movie in words.This movie is the best Turkish drama (and best movie) i've ever seen.I have not watched any movie like this.The movie released on 18th November 2005, i watched it on 18th November (and also 3 times again later :) ).I cried,i laughed (of course not only me,everybody) .I feel proud of Cagan Irmak.He is a great writer, he is a great director.He creates new worlds on his every work.And the actors...Cetin Tekindor , Humeyra , Fikret Kuskan, Serif Sezer and Ege Tanman ... Everyone in this movie is so talented.The music is(composed by Evanthia Reboutsika ) minimal and wonderful.I wish the movie will be released in the other countries.Highly recommended. A must see movie.",
            "review_date": "2006-02-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Cry cry more cry :(",
            "content": "Best movie if you want Cry and hug your father. Çagan Irmak is perfect director.",
            "review_date": "2019-10-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The best drama of Turkish Cinema of all times.",
            "content": "The director Cagan Irmak, who became famous after TV Series \"Asmali Konak\" invites audience to late 80s of Turkey. Movie is recorded from eyes of a 7 years-old kid, Deniz. Deniz's father (Salih) knows that he is going to die, and wants to leave his son to his father. But Deniz's father and grandfather have not been talking since Salih's politic conflicts with his father. Salih's father wants his son to be an agricultural engineer and gets the control of the their farm, but Salih becomes journalist and writes against government.Most of the cast have a theater background and act excellent. Especially at the second half of the movie, everyone in the theaters start to cry. In fact you cannot decide to cry or laugh in a minute. Comedy and drama is blended in a perfect rate.As a result it is the best drama of Turkish Cinema and i believe will stay as the best forever.",
            "review_date": "2006-02-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "What a bounding of father and son",
            "content": "This movie is really emotional, it made me emotional. The relationship between father and son portrayed awesome. It was my first Turkish movie that I have seen and I liked it. The movie shows the bounding between family and relatives. I wish everyone lives like this.",
            "review_date": "2020-02-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "These stories with happy endings should always be told to others",
            "content": "Perfect blend of reality and fantasy in a heart-warming flick from turkey, which has elements that many of us could relate and find us in the characters shoes.\nThe acting is done beautifully by the cast which seems just like everyday household talks with turns of happiness and sadness.\nEveryone should once try to see this movie, stepping aside the language barrier and enjoy it's charm.",
            "review_date": "2020-08-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An emotional drama that never hits hard",
            "content": "This is an emotional drama that, after the opening scene, was never quite able to hit my heartstrings. The story has two, or arguably three, main characters. Some movies are able to pull this off, but this one never seems to provide quite enough background or personality behind the characters to make me feel emotionally attached to any of them.The acting also played a role in my failure to connect. Many scenes were acted convincingly or adequately, but others seemed either unrealistic or overacted. In my opinion, the only consistent actor played the brother Salim, who was quite funny in several scenes (even if one of those scenes abruptly killed an emotional scene).A final comment is that the composer and director quite obviously did not cooperate for this film. Whenever background music is playing, the end transition never failed to be jarring. The music would stop or change in such a way that never failed to break any immersion I had in the film. It was very apparent that the director, composer, editor, etc. did not have any idea how to make a musical transition.",
            "review_date": "2019-01-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best family movie ever made",
            "content": "From the acting and cinematography, the story was stunning and heart touching from the first to last scene. Must watchable movie for everyone",
            "review_date": "2018-12-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Tends to exploit basic and common human feelings.Otherwise powerful.",
            "content": "I believe every Turkish Citizen living inside Turkey shall watch this film.It's a tragic thing,to watch is to be stumbled and lacerated continually yet it possesses some powerful scenes with serious implications.I must admit this film monopolizes on human feelings that are raw and the director expects a normal,social being watch it.That also means,tragedy orchestrated here doesn't uplift the soul(thus is hollow) and is nothing sublime if we run parallel to the definition of Tragedy put by Aristotle.Yet political overtones are real especially for the present day Turkey that faces brutal rule.Initial antagonism between the father and the son didn't seem very much convincing but this could yield something greater and penetrating in the later parts.In the end,I must admit one more thing.I CRIED.",
            "review_date": "2018-07-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Medicore",
            "content": "I felt really sad as this is supposed to be on the highlights of Turkish cinema. I understand every country has its own ways of making movies, own accents and they can be different than the standard American way. The acting is very childish and amateuristic. The overall feeling is over-sentimental and pathetic. The plot of the movie is interesting, universal and something everybody can relate to but the execution is very poor. At the moment of writing this movie is at place 132 in the top 250 and I consider it not to be in its place at all. Unfortunately this is very mediocre cinema, interesting to see out of cultural interest.",
            "review_date": "2019-03-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The best family movie yet, it's a masterpiece",
            "content": "One doesn't can do all the things, but the Director of this film has. What a realistic story man! What a story! I cried so many times while seeing this thoughEvery actor or actress did their best but the little boy could have done better i think. And the bonding Between a family! This film has shown so many masterpiece scene, and last one was is pure jam..Otherwise it's a feel good, must watch, intellectual family movie. It's my recommendation for all of out there",
            "review_date": "2020-04-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The new \"Life is beautiful\"",
            "content": "Çagan Irmak, famous Turkish director did it again. His own scenario looks the 1980's from the Egean side of Turkey. The plot organization looks simple, The father decides turning back to home which he left after he had a big argument with his father because of his political choice at the school. Then we learn that he is going to die and the drama leads to an endless crying session. The performance of the grand father (Cetin Tekindor), the grandma (Humeyra) and the father (Fikret Kuskan)is great.The latest Turkish movies and the performances of the Turkish artists getting brighter.As a result I want to call Babam ve oglum ( My father and my son ) as a new \"Life is beautiful\". The movie is great for both the young viewers and the old ones since everybody can share the similar feelings in their life.",
            "review_date": "2005-12-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Incredible",
            "content": "Very rarely can you find a movie that can make a person shed tears of sorrow one minute, then laugh out loud the next. This is a heart wrenching tale that will make people look at themselves and how they can better their own family units.Viewers will find that they will relate to one of the many stories within the movie. It's been a long time since a movie has made me feel this type of sadness and sorrow, followed by a warm fuzzy feeling right in my chest. An amazing film, with amazing people. The supporting actors complete what is truly an inspirational film. It has inspired me to be a better father and a better son. Watch this movie.",
            "review_date": "2020-05-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "excellent",
            "content": "The film was excellent. The atmosphere of Agean District, the accent people speak, the cars they drive ( Renault 12) was so original Particularly the performance of Cetin Tekindor (father) in having regret about the relations with his son after his funeral was outstanding. It was so effective that most of the spectators including me watching the film in the cinema could not help weeping. I think Sadik's son will be a great actor in the future. Because his performance at he age of 7 was remarkable. Fikret Kuskan's performance also meets our expectations. The beginning of the film I think conflicts with the quality of the whole film, the only performance that did not fit the situation was the performance of Sadik's wife. She was so artificial, her appearance of pregnant woman was not convincing at all. Fortunately, her role was short. Overall, it was the best Turkish film I have ever seen.",
            "review_date": "2005-12-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Relevant and touching",
            "content": "This is absolutely one of the best family movies I have ever watched. Actors did a good job in portraying as a family (the love and hate, the comedy) especially the kid (Deniz) that's why they are part of the Top 250 movies of all time.",
            "review_date": "2018-07-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "excellent",
            "content": "This movie is the most dramatic film I have ever seen, I advice you to see Babam and Oglum. Excellent actors were in this movie. There is another excellent point is that you can both cry and smile. Very interest emotion you can taste. The theme was very dramatic, There were a grandfather, a father and a son. I'm strongly advice you to see Babam and Oglum.This movie is the most dramatic film I have ever seen, I advice you to see Babam and Oglum.Excellent actors were in this movie. There is another excellent point is that you can both cry and smile.Very interest emotion you can taste.The theme was very dramatic, There were a grandfather, a father and a son.I'm strongly advice you to see Babam and Oglum.",
            "review_date": "2005-12-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very Good",
            "content": "A lot of people cried after watching this movie. I never cried, but it is a beautiful and touching film. But the little boy in the lead role was always repulsive to me, maybe that's why I never got emotional while watching the movie.",
            "review_date": "2021-08-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This Movie Has Now Gotten Its Place",
            "content": "In Turkey, the leftist and rightist groups were set against each other in the early 70s and later on these \"revolutionists\" and \"idealists\" not only killed each other but also engaged with the police in clashes of arms. Both groups went as far as to do bombing (or they say it was the work of the Western ideologies in play along with the secret state in Turkey). Then the Army staged a coup on September the 12 in 1980 and made thousands of arrests and significant amount of torture went on in the prisons... They even hanged 50 people that were found guilty(!) as they tortured hundreds of people (at least 171, proved) to death... And to this day the good people of Turkey suffers the consequences... Now, if we say that this movie tells one of the many stories of that era, it is absolutely true as \"the father\" had seen the torture and mistreat in the prison for what he had done nothing wrong... His heartbreaking story also reveals so many levels of the culture of Turkey and the bigheartedness of its people... Last but not least, if you ever claim that you have seen \"drama\", and your eyes won't just stop \"shedding tears\"; I kindly dare you watch this piece of art!.. I say it is gut-wrenching as well as mesmerising!.. So, no point in denying that the top 250 it belongs to!..",
            "review_date": "2016-12-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "the most emotional film",
            "content": "in the history of Turkish cinema one of the best film. while you are crying you see yourself you re laughing! film starts the coup times in Turkey one morning a baby was born in a day of curfew when military has management of government he lost his mother in his birth after all dramatic fast scene you see the main character he grow up he became five years old he live with his father who has not good healthy during the time curfew he was judged and he spend a lot of time in prison to be journalist a day father (sadik) learn that he is cancer and he will die he decide to leave his little boy to his family when they arrive to house of grand father you see traditional friendly family from Ege region after all conversation father and dad you see your family inside of film you feel all intensive emotion in your all cellular there is a moment in the film you stop breathe ...story go on with the relation son and grandfather ...",
            "review_date": "2016-02-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Movie Review Profits",
            "content": "Play Babam ve Oglum! It is fast and easy to view! A good way to spend your time. Be the best!",
            "review_date": "2019-08-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfect mixture of drama and comedy!",
            "content": "I had rarely seen a movie which makes you cry and laugh at the same time. This movie shakes your emotions. The crew of the movie is perfectly selected. All characters without exception fits the characters they play. And also the adaptation to the local language spoken at the west side of Turkey is very successful from the side of the players. The musics are also well embedded. It accelerates the flow of tears from your eyes. Wherever you hear these musics you will get emotionally dramatic after all. I can say that this movie is at the top 10 movie ever played in Turkey. The writer/director deserves the best comment.",
            "review_date": "2006-08-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "My father and my son",
            "content": "My father and my son is very important movie to me.Because I watched this movie with my father.I cried and I was very sad after the movie.My father and my son is telling real life.If you watch My father and my son, you will take napkins.Because you will cry.But some people didn't cry.Perhaps, you the one of the some people.I think Çağan Irmak is the best writer.He is making very beautiful movies.Now, I will give some information to movie.Sadık went to İstanbul for the university.Then on 12 of November,his wife dead but his son,Deniz born.Deniz was a little boy when he went to the farm of the Aegean.There was many adventure in this farm for Deniz.And there will be a lot of events this farm.You should watch this movie.I think,My father and my son will be best movie for you...",
            "review_date": "2012-04-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Slices of life that don't add up to much",
            "content": "This film has true-to-life feel that makes the viewer feel as if they are part of a great family reunion. I loved all the small moments with the child's imagination, the falling out and the happy memories. The acting felt naturalistic and joyous, without any melodrama. However, I don't think these moments truly cohered into a whole. While there was a compelling narrative arc that developed the characters and the family's backstory, it didn't amount to much for me by the end.",
            "review_date": "2021-08-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Do Not Be Fooled",
            "content": "Based up reviews on IMDb I purchased a copy of Babam Ve Oglum from Turkey with English subtitles. It was not, as hyped, \"One of the best movies ever.\" Instead, it was a poorly done, trite melodrama that I forced myself, and I mean FORCED myself to watch for about 35 minutes. I'll admit, one does take a chance when he buys based upon the recommendations of other IMDb users, but sometimes the risk is worth the reward. I suspect that the movie was \"ramped\" up by users in order to increase its appeal, and it certainly caught my interest due to its seemingly high ratings. But let's not be fooled. The $30 I spent for this title, yes $30!, was a complete waste of money. Usually I will try to resell those purchases I make on Amazon and Ebay that don't meet my expectations, but in this case the movie was so poor that I threw it into the trash, not desiring to foist the same foolish film on others. My warning: stay away from this movie at all costs, even if it is offered to you for free!",
            "review_date": "2009-02-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very Emotional, Sensitive and Excellent. True feelings of Human beings!",
            "content": "This movie is directed very nicely. It brings us to the true word of emotions. Made tears in the eyes. Deeply shows the feeling of people, effection in a family and how attached everyone In a family is. Every actor gives their maximum to be a success. Very well satisfies of this movie!! A must to watch! Spread love in the short term of the life.",
            "review_date": "2020-06-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "That's what it had to be",
            "content": "They explained the relationship between father and son extremely well, the movie is very close to perfect, but some scenes are ridiculous and boring, still this movie is great.The way the movie narrates what happened during the coup in Turkey is very accurate, besides, they wrote and shot very realistically about family relations and family members, and it is among the best films I have watched on this subject.Now let's talk a little bit about the plot of the movie. Our father, Sadik, returns to the place where he left the village house with his son Deniz and suffers a lot by remembering what his father said to him, but why he came back is for his son Deniz. To have a home.",
            "review_date": "2022-11-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "great movie..",
            "content": "Such a great piece of work is not something usual for Turkey. It's a touching film and as said before nothing to do with super-human powers, fantasy or effects. There are some scenes, especially on the second half, which makes you burst into tears without you realizing. The relations between family members and the things happening are so pure and so human that everyone watching the film finds something familiar with his/her life. The music playing at the end takes you somewhere else.( The soundtrack from Evanthia Rempoytsika- One more chance) I strongly recommend this movie to everyone!",
            "review_date": "2006-05-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A Real Masterpiece",
            "content": "Even if I'm a prejudiced person on Turkish movies, beyond some other great Turkish movies like Eskiya and Gonul Yarasi; \"Babam Ve Oglum\" is the greatest one i have ever seen. Not in only Turkish Movies criteria, above all else i have seen ever, I can easily consider this movie as my top five. The movie contains the exact Turkish family realities and anything \"Turkish\". The players in the movie are so flawless and perfect on their job; like Cetin Tekindor as a famous actor (I consider him as Antony Hopkins of Turkey) and the great actress Hümeyra are in the leading roles. Besides the players, the creative director Cagan Irmak is one of the greatest young directors in Turkey. A few cheer-up-scenes are not missing even though the movie affects the people with the very dramatic ambiance. This is a really must-see movie for the Turkish people and for foreigns, do not ever miss it if you find this movie somehow. It may be seen as i'm exaggerating the whole thing but i really think that this movie is a turning point in the Turkish Movie History.",
            "review_date": "2006-02-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This movie is one of the best ever made.",
            "content": "I can just say : \"Shame on you IMDb.\" You are scared about that this movie can be the best ever with our votes. So you just change your way of grading. Shame on you. This movie is wonderful. Just watch it and you will understand what i mean. It is better than the most of your top 250. But it is a Turkish movie and thats a reason enough to ignore it isn't it. I thought your site was one of the best sites on the Internet but now I see it is just a site that is not fair enough to accept that a movie made outside the US can be very good. I will never vote again for any movie here. Really I am very disappointed about you. You have to be honest. Just be that. This movie is unbelievable good. The actors are outstanding and the feelings i have had as I watch it makes me cry like i never did before. JUST WATCH IT.",
            "review_date": "2006-03-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The two loves between father and son deeply moved me",
            "content": "The two loves between father and son deeply moved me, especially when the old man finally opened his arms to make a hug gesture. Through the gaps and contradictions between father and son in an ordinary family, let us experience the warmth of the family, no matter how far away from home, I believe that people who wander outside, whether they have their own new home or not, The inherent sense of belonging can only be truly felt at home. The gap between children and parents is also easy to eliminate, because no matter which side, they are deeply in love with each other.",
            "review_date": "2020-05-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Nice family movie.",
            "content": "A very emotional film about a man who returns back to his village home with his kid. The father son relationship is beautifully captured.",
            "review_date": "2020-05-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Crying mess",
            "content": "At first I looked at it a littleSadik came back from drinking, and his wife reminded him that she could always give birth to the clumsy appearance of the scholar holding the child, and then laughed together, and then the moment of tension came in the middle of the night. The wife was awake and knew that she was going to give birth to Sadik. I could n't get a car on the road, and I could n't see a wife who was in labor and could n't move anymore. On the roadside, ssadik delivered his own baby until the next day when a soldier came to the truck and saw Mu Ran sitting on his face and The child is covered with bloodThe reason why I said that it was mulan because I only saw a man who was simply accompanied by his wife because the child was not on him, so he would go to drink in the middle of the night and wake up to rely on the hospital. It was just that he ran into a war and left him overnight Growing up facing an unacceptable situation of raising children independently and facing bereavementImmediately after the three-three-three-two people in the movie came in and kissed and left the child, the front teeth were open. I think it should be when the teeth were changed at the age of seven or eight. Then, Sadik took denniz and his parents' home on the road to let the child repeat the precautions he taught him. Do n't make grandpa grandpa happy when you 're unhappy. Then you can see the uncle. Do n't ask questions. Do n't fight with nearby children.When I arrived at my parents 'house, I was harvesting wheat. It seemed that a bunch of bundled wheat straws fell in the field and waited in the yard for a while. The family came back. My mother wept with joy. Thank God, my father turned away and went cold and ruthless.Sadik saw that his father would n't see him. Although he was prepared, he could n't help but turn around and would leave. Son 's sentence, dad, where are you going, stopped him, stood there, turned to look at his sonCome back for dinner in the evening. The family tweeted. The relatives came one by one. The elder brother and his family of four. The aunts dressed up by the nobles made a table. The only one who filled the table was eating. Only Dad went to the cafe to hide.The next morning, the curious little denniz walked to the stable under the guidance of grandma and heard that the horseshoes are all good I was restrained and turned to leave. At this time, I saw that Grandpa did n't hold back and said that the kid who was wearing was happy when he got an answer. Why did n't I see Grandpa saying that you were too far away? Ma is wearing iron shoes and the child asks the horse to have a name. If you know that the child likes to read comic books, the translation shown at this time is the uncle. The old father said how do you call me uncle, I am your grandfather and hug the child. I got up and went away. The old mother and sadik on the balcony saw a hearty smile and felt sent a breath of relief. Then I turned to the comic store on the street. It was originally to buy a book for my grandson. This old man pretends to be very caring and indifferent. I was thinking that Turkey and China have similar aspects .... I met Sadik and his brother who wanted to meet the original acquaintancessadik thanked him and told him why he came backIn the evening, the drunk sadik came back and asked his mother to take his son to stay with his brother for one night. He had important things to tell his father. He did n't want his son to see them quarreling.This time is the climax of the story. All the emotions are revealed here. Sadik said why he was given this name. The translation is faithful. His brother's name is safe. Are you afraid of not being arranged for a life back? Not begging for forgiveness, not admitting mistakes But he has been between the home and freedom for many years. He has a home that cannot be returned to, and he has been thinking of violating his father's arrangements. In the past, he said that he was back to give his son a room, a home, and a free home. Did you know that you can't do it?At this moment, I could n't cry, watching their conversation, tears,Behind is that the old father finally can't hold back, and seeing the fallen son shouting at his son, as if he were the only one in his lifeThe reason why this movie is good is that it expresses the relationship between father and son. It has a deep and heavy responsibility. Love through the relationship between sandik and his father and the relationship with his son. Every delicate emotional treatment makes people move. Can't ownIt 's really a good movie, but there are also bad things in it. When I was convicted and went to jail, the part was very vague. Finally, my lungs were sick and I died abruptly, and I was awkward. Little danniz was very dependent on his father, but he did n't have any memories or memories of his motherThis is a film focusing on expressing fatherly love",
            "review_date": "2020-05-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Only for drama lovers",
            "content": "The film focuses on a small peasant town, in the shadow of a large family. This brings out the humble and warm life of rural Turkey.The story has a politically adverse context, but despite its importance it is left in the background to focus on a family drama. This is perhaps a double-edged sword, because although it has its appeal, the doses of suffering, pain and anguish exceed realistic parameters, becoming highly exaggerated theatrical acts. Some characters even fall into caricature, further detracting from the film's credibility.The overall performances are good. The photography and direction are very well developed, taking the shots into creative territories. The soundtrack becomes repetitive, being one of the weak links in the technical aspects of the film.In general, this is a product that is aimed at an audience that enjoys tragedies and family dramas. If you don't look for these ingredients in an audiovisual work, it may not be your type of film.",
            "review_date": "2023-02-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Me and my father.",
            "content": "In fact, until Sadik died, Sadik's father did not understand why his son rebelled, why he left home without hesitation. To close the gap between father and son with Sadik's death is another form of tragedy. This scenario is still played out in this world, because in the face of death, any form of ethical conflict has to give way, and any form of competition is meaningless. Death is the most powerful force and the most powerless.My son and ISadik's affection for his son is reflected in many details and, of course, sometimes more of an expectation. In a sleeping next to their favorite cartoon books, the son of son seriously answer various questions, put out your cigarette before son came to the bedroom and to disperse the smoke, aware of their own will and his father the son off, while fighting repeatedly told his father to give his son a space, and so on, believe that these details are not deliberately. Sadik knows that the conflict between him and his father is difficult to resolve, so he has reflected his personal thoughts in his son's education: more independence and freedom, and try not to let his likes and dislikes have any influence on his son. Because Sadik understood: the maintenance of family ties, in addition to blood and love, more important also need their own independent space. The premise of this space should be mutual understanding and non-interference.About the movie itselfIt's a film that impresses a lot of people, but it won few awards at the festival, with only three small prizes at local festivals. (one is for public opinion and the other two are for sound), which I think may be the reason for the unclear theme. From the title, the theme should be the family, the love between two pairs of father and son, grandpa's love for his grandson. The subject is clear and full of ink. Another theme is freedom, the choice of values, the conflict of values between father and son. The third theme is country and nation. At the beginning of the film, he fails to call an ambulance and dies the night his wife is due to give birth, all because of a coup that has crippled the entire medical system. So, Sadik later told his friend, \"I thought I was fighting for my country, but the country didn't care.\" Reflection on the government is also one of the important themes. Because the theme is a bit too much, just dilute the film most want to express things.",
            "review_date": "2020-05-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfect",
            "content": "This is the best film I have ever seen. I watched 3 times in cinema, but still feeling bad and spirited as the first time..Sadik, and his father and all others are fascinating. This film should be in the first top 3 of the top list for drama. Pls. pay attention and watch this film. You must feel lucky when you watch this film.Also I have a few word about little Deniz.. I want a son who will be like this child.. Thank you to Cagan Irmak for this unique trace.We will wait for new projects of Cagan Irmak. Many thanks again, Rasim",
            "review_date": "2006-02-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Easy and deeply impressive",
            "content": "Çağan Irmak is the face of the drama genre of Turkish Cinema. Always a simple narrative films. But deeply affect us. Because the handling is as simple as the fact of our lives. We see ourselves in the mirror while watching his movies in theaters. As all Çağan Irmak movies Babam & Oğlum has managed impressive as all this its is deeply.When the period is based on the script of the film we see the stressful times in Turkey. Family ties. Family relations in the Aegean region.At the end of the movie we see death of the father and we sad. But also we saw grandchild finally getting his grandfather. Also we are happy! That is what melodrama.",
            "review_date": "2016-03-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Emotional and very heartbreaking movie",
            "content": "It was a real emotional and heartbreaking movie about a father and a son relation,through the watching movie in couple of scenes I couldn't control myself and it made me weep. sometimes as father you should make right decision but you can't push your child very hard cause it could have an opposite effect. this movie has a great story and almost with good ending. the actors and actress were acting just perfect like it was part of a family real life.",
            "review_date": "2020-09-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The father son relationship is beautifully captured.",
            "content": "A very emotional film about a man who returns back to his village home with his kid.",
            "review_date": "2020-09-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A simple yet complicated life",
            "content": "This movie is setup like some regional Indian movies except there are no songs to dampen the mood. It is a beautiful depiction of simple rural life in Israel following a contrast in city life that is mixed with turmoil and conflict. It covers three generations of a family coming together.The movie depicts how you can never forget your roots or stay away from it and whatever happens life comes full circle. You can each take your own meaning out of the movie, the father may regret his actions as his heart is filled with his childhood memories or it may just be a recollection of his simple life. The sons imagination runs wild and is amazing to behold while the grandfathers stubbornness stays grounded in reality.It is a nice family drama and the movie captures all of it beautifully till the end.",
            "review_date": "2020-03-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sadik and Salim",
            "content": "\"My name is Sadik, my brother Salim. Have you been so scared of us, have you wanted to give direction from the beginning?\"It's not what his father hoped. Sadik became a child who rebelled against the meaning of his loyal name. Salim, on the other hand, is healthy, and contrary to the meaning of his name, the son who has a bit of understanding. What a meaningful movie. What deep.",
            "review_date": "2020-05-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Magnificent!",
            "content": "Director Cagan Irmak has already proven himself in Turkish cinema.I think that's his best film.\nOne of the most epic Turkish drama films I've ever seen. Maybe even the best.\nThe acting and cinematography was nice.",
            "review_date": "2019-06-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Must-see!",
            "content": "Being in top 250 is not a coincidence. Extremely emotional. Sadness, happiness, love, family relationships, in a brief, you can find every emotion that we have in the movie. Well acting, good screenplay, enough picture. One of my favorite.",
            "review_date": "2018-11-12",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Never Felt Like This In a Movie",
            "content": "This is the best Turkish Drama I have Ever Seen. In fact this is the best movie of Turks. Story, Acting, Music etc. everything was perfect. It is about 3 generation. Father, Son n Grand pa. Most of the theatre cried many times and in the same scene we suddenly start smile sometimes they were more than smile. This is my reaction in a scene :) => :( => :(( => :(\" => :)I would like to celebrate Cagan Irmak and all the actors even children Turkish Movies are commonly made for money but this is not one of them but this will be the most movie ever watched in Turkey this year. I think this is also better than Gonul Y arasi which is a nominie for Oscar nominies.",
            "review_date": "2020-03-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A must see Movie by all family Members",
            "content": "the movie tells the story and the suffering of a Turkish rebellious left-wing journalist who left his village where he used to live long time ago and went to Istanbuli never thought the Turkish drama will be as good as thatthe movie staff perfectly demonstrate the real live in village, family, relationships, laugh, grieve and lovedespite the great performance in this movie, this film has a great aims and facts everyone should understand about lifethe movie is suitable to be watch by all family members and i recommend you to watch it with your parentswhile watching, some scenes may recall sad memory of yours so be alarmed, but i guess it's OK after all",
            "review_date": "2017-07-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Fell off my chair laughing after around 90 minutes",
            "content": "The overacting.and clichéd melodrama just became too much. I'm not sure why this is being hailed as some great cinematic masterpiece, because it is anything but.",
            "review_date": "2021-08-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Touches deep inside the soul",
            "content": "Son, father and grandson - the relation of this three generations with the family was knitted very exquisitely by the producer Cagan Imrak. Big thanks to him for this masterpiece. There are not many directors who could portray this type of intense realism into movies.\nStanding ovation for the cinematography! There are many subtle details which can only be understood by multiple watching. Special thanks to Evanthia Reboutsika for her outstanding music composition for this movie. Her music can stir all kinds of emotions.\nThe movie was a good example of character development. Especially pleased with the acting of the kid (Ege Tanman). He was just mind blowing. Hussain Aga sometime looked like Turkish version of Vito Corleone. At the time when Hussain said '.... if I stood like this, Nuran if I stopped Sadik, if I hugged him like this......' - this was probably one of the best scene in the history of movies.\nThere is no happy ending for everything in life. Like Deniz, it's important to accept reality - no matter how hard. It's necessary to move on. Some movies can portray this truth artistically. That's how they become milestone movies. This is one of the best Turkish movie I've ever seen.Don't just see, experience it.",
            "review_date": "2019-06-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfect",
            "content": "Turkish drama film You may be able to swim in a quiet river without waves or swim in a waterfall and do not pursue the waves The hero was swimming in the ocean amid the tsunami The film tells the sad story of a young man who gave his life for the press and his country, and during the coup in Turkey 1980 come symptoms of the situation on his wife and forced to descend in the height of the crisis and on the night of curfew there are no ambulances and cars, forced to move to the hospital fails the husband and tries to generate in the street to save the situation, and his wife falls dead after birth and keeps his infant son becomes sick and remain sedentary next to his wife find military police officers are arrested in the breach of curfew breach and is being interrogated by the military police, which constantly attacked his policy as a journalist to be imprisoned for a period of Time to come out of He was imprisoned to find his son who was taken care of by a neighbor and received his son and he remains to find him after the successive slaps of life so he decides to return to his family in the countryside. To his family and leave the country and his father's estrangement to marry the mother of his son, who died and works in what does not love his father and now surprised the hero",
            "review_date": "2020-03-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best Turkish movies I have ever seen , perhaps the best.",
            "content": "A great film by Cagan Irmak.Before watching the film i was suspicious about the film. should i watch or would it be waste of time?.At all this is a Turkish film.But i am so glad that i have seen that Turkish Producers and directors also can make excellent movies. This is the second film of Fikret Kuskan I have seen , and i think i am being a fan of him.Greaat acting , just as real life.Also the other ones acting in film was great.Humeyra,Cetin Tekindor and the child.While watching the film you are not only watching , feeling living those times.If this film was an Hollywood production i am sure Cagan Irmak an Cetin Tekindor would be able to win Oscar.But unfortunately they give Academy Awardas only to US productions...",
            "review_date": "2006-02-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "True 10/10",
            "content": "No movie has ever moved me as much as this one! I cried like a hysterical mad woman. The acting is superb, the little boy is amazing !",
            "review_date": "2020-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Don't miss any moment with beloved ones, never!",
            "content": "Best movie and script of all time. This is undoubtly true for most of the watchers of rhe movie.",
            "review_date": "2019-05-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfect..",
            "content": "\"Men don't cry\" a Turkish Proverb.Hovever every men can wail loudly while watching this movie. After watching this movie you will feel the urge to hug your father or your son. Çagan Irmak depicted the time of crisis of Türkiye between 1960s an 1990s perfectly. In my opinion Çagan Irmak is the best director in Türkiye and he will be one of the well-known directors in the World. Also the cast of this movie performed well. Jokes and melancholic element are perfect balanced. On the other hand; your psychology can be underover because you can cry and laugh at the same time.I want to congratulate all these people who helped to film this movie. Some good things can be in Türkiye. You must see this movie.EDIT: Turkish voting madness crossed the line.. This film's avarege is now 9.0. I think it will be over it.. It's nice for Turkish Films but this film can't be better than GOD FATHER.. Think two times giving 10 for this film.",
            "review_date": "2005-12-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "it is worth to see- a family tragedy",
            "content": "The best Turkish movie I have ever seen. You will taste all kinds of feelings at the same time. The relationship of grandfather father and sun is illustrated excellently. Also the structure of Turkish family is described well. The local accent is used very well. Also the scenario is well structured and reflect the Turkish culture well. The beauty of Izmir is also worth to see in the movie. This movie will make a revolution in Turkish movie sector. I hope the director of movie will be a world wide director soon. If you liked this movie see the director's other movie \"Mustafa Hakkinda Hersey\". I will be looking forward to new creative movies...",
            "review_date": "2006-01-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "True Story",
            "content": "I Love This Movie Because Of True Relation of one father and son i strongly recommend to every won please watch at least one time you must proud of your father and son bounding",
            "review_date": "2019-05-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The story is very deep",
            "content": "Its story is very deep,after as real life. Çetin Tekindor's acted was represent. More again, when Fikret Kuskan aka Sadik was dead. Visible he was hurt with Sadik's death. Its film is as puzzle. First, when Deniz was born. Not hot, not rain, suddenly Sadik was prison. After more far, I know the reason Sadik was prison, because his activity as journalist. Can accepted mind. Two, after death Sadik, when Deniz tried video camera from his grandpa. This really dream or not. For this,I can't more speak.Each film be a goof. The direction of camera when Sadik apologized with his dad, made a dizzy. Better that, after Sadik fainted, the camera was fading out. When Huseyin knew his son was fainting, directed the scene was fading in. But all the story is very good.",
            "review_date": "2016-01-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "touching",
            "content": "you will have a lot of fun, an also tears in your eyes... it's a touching film about family, son-father relationships and the political history of Turkey through 80's. Character dialogues and family scenes are so natural that it's inevitable to appreciate Irmak's success. Actor's performances are also clearly outstanding! The film talks about a close history of a country, by perfectly harmonizing the historical and political history with a totally personal and emotional relationship between sons and fathers. In Turkey, the film made such a great success that for months, it was really hard to find any tickets before reservation. Cagan Irmak is a great director who manages to make the audience feel the warmth of relationships and life, by creating natural scenes of village and city life, affairs between people and struggles of human with himself or outside.",
            "review_date": "2006-01-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "mopey story and family relationship",
            "content": "On an individual basis, I like this movie because it includes everything about the family relationship as dram, sadness, humorous, compassion, hatred which are actually explain family relationship. Besides, movie starts from 1980 Turkish coup so we can learn Turkish history as well as we can understand difficult situation on that time in Turkey. Also, we can enter the child's world who is a motherless. I do not know someone who did not cry in this movie. I remember my grandpa and my father when I watch this movie, I remember my childhood with amazing soundtracks. Both \"my father\" and \"we will meet again\" songs are so emotional and mopey and these songs help me to trip down memory lane because all childhood memories are actually mopey for me.",
            "review_date": "2016-11-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Turmoil indeed",
            "content": "Man this was on the verge of being one of the best movies ever made and then it just stumbles to a weak climax in the end. OVerall i still really liked it but it had more potential. The story was awesome",
            "review_date": "2019-07-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A common feeling to many in this world.",
            "content": "An excellent film, not extraordinary, but it appeals to a feeling that many of us who belong to countries that have suffered dictatorships have: the intense pain inflicted on thousands of families with loved ones who have disappeared, tortured and massacred in the most cruel way. Fortunate are those who have not suffered closely.\nBy far I liked Salim's role more, apart from the boy whose acting is compelling. The other aspects of the film are of good manufacture.\nPD: Translated with google, you shoul enable posting in other languages.",
            "review_date": "2020-07-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Sorry, But I laughed!",
            "content": "JUST for those who KNOW why Godfather is a great movie: this movie was amateur and stupid, So exaggerated. Please don't waste your time as I did. I encourage you to watch \"Children of Heaven (1997)\" instead.",
            "review_date": "2019-02-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Live Life on Screen",
            "content": "The people are so original like they are really living on their life. Makes me cry through out the movie.",
            "review_date": "2020-04-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I watched the movie crying.",
            "content": "The script and acting are spectacular. I don't know how the script was written, but it affected me a lot. Especially with these acting talents, it was a great film. I'm one of those people who watched the movie crying. It's been 1 hour since I saw the movie, but I'm still under the influence. At the end of the film, I thought of my father when Sadik told his son, \"When you grow up, you won't need me.\" Even though I'm growing up, I need my dad. I lost him at a very young age, I want him to recognize me and i want to recognize him too... every time. But it is impossible... I would like to thank everyone who contributed.",
            "review_date": "2023-01-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Par beyond Excellent",
            "content": "first of all i don't understand Turkish but with the help of sub i watched it simply its the best movie i have ever watched and i assume it will stay the same until end of my lifetime !! every single character in the movie was so perfect i was speechless story line , screenplay , direction , background music , omg end point the three main characters A MAN AND HIS FATHER AND HIS SON all three character actors have done beyond imaginable ... his son i assume maybe 4 or 5 not sure gosh man .. i have watched movies in all genres Thriller : memories of murder (Korean) TO the body (Spanish) TO Triangle (English) Drama & Gangster : Shaw shank Redemption to Godfather Family : life is beautiful to Forrest gump Serial Killer & Horror : The silence of the lamb to The othersbut Babam ve Oglam (my father my son) beats it all don't miss the opportunity, its pure class in many ways as you may take it",
            "review_date": "2017-04-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Best",
            "content": "\"When people grow up, have they shrink your dreams?\" Babam ve Oglum is the movie for who say i never cry. This is not just a movie, This movie is as real as real life. The film is so emotional. You will be both happy and upset when watching the movie, because you will understand the value of life, decisions, family. I have watched a lot of movies but never felt that much. This movie really manages to connect with the audience. You should don't think, you just watch.",
            "review_date": "2017-06-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Umm..no",
            "content": "Am I the only one here who finds this movie pathetic?\nFull of cliché and overacting.. total waste of time. Sorry..",
            "review_date": "2019-01-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "harikasin cagan!!!",
            "content": "an unexpected film from a brilliant director! his series are also incredible but this film is his masterpiece! this film touches to the peoples hearth, it makes them happy, sad and it makes people cry. director knows how to touch their hearts. maybe in ten years time he will be a \"legend\"! every scene is thought with details, for example with clothes or peoples speech or songs... these details are also makes people happy! because they can see their memories in these details. a detailed film from a young and an intelligent director. also the actors are amazing. this film looks like a \"movie lesson\". are they acting in this movie or are they living in this movie?",
            "review_date": "2006-07-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An amazing film that shows coup and post-coup issues!",
            "content": "Babam ve Oğlum (My Father and My Son) shows the post-coup relations between people and in families in Turkey. In Turkey, on the countryside having higher education have been seen as an act of communism by many during the 50s and 60s. This brought families, and family members against on another. The film mainly focuses on the grudge between a father and son which lasts for many and you can see those in many Aegean towns; people can really hold on to their grudge for years, even if it is something not really that important. Combined with where and when the story goes on and with really good acting and crew, this is a really good film worth sparing your time.",
            "review_date": "2017-03-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great Actor ; Cetin Tekindor and Very Good Movie for Turkish Cinema",
            "content": "Classic Turkish Cinema Style, different from Hollywood, far away from commercial tags, and more talented about showing the feelings in reality. there is no such pre-rendered emotional attacks , and yes sometimes -specially in comedy parts- so many absurd acting and personalities are popping up, but it is so natural end embedded into story and characters very realistic and pretty.First of all, yes, ' like the movie in generally but there is no such a thing that must be rated 9 or 10. if there is anything perfect in the movie that was acting power of Cetin Tekindor. Final improving scenes and the dialogs were perfect. Cagan Irmak is also good director and writer but there is no new story about early 80s in turkey.It deserves 8... You should watch it if you really like the humanism,emotional stories and movies which tells a story from a specific era in the history. Don't MISS IT!!",
            "review_date": "2006-02-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Masterpiece of Turkish cinema",
            "content": "When I started the movie I had not good feeling about this movie because of Turkish series and I guessed maybe this movie is like them, but it is not. It touched my soul! Made me cry and made me laugh.I really love Deniz!",
            "review_date": "2022-07-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A masterpiece that every man should watch before he dies.",
            "content": "\"My Father and My Son\" is a movie that presents its audience with an emotional and thought-provoking story. The plot revolves around the father-son relationship and depicts this relationship through a journey filled with challenges. Particularly, the psychological state of the characters and the impact it has on their relationships stimulates thought among the viewers. Additionally, the music and visual effects of the film also create a captivating atmosphere that draws the audience in even more. Overall, \"My Father and Son\" is a production that will win the approval of audiences as it presents a sentimental and contemplative story.I quoted the words in the title from the yt comments of the movie, and it's a comment I totally agree with. It is a must watch movie when you are a child, a father or a grandfather. When I told a friend that I was going to watch the movie, he said, \"Are you sure? Don't burn yourself.\" aforementioned. And he was right. I was very upset watching the movie, but an excellent masterpiece is worth it.",
            "review_date": "2023-02-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Mediterrenean way of life",
            "content": "This is a movie that has a crying guarantee on almost anyone who would watch it. It portrays a family in turkey in the early 70's mainly concentrating on the relationship between the dad and the son.It is by far the best Turkish movie i watched, and i really did not like most of them. This one is definitely in my top 10 best movies ever made.The drama and comedy genre is so perfectly mixed that many times one will get the feeling of laughing and crying all at once.If you have not watched this movie yet, get it. No matter what you will like it. Actors do a very good job and the director's is one which is not even one to mention, just EXCELLENT.This movie will relate to everyone and will give you an emotional vibe.",
            "review_date": "2019-07-30",
            "lang": "en",
            "source": "imdb"
        }
    ]
}