{
    "rating": 1.1,
    "release_date": "2015-05-22",
    "num_reviews": 208,
    "genres": [
        "English"
    ],
    "summary": "To punish his prisoners, a sadistic warden (Dieter Laser) and his right-hand man (Laurence R. Harvey) hatch a scheme to suture 500 inmates together.",
    "reviews": [
        {
            "content": "While being occasionally funny and still having good acting, Final Sequence still suffers from the same extremity problems that that Full Sequence accelerated upon. But to it's credit, it does attempt to stray away from the excessive brutality and instead tells a surprisingly amusing parody of what has come since.",
            "review_date": "2023-04-02",
            "source": "rt"
        },
        {
            "content": "La trilogía concluye con esta entrega que, más que ser de horror, es más bien un thriller de humor negro. Es grotesca, fuerte, asquerosa y divertida. Tiene muchas escenas turbias y explicitas que me impactaron y me hicieron reír mucho. Tom Six quiso terminar la trilogía con mucho, aunque con algunas limitaciones. Al menos el film se torna políticamente incorrecto al recurrir a ciertos estereotipos en los personajes, dándole a esta cinta un humor estilo South Park. No es el épico y horroroso final que esta trilogía pudo haber tenido, pero es entretenida y buena para pasar el rato divirtiéndose con sus escenas fuertes y asquerosas. Mi calificación para esta película es un 9/10.",
            "review_date": "2023-03-15",
            "source": "rt"
        },
        {
            "content": "Many of the same actors as the first two, the same overall theme but other than that this is a far cry from its predecessors.  This one was difficult to watch, much moreso than either of the first two, and just felt cheap and gimmicky.",
            "review_date": "2022-08-24",
            "source": "rt"
        },
        {
            "content": "Same idea in a jail, more people, more disgusting and with a little touch of comedy with the players.",
            "review_date": "2022-05-06",
            "source": "rt"
        },
        {
            "content": "I actually really enjoyed this. The movie covers political moral bankruptcy and the extent that the government will go to save a couple of extra dollars, even if it will create far more problems for the public. Eric Roberts is a wonderful asset to the film and he plays the mayor character with integrity and power. Highly reccomend.",
            "review_date": "2021-12-22",
            "source": "rt"
        },
        {
            "content": "racistas............",
            "review_date": "2021-10-05",
            "source": "rt"
        },
        {
            "content": "In the interest of full disclosure, let me preface this review by saying that this was one of the few films I have ever shut off before finishing.  Ironically, it wasn't even due to any violence or anything like that.  The main character--the prison warden--literally shouts all of his lines in the most annoying matter possible.  It's to the point where its not only difficult to understand what he's trying to say, but you don't care either because all you want is for him to shut up.  I didn't even make it to any of the \"centipede\" parts because it was literally THAT bad.",
            "review_date": "2021-07-05",
            "source": "rt"
        },
        {
            "content": "A lovely family friendly film, would recommend what a beautiful finale, warning you will need tissues TW emotional.",
            "review_date": "2021-05-16",
            "source": "rt"
        },
        {
            "content": "Wow. A complete junk script idiotic boring and annoying characters.",
            "review_date": "2020-10-14",
            "source": "rt"
        },
        {
            "content": "Some movies, just don't need to be made. They just don't need to exist, this is all of those movies crammed into one.",
            "review_date": "2020-09-16",
            "source": "rt"
        },
        {
            "content": "The worst film I've ever seen.",
            "review_date": "2020-09-07",
            "source": "rt"
        },
        {
            "content": "An excellent family flick",
            "review_date": "2020-07-28",
            "source": "rt"
        },
        {
            "content": "Though it might be something utterly disgusting and dreadful for most viewers, Six's faihful followers will find something compelling and quite entertaining in HC3. I'm pretty sure Six did it all on purpose: First Sequence was intended to be a cult film, Full Sequence to be a larger-scale horror movie inspired in the previous one, and Final Sequence to be as absurd and wild as possible, with the same actors, the same centipede-growing logic and a clumsy director cameo. Personally, I think Final Sequence is not to be taken seriously, as I laughed over and over with the exaggerated acting and the surreal violence... contemplating a director paroding himself, just hilarious.",
            "review_date": "2020-07-25",
            "source": "rt"
        },
        {
            "content": "It's fortunately not as gory and disturbing as its predecessors, but with poor production values and cringy overacting, it is a terrible conclusion to an already terrible trilogy. Moviegoers demanding intelligent, original, and scary horror movies that don't fall on the clichés of the genre must stay away from this franchise as far as possible.",
            "review_date": "2020-05-24",
            "source": "rt"
        },
        {
            "content": "You know, the first film was genuinely horrifying. I've never been a fan of these types of \"disgusting\" movies. I like to be scared, not disgusted. And no, I dont consider torture porn to be horror. Sorry but I dont. But despite that i did think the first two films had some merit. This film however is far from anything redeeming. It's pure trash. Tom Six aught to be ashamed of himself. The rape scenes are also terrible. There is a place for those type of thing in film if done properly. With a message. Like Evil Dead (1980) with the tree rape being a metaphor for nature being it's own force. But this has no redemption it's just nasty. \n\nAll in all, stay away. Stay far away. HC3 is an exercise in irredeemable disgust... nothing to do with horror or good film making.",
            "review_date": "2020-02-24",
            "source": "rt"
        },
        {
            "content": "They actually made it worse somehow. ",
            "review_date": "2019-10-27",
            "source": "rt"
        },
        {
            "content": "somewhat better than the previous one. no such violence as it is in part 2.",
            "review_date": "2019-09-08",
            "source": "rt"
        },
        {
            "content": "Between an abundance of shouting from Dieter Laser and severe violence, the final sequence of The Human Centipede doesn't offer more than the other movies, but still manage to be vile and terrifying in his own ways. I thought that regrouping the two antagonists of the previous films (but in different roles) was an original idea and brought a sentiment of comfort for the one that saw the preceding movies. Although, I would say that Dieter Laser doesn't have the same presence as his previous role since he's always trying to over-act his character. What I really liked about this film is the way Tom Six implanted some dark comedy and some crazy characters that will make you chuckle even though you are ashamed of it. Concerning the gore and the disturbing scenes that The Human Centipede is known for, I would say that this third instalment is probably one of the least disgusting, but don't get me wrong, it is still sickening. In conclusion, I would say that this trilogy is something that I'm not proud I've watched, but still offer something that you'll never see anywhere else. Congrats Tom Six, you've made me seen things that I can now unsee.",
            "review_date": "2019-08-19",
            "source": "rt"
        },
        {
            "content": "I really like this film actually. I though it was a funny movie, not the best one in the series but I think it's a good movie for what it is. It's a movie that you are not supposed to take too serious. ",
            "review_date": "2019-06-19",
            "source": "rt"
        },
        {
            "content": "Best movie ever funny dark comedy",
            "review_date": "2019-05-02",
            "source": "rt"
        },
        {
            "content": "Rly disgusting but not that bad ig ",
            "review_date": "2019-03-28",
            "source": "rt"
        },
        {
            "content": "This is my favorite family movie to watch with my kids. I like to eat gummy worms while watching this. The best part is my dog loves watching it too.",
            "review_date": "2019-01-07",
            "source": "rt"
        },
        {
            "content": "\"The Human Centipede III\" é simplesmente lixo. Não percas o teu tempo a ver isto. Vê só o primeiro filme.",
            "review_date": "2018-11-04",
            "source": "rt"
        },
        {
            "content": "\"The Final Sequence\" does not mean that it is the last film, in the order of the trilogy. This is the first, in the universe of previous films",
            "review_date": "2018-09-11",
            "source": "rt"
        },
        {
            "content": "Este Intento desesperado por exprimir un Titulo Reconocido resulta en una mediocre y patética Cinta que Abusa de todo tipo de sentido común para justificar un film al cual nadie pidió.",
            "review_date": "2018-08-23",
            "source": "rt"
        },
        {
            "content": "Absolute dogshit. I'm embarrassed to admit to anyone that I've seen it.",
            "review_date": "2018-07-23",
            "source": "rt"
        },
        {
            "content": "we must be honest this film is a mockery for both the public and the general of terror, it has so many flaws and so many ridiculous and poorly done things that deserve to be mentioned, bad performances, horrible plans, a bad script, special effects and mediocre makeup and horrible, the idea of a human ciempies sounds interesting and sickly and if the ubiran executed better the idea could have been a cult movie, we are lucky that this is the last, and of course I do not recommend it for anything in the world cost me to see it It is disgusting and so bad it is.",
            "review_date": "2018-06-30",
            "source": "rt"
        },
        {
            "content": "I would rather sit through a 3 hour night class about the history of paper than watch this.",
            "review_date": "2018-04-29",
            "source": "rt"
        },
        {
            "content": "I gave it 20mins before giving up. The acting is just terrible.",
            "review_date": "2017-12-28",
            "source": "rt"
        },
        {
            "content": "What's the point of this movie's existence?",
            "review_date": "2017-11-17",
            "source": "rt"
        },
        {
            "content": "Human Centipede 1 & 2 were fresh, shocking movies that defined modern torture films. The first movie in particular is unsettling and dreamlike and is a fantastic example of true horror.\n\nThe third one is the Sharknado of horror. It's silly, boring and 1 hour 30 minutes of incoherent ranting. You don't get any struggle for escape or plans to beat the bad guy, just a few shots of a CGI centipede. It's on par with amateur student films. \n\nThe final scene mirrored my general reaction to the film. Screaming in agony at how bad it was.",
            "review_date": "2017-10-26",
            "source": "rt"
        },
        {
            "content": "just stupid couldn't get threw it but not because it was gross but just boring.",
            "review_date": "2017-10-01",
            "source": "rt"
        },
        {
            "content": "Ok we have reached a new low in horror movies I mean come on Tom Six why can't you just do a Human Centipede movie right, I liked the direction you were going with this movie by making it just a disturbing comedy movie but this movie isn't even funny it's annoying and stupid though, this is the worst Human Centipede movie in the trilogy just don't watch it.",
            "review_date": "2017-08-20",
            "source": "rt"
        },
        {
            "content": "Zero stars. I couldn't even watch the whole thing. Not sure why I even tried.",
            "review_date": "2017-08-02",
            "source": "rt"
        },
        {
            "content": "At this point the director of the franchise is cashing in on the name Human Centipede. By all means watch this is you are into low budget films with laughable acting that complements a hastily written script.",
            "review_date": "2017-05-07",
            "source": "rt"
        },
        {
            "content": "Un de mes gros péchés cinématographiques: je suis un fan de body-horror et The Human Centipede 3 ne m'a certainement pas déçu de ce côté! Mention spéciale à Dieter Laser et son rôle à la fois délirant et cartoonesque, je m'en souviendrai longtemps!",
            "review_date": "2017-05-05",
            "source": "rt"
        },
        {
            "content": "Absurd and forgettable. It's kinda like the feeling you get when your stuck in a car for a few hours and have to go to the bathroom only to find when you get home to the toilet that it's just a lot of intestinal gas. That is this movie.",
            "review_date": "2017-04-22",
            "source": "rt"
        },
        {
            "content": "I Only Like To Watch The Theatrical Version On DVD And At The Movie Theaters And The Director's Cut Only On DVD.",
            "review_date": "2017-04-21",
            "source": "rt"
        },
        {
            "content": "Six's third installment is vile and fails to entertain. The film's most disturbing scenes are when it's only female character is repeatedly brutalised. The graphic violence, however is not the worst part of the film. Dieter Laser's screechy performance is very irritating. I don't know how I got through the whole film.",
            "review_date": "2017-04-21",
            "source": "rt"
        },
        {
            "content": "La ultima y la peor de una de las peores trilogías de toda la historia del cine. The Human Centipede 3 parece una parodia; intenta ser increíblemente grotesca y políticamente incorrecta, pero el resultado final es el mismo que el de sus anteriores películas solo que mucho peor. The Human Centipede es tediosa, aburrida, con pésimos actores (Dieter Laser es uno de los peores actores que he visto en mi vida) y con una pésima historia. No pierdan su tiempo en esto... mejor no pierdan su tiempo en esta trilogía de mier%!... 0 estrellas.",
            "review_date": "2017-01-29",
            "source": "rt"
        },
        {
            "content": "absolutely terrible. worst film i have ever seen.",
            "review_date": "2017-01-22",
            "source": "rt"
        },
        {
            "content": "Ojala los padres de Tom Six no se hubieran conocido para evitar que naciera y así evitar que creara una de las franquicias mas atroces, mas horribles y asquerosas en la historia. Es una verdadera vergüenza para el cine. No la vean ni estando drogados. Es lo peor de lo peor.",
            "review_date": "2016-12-11",
            "source": "rt"
        },
        {
            "content": "When I'm walking free, I'm gonna stab you in your eyes.",
            "review_date": "2016-11-24",
            "source": "rt"
        },
        {
            "content": "This movie was slightly more tongue in cheek (no pun intended) than the previous ones.  It is still a very messed up movie, but it had a greater sense of humor about itself than the others did.  Don't get me wrong though, this is still an awful movie with even more awful acting.  I just appreciate that it wanted to make me laugh more than it wanted to make me throw up.",
            "review_date": "2016-11-05",
            "source": "rt"
        },
        {
            "content": "Tom Six has no idea what structure, pacing or taste is, and he clearly wanted to make the vilest piece of garbage ever - which it is safe to say he accomplished -, although it would have been cheaper and more effective for him to look for therapy instead. (Zero stars)",
            "review_date": "2016-11-05",
            "source": "rt"
        },
        {
            "content": "Dieter's performance is excellent, but takes way too long to get to any centipeding. Much more campy than the first.",
            "review_date": "2016-09-19",
            "source": "rt"
        },
        {
            "content": "This movie sucked more ass than the people in the human centipede itself. Could have gone by faster and could have been a good movie. But the main actor sucked so much. I couldn't take him seriously. Idk how they made a third movie. Don't waste your time.",
            "review_date": "2016-08-30",
            "source": "rt"
        },
        {
            "content": "This movie is just....ugh. I guess that is what the human centipede was aiming for but it was more disturbing than disgusting. Everyone was crazy but no one seemed to notice.",
            "review_date": "2016-08-13",
            "source": "rt"
        },
        {
            "content": "the movie was mostly based around Bill being an ass, rapist, and shooting anyone cause he please so than it was about the Human Centipede",
            "review_date": "2016-08-05",
            "source": "rt"
        },
        {
            "content": "this is already the worst trilogy in history and i have yet to see the second movie. In the begining it showed minor promise. It gave me a slight chuckle once or twice and then it bombarded me with shear hatred.   the comedy took a turn for the worst when it exposed me to grossout far worse than any dennis dugen film, the characters are either cutouts, tom six, god awful, or bill boss the worst character on any media i've ever seen. the ending is so frustrating that i actually wanted to cry, i felt so sympathetic to murderers for the first time in my life which is why this film is worse than where the dead go to die. The production values are better but the unlikeability of this film is unprecedented. i cant believe i have to give it half a star.",
            "review_date": "2016-07-23",
            "source": "rt"
        },
        {
            "content": "I liked the first one but this one is absolutely atrocious as if it were some depressed 8th graders job to write this final sequence of this trilogy with such painful acting and as stupidly nonsense as this film can be it will disappoint you no matter how much you like any type of movies",
            "review_date": "2016-06-27",
            "source": "rt"
        },
        {
            "content": "This movie was boring as shit and it is definitely the worst out of all 3 Human Centipede movies. 0 stars.",
            "review_date": "2016-06-13",
            "source": "rt"
        },
        {
            "content": "Awful film. No story. Just complete gore",
            "review_date": "2016-05-20",
            "source": "rt"
        },
        {
            "content": "It's not that it's too gross, or too violent, because it is. No, the problem is that it just plain-up sucks on every level. At least the first human centipede pokes a bit of fun at the horror genre, and 2 had an eerie presence that kept it moving forward. Six and his Final Sequence seem to be fine on shaming everything they've come so hard to accomplish. Utterly terrible on every level.",
            "review_date": "2016-05-05",
            "source": "rt"
        },
        {
            "content": "Truly a feel good movie for the whole family.",
            "review_date": "2016-05-03",
            "source": "rt"
        },
        {
            "content": "It's a really crap movie",
            "review_date": "2016-04-02",
            "source": "rt"
        },
        {
            "content": "The violent, psychopathic over-the-top prison warden actually did a bang-up job, and the shocks worked when they were meant to... but really -no one needs to see this film.",
            "review_date": "2016-03-30",
            "source": "rt"
        },
        {
            "content": "The worst movie I've ever seen (and I've seen over 4,500 movies).\n\nA brutal, deranged prison warden, Bill Boss, knows no limits or laws when it comes to maintaining discipline in his prison, and in carrying out his sadistic urges.  Then, influenced by watching the Human Centipede movies, his sidekick Dwight suggests that he create a human centipede out of the prisoners.  It will cut their food costs...\n\nThe original The Human Centipede was disgusting in its plot, but not very graphic.  This was a redeeming quality, as it left a lot to the imagination, and left room for a plot.  While not good, it turned out to be not as bad as expected.\n\nThe second film had far less redeeming qualities.  It was graphic in its violence, surgical scenes and centipedal scenes, and very disgusting, and gratuitous.  Plot was quite basic.  Overall the movie was pretty bad.\n\nThis, the third movie, is even worse than the second.   Concept is even more gross than the first two movies and the movie is quite graphic.  Plot is close to non-existent - things just lurch from one random scene to the next, with the only plot aim being the creation of the centipede.\n\nSo, far incredibly bad.  However, taking the movie to new heights (or its it depths?) of craptacularity is the performance of Dieter Laser as Bill Boss.  I have not seen a worse performance in the history of cinema, or anything (and I've seen Kristen Stewart \"act\").  His \"acting\" consists entirely of shouting and massively overacting.  Yes, some of this is the director's fault, but there is a limit.  Even insane people do not act that deranged.\n\nAwful beyond belief.",
            "review_date": "2016-03-15",
            "source": "rt"
        },
        {
            "content": "negative 5 stars, this movie was atrocious.",
            "review_date": "2016-03-12",
            "source": "rt"
        },
        {
            "content": "This is a greatest movie of all time!",
            "review_date": "2016-03-01",
            "source": "rt"
        },
        {
            "content": "Though it has interesting ideas Human Centipede 3 is nothing more than a horror/comedy that failed at being scary or funny. The whole movie is just hearing the main character scream and you don't even get to see the Human centipede till like the last 15 minutes of the movie. If you interested in the human centipede franchise then I recommend you start here because this is by far the most mild. One of the worst movies of 2015 but if you are interested in the plot then you can try to watch. Just try not to fall asleep from how boring it is.",
            "review_date": "2016-02-29",
            "source": "rt"
        },
        {
            "content": "I saw the first one twice. I began watching the second one before switching it off half-way through, then building up the courage to finish it a few days later. I managed this stupid bungle of a film in one sitting. I got what I probably deserved - copious amounts of gore, an unfathomable story and some terrible, terrible acting.\n\nI was somewhat impressed with Dieter Laser's performance in the original film, but he is easily the most exasperating aspect of this one - he seems to have confused shouting and bawling at the top of his lungs with acting. What seems really saddest of all though is that he, his co-stars and director Tom Six - who makes the most self-aggrandising cameo in cinema history - seem to genuinely believe that they are making a seriously important work of art. In actual fact, Final Sequence is one of the most grotesque works of alleged art in recent memory.",
            "review_date": "2016-02-18",
            "source": "rt"
        },
        {
            "content": "what a horrible piece of shit. nowhere near as solid as the first two. i would rather die via human centipede than watch this film again.",
            "review_date": "2016-02-16",
            "source": "rt"
        },
        {
            "content": "If I could give this 0 stars I would. This is the type of horror film you don't want to see.",
            "review_date": "2016-01-21",
            "source": "rt"
        },
        {
            "content": "Yup. I hate myself just enough to watch the third(and thankfully, final) entry of this movie 'franchise'. You know the movie isn't taking itself seriously when a porn star is the lead actress. The only thing I can say is that at least it wasn't as gross as the second one. On a side note, I gave this a half star because some of the comedic stuff was bizarre and only a slight bit amusing, but if I could rate this 0 stars I would.",
            "review_date": "2016-01-15",
            "source": "rt"
        },
        {
            "content": "Worst movie I've ever seen.",
            "review_date": "2016-01-05",
            "source": "rt"
        },
        {
            "content": "its official, the worst movie of all time",
            "review_date": "2016-01-04",
            "source": "rt"
        },
        {
            "content": "Sometimes as a critic I seek out the worst of the worst so you don't have to, America. And you really owe me big time for sitting through all 100 torturous minutes of the regretful-in-every-aspect horror... \"comedy,\" Human Centipede 3: Final Sequence. I'll confess that horror is a genre I've grown to enjoy and I genuinely liked the first Centipede film, finding its premise near ingenious and that writer/director Tom Six developed his horror grotesquerie in a way that turned it into an accessible survival thriller with some gonzo edges. The sequel was pretty repulsive and the third film, with the hopeful promise of being the \"final sequence,\" is even worse. This is a horrifying endurance test not unlike Tom Green's abysmal lone directorial affront, Freddy Got Fingered. It is that bad. Scenes just seem to go on and on and exist for no purpose. It's like Dieter Laser was just told to do whatever he wanted as long as he yelled as loud as he could and based his performance after the Looney Tunes cast. It's cheap vulgarity masquerading as edgy provocation; it's transparently lazy and insufferable. It's not funny no matter how weird or loud or garish or bloody or dumb it gets. The premise is basically an insane prison warden (Laser) is going to create his own human centipede, the biggest ever, linking over 100 inmates. Ignoring the escalation of all the Centipede sequels, it's a facile plot device and it doesn't even happen until the very end. Until that awful reveal, you will have to endure, no a better word is survive, extended \"comedy\" bits like Laser sticking his tongue out and roaring in orgasm while his secretary (Bree Olsen) is forced to felate him while others are in the room. The movie is trying so hard to be shocking and irreverent that you can see all the pained efforts. It's tedious and boring. Human Centipede 3 is 100 minutes of pathetic flop sweat that could more or less end with the throwaway punchline, \"The Aristocrats!\"\n\nNate's Grade: F",
            "review_date": "2016-01-04",
            "source": "rt"
        },
        {
            "content": "Terrible. Completely over acted by the lead, not funny at all when it tried to be, the gore was subdued from the last two, and overall, boring and a waste of time. The novelty wore off after the second one.",
            "review_date": "2016-01-03",
            "source": "rt"
        },
        {
            "content": "The Human Centipede III is spoiled not by its own sickening, demeaning filth but by how dreadfully, dispiritingly incompetent it all is.",
            "review_date": "2015-12-29",
            "source": "rt"
        },
        {
            "content": "So terrible!!! So bad!!!",
            "review_date": "2015-12-27",
            "source": "rt"
        },
        {
            "content": "I saw it to be able to say I saw all 3. It's nasty, offensive, absurd, and everything it CLAIMS to be! You have to know what you're getting into to watch them. I'm just glad it's over and can't help but wonder what will Six assault us with next.",
            "review_date": "2015-12-20",
            "source": "rt"
        },
        {
            "content": "December 11th- 12th 2015",
            "review_date": "2015-12-11",
            "source": "rt"
        },
        {
            "content": "Was a big fan of the series. WAS. Good luck sitting through this one, & that's not a compliment, as it used to be.",
            "review_date": "2015-11-29",
            "source": "rt"
        },
        {
            "content": "By far the worst movie ever made.  Horrible acting, horrible story, not even the gore was satisfying in any way.  It doesn't even deserve a review.  Horrible!",
            "review_date": "2015-11-26",
            "source": "rt"
        },
        {
            "content": "This is the worst movie that I have ever seen.",
            "review_date": "2015-11-23",
            "source": "rt"
        },
        {
            "content": "This movie is not something I would recommend to anyone unless they said \"I want to watch a movie that is just disgusting.\" It wasn't a good story, but the violence and gore were very well executed.",
            "review_date": "2015-11-23",
            "source": "rt"
        },
        {
            "content": "By far the worst story / film of them all",
            "review_date": "2015-11-22",
            "source": "rt"
        },
        {
            "content": "Who would've thunk it that these movies could get worse?",
            "review_date": "2015-11-20",
            "source": "rt"
        },
        {
            "content": "The only redeeming factor this movie has is that it's interesting to see it as a way for Tom Six to respond to the critics of his first two films. Aside from that, it somehow manages to be overly disgusting for no good reason, while still trying too hard to be disgusting for no good reason.",
            "review_date": "2015-11-20",
            "source": "rt"
        },
        {
            "content": "Disappointed that this is how they ended the once frightening and disturbing series. A waste of time with nothing but sexual perversions and a lot of unnecessary shouting.",
            "review_date": "2015-11-17",
            "source": "rt"
        },
        {
            "content": "I am so fucking sick on these pointless sequels!",
            "review_date": "2015-11-16",
            "source": "rt"
        },
        {
            "content": "Pros:\n-Bloody and gory\n-Dieter Laser's terrible acting\n-Pretty gross in some parts\n\nCons:\n-Tries too hard to be edgy and funny\n-The series has become played out\n-Bad acting\n-Bad writing\n-Fails at comedy\n\nConclusion:\nThe Human Centipede 3 is a bad film. Avoid it like a jar full of dry roasted clitorises, Gorehounds.",
            "review_date": "2015-11-16",
            "source": "rt"
        },
        {
            "content": "This was a terrible movie and a disappointment. It seems as if writer/director Tom Six just said \"fuck it\" and had fun with this movie, instead of trying at all to fulfill the expectations for the finale of the Human Centipede trilogy. As a fan of the unique and interesting first two films, I was expecting something at least half-way decent, but this movie was just awful. I'm not sure at all what Six was trying to do with this film. It wasn't funny or scary. It was just gross and disgusting, without really anything else of value added to it. The main character, Bill Boss (played by Dieter Laser), is just annoying and irritating to watch. The ending is stupid. This movie didn't bring anything new to the series. This film has only few positives: a few gags that might make you laugh a few times, and supporting actress/porn star Bree Olson is fun to look at. But other than that, don't waste your time with this movie.",
            "review_date": "2015-11-14",
            "source": "rt"
        },
        {
            "content": "......... sigh* As Michael Bluth once so adequately stated I don't know what I expected",
            "review_date": "2015-11-07",
            "source": "rt"
        },
        {
            "content": "Easily the most boring, pointless, shit filled (no pun intended) movie I have ever had the displeasure of sitting through. Not only have I been bored to tears by the awful acting there is no thrill when I spent the first 45 minutes watching some bald buy yell. Not to mention all of the product placement for the first two films. I guess to each his own right?",
            "review_date": "2015-11-07",
            "source": "rt"
        },
        {
            "content": "Human centipede is a franchise that is popular because of the extremely disgusting content. The first film while not quite as bad as its reputation the film still had some extremely disgusting moments that made me feel pretty sick. The second one is where this franchise got extreme, overly violent, disgusting and absolutely terrible the second human centipede is pros sly the most violent film I have seen and I could just about handle it. The third human centipede is a terrible, gory and just boring film. The human centipede is barely in the film. This film while not as violent as the second is extremely violent and disgusting. The film somehow got Eric Roberts involved, I'm not sure ow that happened. The film is very over the top and self aware, the main actor from the first film is extremely over the top and shouts a lot. This film is also very gory, there is a scene where someone gets castrated, it's extremely hard to watch and very gory. The film also has some weird sexual moments, like a man eating fried clitorises. There's also a horrible bit where a comatose body is raped. The acting is poor although the fucked ip little guy from the second movie is much better in this movie. Overall this film is boring, disgusting and just terrible. F",
            "review_date": "2015-11-07",
            "source": "rt"
        },
        {
            "content": "Words cannot describe how awful this entire movie is. The main protagonist spends 75% of the movie with pointless yelling and is full of humor for 12 year olds who enjoy tasteless sex jokes.",
            "review_date": "2015-11-06",
            "source": "rt"
        },
        {
            "content": "Some weird disturbing ass shit!!!!!!!",
            "review_date": "2015-11-06",
            "source": "rt"
        },
        {
            "content": "F+\nDieter Laser gives an over-the-top performance as the villainous William Boss in a movie that deserves to be thrown in the trash and burnt. Its saving grace happens to be how meta it takes itself.",
            "review_date": "2015-11-05",
            "source": "rt"
        },
        {
            "content": "Since it's not possible to five 0 stars... Stay far away from this film. There are lines that shouldn't be crossed, even in bad D-List \"horror\" films... and this movie crossed every single one.",
            "review_date": "2015-11-04",
            "source": "rt"
        },
        {
            "content": "The first 2 films in this series were not great, they were however entertaining, freaky and messed with your head because they were so insane.  This third (and final) installment strayed very far from its predecessors and tried to almost make fun of itself by featuring some comedy and other bizarre things.  They took the 2 main \"bad guys\" from the first films and put them in charge of a prison, although they played totally different characters.  Most of the film was of the warden yelling and acting insane and the whole centipede thing did not come around until the last segment of the film, which was odd.  The first 2 films were known for being over the top nasty but this final film barely surpassed Hostel on the gross out scale.  It almost seemed like they made this to just say goodbye to the actors and even the director of the films by throwing them in a horrible scenario with a poorly written plot.  If you liked the first 2 films even a little, you probably will not enjoy this one because it is such a change from the formula.  This movie is for a unique crowd and even that crowd would be hard pressed to really enjoy it.",
            "review_date": "2015-11-03",
            "source": "rt"
        },
        {
            "content": "As repulsive as part 2 with a ludicrously over the top central performance from Dieter Laser.",
            "review_date": "2015-11-01",
            "source": "rt"
        },
        {
            "content": "almost 2 hours of my life that I will never get back. considering my enjoyment for the first two films, I was sorely disappointed that I actually endured this foolishness.",
            "review_date": "2015-10-31",
            "source": "rt"
        },
        {
            "content": "Best Of The 3 Only Because It Had Me Laughing Almost Through the While Film!",
            "review_date": "2015-10-30",
            "source": "rt"
        },
        {
            "content": "At about 15 min in you realize this movie is the definition of torture porn.The worst part is you get the feeling that Tom Six thought this actually has a valid message which if it did it was lost early on in production.It really offers nothing but a handful of gross out moments and Dieter Laser incoherently screaming and grabbing his junk. If your into being pushed to the point were you feel like your going to vomit then yea i guess this movie is for you.",
            "review_date": "2015-10-29",
            "source": "rt"
        },
        {
            "content": "A tedious and badly made addition to the shock genre. There are a couple of scenes which are novel in their distaste and a little humour but for the main part there is very little here of any worth to the even the most seasoned viewer of the macabre.",
            "review_date": "2015-10-29",
            "source": "rt"
        },
        {
            "content": "[Zero Stars]- I was a supporter of the artfully grotesque first two chapters, but Tom Six tragically botches the final installment in his body-mutilation trilogy. Continuing farther down the rabbit hole of meta \"humor\", the excruciating Human Centipede III is the absolute doldrums of the horror movie season. Writer-director Six obviously aggrandizes himself as a genius despite his \"poop fetish\" since he appears as himself to concoct a multi-hundred person centipede to curtail inmate-on-inmate violence at the prison. Dieter Laser barks and howls through the entire film incoherently and it's a humiliating exhibition of an actor untethered without a safety net. Most of his dialogue is unintelligible but it doesn't matter since it's mostly vile. Porn star Bree Olson is Bill Boss' (Laser) secretary who is objectified and sexually molested constantly. The agenda of her window-dressing role is plainly misogynistic. Suddenly, the putridly meritorious virtuosity that Six brought to the previous films has vanished and we're left with a repulsively dusky-brown filter and low production values. Eric Roberts slums as the governor who is appalled at the mistreatment of the prisoners. For pure shock value which elicits zero laughs, Boss cannibalizes the testicles of one prisoner and gnashes on dried clitorises as an afternoon snack. The film ceases with a nihilistic ruler-frolicking-atop-his-throne ending and it is frustrating to not be gratified with Boss's comeuppance via a penitentiary uprising. Suffice it to say, Human Centipede III is the worst of the series and quite possibly one of the most abominable of the decade.",
            "review_date": "2015-10-29",
            "source": "rt"
        },
        {
            "content": "I couldn't do it. I was intrigued by this due to how the movies have been made before but this is just horrid.  the acting in the first 20 minutes is the worst I've seen ever.  so off putting I didn't even bother.",
            "review_date": "2015-10-28",
            "source": "rt"
        },
        {
            "content": "Dieter laser overacts away this mess of a sequel. Though I wasn't a fan of the original,that's a masterpiece compared to this trash. Designed to offend and disturb you as much as possible,I will prob succeed though I was more bored to tears.",
            "review_date": "2015-10-27",
            "source": "rt"
        },
        {
            "content": "Utter garbage and most likely the worst film of the year. (And just for the record: I liked the first one a lot, it's ingenious.). Poor script delivered by ridicilously awful actors and effortless directon. And lot of pointless gore that has less than zero shock value.",
            "review_date": "2015-10-23",
            "source": "rt"
        },
        {
            "content": "The first one in the series was pretty terrifying and disgusting as evident by the shock it caused around the world.  However, that shock has long worn off.  Tom Six tried to outdo the first installment by creating an even more disgusting antagonist, and adding more gore to the second movie, but it just felt like he was trying to capitalize on the depravity of the series.  This third installment also falls flat on it's face.  The only thing worth mention is once again the acting, Dieter Laser and Laurence R. Harvey are terrific.  I hate to give a movie that is so depraved such a compliment, but I have never been disgusted by main characters in a movie as much as I have been throughout this series.  They really do bring these despicable scum to life in a very genuine way.  Tom Six's directing and writing though, are just bottom of the barrel awful.\n\nVerdict: F\n\nAnother horrendous adventure into depravity led by Tom Sixx.  Hopefully it'll be the last.  The world is better off without these movies, no matter how good the acting is.",
            "review_date": "2015-10-20",
            "source": "rt"
        },
        {
            "content": "awful, poor story ridiculous amount of waiting time and left wondering",
            "review_date": "2015-10-18",
            "source": "rt"
        },
        {
            "content": "I might have become a worse human being after being force fed this steaming pile of crap.",
            "review_date": "2015-10-13",
            "source": "rt"
        },
        {
            "content": "I don't know why anyone would want to watch this. I don't even know why I decided to watch this. After watching it I realised that not only is it genuinely awful, but the entire film is concluded in the trailer for the feature and after watching that, believe me there is no need to watch the film. First Sequence was genuinely an unsettlingly and surprisingly good, but not quite enjoyable example of shock body horror. The Second Sequence was so disgusting, artless and shockingly poor that I do believe it is actually the worst film I have ever seen. The Third Sequence isn't bad or good, its just a really ridiculous piece of crap full of horrifyingly awkward acting, zero plot whatsoever and a f*cking annoying as hell main character! He doesn't stop shouting throughout the whole film and his voice is so annoying I wanted to turn the film off because I felt like I was being punched in the face by his voice. Don't watch this film seriously, there's no need to subject yourself.",
            "review_date": "2015-10-12",
            "source": "rt"
        },
        {
            "content": "About as good as you'd think a third movie about sewing someone's mouth to someone else's asshole would be.",
            "review_date": "2015-10-06",
            "source": "rt"
        },
        {
            "content": "There really are no redeeming features as far as Human Centipede 3 goes. Dieter Laser is infuriating in the lead role and the film as a whole is self-aggrandising to the point of idiocy.",
            "review_date": "2015-10-03",
            "source": "rt"
        },
        {
            "content": "Probably the worst film of all time. Laser's acting is so terrible.",
            "review_date": "2015-09-20",
            "source": "rt"
        },
        {
            "content": "The First: the classic horror approach and disturbing of course, The Second: art horror overload and the best of the 3 and the most disturbing. And finally the Third: Mock B-movie horror with Tarantino-esque dialogue sequences and rage acting from Dieter Laser (yes, his last name is literally Laser) These films are not made for anyone and honestly, most who can get through this whole movie..(which is far less disturbing than the first 2) likely will regret every minute watching this unless you are a fan of the others. Tom Six is a twisted dude no doubts here. It took me a while to get onto this one because I actually forgot that I watched it or even wanted to say anything about it. Some may ask why I even bother watching movies like this. Well, I tell you that I do so out of pure curiousity of what all the madness and talk is about and I crave shock value. To me these are fun movies that take me away from my own reality and obviously nothing like this will ever happen in real life adn I couldn't imagine ever witnessing the events in these pictures actually taking place. Here is the classic case of \"it's just a movie\" and it really is after all. All this being said, this was easily the funniest of the 3 entries mainly for the rage acting in it and for the outrageous spots of disturbing elements as well even if we have to wait till the last 20 minutes for anything of great magnitude to happen with this twisted tale. In the end, it was a nice finishing touch on this birthday cake of disturbing horror.",
            "review_date": "2015-09-20",
            "source": "rt"
        },
        {
            "content": "Jesus christ... It's just so bad...",
            "review_date": "2015-09-19",
            "source": "rt"
        },
        {
            "content": "no words, such a waste of time!! keep in mind it comes from a person who loves, gory, nonsense, blodd flowing disfunsting movie! run away from it!",
            "review_date": "2015-09-12",
            "source": "rt"
        },
        {
            "content": "Absolutely disastrous after the epicness of the second one. Tom Six f'n sucks.",
            "review_date": "2015-09-06",
            "source": "rt"
        },
        {
            "content": "I saw the 1st two so why not. This one happened to be the worst of the 3 as it takes a while before we see the actual centipede. Based in a prison this one is about the biggest centipede train",
            "review_date": "2015-09-03",
            "source": "rt"
        },
        {
            "content": "Not scary or horrifying, just shouty nonsense.",
            "review_date": "2015-08-30",
            "source": "rt"
        },
        {
            "content": "They should of made it better, considering the other two were much nastier and gorier but this is a let down, more of a comedy of the whole human centipede thing. Really tom six?",
            "review_date": "2015-08-26",
            "source": "rt"
        },
        {
            "content": "Not as \"good\" as the first two.\nThe acting was awful, the story was executed poorly and it just all felt a bit amateur.",
            "review_date": "2015-08-22",
            "source": "rt"
        },
        {
            "content": "Thought enjoyed 1 & 2 very much, I'm sick of Mr Laser's over-acting this time.",
            "review_date": "2015-08-22",
            "source": "rt"
        },
        {
            "content": "I find this film as a black comedy, or it's just me.",
            "review_date": "2015-08-18",
            "source": "rt"
        },
        {
            "content": "This is one of the worst things I've seen and I've seen a lot.  I liked the first one because it was so bizarre and unique.  The second was not very good and this one is complete crap.  I think Six came up with the grossest stuff he could think of and tried to write the story around those parts.  There is nothing good I can say about this one.  Stay far away from it.",
            "review_date": "2015-08-15",
            "source": "rt"
        },
        {
            "content": "SO I finally got around to watching this after sitting through the two previous films and I have to say I was quite surprised.\nPerhaps I'm thinking as crazy as Tom Six but there is actually some underlining issues addressed and it sort of makes it complex?\nTom Six with this film seems to be provoking politics, political figures like George Bush, political correctness and issues with justice system in America. Specifically critiquing the rehabilitation side of it. Makes it sound way more interesting than you may find it but it wasn't a one topic film like the previous two. There was some attempts at actual horror, at thought provoking concepts and absolute disgusting content to fill the gaps.\nIf there's nothing else to watch or you're just a little bit curious, I say watch it, what's the worst that could happen? It's certainly toned down a lot I think.",
            "review_date": "2015-08-11",
            "source": "rt"
        },
        {
            "content": "This isnt even a good movie. I'm watching this movie as I type this and I don't even think I can finish it. The only reason I'm thinking about seeing this through is so I can say I've seen all 3 of them.",
            "review_date": "2015-08-05",
            "source": "rt"
        },
        {
            "content": "Tom Six tries to out-shock his previous installments while adding in some (very) dark comedy but without the style and delivery seen in 2nd film it comes off as just plain foul. Laurence R. Harvey's durable performance tries to keep the movie tolerable but can only do so much to alleviate Dieter Laser's obnoxious scenery-chewing.",
            "review_date": "2015-08-02",
            "source": "rt"
        },
        {
            "content": "The concluding movie of possibly the most undeserving film trilogy ever conceived by human hands had no hopes of saving the franchise, but it didn't have to be anywhere near as execrable as the prior instalment. It isn't, thankfully, but the sheer contempt for the audience is still very clear. While the first 2 were deadly serious, this one rises to the very summit of woeful self-parody, then comes tumbling down the other side. In one of the laziest examples of casting I've ever witnessed, many of the central characters here are played by actors from the previous films, including its tongue wagging, eye bulging lead. The eccentric Doctor from the first movie is back as a sexist, racist, ignorant, aggressive, alcoholic, gun-toting Prison Warden. He doesn't so much chew the scenery here as he does open wide his square jaws and swallow it whole, including the other actors. Eric Roberts looks and sounds comatose in his cameo which he clearly cares very little about performing. The director/screenwriter himself, Tom Six, inserts himself into the picture to add that little bit of extra smugness, which seems ironic, considering this is the most poorly assembled film in the series. The other 2 were rubbish, sure, but they were at least easy to follow. This film is so incoherent and so confused, zipping around like a Turkey with its head lopped off before running out of energy and stumbling to its inept conclusion. It has a few little giggles here and there, but that's small consolation in a film so stupid, boring and unnecessarily long.",
            "review_date": "2015-07-30",
            "source": "rt"
        },
        {
            "content": "Well that's 102 minutes of my life I'm never getting back. I don't think I've ever seen such terrible acting, especially from Dieter Laser. Is over-acted, loud-mouthed, idiot bastard of a character was the most annoying person to watch on screen. Seriously, don't waste your time with this film.",
            "review_date": "2015-07-28",
            "source": "rt"
        },
        {
            "content": "Beyond awful to the point of unwatchable and sadly not because of the content.",
            "review_date": "2015-07-27",
            "source": "rt"
        },
        {
            "content": "With a tone that makes the movie feel more like a lame parody of its predecessors, characters that mostly feel pointless and dumb, and with less violence and shock value than a quarter of the first sequence, The Human Centipede III not only fails as a movie but also as a sequel and an ending to a franchise that hardly has anything more to offer after the previous two sequences.",
            "review_date": "2015-07-24",
            "source": "rt"
        },
        {
            "content": "I wish a million plagues on Tom Six and all involved in this series.",
            "review_date": "2015-07-24",
            "source": "rt"
        },
        {
            "content": "I was a big a cheerleader for the first film. Though intentionally revolting it had a lot going for it. The sequel was awful but had some interesting commentary. The full sequence could not only be one of the worst horror films I've ever seen, but one of the worst films period; seemingly made with the sole intention to outrage everyone.",
            "review_date": "2015-07-22",
            "source": "rt"
        },
        {
            "content": "horrible movie from start to finish.",
            "review_date": "2015-07-20",
            "source": "rt"
        },
        {
            "content": "DO NOT WATCH THIS MOVIE! UNDER ANY CIRCUMSTANCES!",
            "review_date": "2015-07-13",
            "source": "rt"
        },
        {
            "content": "The film is an awful end to the trilogy about humans who share an alimentary tract to form a 'human centipede'.\nStars, and I say that with some sarcasm from the previous two films return as new characters in a top security United States prison somewhere in the desert. In that respect it is like a Carry On film.\nThat is where the similarities end.\nDieter Laser, the mad German doctor from part 1 is now Bill Boss, mad warden of the prison. He seems to have psychological issues and is very highly strung about being unable to control the prison population.\nThe little guy from part 2 (was cocky when presenting the film before an audience of strange people) is the 'accountant' of the jail who comes up with the idea of a prison centipede to ultimately cut costs and control the population.\nThe film is very boring for large parts. Sick in others. Even the director/producer Tom Six presents himself in on screen cameos proud of his devious medically accurate claims.\nThe film did not receive the same amount of pre-publicity regarding censor cuts than part 2 and is filmed in colour in this episode.\nThat said I still would never recommend this filth.",
            "review_date": "2015-07-12",
            "source": "rt"
        },
        {
            "content": "I didn't think I'd go into The Human Centipede III questioning whether or not that part 2 was the worst in the series; that one went too far but this one sent me to sleep. \nThere's almost no centipede action apart from a few static shots of the finished thing, with the rest of the film being a colossal mess. \nHere's hoping it really is the last.",
            "review_date": "2015-07-12",
            "source": "rt"
        },
        {
            "content": "Pretty Ironic that 'THC III' is based on prison punishment, because that's what this movie should be used for.",
            "review_date": "2015-07-11",
            "source": "rt"
        },
        {
            "content": "absolute rubbish...had to put 1 star but deserves none",
            "review_date": "2015-07-10",
            "source": "rt"
        },
        {
            "content": "I feel generous just giving this half a star. Too bad I can't rate any lower. Quite possible the worst movie I've ever seen and I've seen some bad ones",
            "review_date": "2015-07-09",
            "source": "rt"
        },
        {
            "content": "this movie was terrible and I thought the main guy from the first one got shot at the end and died?  don't waste your time watching this rubbish.  they took it to far and it's not even scary. they should of stopped after number one.",
            "review_date": "2015-07-02",
            "source": "rt"
        },
        {
            "content": "Disappointingly a waste of film.  The first original will blow ur socks offs... too warped for innocent minds.",
            "review_date": "2015-06-22",
            "source": "rt"
        },
        {
            "content": "funny movie. what did you really expect here?",
            "review_date": "2015-06-20",
            "source": "rt"
        },
        {
            "content": "after watching both first and second sequences I have to say this mash up of the two films characters doesn't quite work! some cringworthy moments but all in all a pretty worthless experience.",
            "review_date": "2015-06-17",
            "source": "rt"
        },
        {
            "content": "Insane! ð??? ð??? ð???",
            "review_date": "2015-06-17",
            "source": "rt"
        },
        {
            "content": "As far as low budget horror goes, this may be one of the best ever. The villains of the Human Centapeeed 1 and 2 both return for the 3rd act (in different roles this time) and there is glorious gorey fun to be had. Dieter Lasser from the first film, now playing a psychotic jail warden, is so manicly evil and unpredictably explosive, he just may be the greatest villain on screen since Heath Ledger's Joker in 2008. if you aren't a horror fan, don't bother. You wont be able to deal.",
            "review_date": "2015-06-17",
            "source": "rt"
        },
        {
            "content": "Where both the first and second movies do have some good elements, mostly the gore... this ons really lacks to have anything that makes it worth to watch this movie. None of the actors does a good job, and even the gore (that you want at this kind of movies) is left out mostly. Worst movie I did watch in a very long time.",
            "review_date": "2015-06-10",
            "source": "rt"
        },
        {
            "content": "If you thought the previous two films were terrible, you haven't seen anything yet. This third installment is god-awful, with terrible direction, wooden acting, and a plot that was most likely made up as they went along.",
            "review_date": "2015-06-10",
            "source": "rt"
        },
        {
            "content": "Not as good as the first two.",
            "review_date": "2015-06-10",
            "source": "rt"
        },
        {
            "content": "There aren't a lot of movies that I regret watching and that I want to completely forget, but this is a 100% one of them. I knew it wasn't going to be a great movie but at least I was expecting it to be shocking and gruesome, like the second one. Instead it was completely disgusting and not in the ways it should've been. This time around director Tom Six really liked to showcase his franchise and giving it a ton of credit and mention as he could, even with him making a cameo. It was completely garbage, demeaning to women and plain maddening. It's not even so bad that it's good. Also, the acting mainly from Dieter Laser was terrible! He delivered one of the worst performances I've seen. He wouldn't stop screaming every single line without any type of consideration or sense. Thus, the only kind of positive comment I could have was that it was true all they said about the prison situation, but that's not a justification to demean people and degrade them for the sake of others. Overall, there are not enough words to say how bad and tedious it was, and don't expect to be as amazed and shocked because there isn't much going on story-wise than a decrepit man yelling for the whole duration of the movie. \n~June 9, 2015~",
            "review_date": "2015-06-09",
            "source": "rt"
        },
        {
            "content": "Apparently Six can only find two actors in the entire world willing to accept the main roles in his scripts at this point, and the acting is somehow even worse than in the previous films. This third entry does have a lot of meta references, which could be funny and are supposed to be tongue-in-cheek, but come across more as desperation than anything else. Most of the time, it seems more like Six is just trying to boost his own ego. It also seems like the intent was to up the ante and make this movie be the most shocking, vile, and extreme of the trilogy, although, aside from maybe a couple of scenes, the only thing shocking is how little the human centipede is actually featured this time. I think we see more of the first two human centipedes during this movie than we see of the third. Hopefully this is indeed \"the final sequence.\"",
            "review_date": "2015-06-07",
            "source": "rt"
        },
        {
            "content": "Worst movie i saw this year , more than 1hour just to see some interesting or not so interesting gore, actually i slept at the end even with all the overacted screaming from the non talented actors, the only bright thing is that sexy blond chick and that's it",
            "review_date": "2015-06-05",
            "source": "rt"
        },
        {
            "content": "I really liked it, it was dirty, sweaty, it's what I expeted a real overdose of too much, Dieter Laser was great !",
            "review_date": "2015-06-05",
            "source": "rt"
        },
        {
            "content": "This film was the definition of brilliance. I have never set my eyes on a film of this caliber. This makes Forest Gump and Titanic look like a middle school project. Hats off to the Director and Cast.",
            "review_date": "2015-06-03",
            "source": "rt"
        },
        {
            "content": "One of the most funny and fun horror movies i've ever seen, it was nasty and trashy but they managed to portrait that in such a beautiful way that the trashiness is a good quality for this film, it was made for that purpose and it delivered, i really laughed and got grossed out a lot many times.",
            "review_date": "2015-06-02",
            "source": "rt"
        },
        {
            "content": "A pointless effort, adds nothing to the first two, tried to be humorous but IMHO don't waste your time or money. It wasn't shocking or horrific. Only watch if you have a spare 90 or so minutes of your life but don't, please don't if you thought the first 2 were ok. Has spoiled for me the shock effect of the first 2, avoid avoid AVOID.",
            "review_date": "2015-06-02",
            "source": "rt"
        },
        {
            "content": "Warning Spoilers!!  I don't even know what to say...  It was gross & cruel, as usual, but in a different way. The grossness centered around Bill and not the HC, which in turn, made it stupid. It's mostly Bill being crazy & doing screwed up things. The screaming and ranting from Bill is so annoying, I wanted to turn it off. In fact, I stopped it once and awhile. I couldn't take it. \n\nThis one is also very \"Hollywood\" and I think that ruined it. Not necessarily Eric Roberts' part. He was probably the best actor in the movie, beside Tom Six himself. But more because they tamed it. \n\nI meant you still see some great gory stuff and some things that make you just say \"EW!\" Like eating poop or wiping blood and sperm on his face and head, but most is just spoken and not done. The worse scene was the operation for both the centipede and caterpillar and the castration. You actually see it being done, but other than that, it's crap. \n\nIn this movie there also Robert LaSardo, Tommy 'Tiny' Lister, Bree Olson, & Jay Tavare. See..? Hollywood. *sigh* I have both HCs and now, I have to buy this to add to the collection, but truthfully I don't want to. That's sad, I know. I'll never watch it again. \n\nThe rest of this movie is filled with sexual discrimination on Daisy played by Bree Olson, which in my opinion, isn't even hot. She has fake boobs, a big butt and dyed blonde hair. They tried to make her hot, by sticking her in tight, push up clothing and short skirts and heels, but she looks like trailer trash. Which I guess was the idea, but it shouldn't have been her.\n\nAll in all I didn't like it. It was just stupid. And the 30 seconds to one minute yelling rants was just too much and it's all Bill does in the movie when he isn't killing someone, being gross or talking to Hughes. I have a headache from it. Both centipede and caterpillar were cool though.  I was expecting it to be like the others, but it's NOT. It's really NOT!! I'm truly disappointed in this movie.",
            "review_date": "2015-06-02",
            "source": "rt"
        },
        {
            "content": "Where do I begin? The Human Centipede 3 is the worst of the trilogy not because it's the grossest but because it's the most boring, dumbest, and ear-deafening. Dieter Laser gives the worst performance of all time. The WORST. THE. WORST. Yes. Put that in stone. This is the worst performance I've ever seen. The ENTIRE movie consists of Laser screaming and screaming and screaming and screaming and screaming and screaming and screaming and screaming and screaming and screaming and screaming and screaming. He gave me a headache, and I guarantee that 10 minutes into the movie he'll give you one too. This movie is louder than Transformers.\n\nAt least The Human Centipede 1 and 2 kept my attention because of how unbearably gruesome they were. This third sequel is SO. BORING. So awful. And of course, because Tom Six is already a maniac, the movie is disgusting, misogynistic, and racist beyond belief. How sick it is to watch porn star Bree Olson be treated like dirt.\n\nI don't get it. I don't get what's \"entertaining\" about these movies and I never will. I do love horror movies and occasionally I enjoy the really gross ones (the Evil Dead remake is one of my favorite movies and it's GROTESQUE), but The Human Centipede? No. Never. Thank the Lord this is over.",
            "review_date": "2015-06-01",
            "source": "rt"
        },
        {
            "content": "How weird it is to say, I found this less disturbing than the first two. It was more absurd, than gory and maybe too theatrical ...",
            "review_date": "2015-06-01",
            "source": "rt"
        },
        {
            "content": "One of the weirdest films Ive seen. BONKERS!!!!",
            "review_date": "2015-06-01",
            "source": "rt"
        },
        {
            "content": "After so long waiting for this film, I was so disappointed its just a bland, lacking in imagination or filth",
            "review_date": "2015-06-01",
            "source": "rt"
        },
        {
            "content": "This third entry is admittedly gripping, not in the way that other films like Ex Machina are -- those films are gripping in the sense that everything is perfect and you can't wait to see what else could happen -- this film is gripping the sense that everything is a disaster and you can't wait to see what else could possibly go wrong. Let this review serve as both a recommendation and a warning.",
            "review_date": "2015-05-31",
            "source": "rt"
        },
        {
            "content": "Completely awesome. Best of the 3. Insanely funny and twisted. Absolutely a must see.",
            "review_date": "2015-05-31",
            "source": "rt"
        },
        {
            "content": "Well, it IS bad. But, it also some funny moments. Weird, huh? Yeah, I was very suprised to see that this movie was actually a comedy, not really a horror. It's extremely over the top with it's jokes and it's violence, but sometimes the jokes work, although the main character gets annoying really fast due to his near constant yelling and shouting. The story begins just as the second one did. Our main characters watch the movies. It's not a really good story, but then again, you can't expect a good story from this series. The movie isn't an improvement on the past parts and serves more as a parody on the previous installments than an actual sequel. The gore is still there, in high quantity, but it's less shocking than the second one, and less interesting than the first one. It's a movie you can skip and feel like you haven't missed anything important, because you, indeed, haven't. I wouldn't recommend this movie at all.",
            "review_date": "2015-05-31",
            "source": "rt"
        },
        {
            "content": "Disappointing!  It's like the director just throw all unethical ideas in the movie hoping to gross audience out.  Nothing like the the first 2 Human Centipede.",
            "review_date": "2015-05-31",
            "source": "rt"
        },
        {
            "content": "Well. Hmm. You see. No wait. Well. This is what it is and if you've seen the others then this is more of the same, with some very twisted new additions.\n\nSpecifically designed to offend as many people as possible. It is not even that which is the films most bizarre feature. That belongs to \"actor\" Dieter Laser who plays the films sheriff. He takes over acting, being over the top to a level which I do not seriously believe any actor could possibly ever top. \n\nNot for everyone. Possibly not for anyone. Why the hell did I watch this?",
            "review_date": "2015-05-30",
            "source": "rt"
        },
        {
            "content": "I think this was the better of the films, because the character of Bill Boss is just so insane, and the movie is mostly about him.  Lost a star because the centipede only is seen for a fraction of the film.",
            "review_date": "2015-05-29",
            "source": "rt"
        },
        {
            "content": "One of the worst films that I have ever seen. The first were fun little horror flicks that was not good but had some good stuff in it. This one is just awful.",
            "review_date": "2015-05-28",
            "source": "rt"
        },
        {
            "content": "There's too little to talk about Human Centipede III, yes the last two films were only films, but this time they are watched by Bill Boss (whom happens to be Dr. Josef Heiter in the original), and Dwight Butler ( yes Martin from Centipede II), both direct a prision whose inmates break havoc 24/7 now that they are not afraid of the punishments done by Boss and Butler, did say that Boss has a hot secretary named Daisy portrayed by former oprn actress Bree Olson? and that she keeps acting like an porn actress? well now you know it. Getting back to the main idea in order to intimidate the prisoners and show them some respect Butler has the idea of making a Human Centipede, aproved by Tom Six himself, as a punishment ... and tha's all, but add some gore, testicles and blowjobs, oh and Bree Olson eating clitorises. \nSo in short, it's not worthy to watch, is all the same but larger and bigger, with nothing to enjoy but a few jokes, it is ugly, nasty and boring, so if you wanna see people eating shit, there's internet and it is free.I have to add that I only enjoyed Human Centipede II.",
            "review_date": "2015-05-27",
            "source": "rt"
        },
        {
            "content": "Can you give this a less than half a star?",
            "review_date": "2015-05-27",
            "source": "rt"
        },
        {
            "content": "http://www.clevelandmovieblog.com/2015/05/the-human-centipede-iii-final-sequence.html",
            "review_date": "2015-05-27",
            "source": "rt"
        },
        {
            "content": "There are no words in the english language (that i can use here) that can accurately describe how utterly terrible, awful, and just downright dumb this 'movie' was. May i first ask who wanted this movie to be made? What? No-one? ok, THEN WHY ON EARTH DID TOM SIX DECIDE TO MAKE THIS PEICE OF GARBAGE??? There is no way, any sane human being would believe that this was in any way imaginable a good idea. It has some of the worst acting i have ever seen in my entire life from every single person in this film and will someone tell Dieter Laser to STOP BLOODY SHOUTING EVERY DAMN SENTENCE LIKE WE ARE 100km AWAY, JEEZ. And on top of the god-awful acting it comes accompanied by the worst scripts in history, and a plot that made absolutely no sense whatsoever, in fact, there was no plot for 90% of this thing. This is 'The Human Centipede' right? SO WHERE WAS THE CENTIPEDE FOR THE FIRST HOUR AND 20 MINUTES??? I honestly do not know which was more difficult to sit through, the surgery (or lack thereof) or that piece of garbage that was the culmination of bad acting, writing, directing and everything else. There were a few times where the film showed signs of trying to be satirical and even self aware but it was so ridiculously dumb that by that point you just want to gouge your eyes out. I don't even know why i am still wasting my time talking about this when i just wasted an hour and 40 minutes of my life watching it. So here's the score and if you want to subject yourself to torture be my guest because i'm out. - 0.3/10",
            "review_date": "2015-05-27",
            "source": "rt"
        },
        {
            "content": "Intoxicated tortures.",
            "review_date": "2015-05-26",
            "source": "rt"
        },
        {
            "content": "It's like the lead Dieter Laser walked on set, waved away the script and said \"Fuck it, I got this\". As a result, we're given a stupidly sadistic character that carries the film so hard, it needs to be seen to be believed.\n\nCompletely absurd, cheaply grotesque, shockingly politically incorrect gore porn driven piece of cinematic garbage. \n\nAnd I loved every second of it.",
            "review_date": "2015-05-25",
            "source": "rt"
        },
        {
            "content": "Worst movie I've ever watched. Doesn't compare to the first one.",
            "review_date": "2015-05-25",
            "source": "rt"
        },
        {
            "content": "Just flat out horrible",
            "review_date": "2015-05-25",
            "source": "rt"
        },
        {
            "content": "This movie is complete crap. Tom Six is an idiot.",
            "review_date": "2015-05-25",
            "source": "rt"
        },
        {
            "content": "this movie makes me want to die, its so bad",
            "review_date": "2015-05-25",
            "source": "rt"
        },
        {
            "content": "This is surely one of the saddest films in movie-making history. The Human Centipede 3 highlights the grotesque, vile and disturbed parts of Tom Six's subconscious. I thoroughly think this man has met the requirements to be excised from the movie industry, burned via boiling waterboarding, shot in the stoma, raped whilst in a coma, and forced to make a circular tube of his own intestines with his special, mouth to a**hole combo, and live like that for the rest of his life.",
            "review_date": "2015-05-25",
            "source": "rt"
        },
        {
            "content": "The lead actor Dietor does do his best with this useless senseless script of monotonous crude gore",
            "review_date": "2015-05-25",
            "source": "rt"
        },
        {
            "content": "I gave it half a star because you can't do minus. Having enjoyed (if that's the right word) the previous two, this one consists of a man shouting for nearly two hours and the very occasionally gross-out scene. The ever-egotistical Six makes an appearance as himself, in the only way an egocentric fool could. All in all, this is an abysmal finale to a potentially brilliant series.",
            "review_date": "2015-05-25",
            "source": "rt"
        },
        {
            "content": "The final installment in Tom Sixes gross out franchise is a bit disappointing, it focuses to much on the prison aspect and not enough on the centipede aspect the films are based around.",
            "review_date": "2015-05-24",
            "source": "rt"
        },
        {
            "content": "As I said before my curiosity is my true enemy.\n\nThe story in this third entry of the Human Centipede series, with returning stars Dieter Laser and Laurence R. Harvey banding together as a new villainous duo aspiring to connect over 500 human bodies together.\n\nDo any of you remember my review of The Human Centipede 2 where I said I'm not going to watch the other one just because I was that grossed out and angry at the time, and I also didn't know they were making a third movie at the time of that review. I just found out a couple of days about this movie and how it was the final which I had the thought of \"Oh god I'm going to watch no matter what I'm I\", and I sure did. I know some of you are thinking \"Matt why on earth would you watch this movie since you hated the last two movies and what are expecting from this disgusting film series\". I know I should know better and I originally had no plans on seeing this one since I still think the second movie is the worst horror movie ever made, but since I already seen and review the first and second movie I thought to myself \"Why not finish this horrible franchise of torture porn\". These no surprise this movie sucked big time but what really surprise me is how boring the movie is.\n\nI hate the fact that this movie is self aware of the others movies as the character's watch and talk about them and how they look like them even when it's the same actor. The other thing that really grinds my gears while watching this movie is how the character's treat the movie director Tom Six (Yes he's in this movie playing himself) like a god to film making, even when he's not and he's just another Eli Roth clone.\n\nDieter Laser makes a return in this movie and his acting in this movie is so over the top crewing up the scenery that it got to the point that it annoyed the crap out. His character in the movie is so annoying I mean oh my god although the movie he never stops yelling and he was being a total tool to everyone around him. I mean every scene this guy is on he's always screaming, knocking things over and yelling on the top of his lungs and it really got on my nerves to the point were I turned down the volume just to enjoy the silence.\n\nThe whole movie is deep inside and out ugly just ugliness. Everybody in this movie is awful human being and how this movie treats women is unspeakably awful.\n\nNow Human Centipede 3 isn't as horrid or disgusting as the second movie I mean I almost throw up watching that movie. Yeah you get your graphic and gory violence in this one, but this time I didn't feel the need to throw up and take a shower every minute like the second made me do.\n\nOverall The Human Centipede 3 is a dull mindless Peace of sh*t gory feast that only sick in the head people would find enjoyment.",
            "review_date": "2015-05-24",
            "source": "rt"
        },
        {
            "content": "This movie was great, shitting in people's mouths has never been so coolð???",
            "review_date": "2015-05-24",
            "source": "rt"
        },
        {
            "content": "The Human Centipede III (Final Sequence) director Tom Six fails to up the ante in his recent and supposedly final installment of the Human Centipede series. The first film (First Sequence) gained notoriety on word of mouth alone, with its gross-out premise and self proclamations of being \"100% Medically Accurate.\" With the second film (Full Sequence), Tom Six set out to make the first film look like a ride at Disneyland, and he mostly succeeded with the sequel being banned in several countries upon its release. However, with the latest entry in the franchise, Tom Six ditches the \"100% Medically Accurate/Inaccurate\" taglines and goes for \"100% Politically Incorrect,\" this time going from a 12 person centipede (3 in the first film) to a 500 person centipede, made up entirely of prison inmates. Based on how the second film destroyed the first in terms of grossness and gore, one would naturally expect the third to do the same (or at least attempt to). Wrong. What we get the in third film feels like a half-baked attempt at social and political commentary about the American prison system and Guantanamo Bay (complete with water boarding). I have no issues with any commentary regarding those subjects, it's just not handled here very well and feels utterly pointless. HC3 just proves to loud, obnoxious, silly, and most surprisingly, dull. The film really goes nowhere at all in its 100+ minutes and is a real chore to get through. One of the biggest letdowns in HC3 is how little of the actual human centipede there is. Don't get me wrong, there are some disgusting and depraved scenes here and there, but the actual human centipede has very minimal screen time, and nothing is done with it at all, which feels like a missed opportunity. What we get instead is mostly just the mad ravings of prison warden Bill Boss, played Dieter Laser, who also played Dr. Heiter in the first film. He just mostly yells, cries, sticks his tongue out, sexually assaults his female assistant (played by porn star Bree Olson) and tortures inmates in a performance so over-the-top that it's almost irritating. He's accompanied by his dimwitted accountant Dwight Butler, in a terrible performance played by Laurence R. Harvey, who also played Martin in the second film. Every time he opens his mouth and says a line, it makes me thankful he was completely mute in the second film. And worst of all the film just ends in a very anticlimactic and abrupt manner and feels completely and utterly pointless, except for its vague attempt at political commentary. This was just a big disappoint to fans of this franchise everywhere and I will not be adding this to my horror collection anytime soon.",
            "review_date": "2015-05-24",
            "source": "rt"
        },
        {
            "content": "If I could give this movie zero stars, I would. Avoid this movie at all costs. And, did I mention that we only get to see the human centipede for the last 2 minutes of the movie?",
            "review_date": "2015-05-24",
            "source": "rt"
        },
        {
            "content": "Wow, what a huge pile of shit.  Dieter Laser has got to be the worst actor ever (and I know of Colin Farrell).  I loved the first two movies (I don't remember Dieter being so bad in the first one), but this was just horrible.",
            "review_date": "2015-05-23",
            "source": "rt"
        },
        {
            "content": "Bad. If you love controversial stuff, stick to the original.",
            "review_date": "2015-05-23",
            "source": "rt"
        },
        {
            "content": "Lo positivo de todo esto es que la película se pasa de volada. Ahora dejando los aspectos buenos puedo decir con gran certeza que la película es mala con ganas. Obviamente no esperaba encontrarme con una cinta nominada a premios importantes, pero esperaba algo que estuviera al nivel de las dos anteriores cintas, y no fue así, sino que me encontrado con una cinta que trata tener un ligero aire cómico que en lugar de eso termina siendo patético; actuaciones paupérrimas (aclaro, no esperaba mucho, pero vamos, incluso en las dos anteriores había un mejor nivel actoral -y decir eso, bueno...-), un guión mediocre, y un desarrollo de la historia plano y sin chiste alguno. En pocas palabras: La peor película del año.",
            "review_date": "2015-05-23",
            "source": "rt"
        },
        {
            "content": "A pretty weak finale to the series....",
            "review_date": "2015-05-22",
            "source": "rt"
        },
        {
            "content": "What could have been a fun gross-fest was just an hour and a half of Tom Six fellating himself.",
            "review_date": "2015-05-22",
            "source": "rt"
        },
        {
            "content": "don't waste your time and money",
            "review_date": "2015-05-22",
            "source": "rt"
        },
        {
            "content": "Gross, tasteless, unfunny and with no ounce of social or political subtlety. The human centipede 3 ends this disgusting trilogy in the worst way possible with poorly direction, flat performances and terrible scripting,\n\nWorst movie of 2015 so far.",
            "review_date": "2015-05-21",
            "source": "rt"
        },
        {
            "content": "One point for Eric Roberts\nOne point for the ridiculousness of the story\nOne more for Dieter Laser being ridiculously over-the-top",
            "review_date": "2015-05-20",
            "source": "rt"
        },
        {
            "content": "Yeah.. a pointless sequel.",
            "review_date": "2015-05-20",
            "source": "rt"
        },
        {
            "content": "Excellent movies you could ever want too see",
            "review_date": "2015-05-19",
            "source": "rt"
        },
        {
            "content": "Tom Six is a misanthrope with a sick sense of humor. I get it. There are several geek bloggers attending the screening I'd like to see in a human centipede. This movie is gross, as expected, and offensive to just about every group there is. It's kind of like a night at Fubar. Dieter Laser is completely bonkers and kind of fascinating to watch. The first movie is still the best, but this ass-to-mouth opus has come full circle.",
            "review_date": "2015-05-19",
            "source": "rt"
        },
        {
            "content": "BAD MOVIE ALL THE WAY",
            "review_date": "2015-05-19",
            "source": "rt"
        },
        {
            "content": "Unnecessary, vile, and absolutely disgusting.",
            "review_date": "2015-05-17",
            "source": "rt"
        },
        {
            "content": "The only good thing about this film is the word final in the title. Terrible movie!",
            "review_date": "2015-05-16",
            "source": "rt"
        },
        {
            "content": "totally amazing movie bros. I'd watch it if I was a racoon stump",
            "review_date": "2015-05-13",
            "source": "rt"
        },
        {
            "content": "This thing can't go any lower than half a star this movie was horrendous!",
            "review_date": "2015-05-11",
            "source": "rt"
        },
        {
            "content": "Officially the worst movie I have ever seen!",
            "review_date": "2015-05-08",
            "source": "rt"
        },
        {
            "content": "Why can't I give this piece of shit a 0?",
            "review_date": "2015-05-05",
            "source": "rt"
        },
        {
            "content": "Right now, I'm thinking that the producers of these films are fully aware how much they've shocked audiences with the first two instalments, so now they're focusing their attention on stunning them even more, which has fully detracted from any half decent storyline. First we had 3 unlucky souls that were introducing the concept, then we had 10 more randoms that were sewn together to create a bigger and better centipede in the sequel. Now we have a whole prison stitched from mouth to anus in an attempt to keep crime to a minimum. From the very first scene, this is vulgar to the extreme, taking the crudeness and amount of blood spilt to a whole new level. We have castration scenes, kidney rape scenes, dried clitoris scenes, all in addition to the usual brutal measures surrounding the formation of the creature. We even have cameos from the creator of the concept himself, as well as a former porn star and Julia Roberts' brother. Half of the time I can't understand what the main governor guy is saying as his accent is so strong, and all in all it feels very patchy and without any real flow. At least the first couple were reasonably well produced, regardless of the twisted concept, but this has just been thrown out without a lot of professional development. The continuity has really flawed the quality of this and I felt it became hard work to watch in the latter stages. I think this series has shocked us just about as much as it can now, and it's probably time to cut the crap before any bright spark gets any thought on introducing the human millipede!",
            "review_date": "2015-04-11",
            "source": "rt"
        },
        {
            "content": "Couldn't wait for it to be over.  First one was good, two and three were misses.",
            "review_date": "2015-04-07",
            "source": "rt"
        },
        {
            "content": "Loved 1 & 2...this \"final sequence\" was beyond bad!! I wished I could beat the fuck out of Bill Boss about 10 minutes in",
            "review_date": "2015-03-07",
            "source": "rt"
        },
        {
            "content": "The first two were great.  This one was crap !!",
            "review_date": "2014-10-11",
            "source": "rt"
        },
        {
            "content": "How do they have money to keep making these horrible movies. People stopping watching...",
            "review_date": "2014-06-16",
            "source": "rt"
        },
        {
            "content": "And that should be the final sequence.",
            "review_date": "2014-03-04",
            "source": "rt"
        },
        {
            "content": "I've never felt so annoyed by a film in my life. Please avoid like the plague!",
            "review_date": "2014-01-27",
            "source": "rt"
        },
        {
            "content": "Trying to be a smart social commentary but sadly, ends up really sickening, annoying and surprisingly, BOOOOORRIIIING!!!!.",
            "review_date": "2013-10-20",
            "source": "rt"
        },
        {
            "content": "Absolutely atrocious. Is there any way I can score lower than a 0.5/5?",
            "review_date": "2013-06-29",
            "source": "rt"
        }
    ]
}