{
  "title": "3:10 to Yuma",
  "rating": 7.3,
  "release_date": "2007-09-07",
  "summary": "In Arizona in the late 1800's, infamous outlaw Ben Wade and his vicious gang of thieves and murderers have plagued the Southern Railroad. When Wade is captured, Civil War veteran Dan Evans, struggling to survive on his drought-plagued ranch, volunteers to deliver him alive to the 3:10 to Yuma, a train that will take the killer to trial. OnIn Arizona in the late 1800's, infamous outlaw Ben Wade and his vicious gang of thieves and murderers have plagued the Southern Railroad. When Wade is captured, Civil War veteran Dan Evans, struggling to survive on his drought-plagued ranch, volunteers to deliver him alive to the 3:10 to Yuma, a train that will take the killer to trial. On the trail, Evans and Wade, each from very different worlds, begin to earn each other’s respect. But with Wade’s outfit on their trail – and dangers at every turn – the mission soon becomes a violent, impossible journey toward each man's destiny. (Lions Gate)\r… Expand",
  "critic_reviews": [
    "James Mangold's 3:10 to Yuma restores the wounded heart of the Western and rescues it from the morass of pointless violence.",
    "The new version is a glorious, thrilling throwback that never sacrifices its solid roots in the western genre despite a sharp modern update that actually improves on the original.",
    "The finest American Westerns have a characteristic that 3:10 to Yuma shares. In a way that's almost mystical, they suggest a truth beyond the specifics of the tale.",
    "The rousing new Western 3:10 to Yuma has the sweep of an epic and the economy of a stopwatch.",
    "James Mangold directs it with such energy and passion that it's as if he didn't know it's all been done before.",
    "Mangold has time to build sensational, studied characterizations, brilliant pacing (courtesy Mike McCuster, who also edited the director’s previous effort, the Johnny Cash biopic “Walk the Line”), and blistering action.",
    "The nerve-racking wait at the Contention hotel is no longer the film's centerpiece, but the deeper characterization gives Bale an opportunity to once again sink his teeth into a complex role, and offers a reminder as to why the notoriously difficult Crowe is sometimes worth the trouble.",
    "Unlike Glenn Ford, a soft-spoken studio star who was cast against type as Wade 50 years ago, Crowe is a perfect fit. Not because of his bad boy behavior offscreen, but because he can blend charm and menace better than anyone.",
    "Both actors are among the best, most intuitively creative we have, and whatever transpires offscreen in Crowe’s case, onscreen they only serve their characters. Neither man showboats here, and it’s a thrill to watch them work.",
    "A riveting remake of a pretty terrific 1957 western about manhood, fatherhood and honor.",
    "What Alfred Hitchcock once said about thrillers also applies to Westerns: The stronger the bad guy, the better the film. By that measure, 3:10 to Yuma is excellent.",
    "Mangold delivers a taut modern take on a lesser classic, preserving the \"High Noon\" themes about doing the right thing against all odds, and injecting a more modern pacing and urgency without going overboard. His film isn't Leonard's classic, but it's a solid, genre-respecting Western in its own right.",
    "A fine and sturdy picture, capable of standing alongside the many such films made when Westerns were one of our chief entertainments.",
    "A largely compelling ride on the strength of a powerful cast led by Russell Crowe and Christian Bale.",
    "In this movie, Fonda really is iconic. 3:10 to Yuma may be familiar, but, at its best, it has a rapt quality, even an aura of wonder.",
    "James Mangold's remake walks a fine line in retaining many of the original's qualities while smartly shaking things up a bit.",
    "Period westerns are so unfashionable and costly that they usually require a top-drawer script to get off the ground -- and this one, adapted from an Elmore Leonard story and its 1957 movie version, travels with an arrow's clean arc.",
    "Who says remakes are always inferior to the original film? And who says the western is dead? Especially when a movie is as entertaining as this one, you begin to think this formerly beloved genre is due for a revival.",
    "This film is an example of a Western that ought to appeal to a healthy-sized contemporary audience, and is also a remake of the 1957 film of the same name, which is a hallmark of the type of psychological Western.",
    "This is how a Western today tries to give us more bang for the buck. By working this hard to be a crowd-pleaser, though, it may please fewer crowds.",
    "The 30-minute finale, which includes a tense stand-off with Ben's gang, is masterfully executed. It's perfectly paced, suspenseful, and ends in a way that's both appropriate and satisfying.",
    "Maybe this redo didn’t need so many bells and whistles, but Mangold brings it home.",
    "Mangold has been smart or fortunate in casting, and personalities sustain interest even when the narrative flags.",
    "Captures a potent sense of the Old West with its multidimensional raw performances and captivating final shootout sequence. But with its emphasis on emotional truths, it transcends the confines of a cowboy movie.",
    "While the newer version's darker ending lends a more contemporary twist, overall 3:10 to Yuma is reverent to the original – a few more bullets and more spilled blood notwithstanding.",
    "An extremely well-acted and well-directed remake of a 1957 oater.",
    "In the battle of the leading men, Crowe's character has a slight edge, and the actor really makes the most of it, showing us how boyishly mischievous charm and utter venality can exist without seeming contradiction in the same being. But Bale builds to a pretty impressive boil himself after laying back for about three quarters of the film.",
    "What this version offers is the chance to watch Russell Crowe and Christian Bale—two of the more charismatic, macho leading men around--duke it out psychologically, while another fine but less well-known intensity artist, Ben Foster, steals",
    "The movie's best performance belongs to Peter Fonda. Tough, terrific, and totally unrecognizable as a bounty hunter, this cantankerous old hippie is so leathery he deserves his own line of rawhide apparel.",
    "Under Mangold’s sure if uninspired hand, the new Yuma is reasonably exciting and terse, and, like its predecessor, built around a memorable villain of ambiguous villainy.",
    "More likely to be recalled as a moderately satisfying entertainment than remembered as a classic.",
    "Overall, the picture is accomplished, intelligent and, in places, a little dull. Mangold isn't an economical filmmaker, and parts of 3:10 to Yuma suffer from needless bloat. The new version doesn't use the same kind of blunt, visually arresting shorthand as Daves' original...And yet somehow, maybe just barely, Mangold -- succeeds on his own terms, largely because the actors he's working with here.",
    "As Ben Wade, gang leader and murderer, he gives an ironic performance, but Crowe’s irony is more intense than other actors’ obsession. He turns the idea of having so few emotions--of being beyond caring--into a bloody joke. He upstages everyone with his laughing eyes.",
    "The result bears so little resemblance to the original that you have to wonder what happened. It seems more a remake of \"How the West Was Won\" than 3:10 to Yuma.",
    "The acting is its chief strength. Russell Crowe brings a cocky charisma to Ben Wade.",
    "The strengths of the first \"3:10 To Yuma\" were enhanced by its proportionality -- an intimate story told in 92 minutes. The story is no bigger in the new version, which goes on for 117 minutes. And it's certainly not better.",
    "The remake adds 24 minutes and subtracts most of the suspense."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Human fleshed out characters with motives and a history to them, even if imagined off screen (that's how well they are written and played).  Excellent performances, quiet moments of reflection, cruelty and understanding, great actionHuman fleshed out characters with motives and a history to them, even if imagined off screen (that's how well they are written and played).  Excellent performances, quiet moments of reflection, cruelty and understanding, great action sequences and a sly but honest script.  You can forgive the somewhat unrealistic ending to quite a large degree if you apply the fore mentioned motivation and understanding.Ben Foster deserved best supporting actor for this film.",
      "review_date": "2012-01-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In most regards this is a very traditional western. Well cast, well acted. There is a little too much moral ambiguity with a central character, to a degree which for me was not credible. Overall a little lacking in substance",
      "review_date": "2011-06-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nJames Mangold's remake of the stellar 3:10 to Yuma is a mixed bag - there's some great acting, and beautiful camerawork, but also a fairly implausible script. Christain Bale and Russel Crowe star as a poor ranch owner Dan Evans and the infamous highwayman Ben Wade. Ben Foster and Peter Fonda strengthen the otherwise lacklustre supporting cast, both giving powerful performances. A lot of users have rather harshly critiqued the lack of realism in the script and if it weren't for Bale and Crowe's strong acting the implausibility and holes in the script might have shone through even moreso. For example, the bizarre ending - Crowe suddenly decides to allow himself to be captured, but rather than simply call off his gang he further endangers himself and Bale by being chased by the bloodthirsty gang to the train station. If he was trying to make Bale's character look like a hero, this would make some sense, but then all logic is thrown out the window as he shoots every remaining member of his gang. This really held back the film for me, and I otherwise would have scored it an 8.It's a little hard to score 3:10 to Yuma, because there's a lot of conflicting elements holding back the film from legend status, but despite these frustrations it's still a very entertaining watch.",
      "review_date": "2012-03-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I cant say much but wow. I wasn't so sure about this movie at the beginning, but as it progressed, it drew me in more and more. The star part of this movie is it's ending. In simple words, suspenseful, amazing, beautiful. Dialog may be aI cant say much but wow. I wasn't so sure about this movie at the beginning, but as it progressed, it drew me in more and more. The star part of this movie is it's ending. In simple words, suspenseful, amazing, beautiful. Dialog may be a little difficult to understand at important parts, but once you go back and put the pieces together, you will quickly  realize this movie is a master piece. I got it on Blu ray for 5 dollars. Best 5 dollars iv ever spent.",
      "review_date": "2011-12-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Its something that we've seen before, its almost impossible to have an actor whose so high powered (Crowe) play the bad guy, he can do \"bad\" things but he must always have a reason. Ben Wade (Crowe) is like that he can kill anybody but he'sIts something that we've seen before, its almost impossible to have an actor whose so high powered (Crowe) play the bad guy, he can do \"bad\" things but he must always have a reason. Ben Wade (Crowe) is like that he can kill anybody but he's kind of excused because he likes to sketch and has that I'm not all bad look. Its pretty much Collateral but with horses and dirt. Its a remake of an imperfect movie having the imperfections of the original, but with better actors and more emphasis on the journey. There are some shining moments from the supporting cast, but the movie is all about Bale and Crowe. The relationship present is more due to the actors rather than the characters. Bale manages to make Evans very likable as he comes to terms that the journey is for something more than money. Despite all this Crowe overshadows everybody, presenting a character that's interesting and humane. Although the actors have their shining moment, the action is not all that great especially the final shoot-out. Its a shame to see a solid movie being spoiled so late.",
      "review_date": "2012-02-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A good western story with lots of action. The ending (and actually some other parts as well) seemed a bit unrealistic, to be honest, but  it's not that implausible that I couldn't believe it if I wanted to.",
      "review_date": "2015-10-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The original 1957 version of 3:10 To Yuma—one of the first film adaptations of an Elmore Leonard story, alongside 1957's The Tall T—is a typical psychological Western, a lean, rangy black-and-white film as much about what its protagonists areThe original 1957 version of 3:10 To Yuma—one of the first film adaptations of an Elmore Leonard story, alongside 1957's The Tall T—is a typical psychological Western, a lean, rangy black-and-white film as much about what its protagonists are thinking as what they're actually doing. It opens straight into the central action, with a stagecoach robbery gone wrong, and only comes back to establish its characters' backstory with a few spare sentences. By contrast, the 50-year-anniversary remake directed by Walk The Line's James Mangold jumps into a different action scene that establishes the desperate situation of Arizona rancher Christian Bale, in debt and about to lose his land. Screenwriting team Michael Brandt and Derek Haas (2 Fast 2 Furious) spend more time digging into their characters than Leonard did, as if determined to make sure viewers know and care about all of them before they start facing hails of bullets.\r They're also determined to up the body count considerably. That becomes clear during the key robbery, which was an almost civil affair in the original, but becomes a bloodbath this time around. Still, while outlaw leader Russell Crowe is an unrepentant killer—when a surviving guard takes one of his men hostage, Crowe casually shoots them both dead—he has his honorable side. When Bale and his two sons happen across the theft in progress, Crowe leaves them unharmed, but on foot, though he thoughtfully tells them where he's planning to leave their horses for retrieval. Still, Bale is humiliated by his helplessness and by the judgmental cynicism of his teenage son Logan Lerman. When Bale decides to help capture Crowe, evade his murderous gang, and transport him to a train bound for Yuma Prison (in a sort of Old West version of 16 Blocks), he's partially motivated by a desperate need for the cash fee, but his desire to regain his son's respect likely plays a major role too.\r It's hard to tell, since Bale and Crowe both play their cards close to the chest, embracing the Western aesthetic with tight, controlled performances. The film itself is more expressive, with its gory murders, big chase scenes, explosions, and other major expansions of the originally short tale. Brandt and Haas go too far in trying to pack their characters with extra humanizing characteristics—Bale has a peg leg, Crowe likes to sketch his surroundings—and their version of the ending seems ridiculously improbable. But Mangold delivers a taut modern take on a lesser classic, preserving the High Noon themes about doing the right thing against all odds, and injecting a more modern pacing and urgency without going overboard. His film isn't Leonard's classic, but it's a solid, genre-respecting Western in its own right.",
      "review_date": "2016-03-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of my favourite movies. This movie was more about emotion/group psychology than realism. Yet much of it was still somewhat realistic. I cried at the part when Crowe decides to help his enemy. It's hard for a person to see the amazement ofOne of my favourite movies. This movie was more about emotion/group psychology than realism. Yet much of it was still somewhat realistic. I cried at the part when Crowe decides to help his enemy. It's hard for a person to see the amazement of this movie, but if you truly understood it for what they wanted it to be, you will. You can't have a guy put a depth of his soul experience of an abstract forest containing the pain of being beaten as a child and showing it to a well easy laid guy and expect him to see it the same as another person who also had been beaten, as an example. A movie is often considered an art piece. Like a painting. For those who don't understand why Crowe killed his crew, it's not about his personal advantage. It's about him living from what he felt was right. Because deep in his life of treachery and theifdom, he had a chance to help someone who he rarely got the chance to, someone who he secretly admired for being one the most caring people he met.",
      "review_date": "2018-04-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Your viewer Ed D. has it almost exactly right: it amazes that none of the mainstream reviewers remarked on the extraordinary implausibility of the plot, which weakens the story to virtually laughable. It also surprises me that all reviewers Your viewer Ed D. has it almost exactly right: it amazes that none of the mainstream reviewers remarked on the extraordinary implausibility of the plot, which weakens the story to virtually laughable. It also surprises me that all reviewers thought Russell Crowe's performance excellent. He came across as Russell Crowe having a great ol' time, not as a 19th century villain. All the other actors were excellent, the scenery beautiful and the psychological play between the two protagonists interesting. The ending sequence between Crowe and his gang makes no sense whatsoever and is utterly implausible.",
      "review_date": "2008-01-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Too violent, too long, implausible ending.",
      "review_date": "2007-09-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The characters kept making decisions and doing things that just are not plausible! How do movies like this get made? In pre-production does nobody ever say \"hey lets change the script to make it more plausible or not insulting to someone The characters kept making decisions and doing things that just are not plausible! How do movies like this get made? In pre-production does nobody ever say \"hey lets change the script to make it more plausible or not insulting to someone with a brain\". How does Russell Crowe or SOMEBODY not have a little chat to the director and change a few things so i don't have to roll my eyes and think 'are you kidding me! you expect me to swallow that!",
      "review_date": "2009-02-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "3.10 to Yuma perpetuates the naive myth cold blooded psychopathic criminals are charismatic, surrounded by beautiful women and capable of becoming good. Having worked in in the criminal law field, I can tell you this is far from reality. 3.10 to Yuma perpetuates the naive myth cold blooded psychopathic criminals are charismatic, surrounded by beautiful women and capable of becoming good. Having worked in in the criminal law field, I can tell you this is far from reality. Criminals or anyone who's been in trouble with the law for serious crimes are not capable of empathy (their brain wiring is different) or change. Furthermore they surround themselves with skanky money hungry women who are insecure (because of their self-perceived ugliness). They have no charm as the only thing in life they chase is sex and money. They are not interested in history, art, travel, or gain any enjoyment in the the world or the human experience. 3.10 to Yuma could have been a great film (beautifully filmed, multilayered conflict, great actions sequences and performances) but sadly it was cliched-bad person gets a conscience.",
      "review_date": "2008-02-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Fairly well made movie _until_ the last scene, as it totally went against the orginal 3:10 to Yuma movie (rent it) and the character played by C Bale lives (with his wife looking on, no less)! The ending of this remake is absolutely foolish, Fairly well made movie _until_ the last scene, as it totally went against the orginal 3:10 to Yuma movie (rent it) and the character played by C Bale lives (with his wife looking on, no less)! The ending of this remake is absolutely foolish, and the writer and director should be given a 1 year suspension for silly and useless graphic violence for the sake of blood letting. Why not let the Hero (Bale) live and let the repentant murderer (Crowe) be judged willingly? It is just plain silliness for box office receipts.",
      "review_date": "2008-02-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Pretty awful stuff this. Followed it up with the equally dreadful Michael Clayton. Has American cinema reached its nadir? If not it soon will.",
      "review_date": "2008-02-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is one of those films that makes a farce of the entire movie review system. It got very good reviews from almost all sources, and it is so horribly bad that I really had to ask if the I had seen the right movie. The acting, the This is one of those films that makes a farce of the entire movie review system. It got very good reviews from almost all sources, and it is so horribly bad that I really had to ask if the I had seen the right movie. The acting, the directing, and everything else about this piece of garbage is almost remarkable. Have a clue. those of you who review films. This thing is a very bad joke. If there could be a rating lower that 0 I'd use it here.",
      "review_date": "2008-01-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A solid, but maybe a bit slow-moving western, up until the last 15 minutes. The ending is a real head-scratcher and knocked at least 2 points off my rating.",
      "review_date": "2008-02-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of my favourite movies ever, absolutely lovced it everytime i saw it, the amount of idiots on here that gave this a low score is laughable. It is one of the best westerns i have  ever seen and the music to it was wonderful.",
      "review_date": "2010-11-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Such a disappointing movie! Two off my favorite actors ever and they are miscast. Crowe and Bale are unable to bring any life to there roles. Director Mangold just paints by the numbers. A better director could have done something interestingSuch a disappointing movie! Two off my favorite actors ever and they are miscast. Crowe and Bale are unable to bring any life to there roles. Director Mangold just paints by the numbers. A better director could have done something interesting with this movie and gotten better performances from his actors. It doesn't help that the screenplay is terrible. It 's one big cliche. The only bright spot in the film is Ben Foster. He is very good and steels the movie. Had the movie been about his character it might have been good",
      "review_date": "2015-02-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'm not crazy about westerns, nor of violent films. I was convinced to see this movie and I'm so glad I did. The use of psychology and philosophy to show the characters was brilliant. Showing that anybody, regardless of moral I'm not crazy about westerns, nor of violent films. I was convinced to see this movie and I'm so glad I did. The use of psychology and philosophy to show the characters was brilliant. Showing that anybody, regardless of moral character, can fall over to the opposite side. Even the good guys struggled with staying \"good.\"",
      "review_date": "2007-10-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A very entertaining. The story gets a little fuzzy near the end regarding Wade's choices, but otherwise a great story.",
      "review_date": "2007-09-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Good Western's have provided meaningful messages about life and relationships and this one provided several good ones. Crowe's and Bale's performances standout in this film and together they enabled the director to deliver Good Western's have provided meaningful messages about life and relationships and this one provided several good ones. Crowe's and Bale's performances standout in this film and together they enabled the director to deliver valuable lessons about home, family, and the brutalities of life. Despite some of the character actors and script flaws in the film, a good western was delivered for the money.",
      "review_date": "2007-09-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Simply good...don't go further! Classic western, efficient and true! A must see for all western lovers!",
      "review_date": "2007-09-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very good, entertaining film. I was never a huge fan of westerns, but was surprised at how much I enjoyed this movie. Well paced and acted, I would recommend it to anyone who enjoys a good action drama.",
      "review_date": "2007-09-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The treacherous ending immediately erases all the very substantial accomplishments in the film. Shame. Go rent the original first at least.",
      "review_date": "2007-09-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The acting was solid but the script was DREADFUL... more holes in it than the shot up bodies in the film and that ending??? Save your money and rent \"Unforgiven\"-- which deserves the reviews this bad movie seems to be racking up. Sorry, just The acting was solid but the script was DREADFUL... more holes in it than the shot up bodies in the film and that ending??? Save your money and rent \"Unforgiven\"-- which deserves the reviews this bad movie seems to be racking up. Sorry, just not good -- again, despite many terrific performances.",
      "review_date": "2007-09-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Absolutely ridiculous all the way through. From the needlessly bloody and ill-handled stagecoach robbery, to the mind-numbingly insipid ending, the entire film was an exercise in credulity assault. The bad guy escapes as often as he wants Absolutely ridiculous all the way through. From the needlessly bloody and ill-handled stagecoach robbery, to the mind-numbingly insipid ending, the entire film was an exercise in credulity assault. The bad guy escapes as often as he wants and kills as he goes because his captives mindlessly do not secure him, outside of some handcuffs. Sharpshooters are killing moving stagecoach drivers from improbable distances with deadly accuracy but in the final sequences can't seem to hit the broad side of a barn while standing right in front of it. I could not get past the miserable storyline to enjoy any 'psycho drama' said to be unfolding along the way. Even watching the film for free, I felt violated.",
      "review_date": "2008-03-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was a modern version of an old style western. I loved that it wasn't super realistic and gritty. I loved Russell Crowe and the ease in which his character",
      "review_date": "2007-10-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A lot of violence, but awesome performances. Grabs hold of your emotions. The Western is back!",
      "review_date": "2007-10-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Yes this is the one if you like the old West with a twist. Twist it does just about throughout the whole movie. So put on your spurs and saddle-up with a bag of Non-Buttered Popcorn and a 16 Caliber Diet Coke and Enjoy the Show. Regards, HK.",
      "review_date": "2007-10-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is a farce. If you are looking for a movie so unrealistic that it is comedic - go see this. Example: a group of lawmen are in an upstairs room looking down on 7 bad guys (all of whom are known murderers) who are ALL LINED UP in This movie is a farce. If you are looking for a movie so unrealistic that it is comedic - go see this. Example: a group of lawmen are in an upstairs room looking down on 7 bad guys (all of whom are known murderers) who are ALL LINED UP in front of them, but they don't open fire. Instead, they hold up their hands and walk out in their own straight line so they can be shot down and butchered. It is a movie with NOTHING to offer and the reviews here mystify me. Go rent Unforgiven to see a class act western. This is dreck.",
      "review_date": "2007-09-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Revival of a great genre with 21st century technique, led by fine performances",
      "review_date": "2007-09-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Worst movie ever. melodramatic, non-westerner, nothing to look forward to. Bale and Crowe can't even hide their accents.",
      "review_date": "2007-09-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "As the movie is based on the work of one of my favorite writers (Elmore Leonard), and starring some of my favorite actors (Christian Bale and Russell Crowe), I felt compelled to watch it. I'm happy to report it is simply the best movie As the movie is based on the work of one of my favorite writers (Elmore Leonard), and starring some of my favorite actors (Christian Bale and Russell Crowe), I felt compelled to watch it. I'm happy to report it is simply the best movie I've seen all year. The pace is tight, there are no extraneous material to distract. The acting is superb, as is the story. There isn't so much as one thing I can negatively review about this movie. Watch it and enjoy.",
      "review_date": "2007-09-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Oh, Lordy, this is a mess. Mildly effective at times, but jaw-droppingly bad much more often. Ridiculously overrated, especially if you like westerns or what you thought was Russel Crowe's work ethic (he smirks his way, Burce Willis Oh, Lordy, this is a mess. Mildly effective at times, but jaw-droppingly bad much more often. Ridiculously overrated, especially if you like westerns or what you thought was Russel Crowe's work ethic (he smirks his way, Burce Willis style, through this). [***SPOILER***] Character's constantly switch loyalties without real motivation, Peter Fonda is shot in the solor plexis, yet responds as if merely bothered by a 24 hour flu, Russel Crowe is treated like a prince when he's captive and offered repeated oportunities to kill, one by one, his meaner captors, while the nice ones react with chagrin; at one point the menacing, one dimensional bad guys cluster like a shooting gallery in the open, but, nope, our lug headed good guys don't take a shot, they're thinkin' on what to do. At one point, I swear, I thought a reel had been skipped. You've been warned.",
      "review_date": "2007-09-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Distracting, entertaining at times, but overall an insignificant addition to the genre, and also guilty of having an antagonist whose unbelievable actions only exist to place twists in the plot. Diasppointing",
      "review_date": "2007-09-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Amazing film with an even more amazing cast. Love Crow and Bale together too. Hope they have other projects together in the future. The ending with it's moral ambiguity is wonderful. Maybe a sequel of some kind?",
      "review_date": "2007-09-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very well done. Best western movie in a long time. Kept my attention the whole time. The acting is great along with some great gun fights and twists. Overall, a great movie.",
      "review_date": "2007-09-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A great western, given the lack of westerns in the last 10 years. This is a great movie to go see and I strongly suggest that you do so. its blends modern day thriller with old west shoot outs, bounty hunters and carriage robbery with modern A great western, given the lack of westerns in the last 10 years. This is a great movie to go see and I strongly suggest that you do so. its blends modern day thriller with old west shoot outs, bounty hunters and carriage robbery with modern day thrills.",
      "review_date": "2007-09-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Absolutely wonderful. Great acting, story and pacing. I haven't loved westerns for a long time, but the love affair has been rekindled, at least for 3:10 to Yuma. Crowe is magnificent as Ben Wade, Bale brings us all we need in a sturdy Absolutely wonderful. Great acting, story and pacing. I haven't loved westerns for a long time, but the love affair has been rekindled, at least for 3:10 to Yuma. Crowe is magnificent as Ben Wade, Bale brings us all we need in a sturdy portrayal, and newcomer Ben Foster, a character actor to watch in the future.",
      "review_date": "2007-09-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I really enjoyed this film..imagine a grown-up adult film with no superheroes,wizards or shaky camera work.The fifties original was suited for its time but Mangold's version is meatier and Crowe is outstanding",
      "review_date": "2007-09-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I thought the rhythm of the film was on point. The actors were all well cast, except for Luke Wilson - what are you doing in there? Not being a fan of typical male themes - pride, honor, braun - it seemed that this film didn't let those I thought the rhythm of the film was on point. The actors were all well cast, except for Luke Wilson - what are you doing in there? Not being a fan of typical male themes - pride, honor, braun - it seemed that this film didn't let those characteristics become characatures. And Ben Foster should get a few more mentions for his delicious portrayal of Wade's right hand.",
      "review_date": "2007-09-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wayyyyyyyyyyyy too intense for me, but my husband was over the moon excited. He loved every second of it and plans to buy the DVD as soon as it comes out. High praise from a guy whose favorite film genre is western, and who's been Wayyyyyyyyyyyy too intense for me, but my husband was over the moon excited. He loved every second of it and plans to buy the DVD as soon as it comes out. High praise from a guy whose favorite film genre is western, and who's been woefully disappointed in the past. Audience was so quiet and involved, you could have heard the proverbial pin drop, and then a great big exhale and the end.",
      "review_date": "2007-09-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A fun yet heavy western. Well acted which makes this almost formula movie much better to watch. I escaped into a bygone era when right and wrong was clear. The critical difference and one worth noting is right and wrong got mixed and I A fun yet heavy western. Well acted which makes this almost formula movie much better to watch. I escaped into a bygone era when right and wrong was clear. The critical difference and one worth noting is right and wrong got mixed and I really enjoyed that exploration. Crowe and Bales are really superb. The action is a bit expected , but still fun.",
      "review_date": "2007-09-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "James Mangold may not be a genius as a Director, but if he isn't I would sure like to meet the guy who is ahead of him in line. 3:10 to Yuma is action packed and the story flows naturally from beginning to end; there are no rough spots James Mangold may not be a genius as a Director, but if he isn't I would sure like to meet the guy who is ahead of him in line. 3:10 to Yuma is action packed and the story flows naturally from beginning to end; there are no rough spots here. Russell Crowe and Christian Bale are each worth the price of admission alone, together they are terrific. The young actor who plays the 14 year-old son has a very bright future if he can keep it between the white lines and out of the ditches of booze, drugs, and too many \"party women\". The tension and interaction between the 3 of them was compelling throughout. The Mangold-directed \"Walk The Line\" had one of the best movie beginnings of all time, while 3:10 has one of the best, most satisfying endings. This movie lived up to the hype, something that cannot be said about most movies.",
      "review_date": "2007-09-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There are very few Westerns that I like that aren't directed by either Sergio Leone or Sam Peckinpah. I despise all John Wayne's films, for example. Last year's \"The Proposition\" was good but hardly inspiring. James There are very few Westerns that I like that aren't directed by either Sergio Leone or Sam Peckinpah. I despise all John Wayne's films, for example. Last year's \"The Proposition\" was good but hardly inspiring. James Mangold's version of \"3:10 to Yuma\" is a masterpiece and may very well be my fave western ever. This movie ripped my heart out. I could not talk for ten minutes after walking out of the theater...",
      "review_date": "2007-09-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a woeful film - I wanted to like it and really thought i would enjoy it. But the story is rubbish and the characters consistently do things which don't make sense - it fails even on the ground of basic narrative plausibility. This is a woeful film - I wanted to like it and really thought i would enjoy it. But the story is rubbish and the characters consistently do things which don't make sense - it fails even on the ground of basic narrative plausibility. The acting isn't bad, but that really means little if your characters and events have NO credibility or authenticity. Overall, this film is fatally flawed by Poor writing and should have never been sanctioned as fit for production. Shame on these critics for praising it so....",
      "review_date": "2008-01-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wow fun movie, totally unfair for alot of people on here bashing it. its probably the same person for all i know, unless everyones lost their minds, this movie had such a good script, strong emotional prevalance compared to many other action Wow fun movie, totally unfair for alot of people on here bashing it. its probably the same person for all i know, unless everyones lost their minds, this movie had such a good script, strong emotional prevalance compared to many other action movies with an empty story, this one actually has \"heart\" or shall i say, a mind of its own, like a gun triggering off, nonstop. a very nice remake, my final personal rating is a 3/4 not a masterpiece like say, lord of the rings, but seriously HOW CAN someone give this a 1 or a 2? thats sooo lame seriously if you watch the directing, the pace of the film, the script...it all moves smooth slick and a fulfilling western action/flick starring two great actors. do you have any idea how ridiculed i am with such low ratings? if your going to bash a movie, why dont you try something like \"era gone\" lol this ones so ON though! its got a pulse, yah thaz right. bite it.",
      "review_date": "2008-10-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Good acting, but character decisions make no sense at all. Not from objective point of view, and not even from viewing the character development during the movie. Why should Croves character make a turn around ? Only because he saw a father Good acting, but character decisions make no sense at all. Not from objective point of view, and not even from viewing the character development during the movie. Why should Croves character make a turn around ? Only because he saw a father and his kid ? Because he saw a stupid Farmer without leg taking stupid decisions bringing his family in jeopardy ? Nah, I couldn't even say from whom this western would be likable, but for anyone having a little spirit for a story it certainly is not.",
      "review_date": "2008-02-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'll admit, it was a great movie. Cristian Bale was great, whatever. Now that I have that out of the way, I do want to say this, it could never touch the caliber of The Assassination of Jesse James by the Coward Robert Ford. Criticize I'll admit, it was a great movie. Cristian Bale was great, whatever. Now that I have that out of the way, I do want to say this, it could never touch the caliber of The Assassination of Jesse James by the Coward Robert Ford. Criticize me all you want. There was no powerful cinematography, the script was almost useless, and there are some major pacing issues here. Jesse James may have been slow, but it's pace was consistent. I'm sorry, but the 3:10 pace is, at one moment ultra-fast, the next, so slow that it puts you to sleep because you are accustomed to the quick pace. However, I did like the storyline and the acting was...good. Can't touch Jesse James.",
      "review_date": "2008-02-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great acting and a good story.",
      "review_date": "2008-02-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "As a fourteen year old boy I know that this movie should not appeal to me but it does and for that reason it really grinds my gears when a critic who has only read the story line gives a movie a bagging. This is another great story of one of As a fourteen year old boy I know that this movie should not appeal to me but it does and for that reason it really grinds my gears when a critic who has only read the story line gives a movie a bagging. This is another great story of one of the great men and women of the US country music scene - not unlike Coal Miners Daughter. I give it 10/10 - loved it!!!",
      "review_date": "2008-02-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An interesting movie of morals and virtues. It was all around well done. However, some parts had just too much shooting, while others had too little. The movie seems undecided whether it wants to be a charachter piece, or an action movie.",
      "review_date": "2008-03-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Excellent movie. If you like complex characters in a story then this one's for you.",
      "review_date": "2008-03-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "As those who wrote before me have mentioned, the acting is the saving grace of this trite tale. I haven't read the Leonard story, but I hope it provides a bit more insight into the ridiculous and sudden character dynamics in the final As those who wrote before me have mentioned, the acting is the saving grace of this trite tale. I haven't read the Leonard story, but I hope it provides a bit more insight into the ridiculous and sudden character dynamics in the final quarter of the plot. I found myself waiting for some other element of the film to catch up with the performances. Unfortunately, nothing stepped up to the plate: the cinematography was everything short of poetic, the attention to detail faded just when it was needed the most (the shoot-out), and - as I mentioned before - the plot jumped tracks at the end. Despite its shortcomings, it's still an enjoyable romp. It could have been much more than that, though.",
      "review_date": "2008-03-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The first 3/4 of the film are sheer brilliant intensity, and deserve a score of 10/10. In the final half hour, the acting remains superb, but the plot breaks down badly. I can't quite wrap my head around the illogic of the final scenes, The first 3/4 of the film are sheer brilliant intensity, and deserve a score of 10/10. In the final half hour, the acting remains superb, but the plot breaks down badly. I can't quite wrap my head around the illogic of the final scenes, and I can't quite love the film because of that. Still, it's well worth watching, and exciting to see such an excellent Western in this day and age. The best since Unforgiven.",
      "review_date": "2009-01-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Nice classic western action movie; very good production values and acting. The story is a bit too straightforward, no surprises here.",
      "review_date": "2009-05-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In a crucial scene, Ben Wade(Russell Crowe) violates the old dictum that there is \"honor among thieves\", which makes him an anti-hero if you're the sort of person who roots for the bad guy. You sort of feel bad for Charlie Prince(Ben In a crucial scene, Ben Wade(Russell Crowe) violates the old dictum that there is \"honor among thieves\", which makes him an anti-hero if you're the sort of person who roots for the bad guy. You sort of feel bad for Charlie Prince(Ben Foster) in the end. His undying loyalty for Ben makes him heroic, even if he's on the wrong side of the law. Charlie(whose last name is \"Prince\" for a reason) will do anything to protect his \"king(?)\". \"3:10 to Yuma\" is interesting because there are two heroes. Dan is the official hero; Ben Wade is the anti-hero(the murderer with a heart); and then there's Charlie Prince, who will do anything to protect save another person's life, which is, by definition, a hero. \"3:10 to Yuma\" is one good-looking western, and like any good western, its law-and-order men are faced with the same moral quandries as the bad guys.",
      "review_date": "2007-11-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The longer it went on, the more it lost me. Good acting and atmosphere, but the characters made choices that made less and less sense, culminating in an absolutely unbelievable ending, and the pace alternated between being too slow and The longer it went on, the more it lost me. Good acting and atmosphere, but the characters made choices that made less and less sense, culminating in an absolutely unbelievable ending, and the pace alternated between being too slow and jumping over sequences and leaving us confused. James Bond can do that stuff and get away with it, because James Bond is a cartoonish character and we expect him to be over-the-top, but this lays claim to a more reality-based framework. It's a forgettable diversion at best.",
      "review_date": "2007-10-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is great. It brings about the revival of the continuously dying western. In a few years from now some movie will make the genre return dormant, but never the less this is one of my favorite movies.",
      "review_date": "2007-10-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The first 2/3 of this film were fairly entertaining but the last part made no sense and the climax preposterous. How did the Christian Bale character expect to make it from the hotel to the train station with the whole town gunning for him? The first 2/3 of this film were fairly entertaining but the last part made no sense and the climax preposterous. How did the Christian Bale character expect to make it from the hotel to the train station with the whole town gunning for him? Why was the Russell Crowe character assisting him? [***SPOILER***] Okay, the RC character had a change of heart but does that mean he is going to blow the whole gang away for trying to spring him? I must be dense, but I didn't get it. The whole Chinese rail camp thing was also kind of a waste of time...a sidebar, if you will. Disappointing. I don't understand all the good reviews.",
      "review_date": "2007-09-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Refreshing old western done nicely in a contempo motif. [***SPOILER***] Other than Ben Wade ridiculously killing his gang at the end, (should never have happened) the movie was flawless. I enjoyed the action immensely. Jolly good show!!!!!!!!",
      "review_date": "2007-09-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Strong acting and competent direction it may have, but from the opening sequence contrivances and absurdities mar the story (Bale's one-legged character running over rooftops is perhaps the peak there) culminating in an ending that is Strong acting and competent direction it may have, but from the opening sequence contrivances and absurdities mar the story (Bale's one-legged character running over rooftops is perhaps the peak there) culminating in an ending that is possibly the most implausible climactic change of heart ever seen in a Western or any buddy pic (which is what this is, except the two leads never quite convincingly connect--a fatal flaw). Rent \"The Searchers\" or \"High Noon\" and skip this one.",
      "review_date": "2007-09-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "trite, entirely predictable, and poorly directed. A reel bore. Tried to be a classic western. Tried, without the tension, without the eery awkward silence and slower pace...basically crap.",
      "review_date": "2007-09-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The first two-thirds of the movie is entertaining and Crowe, Bale, Fonda, and Foster are great actors and fun to watch. But [***SPOILER***] as the men approach Yuma the story becomes more and more absurd, and the last ten minutes are an The first two-thirds of the movie is entertaining and Crowe, Bale, Fonda, and Foster are great actors and fun to watch. But [***SPOILER***] as the men approach Yuma the story becomes more and more absurd, and the last ten minutes are an insult to any intelligent mind in many ways. Bale's character shifts motivation (make money, impress son, do the right thing) from scene to scene; and the actions of Crowe's character make no sense at all. Major disappointment, especially for fans of the original movie. This movie is much longer and less suspenseful.",
      "review_date": "2007-09-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A very satisfying film--a morality play more than a western, it's a perfectly directed and no scene or performance is wasted. While I liked \"Bourne\", this film has more heart and to that end, more enjoyable.",
      "review_date": "2007-09-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A remade version of the",
      "review_date": "2007-09-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie could draw a 10 or a 1, depending on how much you turn a blind eye to the story/screenplay liberties. Overall I enjoyed it - the great acting won out over the many \"say what?'s\" in the plot. For me Foster stole the show. This movie could draw a 10 or a 1, depending on how much you turn a blind eye to the story/screenplay liberties. Overall I enjoyed it - the great acting won out over the many \"say what?'s\" in the plot. For me Foster stole the show. Crowe did a great job, but am I alone in thinking he didn't quite have the edge his character history suggested?",
      "review_date": "2007-09-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I don't even like westerns but this one's got so much heart and it's exquisitely made. The film glowed and Russell Crowe and Christian Bale have the best on screen chemistry ever. A really great film, highly recommend.",
      "review_date": "2007-09-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Revived my faith in Westerns as a genre.",
      "review_date": "2007-09-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very much different from the original, but equally complex and interesting. However, as in so many movies, the female roles were cast with an eye to beauty, not acting depth. Not too much support from the screenwriters either.",
      "review_date": "2007-09-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Just before this movie came out I was thinking the Western is pretty much dead, but this film will breathe some new life into it. Overall fun movie, the audience was into it and applauded at the end. Like many films not completely realistic Just before this movie came out I was thinking the Western is pretty much dead, but this film will breathe some new life into it. Overall fun movie, the audience was into it and applauded at the end. Like many films not completely realistic story but thats part of why I go to the movies - to escape reality - if I want reality I can just open my door. If you want escape go see it!",
      "review_date": "2007-09-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "All the best of a classic western, with great performances.",
      "review_date": "2007-09-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Implausible. Inconsistent actions taken by the characters. What else? Oh, how about some good acting (Bale/Crowe) mixed with soap opera level acting (Bale's wife)?",
      "review_date": "2007-09-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best western movies I have seen in years. Better than the original that starred Van Helfin and Glenn Ford. Mangold gets the maximum performances out his actors (i.e. Crowe, Bale, Fonda and Foster). Even plot turns & twists to keep One of the best western movies I have seen in years. Better than the original that starred Van Helfin and Glenn Ford. Mangold gets the maximum performances out his actors (i.e. Crowe, Bale, Fonda and Foster). Even plot turns & twists to keep my interest. Highly recommended!!!!!!",
      "review_date": "2007-09-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Remember when Nick Cage made good movies? It's been quite awhile hasn't it? Is the same happening now to Russel Crowe? He can act with the best of them, so what's he doing it this film.It starts out slow,follows the standard Remember when Nick Cage made good movies? It's been quite awhile hasn't it? Is the same happening now to Russel Crowe? He can act with the best of them, so what's he doing it this film.It starts out slow,follows the standard 1950's TV western plot, but then goes off the rails with a ending that makes no sense at all. Disapointing to say the least.",
      "review_date": "2007-09-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A terrific movie, high marks all across the board, a great balance between exciting action and the riveting psycholgogical duel between Ben Wade and Dan Evans. All the supporting players are fine but Crowe and Bale are superb.",
      "review_date": "2007-09-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "All hail the return of the Western. Not just a film of substance, artistry and character development, 3:10 to Yuma also functions remarkably as a taught action thriller. Bale and Crowe, two favorites, amaze as expected. I was also pleasantly All hail the return of the Western. Not just a film of substance, artistry and character development, 3:10 to Yuma also functions remarkably as a taught action thriller. Bale and Crowe, two favorites, amaze as expected. I was also pleasantly surprised and disturbed simultaneously by a relatively unknown Ben Foster. Add to that a great selection of laughably quotable lines and you have a great, Oscar-worthy start to the fall movie season.",
      "review_date": "2007-09-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great Western. Really engaging. Crowe is outstanding!",
      "review_date": "2007-09-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "the best hollywood remake in many years! do you self a favor and go see this tonight.",
      "review_date": "2007-09-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a great movie --- except for the last 20 minutes. When the movie ended I looked at the faces of my fellow movie goers as they exited and they all looked as confused as me. The ending was very exciting but also improbable and This is a great movie --- except for the last 20 minutes. When the movie ended I looked at the faces of my fellow movie goers as they exited and they all looked as confused as me. The ending was very exciting but also improbable and unbelievable. This movie could have been on par with High Noon if it had a better ending.",
      "review_date": "2007-09-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Hooray for the Western!!!! It's about time. Great cast and stellar performances in what could only be called a 'classic' film in the western genre.",
      "review_date": "2007-09-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was boring and pretentious. It took forever to \"start\" and once the real part of the story began it moved at a snail's pace. The director loaded the picture with unneccessary quick cutting and ominous close-ups of This movie was boring and pretentious. It took forever to \"start\" and once the real part of the story began it moved at a snail's pace. The director loaded the picture with unneccessary quick cutting and ominous close-ups of people's faces. The ending was totally unbelievable!",
      "review_date": "2007-09-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great film. Great acting, great direction. This movie had the whole audience entranced and excited. Bale is a master of the acting skill and Crowe is superb. This is the best Western in a very very long time.",
      "review_date": "2007-09-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "How Roger Ebert gave this 4 stars I will never understand. It wasn't that great.",
      "review_date": "2007-09-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An exceptionally well-crafted, old-fashioned Western, in the very best sense of the term. All roles are beautifully acted, and there's stellar work in all departments, right down to the music over the closing credits!,",
      "review_date": "2007-09-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "More than just another western.",
      "review_date": "2007-09-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One liners were a hit every time. Whether being gut shot or burned alive, people were just tougher in the old west. Apparently even cold blooded killers have hearts of gold. I did see some people reload, so I do have to give props there. If you",
      "review_date": "2007-09-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I recall in Network, or some such film, a scene in which a wealthy Texan makes it clear that he is in the market for \"big\" art. The American public likes big movies as much as they liked big cars in the 70s. This movie had virtually no I recall in Network, or some such film, a scene in which a wealthy Texan makes it clear that he is in the market for \"big\" art. The American public likes big movies as much as they liked big cars in the 70s. This movie had virtually no plausibility, as it crowbarred morality and meaning into coldblooded killers and down and out ranchers. What made it an absurd movie? The one staggering question as to why Crowe wasn't simply shot out of hand and brought in dead; scenes where hugely powerful bad guys wiped out everyone in the vicinity virtually at will ; igniting dynamite thrown in the air with a shotgun fired from the back of a galloping horse; leaving the coldest of coldblooded killers alone with Christian Bale's wife; shootouts of one to 20 or more proportions; a plot which went to ludicrous lengths to wedge Christian Bale into the last man standing role; and the totally unexplainable actions of Russel Crowe as he repeatedly assists his captors and finally gets on the train himself--the movie's makers have failed miserably to make a morality play out of an BIG western. This is a movie that can only make sense as a load of crap sold to a public that demands it, and pushed by critics who don't know what it smells like.",
      "review_date": "2008-01-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great Picture, some great acting by Ben Foster. Crowe and Bale did some fair acting. However, the story is so ridiculous that I have to shave 6 points off it. The logic is absurd. I tried to wrapped my brain around why Crowe killed his own Great Picture, some great acting by Ben Foster. Crowe and Bale did some fair acting. However, the story is so ridiculous that I have to shave 6 points off it. The logic is absurd. I tried to wrapped my brain around why Crowe killed his own gang at the end. I guess earlier in the movie when he killed 1 of his gang members for not finding the Pinkerton in the stagecoach is why.? In other words, his gang had to die because they couldn't find him quick enough.??? So he killed his whole gang cause a rancher could outlast them for a while. This still makes no sense. And the many times Crowe could had escaped made the movie unbelievable.",
      "review_date": "2008-01-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Terrible, This movie makes me sick. 3:10 to disloyalty.",
      "review_date": "2008-01-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Good old fashion western with a great story and really good acting by all.",
      "review_date": "2008-02-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I had heard a lot about this movie, and have wanted to buy it for a while. My dad just picked it up. It was worth the money. Until the halfway point, my rating would have been a 5 at the highest, because it moved so slow. But, in the second I had heard a lot about this movie, and have wanted to buy it for a while. My dad just picked it up. It was worth the money. Until the halfway point, my rating would have been a 5 at the highest, because it moved so slow. But, in the second half, this movie picked up momentum. It started to become what I have come to expect from westerns, that is, full of action and some serious shootouts. I also didn't like some of the modern touches they put into the script, namely having two F-bombs dropped almost back-to-back. In spite of the slow pace, if they had left this out, my rating would have been a 10.",
      "review_date": "2008-02-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Rented the DVD. I usually find something to like in most movies. This movie, however, actually made me angry several times. It tried to play up reality and emotion, yet the characters respond completely unrealistically. Crowe's Rented the DVD. I usually find something to like in most movies. This movie, however, actually made me angry several times. It tried to play up reality and emotion, yet the characters respond completely unrealistically. Crowe's character is obviously a charismatic psychopath, yet, all characters respond to him as if he was Yoda. It is insulting to the 'good' characters in the film and insulting to the good sense of the audience. Finally, when the film does reveal that it wants to be both drama and action, the action is totally devoid of creativity and is as implausible as a one-legged man jumping from rooftop to rooftop. I hated this movie!!!!!",
      "review_date": "2008-02-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Terrific acting. Unique story of two characters with completely different perspectives coming to respect each other.",
      "review_date": "2008-02-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Back in the 1880's in Arizona Territory, people were really dumb. They allowed all of their decisions to be made by moviemakers whose only interest was sensation and bloat. There is little logic in this movie. The shoot-out at the end, Back in the 1880's in Arizona Territory, people were really dumb. They allowed all of their decisions to be made by moviemakers whose only interest was sensation and bloat. There is little logic in this movie. The shoot-out at the end, while thrilling in a ho-hum sort of way is particularly stupid, as is whoever wrote this and expects the audience to believe anything. If you want a good and thrilling--not to mention realistic--shoot-out, take a look at the ending of the made-for-TV \"Open Range.\"",
      "review_date": "2008-03-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie sucked, the critics are pathetic in applauding a film which is riven with plot holes, illogical developments, hammy acting, & a dire script. The film was an absolute mess and boring to boot.",
      "review_date": "2008-04-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Acting was great, but I think we are done with Western movies nowadays.",
      "review_date": "2008-04-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Clever story, good acting, solid themes; but, too many glitches. The film oozes unbelievability from start to finish.",
      "review_date": "2008-04-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I am sorry to say but good acting and visuals do not save a film from a horrible plot. This movie makes no sense. Besides the fact that no one can properly detain a prisoner in this movie, the ending made no sense. This whole movie was laughable.",
      "review_date": "2008-07-12",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 137,
  "genres": [
    "Action",
    "Drama",
    "Crime",
    "Western"
  ]
}