{
  "title": "Atonement",
  "rating": 7.8,
  "release_date": "2007-12-07",
  "genre": [
    "Drama",
    "Mystery",
    "Romance",
    "War"
  ],
  "summary": "Atonement spans several decades. In 1935, 13-year-old fledgling writer Briony Tallis and her family live a life of wealth and privilege in their enormous mansion. On the warmest day of the year, the country estate takes on an unsettling hothouse atmosphere, stoking Briony's vivid imagination. Robbie Turner, the educated son of the family'sAtonement spans several decades. In 1935, 13-year-old fledgling writer Briony Tallis and her family live a life of wealth and privilege in their enormous mansion. On the warmest day of the year, the country estate takes on an unsettling hothouse atmosphere, stoking Briony's vivid imagination. Robbie Turner, the educated son of the family's housekeeper, carries a torch for Briony's headstrong older sister, Cecilia. Cecilia, he hopes, has comparable feelings; all it will take is one spark for this relationship to combust. When it does, Briony--who has a crush on Robbie--is compelled to interfere, going so far as to accuse Robbie of a crime he did not commit. Cecilia and Robbie declare their love for each other, but Robbie is arrested--and with Briony bearing false witness, the course of three lives is changed forever. Briony continues to seek forgiveness for her childhood misdeed. Through a terrible and courageous act of imagination, she finds the path to her uncertain atonement and to an understanding of the power of enduring love. (Focus Features)… Expand",
  "critic_reviews": [
    "An unforgettable examination of a host of dark impulses.",
    "The result is a film that has \"Masterpiece Theatre\" production values but not an ounce of dust upon it.",
    "Through unexpected and cathartic twists, this movie leaves you with atonement and redemption.",
    "The interpretation is so painstaking and moving that almost every moment delivers a shuddering jolt to the head and the heart.",
    "No two-hour film could ever capture all the riches of McEwan's masterly novel. But Wright and Hampton's Atonement comes tantalizingly close, while adding sensual delights all its own.",
    "Nothing in Joe Wright's screen version of Ian McEwan's dense, internalized 2001 novel of secrets and lies should really work, but damn near everything does. It's some kind of miracle. Written, directed and acted to perfection, Atonement sweeps you up on waves of humor, heartbreak and ravishing romance.",
    "Rarely has a book sprung so vividly to life, but also worked so enthrallingly in pure movie terms, as with Atonement, Brit helmer Joe Wright’s smart, dazzlingly upholstered adaptation of Ian McEwan’s celebrated 2001 novel.",
    "Gorgeous cinematography, a lilting score and near-faultless performances, under Wright’s assured direction, make this the first contender for next year’s Best Picture Oscar.",
    "Nothing comes easily in Atonement, especially its ending, which, both happy and tragic, is as wrenching as it is genuinely satisfying. How fitting, somehow, that a novel so devoted to the precision and passionate love of language be captured in a film that is simply too exquisite for words.",
    "A singular achievement -- romantic, sensuous, intelligent and finally shattering in its sweep and thematic complexity.",
    "Atonement is that rare combo: a good movie based on a good book.",
    "This is one of the year's best films, a certain best picture nominee.",
    "What might seem like showing off in another movie is dazzling storytelling here, packing in an hour's worth of human misery.",
    "This is one of the few adaptations that gives a splendid novel the film it deserves.",
    "The generous, sharp performances, especially Garai's, deepen the story's emotional impact, as does Wright's assured, frequently astounding direction.",
    "With compelling and charismatic performances by Keira Knightley and James McAvoy as the lovers, and a stunning contribution from Romola Garai as their remorseful nemesis, the film goes directly to \"The English Patient\" territory and might also expect rapturous audiences and major awards.",
    "May not hit every note perfectly, but the picture they've come up with is full-bodied and intelligent.",
    "It’s not quite as brutalizing as McEwan’s brilliant source novel – it bears too much of a Great Art buff – but it ravishes nonetheless in its grand exploration of the sins of the daughter and a lifetime spent making reparations.",
    "Atonement is effective at getting under the skin, and some audience members won't like that.",
    "Hampton and Wright have been more than sensible when it comes to Atonement. They’ve responded intuitively to a tale that is half art and half potboiler, like so many stories worth telling.",
    "In the end, Atonement sorts truth from fiction as it delivers a shattering kick to the solar plexus.",
    "Vanessa Redgrave, as the adult Briony, appears at the very end in a monologue that rounds out the film with heartbreaking force.",
    "The movie never goes as deep as the novel (no movie could), but it's a worthy approximation: a Merchant-Ivory movie that turns in on itself with a lucid and painful sigh.",
    "In the end -- an ending of such power and narrative originality (in both book and movie) that those who know it ought never breathe a word to those who don't.",
    "The settings are handsome, the cinematography accomplished, the performances first-rate.",
    "For the most part, the result is a smashing success, filled with great performances and exquisite production design. But those final moments, in which the true nature of the story is revealed, are an unmitigated disaster.",
    "It's an imperfect movie that serves as a perfect reminder of what the movies do best.",
    "It is an amazing story, filled with quiet moments of profundity and more surprises than you could imagine.",
    "A handsome film, an earnest film, a film with taste in music and photography and a real sense of intelligence. But too often it feels like an exercise. And even when you're impressed by it, you know you're being played.",
    "Atonement works reasonably well as a tragic romance, but that sting is dulled. As a book, it was a blow to the head; as a movie, it’s an adaptation of a book.",
    "Wright wouldn't recognize unobtrusive if it tapped him on the nose--he's cross- pollinated the first half of Atonement into an Oscar-buzzy brew of Masterpiece Theatre and \"Upstairs, Downstairs,\" with the wild English countryside tamed into an artfully lit fairy glade, and into just enough of a bodice-ripper to reel in the youth market. And not a bad one at that.",
    "The characters are not hugely compelling, the performances never completely grab us, and much of the story, while visually arresting, is dramatically tedious.",
    "The movie version feels like a stately, but watered down, episode of \"Masterpiece Theatre\" fused with \"The English Patient.\"",
    "You have to admire it, when so much of the competition seems inane and slack, but you can’t help wondering, with some impatience, what happened to its heart.",
    "Atonement fails to be anything more than a decorous, heavily decorated and ultimately superficial reading of the book on which it is based.",
    "Imagine if the team that made \"The English Patient\" tried to make the same kind of movie, with even more brave-lads-fighting-the-Jerries porn and this time with Extra Added English country manor porn, and without really good actors, and this movie is what you’d have."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Atonement is a wonderful film which shows an incresing story of love and subsequent tragedy and a sad mixture of feelings that makes us sad and horrified for the untimely ending of the story. For those who had read Ian McEwan's book, Atonement is a wonderful film which shows an incresing story of love and subsequent tragedy and a sad mixture of feelings that makes us sad and horrified for the untimely ending of the story. For those who had read Ian McEwan's book, the film appears as a wonderfully faithful adaptation of the book which is able to surprise and to touch those of read it and those who didn't and in the end we are left with this question: if it had happened to us, could we bring ourselves to forgive someone like Briony Tallis? Is it possible to find the titular Atonement after all those years? Acting-wise, Keira Knightley, James McAvoy and Vanessa Redgrave receive my praise as Cecilia Tallis, Robbie Turner and a 70-year-old penitent Briony Tallis.",
      "review_date": "2008-01-23"
    },
    {
      "review_title": null,
      "content": "I don't think I have ever disagreed more with the critics. The basic story is a tawdry, contrived sequence of events, intended to be tragic, but only evoked irritation in this viewer. I was especially annoyed by the prolonged and I don't think I have ever disagreed more with the critics. The basic story is a tawdry, contrived sequence of events, intended to be tragic, but only evoked irritation in this viewer. I was especially annoyed by the prolonged and ultimately pointless WWII portion of the story. The surprise ending only served to extend the tedium. The 'atonement' seems tacked on and empty. Maybe that was the point? The cinematography is excellent, but seems too artistic for the story. At times the soundtrack was a bit ham-handed. Someone sure fell in love with the oh-so-clever sound of typewriter keys. Most of the acting was at least adequate. James McAvoy does a great job, but Kiera Knightly seems miscast. Overall, I found this movie was very disappointing.",
      "review_date": "2008-01-01"
    },
    {
      "review_title": null,
      "content": "OVERRATED. What a snoozefest.",
      "review_date": "2007-12-30"
    },
    {
      "review_title": null,
      "content": "It was horrible. It was insanely slow and even more boring. Waste of time and money.",
      "review_date": "2008-11-20"
    },
    {
      "review_title": null,
      "content": "Too long in parts, and tries to hard to be artsie in the same vein at The English Patient. The story was fine, but too slow at first and the war scenes were over long. Then there was all the cutbacks and flashs forward. You have to stay for Too long in parts, and tries to hard to be artsie in the same vein at The English Patient. The story was fine, but too slow at first and the war scenes were over long. Then there was all the cutbacks and flashs forward. You have to stay for the ending, or it makes no sense at all. The acting is well done , it's just too long and strangly edited.",
      "review_date": "2008-01-07"
    },
    {
      "review_title": null,
      "content": "I'm not dissapointed, except for the fact that it won an oscar for best music for motion pictures written directly for the screen, original score. I was hoping that Sweeney would win. But right from the get go I hated it. I saw it last I'm not dissapointed, except for the fact that it won an oscar for best music for motion pictures written directly for the screen, original score. I was hoping that Sweeney would win. But right from the get go I hated it. I saw it last night and thought it would be one of those critics-35, users-4.7 movies such as 10,000 BC or Jumper. That's exactly what I got. A dull and dreary dry picture with no excitement or brilliance what so ever. It takes a good story and twists it into a bad one by over-extending the scrpit with much stupidity said enough in this film. I can't say I didn't like it because it isn't my taste, it's just that it felt like all it was was some continuous random sex scenes that were unesecary, escpecially the one sex scene when they were standing up. Now what'd so wrong about having sex in yer bed huh. But, anyways, it wasn't good.",
      "review_date": "2008-03-27"
    },
    {
      "review_title": null,
      "content": "Vastly overrated, with goofy storytelling, odd pacing, bizarre editing, less-than-convincing acting and a ridiculous ending. Given all the \"100\" ratings, I guess I was expecting something like Dr. Zhivago or Romeo and Juliet. Yawn.",
      "review_date": "2008-01-05"
    },
    {
      "review_title": null,
      "content": "I have really been extremely disappointed with this years nominations for best picture. I've seen no country for old men, there will be blood, Michael Clayton, and the latest one, atonement, was BY FAR the biggest let down. The main I have really been extremely disappointed with this years nominations for best picture. I've seen no country for old men, there will be blood, Michael Clayton, and the latest one, atonement, was BY FAR the biggest let down. The main problem with atonement is that you are never emotionally attached to the characters and therefore never really care what happens to them. On top of that the movie is just slow paced and uneventful throughout, and trust me, the ending does not help or justify sitting through this dull movie. If anything the ending is icing on the cake as to how bad atonement truly is. I can assure you that everyone walking out of the theatre was saying \"wow, how did THAT win best picture.\" or \"we really should have seen Rambo\". Atonement gets a 3 out of 10 for having decent acting and decent camera work with some good looking shots. But nothing in this movie will give you the slightest implication that maybe just maybe it should have gotten a nomination or win for best picture. You WILL be disappointed and you WILL wish you had seen something else. DON'T waste your time.",
      "review_date": "2008-02-04"
    },
    {
      "review_title": null,
      "content": "the final two thirds of the movie are completely anti-climatic knightley falls flat script is empty of substance directing is overwrought and heavily decourous painful to sit through! 3 points are merely for some interesting aesthetic the final two thirds of the movie are completely anti-climatic knightley falls flat script is empty of substance directing is overwrought and heavily decourous painful to sit through! 3 points are merely for some interesting aesthetic shots/visuals and some interesting costumes. but cant we expect more from the film medium?",
      "review_date": "2008-01-03"
    },
    {
      "review_title": null,
      "content": "Don't believe the hype. This film is dull, dull, dull. Lot's of over acting and meaningful staring into the middle distance. No substance whatsoever and rubbish dialogue. A case of the emporers new clothes as far as the awards it Don't believe the hype. This film is dull, dull, dull. Lot's of over acting and meaningful staring into the middle distance. No substance whatsoever and rubbish dialogue. A case of the emporers new clothes as far as the awards it has won. Don't waste your time and money on this.",
      "review_date": "2008-03-25"
    },
    {
      "review_title": null,
      "content": "I agree with A.O. Scott's review--almost completely. The beginning starts off fairly well---predictable--but everything is firing perfectly in just about every area --acting, set, direction, DP, etc (maybe dialog isn't perfect). I agree with A.O. Scott's review--almost completely. The beginning starts off fairly well---predictable--but everything is firing perfectly in just about every area --acting, set, direction, DP, etc (maybe dialog isn't perfect). But holy heck does it take a detour to lost-muddy-mess. I haven't seen this level of navel gazing cinematography since Terrence Malik kept the camera on grass for the first 10 minutes of \"The New World\". The ending of course, is suppose to grab you and leave you with the very real feeling of sadness, guilt and atonement---which is very much a part of the novel it's based on---in fact I think Vanessa Redgrave's last 5 minutes on screen was some of the best acting in the film ( Keira sure is pretty though)--however Redgrave and the heart-wrenching reveal can't save the mess in the middle. I'm a little shocked so many critics praised this film at the level they did.",
      "review_date": "2008-03-28"
    },
    {
      "review_title": null,
      "content": "Overrated Oscar bait.",
      "review_date": "2008-01-16"
    },
    {
      "review_title": null,
      "content": "Another slooow movie, with a ridiculous premise (the writing and delivery of a very obscene note), in a story told in annoying flashbacks. The beach scene with its ferris wheel, animal cruelty, and exhausted, injured soldiers, was confusing Another slooow movie, with a ridiculous premise (the writing and delivery of a very obscene note), in a story told in annoying flashbacks. The beach scene with its ferris wheel, animal cruelty, and exhausted, injured soldiers, was confusing and went on and on. The only good thing I have to say is that the ending is imaginative and slightly redeeming to the rest of this tedious picture.",
      "review_date": "2008-03-23"
    },
    {
      "review_title": null,
      "content": "This was a particularly boring movie. I couldn't tell what was going on and it was filled with inappropriate material. I left 3/4 of the way through.",
      "review_date": "2008-04-25"
    },
    {
      "review_title": null,
      "content": "While I can appreciate why some people would enjoy this movie I felt it was more of a period drama and was annoyingly slow moving. There were no surprises in the movie so why they chose to drag out the scenes is beyond me. Also the disjointedWhile I can appreciate why some people would enjoy this movie I felt it was more of a period drama and was annoyingly slow moving. There were no surprises in the movie so why they chose to drag out the scenes is beyond me. Also the disjointed plot involving the second world war scenes only further distanced me from the movie. Although it was all brought together at the end I struggled to keep my interest from waning.",
      "review_date": "2012-01-10"
    },
    {
      "review_title": null,
      "content": "movie began a bit slow, but got better later.",
      "review_date": "2012-05-05"
    },
    {
      "review_title": null,
      "content": "Atonement is a slow, boring and un-compelling film with not a single character that was remotely interesting. Nothing came to life and that's mainly to blame from poor storytelling.",
      "review_date": "2013-03-16"
    },
    {
      "review_title": null,
      "content": "Atonement is a classic British film. A good cast, an interesting tie, and then a boring narrative and another dull ending follow. James McAvoy played his role perfectly.",
      "review_date": "2021-04-19"
    },
    {
      "review_title": null,
      "content": "If you want to take an average story and turn it into a movie with an undeniable knock-out ending just hire a Redgrave to deliver it. A couple of years ago Lynn Redgrave gave a performance at the end of Kinsey that elevated that film from If you want to take an average story and turn it into a movie with an undeniable knock-out ending just hire a Redgrave to deliver it. A couple of years ago Lynn Redgrave gave a performance at the end of Kinsey that elevated that film from being a so-so biopic into a riveting study on human behavior, and it was only a 5 minute scene! In Atonement, it's sister Vanessa in a 5 minute scene at the end that transforms the movie from a typical English Merchant-Ivory style love story into a epic story of love, lies, despair and redemption. It hooks you into a love story torn apart by a single lie and follows the plotline through the years ending at a beautiful and totally unexpected place that only Vannessa Redgrave could take you to. She is truly one of the worlds great actors. Keira Knightley and James McAvoy are excellent as the lovers torn apart and Saoirse Ronan & Romola Garai are perfect as the younger stages of the Redgrave character. The cinematography by Seamus McGarvey is brilliant, in the league of Roger Deakins and Robert Elswit this year (you'll see those three names when Oscar nominations are announced!) Atonement is an old fashioned love story that becomes an epic movie going experience the minute Vannessa Redgrave defines Atonement!",
      "review_date": "2008-01-10"
    },
    {
      "review_title": null,
      "content": "Brilliant movie!",
      "review_date": "2008-02-20"
    },
    {
      "review_title": null,
      "content": "Loved it!",
      "review_date": "2008-04-20"
    },
    {
      "review_title": null,
      "content": "This unforgettable story deserves higher ratings than its getting here. It has that \"classic novel\" feel of a great 19th century romance novel. Loved the 5 minutes of Vanessa Redgrave, she blew me away, she's still terrific. The scene This unforgettable story deserves higher ratings than its getting here. It has that \"classic novel\" feel of a great 19th century romance novel. Loved the 5 minutes of Vanessa Redgrave, she blew me away, she's still terrific. The scene of Dunkirk is one of the great war scenes of all time, an incredible tracking shot that follows the arriving soldiers for about a mile along the shore. Also kudos to the entire cast, the beautiful green dress, and the original novelist, this was an unforgettable story.",
      "review_date": "2008-08-25"
    },
    {
      "review_title": null,
      "content": "Nice story line with not your typical predictable ending. Great acting by James McAvoy!",
      "review_date": "2008-02-24"
    },
    {
      "review_title": null,
      "content": "Vastly overrated. As of right now, there's a full 15 point difference between the critics score, 85, and the people's score, 70. This ALWAYS should raise the alert. Critics tend to have their heads up...well you know. (see \"Lost In Vastly overrated. As of right now, there's a full 15 point difference between the critics score, 85, and the people's score, 70. This ALWAYS should raise the alert. Critics tend to have their heads up...well you know. (see \"Lost In Translation\"). Mediocre movie, decent ending, better than bleeding to death in a bathtub but not as good as a grilled cheese sandwich.",
      "review_date": "2008-02-26"
    },
    {
      "review_title": null,
      "content": "Disjointed, disappointing, slow. I had high hopes for an epic love story. It didn't deliver. Definitely not the best picture of the year.",
      "review_date": "2008-02-03"
    },
    {
      "review_title": null,
      "content": "Amazing emotional story. There is some very honest acting in this film.",
      "review_date": "2008-03-31"
    },
    {
      "review_title": null,
      "content": "A beautifully made, multi-layered adaptation of McEwan's fabulous novel. Don't believe the NY Times and the New Yorker on this one!! And Jeff Beresford-Howe must have eaten a bad clam before writing his review.",
      "review_date": "2008-05-13"
    },
    {
      "review_title": null,
      "content": "An amazing work of cinematic art. The best film I have seen in the last five years. Better than Gosford Park.",
      "review_date": "2007-12-10"
    },
    {
      "review_title": null,
      "content": "An odd and awkward movie that nevertheless manages a few good stabs in the heart, thanks mostly to the potent reality of WWII, James McAvoy, Saoirse Ronan (is there a law that good child actors must have bizzare names?), and a little to An odd and awkward movie that nevertheless manages a few good stabs in the heart, thanks mostly to the potent reality of WWII, James McAvoy, Saoirse Ronan (is there a law that good child actors must have bizzare names?), and a little to Keira Knightly. The direction is capable, but at times flamboyant in a way that seems inorganic, and the story rather a hurky-jerky mess. If there was any actual atonement, I missed it.",
      "review_date": "2007-12-10"
    },
    {
      "review_title": null,
      "content": "Two old-school extremely knowledgeable film veterans review ATONEMENT. It's a great review - and leaves you something to think about. Check it out on YouTube... http://www.youtube.com/watch?v=NPJpnaEnAvE Beware...may contain spoilers",
      "review_date": "2007-12-30"
    },
    {
      "review_title": null,
      "content": "I, and four others (one of whom had read the book) saw this movie and unanimously disliked it. We found it dragged terribly and while it was certainly very stylish and clever(too much so) it lacked any soul. I definitely wouldn't recommend it.",
      "review_date": "2007-12-06"
    },
    {
      "review_title": null,
      "content": "The best picture of the year the cast is a wonderful Keira and James beautiful the direction is magnificent is an Oscar through.",
      "review_date": "2007-12-07"
    },
    {
      "review_title": null,
      "content": "Have read the book 3 times and went to Toronto to see the film at the Festival. It's an almost excellent translation of the book, other than the last scene being \"MIA\". Wonderful acting, great cinematography and score. I can't wait Have read the book 3 times and went to Toronto to see the film at the Festival. It's an almost excellent translation of the book, other than the last scene being \"MIA\". Wonderful acting, great cinematography and score. I can't wait to see it again",
      "review_date": "2007-12-07"
    },
    {
      "review_title": null,
      "content": "A fine piece of eye candy. Each frame a visual feast of color, light and brilliant production. But, ultimately, one is left wanting more substance. I can't help but feel the film's heart was too over dressed. Still, a beautiful A fine piece of eye candy. Each frame a visual feast of color, light and brilliant production. But, ultimately, one is left wanting more substance. I can't help but feel the film's heart was too over dressed. Still, a beautiful piece worth seeing on the big screen.",
      "review_date": "2008-01-01"
    },
    {
      "review_title": null,
      "content": "I wished I had listened to someones warning at this to stay home and go for a nap. boooooooring!",
      "review_date": "2008-01-19"
    },
    {
      "review_title": null,
      "content": "One of the best movies I've had the pleasure of seeing in quite some while. The meta-reality twist at the end of the film is what really makes this worth watching. The musical score is also phenomenal, cheers.",
      "review_date": "2008-01-02"
    },
    {
      "review_title": null,
      "content": "Those who refer to it as boring (as many do) are probably the same people who would choose McDonald's over a homecooked meal. It's sad when no one has the patience anymore for character development and the subtleties of real Those who refer to it as boring (as many do) are probably the same people who would choose McDonald's over a homecooked meal. It's sad when no one has the patience anymore for character development and the subtleties of real stories, of real life. And I guess you can also blame Hollywood for training us to want bullets flying every three seconds. I vote a 9 because, while the ending has been lauded, I found it a little manipulative, actually, though haunting all the same.",
      "review_date": "2008-01-24"
    },
    {
      "review_title": null,
      "content": "Well done. Vanessa Redgrave is always amazing to watch.",
      "review_date": "2008-01-29"
    },
    {
      "review_title": null,
      "content": "Beautifully filmed but so very sloooooow.",
      "review_date": "2008-01-04"
    },
    {
      "review_title": null,
      "content": "Great movie. I wasn't sure I wanted to see it at first. Probably only really went because of Keira Knightley, but I was sure glad I did. It is very dark, but very interesting and very well done. Definitely for adults only, though, Great movie. I wasn't sure I wanted to see it at first. Probably only really went because of Keira Knightley, but I was sure glad I did. It is very dark, but very interesting and very well done. Definitely for adults only, though, don't take your kids to this one. Overall, though it was top-notch. Very interesting story, very well acted and very well made. I was super impressed.",
      "review_date": "2008-01-04"
    },
    {
      "review_title": null,
      "content": "Plot Spoiler. The plot is dumb: Girl writes book about how she messed up, and everybody whines about it.",
      "review_date": "2008-02-10"
    },
    {
      "review_title": null,
      "content": "Wonderful movie, I didn't expect that it would be possible to translate book into the film so perfectly.",
      "review_date": "2008-02-11"
    },
    {
      "review_title": null,
      "content": "Random Thoughts: Very nicely done period piece. It has something for everyone. It's a romance, a war picture, a costume drama. The Dunkirk scenes are amazing. The acting and production values are first-rate.",
      "review_date": "2008-02-01"
    },
    {
      "review_title": null,
      "content": "In it's own right, a very good film. Kiera Knightly performs with the kind of British swagger reminiscent of \"Masterpiece Theatre,\" and James McAvoy sits high on a pedestal alongside her. It's beautifully shot and expertly In it's own right, a very good film. Kiera Knightly performs with the kind of British swagger reminiscent of \"Masterpiece Theatre,\" and James McAvoy sits high on a pedestal alongside her. It's beautifully shot and expertly directed, with some of the best cinematographic shots of the year. Truth is though, in the end, it's still just another well-made, WW2 period piece to add to the continuously growing list of the genre. There's nothing truly different or new presented in \"Atonement.\" Best picture worthy? There are certainly more deserving movies this year, but I still respect this very entertaining film.",
      "review_date": "2008-02-20"
    },
    {
      "review_title": null,
      "content": "The whole story feels like a made-up and most of the scenes are so *** unnatural. Yet somehow it is heart touching maybe because of the girl who's the only intense character here. A good thing to see but only once.",
      "review_date": "2008-02-20"
    },
    {
      "review_title": null,
      "content": "terrible, contrived, manipulative nonsense. AVOID.",
      "review_date": "2008-02-20"
    },
    {
      "review_title": null,
      "content": "Good love story but the ending seems stilted because it could leave viewers feeling as if the rest of the film had not been playing \"honestly\"' with them or their emotions.",
      "review_date": "2008-02-25"
    },
    {
      "review_title": null,
      "content": "Aside from Keira Knightly, there was very little to like about this movie. The out-of-time sequences were useless. No new information was ever uncovered or revealed so shooting them out of sequence was stupid and unnecessary. Whatever Aside from Keira Knightly, there was very little to like about this movie. The out-of-time sequences were useless. No new information was ever uncovered or revealed so shooting them out of sequence was stupid and unnecessary. Whatever grandiose ideas brought about the extravagant beach scenes apparently never got out of the director's head. Scenes were thrown in at random to add some sort of grit but it all came off as very amateur. This movie was not worthy of any awards or praise. Between this and 'There Will Be Blood' I wasted two evenings I can never get back.",
      "review_date": "2008-03-10"
    },
    {
      "review_title": null,
      "content": "Best movie of 07 and it got robbed from best picture. No country for old men didnt deserve it i gave that one a 6. but anywways this movie is brilliant, intriguing, fascinating, beautiful, clever, funny, sad, disturbing, haunting, romantic, Best movie of 07 and it got robbed from best picture. No country for old men didnt deserve it i gave that one a 6. but anywways this movie is brilliant, intriguing, fascinating, beautiful, clever, funny, sad, disturbing, haunting, romantic, EPIC, grandiose, sensational, and so many other things. amovie that will change u forever and of of the best EVER! A MASTERPIECE!",
      "review_date": "2008-03-20"
    },
    {
      "review_title": null,
      "content": "Quite possibly the most boring film ever made. Yes I admit it was shot beautifully but you can't just rely on that. It just dragged on for too long and there was no real story. It didn't feel like it was going anywhere at all. Way Quite possibly the most boring film ever made. Yes I admit it was shot beautifully but you can't just rely on that. It just dragged on for too long and there was no real story. It didn't feel like it was going anywhere at all. Way too over-rated. Don't get your hopes up.",
      "review_date": "2008-03-24"
    },
    {
      "review_title": null,
      "content": "It's a romantic movie. You should'nt expect any action or tension when you go see Atonement. But, holding in mind that this movie was ment to be romantic, it still is an extremely boring experience. The story is about a girl who It's a romantic movie. You should'nt expect any action or tension when you go see Atonement. But, holding in mind that this movie was ment to be romantic, it still is an extremely boring experience. The story is about a girl who feels guilty. She talked someone into jail and when she grew older she realized she was wrong. That's the story. Nothing happens. No suprises, no weird plot changes,... its boring as hell. Even for a romantic movie. And of course, Keira Knightley acts great, and so do most other actors and actresses. But in a movie where nothing happens, great acting doesn't compensate. Just don't go watch this movie people. Its boring, the end sucks (granny nagging about her book), and the beginning and middle suck as well. There are a lot of other movies in cinema right now that are really worth your money (there will be blood, no country for old men,...). Pick one of those. You wont regret it.",
      "review_date": "2008-03-02"
    },
    {
      "review_title": null,
      "content": "Once again, movie critics have proven how out of touch they are with the casual moviegoer and have given this film rave reviews. This movie is simply long and boring, nothing more. If you like long and boring movies, then Atonement will be Once again, movie critics have proven how out of touch they are with the casual moviegoer and have given this film rave reviews. This movie is simply long and boring, nothing more. If you like long and boring movies, then Atonement will be right up your alley, and you probably are already a professional movie critic. But for those of us who actually like to be entertained, Atonement did nothing but shave 2 hours off of my lifespan. If you're looking for things like action, suspense, intrique, go elsewhere. How on earth did this \"movie\" win awards? The competition must have been pretty thin.",
      "review_date": "2008-03-30"
    },
    {
      "review_title": null,
      "content": "This has to be one of the worst, most overrated movies I have seen in my life, and I have watched quite a few. I can not remember the last time I actually wanted to leave the movie theater half way into a movie. As others have said, take This has to be one of the worst, most overrated movies I have seen in my life, and I have watched quite a few. I can not remember the last time I actually wanted to leave the movie theater half way into a movie. As others have said, take \"Masterpiece Theatre\", make it trash and you have the movie \"Atonement\".",
      "review_date": "2008-03-05"
    },
    {
      "review_title": null,
      "content": "Has got to be one of the most boring, lackluster movies I have ever seen. The beginning half hour started off okay, but it grew worse as it went along. I had to pretty much keep myself from dozing off....and Keira Knightley does that thing Has got to be one of the most boring, lackluster movies I have ever seen. The beginning half hour started off okay, but it grew worse as it went along. I had to pretty much keep myself from dozing off....and Keira Knightley does that thing where her mouth is partly open, and her cheeks are sunken in...(or maybe it is just her face). I can't believe it has received such critical praise. It is definitely not the ravishing romance movie I had hoped it would be from all the previews and reviews. I don't know if I would even bother renting it. Any time me and my friend see a that sucked we compare it to Atonement and Atonement always sucks more.....I think I might have even enjoyed watching the last half of Norbit on HBO last night more than I did watching Atonement.",
      "review_date": "2008-03-06"
    },
    {
      "review_title": null,
      "content": "Many pointless, over the top scenes saturated with melodramatic music that simply fail miserably to engage the viewer emotionally and intellectually. Overall very boring and contrived. Should have stayed home and watched TV instead.",
      "review_date": "2008-03-08"
    },
    {
      "review_title": null,
      "content": "This was a fantastic film. Not having read the book, the story arc took my breath away.",
      "review_date": "2008-04-13"
    },
    {
      "review_title": null,
      "content": "Genius! This is probably one of the best films I have seen in a long time. The complexety of the romance and storyline were nothing short of grandeur. All people who have given this a low rating either went into the movie with a horrible Genius! This is probably one of the best films I have seen in a long time. The complexety of the romance and storyline were nothing short of grandeur. All people who have given this a low rating either went into the movie with a horrible attitude, or just can't appreciate magnificent filmaking.",
      "review_date": "2008-04-01"
    },
    {
      "review_title": null,
      "content": "After all the critical praise, I had a hard time accepting how incredibly bad this film was. Had I watched it in a theater, I would certainly have walked out. It's a 120 minutes of drawn out melodrama unnecessarily edited into a After all the critical praise, I had a hard time accepting how incredibly bad this film was. Had I watched it in a theater, I would certainly have walked out. It's a 120 minutes of drawn out melodrama unnecessarily edited into a schizophrenic timeline to tell 20 minutes worth of story. Beyond that, the entire thing hinges on a plot point suitable for a bad TV sitcom. The opportunity to gaze upon Keira Knightly was the only redeeming factor, hence my rating of 1 instead of zero.",
      "review_date": "2008-04-23"
    },
    {
      "review_title": null,
      "content": "\"Atonement\" is a beautifully designed and photographed film featuring some exceptional acting. What prevent it from being the gem it had the potential to be is its too frequently slow pace and its occasionally jarring narrative structure.",
      "review_date": "2008-04-25"
    },
    {
      "review_title": null,
      "content": "What a dog! With apologies to dogs everywhere. Who paid these 'reviewers'? I got the DVD from Netflix and feel screwed. The screenwriter can't figure out what the hell he wants to write, a love story, crime novel, war movie, What a dog! With apologies to dogs everywhere. Who paid these 'reviewers'? I got the DVD from Netflix and feel screwed. The screenwriter can't figure out what the hell he wants to write, a love story, crime novel, war movie, or personal memoir. Oh wait, let's throw them all in! Then at the end we'll have somebody say onscreen 'hey, just kidding.' Who thought that was a good idea? How the hell do the people with the money ever approve a film like this? Anyone have their number? I have a script and it's reallly, really good...",
      "review_date": "2008-04-07"
    },
    {
      "review_title": null,
      "content": "One of the best romances i ever saw! the end is so emotional and i have to cry nearly everytime i´m watching the movie. it´s true, that it´s not one of the easiest movies to watch, but i think if you like movies which are One of the best romances i ever saw! the end is so emotional and i have to cry nearly everytime i´m watching the movie. it´s true, that it´s not one of the easiest movies to watch, but i think if you like movies which are different than all the mainstream-movies you´ll love it!",
      "review_date": "2009-10-12"
    },
    {
      "review_title": null,
      "content": "Atonement is a beautiful wonderous original experience from begining to end. Knightly and McAvoy are quite good in their lead roles, but the films three great performances are all those of a single character, Brioni, at different stages in Atonement is a beautiful wonderous original experience from begining to end. Knightly and McAvoy are quite good in their lead roles, but the films three great performances are all those of a single character, Brioni, at different stages in her life. The seamless way she's depicted in these three stages makes this a great film. The ending is surprising and very powerful. And the cinematography and score are nothing short of spectacular.",
      "review_date": "2009-01-08"
    },
    {
      "review_title": null,
      "content": "I didn't shed a tear, and I am a sensitive moviegoer. The film is visually beautiful and well-acted, but I felt detached from the familiar theme of lovers separated by circumstances outside their control.",
      "review_date": "2007-12-17"
    },
    {
      "review_title": null,
      "content": "Brooding, exquisitely acted and beautifully filmed. i am surprised by the negative reviews of the film.",
      "review_date": "2007-12-22"
    },
    {
      "review_title": null,
      "content": "Beautiful performances, breathtaking cinematography, and a scene in the hospital that leaves you emotionally devastated and in awe.",
      "review_date": "2007-12-25"
    },
    {
      "review_title": null,
      "content": "the greatest movie of 2007.it's stunning.we learn a lesson in life not to judge people by our own perception i wish it will receive an oscar for the best motion picture.haven't learned a thing in life from no country for old men a the greatest movie of 2007.it's stunning.we learn a lesson in life not to judge people by our own perception i wish it will receive an oscar for the best motion picture.haven't learned a thing in life from no country for old men a bad mask face guy shooting people!if atonement wins the oscar it will be the right choice classics and novels and stories of life are better than movies which has a similarity to shooter games.",
      "review_date": "2007-12-31"
    },
    {
      "review_title": null,
      "content": "Stunning. Engaging throughout, and features an amazing five-minute tracking shot through the beach of Dunkirk that is the polar opposite of self-consciousness that everyone says it is. My favorite movie this year.",
      "review_date": "2007-12-06"
    },
    {
      "review_title": null,
      "content": "In a word, ponderous. The 3 rating comes from getting in on a free pass.",
      "review_date": "2007-12-06"
    },
    {
      "review_title": null,
      "content": "Very moving, faithful adaption of a great novel.",
      "review_date": "2007-12-07"
    },
    {
      "review_title": null,
      "content": "Yo this movie was some of that dank shit. I straight up cried in like two parts son. The acting is phenomenal and the screenplay is dope. Two forties up.",
      "review_date": "2007-12-08"
    },
    {
      "review_title": null,
      "content": "This movie had a great premiise. but faded as it went on. The story jumped around too much. I think this would have worked better as a mini-series",
      "review_date": "2008-01-10"
    },
    {
      "review_title": null,
      "content": "Wow, if this movie was voted \"Best Picture\" in 2007, then the box office is really hurting for good material. This movie has a thin plot and is painfully boring to try and sit through. No dramatics to speak of. No, I do not need to be spoon Wow, if this movie was voted \"Best Picture\" in 2007, then the box office is really hurting for good material. This movie has a thin plot and is painfully boring to try and sit through. No dramatics to speak of. No, I do not need to be spoon fed with alot of blood, guts, and action. Try watching the movie \"Amadeus\" and you will see how a movie can be interesting and dramatic without having any action, gore, language, violence, etc. I'm sorry folks, but simply creating a movie with a WWII theme and 2+ hour run time does not make a movie \"epic\". A complete waste of time, and a laughably overrated film.",
      "review_date": "2008-11-16"
    },
    {
      "review_title": null,
      "content": "Post-modernist elegaic romance in which an unreliable narrator tells a tale that is heavily stylized. The time period and the subject matter bring to mind The English Patient, but without the romantic sentimentality. I recommend this film, Post-modernist elegaic romance in which an unreliable narrator tells a tale that is heavily stylized. The time period and the subject matter bring to mind The English Patient, but without the romantic sentimentality. I recommend this film, but only for those who want a challenge. If you are looking for action or a predictable story line or a quick resolution, try a Bruce Willis film instead.",
      "review_date": "2008-01-12"
    },
    {
      "review_title": null,
      "content": "Cleverly structured (both in book and film), the sequence of revelations makes up for a few bits in which the story, wanting to pause for gorgeous and moody photography, plods a little. Keira Knightley and James McAvoy are superb, and Cleverly structured (both in book and film), the sequence of revelations makes up for a few bits in which the story, wanting to pause for gorgeous and moody photography, plods a little. Keira Knightley and James McAvoy are superb, and Vanessa Redgrave's scenes to close the film are the definitive clincher. Tremendous adaptation.",
      "review_date": "2008-11-23"
    },
    {
      "review_title": null,
      "content": "8.5/10 As beautiful a film as it is a story, Atonement is solidly acted and brilliantly filmed. Although it hits a lag after the first hour where the story is thrillingly paced - and accompanied by an exciting typewriter score - it 8.5/10 As beautiful a film as it is a story, Atonement is solidly acted and brilliantly filmed. Although it hits a lag after the first hour where the story is thrillingly paced - and accompanied by an exciting typewriter score - it eventually picks up again for the blind-sidingly tragic ending. Without the lagging sequence in the middle, I would likely have rated this a 10. And without the brlliantly original and sad ending it would have been a 7. Juno is my favourite of 2007, but this is a close second with No Country for Old Men.",
      "review_date": "2008-01-13"
    },
    {
      "review_title": null,
      "content": "Bound to get Oscar nods; cinematic turns splendid; subtleties for those who get them; beautifully presented; most decent acting; heartbreaking at the end.",
      "review_date": "2008-01-20"
    },
    {
      "review_title": null,
      "content": "Slow and borrrrring!",
      "review_date": "2008-01-20"
    },
    {
      "review_title": null,
      "content": "The central problem with this film and too many films made over the past 15-20 years is that the editing becomes the most important character. The is one more story told out of time sequence, not because it is a dramatic need of one of the The central problem with this film and too many films made over the past 15-20 years is that the editing becomes the most important character. The is one more story told out of time sequence, not because it is a dramatic need of one of the characters (say a character with amnesia who remembers only bits of her past and we take that journey of remembrance with her), but because it is a structural need for the screenwriter to achieve his plot twist at the end. The writer simply cannot take us on a worthwhile journey starting us at A and ending us at Z, and so flashes us backwards and forwards in time until we're so good and seasick that anything he present in the last 15 minutes of the movie will be a stunner. The interesting thing is that Atonement would have been a good movie without the manipulation. The direction is spot on and the performances compelling. But because I know I was being led around by the nose by the writer, it kicked up all my authority issues and I just refused to be moved.",
      "review_date": "2008-01-22"
    },
    {
      "review_title": null,
      "content": "AO Scott nailed his review of this film.",
      "review_date": "2008-01-22"
    },
    {
      "review_title": null,
      "content": "Mediocre movie at best. There was no emotion in the movie, nor were the characters tangible in the least. This movie frustrated and angered me because of how disappointing it was and how good it could have been.",
      "review_date": "2008-01-04"
    },
    {
      "review_title": null,
      "content": "I suppose you can call me a clean canvas since I didn't read the novel, so I really didn't know what to expect. Although the movie is visually stunning and the acting exceptional (especially James MacAvoy), it left me cold at I suppose you can call me a clean canvas since I didn't read the novel, so I really didn't know what to expect. Although the movie is visually stunning and the acting exceptional (especially James MacAvoy), it left me cold at first. As time went on and I had time to reflect, I became haunted and captivated by the story. A clever and brilliant way to tell a story and hold us to view it again to answer more questions.",
      "review_date": "2008-01-06"
    },
    {
      "review_title": null,
      "content": "Unfortunately for Andrew, he appears to lack enough of a brain to simply piece together the fact that you see the same events happen twice, once from the young sister (Briony's) eyes, and once from the older sister (Cicilia); that is Unfortunately for Andrew, he appears to lack enough of a brain to simply piece together the fact that you see the same events happen twice, once from the young sister (Briony's) eyes, and once from the older sister (Cicilia); that is the \"disconnection\" Andrew talks about. It is a very very good movie; full of emotion and great acting and I would recommend it!",
      "review_date": "2008-01-07"
    },
    {
      "review_title": null,
      "content": "No the atonement bit was not 'tacked on and empty' and if you didn't realize this was an adaption of a book then do a bit of research before you review. Another point is that people who expect the passion to equal that of say No the atonement bit was not 'tacked on and empty' and if you didn't realize this was an adaption of a book then do a bit of research before you review. Another point is that people who expect the passion to equal that of say Ben Affleck and Kate Beckinsale in pearl harbour will of course be disappointed with a more interesting story of poignantly repressed English emotions during the second world war. then again maybe you should stop watching explosions and kisses between nubile film stars and appreciate film and literary quality (although i am quite certain you wont as i have come to realize that half the world is not only as thick as pigsh#t, but takes pride in not improving).",
      "review_date": "2008-02-13"
    },
    {
      "review_title": null,
      "content": "Favourite movie of all time. love it.",
      "review_date": "2008-02-15"
    },
    {
      "review_title": null,
      "content": "Flirting with the ridiculous. An example of over-explained narrative, too obvious. I don't believe it at all.",
      "review_date": "2008-02-18"
    },
    {
      "review_title": null,
      "content": "Absolutely the worst romance film I have ever seen, the story is magnificent, but is directed with a dull touch, a dreary, and dry feel. They drag on with so many sex scenes that are so pointless that it is so stupid. This movie is crappy Absolutely the worst romance film I have ever seen, the story is magnificent, but is directed with a dull touch, a dreary, and dry feel. They drag on with so many sex scenes that are so pointless that it is so stupid. This movie is crappy and not even entertaining.",
      "review_date": "2008-02-22"
    },
    {
      "review_title": null,
      "content": "One of the worst movies I've ever seen. Totally stupid, unbelievable plot. Definitely to be avoided.",
      "review_date": "2008-02-24"
    },
    {
      "review_title": null,
      "content": "McAvoy was snubbed at the oscars in this classic film. Knightley shines as always. Redgrave was perhaps the biggest dissapointment. Garai eerily resembled to a trouble misguided teen. Beautiful score and cinematography.",
      "review_date": "2008-02-27"
    },
    {
      "review_title": null,
      "content": "I thought the movie was perfect in everything, the acting, music, the direction of the scenes, how deathly close it was to the book, and the ending. Another stunning performance from the lovely Keira Knightley and an equally impressive I thought the movie was perfect in everything, the acting, music, the direction of the scenes, how deathly close it was to the book, and the ending. Another stunning performance from the lovely Keira Knightley and an equally impressive performance from James McAvoy. And another thing that this movie seems to be criticized about is the ending; I feel that the ending was very appropriate and unexpected. Of course it wasn't a happy ending but that's what makes 'Atonement' different from all the other romantic, mushy love stories. And in response to the negative reviews, I feel that you people just can't appreciate and recognize good movies when you see them, but you'd rather see movies with mediocre acting with horrible storylines like 'Meet The Spartans' or 'Step Up,'... please. And also, don't see a movie with the thought that you're not going to like it because most likely you wont. You must see a movie with total disregard of other people's thoughts and reviews on it.",
      "review_date": "2008-03-19"
    },
    {
      "review_title": null,
      "content": "A beautiful romantic film. The historical drama genre is given an edgy and contemporary feel complemented by superb acting. The orgasmic long take on Dunkirk beach is amazing.",
      "review_date": "2008-03-23"
    },
    {
      "review_title": null,
      "content": "Well acted, stylish, good soundtrack. If you don't like this film you don't like movies.",
      "review_date": "2008-03-24"
    },
    {
      "review_title": null,
      "content": "I liked about an hour of it. Unfortunately it was 2 hours long. Meandering, and, ultimately pointless. Keira Knightley though is absolutely spellbinding.",
      "review_date": "2008-03-25"
    },
    {
      "review_title": null,
      "content": "",
      "review_date": "2008-03-28"
    },
    {
      "review_title": null,
      "content": "An epic of wrenching emotion.",
      "review_date": "2008-03-28"
    },
    {
      "review_title": null,
      "content": "It is an amazing film i loved it. Great acting from James McAvoy, Keria Knightley. I love the green dress Keria wears. Beautiful love story and such an unexpected ending. Overall a awesome film.",
      "review_date": "2008-03-03"
    },
    {
      "review_title": null,
      "content": "The quality of the film is exceptional, art direction, cinematography, costumes and score. Very well written, acted and directed. Saorise Ronan is great. It can be a little slow at times, but it is most always interesting. A bit too long as well.",
      "review_date": "2008-03-06"
    },
    {
      "review_title": null,
      "content": "Very disappointing ending. Pointless red herrings.",
      "review_date": "2008-04-10"
    },
    {
      "review_title": null,
      "content": "great movie...",
      "review_date": "2008-04-13"
    },
    {
      "review_title": null,
      "content": "This movie has some amazing acting and a heart-wrenching story, but none of the characters have much substance besides James McAvoy's. It also goes on a little too long, and some one of the opening England countryside scenes get a This movie has some amazing acting and a heart-wrenching story, but none of the characters have much substance besides James McAvoy's. It also goes on a little too long, and some one of the opening England countryside scenes get a little boring. But it is a good story despite it's flaws.",
      "review_date": "2008-04-20"
    },
    {
      "review_title": null,
      "content": "Shame on those people who voted five below on this movie! Do they have emotions??",
      "review_date": "2008-04-24"
    }
  ],
  "num_reviews": 136
}