{
    "title": "Control",
    "rating": 7.6,
    "release_date": "2007-10-10",
    "genre": [
        "Biography",
        "Drama",
        "Music"
    ],
    "summary": "Ian Curtis has aspirations beyond the trappings of small-town life in 1970s England. Wanting to emulate his musical heroes, such as David Bowie and Iggy Pop, he joins a band, and his musical ambition begins to thrive. Soon, though, the everyday fears and emotions that fuel his music slowly begin to eat away at him. Married young, with aIan Curtis has aspirations beyond the trappings of small-town life in 1970s England. Wanting to emulate his musical heroes, such as David Bowie and Iggy Pop, he joins a band, and his musical ambition begins to thrive. Soon, though, the everyday fears and emotions that fuel his music slowly begin to eat away at him. Married young, with a daughter, he is distracted from his family commitments by a new love and the growing expectations of his band, Joy Division. The strain manifests itself in his health. With epilepsy adding to his guilt and depression, desperation takes hold. Surrendering to the weight on his shoulders, Ian's tortured soul consumes him. (The Weinstein Company)… Expand",
    "critic_reviews": [
        "Even though we're aware of the tragic trajectory of the singer's life, for a while it almost seems as if reality got it wrong and Curtis might just squeak past the reaper's scythe with no more than a shave and a haircut.",
        "It's also that he's really, honest-to-God, got one of those movie faces that doesn't even come along once every generation. It's astonishing.",
        "Even if you have no interest in Joy Division, this picture is worth seeing for the unsentimental empathy and passion of the moviemaking.",
        "You don’t have to know anything about Joy Division to grasp the mysterious sorrow at its heart.",
        "One of the most perceptive of rock music biopics.",
        "Control doesn't claim to know the reasons Curtis killed himself. The act of suicide poses the question why, but rarely answers it, leaving the living to wonder, and to grieve. And there's certainly grief to be had in Control, but also joy. Really.",
        "It's Corbijn, shooting with a poet's eye in a harshly stunning black-and-white, who cuts to the soul of Ian's life and music. You don't watch this movie, you live it.",
        "Can a movie about such a fellow and such a fate be lovely? And can it uplift? Control is and, in its artfulness, does.",
        "Control goes past the clichés of punk rock-god gloom to offer a snapshot of alienation that's shockingly humane.",
        "Corbijn makes us achingly aware of the singer's talent, the haunting poetry of his songs and how, living in the gloomy culture he did, his passing was virtually inevitable.",
        "Lovely and deeply touching picture.",
        "Those who worship Joy Division may bridle at Corbijn’s film for its reluctance to mythologize their hero. Speaking as someone so irretrievably square that I not only never listened to the band but didn’t even know anyone who liked it, I can’t imagine a tribute more fitting than this.",
        "Control honors its subject’s eternal self-doubt by honing in on that truth and leaving the legend to others.",
        "Control keeps you riveted in ways that \"24 Hour Party People\" doesn't, primarily because of the investment of craft and conviction by all concerned.",
        "The cast is excellent, particularly Riley and Morton and, as Joy Division’s brash manager, Toby Kebbell. He’s a great character, bitter and hostile and a scoundrel: a born manager of talent destined to tear itself apart.",
        "The result is a good movie that falls short of greatness by aping too well the behaviour of its subject – occasionally brilliant, sometimes mundane.",
        "The result is both a surprisingly lucid portrayal of clinical depression and dramatically a bit stiff.",
        "A rock bio minus the fun. The sex is guilt-stricken, the drugs are used to treat epilepsy, and the rock 'n' roll is about isolation and despair.",
        "A romantic victim to the end, this Ian Curtis is all that worshipful fans could ever hope for.",
        "In essence, Control is a standard order biopic of a tormented artist. What makes the film interesting, if not unique, is the style in which director Anton Corbijn has elected to present it.",
        "Morton's as good an actress as any working today and in Control, she overcomes an age gap to give one of the year's most heartbreaking and honest performances.",
        "Sam Riley is fascinating as Curtis, a hypersensitive young man hobbled by his incurable disease, and Samantha Morton is poignant as his put-upon wife.",
        "Control is director Anton Corbijin's first feature, and he too frequently makes the mistake of falling back on his rock video skills.",
        "The story of Control's creation is the story of great potential, squandered. Joy Division fans should be able to relate.",
        "To my detached eye, this slender biography suggests that Curtis went from a faintly interested glam-rock wannabe of 16 to a mildly talented performer to a quietly glum fellow of 23 whose frustrations drove him to suicide.",
        "There's little illumination.",
        "Despite excellent performances from Samantha Morton, Craig Parkinson, and the radiant Toby Kebbell, along with a noble effort from pretty newcomer Sam Riley as Curtis himself, Control is like a wake where the guests forgot to bring the booze and, for the most part, have nothing very nice or even particularly interesting to say about the deceased."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "Excellent film... as a JD fan, I thought it was done in a way that even non-JD fans could enjoy it. All of the actors playing the JD band members actually played their instruments and performed those songs... it wasn't just Reilly Excellent film... as a JD fan, I thought it was done in a way that even non-JD fans could enjoy it. All of the actors playing the JD band members actually played their instruments and performed those songs... it wasn't just Reilly overdubbing vocals over original JD recordings! That is something that really impresses me about the skills of the actors chosen for the band. True, Curtis was a genius, but he was also human... I felt this film was grounded in reality without trying to evangelize/make a martyr out of Curtis.",
            "review_date": "2007-10-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie was excellent. I love the fact that they over recorded the songs with the band that they had in the movie, this makes the movie alot more interesting by watching and listening to how perfectly they learned joy divisions music to This movie was excellent. I love the fact that they over recorded the songs with the band that they had in the movie, this makes the movie alot more interesting by watching and listening to how perfectly they learned joy divisions music to play for this movie.",
            "review_date": "2009-08-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I hated this piece of pretentious rubbish.",
            "review_date": "2007-10-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Bleak but surprisingly funny in places, this is a thoughtful, moving film. Catches the essence of the legendary Manchester music scene at the time through characters such as Tony Wilson.",
            "review_date": "2008-07-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "If there's a heaven, Ian Curtis and Bon Scott probably had a lot to talk about. These two disparate vocalists fronted successful bands that went on to greater popularity after their untimely deaths. In lieu of an AC/DC biopic, Ian If there's a heaven, Ian Curtis and Bon Scott probably had a lot to talk about. These two disparate vocalists fronted successful bands that went on to greater popularity after their untimely deaths. In lieu of an AC/DC biopic, Ian Curtis(Sam Riley) is back in black and white, in the ironically titled \"Control\", based on the Deborah Curtis memoir about her joykill husband. Something doesn't add up. It's Ian's idea to get married. It's Ian's idea to have a baby. But in the delivery room, he freaks. He doesn't love his daughter. In the streets, he freaks. He doesn't love his wife. Why would a burgeoning rock star get married at twenty? Ian even tells his mistress, the journalist Annik Honore(Alexandra Maria Lara), how much he wants to leave Macclesfield. As a younger man, listening to \"Jean Genie\"(from \"Alladin Sane\"); we believe him, as Bowie sings about how \"New York's a go-go and everything tastes nice,\" on his phonograph. It's no accident that Deborah(Samantha Morton) comes off as a saint in \"Control\". She's the executive producer. In most music biopics about morally compromised performers(\"Ray\", \"Walk the Line\"), the film tries to portray them in the best possible light. This is where \"Control\" differs. The Joy Division frontman comes off as something of an ass. But the music remains undiminished, therefore Curtis(the Bob Dylan of the post-punk era) remains undiminished, in our eyes.",
            "review_date": "2008-06-04",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A solid film. Beautifully shot and acted, this movie does a good job of telling the stories of Ian, Joy Division and Debbie. It stays very much in theme with the bands music.",
            "review_date": "2008-06-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Beautifully shot, great acting. Impressive. (Review by someone who doesnt (didnt) know Joy Division.) Best movie of the year so far.",
            "review_date": "2007-10-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Brilliant. I loved it through and through.",
            "review_date": "2007-11-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Without even being a complete Joy Division fan, the band's music has been very significant to me over the years and I really couldn't get over seeing it turned into an illustration of Ian Curtis's wife version of a story that Without even being a complete Joy Division fan, the band's music has been very significant to me over the years and I really couldn't get over seeing it turned into an illustration of Ian Curtis's wife version of a story that no one but Curtis himself will ever understand... Not to mention the choice of re-recording Joy Division's best songs with Sam Riley impersonating (!?) the deceased lead singer. Like other music biopics, it gets really difficult to tell whether the movie's good or not when the music gets lost on the way...This movie simply reminded me how great Last Days by Gus Van Sant was, expressing a clear personal emotional and artistic celebration of an artist's life. Control was a really frustrating experience.",
            "review_date": "2007-10-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Beautifully shot. Superb Performances by all characters. A great biopic about a true music innovator and legend, who was not perfect by any means. The only problem with this movie is that the screenplay is a bit drawn out, and the pacing is Beautifully shot. Superb Performances by all characters. A great biopic about a true music innovator and legend, who was not perfect by any means. The only problem with this movie is that the screenplay is a bit drawn out, and the pacing is a bit off. A great movie to watch, made better if you are familiar with the band's works.",
            "review_date": "2008-06-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Stylish, great, clearly work from an impressive photographer and director as well.",
            "review_date": "2007-10-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Beautiful but boring. Using the same old romantic individualist conceit, there are no unexpected twists and/or turns to differentiate this from dozens of other biopics. See David C.'s comments above.",
            "review_date": "2007-11-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Like the band, hate the film. No chemistry between characters, no character developement, extremely contrived (Incase you missed it, he was a genius, did you get that? a genius) and incase you didn't understand the fact that he died, Like the band, hate the film. No chemistry between characters, no character developement, extremely contrived (Incase you missed it, he was a genius, did you get that? a genius) and incase you didn't understand the fact that he died, even though its obvious because every one is running about crying, we are told at the end in large writing - Ian Curtis died...... and about time to, but only in a celluloid sense. A fanboy film of the highest order.",
            "review_date": "2007-10-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Beautiful film - I'm not even bothered about Joy Division. Excellently realised.",
            "review_date": "2007-10-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An honest movie about a truly significant band. A times the scenes are a little schematic. I think that's largely due to the scenario, which is an attempt to squeeze as much emotion into the story as possible. Apart from the excellent An honest movie about a truly significant band. A times the scenes are a little schematic. I think that's largely due to the scenario, which is an attempt to squeeze as much emotion into the story as possible. Apart from the excellent music scenes, there's just not a lot of time for emotional development, so it remains a little sketchy.",
            "review_date": "2007-10-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "An outstanding biopic. I've been a Joy Division fan for 21 years and read everything there is on them, but this film made me appreciate them in new ways. That's quite an achievement. There are some very real, and raw, moments here; An outstanding biopic. I've been a Joy Division fan for 21 years and read everything there is on them, but this film made me appreciate them in new ways. That's quite an achievement. There are some very real, and raw, moments here; so don't go if you're looking for a shallow good time and nothing more.",
            "review_date": "2007-11-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I love Joy Division since I was 12, for the past 15 years I always wondered why he killed himself. Control gave another perspective of Ian, his lyrics and his decision to cash his ticket to the other side..... One of the best movies!!!!!",
            "review_date": "2008-03-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "What a beautiful movie Anton Corbijn made. You can see he is a master in black and white (cinema)photography. Beautiful images and a good storyline. Great acting, especially the character of Ian Curtis: Marvellously played! Gives a very good What a beautiful movie Anton Corbijn made. You can see he is a master in black and white (cinema)photography. Beautiful images and a good storyline. Great acting, especially the character of Ian Curtis: Marvellously played! Gives a very good image of these days in the depri/new wave/ avantgarde/ post punk music scene of Britain.",
            "review_date": "2008-08-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Beautifully shot film, real pleasure to watch, but totally lacks depth and tragedy of Curtis' personality. I think the fact that he killed himself after he listened to Iggy's ''Idiot'' tells us lot more about Beautifully shot film, real pleasure to watch, but totally lacks depth and tragedy of Curtis' personality. I think the fact that he killed himself after he listened to Iggy's ''Idiot'' tells us lot more about him and way he saw things than all this silly love triangle. Basically this film is melodrama, and it's not what IC was about. Anyway, once again - astonishing picture when it comes to visual terms.",
            "review_date": "2008-09-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Control, above all else, truly captures the total apathy towards life necessary in any person's mind to take their own life. It's a journey into something beyond despair, and like one of the above journalists said \"you don't Control, above all else, truly captures the total apathy towards life necessary in any person's mind to take their own life. It's a journey into something beyond despair, and like one of the above journalists said \"you don't watch this movie, you live it\". As a Joy Division fan, I was a little frustrated that they only really concentrated on the band's earlier stage, but as a film, it actually works to the director's end this way. The cinematography really struck me from the beginning of the film, each shot was just really perfect, as the film goes on the shots make less and less sense, which adds to the \"mood\", or more correctly, the utter lack of. Sam Riley should get an Oscar nomination for this performance, beyond brilliant through the whole film. Samantha Morton also plays her part terrifically. I Corbijn would have highlighted the \"fun\" times of the band (if there were any), something that showed them really excited about what they were doing. The movie really puts Joy Division as SUCH as side note to Curtis' story that it actually took away from the realism to me, at least a little bit. The timing of some of the songs at certain key scenes, seemed to come in too soon also. It gave me a feeling of the story being rushed by, where there could have beens more space to allow events to sink in with the audience more. Aside from these minor qualms, the key point about \"Control\" to me, was it's sterility. I left the theatre feeling utterly distraught, without any of the emotion that Curtis spent his short career expressing so beautifully. This, to me, is the movies greatest flaw and strength, depending on how you react to it, or just choose to view it. In reflection, I admire the boldness of the film, and not turning it into just another musician biopic. Probably worth seeing, but whether you are stunned by the films' artistry and power or just drained of all life by the end, is just a matter of chance. I find myself somewhere in between.",
            "review_date": "2007-11-03",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Riley gives a great performance as Ian Curtis, hitting the character perfectly (not just voice or attitude, but also those small little gestures. Cate Blanchett did this in portraying Dylan in \"I'm Not There\"). Corbijn makes a wonderful Riley gives a great performance as Ian Curtis, hitting the character perfectly (not just voice or attitude, but also those small little gestures. Cate Blanchett did this in portraying Dylan in \"I'm Not There\"). Corbijn makes a wonderful turn in his feature debut.",
            "review_date": "2008-02-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Stylish, well defined characters, very well acted. The black and white photography is very effective. I didn't always find the film interesting, but it's well done. I wasn't mesmerized by the main character, I have a feeling I Stylish, well defined characters, very well acted. The black and white photography is very effective. I didn't always find the film interesting, but it's well done. I wasn't mesmerized by the main character, I have a feeling I was supposed to be.",
            "review_date": "2008-05-24",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Not really a Joy Division fan but enjoyed this. Beautifully shot, moving & some excellent acting by Sam Riley, Samantha Morton & the ever brilliant Toby Kebbell.Nice to see Macclesfield getting a bit of recognition.",
            "review_date": "2010-09-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Shot entirely in black and white I found this film very atmospheric and it also had a gritty realism about it. I thought all the performances were excellent with both Sam Riley and Samantha Morton taking top honours. I also have to give aShot entirely in black and white I found this film very atmospheric and it also had a gritty realism about it. I thought all the performances were excellent with both Sam Riley and Samantha Morton taking top honours. I also have to give a mention to Toby Kebbell who totally stole a couple of scenes with some great over-the-top one-liners. The story is primarily told from Debbie’s point of view and as such we get a very interesting look at the life of this enigmatic soul. This film inspired me to go out and buy a Joy Division greatest hits CD and it’s music that’s always been close to my heart. I should mention that all the live performances portrayed in the film were performed by the actors and so hat’s off to them for making it real. Whether you were a fan of the band or not I’m sure you’ll get something out of this one. Be warned though, it’s quite a tough watch, even when you do know the outcome.\r SteelMonster’s verdict: RECOMMENDED\r My score: 8.4/10",
            "review_date": "2013-05-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Director Anton Corbijn turns Joy Division lead singer Ian Curtis' life into an artistic wonder in Control. A depressing and dark film, Corbijn's black and white film with killer cinematography breathes life into a film that would otherwise beDirector Anton Corbijn turns Joy Division lead singer Ian Curtis' life into an artistic wonder in Control. A depressing and dark film, Corbijn's black and white film with killer cinematography breathes life into a film that would otherwise be a pretty typical musician biopic. Okay, it is still a typical musician biopic, but it does look really good. Telling the story of the rise and fall of Curtis, including his infidelity and epilepsy that led to his suicide in 1980, the film is a truly harrowing journey. The serves not just as a showcase for Corbijn, but also his actors led by Sam Riley as Curtis, Toby Kebbell as the band manager Rob Gretton, and Samantha Morton as Curtis' wife Deborah. Together, even when the film slows, the trio makes the film eminently watchable.\r However, the star here remains the cinematography. In particular, there is a shot through a window of Curtis with the reflection of what he can see in the mirror. A truly striking shot, it is a microcosm of this beautiful film. The black and white adds a degree of character to the film that makes it feel appropriate for the era, with this smokiness to every shot. Who better to add late 1970s British rock scene touches to the film than Corbijn, who has become far more well known for his work in the world of music than in film.\r In terms of acting, Control is a real showcase. Sam Riley plays Curtis brilliantly. Through each sequence, you can see the darkness closing in on him as he spirals further and further out of control. Though he tries to escape, there was never any hope for the man as the walls closed in all around. At home, he had broken his relationship with Deborah. On the road, he felt extreme guilt when he slept with Belgian journalist Annik Honore (Alexandra Maria Lara). With the band, his epilepsy wreaked havoc while Joy Division gained more and more notoriety that he could not cope with. Riley brings these elements to life in his portrayal of Curtis and it makes his transformation from a typically energetic teenager to a dark and depressed man in his early 20s all the more harrowing. As the band manager, Kebbell is energetic and truly charismatic. Whenever he is on the screen, his performance makes the character truly magnetic. As Curtis' wife, Samantha Morton plays a heartbroken and tormented Deborah. Her brilliance is subtle throughout the film, but truly realized in the final sequence when she finds Ian dead. Her emotion and power as we hear her find him is a terrific close to the film.\r Yet, Control is not perfect. Far too slow and moody, Control feels emotionally distant from beginning to end. Though Curtis certainly was a distant person, this does not make for a great film. While there is more than enough to like about Control in spite of this distance, it does prevent it from becoming an even better film. As a result of this distance, the film also feels incredibly cold. When things happen, except for at the end, it lacks the emotional punch required to make the film a truly lasting experience. Instead, Control winds up being a good biopic of Curtis with great acting and cinematography, but no lasting power.\r As a whole, Control is a good film that could have been better if it let us into its world a bit more. That said, it remains a terrific look at the harrowing descent experienced by Ian Curtis that culminated in his suicide at the age of 23. However, as musician biopics go, though Control is quite good, it never really rises above the crowd.",
            "review_date": "2016-11-05",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The result is a shockingly human and aptly perceptive biopic.",
            "review_date": "2012-11-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A story about a tormented young singer committing suicide on the verge of stardom is bound to have a certain appeal. However, the risks of falling into melodramatic or morbid are high. Corbijn avoids both, directing this minor masterpieceA story about a tormented young singer committing suicide on the verge of stardom is bound to have a certain appeal. However, the risks of falling into melodramatic or morbid are high. Corbijn avoids both, directing this minor masterpiece with restrain and respect for all those involved.\r I loved the B&W photography. It recreates the atmosphere of those years, which seem long gone, the bleak but bubbling music scene, and the excitement about the new wave just about to explode.  Youth having everything and not realizing how fragile life is.\r Ian Curtis was a particularly fragile creature, both because of his epilepsy and his problem with communication. A confused boy without guidance, who wrote some of the most depressing lyrics ever, he still has a huge following. Maybe because his anguish is universally understood.\r I am not a Joy Division fan, nor was I particularly shocked by Ian Curtis early departure. However, this movie is so well made that made listen again to their music. After more than 25 years their songs sound even more claustrophobic and depressing and I wonder how Curtis would have developed as a singer.\r Had he lived on, I doubt he could have transitioned easily into the light-hearted pop atmosphere of the late 80's. By checking out so early he became unforgettable. Even more so, with this sober but poignant movie celebrating his short time on earth.",
            "review_date": "2013-08-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I'd like to think this is a fairly insightful film about the life of Ian Curtis, singer in The Joy Division. I can't claim to have known much about him prior to seeing the film - I'm keen on music biopics, so when I heard about this film II'd like to think this is a fairly insightful film about the life of Ian Curtis, singer in The Joy Division. I can't claim to have known much about him prior to seeing the film - I'm keen on music biopics, so when I heard about this film I decided to watch it. Its all in black and white, giving it a slightly underground or grunge-y type feel to it (which goes with the style of music played), I suppose, plus highlighting the bleakness of the north, where its mostly set. I certainly felt sorry for Debbie. I'd say the mundanity of their married life is well portrayed. The music recording sessions featured sounded pretty decent too. The irony of him singing about isolation didn't pass me by either. Its undoubtedly sad to see what apparently happened, although Ian Curtis was far from a perfect guy but it is a sad story never the less. As a film I thought it was quite engrossing and I'd recommend it on that basis.",
            "review_date": "2021-11-21",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 55
}