{
    "title": "Delta Farce",
    "rating": 4.6,
    "release_date": "2007-05-11",
    "genre": [
        "Action",
        "Adventure",
        "Comedy"
    ],
    "summary": "A comedy about three blue collar heroes on the military's front line in Iraq.  (Lionsgate)",
    "critic_reviews": [
        "If three of \"The Magnificent Seven\" had been Gomer Pyle, the result might have looked like Delta Farce, a movie rife with fat, fart and Fallujah jokes, but with a subcutaneous wit that has a lot to do with Iraq war fatigue.",
        "You could make a case that any movie in which Mexicans and rednecks become best of friends is a net positive for society. But to do that, you'd have to ignore the severe boredom that sets in about halfway through this comedy.",
        "Dreadfully unfunny.",
        "Perhaps the people most insulted are white Southerners, who presumably are expected to embrace one whopping brain-dead metaphor.",
        "The hilariously dirty insult comic Lisa Lampanelli shows up all too briefly as Engvall's shrewish wife.",
        "Delta Farce is so relentlessly racist (and homophobic), without ever having the intelligence to pass that bigotry off as satire, that viewers will be left thinking \"Borat\" has a soft touch.",
        "Larry the Cable Guy channels both Moe and Curly in the Three Stooges-go-to-war comedy Delta Farce.",
        "Overall the movie is too stupid to offend any but the most sensitive viewer.",
        "Consider this the sequel to \"Ernest in the Army \" that the late Jim Varney never got around to making. It's not very good but at least it's not evil.",
        "A mindless comedy where the blatant racial stereotypes are outnumbered only by the flatulence jokes. The best thing that can be said about this movie is it falls just short of being an international incident.",
        "One of those celebrations of idiocy that never seem to go out of vogue.",
        "The worst thing about Delta Farce is its overall feeling of contempt--for the filmmaking process, for common decency, and, most despicably, for the audience.",
        "Here's a sobering thought: If every war gets the comedy it deserves, could Delta Farce, a strenuously unfunny \"Three Amigos\" knockoff, be our M*A*S*H?",
        "If Director C.B. Harding's intention was to make one of the worst films in recent memory, congratulations are in order.",
        "But is it funny? Not really."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "Silly fun like the Airplane and Naked Gun movies! I laughed through the whole movie!",
            "review_date": "2007-05-30",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A few laughs and i did enjoy it but to call this a great movie or even a great comedy requires serious mental problems on the viewers part. not that bad though.",
            "review_date": "2008-07-09",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Imagine a comedy directed by the guy who directed that Skinimax show \"Passion Cove.\" That's the only laugh you'll get from this guy.",
            "review_date": "2007-05-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The only advice that's needed before you see this movie is to leave your brain at home before you go. This mindless comedy is probably the biggest waste of time any movie will give you and the bad acting is almost unbearable. the only The only advice that's needed before you see this movie is to leave your brain at home before you go. This mindless comedy is probably the biggest waste of time any movie will give you and the bad acting is almost unbearable. the only thing that saved this movie is a couple of witty lines, but other than that this is just a terrible movie. Now I know why Jeff Foxworthy wasn't in this!",
            "review_date": "2007-05-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It made me laugh a few times, and was harmless, and I didn't expect more than that.",
            "review_date": "2007-06-27",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I love Larry the Cable Guy, but this movie was weak and it only had the intermittent comedy moments that you would expect from Larry and Bill.",
            "review_date": "2007-09-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "The fact that \"get 'er done\" captivated middle America is enough to not watch this movie.",
            "review_date": "2008-04-06",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "So bad it's watchable for all the wrong reasons.",
            "review_date": "2009-08-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I was so offended I left, and I'm a blue collar guy, it just was not funny and crude. I don't know why movies like this are even made.",
            "review_date": "2007-05-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Anyone who gave this execrable dreck a rating of 10 should be sentenced to watching Larry the Cable movies for the rest of their lives.",
            "review_date": "2007-05-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Who the f.ck looks at these kinds of scripts and goes \"Yeah, we can fund this.\" I blame the studios almost as much as I blame the writers. I also hate Larry the Cable Guy, and southerners, but that's another story.",
            "review_date": "2007-05-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "While it's not as bad as you hear it is, The raunchier gags in Delta Farce leave something to be desired.",
            "review_date": "2008-01-28",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A while back, in My review of \"The Pink Panther,\" I talked about my disgust with people who can't seem to go into movies and just be entertained without having to think too deeply. Judging from the reviews that \"Delta Farce got, A while back, in My review of \"The Pink Panther,\" I talked about my disgust with people who can't seem to go into movies and just be entertained without having to think too deeply. Judging from the reviews that \"Delta Farce got, I'd say that this was the case here. So, people, it's time to get those bugs out of your butts and learn to enjoy a movie, in spite of the fact that it may be nothing but a silly comedy that relies heavily on crude humor. Not every movie can be adapted from a Shakespeare play. As for me, I found this movie to be absolutely hilarious. If you can except that some movies are meant to just be fun and never take itself seriously, I highly recommend \"Delta Farce.\"",
            "review_date": "2008-05-12",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "What an great funny film. Reminds me of the 3 Amigos. Laughed throught the whole film.",
            "review_date": "2007-05-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's really good fun.!!",
            "review_date": "2007-05-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "I didn't expect this film to be Full Metal Jacket, but I didn't expect it to be as bad as it was. There were a few laughs, but I expected better from Larry and Bill. They should stick to stand up comedy.",
            "review_date": "2007-05-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "While Delta Farce may have its moments of being hilarious, it is overall a terrible comedy that barely warrants the time put into watching it.  Sadly though, this movie looks like the best it could possibly be considering the terrible actorsWhile Delta Farce may have its moments of being hilarious, it is overall a terrible comedy that barely warrants the time put into watching it.  Sadly though, this movie looks like the best it could possibly be considering the terrible actors they got to play the lead characters. However, I can easily see this movie appealing to many people who love ridiculous comedies like Airplane, so it might be worth trying for diehard fans of this type of comedy.",
            "review_date": "2013-12-27",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 33
}