{
  "title": "Norbit",
  "rating": 4.5,
  "release_date": "2007-02-09",
  "genre": [
    "Comedy",
    "Romance"
  ],
  "summary": "Norbit (Murphy) has never had it easy. As a baby, he was abandoned on the steps of a Chinese restaurant/orphanage and raised by Mr. Wong (Murphy). Things get worse when he's forced into marriage by the mean, junk food-chugging queen, Rasputia (Murphy). Just when Norbit's hanging by his last thread, his childhood sweetheart, Kate (Newton),Norbit (Murphy) has never had it easy. As a baby, he was abandoned on the steps of a Chinese restaurant/orphanage and raised by Mr. Wong (Murphy). Things get worse when he's forced into marriage by the mean, junk food-chugging queen, Rasputia (Murphy). Just when Norbit's hanging by his last thread, his childhood sweetheart, Kate (Newton), moves back to town. In the comedy \"Norbit\", he'll show them all that nice guys sometimes finish first.  [DreamWorks Pictures]… Expand",
  "critic_reviews": [
    "If Eddie Murphy gets an Oscar for \"Dreamgirls\" later this month, the deciding factor with voters may be his performance in Norbit. It's much more impressive than anything he does in \"Dreamgirls.\"",
    "The fun in Norbit is watching Murphy at work – the guy has a knack for bringing the physicality of his comic characters to life.",
    "With his brazen gifts for mimicry, Eddie Murphy may now be the Peter Sellers of blockbuster toilet comedy movies.",
    "Although there's no denying the threadbare nature of the script, watching Murphy riff can be a formidable entertainment on its own.",
    "The question is not whether Murphy can do anything. He can. The question is why he would want to make a movie as squirmingly unfunny as Norbit.",
    "Now we get a lazy Eddie in Norbit, a lackluster attempt to make a gross-out romantic comedy.  When I say lazy Eddie, I mean imaginatively lazy.",
    "Norbit might have worked if it had fully committed to being over the top or made Rasputia the lead character and found the human inside the cartoon. Instead, the movie doesn't give us anyone to care about.",
    "Not exactly uproarious. But Mr. Murphy, going back at least to his Gumby and Buckwheat days on \"Saturday Night Live,\" has always had the ability to turn broad caricature into something stranger and more inventive.",
    "There are so many problems with Norbit that when you try to pin one down, another one splooges out elsewhere.",
    "The only recommendable thing about Norbit is that he's not as bad as every other person in this movie.",
    "Norbit is pretty much a bad-taste sinkhole.",
    "Much of the movie -- which Murphy wrote with a small posse of collaborators -- is taken up with the torturously dull, not to mention unbelievable, romance between Norbit and Kate (a disappointingly lackluster Newton) and the tedious agenda of Cuba Gooding Jr. as a schemer-manipulator.",
    "This dismal comedy joins a growing pile of Murphy disasters.",
    "Murphy's story lacks even the basic form that held most of \"The Nutty Professor\" together.",
    "Murphy speaks in a breathy lisp, as if his mouth had been partially buttoned shut, and he doesn't give himself the nerd's traditional redeeming feature of a geeky, slide-rule intellect. Norbit, all frozen gawk, is just a very dim bulb.",
    "It's hard to know who is the intended audience for this misguided mess.",
    "Mean-spirited and depressing, this horror movie in comedy disguise delights in the twin spectacles of morbid obesity and domestic abuse, of which children are often the target.",
    "While there are some scattered laughs, the flimsy and nonsensical script - combined with the sledgehammer direction by Brian Robbins, make the similarly themed \"Big Momma's House\" look like Noel Coward.",
    "It's crass, cruel, and borderline offensive, but the laughs that could redeem all of that are missing. Material as bad as the tripe that comprises Norbit can be endured only if there's a payoff. In this case, the point seems to be that some actors will do anything for a buck.",
    "Racially insensitive, politically incorrect and beyond crude.",
    "Murphy and his brother Charlie, who collaborated on the screenplay, seem to have drawn the wrong lesson from the latter's stint on \"Chappelle's Show.\" Where Dave Chappelle used stereotypes to confront prejudice, the Murphys (and their co-screenwriters Jay Scherick and David Ronn) merely squeeze a few grudging drops from caricatures that were wrung dry in the age of vaudeville.",
    "Stereotype-based comedy from Eddie Murphy in a variety of fat suits is just not enough to make a decent film.",
    "It's an astonishingly crass and vulgar film, crudely directed on a cut-rate budget by Brian Robbins, never more than almost funny or less than disturbing.",
    "It's recidivist Murphy: bad-skit comedy populated by caricatures in search of a movie.",
    "There's enough material here to add another hour to Spike Lee's \"reel of shame\" in \"Bamboozled,\" but hideously offensive black stereotypes are merely the tip of the iceberg.",
    "Compared to Norbit, “Date Movie” is \"Casablanca.\" If I thought hijacking a plane carrying prints of the film and crashing it into Murphy’s house would put a stop to it, I’d go out and buy a box cutter right now."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Was an ok comedy. It was funny at times but too similar to Eddie Murphy's other films and it didnt do enough to seperate itself. Worth the watch imo but thats about it.",
      "review_date": "2011-12-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Poor, poor Norbit haha. The fat cow was hilarious thought. It's funny how in real life is the same - good and pure people receive undeserved meetings with nasty people, that are persistently messing up with their lives.",
      "review_date": "2017-12-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Só passei pra deixar meu 0, nessa bosta, o filme é um lixo não perca tempo assitindo essa bosta.",
      "review_date": "2018-08-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie was exactly what I thought it would be. It was mostly funny, sluggish in the middle, and overdone at the end. I found Eddie Murphy's asian character hilarious. I also loved the wife's character, although there were a few This movie was exactly what I thought it would be. It was mostly funny, sluggish in the middle, and overdone at the end. I found Eddie Murphy's asian character hilarious. I also loved the wife's character, although there were a few missed opportunities with her. The only thing that bothered me was the scene when the little, overweight girl was riding the pony, and Norbit says, \"I know how you feel, pony.\" And then the camera shows the pony crying. I just found that to be very cruel towards overweight people. In fact, the whole movie was cruel to overweight people. I just felt they should have toned it down some, or balanced it out by adding another overweight but positive character.",
      "review_date": "2007-02-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Even if a lot of people basically think this movie is Eddie Murphy at it's worst. I personally think this movie is really well done. The jokes were sometimes funny, and most importantly. Eddie did very well of being three actors, Even if a lot of people basically think this movie is Eddie Murphy at it's worst. I personally think this movie is really well done. The jokes were sometimes funny, and most importantly. Eddie did very well of being three actors, especially Mr Wong. He looked so different from Eddie, I never thought it was him. I give it a 7.",
      "review_date": "2007-06-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The way Eddie Murphy spoke of this movie, I thought it would be hilarious, but quite the contrary. It was a waste of nine dollars and very disappointing. Bad humor, predictable plot, and unneccessary bad language.It has too much adult The way Eddie Murphy spoke of this movie, I thought it would be hilarious, but quite the contrary. It was a waste of nine dollars and very disappointing. Bad humor, predictable plot, and unneccessary bad language.It has too much adult content to take the young kids and not enough humor for any one older than 17 to enjoy. There were a few moments where you may have thought about laughing, but that feeling soon went away.I know Eddie Murphy can do better than that.",
      "review_date": "2007-03-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Awesome movie,i don't understand the hate,a lot of good jokes and funny moments!",
      "review_date": "2020-04-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Oh my **** god, that was the worst piece of crap I've ever seen. Not gonna lie, it made me laugh a little bit, but I was annoyed in most part of the movies, domestic abuse + mobid obesity = this ****",
      "review_date": "2021-03-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "5th best Eddie Murphy I have ever seen, aside from the 4 Shrek movies. My 1st time watching “Norbit”, I was 8 or 9 years old. As I grew older, I started watching it more by myself because I was already past 12 years old. It never fails to5th best Eddie Murphy I have ever seen, aside from the 4 Shrek movies. My 1st time watching “Norbit”, I was 8 or 9 years old. As I grew older, I started watching it more by myself because I was already past 12 years old. It never fails to make me laugh. If “Norbit” could get a decent sequel, I’d still pay decent money to watch more of Norbit’s adventures. I’m ranking “Norbit” 10/10 because it deserves a high score & again, a decent sequel that must score higher on Rotten Tomatoes, Metacrtic, & at the box office, even though this funny movie managed to make almost 3x it’s budget. Well deserving.",
      "review_date": "2021-12-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Comparing this to Eddie Murphy's previous works (Coming to America, Trading Places, etc.), this is literally his worst shot in film history ever. I think it deserved a lot of raspberries from basically Eddie Murphy himself portraying asComparing this to Eddie Murphy's previous works (Coming to America, Trading Places, etc.), this is literally his worst shot in film history ever. I think it deserved a lot of raspberries from basically Eddie Murphy himself portraying as Rasputia which is worth a lot of my disgust and she's the only reason why I gave this movie a 0 out of 10.\r I don't want to pull out the, \"This is one of the worst movies I've ever seen!\" cliché because it sounds stupid saying it in front of a lot of great movies, but because this movie's forcing me... I had to. Users who rated this higher than 3 should find a good movie from Eddie Murphy to watch or find their 0's and watch that more than this disrespectful grace from Hollywood.\r Brian Robbins was possibly thinking... \"Hey, let's just rip off the Nutty Professor and make it worse. I will call this movie 'Norbit' and it'll follow the disgusting story of how exactly Norbit fought back! I'll make Sherman Klump a woman and name her Rasputia so no one will notice the amount of high disgust I've ever worked on!\"\r If you manage to give the good movies a 0 and other movies that's not worth giving a 0 in, your opinion sucks unless you give this movie a 0. I know there's more bad movies to give it a 0 in, but this horror trying to hide in comedy disguise is blocking it in the way.\r Hooray! It's been 9 years since the release for this disgusting film in theaters. This movie makes EVERY good movie look bad when you combine it with a good movie. A general insult to this world that whines itself to never exist again.",
      "review_date": "2016-02-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "haha haters. are you guys giving this movie low scores because you look like Rasputia and it hit a little close to home? don't get butthurt - it isn't the funniest movie around, but it surely doesn't deserve this low a score",
      "review_date": "2007-06-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "where is number 2? I love this movie and it is 100% funny. I would love a number 2. You people who rated bad dont know a good movie even if it hit you in the face. Please make norbit 2!!!!!!!1",
      "review_date": "2011-11-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "this movie is hilarious. watch it! the characters are very funny, especially resputia (lol). Who cares about stereotypes? hollywood is all stereotypes. critics are stupid, see the movie for yourself!",
      "review_date": "2010-09-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Not the greatest Comedy out there, but I did laugh. It doesnt deserve all the hate it's getting. And I am not a fan of the fact it was trying to be serious, but that didnt ruin it for me.",
      "review_date": "2010-10-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Very, very funny. I think that some people just have bad taste giving negative reviews but hey, I enjoyed it. I found it very funny and it does have some soft moments that feel just right. I would really check it out, I liked it and I thinkVery, very funny. I think that some people just have bad taste giving negative reviews but hey, I enjoyed it. I found it very funny and it does have some soft moments that feel just right. I would really check it out, I liked it and I think you will too.",
      "review_date": "2011-02-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "No a bad movie. It's a very silly movie and for the most part good. There were some slow/boring parts in the movie but over all a good movie. If you need a good laugh, this will gave you one. You won't be crying from laughter but you willNo a bad movie. It's a very silly movie and for the most part good. There were some slow/boring parts in the movie but over all a good movie. If you need a good laugh, this will gave you one. You won't be crying from laughter but you will walk away with a nice smile.",
      "review_date": "2011-02-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was obnoxious, this is Eddie Murphy's worst comedy, Norbit's wife and her family are so unlikable. Just plain garbage.",
      "review_date": "2018-07-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I can't believe that almost 9 years passed since the premiere of \"Norbit\"! Eddie Murphy is one of the funniest comedians of all-time! The story is very decent, but overall the fun is guaranteed!",
      "review_date": "2015-12-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film is ghastly, there's nothing at all to be enjoyed about it. I'd rather 3 hours of film pointed at a camera than watching 10 minutes of this. Avoid.",
      "review_date": "2017-12-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I am an Eddie Murphy fan but his movies have dropped in quality.  This is a movie which makes Eddie Murphy look like a stupid idiot.  Overall, do not watch.",
      "review_date": "2016-07-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Giving this movie the neg reviews it has gotten is ridiculous. It is very Funny and one of the best Eddie Murphy films I have seen, Love it. This movie is not racist. We have to learn how to laugh at ourselves in life that's all this movie isGiving this movie the neg reviews it has gotten is ridiculous. It is very Funny and one of the best Eddie Murphy films I have seen, Love it. This movie is not racist. We have to learn how to laugh at ourselves in life that's all this movie is about. Stop being so stuffy.",
      "review_date": "2016-06-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Norbit is such a stupid movie. It’s mean-spirited, extremely ridiculous, too over-the-top, and barely funny. Eddie Murphy lost all dignity when he co-wrote the screenplay and agreed to star in this horrendous comedy. The screenplay isNorbit is such a stupid movie. It’s mean-spirited, extremely ridiculous, too over-the-top, and barely funny. Eddie Murphy lost all dignity when he co-wrote the screenplay and agreed to star in this horrendous comedy. The screenplay is horrendous, the acting is over-the-top, most of the humor is painfully unfunny, and the the movie is full of stereotypical characters. Norbit was one of the top 3 worst films of 2007 along with Good Luck Chuck and Because I Said So. Norbit was the third worst film of 2007 right behind Good Luck Chuck. This is his second worst movie right behind A Thousand Words. Norbit was one of the worst movies I have ever watched. The one positive thing I can say about this movie is that Thandie Newton looks absolutely beautiful, gorgeous, stunning, hot, and fine as hell in it and was in her prime.",
      "review_date": "2019-11-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \ni really hate this!!! is pure garbage!!! but i really like Rasputia perfomance...haha!!! this movie is really discriminative...but sometimes funny...complicated",
      "review_date": "2010-10-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "was unacceptable really 1 is too much i should give it 0 was dreadful was worse than date movie '''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''",
      "review_date": "2011-01-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "this might be one of the most, if not the most unfunny movies I've ever seen. Waste of time, space, and talent.where's the old  Eddie Murphy, the funny one. I think he died with Pluto Nash",
      "review_date": "2011-01-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I feel like if this movie had come out about the time The Nutty Professor came out it would have done better.  The makeup they did for the the various Eddie Murphy characters was good and very realistic.  That was the only positive in theI feel like if this movie had come out about the time The Nutty Professor came out it would have done better.  The makeup they did for the the various Eddie Murphy characters was good and very realistic.  That was the only positive in the movie though.  I had a hard time identifying with any of the characters and in all honesty found Norbit annoying.  The only more annoying character was Rasputia.  It makes me sad the Cuba Gooding Jr. was in this and it makes me really sad that Eddie Murphy feels like he has to go back to his old ways to re-make his career instead of moving forward as an actor.",
      "review_date": "2012-02-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Another stupid comedy that tries WAY too hard to entertain you, and fails miserably.",
      "review_date": "2012-11-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Norbit es la clase de pelicula fastidiosa que intenta llegar lejos de una forma mediocre,pero logra un poco dentro del fracaso pues logra tener algo de humor despues de un tiempo",
      "review_date": "2013-08-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Eddie Murphy supposedly insulted a lot of people with this film: foreigners, racial stereotypes, obese women, nerds, hopeless romantics, animals, intelligent people, and moviegoers. But the one person whose feelings he hurt more than anyoneEddie Murphy supposedly insulted a lot of people with this film: foreigners, racial stereotypes, obese women, nerds, hopeless romantics, animals, intelligent people, and moviegoers. But the one person whose feelings he hurt more than anyone else was his own.",
      "review_date": "2014-05-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Awful movie, all the praise for this movie must be from the marketing department! This review must be 150 characters, but there are no words for how bad this film is. AWFUL.",
      "review_date": "2014-06-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "1/5★ Eddie Murphy is a funny, talented guy who can play several distinct characters in one film. Norbit is a disgusting, how was this made, why am I laughing film that is a mean and crass misfire that makes Big Momma look like Shakespeare. I1/5★ Eddie Murphy is a funny, talented guy who can play several distinct characters in one film. Norbit is a disgusting, how was this made, why am I laughing film that is a mean and crass misfire that makes Big Momma look like Shakespeare. I have no doubt the cast in this film: respected actors like Thandie Newton and Cuba Gooding, Jr. wish that Norbit fade away, never to be spoken of again.\rVerdict: Skip",
      "review_date": "2015-01-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "There are two letters in the title name that should tell you not to watch this hunk of garbage. N and o, no. I feel if this was like nicki manize( i forgot how to spell her last name).at the age of fifty.",
      "review_date": "2016-03-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Boring and crap. They tried to make it too serious. Shoud have just been dumb fun.",
      "review_date": "2007-04-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Eddie Murphy should be ashamed for producing this appalling piece of racist, sexist and horrendous rubbish which is claimed to be a comedy. It brings shame to the genre and cinema itself. We have a brilliant actor, a influential black one as Eddie Murphy should be ashamed for producing this appalling piece of racist, sexist and horrendous rubbish which is claimed to be a comedy. It brings shame to the genre and cinema itself. We have a brilliant actor, a influential black one as well, showing his stupid side and making a poor film after creating such brilliant films such as the Nutty Professor. The reviews are harsh, I saw the film to see how awful it was - no redemption, perhaps the credits are good because you know this nonsense is over. Shame on Mr Murphy and don't bother even mentioning this name. Murphy is a great disappointment and he is better than all the other crappy comedy actors like Sandler, Ferrel and other low lives. He is brilliant but this is something he would want to forgot. Just avoid this film and watch something which is actually funny and show him how it is done - him being black is not the issue but the fact that he is a role model means that he has let people down and moved back years in terms of what people laugh at. crude and hard to watch - i feel sick and ill. Murphy is one of my favourite actors, he has let me down. Captain Meow over.",
      "review_date": "2007-06-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie was hilarious but at some points boring. It would flash to the fat girl, and then to the loser guy. The fat women was hilarious but everything else brought the movie down.",
      "review_date": "2007-02-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I love Mr. Murphy but this was the most god awful piece of crap Ii've ever seen. The only thing that can explain Murphy agreeing to do something this bad is as a favor to his brother Charles. The always hilarious Katt Williams is wasted I love Mr. Murphy but this was the most god awful piece of crap Ii've ever seen. The only thing that can explain Murphy agreeing to do something this bad is as a favor to his brother Charles. The always hilarious Katt Williams is wasted in this film and every \"joke\" fell flat on it's face.",
      "review_date": "2007-02-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's incomprehensible why Eddie Murphey would subject himslef to this absolute garbage. He doesn't deserve this. Eddie is a fine actor, but wasting his talent in a formidable fat-suit cannot elevate a career.",
      "review_date": "2007-02-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It is the most awful offensive disturbing film i have ever seen. Racist, offensive to overweight people and what seems to be most unnoticed is that its a film which claims abuse is funny!!!!!!!! Something which is most definately is not. It is the most awful offensive disturbing film i have ever seen. Racist, offensive to overweight people and what seems to be most unnoticed is that its a film which claims abuse is funny!!!!!!!! Something which is most definately is not. Watching some guy get beaten up by his wife--i have a sense of humour--and that is not funny, thats disturbing.",
      "review_date": "2007-03-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "When will Eddie Murphy stop? Well I can't wait to see the next movie...EXTRAS....Pshhh who needs them we have Eddie Murphy. Not worth the time or money to go see.",
      "review_date": "2007-03-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Whoa, SF Chronicle, c'mon.... Even MENTIONING the Oscars in a review of this horrendous film is like sacrilege. Don't waste your money, even for a rental later on.",
      "review_date": "2007-03-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Pure garbage. Vile and offensive.",
      "review_date": "2007-08-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I was disappointed. I was hoping for a few laughs, but this movie was obiously created for 8-year-olds.",
      "review_date": "2007-02-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I know it's not fair to judge a genre on one movie, but wow. Black cinema, you better roll out something good to cover the wound this movie has done to your image. Don't worry, white people are having the same trouble. We just had I know it's not fair to judge a genre on one movie, but wow. Black cinema, you better roll out something good to cover the wound this movie has done to your image. Don't worry, white people are having the same trouble. We just had WIld Hogs. And Ghost Rider. And Premonition. And TMNT. You know what, maybe Spanish cinema can fix this for us.",
      "review_date": "2007-03-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Was this movie really this horrible, 27. This entire website discredits every comedy, from Blades of Glory to the Waterboy with Adam Sandler. Now, keep in mind that these are comedies and are not representative of reality, because if so, Was this movie really this horrible, 27. This entire website discredits every comedy, from Blades of Glory to the Waterboy with Adam Sandler. Now, keep in mind that these are comedies and are not representative of reality, because if so, they would have been classified as documentaries. The reason I am giving this movie a ten is to raise this movie's rating up to somewhere it should be. There is many different types of jokes, though some of us like kid like comedies like \"Finding Little Nemo\", some of us do enjoy getting away from reality for a little while, and exercising our right to criticize all kinds of people in society.",
      "review_date": "2007-03-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A movie with Eddie Murphy in a fat suit--yeah, there's something we haven't seen enough of.",
      "review_date": "2007-05-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I think most of the low reviews are due to this movie not being politically correct. It's a funny and entertaining movie. And I'm a bit of a movie snob too - a little over critical usually. It's refreshing to have a movie I think most of the low reviews are due to this movie not being politically correct. It's a funny and entertaining movie. And I'm a bit of a movie snob too - a little over critical usually. It's refreshing to have a movie that's not hyper sensitive to everyone who could be possibly be offended by the tiniest things.",
      "review_date": "2007-06-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Movie was funny. Every turn there was something funny and it kept you interested. Muphy two characters of Rasputia and Mr Wong were the funniest. Black Stereotypes Asian Stereotypes whit Stereotypes were all in the movie.",
      "review_date": "2007-02-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This cheerfully overinflated, cheekily offensive comedy will retain a permanent footnote in movie history as The Movie That Cost Eddie Murphy An Oscar (for his spectacular supporting turn in Dreamgirls). It shouldn't have. Say what you This cheerfully overinflated, cheekily offensive comedy will retain a permanent footnote in movie history as The Movie That Cost Eddie Murphy An Oscar (for his spectacular supporting turn in Dreamgirls). It shouldn't have. Say what you will about the movie itself, but you can't deny Murphy's astounding comedic skill in his multiple roles as the nerdy title character, the grotesquely huge woman he marries, and an elderly Asian man who runs the orphanage/ restaurant that Norbit spends his formative years in. (It's even more of a compliment to Murphy's prowess that it took me a solid ten minutes to realize that he was playing this role, too.) Of course, Murphy is aided immeasurably by the phenomenal makeup work of Rick Baker, who performed the same services for Murphy when he played the Klump family in the Nutty Professor pictures...and on a less flashy but equally enjoyable technical level, Clay Griffith's and Richard Greenfield's slightly romanticized small-town sets are a joy to look at. There are several good one-liners; the scene in which gargantuan Rasputia boards a water slide is an effective comic set piece, and the running gag involving her and a car horn killed me. Quite frankly, if you were bothered by the preview, then nothing short of a gun to your head or the kidnapping of your children should've gotten you into the theater, so you really have nothing to complain about. This doesn't mean, however, that Norbit DOESN'T have some substantial problems on a very basic thematic and storytelling level. The Nutty Professor's Sherman Klump, who was almost as exaggeratedly proportioned as Rasputia, was also an extremely kind and decent soul who was thoroughly deserving of a rewarding romantic relationship, and it's clear very early on that Norbit ISN'T going to take that route. (Sherman's closest female counterpart was Gwyneth Paltrow's sweet Rosemary in the Farrelly brothers' best film to date, the endearing Shallow Hal.) In order to sell Norbit's emotional affair with childhood friend Kate (Thandie Newton) the moviemakers have to give Rasputia a thoroughly repellent personality, and they do: she's repulsively bossy, dictatorial, hypocritical and unfaithful to her husband. That's not the problem, but the casting of the other woman is; I can't knock Newton's performance because she's perfectly charming in this role (and does a lot to counteract her unplayable shrew in The Pursuit of Happyness), but consciously or not, Norbit's makers hired an actress who's far skinnier than the norm, and in doing so propounded the thinking that fat women--who, along with blondes, are the last feasible targets of derisive jokes in these politically correct times--are unworthy of being loved. Hiring an actress with curves, such as Queen Latifah, Oprah Winfrey or even Murphy's Dreamgirls costar Jennifer Hudson as the romantic interest would have done a lot to erase this caveat, but the moviemakers' failure to do so indicates that Norbit's central flaw isn't its silliness or its grossness but its inability to think outside the box. Moviegoers who are legitimately bothered by this can at least take comfort in knowing that TV's Ugly Betty (both the character and the actress, America Ferrera) has rapidly become not only a national heroine but a role model...and can count down the time before the show's first-season DVD set comes out.",
      "review_date": "2007-04-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The film is fairly funny with some good lines and a notable performance by Eddie Murphy but for the most part it was more dumb-witted than it should have been. Some jokes were kind of sketchy and other hardly made sense. By the end it was The film is fairly funny with some good lines and a notable performance by Eddie Murphy but for the most part it was more dumb-witted than it should have been. Some jokes were kind of sketchy and other hardly made sense. By the end it was like the writers ran out of ideas and expected the audience to continue laughing about Eddie Murphy in a obese female suit an hour in. All in all it's good for a laugh but not for the kids or a first choice movie pick.",
      "review_date": "2007-04-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A comedy with stupid fun humor. It was a slapstick comedy, but it gets you to laugh a lot! I'm surprised at that I went to see it, because I'm a big movie critic sort of guy, but I don't regret it.",
      "review_date": "2007-06-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a hilarious film, one to watch if you want to laugh!When I watch it with Family and Friends, our body hurts from laughing.Therefore we do not understand that the movie has a low score?\nEither people has not seen the movie, or theyThis is a hilarious film, one to watch if you want to laugh!When I watch it with Family and Friends, our body hurts from laughing.Therefore we do not understand that the movie has a low score?Either people has not seen the movie, or they have NO sense of humor at all.One person wrote the move was to serious, the move is in NO way serious.I really think that People should give it a chance, have an open mind.Or maybe people are too sensitive today, to watch real humor!",
      "review_date": "2020-07-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "We watch this movie all the time...funny, over the top comedy. So much hate for this movie is disappointing.",
      "review_date": "2021-03-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Childhood movie 10/10    visits to the public and private sector and the other day and I have a keep it up with a keep it up with a keep it up with a keep it up with a keep it up with a lot to me I am not going anywhereChildhood movie 10/10    visits to the public and private sector and the other day and I have a keep it up with a keep it up with a keep it up with a keep it up with a keep it up with a lot to me I am not going anywhere else to do this to the public on the way to go to a keep saying it was",
      "review_date": "2020-07-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Ugh, this movie is so awfully bad. Eddie Murphy, why are you doing this to yourself?!!! You're a great comedian, and you deserve 100% better material than this crap! This is just an eye-hurting, racist, misogynistic, and has some of the worstUgh, this movie is so awfully bad. Eddie Murphy, why are you doing this to yourself?!!! You're a great comedian, and you deserve 100% better material than this crap! This is just an eye-hurting, racist, misogynistic, and has some of the worst humor ever. Whoever made this movie should receive some sort of penalty for this abhorrent piece of clow flop. One thing is, I can share some common personality traits with Norbit, the titular character. I am mild-mannered and easy going. However, this is the only one good thing about this pointless, racist, misogynistic, and just straight-up awful comedy! As a racial justice advocate, I want to rid society of this largest heap of racist trash ever made in the history of cinema! On one positive note, bonus points to Richard Gant. He's always a good guy, no matter what crap movie he is in.",
      "review_date": "2023-01-16",
      "source": "metacritic"
    }
  ],
  "num_reviews": 80
}