{
  "title": "Ratatouille",
  "rating": 8.6,
  "release_date": "2007-06-29",
  "summary": "Despite his sensational sniffer and sophisticated palate, Remy's dreams of becoming a chef seem hopeless due to one small detail--he's a rat! Through a twist of fate, he ends up in the world-famous restaurant of his late hero, Auguste Gusteau. With a dash of culinary courage and the help of garbage boy Linguini, Remy whips up exquisiteDespite his sensational sniffer and sophisticated palate, Remy's dreams of becoming a chef seem hopeless due to one small detail--he's a rat! Through a twist of fate, he ends up in the world-famous restaurant of his late hero, Auguste Gusteau. With a dash of culinary courage and the help of garbage boy Linguini, Remy whips up exquisite meals that impress even the nasty chef Skinner and food critic Anton Ego. Together they conquer the kitchen and prove that big dreams can come true no matter how small you are. [Disney]… Expand",
  "critic_reviews": [
    "The subtle colors and textures of the food alone make Ratatouille a three-star Michelin evening.",
    "In Ratatouille, the level of moment-by-moment craftsmanship is a wonder.",
    "This is clearly one of the best of the year's films. Every time an animated film is successful, you have to read all over again about how animation isn't \"just for children\" but \"for the whole family,\" and \"even for adults going on their own.\" No kidding!",
    "That feeling you have as you leave the cinema - that buzzing in the fingers and lightness in the heart - is called joy.",
    "Brad Bird and Pixar recapture the charm and winning imagination of classic Disney animation.",
    "Ratatouille is delicious. In this satisfying, souffle-light tale of a plucky French rodent with a passion for cooking, the master chefs at Pixar have blended all the right ingredients -- abundant verbal and visual wit, genius slapstick timing, a soupcon of Gallic sophistication -- to produce a warm and irresistible concoction that's sure to appeal to everyone's inner Julia Child.",
    "Bird clearly knows the great silent clowns: The slapstick he devises is balletic.",
    "Its sense of humor is more sly, more sophisticated and more interesting than most PG-13 or R-rated comedies at the moment. The film may be animated, and largely taken up with rats, but its pulse is gratifyingly human.",
    "A nearly flawless piece of popular art, as well as one of the most persuasive portraits of an artist ever committed to film. It provides the kind of deep, transporting pleasure, at once simple and sophisticated, that movies at their best have always promised.",
    "Ratatouille is as audacious as they come. It takes risks and goes places other films wouldn't dare, and it ends up putting rival imaginations in the shade.",
    "The characters are irresistible -- why would anyone want to resist a hero who so gallantly transcends his rattiness? -- the animation is astonishing and the film, a fantasy version of a foodie rhapsody, sustains a level of joyous invention that hasn't been seen in family entertainment since \"The Incredibles.\"",
    "If there is a genius working in Hollywood today, it's animation director Brad Bird, who tops the delightful \"The Incredibles\" with arguably the finest 'toon in the Pixar canon, Ratatouille.",
    "Ratatouille is a sublime dish of a movie, and the company's piece de resistance.",
    "The most difficult task in Pixar's 20-year history: to make an un-Mickey-like rodent appealing enough to admire.",
    "Superbly rendered CGI animation.",
    "A gorgeous, wonderfully inventive computer-animated comedy.",
    "The slapstick-comic set pieces involving Remy and Linguini's cooking struggles might solicit the admiration of Buster Keaton and Jacques Tati.",
    "Bird is one of the great modern animators -- as well as an astonishingly gifted filmmaker, period -- precisely because he doesn't set out to wow us.",
    "Ratatouille is a classic.",
    "A film as rich as a sauce béarnaise, as refreshing as a raspberry sorbet.",
    "Bird and his co-writers leave room for quiet moments and gentle morals, but for the most part, they send visual gags and verbal punchlines tearing past at an enjoyably demanding speed, whipping up the film's energy at every turn.",
    "Long for an animated feature and too demanding for very young children, but it's also filled with delights.",
    "Hilarious. And more proof that Pixar is in a class of its own.",
    "Ratatouille is as much a feast for the senses as it is food for thought.",
    "Observed mostly from Remy's rat's-eye view, Gusteau's kitchen is a memorable world-in-miniature with its vivid old-fashioned stoves, bright, brassy pots and general air of frenzied industry; never did sliced red onions or simmering soup look so fresh and real.",
    "Pixar's animation is simply flawless; colorful, deeply realized, and ably conveying both the chaos of the kitchen, and the sensual allure of food well prepared.",
    "What makes Ratatouille such a hilarious and heartfelt wonder is the way Bird contrives to let it sneak up on you.",
    "Like the best French cuisine, Ratatouille is ambitious and delightful.",
    "All the voice work here is excellent, especially Oswalt's. He sounds like Paul Giamatti but with a greater capacity for confidence.",
    "Remy, the little rat who stars in the big, beautiful, funny Ratatouille, isn't gross at all. In fact, he's adorable.",
    "A French rat as a master chef? Absurd. But a brilliant French chef with an American accent? C'est grotesque!",
    "A clever, ingeniously animated film filled with many shining moments.",
    "As was also true of Pixar's last movie, \"Cars,\" Ratatouille is better at pleasing the eye than the other senses.",
    "Stunningly animated, cleverly scripted, and genuinely humorous.",
    "Ratatouille is a blithe concoction, as well as a miraculously textured piece of animated design.",
    "For parents looking to spend time in a theater with their kids or adults who want something lighter and less testosterone-oriented than the usual summer fare, Ratatouille offers a savory main course.",
    "Has the sort of richness and dimension that are the hallmarks of master storytellers at work."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Let me just say that I hate and have no respect for Patton Oswalt whatsoever for reasons I'd rather not discuss. But watching this movie, I could easily forget he's the voice of Remy, becuase I loved everything about this movie. As alwaysLet me just say that I hate and have no respect for Patton Oswalt whatsoever for reasons I'd rather not discuss. But watching this movie, I could easily forget he's the voice of Remy, becuase I loved everything about this movie. As always Pixar, great job!",
      "review_date": "2011-04-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In my opinion, THE greatest animated film of all time, and one of the greatest all-around films of all time. It's perfect.",
      "review_date": "2009-09-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It seems so sad that some of the the fan written reviews written on this site are below the score of a 10. This movie is so appealing to the eye and has such a wonderful story that I do not understand the horrible reviews the fans have been It seems so sad that some of the the fan written reviews written on this site are below the score of a 10. This movie is so appealing to the eye and has such a wonderful story that I do not understand the horrible reviews the fans have been giving it? Are you all just trying to be different because everyone seems to like the movie and you have some kind of problem with an animated pixar film? Suffice it to say, whomever have scored this movie in the yellow or red are officially morons.",
      "review_date": "2007-12-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a Pixar film that really appeals to both children and adults. The beautiful animation, the humor, the look inside a French restaurant kitchen are for the grown-ups. And there's also plenty of silliness and excitement for the This is a Pixar film that really appeals to both children and adults. The beautiful animation, the humor, the look inside a French restaurant kitchen are for the grown-ups. And there's also plenty of silliness and excitement for the kids. And this animated Paris is breathtaking - I wanted to jump right on a plane.",
      "review_date": "2007-07-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie hits an excellent balance of humor and emotion. Remy is a great protagonist, the kitchen staff is fun, and the critic has the single best monologue of any character in any Pixar film. The movie isn't perfect, but it is definitelyThis movie hits an excellent balance of humor and emotion. Remy is a great protagonist, the kitchen staff is fun, and the critic has the single best monologue of any character in any Pixar film. The movie isn't perfect, but it is definitely good enough to earn a 10/10; the slower moments are made up for by the quality of the rest of the film.",
      "review_date": "2016-06-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Out of all 12 Pixar films, Ratatouille has to be the finest if only because it is one of the most visually stunning movies ever made. While other films try to show off the majestic look of Paris (Midnight in Paris, Taken and Monte Carlo) theyOut of all 12 Pixar films, Ratatouille has to be the finest if only because it is one of the most visually stunning movies ever made. While other films try to show off the majestic look of Paris (Midnight in Paris, Taken and Monte Carlo) they never really succeed and its odd that the film that finally pulls it off isn't even live action. If anything Ratatouille is the most grown up of the Pixar fold (even Up) with the story being remarkably layered and engrossing. Sure the beginning is a bit slow but the slow build works because when Remy finally crawls out upon the magnificent vista that is Paris the film takes flight. It is a fast paced story of a rat named Remy (Voiced by Patton Oswald) who has always wanted to be a chef despite his obvious limitations He finally gets that chance thanks to an inept yet lovable human named Linguini (Lou Romano). There are some truly stunning parts of Ratatouille but you I won't ruin them because they really are fantastic. Of course it is a film for both child and adult as every other Pixar film but the thing that holds it up above all the others is the fact that the film builds as it goes. Unlike Up which has a brilliant opening sequence but doesn't live up to it, Ratatouille gets better as it goes with one moment near the end with Peter O'Toole's Ego being a brilliant piece of film despite the fact there are absolutely no words spoken. It is a classic film that gave me lots to think about after I watched it and even more after I watched it again. A real masterpiece.",
      "review_date": "2011-10-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Its very very difficult to get food appetizing in a cartoon and the animators did a great job in this movie. I enjoyed the culture of the film but the overall story was a little too predictable and standard, perhaps the movie needed moreIts very very difficult to get food appetizing in a cartoon and the animators did a great job in this movie. I enjoyed the culture of the film but the overall story was a little too predictable and standard, perhaps the movie needed more laughs. It's not Pixars best but Ratatouille was a fun and worth while animated movie.",
      "review_date": "2011-11-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is the start of a flawless four film streak by Pixar from 2007's Ratatouille to 2010's Toy Story 3. This one is one the especially strong Pixar efforts in terms of Comedy. There's also a pure artistic appeal to the whole film,This movie is the start of a flawless four film streak by Pixar from 2007's Ratatouille to 2010's Toy Story 3. This one is one the especially strong Pixar efforts in terms of Comedy. There's also a pure artistic appeal to the whole film, wether it's the animation itself, the French sets or the whole animated city of Paris, this movie seems like one of the most delicately executed and thought out  films of 2007",
      "review_date": "2011-08-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ratatouille is funny, original, heartfelt, well voice acted and beautifully animated. As Pixar makes more and more movies they make just fantastic films like Ratatouille. I give this film 96%.",
      "review_date": "2012-01-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Another wonderous achivement from Pixar that marks a major return to from after last year's 'Cars' came up short. A rich blend of comedy and pathos. Technically accomplished and visually stunning at times, Another wonderous achivement from Pixar that marks a major return to from after last year's 'Cars' came up short. A rich blend of comedy and pathos. Technically accomplished and visually stunning at times, 'Ratatouille' never forgets it's a story first and foremost. Bird and co. have lavished just as much attention to the script as they did the animation. The very reason Pixar is so far ahead of the pack.",
      "review_date": "2007-06-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The fact that a 3-year-old, a 6-year-old, and three adults can sit for two hours and be mesmerized by this wonderful movie says it all. Each Pixar movie gets better. This one is the best. Nothing was trite, nothing was too hip to keep it The fact that a 3-year-old, a 6-year-old, and three adults can sit for two hours and be mesmerized by this wonderful movie says it all. Each Pixar movie gets better. This one is the best. Nothing was trite, nothing was too hip to keep it from being timeless, and nothing was formulaic other than the mild relationship to \"Ben and Me\". Just when you thought it was over, you say, \"Wait; what about Ego the food critique?\". And so it goes. Animation was magical and spectacular, and the character development was first-rate. I have already reserved a copy for me and for my grandkids from Amazon when its out for distribution.",
      "review_date": "2007-07-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie was a total delight, from start to finish. Unlike most \"children's\" movies, there was no annoying sidekick character playing the buffoon; the humor was wonderful--both kids and adults were hooting all around me; and the art This movie was a total delight, from start to finish. Unlike most \"children's\" movies, there was no annoying sidekick character playing the buffoon; the humor was wonderful--both kids and adults were hooting all around me; and the art of it was unbelievable--scratches on the copper pots, bubbles in the soup, realistic details everywhere. And in Paris, I enjoyed the \"special\" details cleverly tucked into the background--the \"no smoking\" poster in French, the traffic, the Bateaux Mouches, the Notre Dame rose window. I have loved movies my entire life, and this one is clearly in My Favorite Top 10!",
      "review_date": "2007-07-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not an animated film, a great movie. Well written, funny, well directed. This is what movies are all about.",
      "review_date": "2007-07-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "While children will doubtless find this entertaining, there are much deeper issues permeating the latest PIXAR masterpiece. This is a film speaking directly to the adults in the audience while keeping the children occupied. The clumsy While children will doubtless find this entertaining, there are much deeper issues permeating the latest PIXAR masterpiece. This is a film speaking directly to the adults in the audience while keeping the children occupied. The clumsy surface antics and clever dialogue will keep people in stitches while Bird and company tell a story about art, passion, and what drives people to create in the face of adversity. It's about following dreams, heeding the heart, and how perseverance can lead to triumph. Told and presented in a flawless technical skill, through characters and situations only PIXAR could deliver. This is a form of perfection, and do not deny yourself the experience.",
      "review_date": "2007-11-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best Pixar films ever made. Beautiful to behold; it's a masterpiece.",
      "review_date": "2009-08-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very good, but a little too sweet for my liking.",
      "review_date": "2007-11-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "not my favorite movie, but it has great entertainment, great writing, and most of all: great animation.\r Rating: 85%",
      "review_date": "2010-10-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis is one of Pixar's best movies yet. Remy the rat wants to become a chef and his dream comes true when he accidentally ends up in Paris and and discovers a 5-star restaurant.",
      "review_date": "2011-11-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I honestly walked away from this feeling largely indifferent. The plot doesn't do anything unexpected, The characters are typical tropes. TBH, I just didn't care for this movie at all.",
      "review_date": "2021-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Certainly not Pixar's most laughable film to date, Ratatouille features a flawlessly executed concept and story in the world of Paris. In addition to its stunning animated visuals, you'll find above-standard voice acting from talented actorsCertainly not Pixar's most laughable film to date, Ratatouille features a flawlessly executed concept and story in the world of Paris. In addition to its stunning animated visuals, you'll find above-standard voice acting from talented actors such as Ian Holm and Patton Oswalt. Although a little light on food content, I regret having waited this long to see this one.",
      "review_date": "2015-04-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ratatouille has more life, meaning and intelligence then almost every film out there. Pixar has always done a fantastic job of reaching out to children, while drawing adults in and Ratatouille is no exception.",
      "review_date": "2013-04-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Simple and genius in one pot. Good example of flawless quality of Pixar movies. Good for any ages, almost 2 hours of good laugh and relaxing watching guaranteed.",
      "review_date": "2015-08-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Even though it's rated G, this film has such an adult way of playing out and is very sophisticated. It is a melting pot of a movie. You get a little bit of French cooking, the secret ways of how a restaurant operates, you get a feel forEven though it's rated G, this film has such an adult way of playing out and is very sophisticated. It is a melting pot of a movie. You get a little bit of French cooking, the secret ways of how a restaurant operates, you get a feel for 1930's Paris, and most importantly you feel the clique between Linguine and Collette. All of these elements come together in one helluva movie.",
      "review_date": "2013-09-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This one of the reasons pixar is great.They can make anyone or anything lovable. Evan if it is a rat. Remmy is a good black sheep,and every time  I watch this movie it makes me hungry.",
      "review_date": "2015-11-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Does anyone really want to see a film about a rat – you know, one of those promiscuous, verminous beasts who haunt sewers and spread deadly disease – working in a restaurant? On paper, hell no. From Pixar, yes with (dinner) bells on.Does anyone really want to see a film about a rat – you know, one of those promiscuous, verminous beasts who haunt sewers and spread deadly disease – working in a restaurant? On paper, hell no. From Pixar, yes with (dinner) bells on. Ratatouille overcomes any intrinsic ick-factor thanks to the bottomless charm of its teeny rodent hero, Remy (voiced by US comic Patton Oswalt). With its plate-wide eyes, pencil-eraser nose and ability to make the omelette of your dreams, this mini master chef couldn’t be cuter if its name was Nigella. Witness the turning-point scene where hapless gourmet-diner garbage boy Linguini (Lou Romano) quizzes the far-from-home critter (who understands English, but only speaks it with his own species) on his culinary talents: Remy’s adorably coy nods and self-deprecating shrugs prove yet again that Pixar has no peer when it comes to nailing the nuances of expression.\r Yes, Ratatouille thinks small, but with big results. Scripter/director Brad Bird rolls back the sweep of The Incredibles and doesn’t shoot for The Iron Giant’s emotional swell. Instead, he whips up a deceptively frothy soufflé. And, like any great cook, he knows that the trick lies in keeping all the ingredients in delicate balance. So there’s the sweet but not too sickly buddy-buddy relationship (a Pixar staple) between Linguini and Remy, the former becoming the toast of the town as he covertly channels the latter’s flair for French cuisine (via some deft hair-pulling puppetry) into new, delicious dishes. There’s also the obligatory moral (“Anyone can cook”), gently stirred in rather than shoved down the throat. And then we have the meaty chunks of chase action, Remy scampering through the niftily choreographed chaos like a four-pawed Buster Keaton (usually in flight from his Napoleonic nemesis, Ian Holm’s head chef Skinner).\r The pace never gets as overheated as the similarly ratty Flushed Away, though; after all, we are in dreamy Paris, a place-setting Bird lushly romanticises (dewy by day, coruscating by night) without going in-Seine. In fact, he’s not above a sly pop at the locals: “We hate to be rude... but we’re French,” quips Linguini’s tough-cookie love interest Collette (Janeane Garofalo). Ratatouille’s biggest beef, however, is with pernickety hacks, embodied here by poisonous, cadaverous restaurant reviewer Anton Ego (a super-snooty Peter O’Toole). As the film winds down, it fires up a from-the-heart polemic against professional critics. A pre-emptive attack, perhaps, after the mixed notices for last year’s Cars? Retaliation seems unlikely, though; while few will grade this among Pixar’s best (over-generous running time; solid but – O’Toole aside – unexceptional lung-work; one or two belly-laughs short), it’s too sophisticated, zesty and nourishing to be dismissed as fast-food entertainment. Anyone can cook? Not like this.\r Novel in concept, exquisite in execution, another family feast from Pixar suitable for all palates. Not a studio chef d'oeuvre, perhaps, but still the richest of this year's animations. Don't miss the starter course, hilarious space short Lifted.",
      "review_date": "2016-01-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Probably one of the most outlandish ideas as far as the culinary world goes (a rat cooking?!), but this is one beautifully visualized film. I loved the characters, and despite the cliched subplots that wove together to make the film what itProbably one of the most outlandish ideas as far as the culinary world goes (a rat cooking?!), but this is one beautifully visualized film. I loved the characters, and despite the cliched subplots that wove together to make the film what it is (no details without spoilers), it never quite felt unbelievable. Recommended for children and adults alike.",
      "review_date": "2016-05-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ratatouillie's metascore is 96 because I Like this Film because it reaches Universal Acclaim and A lot of People like this Film Yahoo!!!!!!!!!!!!!!!!!",
      "review_date": "2017-03-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is the best animated movie I have ever see, Ideal for kids. Fantastic and fabulous are the only words I can say. Entertainment + Emotions + Inspiration + Soothing Music = Ratatouille Best I've seen so far!",
      "review_date": "2018-03-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My life has been restored. My daughter fell in love with this little ratty boy and was him for Halloween (but the costume was horrifying). Anyways, this movie has it all: food, rats, and accents. I feel whole again to know that there'sMy life has been restored. My daughter fell in love with this little ratty boy and was him for Halloween (but the costume was horrifying). Anyways, this movie has it all: food, rats, and accents. I feel whole again to know that there's actually a good movie out there.",
      "review_date": "2018-03-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nBest Pixar film? Maybe, Best 2007 film? definitely!! Ratatouille is a masterpiece that everyone will love. The characters, the humor, the memorable moments and basically everything in this movie is exellent. A delicious buffet.Note: Sorry for my english, im from Costa Rica.",
      "review_date": "2010-08-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Ratatouille\" is a movie created for only the Westerners and ends up appealing to both western and eastern people.",
      "review_date": "2011-09-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I can't believe this movie got 96 when i feel a sleep because i was so bored. This movie was supposed to be better then all the pirates, transformers, and lord of the rings. NO WAY! 6th best movie ever. Metacritic is unreliable and has I can't believe this movie got 96 when i feel a sleep because i was so bored. This movie was supposed to be better then all the pirates, transformers, and lord of the rings. NO WAY! 6th best movie ever. Metacritic is unreliable and has low movie ratings for all teen movies and good ratings for all adult movies and boring kids movies!",
      "review_date": "2007-09-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Watching it gets me hungry, and it has its  fun moments and great appeal. If you don't like it, thats just shocking then. Because this is the best Pixar film by far",
      "review_date": "2013-07-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \ni cant stand this movie and i couldn't stand it when i was a kid and it made me not want to eat at restaurants for a while after watching itits about a sewer rat and yes the main character is a sewer rat that is obsessed with cooking and is considered the black sheep of his family and ends up working in a restaurant secretly while helping an incompetent chef cookthe ending made the whole movie worst for me it was awful already",
      "review_date": "2021-11-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I really didn't enjoy this film, i'm a bit disappointed actually. I was looking forward to seeing it, I mean, the advert was quite good. But after watching the film I realised that the bits that were in the advert were the only good bits inI really didn't enjoy this film, i'm a bit disappointed actually. I was looking forward to seeing it, I mean, the advert was quite good. But after watching the film I realised that the bits that were in the advert were the only good bits in the film, and that's not that many.",
      "review_date": "2011-10-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Ratatouille\" is a classic Pixar animation and a fantastic accomplishment. The animation is brilliant (as usual), it's well-directed, the script is intelligent and is consistently humorous. Pixar movies are textbook examples on how to make\"Ratatouille\" is a classic Pixar animation and a fantastic accomplishment. The animation is brilliant (as usual), it's well-directed, the script is intelligent and is consistently humorous. Pixar movies are textbook examples on how to make films for both kids and adults.",
      "review_date": "2013-11-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Beautifully animated, poorly written. Some of the most uncomfortable, cliched, awkward script moments ever. The movie seemed to try to go in two different directions and failed to give the audience a sense of completeness. Was it about Beautifully animated, poorly written. Some of the most uncomfortable, cliched, awkward script moments ever. The movie seemed to try to go in two different directions and failed to give the audience a sense of completeness. Was it about Linguini's romantic struggle? Or was it about a rat who could cook? I had to dull out my brain in order to bear some of the inconsistencies in the movie. I am not surprised this movie got high ratings however. These days people will take anything shiny and distracting.",
      "review_date": "2007-07-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is really outstanding! The graphics were excellent, the theme is great, the plot is mesmerizing, the characters were amazing. Everything in this film were fantastic. This is a true masterpiece...",
      "review_date": "2012-01-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Simply One Of The Best Movies Of 2007!\rOne Word For This Movie: Amazing",
      "review_date": "2012-06-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Good ideas. Visually excellent. But not very funny. And worst : Again and again in an US movie about France, the action is in the present, but the Paris you see is like the 60's. Black and white TV, cars of 60's... I was disappointed.",
      "review_date": "2010-06-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is a visual masterpiece, no question about it, but the tremendous work put into it is completely wasted because of the boring and mindless plot. It's about a rat who reads French cookbooks (I assume he can read in countless otherThis film is a visual masterpiece, no question about it, but the tremendous work put into it is completely wasted because of the boring and mindless plot. It's about a rat who reads French cookbooks (I assume he can read in countless other languages  too). The ghost of a deceased chef haunts our cute creature. (How did he stumble upon a rat in the first place?) Remy learns a lot from the chef's recipes, and shares his immense knowledge with a nerd with no talent whatsoever, using him as a puppet, and this bizarre double act self-evidently outdo any well trained cook in Paris.  Moreover, the food critic whose devastating review made the former chef of the restaurant (our strange ghost) commit suicide, is enchanted with the dish based on the recipe of aforementioned chef, but prepared by our nerd who is guided bye the highly literate rat. This goofy mess of a story could still be partly compensated by a decent amount of jokes, but there is hardly any trace of them.  All we left with is the stunning animation.",
      "review_date": "2013-07-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "the best part of this movie is its soundtrack--and it's not even a musical. the score is the only element with range (ooooh and every transition is seamless!), while the characters are underdeveloped and (...wait for it...wait for the best part of this movie is its soundtrack--and it's not even a musical. the score is the only element with range (ooooh and every transition is seamless!), while the characters are underdeveloped and (...wait for it...wait for it...) flavorless--ha!, and the colors are as dazzling as the arc de triomphe in fog. hell, even janeane garofalo manages total insipidity! her covert vocals are wondrous to be sure, but only magnify that Colette (a fair-weather feminist) does nothing to jazz up her wet noodle, Linguini (yukyuk), who in turn gives the evil Ego less than zilch to bounce off of. now, please don't think me hard-hearted. i am a vegan who's been madly in love with three people, angus, matty and pouter--a scotch terrier and two cats. nothing makes me happier than to see animated creatures with personalities, facial tics and accents just as disparate and human as their real-life inspirations. oooooh, inspiration...where's that on the menu?",
      "review_date": "2007-07-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "By far one of the weakest recent animation films. The story is predictable and the script is banal without a hint of cleverness. Great for 10 year olds and Disney sycophants.",
      "review_date": "2011-01-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There are moments in \"Ratatouille\" that works on us in a primal way, like Ego who remembers the titular dish that his mother served him as a child. The pompous critic remembers why he loves food, as this dazzling comedy(you forget There are moments in \"Ratatouille\" that works on us in a primal way, like Ego who remembers the titular dish that his mother served him as a child. The pompous critic remembers why he loves food, as this dazzling comedy(you forget you're watching an animated picture) reminds us why we love the movies. \"Ratatouille\" is so sophisticated, there's an extra tier of sophistication that will fly under the radar of most moviegoers. \"Ratatouille\", to my utter disbelief, has references to the Canadian filmmaker Atom Egoyan and his film \"Felicia's Journey\". Ian Holm, who voices the role of Skinner, the chef in exile, was in Egoyan's \"The Sweet Hereafter\". This is such tremendous fun for cineastes because we can't understand why it's there in the first place. This piece of trivia is irrelevant to enjoying \"Ratatouille\", but the references are there, nevertheless. In an ordinary film, it's Linguini(voiced by Lou Romano) who'd be delusional(that a rat is actually doing the cooking), but in \"Ratatouille\", it's the delusion(from Skinner's point-of-view(he's the first person to see the rat); Skinner, who reminds me of that single person who sees the duck in those Aflac commercials) who has delusions(Chef Gusteau is Remy's muse). \"Ratatouille\" also has references to Carol Emschwiller's novel \"The Mount\" and Gary Larson's \"The Far Side\". And if you remember Ralph Fiennes' wine cellar speech to Embeth Davidtz in \"Schindler's List\", \"Ratatouille\" can be interpreted as a fantastical parable that sutures the rift between Jews and Germans. \"Ratatouille\" is a truly extraordinary movie that makes you laugh, cry, and most importantly, think. This is Pixar's high-water mark, and that's really saying something.",
      "review_date": "2007-12-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A fabulous movie. I took my daughter and was amazed. I love to cook and the film captured the rapture of cooking, paris and well rapture. I loved the visual and musical depictions of Flavour which reminded me of old Canadian National Film A fabulous movie. I took my daughter and was amazed. I love to cook and the film captured the rapture of cooking, paris and well rapture. I loved the visual and musical depictions of Flavour which reminded me of old Canadian National Film Board cartoons. It was a fantastic movie.",
      "review_date": "2007-06-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ridiculously good. I liked it better than both The Incredibles and Cars.",
      "review_date": "2007-06-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "We did not like this movie- visually impressive but should have been a 5-10 minute cartoon.",
      "review_date": "2007-07-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It was miserable, How could it get a 96, it was terrible.",
      "review_date": "2007-08-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie just aint that good. It kinda bored me!",
      "review_date": "2008-06-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "How can u be so stupid (or, poopid) , Metacritic? ra-ta-too-ee should have got like 15% instead of being da 6th best film EVER! I agree with Cameron A. HOW CAN EVERYONE BE SO STUPID?!?!? I'm starting to feel that metacritic is slightly How can u be so stupid (or, poopid) , Metacritic? ra-ta-too-ee should have got like 15% instead of being da 6th best film EVER! I agree with Cameron A. HOW CAN EVERYONE BE SO STUPID?!?!? I'm starting to feel that metacritic is slightly dumb. IDIOT!!!",
      "review_date": "2007-10-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Beautiful to look at but such a big jumbled mess!A huge, unfocused and bloated script with plot twists and devices that a five year old could have written. I am amaed this movie has gotten such high ratings. Biggest gripes? Here goes! 1) I Beautiful to look at but such a big jumbled mess!A huge, unfocused and bloated script with plot twists and devices that a five year old could have written. I am amaed this movie has gotten such high ratings. Biggest gripes? Here goes! 1) I hate it when a movie establishes it's time period and then throws in anachronisms that make your mind go, \"Huh?\" For example, t's set in the '50's so how could Gusteau's be selling microwave dinners? And a major plot point is solved with DNA profiling? 2) The kid - whatever his name was - looks to be all of 10 years old and then we're supposed to a romantic subplot with him and the severe French chick? Kinda felt gross to me. 3) One too many villians. It's as if Pixar was trying to stuff as many evil plot twists into this script as possible and there was no focus. 4) How the rat - whatever his name was - comes to communicate and control the kid's bodily function is entirely ludacriss and makes no sense. I can suspend my disbelief with no problem but this \"human steamshovel\" idea was way too weak. 5) When it comes down to it, no matter how cute you try to make them look seeing hundreds of rats scamper on stage and especially watching them take over the kitchen and cook is more sickening than cute. The audience I saw the movie with was creeped out, the kids were restless for 3/4 of it and many kids were yelling, \"I wanna go home\". Some families left but I like a fool just sat there and said, \"This is the WORST CGI/annimated film in many years! A 95 rating? Folks, look closer and don't be carried away by the phsical beauty of the film. It's very, VERY poorly written!",
      "review_date": "2007-06-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The animation was great. The story, pretty good. The movie is definitely better then 'Cars' where I was bored to tears. This is the third pixar movie in a row, however, where I can't help but looking at my watch and wonder The animation was great. The story, pretty good. The movie is definitely better then 'Cars' where I was bored to tears. This is the third pixar movie in a row, however, where I can't help but looking at my watch and wonder when it will be over. The ending is predictable. I think Pixar needs to worry about becoming too formulaic. Just because Pixar changes from the sea, to the racetrack, now to the French kitchen, does not mean all these moves are incredibly original. In my opinion, they are the same story over and over again. Of course, maybe I was expecting something dramatically different due to the 95! overall score...",
      "review_date": "2007-07-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Sorry but the movie is poor. Certainly I would not recommend this film for kids. Although the scrip is original the movie is predictable and the end is poor",
      "review_date": "2007-08-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Yawn. Advanced technology isn't enough to hold a movie together. This movie lacks true creativity. It's a perfect example of how lame and unimaginative mainstream movie-making has become. And the rave reviews by the critics Yawn. Advanced technology isn't enough to hold a movie together. This movie lacks true creativity. It's a perfect example of how lame and unimaginative mainstream movie-making has become. And the rave reviews by the critics illustrate how they're completely fooled by BIG production that has no soul.",
      "review_date": "2007-08-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I could barely watch the whole thing. Boring, repetitive, completely devoid of humor. Not exactly atrocious in any way, just dull and unfunny.",
      "review_date": "2008-03-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A very mediocre movie and overrated movie. Almost all of it's humour is Jerry-Lewis-esque --- IE strange bodily contortions, (When the chef is throwing his arms around) or funny faces pulled during various scenes. If you like that sort A very mediocre movie and overrated movie. Almost all of it's humour is Jerry-Lewis-esque --- IE strange bodily contortions, (When the chef is throwing his arms around) or funny faces pulled during various scenes. If you like that sort of thing, or indeed if you find Jerry Lewis funny, fine. I found it puerile,and I suspect most adults would. The thing is, it DOES have some truly beautiful imagery -- IE the scenes of paris at night -- and some really nice music. But this is a COMEDY. It's nice to look at and listen to, but as a comedy, it fails. It's just not funny. Not to mention the characters are tired modern stereotypes -- the hopeless, sappy nerdish male, and the confident, successful,powerful female who loves him in spite of himself. For christ's sake, writers, half of your audience is male. Stop alienating us. Bottom line - young children will probably enjoy it. Adults best avoid it.",
      "review_date": "2008-05-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I can't believe this is on the top ten of all time list. Yes the animation is phenomenal but I wouldn't even rate it in the top ten of Pixar releases (including shorts) let alone any best ever list. The storyline and I can't believe this is on the top ten of all time list. Yes the animation is phenomenal but I wouldn't even rate it in the top ten of Pixar releases (including shorts) let alone any best ever list. The storyline and characterisation are very poor and as for humour... was there any? Just average.",
      "review_date": "2008-05-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Quite honestly, I'm amazed and disappointed that this film is rated as highly as it is. Nearly every part of Rattatouille has been recycled from past Pixar films. Sure, the animation looks great... in fact visually, Rattatouille is Quite honestly, I'm amazed and disappointed that this film is rated as highly as it is. Nearly every part of Rattatouille has been recycled from past Pixar films. Sure, the animation looks great... in fact visually, Rattatouille is beautiful. But shouldn't we be interested in telling a story, not showing a tech demo? Or is our society so bland and unintelligent that we find a mouse learning to cook more entertaining than the Lord of the Rings Trilogy?",
      "review_date": "2010-03-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great FX. Lame story. I mean, why do these Pixar films sell so well and get good reviews? This was a clunky who cares type story where the main character was an idiot, and the rat was not much better. I get the point and understand the Great FX. Lame story. I mean, why do these Pixar films sell so well and get good reviews? This was a clunky who cares type story where the main character was an idiot, and the rat was not much better. I get the point and understand the story, just seems like it could have been an after school special made for Disney kids. Just because they spend multi-million dollars on a film and the CGI sets the standard - I just don't get why our culture enjoys a movie about a French cooking rat over movies like Rescue Dawn or other \"real\" heartfelt films that actually take more than the actor coming into the studio for a day to voice over. The new Beowulf is another example of this. All it is is eye candy, and the story and character development seems to be fading with our short attention spans.",
      "review_date": "2007-11-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The name Linguine Alfredo?? Dig a little deeper, please. It's set in Paris not Italy. And although Linguine's character redeems himself slightly in the end, most of the time he's too clumsy to watch or listen to. And the plot The name Linguine Alfredo?? Dig a little deeper, please. It's set in Paris not Italy. And although Linguine's character redeems himself slightly in the end, most of the time he's too clumsy to watch or listen to. And the plot is reminiscent of plenty of animated movies. See Fieval movies and Flushed Away(2006). There is some kind of conspiracy amongst reviewers and animated children's movies. I think they should be in a whole different class. Imagine deciding between \"The Godfather\" and \"Ratatouille\" as the best movie in your library.",
      "review_date": "2007-11-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie proves that Disney/Pixar can't take an original idea, keep it simple, and let it shine. The film that could have been a charming story and a visual treat sinks under the weight of fairy-tale plotting, an unnecessary morality This movie proves that Disney/Pixar can't take an original idea, keep it simple, and let it shine. The film that could have been a charming story and a visual treat sinks under the weight of fairy-tale plotting, an unnecessary morality tale about the strength of family, and worst of all, Disney's archaic racial sterotyping and general xenophobia. For a company that is so constantly hearlded for it's originality, Pixar still hasn't made a film that is free from all of the qualities that make most family entertainment unbearably dull.",
      "review_date": "2007-07-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My wife and I saw this film and simply did NOT understand the high ratings that reviews were giving it. The plot is implausible and breaks its own rules by being logically inconsistent within its own fantasy world. I didn't care about My wife and I saw this film and simply did NOT understand the high ratings that reviews were giving it. The plot is implausible and breaks its own rules by being logically inconsistent within its own fantasy world. I didn't care about the characters. I wanted to walk out after the first 20 minutes but stuck with it. There was a minor pay off at the end that was weak, at best. I felt I had lost 2 hours of my life and this shook my faith in reviewers to the core. With weak characters, shaky plot and broken rules, it was really a terrible film.",
      "review_date": "2007-08-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The animation is perfect as with all Pixar films but unlike The Incredibles or Toy Story the characters are not very strong or in fact very likable. I didn't think that this was as good as some of the earlier Pixar films. This one lacks The animation is perfect as with all Pixar films but unlike The Incredibles or Toy Story the characters are not very strong or in fact very likable. I didn't think that this was as good as some of the earlier Pixar films. This one lacks the visual impact of Finding Nemo or Monsters Inc. If you are a collector I'd wait till this one is a little older and then perhaps you can pick it up for less then its retailing at the moment! In a word I found this one disappointing from Pixar and hope that WALL-E will bring Pixar back to form!",
      "review_date": "2008-02-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "While this was an enjoyable movie experience, it hardly warrants a 96. The plot became too mechanical, the characters were so thin you could cut through them with dull scissors, and my God...I would find much pleasure stomping Remmy into While this was an enjoyable movie experience, it hardly warrants a 96. The plot became too mechanical, the characters were so thin you could cut through them with dull scissors, and my God...I would find much pleasure stomping Remmy into oblivion with a large boot, Although visually, this is an accomplishment. I'll give Pixar kudos for that. But a 96... And if Academy voters actually went and saw Persepolis, we'd all be stomping Remmy into oblivion with our large boots, instead of handing over our dignity in the form of a naked gold statue.",
      "review_date": "2008-03-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I hate this movie.",
      "review_date": "2008-04-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Seeing the critics' rave reviews, I had very high expectations of this film. Suffice it to say I got so bored I had to stop half way through watching it. No laughs for 50' is also not a good sign for a so called animated comedy.Seeing the critics' rave reviews, I had very high expectations of this film. Suffice it to say I got so bored I had to stop half way through watching it. No laughs for 50' is also not a good sign for a so called animated comedy. Everything seemd fake about the characters, including the French accent which is done so poorly.",
      "review_date": "2007-11-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not bad but by the end I was wishing it was over. As overrated as the new Radiohead album 'In Rainbows'.",
      "review_date": "2007-11-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I get it now.. most reviewers here seem to be voting on the Trailer, not the Movie. The Trailer gets a 10.. the concept sounds good and the animation is top notch. The Movie gets a 2.. it is tiresome to watch.",
      "review_date": "2008-06-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I have no idea what people see in this movie. I didn't think it was funny or even heartfelt. The animation is probably the best I've seen, but the story is boring, unfunny, and predictable.",
      "review_date": "2007-12-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Another great computer-animated film for Walt Disney! A different, and more unusual plot compared to typical happy-ending movies. The movie also presented and gave viewers a sense of how dynamic the kitchen in a restaurant is. A littleAnother great computer-animated film for Walt Disney! A different, and more unusual plot compared to typical happy-ending movies. The movie also presented and gave viewers a sense of how dynamic the kitchen in a restaurant is. A little unrealistic, but overall a well done.",
      "review_date": "2012-11-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is certainly up there with some of Pixar's finest work, and its only the second time I've seen it but I enjoyed it much more second time around. Its such a creative concept and whoever thought of a rat cooking was pretty creative :P TheThis is certainly up there with some of Pixar's finest work, and its only the second time I've seen it but I enjoyed it much more second time around. Its such a creative concept and whoever thought of a rat cooking was pretty creative :P The characters are very likable and the clever storyline flows well throughout. There is also enough for both adults and kids to enjoy here and there is a nice medium for the both. Overall a very enjoyable film I would certainly recommend ",
      "review_date": "2013-05-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of Pixar's weakest films. I didn't like it that much. The animated people look ugly. The storyline is okay. The voice acting was fine. I only laughed once. I found Ratatouille pretty boring but it's your choice if you want to watch it or not.",
      "review_date": "2015-02-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ratatouille takes an idea that is pretty vile and turns it into a charming adventure. Remy the rat is one of Pixar's most ambitious creations as him being a rat alone makes him unpopular. But Pixar was able to turn a rat and a stupid guyRatatouille takes an idea that is pretty vile and turns it into a charming adventure. Remy the rat is one of Pixar's most ambitious creations as him being a rat alone makes him unpopular. But Pixar was able to turn a rat and a stupid guy violating many sanitary codes into one of Pixar's best films. The score down to the environments are created with such craft and aesthetic blending. Overall this movie is a fantastic joy there's nothing I can say bad about it.",
      "review_date": "2018-06-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Pixar's latest installment is a recipe of success. Ratatouille is bold and classy with the flare of European culture. Patton Oswalt's adventurous critter spices a flamboyant film with an interesting plot and dynamic delivery.",
      "review_date": "2015-03-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If I had to choose my favorite Pixar filmmaker that isn't John Lasseter, it's definitely going to have to be Brad Bird. He has shown such enthusiasm for the motion pictures, I find it hard not to like him.\r 'Ratatouille' is the secondIf I had to choose my favorite Pixar filmmaker that isn't John Lasseter, it's definitely going to have to be Brad Bird. He has shown such enthusiasm for the motion pictures, I find it hard not to like him.\r 'Ratatouille' is the second Disney-Pixar project directed by him, and to be honest, I had my doubts, for reasons obviously.\r First of all, this movie is released after Pixar's first mediocre (but not terrible) effort 'Cars' (2006), the one Disney-Pixar film nobody raved about, and it fared well with critics and audiences, but it isn't universally loved like 'Toy Story' (1995) or 'Finding Nemo' (2003). Plus, Brad Bird's earlier effort was 'The Incredibles' (2004) which EVERYBODY (including myself) loved and to go from superheroes, to making a movie about a rat who cooks in a kitchen and everybody eats the food seems like a downgrade.\r Yes, you heard right, the premise for this movie is a rat that cooks in a kitchen and everybody eats the food. If you pitched this idea to anyone else, including live-action filmmakers, they would laugh in your face. Ratatouille is an example and a demonstration of how there is no limit to the imagination when it comes to the art form of animation. You could come up with something outrageous or obnoxious, and animation will always be there to make it possible.\r Patton Oswalt voices a rat named Remy, who, with his family, is always looking out for food, you know, like most rats. He discovers one day that food can taste amazing when you combine two different flavors that complement each other.\r He is in France and learns that his favorite chef Gusteau (voiced by Brad Garrett) has passed away and the legacy of his restaurant is owned by an evil chef who cannot be trusted. Remy runs into a young, new employee at the restaurant named Linguini (Lou Romano) and they sort of come to an agreement that Linguini can prove himself to work at the restaurant as long as Remy does the cooking, underneath his hat.\r When Remy starts treating Linguini like some ventriloquist by tugging on his hair, this leads to some funny sequences where he often trips and moves with such flexibility thanks to the art form of animation.\r Peter O'Toole voices the fearsome food critic Anton Ego, who can get Gusteau's restaurant shut down if he criticizes the next dish and gives it a bad name.\r Obviously Remy's family of dirty rats isn't happy with what he's doing so far, his father is unsure and uncomfortable about him working with humans due to the fact that we can kill rats since they're small creatures we can easily stamp on. Remy's brother Emile (Peter Sohn) is a very funny comic relief for the movie the same way Dory was for 'Finding Nemo' (2003).\r 'Ratatouille' is easily one of the best films of 2007, and that's saying something. It's funny because this movie left me craving for a sequel, which I will accept will probably never get made, but if it does, I'm hopping into the front seat.\r For a movie that's about a rat who cooks in a kitchen and everybody eats the food, I did find it to be more intelligent than...say 'Transformers'? But that's just me.\r Brad Bird really is a gift at Disney-Pixar.",
      "review_date": "2015-03-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Delicious and entertaining, Pixar writer Brad Bird reaches the height of his La Vie en Rose career, with a beautiful masterpiece of the self-discovery of the unexpected talent within non-humans especially in the hands of a lone rat, whoseDelicious and entertaining, Pixar writer Brad Bird reaches the height of his La Vie en Rose career, with a beautiful masterpiece of the self-discovery of the unexpected talent within non-humans especially in the hands of a lone rat, whose only hope for survival is becoming a chef in one of Paris' most critically acclaimed restaurants, despite the odds and intolerance.\r Its a sweet film thats like champagne bottles flowing simultaneously into the atmosphere and the smell of grapes in the air.",
      "review_date": "2015-04-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Describe the plot of Ratatouille to most and they’ll likely turn up their nose as if assaulted by a bad smell. It’s about a rat who yearns to be a chef. That’s not cute, that’s not flip and postmodern. Couldn’t we make it a giraffe who wantsDescribe the plot of Ratatouille to most and they’ll likely turn up their nose as if assaulted by a bad smell. It’s about a rat who yearns to be a chef. That’s not cute, that’s not flip and postmodern. Couldn’t we make it a giraffe who wants to play golf, or a hippo who dreams of being a stunt-hippo, or a gerbil who aspires to play lead guitar in a heavy-metal band (please note, second-tier animation studios - these concepts are copyright Empire)? What’s cool about a rat in a kitchen? Isn’t it, like, kinda gross?\r Au contraire, mes amis. After five minutes of Ratatouille you start getting excited about the time when you can buy it on DVD to use as life therapy, like a soothing bath or a dose of Librium. It may be Pixar’s masterpiece, but why quibble over niceties when they keep delivering stories this rich?\r Even amongst the Hawaiian-shirted big brains of the Pixar think-tank, Brad Bird is taking on an auteurish hue for the fabulousness of his creations.\r It’s farce and poetry both, able to make thrilling gearshifts from poignant characterisation into madcap as the film spills onto the streets to create chase sequences worthy of Chuck Jones or Fred Quimby. Visually, nothing is beyond these guys. From the fineness of Remy’s fur to the rain-slicked cobbles of the City Of Lights, they somehow grant synthesised surfaces the textures of life. Yet, the animation is at once extraordinary and hardly the point. So deft is the hand of Pixar that you are allowed to take their raptures of detail for granted - the incidental art is slave to the story. Pixar are not really animators at all, but storytellers par excellence whose carving knife happens to be a computer mouse.\r By the third act, the standard recipe would be for Linguini to be de-toqued, the diminutive hero exposed and the villainous Skinner to be felled. That, though, is just one of the plot strands Bird has woven. Amid the flurry of impeccably timed disaster, Anton Ego will emerge from his coffin-shaped parlour to test this unforeseen turn-around at Gusteau’s and prove a salutary lesson for any critic as to their own worth. “Surprise me,” he sneers to the waiter, with the kind of disdain normally associated with Lady Bracknell or Daily Mail readers. So fully have you sunk into this animated world, so blurred are its joins with real life, that the resulting dish (designed with the help of hip chef Thomas Keller) lifts the film to rank alongside Babette’s Feast, Big Night or Ang Lee’s Taiwanese trilogy as literally mouth-watering. Although it rather takes the Happy Meal\rtie-in off the agenda.\r It is impossible not to read Remy as a straight metaphor for Bird or Pixar as a whole. They are unable to let the soup sour when the perfect mix of flavours can be reached. But the message may be more democratic - not everyone can be a great artist, but true art can come from anywhere. Bird is an artist who looks deep into humans (even in rat form) and sees something magic. His films feel like gifts.\r That feeling you have as you leave the cinema - that buzzing in the fingers and lightness in the heart - is called joy.",
      "review_date": "2015-04-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "“Ratatouille” is delicious. In this satisfying, souffle-light tale of a plucky French rodent with a passion for cooking, the master chefs at Pixar have blended all the right ingredients — abundant verbal and visual wit, genius slapstick“Ratatouille” is delicious. In this satisfying, souffle-light tale of a plucky French rodent with a passion for cooking, the master chefs at Pixar have blended all the right ingredients — abundant verbal and visual wit, genius slapstick timing, a soupcon of Gallic sophistication — to produce a warm and irresistible concoction that’s sure to appeal to everyone’s inner Julia Child. Though the latest crowd-pleaser from “The Incredibles” writer-director Brad Bird arguably reps a harder sell than earlier Disney/Pixar toon outings, the combo of critical excitement, energetic word of mouth and shrewd marketing should make this family-friendly feast a gastronomical success worldwide.\r After the less than universally admired “Cars,” Pixar’s eighth feature sees the Disney-owned toon studio in very fine form, and confirms Bird’s reputation as one of the medium’s most engaging storytellers. Compared to his woefully underseen “The Iron Giant” and Oscar-winning “The Incredibles,” “Ratatouille” may be smaller in scope, but in telling the story of a very smart rat striving to enter the very human world of French haute cuisine, it shares with its predecessors an affinity for gifted outsiders seeking personal fulfillment.\r Pic also extends two of the great themes of “The Incredibles”: the pursuit of excellence over mediocrity (a standard that has long distinguished Pixar from rivals and imitators) and the importance — or rather, the unavoidability — of family ties. Remy, a thin blue rat who lives with his unruly rodent clan in the French countryside, finds himself torn between these two commitments as the film opens.\r Blessed with unusually sharp senses, Remy (voiced by comedian Patton Oswalt) is educated, cultured and mad about creating his own culinary master-pieces — the complete opposite of his tubby, good-natured brother Emile (Peter Sohn) and gruff dad Django (Brian Dennehy), who are content to wallow in trash and disapprove of Remy’s all-too-human higher ambitions.\r After an unfortunate cooking mishap, the rats are evicted from their rural nest and forced to escape through the sewers — where, in the first of many nim-bly orchestrated action sequences, Remy is separated from his family. He winds up in Paris, near a restaurant once presided over by the legendary chef Auguste Gusteau, whose populist motto (“Anyone can cook!”) rings in Remy’s ears as he spies longingly on the bustling kitchen activity.\r One busy evening, Remy can’t resist sneaking in and spicing up a vat of soup; credit for the delicious dish goes to the poor garbage boy, Linguini (Lou Romano), a clumsy, stammering type with no talent for cooking, who is immediately ordered by conniving head chef Skinner (Ian Holm) to reproduce his success.\r While man and mouse experience difficulty communicating at first, they ultimately agree to team up, a la “Cyrano de Bergerac”: Linguini can keep his job, and Remy can slice and dice to his heart’s content. The result is a classic odd-couple comedy in which Linguini and his “little chef” must learn to work together, avoid discovery and, inevitably, deal with the internal and external pressures that threaten their unlikely partnership.\r Among those threats are the kitchen’s lone female, Colette (a tough-talking but tender Janeane Garofalo), whom Linguini inevitably falls for; the up-to-no-good Skinner, who’s both suspicious and jealous of Linguini’s success; and an uber-acerbic restaurant critic, aptly named Anton Ego (a sneering Peter O’Toole), who once ruined Gusteau’s reputation.\r Premise was originally conceived by Jan Pinkava (who left Pixar before the project’s completion but is credited here as a co-director) before Bird took over the reins — a transition that may explain why some of the secondary characters and subplots feel a tad rote, particular in the more manic later stretches, though the overall execution is never less than involving.\r But “Ratatouille” is at its finest in the kitchen, as Remy learns to whip up sauces and sweetbreads while directing Linguini’s movements from beneath the latter’s cap. The joy of artistic creation is both palpable and infectious, and Bird and his supremely inventive team of animators and designers respond in kind — giving viewers a glimpse of mouth-wateringly realistic cuisine one moment, dazzling them with some delightfully Keaton-esque slapstick the next.\r Wide-ranging score by Michael Giacchino (“The Incredibles”) stays perfectly in sync with the action, encompassing string- and accordion-based Gallic overtones as well as a light percussion that suggests the scampering of rat paws.\r Pic is preceded by an amusing Gary Rydstrom-directed short, “Lifted,” which cheekily imagines a driver’s ed lesson aboard a UFO.",
      "review_date": "2016-03-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is one of Pixar's best movies, and arguably the one with the biggest heart. I find it to be thoroughly enjoyable and near flawless in execution. The only reason I give it a 9, is because there are two other Pixar movies I love even more!This is one of Pixar's best movies, and arguably the one with the biggest heart. I find it to be thoroughly enjoyable and near flawless in execution. The only reason I give it a 9, is because there are two other Pixar movies I love even more! Gotta leave some headroom in my reviewing scores for them!",
      "review_date": "2016-05-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A really good animated movie. Not just for kids only, but for adults too. It has humour, life lessons, interesting plot and everything else you need in an animated movie.",
      "review_date": "2017-06-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ratatouille arrives , another masterpiece from Pixar , which I managed to give the pinch of family entertainment , the highlight of the summer 2008. contemporizes the sweet taste of victory in a great work of Pixar , and which couando alwaysRatatouille arrives , another masterpiece from Pixar , which I managed to give the pinch of family entertainment , the highlight of the summer 2008. contemporizes the sweet taste of victory in a great work of Pixar , and which couando always take new ideas, always they come out better than ever , in fact this dish was exquisite.",
      "review_date": "2015-12-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Just fantastic super entertaining and funny this is the third time I've watched it since you thousand seven and it just is good every time extremely well done",
      "review_date": "2016-11-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Appealing as ever, Ratatouille developed once again another great Pixar film that's considered both the best film of 2007 and the best animated film of 2007.",
      "review_date": "2016-01-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "WHAT I LIKED: Brad Bird directs the characters well, and the animation is great\rWHAT I DIDN'T LIKE: 'Ratatouille' actually offers very little in terms of plot, pace, excitement or interesting dialogue to keep children or adults entertainedWHAT I LIKED: Brad Bird directs the characters well, and the animation is great\rWHAT I DIDN'T LIKE: 'Ratatouille' actually offers very little in terms of plot, pace, excitement or interesting dialogue to keep children or adults entertained\rVERDICT: It's commended for it's character, but what really lets it down is the lack of ingredients to make you excited.",
      "review_date": "2016-01-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Describe the plot of Ratatouille to most and they’ll likely turn up their nose as if assaulted by a bad smell. It’s about a rat who yearns to be a chef. That’s not cute, that’s not flip and postmodern. Couldn’t we make it a giraffe who wantsDescribe the plot of Ratatouille to most and they’ll likely turn up their nose as if assaulted by a bad smell. It’s about a rat who yearns to be a chef. That’s not cute, that’s not flip and postmodern. Couldn’t we make it a giraffe who wants to play golf, or a hippo who dreams of being a stunt-hippo, or a gerbil who aspires to play lead guitar in a heavy-metal band (please note, second-tier animation studios - these concepts are copyright Empire)? What’s cool about a rat in a kitchen? Isn’t it, like, kinda gross?\r Au contraire, mes amis. After five minutes of Ratatouille you start getting excited about the time when you can buy it on DVD to use as life therapy, like a soothing bath or a dose of Librium. It may be Pixar’s masterpiece, but why quibble over niceties when they keep delivering stories this rich?\r Even amongst the Hawaiian-shirted big brains of the Pixar think-tank, Brad Bird is taking on an auteurish hue for the fabulousness of his creations (The Incredibles being the last).\r He remains intent on interpreting the foibles and grace notes of the species to which he belongs, even if it is through the medium of a rat. His latest quest is to decipher the soul of an artist who rises from the lowliest place: quite literally the sewer. Remy, not content to eat garbage like his brothers, has the very un-rat-like urge to soothe his palate with extraordinary tastes. He is a gourmand and, having spied the cooking programmes of famed but recently deceased Parisian chef Auguste Gusteau (Brad Garrett), is now entranced with the idea of creating transcendent meals that mix flavours like the giddy riffs of jazz. Gusteau is of the opinion\rthat “anyone can cook”. And a rat is listening.\r To Remy, humans are an inspiration (“They taste...” he marvels. “They discover...”). To humans, Remy is vermin. A complicated state of affairs, especially when fate washes the talented rat into Paris, right next door to the late Gusteau’s classy eatery, currently suffering a downturn in fortune. Vulpine food critic Anton Ego (a character designed with Peter O’Toole’s Gothic tonsils fully in mind)\rhas been less than favourable, but Remy is drawn to the bustling kitchen like a pilgrim to the Holy Land.\r Impeding his nascent greatness, apart from being a rat, are Gallicly tempered and vertically restricted head chef Skinner (Sir Ian Holm), and Remy’s sceptical rat-father (Brian Dennehy), who is determined he pursue more rat-like endeavours (like eating garbage). But as Brad Bird has it, art will out. Remy is slave to his own genius.\r Scampering fretfully among the whirling ladles, carving knives and angry spurts from the gas burners, his delicate nose sniffs out the insulting scent of compromised soup and he can’t help but risk life and paw to remedy the dish. To leave it would be a sin against his soul.\r The answer to his troubles is to go undercover, or under-toque, in cahoots with the supremely untalented new garbage boy Linguini (Lou Romano). This presents Bird and his animators with an awkward challenge - how does their world actually work? Their answer is anthropomorphic sleight-of-hand. Remy doesn’t talk: well, he does, but only in rattish, and it just so happens that we’re fluent. Linguini, his partner, doesn’t. All this bumbling fool can make out are the tinny squeaks of rat-kind. To confer the rat-chef’s talents to his goofy human sidekick, Bird goes one fictional step further, making Remy capable of operating a human being by tugging his hair follicles like puppet strings. The animated are now doing the animating.\r It’s an inspired concept, transforming the cooking sequences into astonishingly animated slapstick homages to Mack Sennett, Buster Keaton and, in keeping with the French setting, herky-jerky French farceur Jacques Tati (a kind of proto-Bean), as Linguini is manipulated to concoct paradise in dish form.\r Visually, nothing is beyond these guys. From the fineness of Remy’s fur to the rain-slicked cobbles of the City Of Lights, they somehow grant synthesised surfaces the textures of life. Yet, the animation is at once extraordinary and hardly the point. So deft is the hand of Pixar that you are allowed to take their raptures of detail for granted - the incidental art is slave to the story. Pixar are not  really animators at all, but storytellers par excellence whose carving knife happens to be a computer mouse.\r It is impossible not to read Remy as a straight metaphor for Bird or Pixar as a whole. They are unable to let the soup sour when the perfect mix of flavours can be reached. But the message may be more democratic - not everyone can be a great artist, but true art can come from anywhere. Bird is an artist who looks deep into humans (even in rat form) and sees something magic. His films feel like gifts.\r That feeling you have as you leave the cinema - that buzzing in the fingers and lightness in the heart - is called joy.",
      "review_date": "2016-01-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Once  again disney pixar does it again with us this time following a rat named remey who just wants to be a chef. This movie, like most pixar movies delivers a strong story.",
      "review_date": "2016-07-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I love this film, best animated film I've ever seen. Pulls at the heart strings and can make you cry even when it's not at it's saddest. They need to make more films like this.",
      "review_date": "2016-03-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ratatouille brings a familiar message, with unforgettable characters, inventive and \"delicious\" story-telling, full of fun, enjoyable contents and inventive plot, despite the simple animation. Here's another Pixar classic that no one willRatatouille brings a familiar message, with unforgettable characters, inventive and \"delicious\" story-telling, full of fun, enjoyable contents and inventive plot, despite the simple animation. Here's another Pixar classic that no one will forget. Enjoy!!",
      "review_date": "2016-03-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I absolutely love this movie . i love how it teaches everyone cleanliness when it comes to cooking is very important , i also love how it teaches people to never give up on your dreams and passions . i love cooking so i connect on that levelI absolutely love this movie . i love how it teaches everyone cleanliness when it comes to cooking is very important , i also love how it teaches people to never give up on your dreams and passions . i love cooking so i connect on that level . i also find it amusing that rats are associated with disease , filth and disgusting features and lifestyle.",
      "review_date": "2016-03-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "On all accounts a good movie, but it is harshly overrated. It is a decent Disney movie, but not that great. Not extremely heartwarming.",
      "review_date": "2018-06-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "¿Can everyone cook? Of course. ¿Is cooking like composing a symphony? Naturally. This is the history of a rat with highly senses that, inspired by its idol, wants to develop a soul kitchen. This pixar big shot is a king own feast. Guten appetit.",
      "review_date": "2020-06-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Easy to understand, and makes a good shape of camerawork to be all shaky and still, suits as 2:35:1. Also an intelligent but kind of strange when you don't mention the animation.",
      "review_date": "2016-11-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "9/10. One thing I hate about Metacritic is that you need to make a review of something in order for it to be seen in your list. THAT IS SO DUMB! Metacritic fix your **** Take notes from MyAnimeList.",
      "review_date": "2019-11-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ratatouille presents a story about what it means to be an artist, and about the motivations that can take and artist to truly great heights, but it is also about how we are all artists in a way, and such a deep theme can only be made justiceRatatouille presents a story about what it means to be an artist, and about the motivations that can take and artist to truly great heights, but it is also about how we are all artists in a way, and such a deep theme can only be made justice when you have the type of animation and colors that Pixar offers you here. Just the colors and designs of the food are incredibly well done, and add that to charming characters that leave you both laughing out loud, but cheering and whooping for them, and that is a testament to Pixar's genius. Anybody can make movies and be an artist, but it is up to every individual critic to recognize them, and Pixar shows once again that they are of the highest class time and time again. Simply and excellent show, and a most see recommendation for anyone that appreciates good film. Final Verdict: 8.9 PS: Special mention to Peter O'Toole, whose character definitely steals the show. Great Job!",
      "review_date": "2017-07-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The animation (especially in the kitchen and with the various liquids and cuisine) is truly impressive and ingenious, and the screenplay is very charming, original, and heartfelt.",
      "review_date": "2017-02-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Seen at Luz Saint-Sauveur the French Disney of the year. To see and see again simply by the fact that changing your mind does not always mean \"going back\" (the memory of a ratatouille that brings back childhood for the \"critic\") sometimes itSeen at Luz Saint-Sauveur the French Disney of the year. To see and see again simply by the fact that changing your mind does not always mean \"going back\" (the memory of a ratatouille that brings back childhood for the \"critic\") sometimes it also makes progress (today it's no longer the same person who makes it, but is it really a person?) To be hard or simply a demolisher is worth it when we can all succeed smoothly? If your dream is to become a cook then do it and it does not matter your dream .. Magical and Beautiful!Vu à Luz Saint-Sauveur le Disney français de l'année. À voir et revoir simplement par le fait que changer d'avis ne veut pas toujours dire \"retourner en arrière\" ( le souvenir d'une ratatouille qui fait revenir en enfance pour le \"critique\") parfois cela fait aussi avancer (aujourd'hui ce n'est plus la même personne qui la confectionne, mais est-ce réellement une personne ?) Être dur ou simplement un démolisseur vaut-il le coup quand on peut tous réussir en douceur ? Si ton rêve est de devenir cuisinier alors fait le et ce peux importe ton rêve.. Magique et Magnifique !",
      "review_date": "2019-10-27",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 137,
  "genres": [
    "Fantasy",
    "Comedy",
    "Animation",
    "Family"
  ]
}