{
  "title": "Stardust",
  "rating": 8.5,
  "release_date": "2007-08-10",
  "summary": "The enchanting tale of a fallen star who crashes into a magical kingdom and turns out to be no ordinary meteorite at all, but a beautiful, imperiled woman chased after by an incredible array of seekers who want or need her secret powers. From wicked witches to power-mad princes, from flying pirates to dueling goblins, each person whoThe enchanting tale of a fallen star who crashes into a magical kingdom and turns out to be no ordinary meteorite at all, but a beautiful, imperiled woman chased after by an incredible array of seekers who want or need her secret powers. From wicked witches to power-mad princes, from flying pirates to dueling goblins, each person who encounters the star has his or her own agenda, but they all desire just one thing: her heart. (Paramount Pictures)… Expand",
  "critic_reviews": [
    "Imaginative and intricate, but it's also joyfully casual, maybe to the point of being a little messy in places. But even its flaws work in its favor.",
    "Floating in on an airy breeze of dreams and true love, the lively adventure-romance Stardust offers that elusive quality summer movies are supposed to possess but rarely do -- total escape.",
    "While it won't rival the Harry Potter movies as a cultural milestone, the luminous, irresistible Stardust is no less industrious at scavenging myths and legends and making something altogether new from the familiar pickings.",
    "If you have an ounce of romance in you, you'll sense your own inner Captain Blood emerge when Captain Shakespeare turns him into a dashing figure with a dangerous sword.",
    "Danes doesn't quite fit into the mindscape – she's too bland for a human star – but Cox comes of age quite convincingly, De Niro is a hoot, as is Ricky Gervais as a slimy tradesman. Pfeiffer has a field day.",
    "Stardust lights up the screen with a splendid tale of heroism and romance.",
    "Unlike \"Pirates,\" Stardust is anything but a wretched mess. It's a charming and smartly plotted fantasy.",
    "For audiences tired of summer sequels that grind through the familiar motions, Stardust provides a dizzying antidote.",
    "The film's merry, enthusiastic tone--set largely by Robert De Niro, playing a giddy transvestite sky-pirate to the hilt--is hard to beat.",
    "Perhaps the most surprising thing about Stardust is that its most winning element is neither its delightful story nor its special effects but its sly sense of humor.",
    "There's less whimsy to be found here than in \"The Princess Bride,\" but the film is likely to appeal to the same group of older children and adults that appreciated Rob Reiner's classic.",
    "It's the closest the movies have come in a while to the nudgy, knowing fairy-tale enchantment of \"The Princess Bride.\"",
    "Its sensibility stays true to Gaiman's style: heroic, wryly funny, but bloodthirsty as great fairy tales can often be.",
    "Stardust is an eye-poppingly elaborate fantasy that's shot through with action-movie adrenaline and attitude.",
    "Delivers on the action front, laughs, and some great visual splendor. The only real problem with this film is the running time.",
    "Diverting and pleasurable to watch, Stardust, a tongue-in-cheek sword-and-sorcerers romp bolstered by a top-flight cast, is most adroit when it plays the fantasy straight rather than sending up the genre.",
    "Sprinkled with tongue-in-cheek humor, fairly adult jokes and some well-known faces acting very silly, this adventure story should have particular appeal to fans of \"The Princess Bride,\" but in any event will never be mistaken for a strictly-for-kids movie.",
    "Stardust has it all: sweetness, magic, lusty wenches, evil witches, tankards of mead, a gay pirate.",
    "Michelle Pfeiffer is Lamia, as deliciously evil a witch as the movies have ever invented.",
    "Immensely winning and visually arresting adaptation of Gaiman's 1998 fantasy.",
    "Stardust in a nutshell: hardly great shakes, but better and more satisfying than it first seems.",
    "an overstuffed, overlong epic with a tongue-in-cheek approach.",
    "Brings too much of EVERYTHING to the table: It's the cinema equivalent of a long, winding, run-on sentence.",
    "It's a film you enjoy in pieces, but the jigsaw never gets solved.",
    "Thank goodness for Pfeiffer's Lamia, a harridan who's lived long enough to get the face she deserves and will do anything to hide it. She's a wicked delight.",
    "It’s puffed up in obvious ways but disarmingly puckish in others. As that capering pirate, De Niro is god-awful--yet his gung-ho spirit wins him Brownie points.",
    "I'm a sucker for fantasies, but this one is so undistinguished and arbitrary that it left few traces in my consciousness, apart from the impression that the filmmakers resort to cruelty whenever they run out of ideas, which is often.",
    "Aims for a \"Princess Bride\" mix of whimsy and wonderment, the sardonic and the romantic, with only sporadic success. Both visually and narratively cluttered, the film diverts more than it enchants.",
    "This is just a silly movie about silly things starring famous people acting all silly.",
    "Stardust has lost a good amount of its magic in the transformation from page to screen. It's the cinematic equivalent of getting a punch in the mind's eye by a bunch of faeries wearing the coolest Doc Martens this side of Florin.",
    "It's the big stuff that doesn't really work, at least well enough to be called special.",
    "Ponderously plotted, poorly cast, visually undistinguished and devoid of any real verve or charm.",
    "Stardust certainly could have gone somewhere fun. But the magic and zip you need to get a blimp like this off the ground is scarce."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Favorite movie by far. There is a twist around every corner that makes you laugh or move to the edge of you seat. The kind of movie you could watch over, and over, and over.",
      "review_date": "2010-10-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What a treat! I walked into the theater expecting to see one of the worst movies of all time, but I was delighted to find that the movie was filled with stars who portrayed their roles perfectly, a wonderfully original, comical andWhat a treat! I walked into the theater expecting to see one of the worst movies of all time, but I was delighted to find that the movie was filled with stars who portrayed their roles perfectly, a wonderfully original, comical and surprisingly cohesive story.\r The story is an interesting mixture of the Chronicles of Narnia, The Lord of the Rings, Harry Potter, and Titanic, but it all comes together quite well to tell an adorable tale of adventure and love with a perfectly simple yet tear-jerking ending.\r The acting was marvelous. Michelle Pfeiffer and Robert De Niro were especially fun to watch, but every character shines at one point or another.\r I'm still a little confused because it was so perfectly random and unexpected, but it's one of the first movies I've seen in a long time where I haven't noticed or cared about the length. It's a legitimately fun move to watch and well worth seeing.",
      "review_date": "2010-08-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best fantasy movie I've ever seen. Real fairy-tale with perfect music, characters and fascinating plot. You'll never regret watching this movie. 66 critics score is a  it's a 1010 movie.",
      "review_date": "2013-08-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My wife and I both loved this movie. What a fun fantasy romance.",
      "review_date": "2007-09-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wonderfully entertaining, with a surprise turn by De Nero that had me rolling with laughter.",
      "review_date": "2008-04-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "My children, my wife and I all loved it! \"PRINCESS BRIDE\" is a family favorite. Now we have another movie we can all watch over and over again and love it every time. PURE MAGIC!",
      "review_date": "2008-01-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Anyone who loves magical, romantic, mystical movies should see this. This was well written and had an amazing cast. I originally rented it, but am now definately going to buy it.",
      "review_date": "2007-12-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great movie. I knew nothing about it going in to watch it. I didn't remember seeing any previews for it which is sad because a lot of people will miss seeing this fantastic movie. One of the best movies of its type in many years.",
      "review_date": "2007-09-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Magical and romantic.",
      "review_date": "2007-09-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A light, but fun filled fantasy. Worth seeing at some point.",
      "review_date": "2007-08-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A lot of fun. I took my adult daughter who is a major Neil Gaiman fan, she rated it above \"The Princess Bride\". Michelle Pfieffer is a great evil witch. Much of it is derivative ( a nice way of saying stolen). I guess I have seen too many A lot of fun. I took my adult daughter who is a major Neil Gaiman fan, she rated it above \"The Princess Bride\". Michelle Pfieffer is a great evil witch. Much of it is derivative ( a nice way of saying stolen). I guess I have seen too many movies and read to much to not footnote everything.",
      "review_date": "2007-08-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It will be years before another fantasy as good as this one comes to the screen. Karger with Roeper said the plot is \"nearly impossible to describe\" and I agree. So that's a plus in my book. A truly good fantasy/magic movie has to be It will be years before another fantasy as good as this one comes to the screen. Karger with Roeper said the plot is \"nearly impossible to describe\" and I agree. So that's a plus in my book. A truly good fantasy/magic movie has to be seen to be understood. Some comparison to the classic Princess Bride was made, and that's fair. Beats Harry Potter on several fronts, IMO. It also comes out as one of the best \"happy ending\" and \"feel good\" movies of the year. I suppose some folks can't relax, suspend judgment and just go with the fantasy and enjoy it but if the there's still a little kid inside you - MUST SEE.",
      "review_date": "2007-08-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An awesome film that makes you smile all the way through.",
      "review_date": "2008-03-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the most fantastic movies I have seen in the last five years.",
      "review_date": "2008-08-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Fantastic movie. The ideal setting to watch it would be with your girlfriend in an open air cinema, but even if you are solo in your parents basement its still a great film!",
      "review_date": "2009-04-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Excellent movie throughout, filled with tiny things which complete a perfect film",
      "review_date": "2008-11-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is lovely to look at, with lavish costumes and beautiful sets. The music is lovely too, with the beautiful Take That song over the end credits, and Ian McKellan lent his wonderfully distinguished voice to the narrator. MichelleThis film is lovely to look at, with lavish costumes and beautiful sets. The music is lovely too, with the beautiful Take That song over the end credits, and Ian McKellan lent his wonderfully distinguished voice to the narrator. Michelle Pfeiffer also is very good as Lamia, and Claire Danes is perfectly tolerable as the \"star\". I will say though that Charlie Cox was not entirely convincing at times as the hero, and the film is overlong. However, there are plenty of things to recommend it, particularly a chance to see Robert DeNiro in drag doing the can can. The direction, while not the best direction in existence, is competent, and does give some thrills here and there, like the princes who decide to kill each other. The script is quite witty, a little underdeveloped at times, but not that bad at all. In conclusion, an enjoyable film, not the best I've ever seen, but well worth watching. 8/10 Bethany Cox.",
      "review_date": "2022-04-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Magic, romance, hero, what can we expecting more from a movie like this one.",
      "review_date": "2008-01-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a real misfire. The script definately needed to be tightened, as the story just rambles along, and feels like the filmmakers are just throwing in anything that pops into their heads to fill time, until the climax. Danes and male lead This is a real misfire. The script definately needed to be tightened, as the story just rambles along, and feels like the filmmakers are just throwing in anything that pops into their heads to fill time, until the climax. Danes and male lead are both bland, do little more then smile at each other as they walk through movie, and have no chemistry together. The male lead actually has a lot more chemistry with Sienna Miller than with Claire Danes, and thus you'd rather have him wind up with Danes. Consider that Danes is a star that fell to earth, no imagination went into her character, that makes her seem anything else but your standard helpless movie heroine, in need of rescuing. I was a big fan of all the Lord of the ring movies, all the Pirates of the Caribbean movies, and also a big fan of \"The princess bride\", \"Ladyhawke\", and \"Willow\". I was really disappointed by this one.",
      "review_date": "2007-09-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Yikes, this is really bad. Discerning viewers, don't trust the meta-scores on this one folks.",
      "review_date": "2008-01-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Put Pirates of the Caribbean, Harry Potter, Lord of the Rings and Basic Instinct together and mix it with 2 stars and lots of trumpets and horns and one should be able to get at least a decent movie, one thinks. Instead this movie is a real Put Pirates of the Caribbean, Harry Potter, Lord of the Rings and Basic Instinct together and mix it with 2 stars and lots of trumpets and horns and one should be able to get at least a decent movie, one thinks. Instead this movie is a real waste of time! Too bad for what could have been nice, really nice; if the director only would have had some individual personality.",
      "review_date": "2007-11-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you want to see a good fantasy film go see Narnia or Bridge to Tarabithia.Both are excellent. This film is not in the same league-not even close. The story is unnecessarily long. The entire segment with Deniro is unnecessary, and why did If you want to see a good fantasy film go see Narnia or Bridge to Tarabithia.Both are excellent. This film is not in the same league-not even close. The story is unnecessarily long. The entire segment with Deniro is unnecessary, and why did he do this film anyway? Not Since Rocky and Bulwinkle has he laid such a egg!! The soundtrack wasn't memorable and it was way to loud , but that's the least of the weak points in this film. Bill C.",
      "review_date": "2007-08-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Entertaining movie but a little to sappy. yeah yeah love conquers all blah blah. De Niro's character adds much needed humor. The plot twist was very weak. This is a rental movie, watchable but don't waste your money on the theatres.",
      "review_date": "2007-08-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "They need to start including Aaron Mesh's reviews.",
      "review_date": "2007-08-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "After reading all of the great reviews, I was expecting this to be really good. It wasn't. It's way too long. The story is convoluted and forced. And I'm so tired of UK filmmakers subjecting American audiences to their After reading all of the great reviews, I was expecting this to be really good. It wasn't. It's way too long. The story is convoluted and forced. And I'm so tired of UK filmmakers subjecting American audiences to their narcissistic infatuation with royalty, blond-haired, blue-eyed princesses/queens and the sounds of their annoying accents. Speaking of annoying accents, I wish American actors would stop perpetuating this narcissism by proving to us all that they can do an English accent. Actually, the real reason I couldn't get into this movie is because I was constantly distracted by the sight of Claire Danes' huge schnoz peering out from between those curtains of bleach-blond locks.",
      "review_date": "2007-12-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nOn first glance, Stardust seems to be a rather indefinite story, poorly brought to light. Somehow its odd that the plot starts from a childish bet and ends in kingdom-ship. Yet if you look at the elements distinctively, the story brings many interesting and unique elements, like the binding chain, or the trans-morphing of stars into human aspects. The Background story of fight over the throne was a bit cruel and unpolished, yet the love story between Yvaine and Tristan was really interesting. It evolved from nothing to the consumption of their relationship in less than 2 days? That's odd even for a fantasy story. The thing which puzzles me is why take the effort to write (i mean the actual novelist) about kings and witches? It doesn't really fit in with the world conceived. Pirates, sky merchants... I guess the kingship is a little farfetched and doesn't really serve a purpose. If there was just the love story it would have absolved itself. But technically the movie has many pluses for use of original elements of fantasy, skillfully sown together with a dark wire. And yes indeed too many people dying, not enough positive motive to explain all the extreme acts of negativism.",
      "review_date": "2011-02-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Brilliant! Brilliant! Brilliant! Anyone who thinks differently clearly had their eyes shut or brain switched off. This is a family film with so much going for it. Magic, murder(s), comic mayhem, romance, fantasy, cross dressing pirates andBrilliant! Brilliant! Brilliant! Anyone who thinks differently clearly had their eyes shut or brain switched off. This is a family film with so much going for it. Magic, murder(s), comic mayhem, romance, fantasy, cross dressing pirates and some very good swordplay not to mention some very well done effects. Robert De Niro and Michele Pfeiffer were excellent as indeed was the whole cast, even that idiot Ricky Gervais (sorry can't stand the bloke) who thankfully had only a small part and suitable end. The sword fight at the end of the film is probably the finest sword fight I think I have ever seen in a film as well some of the best comedy fights which prospective viewers can find out for themselves. I only wish the score thing could move further to the right, because this film deserved it. To those who gave bad reviews, what can I say \"losers\" I think comes close.",
      "review_date": "2011-08-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe world that's created is nice to look at, but the stereotypical nature of the female roles,  and the clownlike portrayal of a gay man (by robert deniro!)  really took the magic out of the film for me.  In a modern fable is it still necessary  that the only women with power are evil witches, and that even a female 'star' seems to have no power on her own except to shine with love for a man?  Also, that the line of inheritance in a magical kingdom can only pass to a male heir, skipping a female heir who has suffered imprisonment for many years and only gets rewarded by being reunited with a guy who got her pregnant and left her many years ago?  And, seriously, Robert Deniro's performance was considered acceptable?? It's a shame for all the visual beauty and reasonable acting ( I have to say, not stellar) to be devalued by these outmoded concepts. I think we can do better than this.",
      "review_date": "2012-02-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Confusing and nonsensical. Stardust is one of the most chaotic pieces of fiction I've seen in recent memory. Many characters are pointless and do nothing for the plot, the only redeeming party is Michelle Pfeiffer's role in the film.",
      "review_date": "2018-10-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I thought this was a masterpiece, well cast, charming story (that flows beautifully) I can't believe that of could get bad reviews after trashy plots like pirates. Its just a romantic story in a magical world, great for kids and adults. I thought this was a masterpiece, well cast, charming story (that flows beautifully) I can't believe that of could get bad reviews after trashy plots like pirates. Its just a romantic story in a magical world, great for kids and adults. don't miss it.",
      "review_date": "2008-03-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It was ok but my 9 yr. old sister had a lot of ?'s afterward i liked the scenery but to many people die.",
      "review_date": "2007-10-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie was great. It really mixed a lot of fantasy elements into a light fairy tale for adults. The cast was great and the story flowed well. What some found to be cluttered I felt added to the story and character development. Definitely The movie was great. It really mixed a lot of fantasy elements into a light fairy tale for adults. The cast was great and the story flowed well. What some found to be cluttered I felt added to the story and character development. Definitely worth watching.",
      "review_date": "2007-12-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Its a real sweet movie. It's just so lovable and kind. Its a movie that most people will feel a \"aww\" effect.",
      "review_date": "2007-10-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Highly entertaining escapism with great visuals and amusing characters. Watching Michelle Pfeifer morph into various incarnations of her character is worth the price of admission alone!",
      "review_date": "2007-08-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A pretty good movie, it needed some more work on its story which is nothing but a star falling down to Earth, with two random people going beyond and realizing the importance of the star. That's not much, it should be more. But all in A pretty good movie, it needed some more work on its story which is nothing but a star falling down to Earth, with two random people going beyond and realizing the importance of the star. That's not much, it should be more. But all in all, enjoy it, its a fun movie with stupid and badly charactered humor. But it has fantasy including adventure the same way the Harry Potter movies have. Maybe for those who didn't think Harry Potter 5 was a very good movie then I wouldn't suggest this and wait for the DVD. But seriously, I can't wait to see more reviews, because there are all kinds of things in this film.",
      "review_date": "2007-08-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I put off seeing this movie; it looked kind of sappy and silly to me. But a sentimental friend dragged me to the theater and I really enjoyed myself. Stardust is an unabashed fairy tale with a 21st century sensibility that keeps the story I put off seeing this movie; it looked kind of sappy and silly to me. But a sentimental friend dragged me to the theater and I really enjoyed myself. Stardust is an unabashed fairy tale with a 21st century sensibility that keeps the story from feeling cliched and predictable. But in the end it's the tale of a boy and a girl, and the magical, mystical --and occasionally political -- forces that battle to push them together or pull them apart. A light, entertaining night at the movies.",
      "review_date": "2007-09-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Good solid family entertainment.",
      "review_date": "2008-01-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great film..love it.",
      "review_date": "2008-10-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Back in 1987, while I was a university student, Imy roommates convinced me to go with them to see a movie premiere at the local cinema. It was for a new movie I'd heard nothing about called \"The Princess Bride\". I was amazed at how good Back in 1987, while I was a university student, Imy roommates convinced me to go with them to see a movie premiere at the local cinema. It was for a new movie I'd heard nothing about called \"The Princess Bride\". I was amazed at how good PB was, and have always thought it was a unique and special movie. I'd heard that a new movie named 'Stardust' was a similar style to \"Princess Bride\". I thought, nah, \"Princess Bride\" is such a great classic movie that there's no way this 'Stardust' can compare. I watched 'Stardust' on Sunday night. Wow - it surprised me. It's actually a really good movie! Some parents might think that Stardust is a movie for children - it's not. The movie can be a bit dark and frightening at times. Overall, it's a wonderful soty with good acting, great special effects - and a charming love story. I highly recommend this movie!",
      "review_date": "2007-12-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Finally a film comes along without the shackles of a Hollywood crusade. Long have I waited for something to simply exist simply because it can. No soapbox here, no platform for world changes or thinly veiled allegories to make us loathe the Finally a film comes along without the shackles of a Hollywood crusade. Long have I waited for something to simply exist simply because it can. No soapbox here, no platform for world changes or thinly veiled allegories to make us loathe the current fall of Rome",
      "review_date": "2007-08-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I saw this movie last night and it was fantastic! It reminds me of the fantasy movies that were out in the 80's but with some oddly placed humor I wasn",
      "review_date": "2007-08-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Easily the best film I've seen this year. VERY likable characters (Danes is easily the weakest actor, but she's passable), good music (though sometimes utterly stolen from films like Bram Stoker's Dracula), flat-out awesome Easily the best film I've seen this year. VERY likable characters (Danes is easily the weakest actor, but she's passable), good music (though sometimes utterly stolen from films like Bram Stoker's Dracula), flat-out awesome set design and cinematography, and many interesting and complicated plot elements that ALL get gracefully resolved! (which is impressive, and appears to have been lost on many critics who I believe just have too short an attention span or lack of focus.)",
      "review_date": "2007-08-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is wonderful, a thoroughly entertaining work of escapism. It has something for everyone -- adventure, romance, humor, magic, fantasy, and, oh yeah, a unicorn. It may sound like a cliche fairy tale, but it's so well done that This movie is wonderful, a thoroughly entertaining work of escapism. It has something for everyone -- adventure, romance, humor, magic, fantasy, and, oh yeah, a unicorn. It may sound like a cliche fairy tale, but it's so well done that it works completely. I didn't find a moment of it slow or boring, as some users have said, I was enchanted from beginning to end. Nitpickers. Okay, I admit that I'm hopelessly in love with Claire Danes, but still, she's radiant in this film -- literally.",
      "review_date": "2007-08-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Instant classic! I recommend this movie to everyone I meet. It's a classic romance done in a nostalgic,magical way that I haven't seen reproduced since \"The Princess Bride\". It was wonderfully acted by veterans like DeNiro, Instant classic! I recommend this movie to everyone I meet. It's a classic romance done in a nostalgic,magical way that I haven't seen reproduced since \"The Princess Bride\". It was wonderfully acted by veterans like DeNiro, Michelle Pfieffer, Peter O'Toole, and great new stars like Claire Danes and the beautiful Kate Magowen.(she is going to be big). Fantastic, 5 Stars, 2 Thumbs up!",
      "review_date": "2007-08-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a very exciting movie, which takes you through pretty much non-stop adventure. I like the plot, how everything just falls together; as well as the comedy, with the spirits of the dead Princes tagging along the movie. The romance of This is a very exciting movie, which takes you through pretty much non-stop adventure. I like the plot, how everything just falls together; as well as the comedy, with the spirits of the dead Princes tagging along the movie. The romance of the movie is very touching without being over bearing. I've been walking out of every movie for the last few months and this is the first movie I stayed and loved from the beginning till the end.",
      "review_date": "2007-08-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was surprised - I quite liked it, a lot. It has many elements of many other fairy tale movies such as Shrek, but it all just worked really well together in this movie. This one, I'd pay movie theater prices to see again.",
      "review_date": "2007-09-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Hey, it might not be the smartest movie around, but if you believe, like I do that levity is harder to create that gravity, then you will enjoy it. In an industry that creates million dollar babies to pull your heart out and smash it with a Hey, it might not be the smartest movie around, but if you believe, like I do that levity is harder to create that gravity, then you will enjoy it. In an industry that creates million dollar babies to pull your heart out and smash it with a hammer, this movie does something really worth your time and money, it leaves you light and refreshed and feeling like a kid again.",
      "review_date": "2008-01-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Laura W. gave it a10: A fabulous film with an amazing cast - it truly leaves you with a smile on your face and feeling better about the world!\" I wholeheartedly agree!",
      "review_date": "2008-01-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Terrific film. I didn't think id like it from the very poorly put together tv adverts, however it was excellent from start to finish. Such fantastic ideas and a script that used such imagination is rare, its honestly one of few films Terrific film. I didn't think id like it from the very poorly put together tv adverts, however it was excellent from start to finish. Such fantastic ideas and a script that used such imagination is rare, its honestly one of few films you could recommend to anyone of any age group.",
      "review_date": "2008-07-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Delightful film. One that I can watch over and over again. And there are very few films that I can say that about.",
      "review_date": "2009-01-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The best movie, I've seen in a long time. It was a fairy tale that will almost make you believe that it seem a reality with the brilliant acting and plot that all fits in together.",
      "review_date": "2009-03-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Lacks definition. The main story is not very strong, characters don't have depth, and it's childish but not a kid's movie.",
      "review_date": "2007-11-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A fabulous film with an amazing cast - it truly leaves you with a smile on your face and feeling better about the world!",
      "review_date": "2007-11-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Loved it! thought is was one of the years unexpected hits! I suggest that everyone see it.",
      "review_date": "2007-12-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was surprised how much I enjoyed this movie. Yes, the story has some holes, the character could have some more depth and is some what predictable but it left me feeling happy and was a great fantasy escape movie. DeNiro was wonderful as I was surprised how much I enjoyed this movie. Yes, the story has some holes, the character could have some more depth and is some what predictable but it left me feeling happy and was a great fantasy escape movie. DeNiro was wonderful as was the special effects.",
      "review_date": "2007-12-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was surprised by how much I liked it. Cox and Pfeiffer (especially) are stand-outs. My only complaint would be the ocassional cheesy special effects but the story and acting (maybe not Danes so much) are very well done and convincing. I I was surprised by how much I liked it. Cox and Pfeiffer (especially) are stand-outs. My only complaint would be the ocassional cheesy special effects but the story and acting (maybe not Danes so much) are very well done and convincing. I recommend it for sure.",
      "review_date": "2007-08-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie tries to do something that many movies do and fail, mix multiple genres. However, Stardust somehow is able to add an element of Romance, Comedy, Action, Adventure and Drama all into one in a very seamless fashion. The acting is This movie tries to do something that many movies do and fail, mix multiple genres. However, Stardust somehow is able to add an element of Romance, Comedy, Action, Adventure and Drama all into one in a very seamless fashion. The acting is decent, nothing too special, and there are only a handful of cliche moments. The movie keeps you interested with a multitude of stories that all lead to one goal: finding the star and using it for their own will. If you want to see a movie that is truly unique, to get some variety for you palette from this ever so dreadful year of films, go see this movie.",
      "review_date": "2007-08-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Fun Movie. Very enjoyable if you like fantasy type movies with witches and magic. Acting is excellent and storyline is well done. Pfeiffer and DeNiro do a great job. Go see it.",
      "review_date": "2007-08-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I always liked the book, but I was quite ambivalent about the movie adaptation since I'm not a fan at all of Claire Danes. I was actually surprised at how much I liked the movie, despite a few flaws. Cox did really well to make you care I always liked the book, but I was quite ambivalent about the movie adaptation since I'm not a fan at all of Claire Danes. I was actually surprised at how much I liked the movie, despite a few flaws. Cox did really well to make you care about him and about his quest, and his romance with Danes developed very naturally. The princes were awesome, and Michelle Pfeiffer was simply excellent. DeNiro and his pirates were funny as all get out, and the movie was overall a lot funnier than you would think. All in all a very, very enjoyable movie that should do well - if not at the box office then on the aftermarket. I saw it early on Saturday afternoon in an almost full theater, which was as good sign I thought.",
      "review_date": "2007-08-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A fun, breezy film that uses a fantastic, funny screenplay and great cast to tell us a fairy tale. You'll guess how it ends (it is a fairy tale, after all) but will love getting there regardless.",
      "review_date": "2007-08-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Entertaining, campy and fun. Michelle Pfeifer really had fun with her character. It was also something to see De Niro play a cross dressing, gay pirate. Peter O'Toole has had one face lift too many.",
      "review_date": "2007-08-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Everybody wants to compare this movie to The Princess Bride, but where that film stands alone as a true original, you'll find equal parts of lesser fantasy films, such as The Witches, Death Becomes Her, and even Time Bandits weighing in Everybody wants to compare this movie to The Princess Bride, but where that film stands alone as a true original, you'll find equal parts of lesser fantasy films, such as The Witches, Death Becomes Her, and even Time Bandits weighing in here. But taken on its own terms, Stardust is a refreshingly simple and sweet-hearted fantasy, with little of the Tolkeinesque grimness that has taken over the genre. The story is satisfyingly stirred together from ingredients of fairy tale and modern romantic comedy formulas, and feels nicely hand-made and quirky, taking its time winding its way around some genre-busting set-pieces leading up to a nifty final sequence that manages to find new angles on the supernatural-battle-in-a-castle theme. The film is rescued from potential classic status mostly due to an unfortunate tendency to go too far, going for slapstick where a sly wink would serve better (notably in the over-use of the Greek chorus of dead heirs, and the eventual more-than-we-needed-to-know reveal of DeNiro's pirate character). But this will make a fine addition to the DVD collection of anybody who is over the Disney princess thing.",
      "review_date": "2007-09-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Robert De Niro is wonderful. We are still periodicly raising fists, growling \"ARRR\" and giggling. A delicious romp.",
      "review_date": "2007-09-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Sadly yet another classic that will only be validated after it breaks record DVD sales. Don't miss this in the theater, it's an instant classic nevermind that you never read the book. Great for everyone kids to grown-up kids. SEE Sadly yet another classic that will only be validated after it breaks record DVD sales. Don't miss this in the theater, it's an instant classic nevermind that you never read the book. Great for everyone kids to grown-up kids. SEE IT BEFORE IT\"S GONE!!",
      "review_date": "2007-09-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Feel-good to the core, touch of exaggeration and slight childishness in the fantasy it prescribes, but thoroughly enjoyable all the same, and kudos to the Art Direction, and the make-up men!!!",
      "review_date": "2008-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Ariel you took the words right out of my mouth. Nice movie not pretentious at all, just made to give you a good feeling and a smile on you face... it succeeds!",
      "review_date": "2008-02-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I absolutely loved this movie, too bad it didn't appeal to the american public, due almost entirely to poor marketing, and also a little due to very poor movie taste here (I mean just look at the garbage they put out just to make a I absolutely loved this movie, too bad it didn't appeal to the american public, due almost entirely to poor marketing, and also a little due to very poor movie taste here (I mean just look at the garbage they put out just to make a movie). This film is a rare treat for the whole family. I showed it to my parents and they loved it as well.",
      "review_date": "2008-03-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie will become a cult classic much like The Princess Bride did in the 80's. It was very fun.",
      "review_date": "2008-04-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Thoroughly enjoyed this film. It's funny, I really liked the characters and the visuals are superb. The ending could have been better, but it's still a great film.",
      "review_date": "2008-04-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film gives us something Hollywood rarely does in a completely enchanting and original fairy tale. All aspects of the plot are well thought out, with numerous surprises along the way. Genuinely entertaining from start to finish, it This film gives us something Hollywood rarely does in a completely enchanting and original fairy tale. All aspects of the plot are well thought out, with numerous surprises along the way. Genuinely entertaining from start to finish, it succeeds in all the areas where The Brothers Grimm failed.",
      "review_date": "2008-04-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A classic that will last generations. It brings Gaiman's novel into the cinematic light well. If you like living in fairytale worlds you'll feel right at home and laughing your socks off.",
      "review_date": "2007-11-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Loved it !!! Saw it 3 times, it might not re-invent the genre, but it was just pure fun !!!!",
      "review_date": "2007-11-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I quite enjoyed this little fantasy romp. It's one of those movies you loved watching as a kid. There was a real sense of adventure about it. I notice that some critics are comparing it to LOTR, Harry Potter and Narnia, which is I quite enjoyed this little fantasy romp. It's one of those movies you loved watching as a kid. There was a real sense of adventure about it. I notice that some critics are comparing it to LOTR, Harry Potter and Narnia, which is probably quite accurate. Don't let that put you off though, this movie shines in its own right. The special effects were great, so were the characters. If only they had been able to pace the story a little better, rather than having quiet moments where nothing significant happens then quickly switches to action overload.",
      "review_date": "2007-12-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Funny, enchanting, and just plain fun, Stardust falls into theaters leaving audiences giggling, applauding, and maybe even crying a little for those of us who still feel romance isn't dead. The movie is not perfect, and as with any Funny, enchanting, and just plain fun, Stardust falls into theaters leaving audiences giggling, applauding, and maybe even crying a little for those of us who still feel romance isn't dead. The movie is not perfect, and as with any book-based film there are changes. However, this time around the work to the film's advantage, giving us a romance that is much more plausible and leaving out bits of the book that were just plain boring. Any fantasy or romance fan should be at home watching Stardust. Give it a while to get going, and it will sweep you off your feet.",
      "review_date": "2007-08-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Do not miss this flick; light years ahead of rh3 or skinwalkers. Needs to be seen on big screen, not DVD, equal with Harry Potter, LOTR trilogy, name your favorite fantasy flick! If you liked \"Time Bandits\" or other flicks that keep you Do not miss this flick; light years ahead of rh3 or skinwalkers. Needs to be seen on big screen, not DVD, equal with Harry Potter, LOTR trilogy, name your favorite fantasy flick! If you liked \"Time Bandits\" or other flicks that keep you thinking and giggling out loud after the movie ends........ Outstanding performances by veterans as well as newcomers, and a much, much greater than average script-story. Just see it!",
      "review_date": "2007-08-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Better, even, then the book. They captured it perfectly.",
      "review_date": "2007-08-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Stardust has aspirations of being a much more epic-sized The Princess Bride by throwing in elements of Harry Potter, Pirates of the Caribbean and Lord of te Rings but it never quite lives up to those ambitions. But in a summer of Stardust has aspirations of being a much more epic-sized The Princess Bride by throwing in elements of Harry Potter, Pirates of the Caribbean and Lord of te Rings but it never quite lives up to those ambitions. But in a summer of disappointing sequels and blockbuster franchises, Stardust is still a great getaway into a make believe world of witches, pirates, kings and magic spells. The story holds up throughout the 2 hour running time with some great,(and some cheesy) special effects and some \"let it fly\" performances from Michelle Pfeiffer and Robert DeNiro, the always terrific Peter O'Toole and a movie-stealing hysterical bit by Ricky Gervais. The comedy in Stardust is what makes up for all its shortcomings and it is very funny, making it one of those films that takes you by surprise for a trip that 's well worth taking.",
      "review_date": "2007-08-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I LOVED this movie - it comprised of everything I go to the movies for - great storytelling, humor, romance, escape... I enjoyed every minute!",
      "review_date": "2007-08-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Excellent summer escape. Pfeiffer is wonderful, De Niro a hoot. Loved it all.",
      "review_date": "2007-08-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The preview for Stardust was pretty awful, it looked liked a self-consciously quirky fantasy film filled with dated special effects and campy performances. The special effects are in fact pretty mediocre, looking like they were made for TV, The preview for Stardust was pretty awful, it looked liked a self-consciously quirky fantasy film filled with dated special effects and campy performances. The special effects are in fact pretty mediocre, looking like they were made for TV, but fortunately, that doesn't get in the way of a film that's truly epic and thrilling in scope and imagination. Unlike the trailer, much of the film's unique rhythms felt natural, coming off both refreshing and engaging. There was enough complexity in plot and character development to come off as a fresh take on the fantasy genre, but no so much that it felt like a forced exercise in genre bending. What I admired the most though was how momentum was successfully built throughout the film through a simple, but thrilling soundtrack and how well the film tackled standard movie fare, such as finding true love and the rockiness of the path to adulthood. These commonly touched on themes that often come off as cliched and cheesy in other films were genuinely touching in Stardust. There's plenty of comedy in the film, but it worked well within the framework of a fantasy action-adventure, instead of overtaking it. And the laughs were much more hit than miss, working within the world of the film instead of the actors winking at the camera. The only time I really felt like this mood was broken was Deniro's appearance as a fey pirate. The audience laughed a lot during that segment, but I really think it was only because we all knew Deniro usually plays bad ass gangsters. That was the only part where I really felt the movie was trying to subvert its star power to come off as self-consciously off beat, since Deniro's performance itself was pretty unconvincing. Overall, I highly recommend this movie, it's my favorite of 2007. It's really unique, thrilling, touching, and funny without browbeating the audience with how clever and different it is.",
      "review_date": "2007-08-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very good fantasy movie. Fairly typical story line but it kept me entertained. With the star power it had was surprised it didn't do as well as I thought it would have.",
      "review_date": "2008-01-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Delightful from beginning to end. Over two hours oftotal escape into another world. Well done.",
      "review_date": "2008-03-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This was my favorite movie of 2007 by a pretty large margin, beating Enchanted, Hot Fuzz, and Surf's Up as my other favorites. As others have said, it's just loads of fun to watch. I just received my HD-DVD of this movie and can This was my favorite movie of 2007 by a pretty large margin, beating Enchanted, Hot Fuzz, and Surf's Up as my other favorites. As others have said, it's just loads of fun to watch. I just received my HD-DVD of this movie and can confirm I still love the movie as much as when I saw it in the theater!",
      "review_date": "2007-12-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Started out really bad, 30 mins into the movie I wanted to turn it off... It was just a big mess, ideas were flying left and right! but, they managed to pull it together and I began liking the movie..... Still the movie is far from a Started out really bad, 30 mins into the movie I wanted to turn it off... It was just a big mess, ideas were flying left and right! but, they managed to pull it together and I began liking the movie..... Still the movie is far from a \"classic\" but its alot better then i expected it to be.",
      "review_date": "2007-12-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "books rock. movies based on books also rocks. for example, Stardust. the actors were entertaining, and the gags were so funny they were the only reason why it sticks to the source material and why was this movie such a big hit? because Takebooks rock. movies based on books also rocks. for example, Stardust. the actors were entertaining, and the gags were so funny they were the only reason why it sticks to the source material and why was this movie such a big hit? because Take That did the song for it. thats why this made money despite the fact that it didn't became one of the grossing movies of 2007. Stardust is a great adaptation of the book by Neil Gaiman. unfortunately, after the movie got good reviews from the critics, Neil Gaiman plans to make a sequel to the book sooner, later, or someday. thats all I have to say.",
      "review_date": "2010-10-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Stardust features fantastic performances from Michelle Pfeiffer and Claire Danes. The whole story is full of imagination, heart, adventure, humor and thrills. Neil Gaiman's spirit is definitely showed in this fantastic movie. I give this movie 90%.",
      "review_date": "2011-12-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Sweet, witty fantasy film. Not perfect but it's charm more than makes up for any shortcomings in pacing or script. A shame more critics didn't see it that way as it certainly deserves a minimum 8 rating. Further proof that user reviews areSweet, witty fantasy film. Not perfect but it's charm more than makes up for any shortcomings in pacing or script. A shame more critics didn't see it that way as it certainly deserves a minimum 8 rating. Further proof that user reviews are what really count.",
      "review_date": "2014-01-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There were moments where I truly hated this film. There were moments where I truly loved this film. I honestly do not even know where to begin when it comes to corralling my thoughts on Stardust. The acting is very good. Charlie Cox does aThere were moments where I truly hated this film. There were moments where I truly loved this film. I honestly do not even know where to begin when it comes to corralling my thoughts on Stardust. The acting is very good. Charlie Cox does a great job, as do Claire Danes, Michelle Pfeiffer, Robert De Niro, and I loved the small role for Ricky Gervais. The prince brothers are also quite good and all very entertaining. The film is a well-written fairy tale and really lifts you up into this fantastical world where anything is truly possible. In this fashion, the film is very well-written and does fairy tale incredibly well. Stardust is as enchanting as it should be and is a beautifully romantic film with incredibly unique elements in its corner. However, in the negative, the ending is telegraphed from a mile away. The second the film began, anybody walking in could tell you how it was going to end, especially the big \"twist\" at the end. Did they think they were being discreet in hiding it? While the writing is solid, the film seems often too concerned in following the story structure of a classical fairy tale story instead of blazing its own trail and saying something mildly unique. Instead of profundity, we find nothing but \"love conquers all\". A nice message sure, but damn is it ever repeated a lot. With Stardust, I am entirely stuck between being swept up in the fantasy it conjures and writing it off as a wholly derivative and insipid experience. Thus, I am truly perplexed about my own feelings on the film. I would call it \"mixed\", but the film feels better than just this. However, even \"mixed\" sounds too good for a film like this. My opinion on Stardust will likely never be finite until I sit down and watch it again, but for now, I am left feeling completely underwhelmed at this pretty poorly paced, yet sometimes decidedly magical and enchanting film. If it could figure out what it wanted to be, maybe my task here would be a far simpler one.",
      "review_date": "2016-04-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Matthew Vaughn's fantasy/adventure/romance/comedy evokes feelings of - dare I say - \"The Princess Bride,\" and in all the right ways. \"Stardust\" is silly, quirky, imaginative, hilarious, and inspiring all at once, further cementing Vaughn'sMatthew Vaughn's fantasy/adventure/romance/comedy evokes feelings of - dare I say - \"The Princess Bride,\" and in all the right ways. \"Stardust\" is silly, quirky, imaginative, hilarious, and inspiring all at once, further cementing Vaughn's multi-faceted brand of filmmaking, whilst relating a genuinely engaging story at the same time.",
      "review_date": "2016-04-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Funny, creative, tremendously better than the novel of the same name. Actors like Michelle Pfeifer, Ricky Gervais, Claire Danes and Charlie Cox star in this brilliantly written film with wonderful special effects.",
      "review_date": "2013-03-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is a fairy-tale ripe with witches, princes, magic, and romance, which manages to capture a sense of wonder that is missing in so many other fantasy movies. The characters, though not particularly deep, all possess consistentThis film is a fairy-tale ripe with witches, princes, magic, and romance, which manages to capture a sense of wonder that is missing in so many other fantasy movies. The characters, though not particularly deep, all possess consistent motives, which contribute naturally to the development of the intricate plot.The overall tone, despite plenty of violent and cruel events, is lighthearted, and entertaining throughout the film, mostly thanks to superb acting by veterans like Michelle Pfeiffer.Only the lead male character is lacking in presence, but that didn't detract much from my overall experience.",
      "review_date": "2013-08-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Is not the best of the bests but it's really good and it has a lot of fun and random stuff. Me and my family really enjoy it! I recommend to watch with your couple  It's one of those movies where you feel satisfied at the end.\r Loved theIs not the best of the bests but it's really good and it has a lot of fun and random stuff. Me and my family really enjoy it! I recommend to watch with your couple  It's one of those movies where you feel satisfied at the end.\r Loved the song by the way  \"Rule the world\" Performed by Take that.",
      "review_date": "2013-08-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Hands down, the most versatile fantasy movie of all time. It has it all: drama, comedy, suspense, exhilaration; it is as much a love story as a story about humanity, the good and the bad; you could probably sieve a few dozen life lessons outHands down, the most versatile fantasy movie of all time. It has it all: drama, comedy, suspense, exhilaration; it is as much a love story as a story about humanity, the good and the bad; you could probably sieve a few dozen life lessons out of Stardust. The hopelessly romantic will probably be in tears at certain points. The hopelessly cynical should probably dilute their coffee a bit, if they are to retain an open mind while watching this. The only potential downside in Stardust is one that belongs to the purists, those who will cry foul at the movie's one major departure from the book. But I will not spoil. I am a purist myself and I stil love it.",
      "review_date": "2015-04-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Matthew Vaughn’s adaptation of Neil Gaiman’s novel of the same name was my introduction to his directorial genius. At the time, the story, the ensemble cast including Charlie Cox, Claire Danes, Robert De Niro, Michelle Pfeiffer, Mark Strong &Matthew Vaughn’s adaptation of Neil Gaiman’s novel of the same name was my introduction to his directorial genius. At the time, the story, the ensemble cast including Charlie Cox, Claire Danes, Robert De Niro, Michelle Pfeiffer, Mark Strong & the narration by Ian McKellen blew my mind. But I was also impressed by how it was directed.\r I mentioned being blown away by the ensemble cast because when i first watched Stardust it was dubbed in French - yes I’m fluent in Molière’s language. I fell in love with the movie then but once I saw it in English I realized the nuances that were lost to me in the French version. For example, I had always assumed - despite the story partly taking place in the UK - that all of the actors were speaking in an american accent - I know, I can be stupid sometimes. So it was weird to hear British accents, coming out of Danes’ & Pfeiffer’s mouths.\r The fairy tale epic has everything we came to expect in a Vaughn movie, an awesome storytelling, great cynical jokes intertwined with a captivating adventure. Stardust is surprising and incredibly entertaining, as the story unfolds you dive into big new fantasy world that manages to feel very intimate. The film gets so riveting that it’s a good escape, a relaxing movie that helps to take your mind off of your problems.\r The cast is just amazing, the acting is good, and it feels like each and every part - big or small - was written for a specific actor that would give the part what it needs to shine when on screen. For example, Peter O’toole’s part is small but memorable, Robert De Niro’s character is so much fun and not as cliché as I thought he’d be. He’s probably one of the most surprising character in the film. Watching the movie now is even more impressive because so much of the people cast in it are big stars now e.g. Henry Cavill. So it’s an added bonus to watch the film these days and notice these then unknown actors who helped make the Stardust experience magical.\r Stardust is not perfect but it works, you can’t really hate it even if fairy tale, fantasy movies are not your thing. @wornoutspines",
      "review_date": "2015-04-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a pretty enjoyable film for the most part - it has lots of decent visual effects (CGI), cinematography and the like but there are moments that frustrated me as well. Some scenes feature pretty hushed dialogue, which I found a bit hardThis is a pretty enjoyable film for the most part - it has lots of decent visual effects (CGI), cinematography and the like but there are moments that frustrated me as well. Some scenes feature pretty hushed dialogue, which I found a bit hard to follow and moreso the depiction of women regarded as property etc. I didn't feel entirely comfortable with. There is also a certain amount of cheesiness present but of course its a fantasy film, a pretty much entirely family-friendly one and so I suppose that is perhaps a bit of a given, as they say. There is a big well-known cast (Robert De Niro and Michelle Pfeiffer, plus Ricky Gervais and others) but I wouldn't say it the sort of film that will stay in my mind for a particularly long time. If it comes on TV, its certainly worth a watch (for the scene featuring Robert De Niro moving about holding a ladies dress if nothing else) and is mostly a good bit of fun but no more than that. It's not awful but not great - I'll give it a slightly harsh 6 out of 10, rather than a slightly generous 7 out of 10. Its up to you how you interpret that, as ever. Kids will probably enjoy this more than adults, I'd have thought (but of course I could be wrong).",
      "review_date": "2021-11-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The enchanting tale of a fallen star who crashes into a magical kingdom and turns out to be no ordinary meteorite at all, but a beautiful, imperiled woman chased after by an incredible array of seekers who want or need her secret powers. FromThe enchanting tale of a fallen star who crashes into a magical kingdom and turns out to be no ordinary meteorite at all, but a beautiful, imperiled woman chased after by an incredible array of seekers who want or need her secret powers. From wicked witches to power-mad princes, from flying pirates to dueling goblins, each person wh",
      "review_date": "2021-01-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Though I have a few questions I'd like to ask it like, does it take place long in the future after some kind of apocalyptic event, does that create the magic used in the movie? Is the royal family kaleds from Dr. Who that somehow ended up onThough I have a few questions I'd like to ask it like, does it take place long in the future after some kind of apocalyptic event, does that create the magic used in the movie? Is the royal family kaleds from Dr. Who that somehow ended up on Earth and declared the kings of the land because of their blue blood? Overall, this is by far one of the funnest and well developed and written fantasy movies I've seen.",
      "review_date": "2021-08-20",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 133,
  "genres": [
    "Adventure",
    "Fantasy",
    "Romance",
    "Family"
  ]
}