{
  "title": "Superbad",
  "rating": 8.0,
  "release_date": "2007-08-17",
  "summary": "Superbad is a coming-of-age cautionary tale about two socially inept teenage boys about to graduate high school.  Theirs is a ridiculously dependent friendship--but now they've gotten into different colleges and are forced to contemplate life apart.  Evan is sweet, smart, and generally terrified.  Seth is foul-mouthed, volatile, andSuperbad is a coming-of-age cautionary tale about two socially inept teenage boys about to graduate high school.  Theirs is a ridiculously dependent friendship--but now they've gotten into different colleges and are forced to contemplate life apart.  Evan is sweet, smart, and generally terrified.  Seth is foul-mouthed, volatile, and all-consumed with the topic of human sexuality.  This is the story of their misguided attempts to reverse a lifelong losing streak with the ladies in one panic-driven night...that awful, humiliating night you cherish for the rest of your life.  (Sony Pictures)… Expand",
  "critic_reviews": [
    "For pure laughs, for the experience of just sitting in a chair and breaking up every minute or so, Superbad is 2007's most successful comedy.",
    "Might be the most provocative teen sex comedy ever made; it is certainly one of the most convulsively funny.",
    "As a \"Revenge of the Nerds\" redux, Superbad isn't perfect. But it's super close.",
    "An uproarious and touching picture.",
    "Superbad is duly ribald and often achingly funny, brewed from the now-familiar Apatow house blend of go-for-broke slapstick and instantly quotable, potty-mouthed dialogue.",
    "What's most memorable, most striking about Superbad is the canny evocation of male friendship in all its richness and complexity.",
    "It helps that the fun doesn't stop. It helps even more that the pitch-perfect script doesn’t step out of character for a joke.",
    "The movie is astonishingly foul-mouthed, but in a fluent, confident way where the point isn't the dirty words, but the flow and rhythm, and the deep, sad yearning they represent.",
    "You don't have to be a teenager to appreciate the raunchy humor and the uninhibited overkill of Seth's porn-obsessed chatter, though it probably helps to be a guy.",
    "A funny, boozy, ramshackle party.",
    "What with everyone so focused on the raunchiness, it comes as a complete surprise to find that Superbad is in fact a love story.",
    "Easily one of the funniest comedies of the year and one you wouldn’t mind seeing again and again.",
    "Mostly Superbad is as soulful and funky as its soundtrack.",
    "What if Quentin Tarantino collaborated with John Hughes on a teen comedy? Superbad is a decent approximation of what the result might be.",
    "Superbad is cute if you like guys who aren't even remotely bad, in a coming-of-age tale so old-fashioned the girls might just as well be wearing bloomers.",
    "In this teen-boy universe, sex is everywhere and nowhere, it's oozing out of every pop culture pore and every other insane boast, yet the idea of figuring out how to talk to girls without turning into a yutz remains elusive.",
    "Super-vulgar, ridiculously sophomoric, horribly nasty and so hilarious you’ll probably squirt Diet Coke out of your nose within the first 20 minutes.",
    "Superbad is just a great time, plain and simple.",
    "Side-splitting laughter, along with some powerful cringing, are likely to be audiences' dominant reactions.",
    "It's mostly very crude, often very funny and a little bit smarter than you might otherwise think.",
    "The movie is best when everything is up in the air.",
    "Superbad never forgets the lesson one learns when looking back on one's awkward youth: Cool isn't just where society dictates; it is also where you find it.",
    "There is a hint of sentimentality among the pals at the end, but not enough to offset the film's harmless combination of camaraderie and wished-for - oh, how they wish for it - debauchery.",
    "Intermittently hilarious if also interminable.",
    "Filled with nasty, nasty stuff.",
    "Some of the patter is funny, but the movie lacks the clever plot developments and the character nuances of a classic like \"American Graffiti.\" And it's missing the belly laughs of earlier raunchfests \"American Pie\" and \"There's Something About Mary.\"",
    "The bawdy jokes score big points, but it's the rueful acknowledgement of adolescent embarrassment and humiliation that most distinguishes Superbad, another ultra-raunchy and commercial sex comedy from the Judd Apatow laugh factory.",
    "Christopher Mintz-Plasse steals the movie in his screen debut as a nerd di tutti nerds, a kid whose fake I.D. reads \"McLovin.\"",
    "Horny is as horny does in the sweetly absurd high school comedy Superbad.",
    "The movie loses credibility with the arrival of Rogen and Bill Hader as two uniformed patrolmen who are drunker and crazier than any high schooler could ever get, but the variety of complications thrown at the three pubescent heroes raises this a cut above most raunchy comedies.",
    "Its pleasures and charms lie in its very crudeness, in the way the characters' thoughts begin in their d---s and spill out of their mouths, completely bypassing their brains.",
    "Not super, but not bad, the teen comedy, Superbad, is another comic dance across the hormonal minefield of late high school.",
    "As lurching, awkward, and dirty-minded as the three horny man-boys at its center--but not, in the end, quite as funny or endearing.",
    "As films about the young and the horny go, I preferred the smarter approach director Jeffrey Blitz takes in \"Rocket Science.\"",
    "Superbad simply isn't. It isn't super, as it intersperses crudely funny gags with an equal number of dry spots. It isn't ever truly bad, because even the lame segments pass quickly.",
    "To find that valuable truth, you have to dig through an avalanche of d--- jokes and strenuous slapstick."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "I don't see why people think this is a bad movie. its a awesome kickass movie. although the ending sucked, the movie as a whole rocked and made me and my friends laugh and i think that's what counts.",
      "review_date": "2009-09-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is bad on every level. Awful script. Awful actors. Awful continuity. Awful blocking. Awful scenes. Coming of age, trying to get laid, high school buddy films don't need to be this bad. Jonah Hill is waaaay to old to play a high This is bad on every level. Awful script. Awful actors. Awful continuity. Awful blocking. Awful scenes. Coming of age, trying to get laid, high school buddy films don't need to be this bad. Jonah Hill is waaaay to old to play a high school loser believably any more. Michael Cera was much better when he had good material on Arrested Development. Funny film?? Not at all. I felt ripped off by this half-assed effort, by I have been feeling ripped off a lot lately by the current level of Hollywood's mediocrity. Who allows this drivel to be produced??",
      "review_date": "2007-08-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Michael Cera is hilarious in his socially ineptness, while many times Jonah Hill's salacious outbursts are unnecessary or unjustified in the movie's ethos.",
      "review_date": "2011-01-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Superbad is a phenomenal coming-of-age comedy, and one that is really heartfelt as well. The movie has aged incredibly well, and is endlessly quotable. There are some really slow sections of the movie that hold it back from being a higherSuperbad is a phenomenal coming-of-age comedy, and one that is really heartfelt as well. The movie has aged incredibly well, and is endlessly quotable. There are some really slow sections of the movie that hold it back from being a higher score, but one thing I really do appreciate about this movie is that it follows the old school comedy rule of saving the funniest moments for the end of the movie. The final ending is very poignant, and one I won't soon forget.",
      "review_date": "2020-01-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The funniest film I've seen in years. I can't remember the last time I laughed so much.",
      "review_date": "2007-09-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Such a funny film. Way better than the over apprciated 'The Hangover'. It has a great cast and the story between Mclovin and the cops is so great. It's only fault is it shouldn't be watched with parents, trust me...",
      "review_date": "2011-12-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The bottom line is this movie made me laugh out loud and a lot. I really enjoyed it.",
      "review_date": "2009-08-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The best movie ever! The movie is full of laughs, teen comedy, sex and a true coming-of-age story just like American Pie.",
      "review_date": "2009-07-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wildly funny, arguably the best \"dirty\" comedy of the 2000's, which is quite impressive considering how many are made these days (\"The Hangover\", \"Pineapple Express\", \"Anchorman\", etc.). The dialogue is funny almost line by line, that's howWildly funny, arguably the best \"dirty\" comedy of the 2000's, which is quite impressive considering how many are made these days (\"The Hangover\", \"Pineapple Express\", \"Anchorman\", etc.). The dialogue is funny almost line by line, that's how incredibly funny this movie is. The soundtrack adds a fantastic funky 70's vibe, and the film simply never gets boring or completely ridiculous.",
      "review_date": "2010-08-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Superbad is just as it says: Super Bad! Dirty words were just being thrown around as frequently as we breathe air. The plot had no tasteful point and it seems like they were just saying words such as \"d**k\" and \"v***na\" as many times as Superbad is just as it says: Super Bad! Dirty words were just being thrown around as frequently as we breathe air. The plot had no tasteful point and it seems like they were just saying words such as \"d**k\" and \"v***na\" as many times as possible in a sentence without any sense. There weren't really lines or gestures that was funny, but it appears that people were just laughing in the theater because they feel obligated to get their money's worth. I was so disgusted I walked out of the theater (along with a large number of people). I should've known this movie was going to be super-bad since it shared similar distasteful lines and plot with Knocked Up. Disappointed.",
      "review_date": "2007-08-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is the single worst movie I've ever seen.  Like a train wreck, it was hard to decide when it was the right time to give up and turn off, but I did at about half-way.  The idiots that wrote and directed this piece of garbage shouldThis is the single worst movie I've ever seen.  Like a train wreck, it was hard to decide when it was the right time to give up and turn off, but I did at about half-way.  The idiots that wrote and directed this piece of garbage should be asked to never do anything again...",
      "review_date": "2007-12-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was very disappointed. This movie sucked. It really did. Just a bunch of cussing. It blew balls",
      "review_date": "2007-12-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "painful and embarrassing to watch. One reviewer wrote that the films 'charms' are in the way the characters think with their dicks. What's remotely charming about this!? A load of macho American bullshit (witness the antics of painful and embarrassing to watch. One reviewer wrote that the films 'charms' are in the way the characters think with their dicks. What's remotely charming about this!? A load of macho American bullshit (witness the antics of the two cops) and gross moments smothered with an obligatory layer of cheesy sentiment that oozes out at the end of the film ('I love you maaaan'). How can learned critics rate this trash?",
      "review_date": "2007-12-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Superbad is. I didn't laugh once in the first 30 minutes, so this isn't really a comedy at all. Whenever everyone else laughed, I just cringed and wondered why anyone would ever make a movie like this. If Pauly Shore decided to Superbad is. I didn't laugh once in the first 30 minutes, so this isn't really a comedy at all. Whenever everyone else laughed, I just cringed and wondered why anyone would ever make a movie like this. If Pauly Shore decided to remake Fast Times at Ridgemont High, Superbad would likely be the result. One of the worst movies I've ever seen.",
      "review_date": "2007-11-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie reminded me of when I was young and in high school (even though only 4 years ago). The boy group with contrasting personalities existed in high school (at least in mine). Many pacts they formed (getting laid, being friends fromThis movie reminded me of when I was young and in high school (even though only 4 years ago). The boy group with contrasting personalities existed in high school (at least in mine). Many pacts they formed (getting laid, being friends from necessity) is very common in high school. Not to mention happy endings near prom! I would have enjoyed this more if I was still in high school but I'm not so it was a little less appealing than it would have been.",
      "review_date": "2011-07-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It starts off funny, but it is just boring. This is an over-hyped comedy that does nothing but have stupid grotesque jokes. The acting sucked, and practically put me to sleep.",
      "review_date": "2013-02-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I left the theater in a disgust. It was so vulgar that it wasn't funny.",
      "review_date": "2007-10-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the most overrated comedies I've ever watched. Shame that so many audiences depend on this brand of vulgar humor to deliver laughs. It's disgusting.",
      "review_date": "2011-01-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I love Freaks and Geeks, I liked 40-Year Old Virgin, and I actually really liked Knocked Up, but I know enough by now to expect Apatow to be consistent. Seriously, have any of you seen \"Life As We Know It,\" or that awful college show he did? I love Freaks and Geeks, I liked 40-Year Old Virgin, and I actually really liked Knocked Up, but I know enough by now to expect Apatow to be consistent. Seriously, have any of you seen \"Life As We Know It,\" or that awful college show he did? The cast is great, but the jokes just aren't funny if shock humor feels formulaic to you after the first ten or so.",
      "review_date": "2007-10-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is amazingly well-made. It's entertaining, but it makes you think at the same time. I rarely give movies any score above a 6, but this movie is definitely worth seeing. I was lucky enough to get in to see a screener of it, This movie is amazingly well-made. It's entertaining, but it makes you think at the same time. I rarely give movies any score above a 6, but this movie is definitely worth seeing. I was lucky enough to get in to see a screener of it, and it was definitely worth it! You'll be glad you went to see it.",
      "review_date": "2007-08-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Seth Rogen and Evan Goldberg have shown us what real comedy should be. The gags are hilarious and the dialogue is even better...GREAT movie.",
      "review_date": "2007-08-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Very funny one of the best comedys i have seen in a long time from the first time seth and evan open there mouths you are laughing and it doesnt stop from there i think most males can relate to those two at some level its a great movie if Very funny one of the best comedys i have seen in a long time from the first time seth and evan open there mouths you are laughing and it doesnt stop from there i think most males can relate to those two at some level its a great movie if you like crude humor you will love this movie.",
      "review_date": "2007-08-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "oh my god. fantastic. that's all i can say. LOVED LOVED LOVED it. It was hilarious. Brilliant.",
      "review_date": "2007-10-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Funniest movie in a long time...laughing the whole 2 hrs.",
      "review_date": "2007-08-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Simply the funniest comedy movie ive ever seen (except for Borat 8-P). If your lookin' for *** and a good time, you will definitly love this.",
      "review_date": "2007-09-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Vulgar, hilarious, and, like knocked up, one of the most real, true-to-life comedies of the decade. It talks the way high school seniors talk and is hilarious every step of the way.",
      "review_date": "2007-09-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I watched this movie 3 times. It was the best comedy this year. I can't wait for it to come on dvd. Everything from Mclovin to the Cops were great.",
      "review_date": "2007-11-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "FANTASTIC FILM, had me laughing from start to finish!!!!!!",
      "review_date": "2007-12-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "By the way people, being a cop does not elevate you to some godlike status. My neighbor was a cop (he just moved like two days ago) and from that I can certainly tell you that some of them are immature ass hats. He was cool as hell though By the way people, being a cop does not elevate you to some godlike status. My neighbor was a cop (he just moved like two days ago) and from that I can certainly tell you that some of them are immature ass hats. He was cool as hell though but used his badge for fun every chance he could",
      "review_date": "2007-10-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It had some funny moments but it was almost super bad. American Pie is by far better then this. I saw the unrated edition and I only liked one of the extras which was with two hot naked women making out.That part alone was better then the It had some funny moments but it was almost super bad. American Pie is by far better then this. I saw the unrated edition and I only liked one of the extras which was with two hot naked women making out.That part alone was better then the whole movie.",
      "review_date": "2008-03-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Surprisingly unfunny, too long, and borderline misogynistic. A real disappointment.",
      "review_date": "2007-10-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I was suckered by the hype. Loved 40 Year Old Virgin (as did my missus); Loved Knocked Up (as did my missus). Bought this full of anticipation after all the stellar reviews, set aside Sunday night (what a loser), settled down for a I was suckered by the hype. Loved 40 Year Old Virgin (as did my missus); Loved Knocked Up (as did my missus). Bought this full of anticipation after all the stellar reviews, set aside Sunday night (what a loser), settled down for a gutbusting laughfest and... er... couldn't believe how badly it sucked. In fact, I was so surprised at my negative reaction that I wondered if I'd been in some kind of dour mood without realising it and got a second opinion from my kid brother who loves the same nonsense (your Liebowskis, Anchormen, Taps etc) and was also massively pumped to watch the movie after the great reviews. His view: he was livid that he'd wasted two hours of his life that he'd never get back. Problems? Okay, here are a few: the main character is a c*ck. Not in a good, geeky, anti-hero kinda way. No, he's just a c*ck, in a fat, crass, thick angry whinging please-smack-me-in-the-mouth dish-it-out-but-can't-take-it-in-return kinda way. He's the thick, angry dude at a party that you just walk away from as fast as you can. And he's waaaaaaay too old for the role. His mate is as dull as a puddle so there's no comedy chemistry, just uninspired swearing met by empty puzzled/guilty looks. The whole McLovin thing was so fiercely try-hard and cynical. The cops' characters changed as the script required (one minute goofing, then psychopathic) but didn't amuse because of the drug-fuelled mood swings - it just seemed fake. The joy of the recent Apatow stuff has been that under the grotesquerie, the characters were oddly credible. This one, however, is nonsense. There's none of the Apatow goofing-around-great-fun-just-hanging-with-these-characters feel. There's none of the amiability of the benchmark for this sort of movie, American Pies 1 and 2 (and nothing to touch the brilliant set-piece gags from those movies); there's none of the inspired insanity of the better frathouse bashes like Animal House. It just doesn't deliver. And the bolt-on ending! WHY would that absolute raging hottie with a sensible head on her beautiful shoulders even look at Mr spiteful whiney aggressive oik, other than because the movie demanded that the two guys sorta \"get the gal\" at the end? Dude - weak. If I was meant to be rooting for him because he'd followed some long character arc... ah, no. 'Cos he didn't. He woke up hungover and feeling guilty because he'd been such a royal pain in the harris that even he'd spotted it. He inspired such antipathy in me, I would have much preferred it if the movie had ended with him falling in agonising slow motion down the long flight of stairs in that shopping mall. Would have been a two star review, but another star for the McLovin \"it's in!\" line, a solitary great moment that only underlined how duff the rest of this movie was. Everyone I have spoken to who has seen it agrees - rubbish film. Sorry folks, the critics all jumped a big emperor's clothes bandwagon. Save yourselves, it's too late for me.",
      "review_date": "2008-03-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is a sad commentary about back-assward priorities, low class, and a tragic lack of respect for women.",
      "review_date": "2007-08-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not as funny as it should have been , the story really falls when it becomes obvious that the Police as just as big a baffoons as the teens in the story. The \"cops\" should have acted like real cops do.It would have added some tension, and Not as funny as it should have been , the story really falls when it becomes obvious that the Police as just as big a baffoons as the teens in the story. The \"cops\" should have acted like real cops do.It would have added some tension, and thus made the events funnier because they would have made the story more real. INstead , they went cheap on the story and tried to use the cops for half the laughs. It didn't work.",
      "review_date": "2007-08-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "American Pie it's a Billy Wilder picture! How it's possible love a flat and boring movie like this?",
      "review_date": "2007-09-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There is lot's of hype around this movie, I think. Its really not that funny. Lots of penis jokes. It has its moments, but its not something I'd watch over and over again.",
      "review_date": "2011-09-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Though the movie was enjoyable, I found it extremely over-rated mainly because of Michael Cera. Jonah Hill and Christopher Mintz- Passe do a fine job of being horny outcasts but, I only thought Cera's character was a bit of a drag because I'mThough the movie was enjoyable, I found it extremely over-rated mainly because of Michael Cera. Jonah Hill and Christopher Mintz- Passe do a fine job of being horny outcasts but, I only thought Cera's character was a bit of a drag because I'm sick of cera being type-casted as the shy nerd. Bill Hader and Seth Rogan are hilarious as the cops but I found some of the other jokes to be not funny, this movie is worth at least a rental",
      "review_date": "2012-03-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Overrated, So overrated. It was a little funny but really it was just so stupid and unbelieveable that I couldnt look past it and I generally love comedies like this.",
      "review_date": "2011-12-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Superbad is very crude, very nasty, and very funny. The movie comes across as very random and i believe that is were it thrives. The funniest movie of the year.",
      "review_date": "2012-09-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Mclovin story is hands down the best part of this movie and should've been the only focus of this movie. Every other character's jokes fall flat most of the time apart from a few really good chuckles. Not a bad comedy, but I would ratherThe Mclovin story is hands down the best part of this movie and should've been the only focus of this movie. Every other character's jokes fall flat most of the time apart from a few really good chuckles. Not a bad comedy, but I would rather watch The Interview.",
      "review_date": "2015-07-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "After all the hype I really wanted to like this, but it was just okay. Amusing but not funny. While I liked the awkward interplay between the teenage characters, the constant swearing just seemed gratuitous and unrealistic, making the After all the hype I really wanted to like this, but it was just okay. Amusing but not funny. While I liked the awkward interplay between the teenage characters, the constant swearing just seemed gratuitous and unrealistic, making the characters come across as false in a way that's especially damning in a movie that's supposed to feel oh-so authentic. Uh...and the ending, with the girls? Sorry fat kid. Not gonna happen. Talk about unrealistic.",
      "review_date": "2007-12-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "God damn, yet another comedy about white boys and there yearning to get laid, When will it end. Film-making is getting worst and worst, it's been done and done way better. Same old sh!t about 2 white friends, sex obsessed,drug jokes, God damn, yet another comedy about white boys and there yearning to get laid, When will it end. Film-making is getting worst and worst, it's been done and done way better. Same old sh!t about 2 white friends, sex obsessed,drug jokes, I'm a nerd bla,bla. I wanted to shout out in the theater so hard saying-\"don't worry when you reach college you'll be drunk and having Orgys almost everyday, and become a judge,lawyer, or film maker at the same time\". Because there is no real issues here, I'm sure everybody dealt with much bigger things than this crap(and yes it can be funny), like race, teachers, music, dreams, growing up etc. But no, again this movie is painting a real sh!t view of American schools and why everyone i meet that went to a school like this has absolutely no personality. So maybe this movie is true, if it is, then it's certainly not funny.",
      "review_date": "2007-08-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "When's the last time there was a flawed female character in a movie? I honestly can't remember. We'll probably have to go back to like 1995 to find one.",
      "review_date": "2007-10-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Judd Apatow is quickly becoming one of the most reliable sources for comedy. \"40 Year-Old Virgin\" was a terrific success, and it was only continued by what is the funniest movie of 2007, and oddly one of the most touching, \"Knocked Up.\" He Judd Apatow is quickly becoming one of the most reliable sources for comedy. \"40 Year-Old Virgin\" was a terrific success, and it was only continued by what is the funniest movie of 2007, and oddly one of the most touching, \"Knocked Up.\" He is able to dispense a complete sense of realism in absurd situations and each film has you laughing all the way to the credits. Superbad is no exception. Two kids, Seth and Evan (played by Jonah Hill and Michael Cera respectively), are coming to the end of their high school years, and are facing the fact that they will be separated by college next year. They both are lacking in the love department, and wish to enter college non-virgins. Their friend Fogell (played hilariously by Christopher Mintz-Plasse), gets a fake ID, which sets them up as alcohol-snatchers for a party the upcoming night, with Seths crush hosting, and Evans crush going. The events that follow are hilarious. Although these boys have never known a womans sexual touch, they are still complete perverts, and scenes like the one in the chemistry class will have you bursting your gut. Also, the friendship between Seth and Evan can parallel the best friend kinship many felt during the high school years, where you never noticed how you acted slightly homosexual with your best friend, running by their needs and wants, and having petty arguments with them. Plus, Mclovins trip with the cops is a complete breeze, giving you laughter throughout every scene. Mclovins sense of partying and his blind innocence to finally just enjoying life is endearing, in a very different sort of way. When the two boys get to the party, and hilarities ensue, they are set out to either receive sex, or possibly learn a lesson about what girls really want. Slightly not as funny as Knocked Up, it is still a perfect pick for a great time at the theaters. Go, enjoy, and party with McLovin!",
      "review_date": "2007-08-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you liked \"Knocked Up\" you'll probably like \"Super Bad\" starring some of the very same actors. The humor is super raunchy which rarely lets up. The subject matter mostly revolves around sex, drugs, and general bad boy and girl If you liked \"Knocked Up\" you'll probably like \"Super Bad\" starring some of the very same actors. The humor is super raunchy which rarely lets up. The subject matter mostly revolves around sex, drugs, and general bad boy and girl adolescent like behavior. There is not a lot of functionality about the characters at first, except maybe Evan who desires something more heartfelt. Yet even he succumbs halfway but does seem to hold true in the end. I would have thought this film to be somewhat nihilistic in overall philosophical outlook but by the end there does seem to be some deeper insights gained by the characters of their valued friendship and respect of the women in which they were tempted to objectify. This took a lot of internal fortitude as it seemingly went against the overarching cultural grain of the movie. Even many of the adults seemed to acts just as bad as the high schoolers, such as the police who seemed to be trying to relive their youth. Some of their stunts were silly and somewhat funny, especially one line with Fogell. However their excessive immaturity did not seem very realistic, though it helps just to go along it. \"Mclovin\" by the way just about stole the show with his half nerdy/half cool, and mostly lucky antics. However in the end it was he who was still trying to impress the chics with his faked IDs and staged arrests. Not much social redeeming value though I found it funny. \"Super Bad\" was neither super bad nor super good, though definitely worth a viewing. I did however think the film and many others lately push the envelope by using children to portray adult subject matter. Though I laughed at some of the private parts drawings it did seem to cross a line we rarely seem to question any more. I am concerned society is spinning in a less than wholesome direction. I am conflicted as to whether to support this film in light of this fact however it seems appropriate to deal with society in relation to how it is now and not some idealized moral standard. However it is my hope there will be a push for at least some cinematic restraints. In short \"Super Bad\" can entertain, offer some insight about friendship and treating others as human beings, but I doubt it will go down in the annals of film as a classic to forever be remembered.",
      "review_date": "2007-08-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Superbad\" wasn't written by Judd Apatow, it just seems like it was. In \"Knocked Up\", Pete(Paul Rudd) would rather engage in fantasy baseball with the guys than hang out with his wife. Seth(Jonah Hill), at eighteen(too young to be \"Superbad\" wasn't written by Judd Apatow, it just seems like it was. In \"Knocked Up\", Pete(Paul Rudd) would rather engage in fantasy baseball with the guys than hang out with his wife. Seth(Jonah Hill), at eighteen(too young to be suffering a midlife crisis), is barely five seconds into his burgeoning romance with Jules(Emma Stone) before he starts missing Evan(Michael Cera). Penis life-drawings notwithstanding, I don't think Seth is supposed to be read as gay, he just enjoys homosocial (not homosexual) relationships. \"Superbad\" is not the uproarious comedy it's purported to be(I think the problem is that Christopher Mintz-Plasse is a little green), but it's a success because of the film's willingness to portray male friendships with a frank ickiness not previously seen in American mainstream cinema. It's as if the screenwriters read William S. Pollack's \"Real Boys: Rescuing Our Sons From the Myth of Boyhood\".",
      "review_date": "2007-08-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "No no no, everyday last year at school all i heard was how hilarious this movie was, how great it was so i finally rented it * wish i could get my 5 bucks back *. Pointless jokes that wernt even strong enough to make me laugh and i laugh at No no no, everyday last year at school all i heard was how hilarious this movie was, how great it was so i finally rented it * wish i could get my 5 bucks back *. Pointless jokes that wernt even strong enough to make me laugh and i laugh at about anything. People stop applauding this movie! The only remotely entertaining part was the cops, and that didn't last long.",
      "review_date": "2008-09-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I don't know what the hell Wade is talking about because Judd Apatow didn't write nor direct this movie so to call it HIS gem is pretty stupid...its an alright movie, but Seth Rogen's (and Judd's) Knoacked up seems to be I don't know what the hell Wade is talking about because Judd Apatow didn't write nor direct this movie so to call it HIS gem is pretty stupid...its an alright movie, but Seth Rogen's (and Judd's) Knoacked up seems to be very much in the shadow of this film considering how much better that one was compared to Super Bad.",
      "review_date": "2007-10-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Not very funny. Not very good. By the way, Kevin R, b e's grammar in that sentence is correct (I opted to see the movie and my friends opted to see the movie = I and my friends opted to see the movie).",
      "review_date": "2007-10-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "this is one of the funniest, smartest, and greatest comedies in years...better than Knocked Up and a true classic. Don't miss the amazing and absolutely gut bustingly funny comedy.",
      "review_date": "2007-08-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Among all of the Apatow production films, this takes the cake for the most hilarious. Although this may to quite vulgar for some (do not bring anyone under 15), most of the theater was laughing non-stop. The characters are ingenious. Seth Among all of the Apatow production films, this takes the cake for the most hilarious. Although this may to quite vulgar for some (do not bring anyone under 15), most of the theater was laughing non-stop. The characters are ingenious. Seth Rogen has written the funniest film this year.",
      "review_date": "2007-08-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Some of the hardest laughs I've had in a while. I agree with the review that said the movie \"loses credibility\" with the cops. There was too much of them and they got a little too ridiculous, but all in all I thought it was great.",
      "review_date": "2007-08-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I have never written a reveiw of a movie on this site. Most user reviews tend to be rather polarizing and unreliable. But this film deserves the number i bestow upon it. This movie will be remembered next to Ferris Bueller's Day Off. I have never written a reveiw of a movie on this site. Most user reviews tend to be rather polarizing and unreliable. But this film deserves the number i bestow upon it. This movie will be remembered next to Ferris Bueller's Day Off. Absolute classic. Any fans of Arrested Development will be very happy to hear the masses laugh at Michael Cera.",
      "review_date": "2007-08-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It stays focussed but is a big bore of nonsense and crude unfunny content.",
      "review_date": "2007-08-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Stupid, vulgar, overlong, cliched and ridiculous film.",
      "review_date": "2007-08-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you're a male teen that loves vulgar movie. See this film. It's the best in it's class. With memorable quotes in every line, loveable characters in every scene, this is the must see comedy of the summer.",
      "review_date": "2007-08-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "makes you laugh the whole way through. i thought this movie was better than Knocked Up.",
      "review_date": "2007-08-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Funny, charming, sweet, and ridiculously (and hilariously) vulgar, Superbad is worth a see to anyone who enjoys dirty jokes with a dash of heartfelt emotion.",
      "review_date": "2007-08-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Extremely crass (I would say to its detriment at the beginning), this movie is nonetheless a classic. I believe it is the best movie in ever made in it's genre. Funny, smart, charming, and the jokes are very clever even if the premise Extremely crass (I would say to its detriment at the beginning), this movie is nonetheless a classic. I believe it is the best movie in ever made in it's genre. Funny, smart, charming, and the jokes are very clever even if the premise isn't. Nice ending. You must be able to enjoy extremely crass language to enjoy the clever humor in this movie. Go see it!",
      "review_date": "2007-08-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I agree with the San Francisco Chronicle's synopsis the most of what this movie is about, constant hilarity and a laugh a minute sheer fun! This is a a great buddy-adventure movie, it made me feel old and wish I was back in these kids I agree with the San Francisco Chronicle's synopsis the most of what this movie is about, constant hilarity and a laugh a minute sheer fun! This is a a great buddy-adventure movie, it made me feel old and wish I was back in these kids shoes! It has a heart beating amid all the vulgar, raunchy and potty-mouthed fun! Stay for the credits people if you have yet to see this great summer comedy!",
      "review_date": "2007-08-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The best movie on the year! I loved the performances, the story and of course, it was funny as hell. I've seen this 3 times already, and still laugh my ass off every time.",
      "review_date": "2007-08-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Brilliant film. I don't know what movie the negative reviewers saw, but it wasn't the one I saw that had the entire theater crying with laughter. Apart from \"Knocked Up\" I haven't seen a funnier movie in years. It's Brilliant film. I don't know what movie the negative reviewers saw, but it wasn't the one I saw that had the entire theater crying with laughter. Apart from \"Knocked Up\" I haven't seen a funnier movie in years. It's raunchy, nuanced, juvenile and deep all at the same time which should be completely impossible. Don't miss it.",
      "review_date": "2007-08-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "aside from the dream-like cops, the movie is quite realistic. its a 10 if the cops were more like, well, cops.",
      "review_date": "2007-09-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "After reading glowing reviews, I and my friends, all in high school, opted to see the movie. We were sadly disappointed at the crude content, and decided that this is what older people thought high school to be like, not what it was really After reading glowing reviews, I and my friends, all in high school, opted to see the movie. We were sadly disappointed at the crude content, and decided that this is what older people thought high school to be like, not what it was really like. It was awkward sitting through only part of the movie, and the funniest parts were when there was no &*^%%$. The easiest and funniest way to see this movie is on YouTube clips.",
      "review_date": "2007-09-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "AMAZINGLY funny movie! Don't believe the negative reviews people may post... this movie may be crude and uncouth quite a bit, but it works so well for it! You'll cheer for these guys... and you will laugh- a LOT!",
      "review_date": "2007-09-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The only reason I give it a 9 and not a 10 is because I was told it was comperable to Fast Times at Ridgemont High. I'm sorry this film is no Fast Times, it is still a great picture just not quite Fast Times great.",
      "review_date": "2007-09-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Really funny. Very different from the average white boys and their yearning to get laid because of the fabulously realistic style and perfect performances by very believable young actors. The cops are pretty funny as over the top slapstick also.",
      "review_date": "2007-09-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Highly overhyped and disappointing. It has it's moments that will make you laugh, but more often then not it falls flat. It's been done before, and much better. Can't stress how disappointed i was.",
      "review_date": "2007-09-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "As a high school senior this movie was the best comedy in my lifetime. That is of course with the exception of Tommy Boy.",
      "review_date": "2007-09-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Definitely a lot of laugh out loud moments. Very amusing, very funny, money well spent.",
      "review_date": "2008-11-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "You really have to see \"American Graffiti\" to completely appreciate this movie, it's very reflexive of it. This new style of language and set-ups blows most other comedies out of the water. One of the funniest movies I have ever seen You really have to see \"American Graffiti\" to completely appreciate this movie, it's very reflexive of it. This new style of language and set-ups blows most other comedies out of the water. One of the funniest movies I have ever seen that also leaves a great feeling after watching it.",
      "review_date": "2008-01-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "If you don't enjoy talk of sex or porn or in general high-school-boy discussion then don't see this movie, but if you do then check it out because it is easily the funniest movie of the year.",
      "review_date": "2008-01-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I loved this movie. It was like a Friday night out with you buddies as a teenager. Sure, it was a lot more outlandish, but hey, isn't that the point?",
      "review_date": "2008-02-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Everything about this film was amazing. don't listen to people who rate it lowly. they just think they're great because they didn't like it.",
      "review_date": "2008-03-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It was the best movie ever!!! I liked the \"superbad\" scenes!",
      "review_date": "2008-03-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Thank god this film was of pure excellence because the name could have provided critics with an insult, \"this film was super...baaad\" but its an amazing film, good work Rogen and Golberg.",
      "review_date": "2008-04-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It passed the time and provided some hilarious moments particularly in the first 30 minutes, but it dragged on too long, the cop scenes were not really that funny in the end. Compared to \"Road Trip\" this is comes a poor second.",
      "review_date": "2008-05-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "On most occasions I would not write a review on a movie such as this one, however this movie was different to me, but not amazing. Superbad is one of those movies that has a good amount of jokes in the dialog but isn't outrageously On most occasions I would not write a review on a movie such as this one, however this movie was different to me, but not amazing. Superbad is one of those movies that has a good amount of jokes in the dialog but isn't outrageously stupid. Although the title and trailer would suggest that the movie will be a really stupid movie that any teenager will enjoy, it is not. It actually has a good story and although the movie is filled with foule mouthed humor, the words are strung together in a way that won't offend even the most offend able person on this planet. It was a great pleasure to watch and although I rented it, this will be a movie I will purchase to see as many times as I wish. Superbad isn't really super bad... but it does strike a spot in my heart, and although it can't be compared to \"Fast Times At Ridgemont High\" or many others I could list, It doesn't need to compare because it isn't the same kind of movie... it's a love story.",
      "review_date": "2008-05-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is the funniest movie I have ever seen. Michal Cera is at his awkward best, Johnah Hill is hilarious, and Seth Rogen will have you laughing untilt the end. What makes this movie so great is that for it is exactly how high school kids This is the funniest movie I have ever seen. Michal Cera is at his awkward best, Johnah Hill is hilarious, and Seth Rogen will have you laughing untilt the end. What makes this movie so great is that for it is exactly how high school kids act and talk. It is the most quoatable movie ever, and is pure gold.",
      "review_date": "2008-08-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the funniest movies I have ever seen. Bought the movie, and every time its on Cable I cant turn it off",
      "review_date": "2009-06-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I thought this was a documentary of my life for parts of this movie. Oh yes I know what being a loser is like and I think Apatow does too, but he definitely isn't one anymore. This is a comic masterpiece. Such funny dialogue and overall I thought this was a documentary of my life for parts of this movie. Oh yes I know what being a loser is like and I think Apatow does too, but he definitely isn't one anymore. This is a comic masterpiece. Such funny dialogue and overall just incredibly hilarious.... best movie of all time!!! From the first scene on I did not stop laughing! I was actually exhausted from watching a movie.",
      "review_date": "2007-11-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It is the best teenage sex comedy since Porkys. and it is the best teenage comedy since American Graffiti.",
      "review_date": "2007-10-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "seriously, this movie is horrendously bad. the novelty of the crudeness wears off after about 10 minutes, and then you're just inundated with terrible dialogue for another hour and a half. completely worn out stuff. i wanted to like it. seriously, this movie is horrendously bad. the novelty of the crudeness wears off after about 10 minutes, and then you're just inundated with terrible dialogue for another hour and a half. completely worn out stuff. i wanted to like it. but it was so not good. kinda made me depressed that everybody else was cracking up all the time: made me think, oh my god, people are so terribly lame.",
      "review_date": "2007-11-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Overrated, was expecting something awesome but it seem more of a rip off of super troopers. Not another teen movie was a lot funnier then this. There was nothing smart or clever about this movie. Worse part is, guy's like them never get Overrated, was expecting something awesome but it seem more of a rip off of super troopers. Not another teen movie was a lot funnier then this. There was nothing smart or clever about this movie. Worse part is, guy's like them never get girls like those. If all the girls were nerdy it would be believable.",
      "review_date": "2007-12-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"Not another teen movie was a lot funnier than this.\" are you fucking serious!? i don't even know how to begin addressing such a ridiculous statement. Superbad is one of the funniest movies i have ever seen period, but it's \"Not another teen movie was a lot funnier than this.\" are you fucking serious!? i don't even know how to begin addressing such a ridiculous statement. Superbad is one of the funniest movies i have ever seen period, but it's definitely the kind of thing where you either get it or you don't. KEY POINT= IT'S NOT SUPPOSED TO BE BELIEVABLE, at least not in terms of the situations the characters get in. what makes the movie work is that the dialog and characters ARE believable, in and of themselves. Boom.",
      "review_date": "2007-12-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A brilliant comedy. It's almost as funny reading some of these reviews. Mark G!!! I think you missed the humor. Macho cops!? Um yeah, thats sort of the joke. And the cheesy sentiment! I think you missed something... I guess this movie A brilliant comedy. It's almost as funny reading some of these reviews. Mark G!!! I think you missed the humor. Macho cops!? Um yeah, thats sort of the joke. And the cheesy sentiment! I think you missed something... I guess this movie really demands a certain sense of humor. Some people just don't have it. Overall a great film for people who are not easily offended.",
      "review_date": "2007-12-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Bill Cosby once famously said that you don't have to swear to be funny. Superbad starts slowly, almost entirely to its insistence in having the most vulgar dialogue in recent movie history. It gets better (much better AND funnier) as Bill Cosby once famously said that you don't have to swear to be funny. Superbad starts slowly, almost entirely to its insistence in having the most vulgar dialogue in recent movie history. It gets better (much better AND funnier) as the movie goes on, when they move on from the obvious and lowbrow humor and actually put the characters through some truly funny scenarios. The cops are hilarious and the dynamic between the two friends is touching. This is a gem of a movie that is dressed up like an unfortunate piece of turd. I just wish more moviemakers would realize that they don't need the \"shock\" factor of predictable \"teen comedy\" crap. It's like hearing a dirty joke for the first time. It might make you giggle (when you're 12) because somebody said the \"F\" word, but after hearing so many of these, the dirty joke stops being funny and just seems dirty. Just like many people grow up from those antics, here's hoping that movie making from Apatow and others grows up as well, because they have the potential to make some truly funny stuff, without the smut.",
      "review_date": "2007-12-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The best movie ever if you are male and haven't yet lost your soul",
      "review_date": "2007-12-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Firstly, I loved this movie, mainly because I was expecting something crude (which it was) but stupid, something like the 40-year-old Virgin (which wasn't nearly as clever as it was stupid). Superbad is the opposite in this regard, as Firstly, I loved this movie, mainly because I was expecting something crude (which it was) but stupid, something like the 40-year-old Virgin (which wasn't nearly as clever as it was stupid). Superbad is the opposite in this regard, as while it still contained language that was probably even worse, jokes about terribly \"icky\" subjects such as periods, penises and penis drawings; it was original. Many people will say it was just like Knocked up, American Pie, etc. but I think it took the teen comedy genre down a much funnier path. I mean, the 40-year-old virgin and American pie relied mainly on \"cringe\" comedy, putting characters in situations that are funny because they are taboo or sexual (they are teen movies after all). While Superbad does use this type of comedy (hence the 8/10 instead of full marks), the larger laughs and more funny bits of the movie were completely original. I mean, penis drawings?! Mclovin?! It even had a (sort-of) moral at the end! The writing was brilliant, and for that reason, and possibly biased by my complete lack of faith in this movie prior to seeing it, I think it deserves a well earned 8/10. Also, to all reviewers who gave this 0/10 for being childish, vulgar, etc. What were you expecting? If you can't see through that, or can't understand why your cinema is erupting in laughter, then you should have known before you saw this that you wouldn't like it, so do yourself us a favour and don't watch these types of movie.",
      "review_date": "2007-10-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Superbad is Supergood Funny as hell the funniest high school movie. Or comedy for that matter. GO Apatow!",
      "review_date": "2007-12-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Had me laughing from start to finish. Definitely the funniest movie I've seen all summer. And like previous Apatow movies, ends on a very touching note where it shows that the underdog will often triumph. You'll be quoting lines Had me laughing from start to finish. Definitely the funniest movie I've seen all summer. And like previous Apatow movies, ends on a very touching note where it shows that the underdog will often triumph. You'll be quoting lines from it for days afterwards.",
      "review_date": "2007-08-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Unbelievably funny. In my opinion the funniest film of all time. That may be partially because I have had some of these exact conversations with my friends, but I honestly don't understand how anyone could not like it.",
      "review_date": "2007-08-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Hilarious!!! Definitely the funniest movie of this summer. so many priceless lines, and unforgettable moments. this is the kind of movie we will all remember in our senior years. WARNING, really not suitable for young children. but Hilarious!!! Definitely the funniest movie of this summer. so many priceless lines, and unforgettable moments. this is the kind of movie we will all remember in our senior years. WARNING, really not suitable for young children. but definitely for some parents to watch. haha, they will see what high school parties are really like. great movie!",
      "review_date": "2007-08-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Absolutely hilarious... best comedy I've seen in a long time. Far better then knocked up. The laughs were steady the whole way through and it never got too sappy. Great ending, short and sweet. Epic movie...this is the first movie I Absolutely hilarious... best comedy I've seen in a long time. Far better then knocked up. The laughs were steady the whole way through and it never got too sappy. Great ending, short and sweet. Epic movie...this is the first movie I will see twice in the theatre since sin city.",
      "review_date": "2007-08-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I enjoyed it although I found it uneven at times and a little longer than needed.",
      "review_date": "2007-08-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Sooo funny. Seth Rogen has brings it (he co-wrote it), and the 2 stars are just as insanely cast as everything Judd Apatow has ever done. Long live the John Hughes/Kevin Smith of the almost over decade. And hopefully, Judd Apatow won't Sooo funny. Seth Rogen has brings it (he co-wrote it), and the 2 stars are just as insanely cast as everything Judd Apatow has ever done. Long live the John Hughes/Kevin Smith of the almost over decade. And hopefully, Judd Apatow won't make a Jersey Girl or Knocked Up 2 to spoil it his reign anytime soon. Oh yeah, and this movie is freaking hilarious to the max!",
      "review_date": "2007-08-19",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 136,
  "genres": [
    "Comedy"
  ]
}