{
  "title": "The Diving Bell and the Butterfly",
  "rating": 8.3,
  "release_date": "2007-11-30",
  "genre": [
    "Biography",
    "Drama"
  ],
  "summary": "The Diving Bell and the Butterfly is the remarkable true story of Jean-Dominique Bauby, a successful and charismatic editor-in-chief of French Elle, who believes he is living his life to its absolute fullest when a sudden stroke leaves him in a life-altered state. While the physical challenges of Bauby's fate leave him with little hope forThe Diving Bell and the Butterfly is the remarkable true story of Jean-Dominique Bauby, a successful and charismatic editor-in-chief of French Elle, who believes he is living his life to its absolute fullest when a sudden stroke leaves him in a life-altered state. While the physical challenges of Bauby's fate leave him with little hope for the future, he begins to discover how his life's passions, his rich memories and his newfound imagination can help him achieve a life without boundaries. (Miramax Film)… Expand",
  "critic_reviews": [
    "The film is a masterpiece in which “locked-in” syndrome becomes the human condition.",
    "Schnabel’s movie, based on the calm and exquisite little book that Bauby wrote in the hospital, is a gloriously unlocked experience, with some of the freest and most creative uses of the camera and some of the most daring, cruel, and heartbreaking emotional explorations that have appeared in recent movies.",
    "Schnabel, screenwriter Ronald Harwood and Spielberg's great cinematographer Janusz Kaminski have found a way to take us inside Bauby's mind--his memories, his fantasies, his loves and lusts--transforming a story of physical entrapment and spiritual renewal into exhilarating images.",
    "Every performer in the international cast -- Seigner, de Bankole, von Sydow (magnificent as Bauby's father), and the late Jean-Pierre Cassel to name but a few -- completely disappears into each of their roles, which I think is as much a testament to Schnabel's talents as to theirs.",
    "The movie has done what those who've cherished the book might have thought impossible -- intensified its singular beauty by roving as free and fearlessly as Bauby's mind did.",
    "Amalric is extraordinary, creating a character literally without moving a muscle.",
    "You won't have a more viscerally emotional experience at the movies this year.",
    "The picture is so imaginatively made, so attuned to sensual pleasure, so keyed in to the indescribable something that makes life life, that it speaks of something far more elemental than mere filmmaking skill: This is what movies, at their best, can be.",
    "Director Julian Schnabel and screenwriter Ronald Harwood have performed a small miracle in adapting for the screen Jean-Dominique Bauby's autobiography The Diving Bell and the Butterfly.",
    "It is wonderful: a rhapsodic adaptation of a memoir, a visual marvel that wraps its subject in screen romanticism without romanticizing his affliction. It left me feeling euphoric.",
    "Thanks to Bauby's courageous and honest writing, and Schnabel's poetic interpretation, what could have been a portrait of impotence and suffering becomes a lively exploration of consciousness and a soaring ode to liberation.",
    "At the end we are left with the reflection that human consciousness is the great miracle of evolution, and all the rest (sight, sound, taste, hearing, smell, touch) are simply a toolbox that consciousness has supplied for itself.",
    "he Diving Bell and the Butterfly fuses experimental techniques with a highly accessible and sometimes humorous narrative; it’s deeply personal yet universal in its humanism.",
    "The adjective “inspirational” doesn't do justice to the quality of Schnabel's film.",
    "Schnabel's film is so steeped in the visual that it is surely the purest of cinema.",
    "The Diving Bell and the Butterfly provides an ecstatic lift for movielovers, despite the tragic subject.",
    "Moviegoers are turned off by depressing topics, yet \"Diving Bell\" supplies something film fans claim they want: pure escapism, the chance to experience extreme sensations virtually none of us will ever have.",
    "The most beautiful movie ever made about a man who could only move one eyelid -- almost dangerously beautiful.",
    "In a film that overwhelmingly avoids happy-faced pronouncements, this one sticks out.",
    "Schnabel's sleepy, drifty, at times morbidly funny film tackles something more ambitious, by getting into the head of someone who's trying to get out of there himself.",
    "Mathieu Amalric, best known as an arms dealer in \"Munich.\" In a role that strips him entirely of vanity and denies him virtually every expressive tool, Amalric makes a genuinely touching impression.",
    "In his memoir Mr. Bauby performed a heroic feat of alchemy, turning horror into wisdom, and Mr. Schnabel, following his example and paying tribute to his accomplishment, has turned pity into joy.",
    "Simultaneously uplifting and melancholy, suffused with an unexpected sense of possibility as much as the inevitable sense of loss.",
    "With the help of brilliant French actor Mathieu Amalric, Spielberg's longtime cinematographer Janusz Kaminski, and screenwriter Ronald Harwood (The Pianist), Schnabel has made a marvelous film that uses images with as much grace and flair as Bauby used words.",
    "Could easily have tipped over into melodrama, but Schnabel is too much an artist to let that happen; he realizes that in order to make his hero truly substantial, and not just sympathetic, he has to present him as an ordinary man making the best of extraordinarily lousy circumstances. By doing so he’s created a character we not only marvel at but identify with.",
    "The movie will wipe you out. Schnabel's previous two films (Basquiat, Before Night Falls) also focused on artists. But this is his best film yet, a high-wire act of visual daring and unquenchable spirit.",
    "He even calls the majestic view from one of the hospital landings his Cinecittà, after the legendary Italian film studio. The movie is a Cinecittà of the mind.",
    "The film is more than laborious eye-blinking - it's also dazzling visually, its potent imagery conjured by cinematographer Janusz Kaminski. But finally, Diving Bell is about something imperceptible: consciousness.",
    "The movie never falls into gushy moments of inspiration and Schnabel never tries to manipulate any particular response from the audience. We're left to make of it what we will.",
    "Most compelling in its attempts to re-create the experience of paralysis onscreen, gorgeously lensed pic morphs into a dreamlike collage of memories and fantasies, distancing the viewer somewhat from Bauby's consciousness even as it seeks to take one deeper.",
    "A poignant reflection on what it means to be alive and, visually, a true cinematic experience.",
    "Whereas the book was lyrical and moving, the movie is surrealistic and inventive.",
    "Take us on an indelible tour through the highest and lowest points of the human experience.",
    "By the end, The Diving Bell and the Butterfly achieves a victory over difficult material, but celebrating that fact doesn't preclude recognizing the story is not a natural for movies and remains an uneasy match.",
    "Far too often, though, The Diving Bell and the Butterfly feels grotesquely calculated, especially the more Schnabel ratchets up the inspirational platitudes of exactly the sort that Bauby--who maintained an acerbic sense of humor about his situation until the very end--would have despised.",
    "Still, somewhat shame-faced I have to admit that at some point in the film I began to hear a subversive voice whispering in my ear, and what it was saying was, \"Could you blink a little faster, pal?\""
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "I agree with the other negative reviews (of which there are far too few).....this is a very mediocre film about a  very unusual tragedy that happened to a rather dull and very successful bourgeois who edits a slick  fashion magazine......yes-I agree with the other negative reviews (of which there are far too few).....this is a very mediocre film about a  very unusual tragedy that happened to a rather dull and very successful bourgeois who edits a slick  fashion magazine......yes- he was very determined to fight back against his cruel illness....but where is the drama or the interest beyond this point ?......the film runs out of steam very early and director Schnabel really has no idea of what to do with the material.....also Dumas' \"The Count of Monte Cristo\" isn't really a jaw-dropping masterpiece as Bauby and the film and implies. Martin Pistorius had a similar condition and wrote a far more interesting book about it called \"Ghost Boy\".",
      "review_date": "2015-08-09"
    },
    {
      "review_title": null,
      "content": "I dont like many films. They bore me. I want real stories. The art is in the story-telling not the action. A good story is not one whose content is WOW. It's one which is well told. A good story teller can captivate you with tales of I dont like many films. They bore me. I want real stories. The art is in the story-telling not the action. A good story is not one whose content is WOW. It's one which is well told. A good story teller can captivate you with tales of how he does his grocery shopping. The plot of this film is simple. Man enters coma. Man tries to get better. Man writes book. The End. No guns. No fighting. No sex. Beautifully told. The French have a nack for producing films with a strong artistic bent. Beautifully shot. Dripping with philosophyical weight. This is one such movie. Every 5 minutes a new seed for thought is planted, allowed to flourish and cut down. I implore you to watch this film if you have a concentration span of more than 5 minutes. Typical of criticisms are responses like those ushered by the Time magazine reviewer where he \"began to hear a subversive voice whispering in my ear, and what it was saying was, \"Could you blink a little faster, pal?\" \" I cant help but notice the irony when the film questions our \"want it all, now\" culture by contrasting his life as the editor of a superficial magazine with one where he is forced to think. Indeed it is in this contrast that much character development lies. In subtleties rather than plotlines reminiscent of epic Shakesperean tragedies. Go see it.",
      "review_date": "2008-03-20"
    },
    {
      "review_title": null,
      "content": "Only someone with the creative vision as broad as Julian Schnabel could make a film this free about a man locked in his own body. Simply amazing...",
      "review_date": "2007-12-03"
    },
    {
      "review_title": null,
      "content": "The French drama film provides an exceptionally powerful message that nothing is as precious as our consciousness through a miraculous and inspirational story of a guy who lost almost all of his physical senses except for only one, hisThe French drama film provides an exceptionally powerful message that nothing is as precious as our consciousness through a miraculous and inspirational story of a guy who lost almost all of his physical senses except for only one, his consciousness. Despite how naturally the story progressed, the movie evokes such powerful inner subject of life that it is difficult not to be aware and realize the fact of how blessed we are to be born and be well at present time. An immensely inspirational film.",
      "review_date": "2012-06-18"
    },
    {
      "review_title": null,
      "content": "Schnabel nailed it.",
      "review_date": "2009-05-02"
    },
    {
      "review_title": null,
      "content": "This was not only the best film of 2007 but one of the best film of the century - no, of all time. It was beautiful, engaging, heartbreaking, uplifting, and funny. I loved this movie. It meant more to me than anything else released last This was not only the best film of 2007 but one of the best film of the century - no, of all time. It was beautiful, engaging, heartbreaking, uplifting, and funny. I loved this movie. It meant more to me than anything else released last year, and said a lot more about life, death, and what keeps us going. Because of this film, I now hate \"Million Dollar Baby,\" with its dehumanizing depiction of paralyzed people.",
      "review_date": "2008-05-07"
    },
    {
      "review_title": null,
      "content": "Long, uncomfortable and absent of pathos.",
      "review_date": "2008-01-20"
    },
    {
      "review_title": null,
      "content": "I often indulge in films that could be considered more artistic and independent, so I never thought I'd use the tern \"art-house\" in a negative manner. But, well, here goes: This film is a poorly made, utterly pretentious, art-house I often indulge in films that could be considered more artistic and independent, so I never thought I'd use the tern \"art-house\" in a negative manner. But, well, here goes: This film is a poorly made, utterly pretentious, art-house bore. While good cinematography and decent performances save it from being unbearable, Julian Schnabel (an Academy Award nominee and an Independent Spirit Award winner for directing this film) has NO idea how to construct a compelling narrative or create emotional attachment to characters. He's a painter, for god sake, exactly when did he earn the qualifications to tell us a feature-length story? In a flaw exhibited in earlier films of his such as \"Before Night Falls,\" Schnabel presents us a chronological blow by blow of an over-sentimentalized story without any eye for pace or beginning, middle and end. This creates a complete disconnect between us and the characters we are supposed to be empathizing with, and also creates a repetitive narrative structure that, in plain English, bores the living hell out of anyone who isn't just trying to like the movie cause it got a 92 on metacritic. See it, and then test out your acting skills as you try to find ways to agree with the embarrassingly enthusiastic reviews.",
      "review_date": "2008-02-24"
    },
    {
      "review_title": null,
      "content": "letter by letter is tedious beyond reason...instead of walking out,  of the theatre\rI sat there working out  faster  ways to communicate.\rThe reviewers that drew me into seeing this most boring movie of the year must themselves be lockedletter by letter is tedious beyond reason...instead of walking out,  of the theatre\rI sat there working out  faster  ways to communicate.\rThe reviewers that drew me into seeing this most boring movie of the year must themselves be locked\rinto the syndrome.\rin that situation...we do  have the game 20 questions (animal, mineral , vegetable .)",
      "review_date": "2008-01-13"
    },
    {
      "review_title": null,
      "content": "Half of this visually stunning but ultimately empty film is literally spent inside the head of a man suffering from \"locked-in syndrome.\" Ironically, the viewer never gets much of an idea of who he is as a person. The other characters are Half of this visually stunning but ultimately empty film is literally spent inside the head of a man suffering from \"locked-in syndrome.\" Ironically, the viewer never gets much of an idea of who he is as a person. The other characters are even more undeveloped. If you consider yourself a film geek you will love Diving Bell as it is truly a unique cinematic experience. If you want a satisfying story look elsewhere, perhaps to the book of the same title.",
      "review_date": "2008-02-04"
    },
    {
      "review_title": null,
      "content": "While many men might like to imagine that should they find themselves \"locked in\" they would be able to command a troupe of beautiful women who would devote their lives to selflessy caring for them and crying over them, the scenario While many men might like to imagine that should they find themselves \"locked in\" they would be able to command a troupe of beautiful women who would devote their lives to selflessy caring for them and crying over them, the scenario doesn't come across as realistic. It comes across as sentimental, sexist drivel. I haven't read the book but would be surprised if the scene where the wife \"translates\" his message for the lover without a word of complaint (but lots of silent tears) actually took place.",
      "review_date": "2008-04-04"
    },
    {
      "review_title": null,
      "content": "Breathtaking Visual and Dynamic Performance The Scaper and Butterfly is a powerful biographical film    .",
      "review_date": "2017-03-11"
    },
    {
      "review_title": null,
      "content": "For a story that is this unfilmable, Shnabel should be applauded at keeping the audience watching the entire time!",
      "review_date": "2008-03-02"
    },
    {
      "review_title": null,
      "content": "Best film of the year. Funny, moving, artful. I saw it at a screening a few weeks ago and can't get it out of my mind.",
      "review_date": "2007-12-01"
    },
    {
      "review_title": null,
      "content": "While the story itself is \"inspirational\" and \"incredible,\" I did not connect with the film. I understand the task of blinking out a book is insanely difficult and this man was brave and I am in awe of him. But he didn;t seem like that noble While the story itself is \"inspirational\" and \"incredible,\" I did not connect with the film. I understand the task of blinking out a book is insanely difficult and this man was brave and I am in awe of him. But he didn;t seem like that noble of a man in life ... abandoning his kids, putting Celine through that scene at the hospital when his mistress calls. Why didn't he blink out \"CALL BACK TOMORROW\" ?? And the first 20 minutes wer so disorienting with teh in and out of first person focus that I almost had to leave b/c I was physically uncomfortable. I understand that was the director's intent ... but it doesn't make it any less unpleasant.",
      "review_date": "2008-01-14"
    },
    {
      "review_title": null,
      "content": "Jean-Dominique Bauby (Mathieu Amalric) has given us Julian Schnabel",
      "review_date": "2008-12-22"
    },
    {
      "review_title": null,
      "content": "Really enjoyed this movie. It's probably not for every one. But it made me think. Found the scenes with his wife and children very moving.We with good health take so much for granted.",
      "review_date": "2008-02-04"
    },
    {
      "review_title": null,
      "content": "Wow, I was blown away by this movie. The Diving Bell and the Butterfly truly is an experience. The visuals are simply stunning. The characters presented are so real and humanistic. The material here IS depressing but you are immediately Wow, I was blown away by this movie. The Diving Bell and the Butterfly truly is an experience. The visuals are simply stunning. The characters presented are so real and humanistic. The material here IS depressing but you are immediately thrown into the mind of Bauby, who never asks for sympathy, yet never ignores the struggles he goes through. We got the rare opportunity to experience the real human that is in every one of us. Schnabel convinces us we ARE Bauby by using the camera in unique ways. It's interesting. a camera is essentially one eye on set and we are able to see through that one eye, the same one being Bauby's. The camera IS Bauby's eye, the only one he can see through. Absolutely fantastic.",
      "review_date": "2008-04-08"
    },
    {
      "review_title": null,
      "content": "Filmaking at its best...you feel as if you are inside of the main character experiencing all of his suffering. The scene where the doctor sews his bad eye shut is so unnerving that you want to look away but cannot. This film should have been Filmaking at its best...you feel as if you are inside of the main character experiencing all of his suffering. The scene where the doctor sews his bad eye shut is so unnerving that you want to look away but cannot. This film should have been nominated for best picture...it's that good.",
      "review_date": "2008-06-10"
    },
    {
      "review_title": null,
      "content": "A moving story, a good movie. Not exceptional anyway.",
      "review_date": "2008-06-09"
    },
    {
      "review_title": null,
      "content": "I rented this 3 times and always talked myself out of watching it because I didn't want to be depressed. I am so glad I experienced this. I didn't feel depression. I'm not quite sure what I felt. But i saw and felt things I I rented this 3 times and always talked myself out of watching it because I didn't want to be depressed. I am so glad I experienced this. I didn't feel depression. I'm not quite sure what I felt. But i saw and felt things I never have before. During the movie I found my body to be still and my breathing barely audible. It just does something to you. The direction, camera work, the script...all amazing. Absolutely stunning.",
      "review_date": "2009-02-25"
    },
    {
      "review_title": null,
      "content": "Utterly stunning. The Diving Bell and the Butterfly is a beautiful and powerful experience that should not be missed.",
      "review_date": "2008-11-15"
    },
    {
      "review_title": null,
      "content": "one of the best films i've ever seen, and the first 10 i've ever given on metacritic. profoundly moving. easily the best film I've seen all year. i never cared for schnabel as a painter, but as a filmmaker, he is outstanding.",
      "review_date": "2008-01-17"
    },
    {
      "review_title": null,
      "content": "The cinematography was noteworthy, at first showing us the world from the hero's viewpoint. There was some good acting, and it is especially good to see Max von Sydow in a non-villianous role. Yet somehow the movie left me cold. It The cinematography was noteworthy, at first showing us the world from the hero's viewpoint. There was some good acting, and it is especially good to see Max von Sydow in a non-villianous role. Yet somehow the movie left me cold. It isn't only because it was sometimes a very difficult film to watch. It just became too tedious and too repetitious (how many more times did we need to hear the alphabet recited), and I kept looking at my watch, waiting for it to end.",
      "review_date": "2008-01-18"
    },
    {
      "review_title": null,
      "content": "This was just a beautifully made film about a man who is physically immobilized by a rare form of stroke, whose brain is extremely active and sharp. When the film opens, we see the world through Jean-Do's eyes and mind then move on to This was just a beautifully made film about a man who is physically immobilized by a rare form of stroke, whose brain is extremely active and sharp. When the film opens, we see the world through Jean-Do's eyes and mind then move on to his family, friends and medical staff who care for him with flashbacks along the way. Great acting by the whole cast.",
      "review_date": "2008-01-05"
    },
    {
      "review_title": null,
      "content": "How do you make a painfully sad story and turn it into a beautiful life-affirming movie? Answer-Julian Schnabel. The Diving Bell and The Butterfly is the masterpiece everyone knew that Schnabel was destined to make after Basquiat and Before How do you make a painfully sad story and turn it into a beautiful life-affirming movie? Answer-Julian Schnabel. The Diving Bell and The Butterfly is the masterpiece everyone knew that Schnabel was destined to make after Basquiat and Before Night Falls introduced his work in a new medium. Once again he has cast the movie impeccably and cinematographer Janusz Kaminski films a good part of the movie through the one working eye of Jean-Dominique Bauby that proves he doesn't need Speilberg to get an Oscar nomination, which like Scnabels for Director and Ronald Harwoods for Screenplay, are totally deserving. The Diving Bell and the Butterfly is as close you'll get to \"Film as Art\" as you'll ever get.",
      "review_date": "2008-02-02"
    },
    {
      "review_title": null,
      "content": "A visually stunning movie that almost re-invents cinema as it deals with consciousness, what it means to be human and how we as viewers perceive this in the rendition offered by the film. The scenes early on after Bauby's paralyzing car A visually stunning movie that almost re-invents cinema as it deals with consciousness, what it means to be human and how we as viewers perceive this in the rendition offered by the film. The scenes early on after Bauby's paralyzing car accident, are a mixture of acerbic humour and heartbreaking moments. Gradually, as Bauby gets used to his condition, the film becomes more heartbreaking as seeing his children, speaking to his absent lover through his ex-wife. The decision to show the car accident that paralyzed him towards the end of the film is brilliant, leaving the viewer to contemplate the 'locked-in' syndrome for themselves.",
      "review_date": "2008-02-27"
    },
    {
      "review_title": null,
      "content": "A blow-by-blow account of cognitive activity from the abyss; that's the unprecedented achievement of \"The Diving Bell & the Butterfly\", a film that somehow manages to be a spectacle of unconditional love while remaining intellectually A blow-by-blow account of cognitive activity from the abyss; that's the unprecedented achievement of \"The Diving Bell & the Butterfly\", a film that somehow manages to be a spectacle of unconditional love while remaining intellectually rigorous. If you're in need of a clue as to why beautiful women fawn all over Jean-Dominique Bauby(Mathieu Amalric), aside from being the former editor-in-chief of Elle; the camera, his eye(the other eye suffered a death by non-irrigation), provides the answer. As Jean-Dominique's physician extols the cosmetic virtues of Henriette(Marie-Josee Croze) and Marie(Olatz Lopez Garmendia), the camera pans to an attending doctor, because Bauby knows women; even a professional woman wants to be thought of as pretty in his model-centric mind, and her exclusion from the doctor's pantheon of attractive medical professionals strikes him as callous and rude. If Jean-Dominique's eye could talk, he'd reassure her with some kind words; something along the lines of, \"You're no chopped liver, yourself, you lab-coated mademoiselle.\" Even though locked-in syndrome is a nightmare, Bauby fills his mindscape with images steeped in a learned man's knowledge of history, art, and dance. Don't feel sorry for him. Laugh at him. Jean-Dominique gives you permission when he refers to his face as being dipped in formaldehyde. \"The Diving Bell and the Butterfly\" isn't a love story, but it's a story about love. Save your tears for Celine(Emmanuelle Seigner). Nobody loves Bauby more than her, but she's in competition with his mistress(Agathe de La Fontaine) and translator(Anne Consigny).",
      "review_date": "2008-02-07"
    },
    {
      "review_title": null,
      "content": "How did this movie not get nominated for Best Picture? Incredible. Cinematography like you've never seen.",
      "review_date": "2008-03-16"
    },
    {
      "review_title": null,
      "content": "Wow, what a powerful and moving film. Excellent direction and performances, beautiful photography. It's not a film that you would easily forget. Very well edited. Exceptional.",
      "review_date": "2008-04-27"
    },
    {
      "review_title": null,
      "content": "If I was able to score 20 for the movie I would. It is quite simply the best movie ever made. It will leave you shattered, in love and thrilled to be alive. The performance of the father is worth the price of entrance ticket alone.",
      "review_date": "2008-05-12"
    },
    {
      "review_title": null,
      "content": "Brilliant on every level. One of the most effective and affecting films I have ever seen.",
      "review_date": "2008-05-04"
    },
    {
      "review_title": null,
      "content": "This movie is beautiful. This story makes you appreciate life more and as you see it, you cannot help but wonder if you are really taking full advantage of your own life. When you see someone in the state that the main character is in, you This movie is beautiful. This story makes you appreciate life more and as you see it, you cannot help but wonder if you are really taking full advantage of your own life. When you see someone in the state that the main character is in, you then realize that life is very fragile and that love, imagination, friends and family is all that really matters. Go see this movie and then take a look at your life for a minute and wonder what can be acheived with it starting tommorow. This flick is the best I have seen in a long time, I certainly hope you enjoy it as much as I did. I hope it can create a possitive change in your life.",
      "review_date": "2008-05-04"
    },
    {
      "review_title": null,
      "content": "The highly rated Diving Bell and the Butterfly deserved more in Cannes film festival and Oscar Academy.",
      "review_date": "2009-07-02"
    },
    {
      "review_title": null,
      "content": "I am quite convinced that this is one of the greatest movies I have ever seen. It does things that only movies can, and constitutes, above and beyond its other very many great virtues, an argument for the irreplaceability of this particular I am quite convinced that this is one of the greatest movies I have ever seen. It does things that only movies can, and constitutes, above and beyond its other very many great virtues, an argument for the irreplaceability of this particular art form. It is in the best sense an interpretation of Bauby's book, rather than simply an illustration. I left this movie with my mind in a swim and my emotions unleashed, rather than, as one might have expected given the theme of this movie, manipulated. Everything about this movie, every risk and every novel move, works. I doubt that I will see anything this good this decade.",
      "review_date": "2007-11-29"
    },
    {
      "review_title": null,
      "content": "Moving account of a man who only working body parts his is brain and left eye .told from his point of view. Remarkable acting from the entire cast.",
      "review_date": "2007-11-30"
    },
    {
      "review_title": null,
      "content": "this was a well-crafted movie with a lot of heart -- but does anyone else find the main character a bit of a chauvinist? He's one of those supposedly \"suave\" Frenchmen who are given licence to treat beautiful women like trash this was a well-crafted movie with a lot of heart -- but does anyone else find the main character a bit of a chauvinist? He's one of those supposedly \"suave\" Frenchmen who are given licence to treat beautiful women like trash because...he's French?!? And some women just seem to swoon for this type of guy. It's beyond me. But, in the end, I do like this guy's imagination, his relationship with his father is very touching, and he obviously loves his son. It's a great movie, I just wouldn't wish this creep on any woman I know.",
      "review_date": "2007-12-26"
    },
    {
      "review_title": null,
      "content": "The cinematography is striking, especially at first. the story unfolds slowly, but by the end, i was captivated and surprised that this was based on a true story.",
      "review_date": "2007-12-31"
    },
    {
      "review_title": null,
      "content": "Visually stunning movie that will leave you breathless. It's like watching a dream come to life.",
      "review_date": "2008-01-28"
    },
    {
      "review_title": null,
      "content": "While the story is moving and genuinely tragic, I found the movie plodding. Watching it did make me think of what I would want should the same fate find me. I'm not sure why he was so admired and loved by the hospital staff; the film While the story is moving and genuinely tragic, I found the movie plodding. Watching it did make me think of what I would want should the same fate find me. I'm not sure why he was so admired and loved by the hospital staff; the film did not make that clear.",
      "review_date": "2008-02-16"
    },
    {
      "review_title": null,
      "content": "The good in this film is outstanding and then there is the average direction and writing: when I say writing I mean the script. It just lacks development when it comes to the characters including the main one. Who is this guy? Okay he edits The good in this film is outstanding and then there is the average direction and writing: when I say writing I mean the script. It just lacks development when it comes to the characters including the main one. Who is this guy? Okay he edits a major magazine but show us more than that.. or at least show some depth to it.. and his lovers remain pretty oblique and 2 dimensional... When I first saw it I was blown away but in retrospect it was the story itself that got to me and Schnabel has done a mostly great job of depicting it.. Compared to most contemporary films it is pure gold.. No Country For Old Men? Give me a break! I don't know I just think it could have been so much better.",
      "review_date": "2008-02-27"
    },
    {
      "review_title": null,
      "content": "The perfect film. visually stunning and perfectly acted.",
      "review_date": "2008-06-28"
    },
    {
      "review_title": null,
      "content": "I wasn't wild about either Basquiat or Before Night Falls, so I was worried this film would disappoint, as well. Instead, it is an absolute masterpiece. If anyone out there is skeptical based on Schnabel's past work, don't be. I wasn't wild about either Basquiat or Before Night Falls, so I was worried this film would disappoint, as well. Instead, it is an absolute masterpiece. If anyone out there is skeptical based on Schnabel's past work, don't be. It's a beautiful film, and one that should be seen on the big screen. Go see it as soon as you can.",
      "review_date": "2007-12-19"
    },
    {
      "review_title": null,
      "content": "What surprised me about the film was that my response to it was primarily intellectual rather than emotional. It kept me thinking throughout, but strangely, except in a few places, it did not have me feeling as much as I would have expected. What surprised me about the film was that my response to it was primarily intellectual rather than emotional. It kept me thinking throughout, but strangely, except in a few places, it did not have me feeling as much as I would have expected. I think I was so amazed at the artistry that could get so creatively into the locked presence of the protagonist that admiration kept me from initiation. My reaction has puzzled me. There was just a distance that I can't describe or understand.",
      "review_date": "2007-12-23"
    },
    {
      "review_title": null,
      "content": "perfect, one of the best films about the human condition that I ever seen. The best preformance of the year belongs to Amalric.",
      "review_date": "2007-12-29"
    },
    {
      "review_title": null,
      "content": "Right from the very first scene when Jean-Do awakes from a coma to learn that he is paralyzed and unable to speak, we are pulled right into the fear, grief and loneliness that he is enduring.  But as he refuses to be a victim locked in hisRight from the very first scene when Jean-Do awakes from a coma to learn that he is paralyzed and unable to speak, we are pulled right into the fear, grief and loneliness that he is enduring.  But as he refuses to be a victim locked in his own body, we also share in his joy, love and hope and get a first hand account of his memories and imagination.  A truly resonant film that takes you on a journey into one man's unbreakable spirit.",
      "review_date": "2013-05-30"
    },
    {
      "review_title": null,
      "content": "The Diving Bell and The Butterfly is seriously one of the best films I have ever seen, and I am just going to disregard anything anyone is going to say about it. I have never felt so emotional when watching a movie, it is truly beautifullyThe Diving Bell and The Butterfly is seriously one of the best films I have ever seen, and I am just going to disregard anything anyone is going to say about it. I have never felt so emotional when watching a movie, it is truly beautifully miserable; Not to mention that the acting crew is brilliant.",
      "review_date": "2010-09-29"
    },
    {
      "review_title": null,
      "content": "The Diving Bell and the Butterfly paints a pretty picture that can be brought into a full length film. This inspirational feature is based on a true story about a man who becomes a vegetable for the rest of his life and somehow later canThe Diving Bell and the Butterfly paints a pretty picture that can be brought into a full length film. This inspirational feature is based on a true story about a man who becomes a vegetable for the rest of his life and somehow later can communicate by only blinking one eye, which leads him to pursue his imagination in writing a story. The motifs and symbolism in the film keeps you thinking at first, but once you analyze those motifs, you will understand perfectly as to why those themes are there, including to add the things from the title of the film to the actual plot itself. The use of the camera movement and spaces are natural and unique compared to a typical Hollywood flick, though beware of many extreme-close ups and canted angles in this film if you have a fear of claustrophobic spaces. However those chosen spaces and shots are used for a reasonable purpose. For artistic filmmakers alike, The Diving Bell and the Butterfly is a must recommend feature to view.",
      "review_date": "2011-11-26"
    },
    {
      "review_title": null,
      "content": "The Diving Bell and the Butterfly offers up a kind of harmonic tranquility that's just too good to resist. Watching it is like taking that hot shower after a long, debilitating day, and having that numbing ecstasy wash through your bones.",
      "review_date": "2012-11-17"
    },
    {
      "review_title": null,
      "content": "In \"The Diving Bell And The Butterfly,\" the pairing of Julian Schnabel's clever directorial skills and Mathieu Amalric's stellar acting chops results in a truly memorable and brave film with rich thematic threads.",
      "review_date": "2014-11-24"
    },
    {
      "review_title": null,
      "content": "Slow and boring movie. If you know many movies, you know the outcome and how the main protagonist will change. I wanted to end the movie after 40 minutes and should have done it.",
      "review_date": "2020-06-10"
    },
    {
      "review_title": null,
      "content": "The cinematography is so beautiful, you just wish that the plot went deeper into the questions about life it raises. The storytelling's simplicity does not mirror the visuals' ambiguity.",
      "review_date": "2014-03-31"
    },
    {
      "review_title": null,
      "content": "A visually spectacular powerhouse of a true story. One of the best films of the 21st century so far, although the very artistic the style isn't for a lot of tastes, people who are fine with the film's style will certainly have a great time!",
      "review_date": "2015-09-18"
    },
    {
      "review_title": null,
      "content": "The Diving Bell and the Butterfly brings a real-time experience for those who has ever wanted to join in the many adventures of this film and has ever wanted to know how much it takes for them to work on something based on something brilliant.",
      "review_date": "2016-05-04"
    },
    {
      "review_title": null,
      "content": "How does it feel to be trapped inside our own body? Honestly, I can't even imagine, it must be stifling. But this is precisely what this film addresses, thanks to a first-person testimony, adapting the autobiographical book written byHow does it feel to be trapped inside our own body? Honestly, I can't even imagine, it must be stifling. But this is precisely what this film addresses, thanks to a first-person testimony, adapting the autobiographical book written by Jean-Dominique Bauby, editor-in-chief of the fashion magazine Elle, in his last months of life, shortly after a stroke left him totally paralyzed, except for one single eye, which he used to communicate thanks to an ingenious and slow communication system.It is an impressive film, starting with the theme and narrative in the first person. Like him, we started the film without realizing what is going on, but gradually we go, with him, to discover the harsh reality. Bauby was, then, a man in the force of his life and with a reputation as heartthrob, adventurer and sportsman. This abrupt beginning immediately takes us to the environment of the film and to the desolate feeling of that man, who suddenly saw life disappear and confined himself to a bed, where he cannot even move or speak. He's devastating.One of the aspects that draws the most attention in this film is the masterful mastery of shooting techniques and camera angles to show us exactly what that man saw, and to put us directly in his skin. Taking advantage of all the cinematographic techniques, from close-up to blur, we can see through Bauby's only good eye, and that gives the film another kind of impact. The sets and costumes are extraordinarily realistic and give the film all the weight of a true story of suffering, but also of overcoming beyond what could be thought possible.The cast is very good. Being a French film, the language used is, of course, French, but I confess that I quite liked it, since several of the actors involved are regulars in English-speaking films, and it is pleasant to hear them in their native language. Mathieu Amalric is an excellent actor and was perfect in the role of Bauby, and in the way he expressed it, albeit in a static way, without moving, his voice being heard as if it were his thoughts. Emmanuelle Seigner and Marie-Josée Croze are also noteworthy for their positive work.",
      "review_date": "2021-03-30"
    },
    {
      "review_title": null,
      "content": "I found this movie fascinating, although a bit hard to watch in parts, mainly when they sewed up one of his eyes much against his wishes which, of course, they couldn't hear. You can only imagine how incredibly frustrating and upsetting itI found this movie fascinating, although a bit hard to watch in parts, mainly when they sewed up one of his eyes much against his wishes which, of course, they couldn't hear. You can only imagine how incredibly frustrating and upsetting it must have been, being stuck there in a bleak/bland hospital rather in the middle of nowhere, a town that he wasn't much keen on, not being able to communicate minus via a one blink for yes and two blinks for no system.He has speech therapists who are very enthusiastic about helping him 'speak' and communicate, although he initially doesn't share their enthusiasm, particularly after believing his physical state is temporary and then having to deal with the shock of seeing himself in a mirror. What makes this movie (or/and the book its based on) really work, I feel, is the dialogue - his sarcasm/wit as he narrates the movie, us as viewers hearing what he's thinking while paralysed. He's clearly a witty person and its interesting how he interprets things and his, sometimes particularly strong, reactions to the situations and environments he's placed in. As well as this, we learn alot about him prior to the accident that caused his stroke/paralysis, which of course helps us understand more about his viewpoints.It really is one of those movies that make you count your blessings and I found it interesting to see how the movie developed. Of course there's the worry that it'll be far too depressing, of course this isn't a movie that would strike many people as being very positive, although I can't help but feel like there is an element about it that is somewhat uplifting - the narration and his take on certain things brought me to this conclusion.Something I haven't mention so far is, of course, the fact that this movie is French, so of course you have to rely on subtitles in order to understand it (and yes, I'm sure it'd be possible to make some witty remark about being able to understand the movie in the same way as the characters in the movie struggle to communicate with the main character) but I didn't find this to be a big problem really. I've seen a few movies in other languages, this one I found the subtitles were somehow less tiresome and complicated to keep track of, if that makes sense. I suppose alot of it is visual based and less of it is dependent on catching (or more reading) every word that appears, I feel.The scenes that come from his imagination, (which is one of only 3 elements that he has the use of, the other two being his memory and his one remaining eye) are quite intriguing and I like how, as the movie continues, we learn little by little about him, not only his personal background but about his family and partner and also in the present time, we learn the different reactions from his different friends and relatives who learn of his condition and how both they and him react to this.To summarise, it is quite thought provoking and while it provides some uncomfortable viewing in parts, there is a nice element of optimism somehow which isn't in a patronising way, and I found it overall quite poignant, making a compelling and intriguing watch, so yes I'd say that it was a well made movie which I would recommend to others.",
      "review_date": "2021-11-21"
    },
    {
      "review_title": null,
      "content": "An engaging, heartbreaking film that is about the celebration of life over the sense of loss.",
      "review_date": "2021-01-26"
    }
  ],
  "num_reviews": 93
}