{
  "title": "The Bourne Ultimatum",
  "rating": 7.6,
  "release_date": "2007-08-03",
  "genre": [
    "Action",
    "Adventure",
    "Mystery",
    "Thriller"
  ],
  "summary": "All he wanted was to disappear.  Instead, Jason Bourne is now hunted by the people who made him what he is. Having lost his memory and the one person he loved, he is undeterred by the barrage of bullets and a new generation of highly-trained killers.  Bourne has only one objective: to go back to the beginning and find out who he was. (Universal)",
  "critic_reviews": [
    "Bravura doesn't begin to describe Greengrass's skill in mounting these complex sequences...This is, simply put, some of the most accomplished filmmaking being done anywhere for any purpose.",
    "The best action thriller of the year.",
    "The best blockbuster of the summer and the most accomplished thriller since, well, Supremacy. This is the payoff Bourne fans have been waiting for and the standard to which future blockbusters should be held.",
    "Feels fresher, leaner, and faster than any action movie in years.",
    "Mr. Greengrass knows how to do his job, and there’s no one in Hollywood right now who does action better, who keeps the pace going so relentlessly, without mercy or letup, scene after hard-rocking scene.",
    "Unstoppable fun.",
    "A great action movie, exhilarating and neatly crafted, the kind of picture that will still look good 20 or 30 years from now.",
    "The movie is one continuous, exhausting, exhilarating chase.",
    "A spectacular windup toy of a thriller -- a contraption made by an artist.",
    "Damon's minimalist style is key to why the Bourne movies have become an oasis from other blockbuster action fare.",
    "Few films combine a dense and tingling atmosphere with the headlong pacing and adventure of The Bourne Ultimatum.",
    "It's a relentless finale to the \"Bourne\" movie trilogy that raises the stakes, pumps up the action and develops old characters while introducing new villains",
    "Audiences will eat it up: This is a postmillennial spy-action movie pitched to a large international audience. You hardly need subtitles.",
    "A pounding, pulsating thriller that provides an almost constant adrenaline surge for nearly two hours.",
    "It says something about Paul Greengrass' directing style that he's able to make a movie as fresh and frank as The Bourne Ultimatum from a genre as moldy and bombastic as the spy thriller.",
    "This is the most satisfying thriller of the year, capping the Bourne trilogy.",
    "Director Paul Greengrass - who directed the superb \"United 93\" between the second and third \"Bourne\" installments - knows how to stage and edit bravura action sequences, generating almost unbearable suspense while deploying a superb cast.",
    "The movies are smart -- smarter than you, but not in an off-putting way. Their basic appeal, especially this new one, is that Matt Damon’s killing machine, Jason Bourne, is the cleverest man on earth. And we thrill to his sense of superiority.",
    "Both the most bewildering of the three movies and also the most brutally compelling.",
    "It's the rare action picture whose adrenaline-driven thrills neither overshadow the characters nor degenerate into cartoonish preposterousness.",
    "You sit there, and the action assaults you, and using words to re-create it would be futile. What actually happens to Jason Bourne is essentially immaterial. What matters is that SOMETHING must happen, so he can run away from it or toward it.",
    "It's an action picture that's been distilled and compressed to its tightest, barest, almost abstract essence, and it's absolutely thrilling.",
    "Bursting with so much amped-up energy, you may need to rest once it's finally done.",
    "The movie is thunderously exciting, but what makes it resonate is the wrenching story we read on Damon's face. We've waited all summer for a wild ride to grab us with more than jolts. Now it's here. Hang on.",
    "You come out of the movie both excited and soothed, as if your body had been worked on by felt-covered drumsticks.",
    "For action junkies, The Bourne Ultimatum will be like a hit of pure meth. It's bravura filmmaking in the jittery, handheld, frenetically edited Paul Greengrass style.",
    "Faster and, if possible, furiouser than its predecessors.",
    "Greengrass and co. may have made one of the best action movies in recent memory.",
    "The Bourne Ultimatum provides a lot more suspense and tension than \"Transformers\" could hope for.",
    "For once, I didn't feel cheated by an unresolved ending, but let's hope this is the end. Robert Ludlum wrote three Bourne novels, and this is one series that ought not to be dishonored by inferior sequels.",
    "Director Paul Greengrass downplays the movie's travelogue aspects by repeating the bobbly, hand-held camera style he used on \"The Bourne Supremacy.\" It's not a style I'm fond of.",
    "A thoughtful, satisfying action thriller.",
    "Most thrillers of this ilk have no qualms about going past the 120-minute mark, but I think Greengrass and company understood that overdoing it would turn mass excitement into massive headache.",
    "This adaptation of Robert Ludlum's third and last Bourne thriller doesn't have much story left, so director Paul Greengrass has to keep it moving all the time.",
    "A perfectly serviceable action movie…better than most, in fact. The entire premise is growing creaky, however, leading us to think we might want to leave this particular spy out in the cold a while, before he becomes completely tiresome.",
    "It’s not just vérité--it’s battlefield vérité; it triggers your fight-or-flight instincts.",
    "It's frenetic to the point of crazy while achieving a mark that barely exceeds mediocre.",
    "The movie is so surreal it's just not very involving. As an action extravaganza, it's busy but dull."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "The Bourne Ultimatum concludes the Bourne trilogy in style, with sharper camerawork, interesting characters, great action sequences, and Paul Greengrass at his finest.",
      "review_date": "2013-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Quite good, but it lost me a bit when Bourne went from a very smart, skilled human being to a near superhuman in the final car chase sequence. Much of the appeal of Bourne is the way he's bound by the normal rules of human existence: Quite good, but it lost me a bit when Bourne went from a very smart, skilled human being to a near superhuman in the final car chase sequence. Much of the appeal of Bourne is the way he's bound by the normal rules of human existence: he's very strong, fast, and smart, but he's not superhuman. That was stretched a bit here - how many high-speed crashes can he walk away from without a scratch? The movie was at its best when Damon and Stiles shared quieter moments - reminiscent of Damon and his love interest in the first movie. I wanted more of that in between the undeniably impressive action scenes. Still, while not quite as good as 1 or 2, it remains a great action film for thinking people, far superior to most in the genre.",
      "review_date": "2007-08-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Rarely in a trilogy does each movie improve on it's predacessor however in this case its a case of saving the best until last! The Bourne Identity and Supremacy where amazing but Ultimatum blows them out them water. It raises the bar andRarely in a trilogy does each movie improve on it's predacessor however in this case its a case of saving the best until last! The Bourne Identity and Supremacy where amazing but Ultimatum blows them out them water. It raises the bar and set's the standards for all spy, espionage, federal agent franchises - whatever you want to call them the likes of Bond, Bauer and McClane all have some serious work to do. This film picks up from the previous outing with Bourne escaping the authorities and on the run however he inadvertently becomes the target of Operation Blackbriar - a Treadstone upgrade whilst working with a London based journalist. Information from the reporter brings back new sets of memories for Bourne as he finally intends upon finding out about his dark past and who he truely is whilst evading a new ruthless breed of assassin leading to a phenominal finale in the final installment of a tremednous trilogy!  This film has everything action from start to finish, superb suspense and a real thriller once more showcasing just how good a recipe it is with Paul Greengrass directing and Matt Damon in awesome form as Jason Bourne.",
      "review_date": "2011-05-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I think that Bourne really is the new Bond. The Bourne Ultimatum was as action as action can get. The story was good, The cast was good, everything was good about this film.",
      "review_date": "2011-11-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Before I saw \"The Bourne Ultimatum\" I thought the Bourne Series was slowly changing something like the Bond Franchise. I guess not. The film offers the same thing, but this time with a trimmed script and pulverizing action sequences. I couldBefore I saw \"The Bourne Ultimatum\" I thought the Bourne Series was slowly changing something like the Bond Franchise. I guess not. The film offers the same thing, but this time with a trimmed script and pulverizing action sequences. I could see that this movie begs to differ, and I believe it.",
      "review_date": "2011-09-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Continuous action without a soul. Nothing there.",
      "review_date": "2007-10-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is made by its technical excellence. Action sequences are well choreographed and acting is great. What I'm getting sick of is the propagandizing of these films. I've been watching action thrillers since before Warren This movie is made by its technical excellence. Action sequences are well choreographed and acting is great. What I'm getting sick of is the propagandizing of these films. I've been watching action thrillers since before Warren Beatty's \"Paralax View\" and Redfords \"Three days of the Condor\". In every thriller movie it's the U.S. government which is the bad guy and all other third world terrorists are simply victims. I get the message Hollywood is selling. The problem is that it's a message written and produced by people who are on the fringes of paranoia. People still looking for the shooter on the grassy knoll and the real story behind Area 51. Is there anyone normal in Hollywood? You want a good action movie that's not loaded with Hollywood propaganda then go watch \"Tears of the Sun\" with Bruce Willis or \"Casino Royale\".",
      "review_date": "2007-08-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It is rarely the case that the third film in trilogies turns out to be the stand out film in the series, but this is the case for the 'Bourne Ultimatum'. There are constant thrills and fantastic action sequences. The acting is top class andIt is rarely the case that the third film in trilogies turns out to be the stand out film in the series, but this is the case for the 'Bourne Ultimatum'. There are constant thrills and fantastic action sequences. The acting is top class and the storyline is very cleverly written. This is sure to keep you on the edge of your seat and thoroughly deserves its 3 Oscars.",
      "review_date": "2010-10-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's safe to say that Jason Bourne is this generation's James Bond, only with better fighting.This film is a fast-paced, satisfying ending to a groundbreaking spy series of the 2000s. Filled with unexpected twists and Bourne's cleverIt's safe to say that Jason Bourne is this generation's James Bond, only with better fighting.This film is a fast-paced, satisfying ending to a groundbreaking spy series of the 2000s. Filled with unexpected twists and Bourne's clever planning, the Bourne Ultimatum keeps the viewer on the edge of the seat during the whole movie.The Moby Extreme Ways ending song is just perfect for this movie.",
      "review_date": "2011-11-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's a very fitting end to such an enjoyable trilogy. Solid acting by the cast, The movie is the perfect mix of action and story, The action itself is entertaining and fun to watch. It's simply a good film.",
      "review_date": "2013-01-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Bourne Ultimatum is easily the best of the three films and arguably the greatestt action film ever with its breakneck pace and incredible camerawork.",
      "review_date": "2013-03-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Yes, thrilling. But the hand-held camera was way over done. If you like herky-jerky fuzzy blurry action sequences where you can't see what's happening, this is your movie. Too bad too because it's great otherwise.",
      "review_date": "2007-08-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Bourne flees, fights and (narrowly) avoids traps. He's closely monitored by the CIA. Someone's dirty secrets are disclosed. The end. A lot of stuff moved nicely except for the camera.",
      "review_date": "2007-11-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I agree about the car chases. I personally think it was the most fun of the movie. Over all it did have it's dull moments.",
      "review_date": "2007-10-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Very boring. One chase after another. And absurd that Bourne could have so many close calls yet never be seriously hurt. This is just a \"chase em, bang em up\" movie with a little class.",
      "review_date": "2007-12-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A superb film rendered completely unwatchable. Great plot, great dialogue, great acting, great fight choreography, great car chases... all ruined by Greengrass' insistence upon the motion-sickness-inducing haldheld camera work that went A superb film rendered completely unwatchable. Great plot, great dialogue, great acting, great fight choreography, great car chases... all ruined by Greengrass' insistence upon the motion-sickness-inducing haldheld camera work that went out of fashion almost as soon as the Bourne Supremacy was released in 2004... Give it up Greengrass! It's sooooo last season.",
      "review_date": "2007-08-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Total rubbish!! Matt Damon is such a horrible and dumb actor!",
      "review_date": "2007-08-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "After the first 15 min. I was hoping everyone would die.They even managed to make New York look bad.",
      "review_date": "2007-08-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The first Bourne movie to bore me. I actually could not help but glance at my watch from time to time this entire film.",
      "review_date": "2007-12-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Although it could never be seen as a weak movie, there is no doubt that The Bourne Ultimatum is a bit of disappointment when compared to it's thunderous predecessor The Bourne Supremacy. A lot of elements are recycled from that movie albeitAlthough it could never be seen as a weak movie, there is no doubt that The Bourne Ultimatum is a bit of disappointment when compared to it's thunderous predecessor The Bourne Supremacy. A lot of elements are recycled from that movie albeit without the same the sense of furious despair that made Supremacy such a thrilling ride. The Bourne Ultimatum does have it's plus points in the form of some great action scenes; the battle in Morrocco and the London Waterloo escapade are both truly excellent sequences. Overall, The Bourne Ultimatum is a descent movie but it doesn't live up to it's classic prequel.",
      "review_date": "2012-08-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Another fantastic thrilling action film. All the things that made the previous two great come together and feel more cinematic and high-profile. I would highly recommend it even if you haven't seen the previous two. Great pace, action andAnother fantastic thrilling action film. All the things that made the previous two great come together and feel more cinematic and high-profile. I would highly recommend it even if you haven't seen the previous two. Great pace, action and story all the way.",
      "review_date": "2012-08-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The best of the Bourne series yet without a doubt.Great acting, great dialogue, great action scenes and the story was as interesting as the one from the other movies.",
      "review_date": "2016-07-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Wonderful sequel that has a lot of amazing action and fun that The Bourne gives us throughout the whole movie.",
      "review_date": "2018-05-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Aside from the twist at the end, its attempts to be political were a bit... eh. I dunno. (The twist at the end, however, made the whole trilogy, like, allegorical--very nice.) Otherwise, this is Class A action. Could've used a titch Aside from the twist at the end, its attempts to be political were a bit... eh. I dunno. (The twist at the end, however, made the whole trilogy, like, allegorical--very nice.) Otherwise, this is Class A action. Could've used a titch less shaky cam. But still, really good.",
      "review_date": "2007-08-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was, quite simply, one of the most exciting movies I've ever seen. A virtuoso display of shooting and editing. Amazing. As for you people who found it headache-inducing, maybe you should stay home and watch Merchant-Ivory costume pics.",
      "review_date": "2007-08-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don't understand why this movie was better reviewed than the first, which was by far the best of the three. The camera work is annoying, the actors seemed to mail in their performances and the CIA scenes were ridiculous. I still I don't understand why this movie was better reviewed than the first, which was by far the best of the three. The camera work is annoying, the actors seemed to mail in their performances and the CIA scenes were ridiculous. I still enjoyed it a little, but really only because I grew to care about the character in the first one.",
      "review_date": "2008-02-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best of the 3. A must see for any action fan. The shaking camera did get a little old at times. Bourne is the super spy of our time. Bye, bye 007.",
      "review_date": "2007-08-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Overall a strong film (best action film of the year), but I don't think that it equaled the excellence of \"Supremacy\". The Bourne-in-NY portion of the film wasn't as well done as the preceding portion...the element of realism that Overall a strong film (best action film of the year), but I don't think that it equaled the excellence of \"Supremacy\". The Bourne-in-NY portion of the film wasn't as well done as the preceding portion...the element of realism that makes Bourne such a compelling hero was done away with completely with some of the stuff he was walking away from during the NY act (car falling backwards off a roof; the chase-ending car accident; the 10-story leap into the river). Also, was it just me or did the car chase end in exactly the same way as it did in \"Supremacy\", with one car t-boning the other into a concrete divider? The bike escpae in Tangier was much stronger. [***SPOILER***] Finally, I just felt that Pam Landy's actions in handling the Blackbriar report seemed out of character...I could have seen if she had gone somewhere else within the government (like Jack Ryan did at the end of Clear and Present Danger) to bring down the program, but proclaiming that \"this is not what I signed up for\" and going to the press seemed ridiculous. A couple of other things that cost this movie some points: 1) note that in the end of \"Supremacy\", when it shifts to NY, it's clearly not winter as was depicted during the NY portion of \"Ultimatum\"...some continuity would have been nice; 2) Bourne being chased on rooftops in Tangier by local police...where have we seen that before? Oh yeah...in The Living Daylights, a 007 film. As well done as that act was, it lacked some originality. Overall, very good espionage film, but could have been great if the NY act had been better.",
      "review_date": "2007-09-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "So action pact thrilling and insightful must see!",
      "review_date": "2007-09-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "How anybody can give it less than \")\" is beyond. You ask for logic and realism ín an action movie? Come on. The scene in the London railroad station just blew me away. So did the scene over the rooftops of Tanger. This is first class How anybody can give it less than \")\" is beyond. You ask for logic and realism ín an action movie? Come on. The scene in the London railroad station just blew me away. So did the scene over the rooftops of Tanger. This is first class and has never been shown better, period. Who cares for logic, the whole James Bond series would have been produced!",
      "review_date": "2009-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film sets the standard for action films in the 21st century. Damon's minimalist style coupled with director Greengrass's au naturale style are a virtuoso combination. The Bourne Ultimatum (and the Bourne series for that This film sets the standard for action films in the 21st century. Damon's minimalist style coupled with director Greengrass's au naturale style are a virtuoso combination. The Bourne Ultimatum (and the Bourne series for that matter) is to the current Bond franchise what Batman Begins is to the old Batman franchise (Batman, Batman Forever, Batman and Robin, etc.). There is a clear difference in the quality, believability and style between them. It is refreshing to watch this film both because film-goers can now expect more from action films, and because (hopefully) lesser type action films will become less common because Ultimatum has raised the bar. A professional reviewer commented that after this final Bourne film, no other Bourne films should be made for two reasons-- 1) because Ludlum wrote only three books in the series, and 2) because inferior sequels shouldn't serve to denigrate the excellent job Ultimatum did to end the series. Prior to watching the film I agreed with this because I thoroughly respect and enjoy Ludlum's work (the initial reason I came to watch the first and subsequent Bourne films). But after watching Ultimatum, I must confess I've changed my mind simply because it would be a sizable loss for film-goers and film-makers alike if we all cannot see many more superbly made films such as Ultimatum.",
      "review_date": "2007-11-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film, although highly praised, still managed to come out under-rated. Its not often that an action flick is elevated to art. What makes the Bourne Ultimatum so special is that it does it effortlessly. Nahhhh Strike all the above... I This film, although highly praised, still managed to come out under-rated. Its not often that an action flick is elevated to art. What makes the Bourne Ultimatum so special is that it does it effortlessly. Nahhhh Strike all the above... I JUST LOVE THIS FILM!!!",
      "review_date": "2007-10-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was overrated. I enjoyed Bourne #1 and 2 better. This was supposed to be the big ender for Jason Bourne's story, unless the director is planning a fourth film! Then I hope it's much better. Still, this is a great choice if This was overrated. I enjoyed Bourne #1 and 2 better. This was supposed to be the big ender for Jason Bourne's story, unless the director is planning a fourth film! Then I hope it's much better. Still, this is a great choice if you're looking for a tense action film this summer.",
      "review_date": "2007-08-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The same manic handheld camerawork that was prevelant in supremacy reigns here, but for some reason it works better or maybe i've succumbed?  The \"where it all began\" flashback sequence that popped up throughout the whole movie shouldThe same manic handheld camerawork that was prevelant in supremacy reigns here, but for some reason it works better or maybe i've succumbed?  The \"where it all began\" flashback sequence that popped up throughout the whole movie should have been condensed.  That aside, this is a good action thriller worth seeing at some point.",
      "review_date": "2007-08-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Good ending for the trilogy! Some parts are not logical, but, hey, it's just a movie, compared with other crappy action films, Jason Bourne rcoks!",
      "review_date": "2007-08-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It really could have been an excellent movie. The camera work, by itself, ruined it for me. I had to spend all my time trying to figure out what was going on instead of appreciating the movie. Some of the shots were just stupid (Over half It really could have been an excellent movie. The camera work, by itself, ruined it for me. I had to spend all my time trying to figure out what was going on instead of appreciating the movie. Some of the shots were just stupid (Over half the screen black from an out-of-focus person, the camera peeking over their shoulder), and the others were so shaky that it really detracted from the action. The action was excellent if you could actually make out what was happening. Overall, an excellent movie absolutely destroyed by the director.",
      "review_date": "2007-08-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Engrossing and satisfying despite some implausible moments that scoff at the laws of physics. If you liked the first two, you'll like this one. The way the final scene of \"Supremacy\" is woven into this movie is ingenious.",
      "review_date": "2007-08-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Not as good as the Identity, better than the Supremacy, this was a fun, thouroghly enjoyable Euro-spy Action flick. IMO, Greengrass should tone down the flashy, constantly moving camera tricks a bit...or maybe I just sat too close!",
      "review_date": "2007-08-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Like Supremacy, the challenge is to try and see what is going on through the continuous camera movement. The camera is even being jerked around when filming a computer screen. Now picture what the camera is doing in a fight scene. Honestly, Like Supremacy, the challenge is to try and see what is going on through the continuous camera movement. The camera is even being jerked around when filming a computer screen. Now picture what the camera is doing in a fight scene. Honestly, it would be easer to make sense of a dolphin via critter-cam than the cinematography in this movie. It's a shame because it is a great story.",
      "review_date": "2007-08-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Excellent story, non-stop action. Sets the Gold Standard for action, suspense thrillers. Superb cast, direction, camera work. I remember taking a breath at the start of the movie and another one an hour and fifty five minutes later when it ended.",
      "review_date": "2007-08-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don't see how people didn't like this movie. It was suspenseful, action packed, and sometimes even funny. Best action movie of the year.",
      "review_date": "2007-08-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Action packed till the end. Definitely the best out of the three. Go see it, just for the sake that its one of the best movies of the year.",
      "review_date": "2007-08-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I had to sit in the far back rows as I am prone to motion sickness and director Paul Greengrass' camera is prone to motion. But the story, direction and acting are all top notch. Matt Damon is a total badass and Julia Stiles is I had to sit in the far back rows as I am prone to motion sickness and director Paul Greengrass' camera is prone to motion. But the story, direction and acting are all top notch. Matt Damon is a total badass and Julia Stiles is surprisingly great. There are a couple of clunky lines here and there; luckily Matt Damon is terse throughout. Brilliant intertwining of the previous films and taut, dizzying action make this film one of the summer's best.",
      "review_date": "2007-08-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Good but not great. Almost a replay of 2: 'something happens to suck Borne back in; he makes the CIA agents look bad - beats up a bunch - but doesn't kill any! - cool vehicle chases... And the two cheap shots at the current Good but not great. Almost a replay of 2: 'something happens to suck Borne back in; he makes the CIA agents look bad - beats up a bunch - but doesn't kill any! - cool vehicle chases... And the two cheap shots at the current Administration (won't give them away but anyone with a 3 digit IQ should have caught them) were pathetic.",
      "review_date": "2007-08-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The only reason I am not giving this exciting film a 10 is that it is confusing at spots, particulalry when it tries to fill in the neophytes on what has happened in the previous two films in the franchise. Let 'em go back and rent the The only reason I am not giving this exciting film a 10 is that it is confusing at spots, particulalry when it tries to fill in the neophytes on what has happened in the previous two films in the franchise. Let 'em go back and rent the other two. It's like picking up the third Harry Potter book and expecting to know what's going on. I was especially confused by the reprise of the end of the SUPREMACY just before the climax of the ULTIMATUM, i.e. the \"You should get some sleep, Pam, you look tired\" conversation. Can anyone explain why that scene was repeated?",
      "review_date": "2007-08-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is another great Bourne film. Lots of twists & turns, thinking and rethinking, and success is always determined by his smarts, aggressiveness, action and luck. The main character is not arrogant, but gritty, outnumbered and barely This is another great Bourne film. Lots of twists & turns, thinking and rethinking, and success is always determined by his smarts, aggressiveness, action and luck. The main character is not arrogant, but gritty, outnumbered and barely surviving. I think we all see ourselves like this in some ways. Love this series.",
      "review_date": "2007-08-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The best Borne movie to date! You will not be disappointed!",
      "review_date": "2007-08-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I think Matt Damon is a great actor, and no one else could have pulled these movies off better them him!!!",
      "review_date": "2007-08-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best of the trilogy this movie was just amazing. but what was up with the camer-man with heroine relapses I couldn't see a thing he was shaking so much made it kinda hard to see what was happening but aside from that the movie was Best of the trilogy this movie was just amazing. but what was up with the camer-man with heroine relapses I couldn't see a thing he was shaking so much made it kinda hard to see what was happening but aside from that the movie was incredible I want to see it again already and I just saw it yesterday.",
      "review_date": "2007-08-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Could have been a 10 except for the camera work, which was some of the worst I've seen in years. It took away from a great movie.",
      "review_date": "2007-08-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fast-paced, but without any credibility. Damon is an unengaging killing machine, Stiles is fluff, and not very attractive fluff at that. The entire film has the entire CIA staff on high alert over nothing but a few CIA killings, as if that Fast-paced, but without any credibility. Damon is an unengaging killing machine, Stiles is fluff, and not very attractive fluff at that. The entire film has the entire CIA staff on high alert over nothing but a few CIA killings, as if that would shake them up a lot. The cast in front of the camera could have used a few Red Bulls to bring more life to the screen. The action scenes are well done, but I found myself completely not caring about any of the characters, from the fairly innocent ones to the most rabidly guilty ones.",
      "review_date": "2007-08-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "-I liked the movie but didn't think it was as good as the first two. I think that with the shaky camera it works and doesn't work, depending on when it's used. In fight and action scenes it's great, but during normal -I liked the movie but didn't think it was as good as the first two. I think that with the shaky camera it works and doesn't work, depending on when it's used. In fight and action scenes it's great, but during normal conversations between characters it becomes cumbersome. Those who thought they shaky camera worked are correct, but so are those who say it didn't. It doesn't need to be in every scene. Identity didn't use it and it was a great movie. What ticked me off was when I'd have the back of some character's head covering 90 % of the screen and all I see is gray or black (if someone can give me a reason that this \"technique\" was absolutely necessary I'd be happy to listen). -The story was thinner this time (a lot thinner) and it was more action-oriented, which is great for most action movies with stupid plots, but with the Bourne series we expect a solid, intriguing story. -I really wanted to love it as much as the first two movies but was a bit disappointed. The ending was great (linking it back to the first movie with Bourne in the water and his rebirth, etc). But really, the only thing this movie was about was Bourne getting the last of his memory back and finding out what Blackbriar or whatever its called was. That's all he's after in this movie, but one plot element can't sustain a two-hour plus movie. -The action and chase scenes were good (nothing as spectacular as Identity's) and it's always nice to see Bourne outsmarting the entire US intelligence agencies (seriously, I'm not being sarcastic: it's not very believable and a bit cliche, but it's still fun to watch). -I wanted to really like the movie, but had to grudgingly admit it didn't live up to my high expectations.",
      "review_date": "2007-09-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If you've seen either of the other two Bourne movies, then you've already seen this one. I was bored to tears.",
      "review_date": "2007-09-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Extremely enjoyable but the plot left room for sequel.",
      "review_date": "2007-09-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great film in the \"Bourne\" Trilogy---I might actually rate it as the best of them. Greengrass and Damon really make this film--but Greengrass probably deserves a huge chunk of the credit. The action/suspense is very satisfying though the Great film in the \"Bourne\" Trilogy---I might actually rate it as the best of them. Greengrass and Damon really make this film--but Greengrass probably deserves a huge chunk of the credit. The action/suspense is very satisfying though the dialogue isn't the best (but it's spar, so it doesn't distract too much). The hand-held camera works well for most of what it's used for though I did get too jarred in the final car scene where he keeps the camera at the level of the headlights. I had to avert my eyes---which, honestly, almost never happens--maybe the Blair Witch project was the last time I had to look away from too much camera shaking/movement. I loved the end and was very glad it didn't feel dragged out or too long---at 2 hours, it's still tightly paced/edited--which also describes Damon's performance. As cinematic as these stories/films are--Damon is absolutely credible--he's what you think of in terms of special ops agents--something very sparse and efficient about him. This is definitely a must see in the theater and probably worth owning on DVD as it's just a great/entertaining film to watch (repeatedly).",
      "review_date": "2007-09-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I tried reading Bourne Ultimatum long before even Bourne Identity came to the silver screen and even then it kept putting me to sleep and never finished the book. The movie was, fortunately, better than the book but it still missed that I tried reading Bourne Ultimatum long before even Bourne Identity came to the silver screen and even then it kept putting me to sleep and never finished the book. The movie was, fortunately, better than the book but it still missed that \"something\" that made all the other Bournes so thrilling to watch. I admit it was tiring having to keep focused with all the jiggly camera work and the plot still remained somewhat fuzzy until the very end, and even then it wasnt anything shocking or jaw-dropping. The action and stunt work is still top-notch but an overall let down of the trilogy!",
      "review_date": "2007-09-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Watching this movie I couldn't tell if I was watching the first movie or the latest. If you have seen the first movie in this series then there really is no need to see the second or third because it is just more of the same and nothing new.",
      "review_date": "2008-01-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Has the majority of the film community turned completely into dross action junkies? In my opinion this film is the least of the Bourne trilogy. This entry provides a barely adequate end to the series. The frenetic action is not an adequate Has the majority of the film community turned completely into dross action junkies? In my opinion this film is the least of the Bourne trilogy. This entry provides a barely adequate end to the series. The frenetic action is not an adequate substitute for the lack of interesting human interactions. Julia Stiles is wooden and her brief interactions with Bourne are bland. Let's not encourage this kind of movie making where crashing cars trumps real human interactions.",
      "review_date": "2007-12-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Movie is almost all energy, with too little substance. I would have happily done without some of the action, in exchange for more plot and character development. Actually, I could have done with less action, just to have Matt Damon come off Movie is almost all energy, with too little substance. I would have happily done without some of the action, in exchange for more plot and character development. Actually, I could have done with less action, just to have Matt Damon come off more as a person, rather than some indestructible superman. Damon only does about 5 minutes of actual acting in this movie, and spends the rest of the movie either running around, or beating people up. I am also not a big fan of the jiggerly hand-hold camera technique, which are now so popular in action movies, and which this movie does to an extreme. Also, I am getting tired of the whole Jason Bourne character and concept. It was raw and fresh it the first movie, but has grown kind of stale. It might help if Matt Damon was better in the role. And he 's capable enough in it. I can't say he's bad in it. But I also can't say he's ever been exceptional in it. I can't say the role fits him like a glove, like you could say about Sean Connery/James Bond, Johnny Depp/Captain Jack Sparrow, Harrison Ford/ Indiana Jones, Mel Gibson/Marty Riggs, Bruce Willis/the die hard movies. If Matt Damon were replaced for Bourne Identity 4, I don't know that anyone would be that bothered, except for big Matt Damon fans. Still, if all it takes to entertain you are action movies stuffed with plenty of action, and which are not mind numbingly dumb, this should keep you entertained.",
      "review_date": "2007-10-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The problem with The Bourne Ultimatum -- and the other Bourne films for that matter -- are not in the films themselves, but in their PG-13 ratings (or 12A, in my British case). What this family-friendly rating implies is that there The problem with The Bourne Ultimatum -- and the other Bourne films for that matter -- are not in the films themselves, but in their PG-13 ratings (or 12A, in my British case). What this family-friendly rating implies is that there won't be any scene so intense as to frighten or jolt you out of your seat. For example, if Jason Bourne points a gun directly into a man's face, the cynic in me says, \"well, of course he",
      "review_date": "2007-10-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A good show, I will get the dvd. A lot of hand held camera action shots in places that did not need all that camera movement...Matt Damon is one cool dude. Excellent fight scenes & car chase/crash scenes. Hard to remember a dull moment in A good show, I will get the dvd. A lot of hand held camera action shots in places that did not need all that camera movement...Matt Damon is one cool dude. Excellent fight scenes & car chase/crash scenes. Hard to remember a dull moment in this movie. Nice ending. We want more...",
      "review_date": "2007-08-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "As far as the spy thriller genre is concerned, you simply can't get any better. Two thumbs up to a brilliant director and a wonderful cast of exceptional actors.",
      "review_date": "2007-08-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "anyone who gave this movie less then 5 must be a labotimized zombie,i gave up chewing my nails last year but could not stop through entire pic and you are always  cheering on bourne great action and locals and i would rather take the hyperanyone who gave this movie less then 5 must be a labotimized zombie,i gave up chewing my nails last year but could not stop through entire pic and you are always  cheering on bourne great action and locals and i would rather take the hyper realism of hand held then seamless boring cgi effects anyday",
      "review_date": "2007-08-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Well worth your time and hard earned dollars to see this film. The action movie of the summer and I can only hope the series continues with Bourne Legacy and Bourne Betrayal. I can only guess that critics of the Wash Post never made it to Well worth your time and hard earned dollars to see this film. The action movie of the summer and I can only hope the series continues with Bourne Legacy and Bourne Betrayal. I can only guess that critics of the Wash Post never made it to the film as they apparently do often.",
      "review_date": "2007-08-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I enjoyed the story, but the direction really got in the way. I should have looked up the director before going. This third part was directed by Paul Greengrass, who also directed The Supremacy. My only real complaint with Supremacy was the I enjoyed the story, but the direction really got in the way. I should have looked up the director before going. This third part was directed by Paul Greengrass, who also directed The Supremacy. My only real complaint with Supremacy was the shaky-camera style which made it nearly impossible to see what was happening during fight scenes. Unfortunately, Greengrass has employed this style throughout The Ultimatum. From now on I'll make it a point to monitor his upcoming movies on imdb, so that I might never again make the mistake of seeing one.",
      "review_date": "2007-08-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Say what you like about the camera work, this movie tops both of it's predecessors and even generates a few smiles along the way as you see Bourne putting the CIA in its place. There was a portion that seemed a tad preachy, but I almost Say what you like about the camera work, this movie tops both of it's predecessors and even generates a few smiles along the way as you see Bourne putting the CIA in its place. There was a portion that seemed a tad preachy, but I almost expected it. Overall, very good. Especially if you liked #1 and 2.",
      "review_date": "2007-08-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Rather over-rated by the critics. Even a \"thriller\" needs to slow down the action occasionally; non-stop car chases and fights tend to get a little boring after a while. Where is the characterization? A little humor and/or romantic interlude Rather over-rated by the critics. Even a \"thriller\" needs to slow down the action occasionally; non-stop car chases and fights tend to get a little boring after a while. Where is the characterization? A little humor and/or romantic interlude would have helped. \"The Bourne Identity\" was far and away the better movie.",
      "review_date": "2007-08-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It was better than the first two. The pace and action were fantastic. I was not disappointed.",
      "review_date": "2007-08-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Good flick, but somebody should buy Paul Greengrass a tripod.",
      "review_date": "2007-08-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Excellent, action-packed, pulse-pounding, expertly directed, well acted... with characters you actually care about, and a plot that mirrors our current national obsession with security. The Bourne Trilogy and Matt Damon are worth catching!",
      "review_date": "2007-08-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Easily the best action film of the year, if not the decade. Matt Damon managed to create a realistic, well-rounded character, which is pretty hard to do when you have very little dialogue with which to do so.",
      "review_date": "2007-08-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What can I possibly say that has yet been stated about the third (and possibly final?) installment in the 'Bourne' franchise? Well, if I felt compelled to abash and debase the film",
      "review_date": "2007-08-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I thought the first two where great around Bourne psychee. This one is just an action movie, pretty repetitive with no hero you want care for.",
      "review_date": "2007-08-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "After all the accolades heaped on this film by the critics, I could not have been more disappointed. What a waste of potentially intelligent and interesting plot material. Critics were obviously impressed by all the shaky handheld camera After all the accolades heaped on this film by the critics, I could not have been more disappointed. What a waste of potentially intelligent and interesting plot material. Critics were obviously impressed by all the shaky handheld camera work, the grainy desaturated cinematography and the half-second cuts. For me, these elements just served to cover up the thin plot. And the nonstop running just bored me ( as opposed to the running in The Fugitive, a far better film). If this is as good as an action thriller gets, then maybe it's time we stopped dumming ourselves down and began demanding intelligent plots with deep characerisations even in our action films instead of letting action thrillers become nothing more than a theme park ride.",
      "review_date": "2007-08-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fast-paced in the best possible way. Yes, there's flash and discord through most of the shots, but that's what makes the film sing.",
      "review_date": "2007-08-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Absolutely suspenseful, big time thrilling movie and amazing. I am clueless why some people don't like this movie?",
      "review_date": "2007-08-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Sort of a summary of the previous 2 movies. Not as violent either.",
      "review_date": "2007-08-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's an excellent action film. This film is fast paced. You really have to pay attention to what you are watching. The rough feeling of cuts and angles seems very natural for this film. Some aspects of the film feels like a typical It's an excellent action film. This film is fast paced. You really have to pay attention to what you are watching. The rough feeling of cuts and angles seems very natural for this film. Some aspects of the film feels like a typical Hollywood and some aspects dont feel like Hollywood, whch, in my opinion, is the ultimate combination for the masses. I understand the constant use of handheld cam technique is a good way to produce unsettling emotions out of the audience, but I got sick of it, litterally. I felt a hint of motion sickness from overdosing handheld cam shots. It's not a serious problem, but I don't recommend watching this in the front seat. I just miss good ol' long takes after watching this film. I think it had too many cuts.",
      "review_date": "2007-08-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "In a year thats been the 3rd in a series for every other movie released, The Bourne Ultimatum is the first one that leaves you actually wanting there to be a fourth! The Bourne series is the only trilogy that has progressively gotten better In a year thats been the 3rd in a series for every other movie released, The Bourne Ultimatum is the first one that leaves you actually wanting there to be a fourth! The Bourne series is the only trilogy that has progressively gotten better with each installment and the only one that has stayed true to its course without blowing the works trying to out-do its preecessors. Matt Damon is perfect as Jason Bourne and carries the movie without relying on gimmicks like Johnny Depp does in the Pirates franchise, and unlike the Bond series, they will never be able to find a replacement for Damon. I know Ultimatum is supposed to be the last Bourne movie, but atleast we finally have a 3 that we would love to see a 4 instead of \"Thank God, that's over\". The Bourne Ultimatum is the Coolest movie of the year!",
      "review_date": "2007-08-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "by far the best blockbuster of the summer. non-stop action will leave you sweaty by the end. love the subtle digs they make at the current abuse of powers by the government (rendition, echelon, moral corruption). no way the franchise should by far the best blockbuster of the summer. non-stop action will leave you sweaty by the end. love the subtle digs they make at the current abuse of powers by the government (rendition, echelon, moral corruption). no way the franchise should stop here!",
      "review_date": "2007-08-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Fast moving.. that's all I can say for this film. Snore. For fast paced and a story.. check out Live Free and Die Hard, a far superior film.",
      "review_date": "2007-08-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great movie! The girl reminds me of my girlfriend. Very far-fetched movie, though. I didn't see the first two, but heard the rave reviews of them. Matt Damon is a good actor because he's always honest with himself. Good action.",
      "review_date": "2007-08-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Smart, sexy and entertaining. What a movie should be!",
      "review_date": "2007-08-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the best action movies of the last decade. Critics are reduced to saying that the movie \"tied loose ends up\" because the movie integrates itself so well plot wise into the previous two movies. With that said, Ultimatum manages to have One of the best action movies of the last decade. Critics are reduced to saying that the movie \"tied loose ends up\" because the movie integrates itself so well plot wise into the previous two movies. With that said, Ultimatum manages to have its own unique pace and chemistry.",
      "review_date": "2007-08-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Very entertaining but not a clear winner as best of the three. I thought it fell flat in the last 30 minutes. The frenetic action sequences (Greengrass knows how to do this as well as anyone) are good but I did expect more from the picture. Very entertaining but not a clear winner as best of the three. I thought it fell flat in the last 30 minutes. The frenetic action sequences (Greengrass knows how to do this as well as anyone) are good but I did expect more from the picture. Still, it's a completely worthwhile way to spend 2 hours!",
      "review_date": "2007-08-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The ridiculous action plus the unreal camera work creates one of the best movies i have ever seen.",
      "review_date": "2007-08-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don't know how you can not give this movie a ten. It is full with blood pumping action, that is much different then I have ever seen before. The action in this movie puts a new standard in business. Please go out and see it when you I don't know how you can not give this movie a ten. It is full with blood pumping action, that is much different then I have ever seen before. The action in this movie puts a new standard in business. Please go out and see it when you read this review.",
      "review_date": "2007-08-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I was shocked and exhilarated to see a movie that I was hoping would be at least good escapist entertainment turn into something with timely political content and a conscience: The Manchurian Candidate meets the Bush administration. It is I was shocked and exhilarated to see a movie that I was hoping would be at least good escapist entertainment turn into something with timely political content and a conscience: The Manchurian Candidate meets the Bush administration. It is also breathtakingly exciting.",
      "review_date": "2007-08-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "it was extremely intense and exactly what i hoped it to be. this being the second sequel of the franchise, deep bow for keeping things fresh!! =)",
      "review_date": "2007-08-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "To begin, I want you all to know that I was excited to see this movie. I loved the first two Bourne movies and thought they got better as the stories carried on. With that said I would like to inform you that the third movie is about Jason To begin, I want you all to know that I was excited to see this movie. I loved the first two Bourne movies and thought they got better as the stories carried on. With that said I would like to inform you that the third movie is about Jason Bourne, I know this is surprising but really guys. It is. \"This is Jason Bourne.\" When sitting through the first half hour of this movie, I wouldn't be shocked if I heard that line repeated 20+ times. Holy redundancy! Okay. We get it. Jason Bourne is one guy you don't want to mess with. He shouldn't be chased or thought about unless you want your brain to spontaneously combust. After the brilliantly creative writing in the first half hour, comes Paul Greengrass' idea to recreate the hand-held camera-work that makes it seem like you are in the middle of the action, as in the Bourne Supremacy, which I liked. Although, this time Greengrass put on his silly glasses and drank a 40 of whiskey then storyboarded all the shots for the movie or maybe Greengrass just told the camera operators to do the Riverdance while shooting the scenes. It's hard to tell what he was thinking but this lasts throughout the movie and becomes very sickening. Most of the time I felt like I couldn't even see what was happening on the screen. Once I grabbed my doggy bag from the concessions area, I noticed the 3rd worst part of the movie. That is when Pamela Landy and Noah duke it out in the most annoying feud of people on the same team ever. If you want to watch two eight-year-old Nazis bicker with each other about toys or Jason Bourne, then enjoy. In case you forgot, Julia Stiles has a role in this movie. Wait. Not really. She starts to have a role in the movie and then her agent must have called her to start shooting for The Omen 2. I forgot how she is so busy with all the parts she has been taking lately and how it's good to have completely meaningless characters in movies. If you liked the resourcefulness of Bourne in the first 2 movies, you can throw that in the dumpster with this movie. A few examples are when he is riding a dirt bike away from the police, hits a curb with his front tire and the bike jumps onto a ledge five feet in the air or when he is playing bumper cars with a police car in rush hour traffic, then gets the car flipped onto a median that came from who knows where. While going probably 70+ mph and still sliding on the median, he grabs onto the seat belt holding onto dear life and ends up walking out of the crash with a few minor flesh wounds. So in summary the movie is kind of like this: Good? Who could tell? It's like watching French fries crackle along with a spew of hot bubbles in the back of a McDonald's. Do the actors act? Again, you got me. Does it make sense? Ask the scriptwriters, they'd probably know. Does it give you a headache? Hmm, about the size of Rose O'Donnell's waist line. The Bourne Ultimatum is the Blair Witch Project meets Speed meets Matrix Revolutions meets the dumbest CIA and NSA agents ever. Truthfully, I would rather eat a bowl of steaming crap while watching Home Alone 3 and Super Mario Brothers at the same time.",
      "review_date": "2007-08-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A fantastic action movie that services character and makes an attentive, intelligent audience really care what's happening to the protaganists. The directing style is superb -- Paul Greengrass wanted Bourne's world to come across A fantastic action movie that services character and makes an attentive, intelligent audience really care what's happening to the protaganists. The directing style is superb -- Paul Greengrass wanted Bourne's world to come across 'unconsidered.' It puts you right into his mind of spontaneous choice and observance. Brilliant! Easily the best movie of the year so far, all things considered.",
      "review_date": "2007-08-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "For the 3rd time in my life, I walked out of the theatre on a movie. The shaky camera made this movie impossible for me to watch, it was so annoying I couldn't even pay attention to the good story. I just couldn't sit through it, For the 3rd time in my life, I walked out of the theatre on a movie. The shaky camera made this movie impossible for me to watch, it was so annoying I couldn't even pay attention to the good story. I just couldn't sit through it, the camera work was so nauseating. My wife and I both couldn't handle it, and we walked out.",
      "review_date": "2007-08-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Who's writing all those glowing reviews?! Don't believe them! This movie is below-average fare, not remotely worth a Metacritic 85. It revolves around 3 or 4 long chase scenes (one okay, two maybe, but after a while you start to Who's writing all those glowing reviews?! Don't believe them! This movie is below-average fare, not remotely worth a Metacritic 85. It revolves around 3 or 4 long chase scenes (one okay, two maybe, but after a while you start to tune out the mayhem). Plus, Jason is just a thinly veiled version of Jack Bauer - he has more lives than a cat. And his love interest/fellow agent? She's briefly in the action then.... She's not at all convincing as a high-end CIA agent. The whole thing is like a 24 ripoff - plan your washroom breaks around the chase scenes.",
      "review_date": "2007-08-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Awesome! The Bourne Series just keeps getting better!",
      "review_date": "2007-08-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Movies should come with an HH rating for \"hand held\" camera. There was about 30 minutes of story and the rest is bad camera work. I'd rather watch utube. No surprises, no twists, no challenge in following the plot -- trust me on this, I Movies should come with an HH rating for \"hand held\" camera. There was about 30 minutes of story and the rest is bad camera work. I'd rather watch utube. No surprises, no twists, no challenge in following the plot -- trust me on this, I did it with my eyes closed. The sound editing was good.",
      "review_date": "2007-08-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "My only complaint would be that, the movie is very tiring on the eyes, due to the fact that a steady-cam wasn't used in any of the car chases; etc. Aside, from that minor qualm. The movie was highly enjoyable.",
      "review_date": "2007-08-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Very disappointing action sequences throughout. The editing of these scenes pretty much removes any doubt that this could really be happening. Bourne # 1 & #2 seemed more \"real\" It just looked fake to me.Compared to a film like Ronnin, the Very disappointing action sequences throughout. The editing of these scenes pretty much removes any doubt that this could really be happening. Bourne # 1 & #2 seemed more \"real\" It just looked fake to me.Compared to a film like Ronnin, the action sequences are bad, and action is about all this film offers.",
      "review_date": "2007-08-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The best action movie in memory.",
      "review_date": "2007-08-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I did like this movie but not as much as the rants and raves it got from the critics. It's definitely true that the camera shakes too much in too many scenes. A lot of the action sequences were a blur and seemed frantic because of the I did like this movie but not as much as the rants and raves it got from the critics. It's definitely true that the camera shakes too much in too many scenes. A lot of the action sequences were a blur and seemed frantic because of the camera shaking and scene editing that never let you quite see what was actually happening. Aside from that, I just couldn't figure out why Bourne called David Strathairn toward the end and basically dared him to chase him. Then Bourne started knocking off innocent NYPD that were in the way. Nevertheless the movie has many action packed scenes and does manage to keep you somewhat on the edge of your seat.",
      "review_date": "2007-08-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "my favorite out of the 3",
      "review_date": "2007-08-09",
      "source": "metacritic"
    }
  ],
  "num_reviews": 138
}