{
  "title": "Who's Your Caddy?",
  "rating": 3.0,
  "release_date": "2007-07-27",
  "genre": [
    "Sport",
    "Comedy"
  ],
  "summary": "Who's Your Caddy? is a hilarious fish out of water comedy about rap mogul C-Note from Atlanta who tries to join a genteel country club in the Carolinas but runs into fierce opposition from the Club's board.  Undeterred, C-Note gets the brilliant idea to buy the land adjacent to the 17th hole which he leverages to attain membership.Who's Your Caddy? is a hilarious fish out of water comedy about rap mogul C-Note from Atlanta who tries to join a genteel country club in the Carolinas but runs into fierce opposition from the Club's board.  Undeterred, C-Note gets the brilliant idea to buy the land adjacent to the 17th hole which he leverages to attain membership.  Subsequently, C-Note's crew wreaks havoc a they bring their Rap Mogul lifestyle to the club. As the club's President desperately tries to revoke C-Note's membership, our hero realizes that he is now in for the fight of his life to restore this family's honor, and he pulls out all the stops to bring down the club's backwards establishment. (The Weinstein Company)… Expand",
  "critic_reviews": [
    "The tired racial stereotypes that Caddy inserts into the old Caddyshack-style \"slobs vs. snobs\" formula should probably make it much more offensive than it is.",
    "An instantly forgettable trifle.",
    "His C-Note is essentially a one-note character. And that note is flat.",
    "Ultimately this is utterly forgettable stuff, not even managing to fulfill its mandate of mindless summer fun.",
    "No, it’s not Caddyshack -- just swap Jews (Rodney Dangerfield) for blacks (Big Boi) and you’ve got Who’s Your Caddy?. The movie, of course, is terrible.",
    "There’s probably more wit and pointed social commentary in the average four-minute OutKast song than in the entirety of Who’s Your Caddy?",
    "The players appear to be having a good time, though the situation is too sitcom-familiar to be funny.",
    "As it develops, Who's Your Caddy? just becomes depressing. You want to alert the United Negro College Fund: A mind has terribly gone to waste.",
    "Must be counted as a forfeit.",
    "The sport of golf has seen its fair share of vulgar comedies over the last 30 years or so.",
    "An offensive, comedy-free comedy."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "An instantly forgettable movie. I can't stand those characters who were just loafing around and making offensive, sick jokes. How this stuff can be a movie? Conclusion: Epic fail.",
      "review_date": "2012-02-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Effective use of N-word. Fat guy is the new Charleton Heston. Why didn't they bust a cap in the child molester guy?",
      "review_date": "2007-08-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "You know, at the theater that I work at, you know how many people saw this out of four showtimes? FOUR. That's it. And you know who they were? An old white couple and two old white women. Talk about a complete failure to connect to your You know, at the theater that I work at, you know how many people saw this out of four showtimes? FOUR. That's it. And you know who they were? An old white couple and two old white women. Talk about a complete failure to connect to your audience, and a complete failure to achieve anything resembling comedy.",
      "review_date": "2007-08-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Will win the Best Picture Oscar, hands down. A sophisticated portrait of competition and the emotional scars one gains and suffers from conflict. A thoroughly engrossing and illuminative piece of film. Ranks among the top ten movies of the Will win the Best Picture Oscar, hands down. A sophisticated portrait of competition and the emotional scars one gains and suffers from conflict. A thoroughly engrossing and illuminative piece of film. Ranks among the top ten movies of the decade, if not the century. A meditation on the horror of losing, or even at times, winning. This will be remembered for years to come. The theatre applauded nonstop for thirty minutes after the credits rolled. A+. 10 stars. The absolute finest that cinema has to offer these days or any day.",
      "review_date": "2007-08-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Ray of lite makes me laugh.",
      "review_date": "2007-09-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Few movies are as free of comedy as \"Who's Your Caddy?\" The film is an offensive, stereotypical, predictable, and forgettable tirade that any viewer should skip. The fact that people actually watched this film is more comedic than the Few movies are as free of comedy as \"Who's Your Caddy?\" The film is an offensive, stereotypical, predictable, and forgettable tirade that any viewer should skip. The fact that people actually watched this film is more comedic than the movie itself.",
      "review_date": "2007-08-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is absolutely hilarious from start to finish. So many funny characters with terrific pace that keeps the laughs rolling.",
      "review_date": "2022-08-07",
      "source": "metacritic"
    }
  ],
  "num_reviews": 18
}