{
  "title": "Dirty Harry",
  "rating": 8.2,
  "release_date": "1971-12-23",
  "genre": [
    "Action",
    "Thriller",
    "Crime"
  ],
  "summary": "When an individual known as 'the Scorpio Killer' menaces the city, tough as nails San Francisco Police Inspector Harry Callahan (Eastwoood) is assigned to track down and deal with the psychopath. \"Iknowwhatyou're thinking. Did he fire six shots or only five? Well, to tell you the truth, in all this excitement, I've kinda lost track myself.When an individual known as 'the Scorpio Killer' menaces the city, tough as nails San Francisco Police Inspector Harry Callahan (Eastwoood) is assigned to track down and deal with the psychopath. \"Iknowwhatyou're thinking. Did he fire six shots or only five? Well, to tell you the truth, in all this excitement, I've kinda lost track myself. But being as this is a 44 Magnum, the most powerful handgun in the world, and would blow your head clean off, you've only got to ask yourself one question: 'Do I feel lucky?' Well, do ya punk?\"… Expand",
  "critic_reviews": [
    "It is also, of course, quite unrelentingly cool.",
    "Try to get Siegel’s masterful camera rise out of your head: gun-happy Harry looming over his jabbering perp, who screams like a stuck pig as the shot recedes high into a dense night fog. This is not a cop film. It’s a monster movie.",
    "A crisp, beautifully paced film, full of Siegel's wonderful coups of cutting and framing.",
    "The pleasures of this movie are abundant. The pacing is as swift as a speeding bullet. There are wonderfully evoked lived-in San Francisco locations... And there are splendid set pieces that showcase the perpetually-underrated Don Siegel's great skill a director.  This film is efficient, unpretentious and much wittier and more stylish than your average cop movie.",
    "I can see why this movie scared so many people. I’m fairly liberal and I find Clint’s super-cop infinitely appealing. Imagine how this movie goes down with people who already have one foot in the door of the local militia or Klan auxiliary. Even Pauline Kæl would have to admit that politics aside, this is a pretty damn effective action movie. This is Clint at maybe his best looking and healthiest, and his Inspector Callahan is perhaps every rebel’s dream.",
    "Dirty Harry is very effective at the level of a thriller. At another level, it uses the most potent star presence in American movies -- Clint Eastwood -- to lay things on the line. If there aren't mentalities like Dirty Harry's at loose in the land, then the movie is irrelevant. If there are, we should not blame the bearer of the bad news.",
    "A fascist film, or a film about a fascist cop? Either way, this is suspenseful, energetic stuff, directed with urgency and style by Cahiers du Cinema favorite Don Siegel.",
    "Strip away the philosophical garbage and all that's left is a well-made but shallow running-and-jumping meller. Don Siegel produces handsomely and directs routinely.",
    "The movie is both vile and risible."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "This is going to be the first time reviewing a film starring the legendary Clint Eastwood. Why? Because Clint is a director and actor making his movies so memorable for the most part. In Dirty Harry, he plays a dirty inspector called HarryThis is going to be the first time reviewing a film starring the legendary Clint Eastwood. Why? Because Clint is a director and actor making his movies so memorable for the most part. In Dirty Harry, he plays a dirty inspector called Harry Callahan. He kills bad guys and criminals and he takes no prisoners and he never hesitates to kill all criminals. The mysterious killer in Dirty Harry is a killer called Scorpio who kills women if he doesn't his money for his ransom demands. This film is so iconic for most people and for me I looked up on it years ago, looking at some scenes and I remember one line that I could never forget which is said by Clint Eastwood is:\"I know what you're thinking: 'Did he fire six shots or only five?' Well, to tell you the truth, in all this excitement, I've kinda lost track myself. But being this is a .44 Magnum, the most powerful handgun in the world, and would blow your head clean off, you've got to ask yourself one question: 'Do I feel lucky?' Well, do you, punk?\"He said it two times in the film. Now there are five films in the Dirty Harry franchise. If you want me to do some more, well, join me in the next one.",
      "review_date": "2018-11-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Dirty Harry is a great film on an already dropped-in theme by the 70s, which is to say about the police thriller genre after 50 years. But the genre is now going through bad times and it is Dirty Harry that is a vivid example of this. A greatDirty Harry is a great film on an already dropped-in theme by the 70s, which is to say about the police thriller genre after 50 years. But the genre is now going through bad times and it is Dirty Harry that is a vivid example of this. A great and simple story, a great Clint Eastwood. A proper subject of cruelty, which many have criticized. But it was thanks to her and the position of the protagonist that the film became a cult.",
      "review_date": "2021-10-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "aptly humane and sane..Dirty Harry Dirty Harry is a character driven crime thriller about a madman who is on a killing spree and to stop him, an equally bold cop is hired to pull off this job. The feature may be of \"cat and mouse\" natureaptly humane and sane..Dirty Harry Dirty Harry is a character driven crime thriller about a madman who is on a killing spree and to stop him, an equally bold cop is hired to pull off this job. The feature may be of \"cat and mouse\" nature but its simple chess politics that it plays with all tricks in, is what makes it smarter and cunning than the usual cop cases. If it is brimmed with action then it is full of slick moves, if it has any chase or physical sequences it is performed with panache and if there are any morale conflicts or threats they are projected with gut wrenching execution that screams the glorifying cinematic experience that every fan aspires for. The background score is palpable enough to add the cynicism on each sequences, the cinematography is decent with sharp sound effects and fine editing but poor art designing. The way it simplifies the human necessities and emotional aspects by choking up the characters' nerves and narrowing its abilities is how it offer a three dimensional perspective to them which is purely cathartic to the eyes. Eastwood is lethal and also vulnerable and with a character range that he has offered he milks out the essential bits and foliates it through finesse on screen. The narration is appreciative and thoroughly gripping but with Siegel's brilliant execution it creates the anticipated impact on screen. The smarter ideologies of the crimes are written with maturity and depicts the entire subjective procedure to the viewers to elaborate the bar and the magnitude of the stakes and emotions that the characters are going through it. Thoroughly competent action and chase sequences, gripping and layered screenplay that enfolds with appealing characters and revealing concepts are the high points of the feature. Dirty Harry is undeniably dirty but it is aptly humane and sane whose buoyant natured script is the real gem that keeps giving it back.",
      "review_date": "2018-09-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is so very awesome, because him was the begining of all the movies about police investigation. After this movie, so much movies copied the story about a police officer  ivastigating a seriall killer.The script it's well built, theThis movie is so very awesome, because him was the begining of all the movies about police investigation. After this movie, so much movies copied the story about a police officer  ivastigating a seriall killer.The script it's well built, the actuation of Clint Eastwood it's impeccable.If you not watch this movie, watch right now, because it's one of the best action movies and police investigation of all time.",
      "review_date": "2018-08-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Dirty Harry is a 1971 action thriller that stars Clint Eastwood as a cop trying to find and capture an assassin who's using rooftops to sniper innocents, yes he's using a sniper rifle but he tries to evade police at every stop. The killer,Dirty Harry is a 1971 action thriller that stars Clint Eastwood as a cop trying to find and capture an assassin who's using rooftops to sniper innocents, yes he's using a sniper rifle but he tries to evade police at every stop. The killer, badguy in question who's killing off innocents is played by Andrew Robinson who even takes a bus full of school kids hostage and sings with the kids whilst threatening them which is amusing. Then we see cop Harry Callahan (Clint Eastwood) jump on the roof of the bus in a bid to stop the killer. Basically Dirty Harry is full of some of the best quotes in film history, great action scenes, shooting scenes, chases, violence, nudity and a good cast and brilliant acted performances especially by Clint Eastwood. Dirty Harry had a few sequels but none made a dent on the original and best one. A must watch and great movie, also stars Reni Santoni, John Vernon as the mayor.",
      "review_date": "2020-04-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The first film about Inspector Harry Callahan, a police odyssey essential for the film industry.",
      "review_date": "2018-09-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "La primera y mejor película basada en la saga de Harry Callahan, un detective de homicidios de la policía de San Francisco que se enfrenta a los peores casos posibles. Establece los estándares del cine policíaco del siglo XX y XXI ya aLa primera y mejor película basada en la saga de Harry Callahan, un detective de homicidios de la policía de San Francisco que se enfrenta a los peores casos posibles. Establece los estándares del cine policíaco del siglo XX y XXI ya a principios de los años 70, con escenas míticas parte de la cultura popular de varias generaciones. Altamente recomendada.",
      "review_date": "2018-10-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A pretty good cop film, Eastwood is very good and story is solid though the film has dated a bit.",
      "review_date": "2019-04-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Aside from the movie dragging just a bit halfway through, Dirty Harry more than lives up even decades after it's original release. Eastwood in his prime is just untouchable.",
      "review_date": "2019-11-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a modern film noir classic, set in San Francisco in the 1970's.  The debut of the iconic character from Clint Eastwood, but even better, I loved the plot and feeling of the film as it was pretty much about the \"Zodiac\" Killer, and wasThis is a modern film noir classic, set in San Francisco in the 1970's.  The debut of the iconic character from Clint Eastwood, but even better, I loved the plot and feeling of the film as it was pretty much about the \"Zodiac\" Killer, and was made while that case was still fresh in the public consciousness a few years after it happened.  It felt much like another film I liked, \"Zodiac\" and is almost a companion piece to that, as that one is more investigative, and this one is more atmospheric, has more action, and of course the 70's milieu.  So if you like action films, you will probably like it, and if you like thrillers, mysteries, and similar genres, you would probably like it as well.  And the character Clint Eastwood creates is always interesting on screen.  Surprisingly it was way better than I thought it would be, and ends up as one of my favorite movies from the 70's.",
      "review_date": "2019-05-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Classic movie with a good and cool performance by Clint Eastwood. But the screenplay it outdated and there are some logical mistakes.",
      "review_date": "2021-04-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If there was a category for quintessential crime thrillers, I would almost certainly put Dirty Harry in that category. Everything about Dirty Harry is wonderful. The cinematography is fine and the locations and scenery are quite striking.If there was a category for quintessential crime thrillers, I would almost certainly put Dirty Harry in that category. Everything about Dirty Harry is wonderful. The cinematography is fine and the locations and scenery are quite striking. Lalo Schifrin's music sets the atmosphere very well too, while the story is taut, the script is quotable and cleverly written, Don Siegel's direction is superb and the violence is shocking and daring. The acting is also great, in his more complex roles Clint Eastwood was born for the role of Dirty Harry, and all the supporting roles are very well played. All in all, brilliant and one of the crime thrillers there is. 10/10 Bethany Cox",
      "review_date": "2022-03-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "¿Do you feel lucky, bum? An essential of 70s about an antisocial, ruthless detective of San Francisco who is the sum of all prejudices and his efforts for bring down a murder. No wonder why Gorillaz dedicated him a song.",
      "review_date": "2019-04-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's important to understand this is a 50 year old movie.  my only vintage memory of this is Clint Eastwood shooting black people while eating hot dogs, but I have come to respect the genre after seeing Bullitt, Point Blank, The FrenchIt's important to understand this is a 50 year old movie.  my only vintage memory of this is Clint Eastwood shooting black people while eating hot dogs, but I have come to respect the genre after seeing Bullitt, Point Blank, The French Connection etc.  San Francisco in the early 70s just oozes freedom and fresh air, it's on of those magical times in history.  I believe it was made with the concept of police breaking the law in order to prioritize the rights of the victims over the criminals.  An original idea at the time, interesting to think it began somewhere.  Bullitt did much of this as well, and better but not as bombastic as this, thanks to the writing of John Milius.  This was a pioneer of killing a criminal before he commits the crime.  They laugh about beating prisoners, this was a time we trusted police and didn't need 75 cops tv shows to do it.  He jokes about all the races he hates.  Creeps on women in their homes. He beats and insults a guy threatening suicide. He shoots first.  He uses illegal weapons. He breaks into homes.  He doesn't get search warrants.  He shoots unarmed people.  He doesn't read rights or allow legal counsel before questioning.  He tortures criminals.  He stalks people in off hours.  He causes car wrecks, involving kids, nearly shoots kids.  The scorpio killer is a good character, like the Joker but 40 years ahead.  The best scene is the scorpio killer paying a black guy to beat him up.  The scene with him slapping kids for not wanting to go to the ice cream factory is hilarious, it's very dysfunctional family.",
      "review_date": "2020-02-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Ahh, the 70s. They gave us some of the best action films. Can we get some similar stuff today? ..The character of Dirty Harry is great and it has the best characterization of Harry among all five films. Some early dialogues and scenes giveAhh, the 70s. They gave us some of the best action films. Can we get some similar stuff today? ..The character of Dirty Harry is great and it has the best characterization of Harry among all five films. Some early dialogues and scenes give a very clear introduction to the iconic character portrayed by the great Clint Eastwood. His lines are just awesome. And the way he delivers them is fantastic. Not just this, his characterization is very firm and strong. We can fully get behind his way of working and going against the law to do something right. One more thing, Harry is a badass character, and is full of testosterone. But he isn't a super-powerful and literally invulnerable guy. As a matter of fact, he feels humane and believable. He has weaknesses and the clear belief that his methods are good. The villain in this movie is also good. He gives a very good support to the character of Harry Callahan, being a sadistic and crazy a$$hole at the same time. He gets under our nerves very quickly. The actor has done a fine job in (perhaps) his only film role. Speaking of the story, it's not about who did it sort of a mystery thriller, but rather a \"chase\". It's all about how Harry gets \"unstable\" little by little because of the doings of Scorpio. It gets more and more serious as it proceeds. The final showdown between Harry and Scorpio is worth the build up of the story. The conclusion is really satisfying. There are entertaining action scenes. There are disturbing and dark moments. Eastwood gives some badass moments and quotable lines. And the way Eastwood delivers the the same quote in the first act and in the third act is quite great. There are also a lot of scenes where he messes up with authorities and even says \"the law is crazy\". None of them feel forced or so. In short it is a representative of a great 70s Hollywood crime action film. Nothing holds the film down. ..Conclusion : One of the best 70s Hollywood movie. It has all the excitement that an action film needs and all the right elements of a cop drama/crime movie. It will not disappoint at any level whatsoever. Completely recommended for old film lovers and to the genre fans. ..Rating. ..Score : absolute 10/10Grade : golden A+",
      "review_date": "2019-03-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A classic, Clint at his best. Seen this movie many times and it never gets boring. Harry and his 44 cleaning the streets of filth...",
      "review_date": "2019-03-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Easily the best film in the franchise with terrific performances, action scenes & story. It's probably one of the best tough guy cop & cop films in general.",
      "review_date": "2019-07-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a classic in terms of crime dramas, featuring the line (in relation to how many bullets had been fired from his gun, all or if he has 1 bullet remaining) 'you could ask yourself a question, do I feel lucky?...well, do you... punk?'.This is a classic in terms of crime dramas, featuring the line (in relation to how many bullets had been fired from his gun, all or if he has 1 bullet remaining) 'you could ask yourself a question, do I feel lucky?...well, do you... punk?'. Who hasn't heard that line before?! It was fun seeing Clint Eastwood play this infamous role - he was clearly quite on top of his game when this film was made. I liked the music played and the camera shots used (including one a bit like a cats eye lens as well and felt it was quite engrossing, so I would recommend it to others, with the exception for anyone who is overly squeamish, due to bloody injuries depicted.",
      "review_date": "2021-11-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Surprisingly straightforward story-wise, but very enjoyable all the same.'Dirty Harry' is no doubt stylish, features an eye-catching plot and has a very good lead performance from Clint Eastwood; he really does own the role. With thatSurprisingly straightforward story-wise, but very enjoyable all the same.'Dirty Harry' is no doubt stylish, features an eye-catching plot and has a very good lead performance from Clint Eastwood; he really does own the role. With that noted, I was surprised at how simply the story unfolds. That's not necessarily a criticism, I just presumed it would've been more than just 'event one, event two, event three etc. ... the end'. I enjoyed it, which is all that truly matters.It's, for me, an entertaining, solid film. I have no real issues with it.",
      "review_date": "2022-01-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Directed by Don Siegel in 1971.... Dirty Harry is the original and best in the series, Dirty Harry spawned sequels but none of them could maintain the high standards of the violent and gripping original, filled with tension and tense momentsDirected by Don Siegel in 1971.... Dirty Harry is the original and best in the series, Dirty Harry spawned sequels but none of them could maintain the high standards of the violent and gripping original, filled with tension and tense moments and classic quotes and lines... A killer named Scorpio (Andrew Robinson) is a rooftop killer because he's snipering people from roofs but at times keeps a low profile but eventually runs out of luck, he results in taking a school bus of kids hostage and demanding money or certain people die. Inspector Callahan also known as Dirty Harry (Clint Eastwood) chases the killer on a few occasions, follows him and tries to stop him at each turn but the killer is always a step ahead usually until the end. Full of violence and bad language and an excellent performance by Eastwood I'd say Dirty Harry is a classic crime thriller and one of the best movies ever made.  It may have scenes of nudity so kids should avoid it and Eastwood carries his signature 44 magnum on him so we can all spot him casually walking around the streets blowing the badguys away after chomping on a hotdog.... It's fairly dark in places and always entertaining even when the action scenes aren't operational because the storyline is so good. Excellent film and a must watch in my opinion, also stars John Vernon as the mayor and Reni Santoni.",
      "review_date": "2020-06-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A classic.Along with The French Connection, released in the same year,  the two were game changers for police/homicide movies for decades to come.Eastwood is perfect as Harry, in this well paced, tightly scripted, re-quoteable gem.",
      "review_date": "2021-02-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Marvellously scripted, directed, and acted, \"Dirty Harry\" is the kind of action film many other action films aspire to be, smart, exciting, witty, and badass.",
      "review_date": "2021-08-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The killer, badguy in question who's killing off innocents is played by Andrew Robinson who even takes a bus full of school kids hostage and sings with the kids whilst threatening them which is amusing. $1 to buy a Netflix account, GoogleThe killer, badguy in question who's killing off innocents is played by Andrew Robinson who even takes a bus full of school kids hostage and sings with the kids whilst threatening them which is amusing. $1 to buy a Netflix account, Google search: vtvshare",
      "review_date": "2022-08-11",
      "source": "metacritic"
    }
  ],
  "num_reviews": 32
}