{
    "title": "Harold and Maude",
    "rating": 8.3,
    "release_date": "1971-12-20",
    "genre": [
        "Drama",
        "Comedy",
        "Romance"
    ],
    "summary": "Young, rich, and obsessed with death, Harold finds himself changed forever when he meets lively septuagenarian Maude at a funeral.",
    "critic_reviews": [
        "The movie is a paean to outsiders and reckless love.",
        "Mawkishness is kept at bay by the lightness of touch in Ashby's direction and Gordon and Cort's wonderful performances. Only the most miserable cynic could resist its unique charm and ultimate hopefulness.",
        "It's to director Hal Ashby's credit that he succeeds in maintaining an unsettling tone of pre-Lynchian absurdism throughout, while also pulling the viewer into a touching love story between perhaps the most unlikely couple in cinema history.",
        "In the end, Harold And Maude metes out these life lessons directly and without much ambiguity, yet that does little to diminish its power.",
        "You may find yourself passing a very enjoyable couple of hours with the oddest of odd couples.",
        "This is a doggedly eccentric film which some will reject out of hand. Others will find it profoundly moving and life affirming.",
        "The effortless depiction of their growing camaraderie and unconscious courtship is one of Harold and Maude‘s great charms, as Ashby and screenwriter Colin Higgins transpose fading ideology into boundless truth across a modest framework of pitch-black exposition and glowingly pastoral aesthetic touches.",
        "Ashby forever treads the thin line between whimsy and absurdity and tough sentimentality and black comedy. It is most successful when it keeps to the tone of an insane fairystory set up at the beginning of the movie.",
        "There’s a dark streak of comic absurdity running throughout Harold and Maude that serves a dual purpose; it gives the film its unique, heightened tone, but it also conversely grounds the more whimsical element by hinting at a greater darkness beyond the events portrayed within.",
        "Hal Ashby's 1972 cult film may be simpleminded, but it's fairly inoffensive, at least until Ashby lingers over the concentration-camp serial number tattooed on Gordon's arm. Some things are beyond the reach of whimsy.",
        "Director Hal Ashby’s second feature is marked by a few good gags, but marred by a greater preponderance of sophomoric, overdone and mocking humor.",
        "Harold is death, Maude life, and they manage to make the two seem so similar that life's hardly worth the extra bother. The visual style makes everyone look fresh from the Wax Museum, and all the movie lacks is a lot of day-old gardenias and lilies and roses in the lobby, filling the place with a cloying sweet smell.",
        "As performers, they both are so aggressive, so creepy and off‐putting, that Harold and Maude are obviously made for each other, a point the movie itself refuses to recognize with a twist ending that betrays, I think, its life‐affirming pre tensions."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "A film unlike any I have seen before. The romance between Harold and Maude is unconventional to say the least, but the love between the two characters feels real. This is story that touches upon the demand to conform to societal conventions,A film unlike any I have seen before. The romance between Harold and Maude is unconventional to say the least, but the love between the two characters feels real. This is story that touches upon the demand to conform to societal conventions, and the happiness that comes out of resisting that expectation. I love the pacing of this film; the characters are given time not only to express their self, but also to listen, and contemplate, and generate only answers that are authentic and well thought out. I think this film has aged well, and I think it offers a window into the nostalgic fantasy before the complexities of instant communication and social media that we have today. I actually felt really relaxed in watching this. It's funny, eclectic, heart-warming, while at the same time holding up a mirror to society and asking the question: why is there such taboo with being different?",
            "review_date": "2018-05-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Impressed by its beautiful style, its moving soundtrack, eccentric characters, sharp acting, smart dialogue,interesting philosophy, and clever metaphors, if they are presented very directly. But it's so cold and bland, so, simply, I didn'tImpressed by its beautiful style, its moving soundtrack, eccentric characters, sharp acting, smart dialogue,interesting philosophy, and clever metaphors, if they are presented very directly. But it's so cold and bland, so, simply, I didn't care about anything.If you were wondering how a Wes Anderson movie would be like if it lacks heart, Harold and Maude is the answer to your question. It's a very sweet and classy candy yet not tasty! (7/10)",
            "review_date": "2018-06-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "this movie rules. like don't watch it if you're sensitive about suicide but even if you are it's still... idk. really good",
            "review_date": "2021-12-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This film did give me quite a wry smile, although it rarely made me laugh out loud, as such - maybe only a couple of times. I could easily relate to Harolds lack of interest in his mothers affairs (not of a romantic nature, I should clarify)This film did give me quite a wry smile, although it rarely made me laugh out loud, as such - maybe only a couple of times. I could easily relate to Harolds lack of interest in his mothers affairs (not of a romantic nature, I should clarify) - the other characters he interacts with all come across as very much self centered/absorbed and very predictable. He appears to be somewhat of a stoney faced, ghost like figure as he's pushed into the background and yet his mother doesn't appear to know what to do with him because I suppose he isn't the model child that parents hope, or presume, their kid(s) will somehow naturally be.It has something of a life affirming element to it, when Harold and Maude are together and sort of allow themselves to be themselves and to heck with what other people think about their rather impulsive, erratic and eccentric behaviour. They make for an interesting double act of sorts, given he's a young adult (presumably a teenager) and she's an elderly lady - Maude exclaims at one point that spending time with him takes her back to her school days. Some of the dialogue is poignant, although perhaps a bit sugary sweet for some maybe - I suppose its a slightly strange mix to have such dark comedy/humour with the (somewhat) graphic, staged depictions of suicides, alongside talk about seizing life, making the most of life and so on. I feel there's definitely a class element very much at play here too, given Harold lives in a rather large, mansion style house with a clearly very upper class mother. When he's given an introduction to the military, in the hopes he'll somehow 'make a man of himself', things don't go to plan and seeing the flustered reaction of the General was quite amusing. There's something almost reassuring, in a sense, about the fact that well regarded professionals seem baffled by Harold and the person who seemingly 'gets him' is someone who, to all intents and purposes, is also not looked on well and is overlooked by others.This is a very quirky film which some may well feel is a bit distasteful and thus won't necessarily sit well with some - you may find it quite amusing in parts, or you may struggle to understand what the point is, its hard to say. I can certainly understand why its regarded as a cult film, as its got quite an 'indie' feel to it and its clearly quite original, in terms of the story - I don't feel like ive come across many, if any, characters quite like Harold, somehow. By the end of the flm, I couldn't help but wonder what became of this person - if it were a real depiction of someone, where did they end up?. I think there is a thought provoking element to it - its quite care free and light hearted while also tackling (if in a slightly strange way, maybe) some heavy subjects, that of belonging, acknowledgment and even mortality.I found the film to be perfectly watchable, it isn't an especially long watch at about an hour and a half running time. Its one of those quirky films where you feel, as a viewer, as if your without some perhaps key information which might make you understand things a bit better but it actually benefits from this, I feel. We learn a bit more about Harold as the film progresses and there's a real plot twist towards the end, one that particularly took me aback as it seemed to go against what I thought I knew of the person involved. I think this film somehow affirms that you don't always know goes on in peoples minds. I think this film wouldn't work, or certainly not anything like as well as it did, if it weren't for the main performances of Ruth Gordon and Bud Cort, as Maude and Harold respectively. They both come across as intriguing, eccentric characters and its quite nice to see how they both seem to open up to one another after spending time with each other. It is an interesting character driven film, if a little dark and perhaps not fast enough paced plot wise for some, maybe.Yes I'd recommend this film in as much as I quite enjoyed watching it and got a laugh or two out of it, although I'd make it clear that it won't be for everyone and indeed some may find it distasteful. Its hard to describe without showing it but it is quite a dark film wth an 'indie' feel to it and fans of such films, or those especially curious about the themes would likely enjoy it, I'd imagine.",
            "review_date": "2021-11-21",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "One of my favorite movies. Interesting depiction of a young man finding himself in life.",
            "review_date": "2022-12-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "My favorite movie. It gives the viewer a new way to look at life. Love the acting, especially Vivian Pickles. The sound track and visuals are beautiful.",
            "review_date": "2023-02-04",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 19
}