{
    "title": "Willy Wonka & the Chocolate Factory",
    "rating": 8.1,
    "release_date": "1971-06-30",
    "genre": [
        "Fantasy",
        "Family",
        "Musical"
    ],
    "summary": "A poor but hopeful boy seeks one of the five coveted golden tickets that will send him on a tour of Willy Wonka's mysterious chocolate factory.",
    "critic_reviews": [
        "Willy Wonka and the Chocolate Factory is probably the best film of its sort since The Wizard of Oz. It is everything that family movies usually claim to be, but aren't: Delightful, funny, scary, exciting, and, most of all, a genuine work of imagination. Willy Wonka is such a surely and wonderfully spun fantasy that it works on all kinds of minds, and it is fascinating because, like all classic fantasy, it is fascinated with itself.",
        "Like all the best and most beloved family films, there's plenty in this film for adults to appreciate as well as kids.",
        "Great fun, with Wilder for once giving an impeccably controlled performance as the factory's bizarre owner.",
        "Roald Dahl's immortal, sugar-coated morality play finds Gene Wilder as disturbing and fault-ridden but compelling as the book described. Okay, so its pacing may be slightly off (taking nearly 40 minutes to arrive at the factory gates), but this is still a Golden Ticket if ever there was one.",
        "Adapted (with some changes) by Roald Dahl from his famous children's book, Charlie and the Chocolate Factory, Willy Wonka creates a marvelous world as close to heaven as any kid can imagine and never talks down to its young audience. The film is sometimes dark in its tone but by the end (when Wonka's motives and true nature are revealed) it is fabulously uplifting.",
        "For a children's film, Willy Wonka is surprisingly malevolent, which is most of its fun. But the refreshing malice and twisted whimsy only kick into high gear after 45 minutes of plodding setup and film-padding songs.",
        "An okay family musical fantasy featuring Gene Wilder as an eccentric candymaker who makes a boy's dreams come true.",
        "The crazy color schemes and visual effects once made this a popular head picture, though you'd have to be stoned to tolerate the score, which includes The Candy Man.",
        "There is, of course, Gene Wilder as Wonka, the reason most people think they like this movie, and he’s a wonderful actor quite capable of hitting Dahl’s ambivalences (and he has a lovely entrance), but Stuart’s clunky stop-and-start pace and sketchy tone give him nowhere to go."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "'Willy Wonka & the Chocolate Factory' is a 1971 belated cult classic film. I say belated because this film didn't really gain a following until its VHS release. The film was surprisingly a box office dud, only making over $500,000'Willy Wonka & the Chocolate Factory' is a 1971 belated cult classic film. I say belated because this film didn't really gain a following until its VHS release. The film was surprisingly a box office dud, only making over $500,000 domestically. This news is shocking considering how beloved it is. There are so many great things about this movie. Now, I haven't read this book since I was little, but I know a lot of what was in the book was in the film as well. The book/film has a great story with great messages. You should be hopeful for things you would like to achieve, but you shouldn't let greed overcome you. And considering this is a book-to-film adaption, Roald Dahl, who also wrote the book, wrote an amazing script. Book-to-film adaptations are tough to watch because almost all of the time, the movies fail and are nowhere near as good as the book, but this is one case where the movie is exceptional. This script was actually very clever, not only telling the story well, but a lot of characters, particularly Willy Wonka, had some pretty funny, clever, memorable lines. I have too many favorites to even list.Speaking of the character of Willy Wonka, Gene Wilder did an outstanding job playing the titular character. What a lot of people might not know is that Gene Wilder decided to turn down the role unless his one exception could be met, and it was. That exception was in the film during the Willy Wonka introduction scene. When Wonka tricks the crowd into thinking he's crippled, he somersaults, clearly proving that he can walk just fine. Wilder wanted that scene in the film because if Wonka could trick everyone, nobody would know if he was telling the truth or not from that point on. It was a smart move on Wilder's part. With a semi-large cast like this, you have to break down the performances specifically in some cases. In this film's case, you can break down the performance by age groups: kids and adults. The child actors in this film are great. They clearly portray greedy, naughty children that only care about winning the grand prize. The obvious child star would be Charlie Bucket played by Peter Ostrum, his only film. You sympathize with Charlie not just because of his living conditions but because of how much he wants a Golden Ticket. While his character doesn't make the best decisions in this film, he's just a kid who finally gets to have some fun in his life. The adult actors are also great in this film as well. Excluding Gene Wilder, Jack Albertson portrayed a great Grandpa Joe who you could also sympathize with as well. Charlie's grandparents have been bedridden for 20 years, and it takes Charlie's Golden Ticket win to finally give Grandpa Joe the strength to finally get out of bed. The parents of the other children also have great roles, never overshadowing one another.The one Academy Award this film was nominated just so happened to be the one that made the most sense: Best Music/Score. This film has some of the most iconic songs ever put to film. 'Pure Imagination' is a classic that everyone knows. Leslie Bricusse and Anthony Newley did a great job composing the songs and score in this film. The soundtrack is easily recognizable and has truly stood the test of time nearly 50 years later.During this time period, there was no such thing as CGI or other VFX we're used to now. Because of this, watching the film in the present time, it's clear that this film severely lacks in visual effects. Obviously, there is more technology in today's world that helps us accomplish this, but considering that this film was released in 1971, the visual effects aren't terrible. There wasn't a whole lot of VFX, but I think the most noticeable would be the great glass elevator flying or maybe even the chocolate river or tunnel scene.Another important aspect of this film is costume design and makeup. Willy Wonka's costume fits his character well. An odd costume for an odd character. The Oompa Loompas have bright orange makeup all over their faces and bushy white eyebrows along with green over-styled hair. Again, for its time, the costumes and makeup are good as well.My main issue with this film is that there aren't enough scenes in the factory, and we don't get to see enough rooms of the factory, either, which is disappointing. The film, which stands at 100 minutes long, has too much build-up to the factory that when we finally see it, we don't see it for very long. Besides this, this is truly an exceptional film, and it's a shame that it wasn't recognized right away.",
            "review_date": "2018-04-29",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Willy Wonka and the Chocolate Factory is honestly a brilliant movie and it's even a masterpiece and a half. The movie's got a brilliant story, brilliant cast, strong dialogue, brilliant emotions, great pacing, great cinematography, amazingWilly Wonka and the Chocolate Factory is honestly a brilliant movie and it's even a masterpiece and a half. The movie's got a brilliant story, brilliant cast, strong dialogue, brilliant emotions, great pacing, great cinematography, amazing set designs and lot's of great humour throughout.Overall, Willy Wonka and The Chocolate Factory is such a brilliant movie and it's honestly worth the watch.",
            "review_date": "2020-12-11",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This review contains spoilers, click expand to view.\n        \nCreepy, freaky, but it's a good family movie. If you don't mention that Willy Wonka murdered the kids.",
            "review_date": "2018-04-01",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Watching Willy Wonka & the Chocolate Factory in 2020 just after reading the book feels like a joke because more than enticing the slapstick film with a touch of musical only repels you with its dirty props and over-dramatic performances byWatching Willy Wonka & the Chocolate Factory in 2020 just after reading the book feels like a joke because more than enticing the slapstick film with a touch of musical only repels you with its dirty props and over-dramatic performances by everyone that are an exaggeration of what even Dahl imagined. TN.",
            "review_date": "2020-05-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This is a hugely enjoyable film, based upon the book by Roald Dahl. The film does have a number of merits, especially the flawless performance of Gene Wilder as Willy Wonka, a characterisation that is charming and funny at the same time.This is a hugely enjoyable film, based upon the book by Roald Dahl. The film does have a number of merits, especially the flawless performance of Gene Wilder as Willy Wonka, a characterisation that is charming and funny at the same time. Another standout is Jack Albertson as Grandpa Joe, his scenes with Charlie were lovingly realised, but in his song, he was just hilarious, and his singing voice was remarkably good. However, whereas Peter Ostrum is perfectly agreeable in terms of acting as Charlie, he is let down by his lack of any real singing ability. Though the film does look beautiful with excellent cinematography and colourful sets, and the supporting characters like the Oompa Loompas, the odiously spoilt Veruca Salt, television addict Mike Tevee and the rather disgusting Violet Bueragarde, are very well done, and the actors are further advantaged by a wonderful sparkling script. The songs are lovely, especially Oompa Loompa, Imagination and I want it Now, though I will say I felt Cheer Up Charlie was rather tedious and slowed the film down quite considerably. Overall, a beautiful film, and I do think it is underrated. 8/10 Bethany Cox.",
            "review_date": "2022-03-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Never show this to your kids. I mean never. The main theme is good, but there are completely wrong messages given. It is the 70s mentality that you should not get fat, should not watch too much television and stuff like that. Although theNever show this to your kids. I mean never. The main theme is good, but there are completely wrong messages given. It is the 70s mentality that you should not get fat, should not watch too much television and stuff like that. Although the kids are very annoying and they probably deserve it, this mentality is completely wrong and should not be enforced in the present generation.",
            "review_date": "2021-02-22",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Watched again for the first time in nearly 20 years. Absolutely solid.Being older I appreciated all the little visual and chracter jokes. Pacing is well thought oit and moves briskly without being overwhelmong.",
            "review_date": "2020-06-26",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "A sweet boy from a poor family dreams of finding one of five golden tickets hidden inside chocolate bar wrappers which will admit him to the eccentric and reclusive Willy Wonka's magical factory. One after another, tickets are discovered byA sweet boy from a poor family dreams of finding one of five golden tickets hidden inside chocolate bar wrappers which will admit him to the eccentric and reclusive Willy Wonka's magical factory. One after another, tickets are discovered by ghastly children - but will the lad find the last remaining one and have all his dreams come true? Willy Wonka and the Chocolate Factory is strange yet comforting, full of narrative detours that don't always work but express the film's uniqueness. I'll give WW & the CF a B+. (8.5/10)",
            "review_date": "2018-10-14",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "a golden ticket for an ultimate experience..Willy Wonka And The Chocolate Factory\n\nThe stunning rich visuals that projects excellence in production and costume design along with amazing graphics in 70's, is the window where the featurea golden ticket for an ultimate experience..Willy Wonka And The Chocolate FactoryThe stunning rich visuals that projects excellence in production and costume design along with amazing graphics in 70's, is the window where the feature lures its audience in and flaunts it majestically. Such a simple yet deep concept is so pleasingly intriguing that one finds itself falling into the world half-way through the feature without even blinking. The passion and enthusiasm for such an eerie project is why it works for the most part of it while the rest is left upon its dark humour which may not be hilarious but certainly offers a chuckle every now and then. A gripping screenplay by Roald Dahl, himself who wrote the original book from which it is adapted, and Mel Stuart with his brilliant execution skills ups the ante and easily allows it to enter into the major league. On performance objective, Gene Wilder is stunning and satisfactory as usual and is supported by talented young actors and their humorous guardians. The first act is hilarious and exhilarating and longer than usual (which it doesn't seem so) after which it goes into dark place in its rest of the act but even that tone is so certifiably pleasing that no one minds it despite of being a feature primarily for children. Willy Wonka And The Chocolate Factory is a golden ticket for the ultimate cinematic experience where it doesn't bother to worry about its diplomacy and rather lets itself sink into its self-created poetic world.",
            "review_date": "2018-05-31",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "It's Gene Wilder, at the top of his form, who made this unique imaginative adventure more vibrant and gleeful. His energetic performance is by no means different from Julie Andrews as Mary Poppins. He absolutely deserved ,at least, an OscarIt's Gene Wilder, at the top of his form, who made this unique imaginative adventure more vibrant and gleeful. His energetic performance is by no means different from Julie Andrews as Mary Poppins. He absolutely deserved ,at least, an Oscar nomination. The movie lost some of its sharpness and suffered from some monotony after some time from reaching the factory. But besides the gorgeous production design and cool visuals, there was Wilder's charisma that helped to elevate the movie. The first half of the movie has great emotional value, and established the characters very well. Also, it feature some of the most beautiful songs of the movie. But due to the fast pacing, there was an action in the first half that felt forced, if it was necessary to serve a turning point of the story.There are many powerful and very important messages in the movie. But the greatest thing about them is not actually the messages themselves, as we witnessed them delivered in a lot of movies before, but it's how genuine these messages seem as they are delivered in this particular story. Peter Ostrum is great in his first and ,unfortunately, his last role. There are many dramatic scenes that required a very good actor and he is. Actually, I didn't feel for even a moment that this is his acting debut. Willy Wonka & the Chocolate Factory is a total blast from start to finish.It's Scrumdiddlyumptious!(8.5/10)",
            "review_date": "2018-06-02",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Family classic, great actor choices and the factory itself is SO BEAUTIFUL!!!!",
            "review_date": "2018-11-13",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "one of the best movies ever made. Way above expectations for the 70's. Star wars 77 is another one ahead of its time as well.",
            "review_date": "2020-06-18",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "In a world of pure imagination, Willy Wonka & the Chocolate Factory is filled with amazing performances (specifically Gene Wilder and Julie Dawn Cole) and musical numbers that may have you screaming \"I want it now!\"",
            "review_date": "2023-01-17",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This was such a colourful and musical movie about candies and chocolates for children - just like a candy version of The Wizard of Oz",
            "review_date": "2019-04-16",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Everyone knows Willy Wonka. At least I would hope so. One of the best movies ever made. The chocolate is amazing, I wish I could go there.",
            "review_date": "2023-01-15",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "This movie is so weird, and I don't understand why it's so popular, besides maybe an ironic enjoyment?",
            "review_date": "2021-04-25",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Willy Wonka is a childhood memory too me, and looking back at this film brings those memories back! With amazing acting from Gene Wilder, Peter Ostrum, Jack Albertson, and so many more amazing actors! It has an imaginative story, with aWilly Wonka is a childhood memory too me, and looking back at this film brings those memories back! With amazing acting from Gene Wilder, Peter Ostrum, Jack Albertson, and so many more amazing actors! It has an imaginative story, with a little darkness, and so many little things that after watching this movie so many times, I still see little Easter eggs to this day, And many kids films don’t get any attention out into them and they are bad, this is truly a movie that had a lot of time put into it! This is a gem, and one of the best movies I have seen!",
            "review_date": "2021-08-11",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 26
}