{
    "rating": 9.4,
    "release_date": "2022-04-14",
    "num_reviews": 217,
    "genres": [
        "Kannada"
    ],
    "summary": "Anand Ingalgi, a renowned journalist of his times would have written a book EL DORADO on the biggest kept secret in Indian history -- KGF. The government of India would not have permitted him to publish the book for various reasons. But Deepa Hegde accidentally gets her hands on a half-burnt book and listens to half the story from Anand which is KGF Chapter 1. Before Anand could narrate the remaining, he suffers a stroke and is in hospital. Deepa finds Vijayendra Ingalgi, Anand's Son at the hospital who then narrates the remaining story from the research library of Anand Ingalgi. Why did the government burn down the copies of Anand's Book EL DORADO and not allow it to be published? Does Rocky, who at the end of KGF Chapter 1, survive? Does Rocky give a fresh ray of life to the people of KGF? Why does KGF become one of the biggest issues for the government?",
    "reviews": [
        {
            "content": "Only 60% gold. Noise, noise and more noise. Multiple trailers stitched together. Headache worthy, but also one-time watch doesn't hurt.",
            "review_date": "2023-01-26",
            "source": "rt"
        },
        {
            "content": "Average Story\nBad Cast Performance\nBad Action",
            "review_date": "2023-01-19",
            "source": "rt"
        },
        {
            "content": "Worst Overrated Kannadigay GAYGF movie",
            "review_date": "2023-01-19",
            "source": "rt"
        },
        {
            "content": "The movie sequel to KGF, Journey about a Boy promising her mother the gold of the world, shows how a boy from slums becomes the sultan(King) of his time, best movie hace watch 4 times in theater and 5 times in ott",
            "review_date": "2022-11-06",
            "source": "rt"
        },
        {
            "content": "Overhyped beyond imagination. Pathetic & illogical storyline. A complete let down compared to KGF1. We folks started watching it with lot of excitement but with every scene, it got stupider and stupider and every now and then we looked at each other and shook our heads like \"what the hell!\"",
            "review_date": "2022-10-27",
            "source": "rt"
        },
        {
            "content": "Sheer brilliance with respect to editing, cinematography, actions",
            "review_date": "2022-10-20",
            "source": "rt"
        },
        {
            "content": "Overall the best movie of this year.\nWatching this in theater with friends in\na large crowd was an unforgettable lifetime experience.",
            "review_date": "2022-10-19",
            "source": "rt"
        },
        {
            "content": "Loved the movie.  From Yash's entry to kalashnikov , from calling himself the CEO of India to showing Rocky's rage in fighting Adheera the movie is an absolute fab.\nKGF is not a movie,  it's an emotion. \nRocky is the best bad boy ever.\nYash and Prashant Neel we love you as you set the screen on fire.",
            "review_date": "2022-10-12",
            "source": "rt"
        },
        {
            "content": "Awesome direction, and amazing acting",
            "review_date": "2022-09-24",
            "source": "rt"
        },
        {
            "content": "Blocbuster movie of the year!",
            "review_date": "2022-09-21",
            "source": "rt"
        },
        {
            "content": "Best movie.every one must watch it",
            "review_date": "2022-09-13",
            "source": "rt"
        },
        {
            "content": "The movie was just awesome 😎✨ Rocking performance by Rocky and all actors",
            "review_date": "2022-09-13",
            "source": "rt"
        },
        {
            "content": "Worst Storyline. The face of the protagonist always remains the same throughout the whole movie. It's only for the masses. In India, a movie like Tumbbad never gets appreciated whereas this kind of crap gets all the hype in the world. We need to understand we as an audience have our responsibility also.",
            "review_date": "2022-09-12",
            "source": "rt"
        },
        {
            "content": "First of all it's from Regional cinema, Classic cinematography, Dialogues are one Number,\nMusic(BGM) is bad ass, Yash's costume is superb.",
            "review_date": "2022-09-10",
            "source": "rt"
        },
        {
            "content": "It is one of the worst movies I have watched in 5 years.",
            "review_date": "2022-09-08",
            "source": "rt"
        },
        {
            "content": "Best movie of this era",
            "review_date": "2022-09-07",
            "source": "rt"
        },
        {
            "content": "There are a lot of movies with weak story and and weak production but this movie is the one that become successful with everything weak and that's not a good thing for Indian cinema",
            "review_date": "2022-09-04",
            "source": "rt"
        },
        {
            "content": "A amazing sequel with small different thrills with a fabulous bgm and a awesome storyline and dialogues that will win your heart.",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "bruh bollywood is dead this is the perfect combo of thriller romance action comedy etc this is the best movie i ever watched so far",
            "review_date": "2022-09-03",
            "source": "rt"
        },
        {
            "content": "People who given less rating are really chutiyas and fucking marons of our country",
            "review_date": "2022-09-01",
            "source": "rt"
        },
        {
            "content": "you'll enjoy it only in a packed theatre, a movie so overhyped that even its most loyal fans wouldnt wanna watch it while sitting idle at home on tv",
            "review_date": "2022-08-30",
            "source": "rt"
        },
        {
            "content": "Masterpiece....a cult movie",
            "review_date": "2022-08-26",
            "source": "rt"
        },
        {
            "content": "Great Movie...\nMust watch this Masterpiece..\nFirst time in india dark camera work...\nVery brilliantly.. yash acting was superb \nDirection was superb..\nNeed to more popularity in Ott Platforms \nThat kind of films show strength of story \nIdea of big vision..\nNetflix should shows KGF 2 movie to his Platform. Because 100% KGF2 create History \nAnd world need to see this.\nNetflix must collaborate with kgf2 MUST..",
            "review_date": "2022-08-19",
            "source": "rt"
        },
        {
            "content": "Such an. Amazing movie.... 🔥🔥🔥🔥🔥",
            "review_date": "2022-08-17",
            "source": "rt"
        },
        {
            "content": "A larger-than-life, highly enjoyable rags to riches, urchin to overlord movie. The dialogue is cutting and immensely funny, the action is out of this world, and the emotional storyline is very moving. Kash plays Rocky brilliantly, and Sanjay Dutt is an amazing nemesis. The movie seems like a modern-day myth, or a lost city of El Dorado and its untold riches. Brilliant and definitely worth sitting through the epic 5-hour story.",
            "review_date": "2022-08-04",
            "source": "rt"
        },
        {
            "content": "Well I liked the film for the uniqueness of the characters, story and cinematography in KGF. A Kannada film of this huge is one of a kind, not only that one of the biggest film during these pandemic times. Loved every bit of it. What I disliked was just a bit of VFX here and there, that's it.",
            "review_date": "2022-07-28",
            "source": "rt"
        },
        {
            "content": "Greatest movie no words to express it, if someone gives least critics they are called haters 🔥the movie is filled with perfection, \nCast and crew \nPlot \nCinematography \nDirection\nEmotion \nAnd this movie is filled with goosebumps 🔥🔥",
            "review_date": "2022-07-21",
            "source": "rt"
        },
        {
            "content": "One of the best movie from Kannada industry",
            "review_date": "2022-07-07",
            "source": "rt"
        },
        {
            "content": "K.G.F Chapter 2 is a letdown for me as compared to chapter 1. While Yash rocks as rocky he loses out on the charming humor due to the lack of laughs in the script making this installment less fun. The action sequences are bigger this time around, but again it loses out on the oomph factor with its execution. In chapter 1, Rocky was more of an assassin, a one-man show who played smart to get the job done, this time around either he walks with an army behind him or just walks alone without any plans, which does give us some thrilling sequences but overall way over the top.  Still a fun watch and hoping for Chapter 3.",
            "review_date": "2022-07-04",
            "source": "rt"
        },
        {
            "content": "Literally the best and most impactful movie I've ever seen. And The Man Rocking Star Yash did it what nobody ever could. Hats off for the whole team of kgf 2 and Thank u for sharing ur outstanding masterpiece. Kgf was a hell of a ride. Can't wait for Chapter 3. Bring it on already. We are rooting",
            "review_date": "2022-07-03",
            "source": "rt"
        },
        {
            "content": "Again, those Hindi India movies are state of the art, as good as anyone.  This one was a hard to believe (but based on true story?) about a crime boss that threatened to go to war with the entire India military.  I missed the first prequel 'Chapter 1.  Have to be prepared to read a lot of English subtitles, so it's kinda like reading a book.  As usual in such India movies, very loud thunderous music, as another reviewer said, and 'hypermasculine' characterizations. \nI give it 4 RT stars, cuz EPIC, even if not 'Awesome'. \nSaw it  4-21-2022,  in 'lerton, AMC A-List tix",
            "review_date": "2022-06-28",
            "source": "rt"
        },
        {
            "content": "THE BLOCKBUSTER OF THE YEAR 2022!!!! The movie is getting hate by everyone for no reason. Had a better storyline than RRR, and the cinematography will make you remember Zach Snyder. The action scenes were unique and fresh. But, still gaining no attention from the international audience. The character bonding of Reena and Rocky could be improved as it would have caused more effect in the end. Overall, a great sequal!!!!",
            "review_date": "2022-06-26",
            "source": "rt"
        },
        {
            "content": "I can give credit to cinematography team and the action sequences were brilliant but the lackluster story bored me to death with illogical scenes.",
            "review_date": "2022-06-25",
            "source": "rt"
        },
        {
            "content": "Utter Sh*t Worst Movie Overhyped and Overrated",
            "review_date": "2022-06-23",
            "source": "rt"
        },
        {
            "content": "out of the world!! next level",
            "review_date": "2022-06-18",
            "source": "rt"
        },
        {
            "content": "What is wrong with people right now? And ths is today, not yesterday. How can this movie be hailed? Or even encouraged? \n\nAbsolute nonsense of a movie. If one were to blindly beleve that the proragonist is immortal, then why bother with all the extravagant setup for fights when we all know what s going to happen. \n\nAt numerous times in the movie, Rocky could have been killed by an amateur shooter. Yet the movie contnous in its mindless indulgence of voilence and fight scenes with only one inevitable result. \n\nEven the ending is so undeniably egoistic and absolutely comical. I am not sure what movies are supposed to be anymore. Is it supposed to entertain the audience. Because, it sure as hell didnt do that. \n\nThe only thing ths movie is successful is in immortaliznig the protagonist and the actor 'Yash' \n\nAbsolute joke of a movie. I am absolutely disappointed with the audience of this world. \n\nThankfully I watched it on TV, where I could skip the unbearable parts.",
            "review_date": "2022-06-13",
            "source": "rt"
        },
        {
            "content": "\"K.G.F: Chapter 2\" knows exactly what it is and for that, I have to give it props. This is a movie completely focused on insane action scenes without any real emphasis on realism. The movie is a lot of fun and I think technically better than the first one. I feel like both movies suffer from way too much going on and just a bit too much goofiness, but all in all, they're a good time. I think this movie engaged me plenty and had a lot of solid entertainment value. Overall, I think it is a slight step up from the last one and I would fully be on board seeing the third part as it does set up for one after the credits roll.",
            "review_date": "2022-06-12",
            "source": "rt"
        },
        {
            "content": "Weak story, movie was all about cinematics, over hailing and giving examples in the name \nprotagonist again and again..  if you are expecting a good story just leave this movie otherwise you can watch it.",
            "review_date": "2022-06-06",
            "source": "rt"
        },
        {
            "content": "a bloodbath sequel to outgrow the predecessor. this movie takes the idea of gangsters and violence to new heights.",
            "review_date": "2022-06-04",
            "source": "rt"
        },
        {
            "content": "Best action indian movie",
            "review_date": "2022-06-01",
            "source": "rt"
        },
        {
            "content": "Great story, mind-blowing performances and perfect shots captured with rich setups and staging.. Rocky Bhai performance is stunning....",
            "review_date": "2022-05-30",
            "source": "rt"
        },
        {
            "content": "I think this is an amazing movie. I have never seen a movie like this. Both parts are really amazing. This becomes one of my favourite movies rn.",
            "review_date": "2022-05-24",
            "source": "rt"
        },
        {
            "content": "Very brilliant camera works. even though the story was small the presentation made this movie awesome. It must be watched from theatre, it's very next level.",
            "review_date": "2022-05-21",
            "source": "rt"
        },
        {
            "content": "A larger than life hero, more of a superhero. but a little far from reality.",
            "review_date": "2022-05-19",
            "source": "rt"
        },
        {
            "content": "Definitely one of the Best movie of 2022",
            "review_date": "2022-05-17",
            "source": "rt"
        },
        {
            "content": "Bad ass movie, loved it!!",
            "review_date": "2022-05-16",
            "source": "rt"
        },
        {
            "content": "Oh shit here we go again another Massive action movie 😈",
            "review_date": "2022-05-15",
            "source": "rt"
        },
        {
            "content": "blockbuster movie if you have not watched this movie you have not watched anything till now its songs and this movie is addictive",
            "review_date": "2022-05-11",
            "source": "rt"
        },
        {
            "content": "Amazing movie! Larger than life imagination and very well executed. Haven’t seen a movie like this.",
            "review_date": "2022-05-10",
            "source": "rt"
        },
        {
            "content": "Awesome movie. Liked by younger generation as per news media",
            "review_date": "2022-05-07",
            "source": "rt"
        },
        {
            "content": "I love the movie and I enjoyed in theatre first day first show 🍿🍿🍿🍿🍿🍿🍿 #Rockybhai",
            "review_date": "2022-05-06",
            "source": "rt"
        },
        {
            "content": "The storyline of this movie is just amazing and The acting is also Superb. This is a blockbuster cinema with an amazing story and acting. Although there are some suspences, the whole movie is based on a powerful full story. After a long time waits, we got this movie or we got a chance to with this movie. Overall a very very good movie actually not only good but also the best.",
            "review_date": "2022-05-06",
            "source": "rt"
        },
        {
            "content": "Dialogue delivery, movie making awesome. Its a complete entertainment package.",
            "review_date": "2022-05-04",
            "source": "rt"
        },
        {
            "content": "Right from the start you will have goosebumps,I must mention amazing filmmaking and the direction is portrayed ultimately. one of the finest Indian action movies kudos to the team .Must watch",
            "review_date": "2022-05-04",
            "source": "rt"
        },
        {
            "content": "The first chapter established the tone for a polished gangster film franchise with a lot of flair and attention to detail. The first section was all about establishing Raja Krishnappa Bairya aka Rocky Bhai's goals and strength. With its advertising video that gives a sneak peak inside the film, the second instalment has managed to generate buzz. Is it able to compete with that? It does, and it gives fans a stronger sequel as well as a significant surprise at the climax. For more movie reviews and download kindly visit us at strending.com",
            "review_date": "2022-05-03",
            "source": "rt"
        },
        {
            "content": "Its a Feast to watch on big screen",
            "review_date": "2022-05-01",
            "source": "rt"
        },
        {
            "content": "Movie was to good I like the story line and actor entry. Some of songs also good as well as good action.",
            "review_date": "2022-05-01",
            "source": "rt"
        },
        {
            "content": "Absolute masterpiece. Yash is phenomenal and Prashant Neel is a genius !! There is so much intelligence and depth in this movie you need to watch at least three times to comprehend some of the underlying layers of brilliance from Pradhant embedded throughout the film. One of the finest films I have seen in a long long time",
            "review_date": "2022-05-01",
            "source": "rt"
        },
        {
            "content": "Nice movie. Good performance by everyone.",
            "review_date": "2022-04-30",
            "source": "rt"
        },
        {
            "content": "Amazing movie with a great story, thrills and fantastic performances.  A must watch for all the bollywood action movie lovers.",
            "review_date": "2022-04-30",
            "source": "rt"
        },
        {
            "content": "Very interesting and super action movie 😃😃",
            "review_date": "2022-04-30",
            "source": "rt"
        },
        {
            "content": "Ok so I’m Italian/American and this movie was in Hindi. With English subtitles. Indian movies are so dramatic and LOUD! Exciting and exhilarating. Action and more action and loud dramatic music. I just LOVED this movie. Take your family to enjoy this spectacle. ",
            "review_date": "2022-04-29",
            "source": "rt"
        },
        {
            "content": "South Indian Movie always always good !! Love it",
            "review_date": "2022-04-28",
            "source": "rt"
        },
        {
            "content": "One of the best action movie released recently in India. A pure theater experience and pure entertainer.",
            "review_date": "2022-04-27",
            "source": "rt"
        },
        {
            "content": "Made the wrong selection did not understand the language",
            "review_date": "2022-04-27",
            "source": "rt"
        },
        {
            "content": "This is a film that has blind support from the people. There are many fundamental mistakes made by the director. A story that could have been done better has been sacrificed for accolades and praise for the character.\nKilled by entering the Prime Minister's Office without any resistance (what a joke?)\n\nseduce the girl and kill her brother but she still falls in love. (anything in character applause)\n\n500 men are shooting Adheera but not a single bullet could touch Adheera (if not a failure of direction what is it)\n\nCEO of India (Unnecessary dialogue)\n\nFrom my point of view, this is not a film but this is Rocky Chalisa in which Rocky is full of divine powers, he can go anywhere and do anything, and no one can touch him even a bullet.\n\nWondering why the missile that went to hit him didn't come back without hitting him?\n\nhigh voltage torture",
            "review_date": "2022-04-27",
            "source": "rt"
        },
        {
            "content": "not sure if it was movie's or AMC's fault but audio was toooo loud",
            "review_date": "2022-04-27",
            "source": "rt"
        },
        {
            "content": "Awesome..Excellent...!",
            "review_date": "2022-04-26",
            "source": "rt"
        },
        {
            "content": "One of the best film ever see",
            "review_date": "2022-04-25",
            "source": "rt"
        },
        {
            "content": "Congratulations & Hatts Off to the Writer-Director PRASHANT NEEL for making this masterpiece and creating his perfect vision and bringing to the audience. Before KGF I've could've never imagine that Kannada Cinema could create such masterpiece but it's all Over Now. From Now On this is the INDIAN CINEMA. Execution & the way director has present the KGF story is just brilliant. It's 2 hrs 48 mins long movie but the screenplay is so fast paced that no one can imagine how this time has passed. Performance of all the actors and supporting cast has just nailed it. YASH is not a star HE IS THE REAL MONSTER when it comes to acting and his presence in the movie and so as SANJAY DUTT. \nBGM & ACTION SEQUENCES are just too damn good that it can't be ignored. Specially the climax is just too good. Wait for the post credit scene and see the surprise for yourself. Prashant Neel has given the perfect TREAT to the cinema lovers by Creating the world of KGF..",
            "review_date": "2022-04-25",
            "source": "rt"
        },
        {
            "content": "Worth watching more than once, truly. Satisfying must watch experience.  Don’t miss End Credits East er Egg surprise!!",
            "review_date": "2022-04-25",
            "source": "rt"
        },
        {
            "content": "Kgf 2 one of the biggest Indian movie this movie tough to Hollywood movies I hope to reach this movie all over the world I very very surprised to see the movie rocking star Yash is a awesome after and prasanth Neel one of the best directer music also play a role in this movie bgm gets a background score prasanth Neel surprised all the fans all the best for kgf team",
            "review_date": "2022-04-24",
            "source": "rt"
        },
        {
            "content": "Fully satisfied, kgf 1 was awsm kgf 2 double awsm 🥰",
            "review_date": "2022-04-24",
            "source": "rt"
        },
        {
            "content": "Great cinema experience 9/10",
            "review_date": "2022-04-24",
            "source": "rt"
        },
        {
            "content": "KGF gets international in next chapter. I’m waiting.",
            "review_date": "2022-04-24",
            "source": "rt"
        },
        {
            "content": "very good movie please watch it with your friends and family and parents and with your kids",
            "review_date": "2022-04-24",
            "source": "rt"
        },
        {
            "content": "Amazing visuals, goosebumps bgm, awesome cast. Yash nailed it on screen with his charming attitude.",
            "review_date": "2022-04-24",
            "source": "rt"
        },
        {
            "content": "Wow what a powerful movie ! Anatomy of  a Monster !  If ya haven't seen part 1 yet then by all means see it on Amazon Prime Viideo because it is the prelude to chapter 2. Great story and great cast! Top tier acting ! This better get an Oscar! Highly recommended! Makes me wonder if chapter 3 is forthcoming ???  I am fan of El dorado & PM ramikta sen did not disappointed! Heck of a plot twist that I was not expecting ! A roller coaster ride on all of your senses ! I just wish it was in IMAX or Dolby sound but whew visual was just mind blowing !",
            "review_date": "2022-04-24",
            "source": "rt"
        },
        {
            "content": "Impeccable movie! Must watch! Cant wait to see KGF3. Congratulations to whole entire team of KGF",
            "review_date": "2022-04-23",
            "source": "rt"
        },
        {
            "content": "Total action, south does it like no one does",
            "review_date": "2022-04-23",
            "source": "rt"
        },
        {
            "content": "Excellent heroism and elevations!!!",
            "review_date": "2022-04-23",
            "source": "rt"
        },
        {
            "content": "A fitting sequel to the Magnum opus movie franchise. Best movie of the year!",
            "review_date": "2022-04-23",
            "source": "rt"
        },
        {
            "content": "KGF-1-HAS GREAT ESSENCE OF ACTION,THAT TOO CALCULATIVE STEP IN SLOW MOTION TO FOCUS CAMERA FOUND OK-TONE OF THE MOVIE MADE DIFFERENCE-ACTION WAS GOOD-EDITING WAS BEST\nANY DIRECTOR CANNOT MAKE A MASTER PIECE MOVIE ONCE AGAIN-IF HE LIKE TO-ITS A MAGIC-BAAHUBALI-2,ROBO-2,NOW KGF-2-THESE FILM DRIVE IN FRONT TO CASH IN BOX OFFICE IS FEEL THE ENJOY IN MASTER PIECE OF ITS FIRST PART AND LIKE LIVE IN THOSE MOMENT-BUT THESE FILM AGAIN IS GREAT DISAPPOINTMENT -IN FIRST PART ITS DIRECTOR TOUCH WHEN THE BUSINESS BECOMES BIG-THE POWER OF MAKING COMES WITH IN PRODUCER IDEAS-MAKE THE MOVIE MORE MASS SCENE,ADD EXTRA FIGHT,MORE PUNCH DIALOGUE  \nKGF-2\n1)FIRST SCENE-ENTRY IS MASS-BUT LOOSE WORD IN MEETING MAKES IS IMAGE BAD-THIS SCENE CAN BE SHOWN AS-MAY HAVE LESS DIALOGUE -IN A WAY DIED -PAST OWNER OF KGF-PEOPLES PHOTOS CAN BE LIGHTED AND EMPTY FRAME FOURTH SHOWS- WHO PROTEST AGAINST ROCKY BAI WILL LIVE THERE-WILL BE GREAT SCENE\n2)ADEIRAA SHOOTING ROCKY BAI IS WASTE-HE CAN BE SAVED BY ADVISER BAI-DEFEATING ADEIRAA-OTHER FIGHT WITH SANJAY DUTT IS WASTE CAN BE BETTER",
            "review_date": "2022-04-22",
            "source": "rt"
        },
        {
            "content": "It’s best movie of the year",
            "review_date": "2022-04-22",
            "source": "rt"
        },
        {
            "content": "No story, all bakwas!",
            "review_date": "2022-04-22",
            "source": "rt"
        },
        {
            "content": "OG Director & Cast.\nEditing at its best, BGM was OK.\nGreat visual experience.\nA must watch.\nFresh mix.",
            "review_date": "2022-04-22",
            "source": "rt"
        },
        {
            "content": "Full on Entertainment and Surprises",
            "review_date": "2022-04-22",
            "source": "rt"
        },
        {
            "content": "A sequel cannot be better",
            "review_date": "2022-04-22",
            "source": "rt"
        },
        {
            "content": "Fantastic Movie, The Climax Is Awesome...",
            "review_date": "2022-04-21",
            "source": "rt"
        },
        {
            "content": "This is a mass entertainer packed with bad ass scenes where u can feel ur hairs in ur hands  raising up . vfx is not that good at somepoint since its edited by a 19 yr old boy thats pretty good.Must watch from theatre",
            "review_date": "2022-04-21",
            "source": "rt"
        },
        {
            "content": "Top notch from the director in terms of technical aspects",
            "review_date": "2022-04-21",
            "source": "rt"
        },
        {
            "content": "Its awesome movie. Acting has super done by Yash hero.",
            "review_date": "2022-04-21",
            "source": "rt"
        },
        {
            "content": "I went to watch movies its says Hindi with English sub title.but it was telugu with English sub titles .I did not understand at all I just waisted my money",
            "review_date": "2022-04-21",
            "source": "rt"
        },
        {
            "content": "Typical masala Hindi film",
            "review_date": "2022-04-21",
            "source": "rt"
        },
        {
            "content": "Best , Movie Narration, Style, Sentiment, Music, Hero!",
            "review_date": "2022-04-20",
            "source": "rt"
        },
        {
            "content": "Visually captivating, backed by an intriguing storyline, this movie activates the senses and brings on the emotional feelings! It invokes some classical, epical ethos and injects them into the modern, relatable day. Kudos to the entire team that worked on this! Looking forward to more from these creators!",
            "review_date": "2022-04-20",
            "source": "rt"
        },
        {
            "content": "It is the best movie with all emotions actions everything you want in a movie",
            "review_date": "2022-04-20",
            "source": "rt"
        },
        {
            "content": "India's best action movie",
            "review_date": "2022-04-20",
            "source": "rt"
        },
        {
            "content": "Too much violence and too long movie, over 3 hours.",
            "review_date": "2022-04-20",
            "source": "rt"
        },
        {
            "content": "It’s an eye feast for action movie lovers",
            "review_date": "2022-04-19",
            "source": "rt"
        },
        {
            "content": "Excellent movie, One of the best Indian cinema to date,\nIt also expose all media PAID negative review with here so called CRITICS!!! feel shame!",
            "review_date": "2022-04-19",
            "source": "rt"
        },
        {
            "content": "Best movie. waiting for kgf 3",
            "review_date": "2022-04-19",
            "source": "rt"
        },
        {
            "content": "The given percentage is false because Bollywood can't accept it and movie is best ever watched",
            "review_date": "2022-04-19",
            "source": "rt"
        },
        {
            "content": "its the best movie i've ever watched. Completely enjoyed every single bit of the movie",
            "review_date": "2022-04-19",
            "source": "rt"
        },
        {
            "content": "love the soundtrack, special effects, acting. awesome film",
            "review_date": "2022-04-19",
            "source": "rt"
        },
        {
            "content": "Greatest Kananda movie of all time IMO",
            "review_date": "2022-04-19",
            "source": "rt"
        },
        {
            "content": "Awesome freaking movie",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "A joke to the audience's face\nThey know how to grab money from the majority of the illiterate audience\nStill not worse than what Tiger shroff's movies are doing right now",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "Very good and Amazing movie....",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "'KGF: Chapter 2' is an explosive and immersive sequel that is both adrenaline-pumping and highly entertaining.",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "Very good sequel hard work done by team",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "I like this movie a lot with full of action",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "Must watch movie of Yash",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "Awesome movie! Yash's screen presence is awesome. Must watch movie!!",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "Extraordinary movie 🍿🍿. Every one should watch this movie on big screen.",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "Terrible editing, incoherent story, too loud and over dramatic. I knew these type of movies are going to be bad but never knew it will be this bad. \nWhy can't there be simple, normal conversations between the characters? why everyone has to scream so loud? and the dialogues, oh God the dialogues!! Truly cringeworthy.",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "Well done movie for action movie lovers!!",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "Must watch in theatre 🔥🔥 damn good movie",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "Better than KGF1, but sometimes feels too many things are going on, hard to follow.",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "This is one of the best movies In Indian cinema",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "Best movie I watched soo far. made Indians proud.",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "Fantastic movie...\nEnjoyed a lot from start to end..\nEach and every scene was fabulous..",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "One of the best sequels for an Indian movie….👍🏾👍🏾👍🏾",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "Best movie to watch.It’s way better than Bollywood movies. Only thing is some Bollywood actors are getting in South Indian film industry. But South Indian actors are best. This many years Bollywood hasn’t make any movies like BAHUBALI, RRR, KGF 1 and 2. Bollywood only understand making copies…",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "I did not like the language because the movie was supposed to be in Hindi and when we came to the theatre it was in another language (kannada) , so I was disappointed. The movie was awesome",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "fantastic job! well done yash and sanjay dutt",
            "review_date": "2022-04-18",
            "source": "rt"
        },
        {
            "content": "The movie should be watched in theaters to gain that sort of experience. Very well made, great directions and visual effects. Yash has made his masterpiece.. Great Movie!!!",
            "review_date": "2022-04-17",
            "source": "rt"
        },
        {
            "content": "best movie I watched soo far. made Indians proud.",
            "review_date": "2022-04-17",
            "source": "rt"
        },
        {
            "content": "Best awesome movie big fan of Yash super super 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥 jai kannada",
            "review_date": "2022-04-17",
            "source": "rt"
        },
        {
            "content": "Very Nice and super.",
            "review_date": "2022-04-17",
            "source": "rt"
        },
        {
            "content": "Wow super love . Best movie for this year 2022.",
            "review_date": "2022-04-17",
            "source": "rt"
        },
        {
            "content": "Too loud background, weak characterization & the same way of unusual screenplay made me uncomfortable throughout the movie.",
            "review_date": "2022-04-17",
            "source": "rt"
        },
        {
            "content": "The performance of Yash as Rocky bhai is absolutely Killer. His style, swag, passion, dialogue delivery is terrific. He has set the screen on fire with his insane screen presence.",
            "review_date": "2022-04-17",
            "source": "rt"
        },
        {
            "content": "Awesome movie. Everyone acting is way above expectations. Must watch see. Watch kgf chapter 1 before chapter 2.",
            "review_date": "2022-04-17",
            "source": "rt"
        },
        {
            "content": "Yesterday i watched a this movie and i come again today with my brothers this movie.from beginning to the end movie is totally superhit..i enjoy the whole movie.",
            "review_date": "2022-04-17",
            "source": "rt"
        },
        {
            "content": "Must watch beat all Bollywood movies ,kfG2 is winner on box office also it should pass all records and set a benchmark..plz Bollywood actors watch it and learn how u can make any pictures second part..",
            "review_date": "2022-04-17",
            "source": "rt"
        },
        {
            "content": "full action and good story 1&2 bott movies are good",
            "review_date": "2022-04-17",
            "source": "rt"
        },
        {
            "content": "Screenplay and direction is outstanding!",
            "review_date": "2022-04-17",
            "source": "rt"
        },
        {
            "content": "It was unbearably loud and senseless action sequences.",
            "review_date": "2022-04-17",
            "source": "rt"
        },
        {
            "content": "Awesome movie \nEveryone must watch this movie",
            "review_date": "2022-04-17",
            "source": "rt"
        },
        {
            "content": "best movie of all time.",
            "review_date": "2022-04-17",
            "source": "rt"
        },
        {
            "content": "Absolutely amazing! Must watch.",
            "review_date": "2022-04-17",
            "source": "rt"
        },
        {
            "content": "very well written, well directed and well acted movie. A realistic vision in commercial movie format. \n\nThe movie plot is based in 1975 to 1990 time.\nOne needs patient mind and passion for Politics as this movie makes you think how wrong people in government position makes it about their Ego not about country.   \nwhile, someone who is doing same thing for benefits/progress of People but does not hold Leading position are proven wrong instead. \n\n\n but the story is based on India's history where Britishers did exploited Indian Gold mines.",
            "review_date": "2022-04-17",
            "source": "rt"
        },
        {
            "content": "it's a treat to the eyes.",
            "review_date": "2022-04-16",
            "source": "rt"
        },
        {
            "content": "Hardcover action larger than life. Enjoyable but one time watch.",
            "review_date": "2022-04-16",
            "source": "rt"
        },
        {
            "content": "Simply marvelous! Yash is top notch!!!",
            "review_date": "2022-04-16",
            "source": "rt"
        },
        {
            "content": "Action film those who loves violence will definitely liked it. Acting by all the characters are awesome. I enjoyed each and every moments.",
            "review_date": "2022-04-16",
            "source": "rt"
        },
        {
            "content": "This film is a masterpiece and the storytelling at its best! Best film in the world.. Nothing exaggerated.",
            "review_date": "2022-04-16",
            "source": "rt"
        },
        {
            "content": "Awesome movie♥️ Must watch ✌️",
            "review_date": "2022-04-16",
            "source": "rt"
        },
        {
            "content": "Best movie of the year! Oooof, that plot was too good. The screenplay and direction were amazing. \nThose who say there's no plot and only action failed to understand what happened in the movie. What narration and critical decisions are taken in the movie, just wow!! \n\nI'm writing this as someone who's not a fan of chapter 1! A definite must-watch.",
            "review_date": "2022-04-16",
            "source": "rt"
        },
        {
            "content": "the editing and sound were a huge headache and the slow-motion was a little too much it's silly that you need a 100 drummers to give a great entrance for the hero but that\"s what most of the audience wanted",
            "review_date": "2022-04-16",
            "source": "rt"
        },
        {
            "content": "Too long to handle. Very unrealistic and intolerable. Unnecessary actions and build up.",
            "review_date": "2022-04-16",
            "source": "rt"
        },
        {
            "content": "Story line , narrative , direction , cinematography and acting everything is top notch !",
            "review_date": "2022-04-16",
            "source": "rt"
        },
        {
            "content": "Kutha Ramp Movie, BGM ayithey Arupulu anthey Waiting for Chapter 3",
            "review_date": "2022-04-16",
            "source": "rt"
        },
        {
            "content": "This shit was Hella good idk why people are giving it low rating but this was worth the hype",
            "review_date": "2022-04-16",
            "source": "rt"
        },
        {
            "content": "awesome movie.. story narration and action sequences are super",
            "review_date": "2022-04-16",
            "source": "rt"
        },
        {
            "content": "Amazing. Fabulous performances.",
            "review_date": "2022-04-16",
            "source": "rt"
        },
        {
            "content": "Very well made … Amazing",
            "review_date": "2022-04-16",
            "source": "rt"
        },
        {
            "content": "Great movie Yash is rocking",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "Entertaining, met with my expectations",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "This movie was most waiting movie after I had watched the 1st part. I really enjoyed watching 2nd part too . Just loved it…",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "This a mind numbing shittiest movie I have ever seen. Director does a terrible job at story telling with his bizzare cross cuts and way too many expositions. Editing is horrendous,feels like watching a fast paced music video. Movie butchers all the crafts that there is. I want to give 0 stars but I can't.",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "Go See super good. Money well spent.",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "A really good movie, don't go on the reviews,would recommend watching it on the big screen first, trust me... it's worth it",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "MONSTER BLOCKBUSTER.... Bollywood promotes anti-hindu whereas SOUTH INDIAN movies upholds Hindu traditions.",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "Best movies in this universe",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "Amazing movie I've ever watched in my entire life!!! I would highly recommend everyone to watch KGF chapter 1 and 2.",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "Vikrant Rona its a really Amazing movie must watch in theaters, actors acting is so superb , songs & bgm is wonderful, action and visual effects is awesome, Movie story we cant guess till climax there is so much of suspense in end",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "KGF 2 is just Market Hyped movie. Director taken this long time to just Copy and Paste KGF 1. Exceptionally added two additional characters to create a Terror -masala. Hero got is nothing more than modeling",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "Better then chapter 1 🔥🔥🔥🔥",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "Great Movie you should watch it. You won’t get bored for a moment that’s a promise😻",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "if KGF chapter is atombomb\nKGF chapter 2 is Nuclear bomb 🔥🔥🔥",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "Must watch film. A perfect sequel. Pure goosebumps. Experience it in theatres 💥💥",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "A must-watch film for EVERYONE!!! Most bad-ass film EVER!!! I hope there is KGF chapter 3 in future. And Rocky is my personal favorite character OF ALL TIMES!!!",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "Awesome movie... I don't have words to express the emotion... You can watch by yourself and experience what I'm talking about",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "Awesome movie! Rocky Bhai rocks!!!",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "Its a wonderfully crafted fictional Mass entertainer. These words would explain the whole movie altogether.\nThere are two types of movie audience type and critic type. I'm a type of person who loves critic type of movie. But this one here clearly belongs audience and I loved it. I would like to appreciate the director for tricking me to forget abt logic and convinced me to enjoy the Movie irrespective of  the flaws it has got. The narrative, Visuals, background score, writing of screenplay are the huge plus factor. He has given more importance to the writing. Screenplay is so engaging that you will have no time to think abt all those logics. Backed by constant BGM and Wonderful cinematography. (they never let their director down throughout movie)\nI understand if a critic gives less ratings, but you can't deny the fact that adrenaline rush your body went through while watching this movie. I know its not a perfect movie but I love the way it made me feel.",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "Simply stunning. Fully action packed movie with amazing bgm and soundtracks, incredible visuals, good plot twist and ofcourse mind blowing dialogues and mass scenes. An improved version of it's prequel. One hundred percent theatre watch movie. PS: visit the biggest theatre both visual and audio wise for the best experience :)",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "Best Blockbusters Super Duper Hit  KGF Chapter 2 over waiting for KGF 3",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "Masterpiece 🔥 awesome directions , Action , Emotion,small comedy touch ,full of gusboom , and ravi basur song . score play another level 🔥",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "Super Hit\nVery good storyline, high quality VFX. Awesome level acting, outstanding music",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "love it yash is awesom .super duper hit movie",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "I enjoyed a movie but theater is too small for houseful audience.",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "Very powerful, loved the narration",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "Narration, Acting, cinematography is excellent. no words to describe the work by Prashant Neel and team. excellent movie. must watch by everybody. there is subtitles for everyone. proud to be from the region where this movie is made. ❤️❤️❤️ Thank you for giving us such a good cinema.",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "Loved it, action packed.  Yash is awesome!!  He has that swag in this role.",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "It was an entertaining and mass movie. Punch lines were amazing. Made you tickle all through the movie.",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "it's amazing movie I been waiting for years I saw some reviews of critics and they criticizing this movie this what they do they appreciate shit and ingore good only true critics are audience not sold critics",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "Back ground music 💥💥💥",
            "review_date": "2022-04-15",
            "source": "rt"
        },
        {
            "content": "worth watching in big screen best movie ever",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "Blockbuster Movie 🎥",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "Fully entertained loved it",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "Blockbuster with little hiccups here and there. Mass elevations ka baap this movie. BGM is the next hero and backbone of this movie after Yash and Prashanth Neel. Must watch in theatres only to experience the massy heroism. Yash hammer is fully loaded against Sanjay Dutt's knife.",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "Prashanth Neel does it again with the most awaited sequel. Can’t wait for Part-3, good cliffhanger at the end. Buy your tickets, it’s worth your ticket 🥵🔥",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "Hollywood level action",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "Entertainment.. Entertainment",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "I loved this movie this is not only a movie this is emotion.\nThe characters in this movie is too good and background score and songs are soo much good which gives goosebumps. Rocky bhai was on fire.\nOverall it is fantastic movie and it is gonna break all the records",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "Its too good, awesome movie.",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "If you paint a motion picture, it would look like this",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "if you loved the first part, you will love second one too.... go for it",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "Excellent movie.. Must watch better than RRR graphics",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "KGF KGF KGF\nI don’t like it\nI avoid\nBut KGF likes me\nI can’t avoid",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "Story screenplay acting all superb! Best movie I’ve watched till date!",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "its just fucking good",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "The best sequel to any movie!",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "Awesome movie , Pysa vasool.",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "An excellent follow up to the first chapter. The actors and the technical team have complemented each other very well to put together an successful enterprise which we shall cherish for a long time to come. It is totally worth all the wait!",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "exceptional movie. Blockbuster. pinnacle of indian cinema. must watch in imax or big screens. there is a post credit scene, so beware.",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "Powerful people makes powerful stories. Good job guys.👌👍",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "Yash, Cinematography, ART, Background score, and Action scenes are the highlights of the film.",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "Excellent storyline , acting , swag of Yash and screenplay for the star of the movie !!!",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "Keep your expectations high and watch it. Definitely you will love it. End cards mukyam bigilu…!",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "Extraordinary movie.Must watch. Prashanth Neel’s direction is top notch",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "Watch it for Rocking Star Yash!!! High Octane Scenes and Yash carrying the film on the whole 👍🏼👍🏼",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "Nice action movie with background sound👌👌",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "Everything is beyond imagination in this movie. Loved it!!!!!!",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "This was a great sequel no doubt !!!",
            "review_date": "2022-04-13",
            "source": "rt"
        }
    ]
}