{
    "rating": 9.4,
    "release_date": "2022-03-25",
    "num_reviews": 430,
    "genres": [
        "Telugu"
    ],
    "summary": "The story of freedom fighters Komaram Bheem and Alluri Sitarama Raju.",
    "reviews": [
        {
            "content": "Awesome audio and visuals but disliked the unnecesary slow-mo and overacting from Malli",
            "review_date": "2023-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have been passing this movie by because i thought it would be voice over due to language. That wasn't the case at all!!!! And am I glad I gave it a shot! The movie was fantastic throughout all three hours! I could have watched a fourth!! The visuals, special effects and storyline were incredible all the way through. ❤️🥰❤️",
            "review_date": "2023-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bollywood madness meets John Woo style action in an impossibly intriguing movie that somehow justifies it's runtime through sheer spectacle and mind bending action sequences.",
            "review_date": "2023-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic, over the top Bollywood!  Must See!",
            "review_date": "2023-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RRR was over-the-top melodrama and didn't exactly portray the British fairly or accurately. But it was enough dumb fun to sustain its three-hour run time.",
            "review_date": "2023-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty awesome action. The leads are metaphors and therefore given super human powers. And they use them in some pretty creative ways.",
            "review_date": "2023-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A cinematic party. loved every second.",
            "review_date": "2023-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Emotionally stirring story, engaging acting, superb action, beautiful cinematography, lavish songs and dances.  What more does one want in cinema?",
            "review_date": "2023-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome Movie!! Hilarious and epic dance and fight scenes. One of the best Indian Movies!",
            "review_date": "2023-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, just wow.  Such a superb movie. Hollywood take note, This is how you make an epic movie.",
            "review_date": "2023-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A touching story about friendship.",
            "review_date": "2023-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was captivated from the first 30 seconds!\nHollywood hasn't made a movie this good in 40 years!",
            "review_date": "2023-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "never watched bollywood (actually tollywood this time) at all, had some experiences as a child as I have an indian backgorund but the style was so different from what I' used that I've always kind of snubbed them, have to say, this movie changed my prospective in a lot of ways!",
            "review_date": "2023-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was a good movie that crossed super hero action scenes with a basic story about people. That was weird but once you shrug that off it becomes enjoyable. Like all Indian films they break k to song and dance whenever they feel like it. Serious movie goers are wtf but besides that it's worth watching.",
            "review_date": "2023-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay now I am feeling guilty for rooting for \"Everything Everywhere All at Once\" for Best Picture. I loved the movie but \"RRR\" was robbed!\n\nIt has everything you could want: It's got action and adventure, edge-of-the-seat moments, friendship, betrayal, love, beautiful woman and hot men, wild animals, amazing SFX and cinematography, great music, humor, and epic fight scenes, AND a dance battle! You don't even mind the dubbing. (Watch it in English on Netflix) It's a bit long, but the time flies!",
            "review_date": "2023-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "THIS MOVIE WAS SO DANG GOOD! WHAT THE? THE STORY WAS AWESOME, THE CHARACTERS WERE ENGAGING, AND THE MUSIC NUMBER WAS FANTASTIC!",
            "review_date": "2023-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This changed my life",
            "review_date": "2023-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie may be another Indian movie but this movie is now one of my favorites but not as good as Bahubali 2.",
            "review_date": "2023-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest movie in the world. \nWonderfully made. Top Notch acting, Choreography, Action scenes & Dance Sequence. \nIt deserves all applause. \nAmerican movies lack what this movie has. \nSo happy to witness this masterpiece.",
            "review_date": "2023-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this spectacular treat of pure action and adventure.  I have to caution that it's 3 hours long, but it goes by quickly, or watch it streaming in two sittings if you must. It's also got gallons of blood so it's not for the kiddies. It's a fictional story about two real heroes of India's revolution, Raju (Ram Charan) and Bheem (NT Rao Jr), against the British Raj in the 1920s. They never met in real life but the film supposes they did. The two handsome stars become friends not knowing they are on opposite sides. A little girl, Bheem's sister, is kidnapped by the British. While they try to rescue the girl, Bheem falls in love with the governor's niece. And then one has to wonder if the men's friendship can ever survive what befalls them. The action and stunts are astounding, The sets are colorful. The music and choreography excel. You won't be able to get the tunes out of your head. You have to take that leap of faith that two men could have such extraordinary strength. But this story of their friendship and their fight against the Raj as they try to rescue the girl is amazing. RRR supposedly means Rise Revolt and Roar, or else it stands for the initials of the two stars and the director (SS Rajamoulli, the Spielberg of India). There are subtitles. The symbolism abounds, for those knowledgeable of Hindu or Telegu custom, but for me, that went over my head. I loved this anyway. And, those two men can dance!",
            "review_date": "2023-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie i have ever watched",
            "review_date": "2023-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was such an amazing movie! It reminded me of old time Hollywood with the large scale epic productions. Even though the movie is three hours, it is non stop and never once was I bored. There are parts that might be considered hokey. But I enjoyed the overall story, the dance numbers. The leading actor who plays a soldier is so dashing! This movie should have been nominated and won for best picture. It will be one of my all time favorite movies.",
            "review_date": "2023-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Over the top\" doesn't even begin to describe this movie.  It was pretty ridiculous and crazy.  But, overall it was still an entertaining movie with a decent story.",
            "review_date": "2023-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. What a journey. This movie has. it. all.",
            "review_date": "2023-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I am in the minority it seems. I thought this movie was horrible. The only good things were the 2 dance numbers.",
            "review_date": "2023-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't geta it but it is imposible not to watch and finish it",
            "review_date": "2023-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spectacular  Academy Worthy  Special Effects Breathtaking  Two male leads awesome",
            "review_date": "2023-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was long,  but I was engrossed from start to finish. This movie has great acting, a great plot, and a great premise. You'll love the Oscar-winning song. I definitely recommend it.",
            "review_date": "2023-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An out and out entertainer with slick direction, stunning visuals, great music and some fine performances.",
            "review_date": "2023-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great music, culture was shown very well. Got to be one of my favorite movies by far.",
            "review_date": "2023-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RRR is entertaining and visually pleasing. It roars with high-energy dances and a decent storyline.",
            "review_date": "2023-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the most incredible Indian action movie I've ever watched its sad and hype I'm glad there wasn't any bad or sad ending",
            "review_date": "2023-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "didn't think I would like a bollywood movie but this one was very entertaining. I will look out for others now.",
            "review_date": "2023-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not what we expected , cheesy at best but a fun light watch !",
            "review_date": "2023-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "go watch this movie right now",
            "review_date": "2023-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie was very well done. It could've been an hour shorter. It was just so dragged out. It literally passed the time while I was recovering.",
            "review_date": "2023-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a lot of crazy over-the-top fun with great performances that were very heartfelt.",
            "review_date": "2023-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the embodiment of every feeling i had ever felt and the anger and love battling inside me. This just gives me goosebumps when I see the revolutionaries rose and fought for freedom.",
            "review_date": "2023-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The storyline and themes were magnificent. But the action sequences were more hokie than a Marvel movie, and the explosions were reminiscent of a young Michael Bay. S. S. Rajamouli apparently tried to merge Iron Man, the Karate Kid, and the Passion of the Christ. \nA real trip.",
            "review_date": "2023-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If something doesn't make sense, a good dance with solve everything. Fun to watch",
            "review_date": "2023-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As with most bollywood films, it's a movie on steroids. Impactful becomes moving, sad becomes depressing, and corny becomes REALLY corny. Keeping that in mind- It's amazing, 97/100",
            "review_date": "2023-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the most entertaining movie I've watched in years. It's over the top in all aspects but, it also has little details sprinkled all around its length which, if you pay attention, would bring you many moments of awe as the film progresses. The story is elevated by the best soundtrack I remember, which had me humming the songs even if I do not speak the language. However, what in my opinion makes this movie better than it could have been, is the fact that has two main characters, the charisma of N.T. Rama Rao and Ram Charan, and the chemistry between them is a joy to see because as its core, this movie is about pure, umblemished friendship between equals",
            "review_date": "2023-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A few questionable CGI moments. Well worth the 3 hours!",
            "review_date": "2023-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It lost me halfway through. Too long and boring. Plot is very confusing. These two guys were supposed to both be freedom fighters against the British government but instead fight each other. Raju is supposedly a police mole but the movie doesn't reveal this for 90 minutes and by then I was confused, bored and over the whole thing",
            "review_date": "2023-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RRR is the biggest masterpiece film ever..The emotional drama along with loads of entertaining scenes wants you to watch film unlimited number of times..Best film for repeat viewership in theaters and home..",
            "review_date": "2023-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So ridiculous, it was awesome!!!",
            "review_date": "2023-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yeah RRR is one of the best movie of India",
            "review_date": "2023-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most fun I've had watching a movie in years. Pulled off the striking accomplishment of filling 3 hours that feel like not a single moment is wasted. Just pure, unadulterated movie fun, distilled into action and heartfelt storytelling.",
            "review_date": "2023-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never seen anything like it. Setting a new bar for action movies. Still waiting for the adrenaline to die down.",
            "review_date": "2023-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hands down, the best revolutionary-based Indian Film set against the backdrop of the British Raj. With feet-tapping songs to the grippingly choreographed action sequences, RRR will want you to go back to it on repeat! This one is truly a treat for the senses.",
            "review_date": "2023-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie, highs, lows, happiness, sadness and visually terrific . \nMusic and videography were great. Story line intense",
            "review_date": "2023-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best filme of 2022!!!!",
            "review_date": "2023-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Holy. Cow. I HIGHLY recommend this film. It is so much fun, it's absolutely beautiful, and it has so much heart to it. This is the perfect introduction to Tollywood.",
            "review_date": "2023-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely f'ing epic.",
            "review_date": "2023-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked it quite a lot.  The 3 hr plus run time was a concern, but the story moves fast and has enough action that it did not feel long.  It is like a super hero movie, except the heroes are dashing, powerful, committed sort of regular guys and the evil power in this case is Imperial England of the very early 20th C.  Epic proportions in every sense and, a fun, yet at times brutal, romp.",
            "review_date": "2023-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a textbook  of visual storytelling , an epic on friendship , every frame looks like a breath taking masterpiece painting\nthe action of this movie is so  insanely creative and unique , yet  it is so rooted in human emotions .\nif anybody say action do not have heart show them this movie. \nthis movie will be reminded in ages to come.",
            "review_date": "2023-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lol.. Natu Natu got the Oscars 🤣. There are thousands of other Bollywood songs much better than this. Where are their Oscars? Totally bought the award! I know the trick. Give recognition to India because India has a large population. A large population is = a large audience. Audience happiness = more money in Oscar's committee's pocket. Thats why now-a-days everyone is doing something with India.",
            "review_date": "2023-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a ticket back to how it felt to watch movies as a kid. Pure joy.",
            "review_date": "2023-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heard so much buzz about this movie, but the violence kept me from watching the whole thing.",
            "review_date": "2023-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the first Bollywood movie i watched and i gotta say: i want more like this\nMovie was packed with action, humor, And the Visuals were better than some of marvel these days, id honestly expected them to be more like the memes but it wasnt even that awful.\nOverall epic movie",
            "review_date": "2023-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shouldn't have just been nominated for best song. Easily one of the best movies I've seen all year.  The first hour is one of the greatest hour sequences in movies I've ever seen.",
            "review_date": "2023-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved this movie, this hits home. Growing up I have heard stories about how the British treated Indians. My grandparents and my grand aunties, those who are all upset about the anti-British in the movie, how about go read a book or look it up in Google. The British government did not care for their common wealth nations and they have treated them poorly. Even my husband who wasn't indian loved this movie, he asked questions to get a better understanding. For shame for those who complained without learning about the history.",
            "review_date": "2023-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This epic spectacular ticks all the boxes!! Absolutely astounding entertainment  presented in the most perfect and gorgeous cinematography. Don't miss it!!",
            "review_date": "2023-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Top jokers movie of all times. I've lost the credibility on Oscar teams - strongly believe we can buy Oscars now",
            "review_date": "2023-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had a great time watching this movie. I was on the edge of my seat.",
            "review_date": "2023-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Throughout the whole movie, I was jaw-dropped-amazed at the actor's physicality, the choreography of fights and dance, the respect for the historical topic, the amazing stunts, digital performance, and the story showing relationships of best friends and the pains they feel betrayals and grief of misunderstanding.  I've never seen such powerful and explosive physical prowess of the main actors who switch from action fighting to in-synch dancing!  We need to see more Indian movies! There's been such a surge or hero movies in the West that RRR blows them all away.  This means we need to invite movies from India and the world! There are amazing directors, writers and actors we need to discover!  I've seen RRR 5 times and each section of the show is perfectly executed!  In love the actors and the director now!  More please!",
            "review_date": "2023-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Bollywood movie was incredible. Ram Charan, N.T. Rama Rao Jr., S.S. Rajamouli, Alia Bhatt, Olivia Morris, and the rest of the cast did a spectacular job in this movie. The plot of the movie was dramatic, action-packed, and amazing. The choreography in the movie was well done and it was something I've never seen before. It was breathtaking. This movie will go down in history as a worldwide classic. If you haven't seen this movie yet, check it out sometime. It's a definite must see.",
            "review_date": "2023-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We stumbled on this while searching Netflix. We were intrigued by the trailer which made it look like a Tarzan movie. Wrong. I didn't like it. 1. Bad title! - what does it mean??? 2. It's too long at over 3 hours. 3. badly directed in that we had trouble following the story and keeping track og the characters. 4. Which story is this? Started out as a search for a kidnapped girl, then devolving into a revenge/ pursuit film, then turns sharply into a sort of quest film. 5. Sub-titles would have been nice, as the characters all mumble. 6. I didn't like the anti-British aspect, which i think, and hope, was exaggerated, especially the cruelty. Britain could NOT have ruled India all those many decades by being mean to its citizens. 7. The characters are super-natural, which made us think it was either a comedy or a fantasy. The stunts are way over the top with imagination. 8. Disliked all the song and dance scenes--- is this a musical???? Again, too long and confusing. It dragged in the middle, and toward the end I thought it was over. It should have been. Too much. Too many stories, too many characters, too much of everything. I suppose this kind of thing is popular in India and with the counter-culture crowd? I was glad when it finally ended. Sorry, didn't like it. I was rooting for the tigers.",
            "review_date": "2023-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A nearly perfect, genre-bending epic blockbuster is grounded with gritty, honest performances, which make the impossible super-hero level action sequences hit even harder than they would in a typical low-stakes Hollywood movie. The film is beautiful to look at 98% of the time (with a few dicey CGI shots that absolutely didn't impact my enjoyment of it).\n\nRRR has an amazing score, characters to cheer for, and villains that are despicable. In the big-budget action franchise landscape we're in right now, this was the absolute freshest thing I have seen in a LONG time. Go see this movie.",
            "review_date": "2023-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An alternate history of the Indian struggle for independence, RRR is a histrionic, 3-hour-long extravaganza with absurd — and satisfying — action sequences, motivational twists, and the ultimate friendship story. Our protags are Bheem (N. T. Rama Rao Jr.) and Raju (Ram Charan), whose stories are given equal screen time, with one's being much more intricate than the other. Everything is over-the-top, from the cartoonishly evil villains (Ray Stevenson, Allison Doody, Edward Sonnenblick) to the use of exotic, wild animals as weapons. The tone is set when Raju engages in a Kill Bill-like fight scene to retrieve a malcontent from an angry mob. RRR arises out of \"Tollywood,\" or the Telugu-language film center in Southern India. It is filled with song and dance, some more understandable than others. For instance, the \"hook dance\" scene moves along the plot, as the dance itself is a scene showing that the Indians can defeat the pretentious British in a dance-off. Other dance numbers seemed random and superfluous, merely padding an already extensive run-time. The side-story of Bheem and Jenny (Olivia Morris) was forced and merely inserted to show that not all of the white people were terrible. RRR is a spectacle of national pride and definitely does what movies of this grandiosity are meant to do: entertain.",
            "review_date": "2023-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Impressive visuals, but the anti-colonial sentiment bordered on the absurd.  I know they had a warning at the beginning, but since the whole film concentrated on British oppression and the supremacy of the noble Indians fighting back, it did not reach anything more than over the top entertainment and Bollywood silliness.  Couldn't they have made a Indian epic plot on an ancient tale that would have resonated better?  It was too long to boot.  It is an achievement though for Indian Film and will have an impact.  It was on Netlfix.",
            "review_date": "2023-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WOW! This is how movies were when you were a kid and saw them! AWESOME over the top action, great story and characters, and SUPERIOR message. \n\nJust a fun thing overall, like life should be.",
            "review_date": "2023-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this movie is in that kind of  movie which comes once a decade and blow world by storm....",
            "review_date": "2023-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The way this film has had a chokehold on me since the minute I watched it cannot be properly expressed. I wasn't sure what to expect when I started it, but the first time I watched it I was blown away and had THE BEST time. It's earnest, heart-felt, and completely unafraid to be as over the top as it wants to, and that's only to the benefit of the audience, frankly. There hasn't been a film I've enjoyed this much in a long time, and I have been recommending it to anyone and everyone who will listen to me.",
            "review_date": "2023-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unlike anything I've ever watched. I found myself grinning ear to ear throughout the movie and I've never done that before. This movie was a blast to watch!!! I adore this movie.",
            "review_date": "2023-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Over the top AMAZING!!! If you have a sound system- turn it UP!!! Best movie I have seen in a long while - and I am 69. Magical in every way…",
            "review_date": "2023-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite film in years!  A beautifully crafted story with action beyond compare, stellar acting combined with humor and romance and that incredibly beautiful music all rolled into one movie!  A film about friendship and love of country and its people.  What a creative masterpiece this is!!!",
            "review_date": "2023-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest movie ever made! I have no notes.",
            "review_date": "2023-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film is highly illogical, the songs on the other hand are great. I had a bad time watching this film as it made no sense most of the time. I would not recommend it unless you're an 11-year-old who just wants to watch the good guy win no matter what.",
            "review_date": "2023-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really vibrant action sequence along with the emotional ride that everyone felt truly proved that good cinema doesn't ethnicity/language/culture, it surpasses eveything and everyone. On top of that, Indians all over world felt an amplified version of this because of the historical context that it represents. Absolute must watch for everyone.",
            "review_date": "2023-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The craziest, strangest, most ridiculous amazing movie I have ever watched!! And I am only half way through the 3 hour movie....",
            "review_date": "2023-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film's got everything. The drama and choreography of the fight scenes are so inventive, especially when Rama Raju and Bheem battle the Empire's soldier's in the jungle. The Naatu Naatu dance scene where they do this crazy indian dance routine, shocking the uptight Englishmen at  a formal party, lightens up the film (it rightfully won an award.) The themes of friendship (/bromance) are heartwarming.\n\nI love the tongue in cheek humour throughout. It doesn't take itself too seriously whilst communicating universal moral themes of bravery and solidarity in the face of the oppression of unjust rule.",
            "review_date": "2023-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It left me wanting more!!!!!!!!",
            "review_date": "2023-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While not a bad film by any stretch of the imagination RRR is nonetheless a bit overrated, by western standards at least. It’s a loud, bombastic, and colorful fable that is tuned to the particular tastes of.indian audiences. With 22 languages in India getting the emotional beats of a story across cannot depend on language or cultural norms. So when someone breaks into singing a sad song it doesn’t come across as jarring, you understand the point. On those terms RRR is a solid piece of entertainment that expertly weaves together it’s story beats. The trouble is that this is a limited form of drama because you take nuance off the table. ",
            "review_date": "2023-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After first viewing:\n#RRRMovie #95thAcademyAwards\nMY GOD! RRR is highly highly entertaining action/drama! It clearly knew what it wanted it to be. The over the top musical numbers, musical score, actions and so on and so forth… I LOVED EVERY SINGLE ONE OF THEM! RRR to me is a big surprise.. I had low expectations before watching it and it totally blew me away! The confidence of this movie susprised me in the best possible way! A total blast from start to finish! WOW! JUST WOW! It's one of the very best films of 2022. \n\nWith all the accolades and nominations it has been receiving and the uniqueness that sets itself apart from the other films make it a nomination-worthy for Best Picture at the 95th Academy Awards because it is indeed one of the best pictures of 2022!\n\nAfter multiple viewing:\nOH MY GOD!!! I never thought this would ever happen! Steven Spielberg and S S Rajamouli having a conversation about their films! Wow! A testament that Mr. Rajamouli has really made something special! \n\nRRR was far from my radar to be honest. Though I always say to everyone that I welcome all types of films, different genres, from different countries but Indian Cinema has always been one of my least favorites. Not anymore! RRR has opened my eyes and changed the way I look at Indian Films… It's an astonishing introduction not only to Tollywood Cinema (Telugu Language, different from Bollywood, Hindi Language) but also to, how large Indian Cinema really is and what Indian Cinema can bring to the table..\n\nI'm a huge fan of RRR now and will not stop spread the word of how great it is. I've seen it more than ten times at this point. 2022 was a great year for films, though there's a lot more that I have not seen but RRR was an amazing addition to last year's very best films… It's my favorite film of 2022. \n\nRRR is truly unforgettable! Congratulations #RRRMovie and Mr. Rajamouli!",
            "review_date": "2023-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All the hype and raves you have read about this movie are all true. \"RRR\" is true absolute must see masterpiece!!!",
            "review_date": "2023-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The action-sequences were a bit over-the-top, but it worked at least in that movie, because of really cool shots and effects, but why is there always some musical-stuff. Its typical for a indian movie, but in a action-movie its totally out of place.",
            "review_date": "2023-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "VERY UNUSUAL  FILM AND THE PHOTOGRAPHY IS SPECTACULAR",
            "review_date": "2023-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely not for American audiences. Opening scene, a cop with a stick defeats literally 5,000 opponents in a mob in a clownish scene appearing as if a high schooler directed it. Rubbish and moronic.",
            "review_date": "2023-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Flashy, colorful, and extravagant in every way, RRR is a reminder that films were, first and foremost, made for entertaining audiences. With a gripping plot, great songs, and a brilliant dance number, it's easy to see why it was one of Netflix's most popular releases last year. The only hitch is that the fast-paced motion of several scenes results in sensory overload, especially after three hours.",
            "review_date": "2023-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best Indian action drama movie.",
            "review_date": "2023-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps the greatest cinematic experience of this decade",
            "review_date": "2023-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of, if not, the greatest film ever made. Is there propaganda? Yes. Is it anti-colonialist against the British? Most definitely! And it still takes nothing away from this incredibly story of duty and friendship. Power house performances from the two leads, Ram Charan and F.T. Rama Rao, who embodied their characters with grace, passion, presence, and infinite energy! The action is top-notch, rivaling that of a Marvel film. My favorite film experience, from the year 2022, RRR. Roar! Rise! Revolt! \n 12/10 Stars Yes, you read that right!",
            "review_date": "2023-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the greatest film in the last 50 years maybe of all time. All the emotions and spectacle",
            "review_date": "2023-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie. Great plot and story ",
            "review_date": "2023-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It just a fun movie that's it\nPeople who think this is the best movie of 2022 are STUPID\nSome people are calling it the greatest movie ever made which is very stupid\nRRR is 7/10 for me ( not the best film of 2022)\nRrr is good film and its very artistic yes I know every single detailing in rrr, the horse and bike metaphor, fire and water metaphor , Raju represents Lord Rama and Bhima represents Lord Hanuman, that is why in the last Bhima's character carries Raju on his shoulder which is inspired by ramayan, In the beginning, a little girl made a drawing on British queen's hand that drawing is refrence to Bahubali 1, but I don't think that Rrr is best film of 2022\nBecause I have many problems with rrr\n1) many action sequences were there that I didn't quite believe example: bhim and bike action scene in climax, And I have the same problems with Rajamouli's other films as well,example: Bahubali 2 palm tree scene \nI don't have any problem with over the top action sequences but some of scenes are very unconvincing for me,\n( I didn't like these action scenes because of their choreography, And it is not that I dislike all the action scenes of RRR, I have also liked some of the action scenes of RRR, example=bheem introduction, interval fight scene, climax fight scene)\n2) Rrr has the same stereotypical villain who we knew from the start that he is going to lose in the end,here I am talking about the character of the villain, I found the character of the villain very fake and cartoony,I did not feel any danger from it,The way he speaks the dialogues, it sounds fake,you can show cruelty in a better way like Tarantino did in inglorious bastards with Hans Landa, the way he delivers dialogues and manipulates people was mind-blowing, and another example was Leonardo DiCaprio in django unchained He was also a very cruel and over the top villain, but Leonardo DiCaprio's acting makes him a dangerous and unique antagonist ,He Really Feels Like A Direct Threat To Our Hero, and all this was missing in Rrr's villain,He never seems to be a direct threat to our heroes, I never thought that he would ever be able to defeat our heroes, in Bahubali bhallaldeva was very strong villain, that's why the Bettle of the last one seems very equal and interesting, but in rrr last Bettle was very well choreographed but it's very one-sided.\n3)in the beginning of the movie people started thinking that Ram is antivillain but then after interval it was found that Ram is also against British, This was a surprising twist for many people but not for me because I recognized this as soon as I saw the trailer, I did not find it so surprising because a big movie superstar can never be a villain in India. That's why only after watching the trailer, I realized that Raju will also be against the British government. And yes raju and bhim's friendship happened by just an event i mean such a deep friendship may take time,A movie based on such friendship will be unique for America,but it is very common in India.\n4) characters are to cartoony, Raju's character has some character development , But Bheem's character was very one-dimensional\nRRR's characters lacks depth, \nThis is the condition of commercial movies in India, they don't understand the importance of character's depth, they don't understand the importance of a good villain in the movie,\nI could not connect with the characters,i could not connect with their friendship, I did not feel anything real in it. i need little bit of subtlety to connect with their bond more\nI was not interested in the story and characters of the film because I have seen many such stories and characters many times in Indian cinema\n5) honestly in some scenes Rrr's CGI was not good \nAnd I have problem with comedy in rrr, you will get to she this in many indian films that a desi boy falls in love with a foreign girl ,but our desi boy does not know how to speak English which creates comedy, whole name pronouncing thing was so lame and such an old trick to create comedy\nFinally I don't hate rrr it's better than other trash Indian comercial films like pathaan, kgf and pushpa but I don't think that Rrr is the best movie of 2022\nOver all 7/10 for me\nRemember everyone's opinion and taste is different, you have every right to dissagree with me,If everyone had the same opinion, than websites like rotten tomatoes wouldn't exist.",
            "review_date": "2023-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lots of energy and very clear good guys and bad guys.Pure Bollywood: over-acted, over-produced and over-long.",
            "review_date": "2023-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great EPIC movie about friendship full of action, war, and dancing!! One of the best movies of 2022!! I wish I saw this in theaters!!",
            "review_date": "2023-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely loved it. I was grinning ear to ear throughout this entire film. It is over the top, non-stop, action packed entertainment at its finest. If you have an open mind and 3 hours time, give it a go. You won't regret it!",
            "review_date": "2023-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it, so entertaining.",
            "review_date": "2023-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pros - Great camera work, epic dance scenes.\nCons - Awful screenplay, totally unbelievable 'love interest' between posh colonialist and an Indian when they couldn't even communicate with each other. Over-long. Horribly blinkered view that all English are 'baddies' (apart from the posh colonialist lady of course). Top tip for authenticity, one man with a bow and arrow probably can't take on 200 heavily armed troops. Endless 'action' scenes. Could easily have taken an hour off of the runtime. \nI honestly couldn't make out if the film was very subtly sending itself up or not.\nApparently not.\nI cannot fathom the high critics and audience score.\nTo put it bluntly, this film is overtly racist.",
            "review_date": "2023-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie blew me away!  Felt like a kid watching the Wizard of Oz for the first time. Truly magical experience.",
            "review_date": "2023-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What an experience. This film manages to combine different genres and styles and never really lets up. Unlike any film I've seen in a while.",
            "review_date": "2023-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible. I do not remember another movie where I was genuinely smiling the entire time. An unforgettable fantastic guaranteed-non-suck film. It's one of those I can't keep talking about to my friends. Ridiculous action? Sure, but it didn't diminish from the value of this movie at all. I will say, maybe much more of a *guy's* movie possibly? But still, amazingly fun and definitely worth your time.",
            "review_date": "2023-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you are not entertained by this movie in some way or another there is something wrong with you. It is ridiculous and over the top in every way. The acting is as cartoonish as the insane action scenes and will have you laughing out loud. \nBut as fun as it is as a pure adrenaline-fueled, technicoloured romp it is impossible to ignore the hindu-nationalist jingoism of this movie which leaves a bad taste in your mouth after a while. The British (or rather the \"British\" as these are comic book villains with no redeeming qualities whatsoever), are dispatched (or just emasculated) with a sadistic glee that does become pretty repulsive after a while. But your tolerance of this may vary.",
            "review_date": "2023-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked it alot but I found it distracting to dub it n English. I prefer subtitles.",
            "review_date": "2023-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A three hour action packed ride that is worth every minute of your time. Beautifully shot action scenes, massive dance sequences to super catchy songs, and a story line that will keep you engaged throughout. What more do you need?",
            "review_date": "2023-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crazy goofy fun.   Sure it is over the top, but it doesn't take itself too seriously.   Buckle up and enjoy the ride!",
            "review_date": "2023-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie of not only Indian Cinema but of Whole world Cinema having such a great Experience never had this much.",
            "review_date": "2023-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Never Seen Hollywood Praising a Bad International Movie like this one!! The last Horrible International Movie Hollywood praised like this one was 'Crazy Rich Asian' BUT at least they didn't submit that one for the Oscars!! Tried to Watch RRR 3 Times and Couldn't Go Pass 25 Minutes for all the Cringeable Scenes!! So I've decided to Sit Through it just for the Hype!! And I REGRET doing that!! THIS IS A BAD MOVIE!! Says a Lot about Hollywood though, for Whatever Reason they have praised such Horrible Movie!! There were other Good Movies made in India in 2022, and THIS WAS NOT IT!!",
            "review_date": "2023-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No words , each and every aspect was amazingly directed and executed 🙏",
            "review_date": "2023-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is extraordinary, extremely breath taking. The introductions, visuals, fights, dance and especially the animal entry sequence of NTR stands out. No other movie impressed me this much through. It will be celebrated more if you give Oscar to this",
            "review_date": "2023-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic film by Epic Director and Cast",
            "review_date": "2023-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The BEST ACCIÓN MOVIE 2022",
            "review_date": "2023-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic film!!! I'm no film buff, but this was special. Brilliant effects too. When certain parts get a bit grizzly, it's hard to remember it's the same film you were happily cheering to in the epic dance scene! It gets every emotion going. Brilliant!!!",
            "review_date": "2023-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the coolest movies ever made!",
            "review_date": "2023-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Was this movie really three hours??? felt like 30 minutes.",
            "review_date": "2023-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If Bohemian Rhapsody was a movie it would be called RRR!",
            "review_date": "2023-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Over exaggerated and far too long.",
            "review_date": "2023-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "GREATEST. TITLE. CARD. DROP. OF. ALL. TIME!",
            "review_date": "2023-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly awesome and superb! The great story telling  and cinematography coupled with fine acting by lead cast make you revel in the three hour long cinematic feast! Worth watching.",
            "review_date": "2023-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best action movie ever! A must see",
            "review_date": "2023-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn't knew movies can be this good!\nOne of the best movies ever made!!",
            "review_date": "2023-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A veritable feast of action, emotions, song and dance, audacious stunt sequences, great acting and did I mention action! To summarise it's  \"Everything everywhere all at once\"",
            "review_date": "2023-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely fantastic theatrical experience!!!",
            "review_date": "2023-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "WOW I heard good things and I was still underestimating this amazing movie! OSCARS made a mistake in not nominating this movie.",
            "review_date": "2023-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bruh this film is like EVERYTHING. But gotta watch in theaters for the experience that is expected. OTT is just to watch this movie again. First experience is supposed to happen in the theater for movies like this. I'm happy I watched it while it was up there.",
            "review_date": "2023-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not sure if this movie is typical of how films of this type/genre are written and directed in Telugu cinema or India in general, but it wasn't for me. The scenes of the British soldiers/officers bashing in someone's head and shooting, beating, disgracing indigenous people came off almost cartoonish, or just poorly acted. Is that intentional, for effect?\nI've never been one for musical type movies, either, so that didn't work for me. And the CGI, which I normally don't have an issue with, was pretty glaring in how obvious it was. And just too long, jeezers. \nI will say that the visual quality- the colors, settings, camera angles, etc.- were impressive. It had some well choreographed action scenes as well.\nNot my thing really, though. 2.7 stars",
            "review_date": "2023-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RRRidiculous\n\nThis is a truly weird movie. Fun, but weird. It's a wacky cross between Marvel and Bollywood.\n\nRRR is very loosely based on actual events. Loose is an understatement. It's so loose that it is falling apart - apart from reality that is. \n\nA reviewer at RogerEbert.com describes British Governor Scott (played by Ray Stevenson) as a \"cartoonishly evil\" character. True enough, but that's because everyone and everything in the whole damned movie is cartoonish! Calling one character from this absurdity \"cartoonish\" is absurd. It's like singling out Elmer Fudd as \"the funny animated one\" from the \"Looney Tunes\" series.\n\nI initially did not want to watch this because I feared that it would be like viewing a three hour video game (yes, it's running time is 3 hours and 7 minutes). But, since we have a Netflix subscription, and it was an offering, we decided to give it a try. I wasn't wrong about the video game fears. The film does have that look.\n\nSurprisingly, we were not disappointed in the film's overall entertainment value. Actually, we were quite amused by all the insane scenes and we both frequently laughed out loud. \n\nBut this raises the question, \"Is RRR a comedy?\" To be honest, I'm not sure. Every description I've read labels it a drama. But really? If the producers were looking for drama, then why frame your intended seriousness in the goofiest, craziest, wildest cinematic nonsense of the year?\n\nDue to all of its rib-tickling silliness, I'm giving this movie a marginally positive rating. If it is not supposed to be funny, well, I'll recommend it anyway. Who doesn't need a good laugh these days?",
            "review_date": "2023-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dow is it possible that this piece of amateurish junk gets good reviews.  Everything about it is crap.  A dubbed soundtrack in all languages that don't even try to sound realistic or in sync.  Acting like they're two-year olds.  Ridiculous plot with over-the-top characterizations.  Do not waste your time.",
            "review_date": "2023-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RRR is action packed throughout! One of the better movies of 2022, I would recommend watching it, you will not be disappointed.",
            "review_date": "2023-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cute, but ridiculous.  Sexy and playful.  Beautifully fake, with addictive sound.  But let's be honest, it felt like 3 movies put together.",
            "review_date": "2023-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once you get used to the over-the-top style RRR becomes very engaging. The movie is truly beautiful, the colors really pop and most of the shots are properly epic. This also really helps with the characterization of the two leads, they are larger than life and comically masculine, but it totally works. It's clear that a lot of care was put into the movie both the songs and the action scenes are super well executed, and it earns its long runtime. I have some minor gripes with the movie but overall, it's a great experience.",
            "review_date": "2023-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was actually incredible and an experience that's best seen in theaters. I haven't had this much fun at the movies in awhile. It has romance, friendship montages, cartoon-like villains, insane action sequences, a dance-off, the destruction of the british monarchy, and the hottest, most unlikely best friend duo I've ever seen. \n\nRRR is a gift. Go see it.",
            "review_date": "2023-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A rare foreign movie that has blockbuster appeal and emotional storytelling. I loved every 3h insane second",
            "review_date": "2023-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie superb 😍 komaram Bheem acting is amazing 😍#Jrntr",
            "review_date": "2023-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was mind blowing, stunning action scenes and can't say it in words.",
            "review_date": "2023-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bast movie of the year ,RRR \nBast actor of the year, NTR \nBast director of the year, S.S. Rajamouli\nNTR Acting is marbles 🥵🔥💥",
            "review_date": "2023-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic Film - \nBest Picture of 2022... unequivocally.",
            "review_date": "2023-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best action movie best rom com movie best masculine movie best emotional movie best music best visuals\nOver-all best movie must watch",
            "review_date": "2023-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredibly fun, amazing action",
            "review_date": "2023-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Now *that's* how to make a FUN superhero movie. OK, some erratic pacing after the manic first hour, some cheesy sfx, and a 3+hour runtime (with inteRRRval) - but charismatic stars, lots of color, and scenes that are over the top in the best way. \"Naatu like a green chili.\"",
            "review_date": "2023-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic Must See Better than recent Hollywood Films",
            "review_date": "2023-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie gave me absolute joy with great action, emotions, and musical masterpieces. Tollywood should be proud of making the best movie in 2022!",
            "review_date": "2023-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must watch for all the people who loves to see true cinema in big screen",
            "review_date": "2023-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent Bollywood style movie- great story line & never a dull moment!",
            "review_date": "2023-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This box office record-breaking Indian film, re-imagining real historical figures during India's fight for independence in the 1920s in a fictitious and epic story, is bombastic and unsubtle, contrived and ridiculously (over)plotted and somersaults from genre to genre in a whiplash-inducing manner, making haphazard detours into romcom, tragedy, war movies and prison break movies at various stages of its 3hrs+ duration; and I can't say I didn't enjoy the heck out of it on a mostly visceral level, and it's perfect for viewing on Netflix with pause button at hand. When a young village girl is taken away by a mean British governor's wife (cue pantomime hissing), NTR Jr's kind but extremely skillful tribal leader Komaram Bheem is sent to Delhi to bring her back. En route, he befriends, in an unequivocally homoerotic/platonic manner with an action drama equivalent of a romcom meet-cute, Ramm Charan Teja's ruthlessly determined Rama Raju who has his own secret agenda and is coincidentally tasked to hunt down Bheem, except initially, both are unaware of the other's true identity. With plot development constantly taking a backseat to logic and physics-defying action sequences that are nevertheless stupidly entertaining and musical numbers that bring the film and its momentum to a shuddering halt, S.S. Rajamouli's film is a cornucopia of pleasures and eyeball-rolling insanity. For every rousing and ingeniously choreographed piggyback fight sequence with Bheem carrying an injured Rama, there's an incredulous herbal remedy conveniently available to magically heal Rama allowing him to run in minutes; whilst ropey special effects with the animals are almost forgotten (and forgiven) after a dazzling display rescuing a child from a burning train or an impressively mounted, infectious and totally bonkers dance-off spectacle, which in and of itself perfectly encapsulates a film this brazenly mainstream, manipulative and maximalist.",
            "review_date": "2023-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Greatest time i ever had in a theatre after baahubali - assured to see some amazing set pieces , great action & the emotion which connects all of these have watched 5 times in theaters ! a Must watch !",
            "review_date": "2023-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic action, story, and musical all in one",
            "review_date": "2023-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It’s everything you want in action movie and so much more that you didn’t know you needed.",
            "review_date": "2023-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of its kind definitely.",
            "review_date": "2023-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RRR is definitely one of the wildest and crazy movies of the year, in all the good ways possible. The movie follows two guys with completely different motivations, coming to Delhi and become friends. RRR shines its best in the action and the friendship between them. Ram Charan and Nandamuri Taraka Rama Rao Jr. play the characters of Bheem and Raju perfectly and they know how important these characters are for a lot of people in India and around the world. The creativity that RRR has to offer, is something I have never seen before until now, the stunt coordinators did a incredible job, at keeping the fights interesting and impactful. RRR sure has some flaws, the VFX are not always the greatest and i thought that the over use of low framerate slow-motion was a bit overdown, however those things come with the package of a Bollywood film and they give the movie their own identity. The dance sequences were so much fun to watch, with everybody giving it their all. I must give my compliments as well to the stunt guys, you guys really did some fenemonal stunts and took a lot of risks doing them. Overall RRR is a refreshing movie, something that Hollywood would never do and something that has made so many people around the world incredibly happy!",
            "review_date": "2023-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If someone tells you they were bored during this movie, they are lying.",
            "review_date": "2023-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is as unapologetic as you can get....at 3 hours, you might think...nope...but then you watch it, and afterward, you are part of its self-proclaimed zeitgeist...I was thoroughly entertained by RRR...loved it.",
            "review_date": "2023-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Being a Telugu Indian I absolutely enjoyed RRR. It is a once in a lifetime experience. Compulsory to watch on the big screen.",
            "review_date": "2023-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Astonishing. Marvellous work and depiction of history via a tale",
            "review_date": "2023-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I get it. I laughed a lot and at times was really impressed. But....if this was done in North America with action stars, it would be laughed into oblivion. Dont lie cuz its true.",
            "review_date": "2023-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a perfect movie. Cliche in the best way. It's reintroduced me into movies. Everything I don't like other movies for specific reasons and this movie bashes all of them away. If I could watch it over for the first time I would. New favorite move",
            "review_date": "2023-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the best movie I've ever seen. Everything that you dislike about other movies is perfect in this one. Even the fight scenes are thrilling and heartfelt, and I usually skip over them. This is everything that Lord of the Rings thought it was and more. The bromance is incredible 10/10",
            "review_date": "2023-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story and amazing fight scenes. Cinematically beautiful",
            "review_date": "2023-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "its so ridiculous yet so so good",
            "review_date": "2023-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie would have been better if it was a gay love story, as the love interests of both actors have negligible roles anyway. Rajamouli made a terrible mistake by not letting Ramcharan and NTR kiss onscreen.",
            "review_date": "2023-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Haven't had that much fun at a movie since I don't know when.",
            "review_date": "2023-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such fun crazy movie! At first, I was skeptical but ended up enjoyed it \nvery much.",
            "review_date": "2023-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't know what the hype is about.\nIt is a spectacle but from story point it is very weak narration. The story is not gripping. The director is good at showing spectacular visuals but not a great story teller.",
            "review_date": "2023-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was a wild rollercoaster!\n\nOne moment it's a tragic drama.\n\nNext, it's a superhero movie.\n\nNext, it's a cheesy, bromance movie.\n\nNext, it's a dance musical.\n\nNext, it's an intense thriller.\n\nNext, it's a rom-com.\n\nNext, it's an awesome action movie.\n\nTonally, this movie shouldn't work but it does! It has great storytelling that delivers on the comedy and emotional beats. It also has amazing cinematography and a terrific soundtrack. The action scenes are so amazing and badass. The movie is paced so well, that I forgot it was even 3 hours!\n\nOne of the main characters throws a tiger onto someone else and beats up people with a motorcycle! That's enough of a reason to watch RRR!",
            "review_date": "2023-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is what an action movie is all about, this was a blast!!! Great story, and such fun action sequences , surrealist and creative, loved it!!!",
            "review_date": "2023-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly one of the best movies you can watch out there, action, part musical in a non boring way- and good comedy (some maybe not intentional) feels like an epic all around to watch with friends and family",
            "review_date": "2023-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "extremely satisfying movie story. Great story, Epic battles, drama, dance, songs, bromance and love story. So addicting and riveting to watch you'll wonder how 3 hours passed by. Its so complete that its almost perfect. A movie designed to be watched for CINEMA with the best experience of all",
            "review_date": "2023-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An epic and amazing film. This is an absolute must see movie. RRR is what movies in America have been missing over the last several years. Strong men doing heroic deeds, forging nations, forming brotherhoods, and making history. The cinematography, score, and music are absolutely excellent as well.",
            "review_date": "2023-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Life changing, one of the movies of all time.",
            "review_date": "2023-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We all know Indian films are over the top, but this..................\nThis film just knows soooooooo well how to indulge. It takes the idea that cinema is something grand, something you've never seen before and will probably never see again and it just runs with it. It's an epic, it's an action/adventure, it's a musical, it's a comedy, it's literally everything. Everything can be bigger, everything can be grander, everything can be louder, everything can be more fun, and this film is absolute embodiment of that. Whatever you do, just do yourself a favour and watch it.",
            "review_date": "2023-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RRR goes for broke in every direction imaginable. It is utterly unselfconscious cinema that is reminding audiences worldwide the kind of revelatory experience that can be achieved when we leave our irony at the door. \n\nThe two leads, N. T. Rama Rao Jr. and Ram Charan - as veritable superhuman forces, Bheem and Raju - are exceptional. Switching between comedy and drama, action and dance - and performing every single task absolutely exquisitely. Ram also happens to be one of the most beautiful human beings - man or woman - that I have yet come across on my travels. \n\nI expected to be held at more of a distance by cultural idiosyncrasies (this being my first ever film from India) but everything felt surprisingly universal - from the themes to the relationships and the operatic displays of action and emotion. The eyebrow raising nationalism that quietly crept in (and then loudly declared itself during the final number) is also, sadly, pretty universal and I found myself start to nervously sober up once the flags started flying across the screen.\n\nHowever, as a cinematic experience the film is a shining light and a true joy to experience.",
            "review_date": "2023-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfect movie about friendship, revenge, culture, ethics. Throw in a cool dance number and actually throwing a cheetah at a guy",
            "review_date": "2023-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "completely mesmerizing entertainment. A super long movie that is super good. I would like to think the English could never be that cruel in reality. This spectacle has it all .Not to be missed.",
            "review_date": "2023-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredibly satisfying and entertaining movie. The most masculine bro movie ever yet shows the softness of the soul of these men longing for friendship. A time when men are comfortable to be as men, and women as sweet as they were. A must see movie. A visual and musical spectacle. An action-packed story yet full of family and personal drama. Its everything rolled into one.",
            "review_date": "2023-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has no right being this good. The most hyped I've ever been in a theater.",
            "review_date": "2023-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies of Pride of Indian cinema one and only S S Rajamouly sir !\nIt's amazing 😍\nIt's Fantastic 😊\nEvery scene will give you goosebumps!!\nIt's a full roller coaster ride of 3 hours and 7 minutes.",
            "review_date": "2023-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not even sure what I think. This movie is crazy and absurd. It's creative, sure, and they try to have themes and emotions, but it's such a mash of elements that I don't really know if I liked it or not. There's a musical number to a torcher scene and a battle with jungle animals that takes place in an area that looks like Main Street U.S.A. in Disneyworld. Throw all reality out the window: physics, gravity, pain and injuries have no place in this film. It's laugh out loud insanity by the final act.",
            "review_date": "2023-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely fantastic! The action is incredible and the story heart breaking.",
            "review_date": "2023-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No doubt about it, the action scenes are inventive and fun, if a bit overdramatic. Unfortunately, scenes not involving action are made as if they were action scenes. This style of filmmaking works for some, but to me felt as if they way over the top (which is a staple of many Indian films). \n\nI do appreciate the director's intent with the filmmaking, but watching it felt like a an exercise of getting to the next action scene while having a \"meh\" feeling in between. \n\nFor anyone who likes the over-dramatic style, you will find a lot to love and I urge you to watch it. For a general audience, you may check out of the movie early on and may not care how good the action is.",
            "review_date": "2022-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favourite movies from the past few years. It's just so much fun.",
            "review_date": "2022-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "We loved the story.  Intense special effects and beautiful Bollywood song and dance.\nThe only movie I ever watched that showed the English take a beating.",
            "review_date": "2022-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing movie!! This is my first time watching a full length Indian movie and I totally enjoyed it. Part John Wick, Mission Impossible, the Crown and Bollywood all rolled into one👍🏻👍🏻",
            "review_date": "2022-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie of the year.",
            "review_date": "2022-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super movie very good experiance",
            "review_date": "2022-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bruh.\nOff the chain magnetism, and cinematic glory.",
            "review_date": "2022-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an experience that i didnt think that i needed, But man did i need it. There are scenes that are questionable with the CGI but it adds to its overall character. You honestly cant help but love this movie in the end. ONe of the best of 2022 watch it !!!",
            "review_date": "2022-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For everyone Must watch ❤️",
            "review_date": "2022-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The intro scenes of heroes was goosebumps moments and the movie is mind blowing in terms of direction,acting,music,dance(naatu naatu) \nRRR must deserves OSCARs 2023",
            "review_date": "2022-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a damn good movie",
            "review_date": "2022-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you are from India then you would have probably already watched teh movie!\nIf you are from outside India this is a movie that's going to pack so much adrenaline in 3 hours that you haven't experienced before. \nThe intro, interval bang and climax keep you satisfied in all the phases. \nIt's a great adaptation that summarises the freedom struggle of Indians in British colonial rule.\nMinor negative being if you are a bit detached the action sequences will seem bit over the top but you will definitely overlook them if you get proper theatrical experience!",
            "review_date": "2022-12-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, it's bollywood. Fun, but pointless.",
            "review_date": "2022-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is one of the most senseless creations I have encountered in my life. \nWeak story, weaker acting and huge number of dumb mistakes are the characteristics of this movie. \nPeople with no depth will of course like the movie.",
            "review_date": "2022-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had problem with suspension of disbelief but I was able to do better on subsequent viewing! Else, I'd have given it 1/5, The performances are good and the story is okay. The camaraderie between the protagonists is excellent.",
            "review_date": "2022-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exceptional from start to finish. Worth every second of its runtime of 3 hrs.",
            "review_date": "2022-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stalled out in the first hour.  Approaching RRR as an even semi-realistic historical drama was a mistake.  The protagonists defy the laws of physics, human anatomy, & simple logic at every turn, while everyone else is a cardboard cutout stereotype (Brits as Nazis in pith helmets, Indians as simple-minded cowering peasants, even the tiger was like something from \"1 Million Years BC\"!).  If I can reset my expectations to something like \"Life of Pi\" meets \"Crouching Tiger Hidden Dragon\", maybe I'll try again in a week or two, 'cause it seems a lot of other people like this movie.",
            "review_date": "2022-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is just an roller coaster pls watch it.THIS DOES CONTAIN MORE THAN ONE GENRE OF MOVIES WITH IT .With beautiful emotions",
            "review_date": "2022-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most enjoyable captivating movie I've seen in ages.",
            "review_date": "2022-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is my all-time favorite movie! Such a fantastic storyline, direction, actors, soundtrack, cinematography--you name it. I got literal goosebumps at several points in the movie, I cried, I laughed... this movie deserves every single award that's out there! #NaatuNaatu #RaamamRaghavam #RRR #Fire #Water",
            "review_date": "2022-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films I've ever seen/heard/experienced, must see on largest screen with best sound system possible.  3+ hours fly by and leave you wanting more, can't wait to see again, waiting breathlessly for the next.",
            "review_date": "2022-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than expected and i loved it all but it dropped a bit in the end for me. Could have ended earlier and still been great.",
            "review_date": "2022-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie, although a bit over the top at times, was everything I like in a movie - a great script, great acting, great music, scenery, and cinematography. It had me loving and hating both main characters at times, and when it ended, I was sorry it was over.",
            "review_date": "2022-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched it because he won the best director at NY Critics. So glad we did! Non stop entertainment for the over 3 hours. He deserved the award!",
            "review_date": "2022-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I tried to give this movie a shot because of all the good critics but I couldn't get past the first thirty minutes. Laughed my a** off after one soldier jumped into an angry mob and managed to fight his way out. Then there was an action scene with a bad CGI tiger and I called it a day. The Indian actors are decent but the British actors are comically and one dimensionally evil, it's ridiculous. They don't seem to believe in their roles and it shines through their bad acting. You'll probably like this if you're into Bollywood.",
            "review_date": "2022-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "SS Rajamouli bring the glory of Indian cinema. Best theatrical experience ever . Learn Hollywood…",
            "review_date": "2022-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie with all ingredients that has to be in a movie...",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Chaotic but in a good way is the best way to describe this movie. It's mostly nonstop energy for the entire 3 hour runtime and that's the best thing about this movie. The energy of this film is what makes this a must see from 2022 in my eyes. The performances and characters from N. T. Rama Rao Jr. And Ram Charan are great. They both have some great chemistry together and do a great job at developing their characters. S. S. Rajamouli's direction is really fun and so much better than his directing on Bahubali. The action is some of the most insane I've seen put to film ever. It's something that's hard to describe and is better being seen by your own eyes. You won't be disappointed though. It also has probably my favorite dance scene ever put to film as well. I honestly can't think of anything that tops it. When the film isn't action oriented or doing something fun then it can really drag. There's a 30-40 minute portion of the film that really drags on and on. Some of the performances here aren't exactly amazing also like from Alison Doody. If you want a really fun action and character oriented movie to watch with friends or on your own then I would highly recommend checking this out.",
            "review_date": "2022-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "best movie the year & High entertaining movie. ✌️",
            "review_date": "2022-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Literally the greatest movie I've ever seen. It has everything. And I mean everything. Fist fighting a tiger? Check. Dancing? Check. Historical drama, romcom, musical, action adventure all in one? Check! Just want to see two guys riding side by side on a horse and motorcycle, holding hands a lot, and using a LOT of rope? We got you, bro. 10/10",
            "review_date": "2022-11-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Insanely Epic\nEpiccccccness on GOD level\nOutrageous ridiculous action thriller\nThis flick is only made for the Theater\nGOBSMACKING and surrealist Theater experience i EveRRR Had\nHighly recommended it\nDon't neveRRR EveRRR miss it",
            "review_date": "2022-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved RRR. One of the greatest cinematic experiences I have ever had and my favourite film of 2022!",
            "review_date": "2022-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a great movie. Ram Charan has such an awesome first scene, a real baddass! The heroes are heroes, and obviously the whole production knows what audiences love to see. Beautifully shot, and the director knows when to focus in on seemingly small details to create a response. If you liked this you may also like Bahubali from the same director. Both are epic films with great action scenes.",
            "review_date": "2022-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Other than some tonal inconsistencies, RRR was a lot of heartfelt fun. As my introduction to Tollywood movies I can safely say they hit the ground running.",
            "review_date": "2022-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Over The Top at every turn, which works well for the large set-pieces, but not so much for its sometimes confusing narrative thats all over the place.",
            "review_date": "2022-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best action movie I've seen in a long time. The CGI and even the musical scenes were epic! I'd love to see a sequel!",
            "review_date": "2022-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must watch masterpiece movie",
            "review_date": "2022-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie ever. Loved throughout the film",
            "review_date": "2022-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What better way to celebrate the Queens death than with this movie",
            "review_date": "2022-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The power of friendship vs the English Empire. Awesome movie.",
            "review_date": "2022-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ridiculously funny.  An action adventure movie that made me laugh.",
            "review_date": "2022-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intoxicatingly over the top, RRR pulls out all the stops to make the absolute most of its 187-minute runtime.",
            "review_date": "2022-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie solely focuses on theatrics and not much on the storyline. Terrible film.",
            "review_date": "2022-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I honestly have never enjoyed Baliwood movies.  The songs are typically disjoining, the action is beyond ridiculous, and there are always dance numbers that are just out of place.\n\nEnter RRR.  The songs are perfect - helping move the plot forward with exposition, the action is ridiculous and PHENOMINAL (Ever want to see a man throw a panther at another man?  Yeah.  You didn't know you wanted to but NOW YOU DO), and the dance numbers are out of this world (the stamina and skill required to dance in unison is profound).\n\nThis movie is just great, silly, touching, and is a tale of friendship and revolution.  I have never seen a better movie from Baliwood, and this stands as a must watch.",
            "review_date": "2022-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An average audience expects from a movie primarily is entertainment. In that gener , RRR will be highly preferable. RRR is such type of a film that people should not miss out to watch , more especially in theatres. An average movie will have 2-5 highlighted scenes but when it comes to RRR , you can enjoy such highlight scenes for every 5 minutes. This movie consists of great artists. Visually, this film is an eye feast. Most of the shots are so satisfactory. Music will take you to the dimension of RRR. Choreography for songs won't let you to sit quietly. I witnessed people dancing in theatres and they can't resist themselves to do so. Letting the audience to sit in theatres for 3 hours is a big challenge. SS Rajamouli succeeded about it. Finally Ram Charan and Jr.NTR are the two eyes of this film. Their performance will rotate in your thoughts even after watching the film.",
            "review_date": "2022-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film very nice taking making",
            "review_date": "2022-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw this on IMAX and it was insane. This has to be the best picture nominee for India. I encourage people to see it in the theatres!",
            "review_date": "2022-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie worth watching, perfection in acting.",
            "review_date": "2022-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a big fan of Bahubali 1, and an even bigger fan of Bahubali 2, I had a lot of expectations going into RRR. I wasn't expecting another magnum opus, but I was expecting a gripping story, replete with incredible screenplay, clever action sequences and a fair share of twists and turns in the plot. RRR fails to deliver on all counts.\n\nI don't even know where to begin. Rajamouli takes too much time introducing the protagonists - the Fire and the Water analogies are meaningless and poorly concocted. One cannot but help wonder if all that wasted time in the movie could not have been used to develop a more interesting plot. The protagonists themselves are so bad in every respect that I can't even remember their character names in the movie. Compare that to the like Kattappa and Bhalla and Sivakami in Bahubali or even the relentless Fly in Naan Eee, and you soon run out of leeway. There is a weak attempt at justifying underdeveloped ideologies for the two main archetypes in the movie, and it is so poorly developed that it fails to hit the spot.\n\nThe plot meanders along aimlessly from one boring scene to another, with random characters weaving in and out like caricatures in a bad comic book. There is a scene where NTR gets to take a crack at a cop who unnecessarily roughs him up in an earlier sequence. Knowing Rajamouli, I was expecting more impact in that scene, but it was so predictable and poorly delivered, that it failed to leave any impression whatsoever.\n\nThere is an even weaker attempt in the movie at rekindling a romance, which goes nowhere - neither is it interesting, nor is it likeable. And the flashbacks are pathetic attempts to justify pointless ideologies that they are only a distraction in the movie, and best forgotten sooner rather than later. Characters like Ajay Devgn and Alia Bhatt have been thoroughly wasted, as are Shriya Sarin and Samuthrakani.\n\nThe music is ok, and the cinematography is ok, but the most important ingredient in any movie, the lowest common denominator, so to speak, is the story and the plot, and as hard as he has tried to piece something together in RRR, Rajamouli has failed miserably.\n\nIn sum, I would not recommend wasting your time on this movie. I hope the director finds his way again, and makes a compelling comeback in his next flick.\n\nThanks for reading!",
            "review_date": "2022-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched this masterpiece 3 times in the theaters, and watched manytimes on Netflix as well... everytime I feel that same interest and attechment with movie. This is pure masterpiece. Must watch.",
            "review_date": "2022-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Apart from unrealistic fight sequences, I love the fact this movie entertained and remained engaging throughout the movie length. 🥰🥰🥰🍿🍿🍿",
            "review_date": "2022-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What if India made an anime IRL.\n\nThis is so wild, masculine, and over-the-top that you can't help but love it. What a wild production, what frenetic cinematography, what soul behind it.\n\nIs it actually the best thing ever? Nah, not really. It's a bit silly at times. Its drama gets so exaggerated it almost becomes cartoonish. But that's part of the appeal. It's so zany, but also takes itself entirely seriously, and lets the stakes of the situations be real, organic, and fun. And especially given the context of the Indian Revolution, showing both its brutality while also making the experience both insightful and dramatic lends merit to the entire experience put to film. It really does feel like a modern epic, which is so antithetical to modern cinema, at least in the 2020s.\n\nFun is the name of the game. This is just fun. Its core keeps upping the ante. Rather than saying, \"What should we do?\" the film continually beckons on, \"We can do this, so what shall we do?\" It never stops, never gives up, always upping it's own game with every scene. That's just fun.",
            "review_date": "2022-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cinema at its best!\nThe movie is an absolute rollercoaster ride and does not disappoint at any moment. A 3 hour film that does not feel boring even for a second! \nThe two actors: NTR Jr and Ram Charan have absolutely nailed their characters and both of them together give numerous moment to cheer throughout the film.",
            "review_date": "2022-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a fun movie! The bromance is rock solid and the action sequences are second to none. With its length there are a few slow spots but they are more than made up for! Definitely give this a watch",
            "review_date": "2022-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really fun Bollywood film with lots of gory action interspersed with song and dance.  The biggest drawback is that it is 3 hours long...takes quite a time commitment to watch.  But well worth it.",
            "review_date": "2022-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is what movie watching in Theatre should feel like. An extremely over the top fun filled 3 hours of peak Indian Cinema.",
            "review_date": "2022-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unbeatable Film Nobody Can Compete This Film 🕉️💪🚩",
            "review_date": "2022-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfect emotional roller coaster ride. Deserves to bag few awards from the academy at March. Literally blown up by the story teller SS Rajamouli. A definite must watch for the action lovers.",
            "review_date": "2022-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3 hours of pure entertainment!!!!",
            "review_date": "2022-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie! It's over 3 hours long but you get so involved with the story you don't realize it. It has action, romance, music, and dancing.",
            "review_date": "2022-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, it is just fantastic, great message I just loved it",
            "review_date": "2022-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the funnest and most entertaining movies I have seen in years.",
            "review_date": "2022-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had no idea what I was getting myself into watching this. What an incredible adventure among two best friends. This is how story writing should be. I don't even like musicals, but this had some of the best musical scenes I've ever seen. Everything is so well shot, it's like you're there with them. Even the tempo was a good pace, you never got bored during the entire three hours. 10/10. Well done.",
            "review_date": "2022-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An emotional,joy, entertaining action movie which will not give rest to your hair 😉 by its continuous goosebumps",
            "review_date": "2022-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love it. There's nothing not to like.",
            "review_date": "2022-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An absolute stunner of a film. Amazing screenplay and visual storytelling and the score is really good too.",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An incredible cinematographic experience!",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once in a life time fictional story brought to life. Amazing story telling by Rajamouli, superb performances by Ram Charan and NTR Jr.",
            "review_date": "2022-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best film of the year.strong oscar contender including best film.best director.best actor.best supporting actress. Best screen play .best song.and many other categories nomination in oscar.RRR such a master piece of bahubali's director.",
            "review_date": "2022-09-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Over the top but that's why I watched it and enjoyed it",
            "review_date": "2022-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thanks Netflix. This movie is completely over the top Bollywood, but watched on friend's recommendation. Pretty cool.",
            "review_date": "2022-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not going to be for everyone but I really enjoyed it!",
            "review_date": "2022-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Indian cinema answer to marvel and DC! \nBest movie of the year by farrr!",
            "review_date": "2022-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spectacular. One of the best movies of 2022. So refreshing and is truly a cinematic treat. Not a moment in the film you won't be on the edge of your seat.",
            "review_date": "2022-09-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Over the top in the best way possible",
            "review_date": "2022-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's fabulously mind-blowing experience ever 😱",
            "review_date": "2022-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Literally one of the best movies I ever watched",
            "review_date": "2022-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely incredible. You know it's incredible when you can't stop thinking about it long after you've finished watching. I've never seen any movie as bizarre and over-the-top as this, but holy cow--it all works somehow. The lead actors just chew up the scenes with poignant performances and they're just as likely to execute a superhero level action sequence as they are to break into a serious musical number. Bravo to the actors and filmmakers.",
            "review_date": "2022-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RRR is a fun action-packed musical that is over the top and amazing!",
            "review_date": "2022-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was just a master piece, it makes you think about the hindu movies that maybe are great but we have not investigated more about them. The music is an absolute BLAST! The action is unreal and keeps you engage all the 3 hours. This was a good adventure, great ending, awsome characters, emotional plot and makes you smile too.",
            "review_date": "2022-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just entertainment and just friendship at the very best.",
            "review_date": "2022-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After a friends suggestion we watched one of the most entertaining, vastly DIFFERENT and simply insane films.  Indian cinema is vastly different than what I'm used to watching and the music is just fantastic.  The dancing of which there's plenty is delightful.  It does run around 3 hours, so we watched it early on Netflix.  The combination of all elements of comedy, music, dance, amazing fighting scenes is simply 'over the top.'  Did I say over the top........  it's freakin' outragious, beautifully shot with incredible CGI animals.....quite the romp.",
            "review_date": "2022-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Bollywood movie I've seen.  Great acting,  action, writing, cinematography,  sound... the whole package \n\nPs can a Bollywood movie get nominated for a Oscar?  This one should",
            "review_date": "2022-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome and Phenominal",
            "review_date": "2022-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a story! What a spectacle! This movie is a remarkable achievement for Indian action cinema, and for primarily one reason of the uttermost importance: it seamlessly mixes very classical, Shakespearean plot with mind-bending, incredibly creative action scenes that are made with skill and imagination becoming of artisans whose dwellings are no lower than at Mont Parnassus. Neither of those two are praiseworthy on their own – without the story \"RRR\" would be an empty action flick more akin to what Marvel and DC do in the US, and without the action will become a dull and overly simplistic period piece more akin to an umpteenth re-edition on \"Ben-Hur\". But this movie has both and they work, God, how they work to make this movie the best it could possibly be. Only at places (especially at the ending) it becomes too didactic and the viewer is reminded that it is also, at least in the smallest part, a propaganda piece, even if it states at the very beginning that it does not intend to be so. Forget that though, \"RRR\" is perhaps THE cinematic event of the year and you would be hard-pressed to find anyone who would event attempt to say otherwise.",
            "review_date": "2022-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is new and refreshing. The production is top-notch. Every actor and actress nailed their performances. There are elevations and goosebumps moments. The VFX team definitely needs appreciation.",
            "review_date": "2022-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must watch film.. No doubt, story is simple but casting , songs dance numbers,  fantastic visual theatrical experience saved all.. . NTR, RC are national award worthy!! Full of emotion, action packed OTT scenes make u feel proud  that yes Indian cinema is alive..Rajamouli rocked, everybody shocked",
            "review_date": "2022-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i loved this movie so much the first time i watched it that i immediately watched it a 2nd time. & then i watched it a third time the very next day. it's a fantastic story with exceptional cinematography & a super catchy soundtrack. to be honest, i wasn't ready for it to be a musical production - which even though I'm a big fan of musicals in general, i don't like to be surprised & usually end up hating the movie it I'm not properly prepared - but i just abso-fricken-lutely loved all of it; musical & all. 10/10 movie. would most definitely recommend.",
            "review_date": "2022-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow! This is a must see movie, the cinema photography, the action the story. I'm watching this again",
            "review_date": "2022-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it very much. Except dehumanization of british and ignoring the positive aspects of colonialism. And pushing nationalistic ideas two much. But the movie is great after all",
            "review_date": "2022-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fine movie. Super nonsensical with its action and plot points, which is was definitely the draw for me, so if you want that, it has it. The musical number at the end seemed a bit strange and out of place, but that's definitely a cultural difference. The dude playing the Indian British soldier was definitely the best, most charismatic actor in the picture. Don't know if I could recommend it, but if you want a fun time with some friends, laughing with the bizarre action, this is for you.",
            "review_date": "2022-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My fiance who loves bollywood made fun of me because I don't usually go for Indian movies, but this one is an absolute must-see hit! So much fun, depth, and excitement.",
            "review_date": "2022-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "refreshing film, 2020s bullcrap is absent in this amazing spectacle! 👏 👌 😀 ",
            "review_date": "2022-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Master Piece by SS RajaMouli",
            "review_date": "2022-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched this with my 16 year old son who would usually walk out on dance routines (of which there was only two), but even he enjoyed it. The plot, the characters, the cinematography. An absolute epic of a movie.",
            "review_date": "2022-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Photography and visual effects were a treat to watch.",
            "review_date": "2022-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Storytelling is Exceptionally done in this Movie, Action is Another Level just Bonkers, Acting by the Two Leads (Ram Charan and Jr NTR) is Extraordinary, Direction of SS Rajamouli is Award Winning... My Favourite Movie of All TIME...",
            "review_date": "2022-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best entertainment i've ever seen since the start of the pandemic. Love it.",
            "review_date": "2022-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RRR (2022): India. A patriotic historical drama, with Brits as the bad guys. An over-the-top action movie, violent and bloody. Frenzied Bollywood singing and dancing. What's not to like? (Brits excepted, but they can watch James Bond instead.) Best movie of 2022 so far. A-",
            "review_date": "2022-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutley wild, loved everything, even the dancing and singing made sense.",
            "review_date": "2022-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story has so many twists and turns that work... and the fight choreography had me shouting, \"No way!!!, So cool!!!\" more times than I can count.  The cinematography is epic.  It's 3 hours because 1/3 of the movie is due to amazing use of slow-mo.  Is it cheesy?  yes.  Is it very extra?  Yes.  But so worth watching!.",
            "review_date": "2022-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RRR will get you into Bollywood like how parasite got you into Korean cinema.",
            "review_date": "2022-09-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie has it all! Amazing action, wonderful characters, a fun adventure, a \"Bromance\", and a compelling villain! Fellow film lovers, you haven't lived until you've seen a guy throw a leopard! This is a fun, exciting, and beautifully shot movie! Hollywood, could learn a thing or two about this gem of a film.",
            "review_date": "2022-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best action movie in decades regardless country.",
            "review_date": "2022-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nauseatingly over the top.",
            "review_date": "2022-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An exciting movie, with a quiet beginning that in a few minutes brings you mixed emotions, passing through action and catching you in a few minutes. The plot is simple but gripping, like all Indian movies it is very delirious, with musical scenes but it is enjoyable because it is well cared for, with stories of love, revenge, friendship and betrayal; the soundtrack accompanies very well. In the middle of the movie the plot takes a break to close a subplot, to give rise to tell us the denouement with another subplot in between and to continue trapping the viewer despite the great length of the film, with very well cared battles in photography, choreography and shots that embellish the heroes of the story. Negative points: like every Indian movie it is overacted but it makes it a little fun to watch; CGI in certain moments, mainly the animals, is a little weak that at certain points takes you away from the magical atmosphere in which the movie takes you.",
            "review_date": "2022-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is so hilarious in all the best kind of ways. What a gratuitously fun ride.",
            "review_date": "2022-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was such an epic movie experience and it gave me such a high, that I don't know if I'll ever be able to enjoy another movie again! I don't think anything is going to top this! It is by far the most exciting, and breathless movie, I've ever seen!",
            "review_date": "2022-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1st hour was slow but the rest of the movie was great",
            "review_date": "2022-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this is probably the best movie I've ever seen. this was like watching a trilogy in one film and didn't get boring or slow-paced at any point. This movie was so epic and I loved every second of it. Better than anything Hollywood has ever made.",
            "review_date": "2022-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most fun u'll probly ever have watching a movie.",
            "review_date": "2022-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After hearing this movie is spectacular from all over the Internet, I decided to give it a shot. I will admit that I am not a huge fan of musicals and while I do love a good action movie, extremely over the top is something that is a turn off to me. Having said that RRR is a well made movie. That is the only praise that I can get it. The story is generic, which isn't too much of a strike against it. There are a lot of stories out there that have been repeated over and over again. The issue that I have with this movie is the extreme nature of the action. I do love a good over the top action movie but, there is something about how it's done that resonates more than anything else. Instead of coming off insanely awesome, the action seems more of a borderline parody. I had the same issue with the recent Fast and Furious 9. This movie comes off more like a live action cartoon, which can be extremely offputting. If you need a sense of groundedness to your action movies, this is not the movie for you. Overall, there are some moments that really do make the movie enchanting but for me those are few and far between.",
            "review_date": "2022-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Literally a perfect movie. Anything anyone could ever want, ever.",
            "review_date": "2022-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfect example of an \"Entertainment\". I don't have words to describe it... just \"Excellent\"! 🤩🤩🤩",
            "review_date": "2022-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Refreshing and engaging throughout",
            "review_date": "2022-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hollywood should be taking notes.  So this is a fictitious story about two legendary revolutionaries (N.T. Rama Rao Jr., Ram Charan Teja) in India in the 1920s.  Their paths are on a collision course, but will they emerge as friends or foes?  Now I typically don't watch a whole lot of Bollywood.  It's for the same reason that I haven't gotten into all that much anime: the library is so extensive that I don't know the best place to start.  With RRR, however, too many of the right people have been saying the right things about it.  Perhaps it has something to do with it being the most expensive Indian movie ever produced, but regardless, I decided to give it a watch on the last day of my vacation.  After all, three hours is a pretty tall commitment, so what better time to watch than a day with no obligations?  RRR may take up a large portion of your day, but pound for pound, this is about the most bang you will ever get for your buck when it comes to watching a movie.  RRR is ridiculous in the best way possible.  Yes, it's outlandish, but it's honestly not that far off from the very best Marvel movies, with the only difference being that they aren't spelling out that these two guys have superpowers.  You will know exactly the kind of movie you are watching by the time you get to the title card.  Granted, that's at the 40-minute mark, but it's a wildly entertaining opening.  What I love about this movie is that it knows that it needs to keep topping itself.  Because they are aware of that, it keeps escalating, and it keeps your engagement heightened.  That makes it so you don't care about the extended runtime.  I'm not usually a fan of movies being this long, but there are always exceptions.  Personally, I took a couple of mini-breaks during the act shifts, but I was always excited to pick it right back up again.  This is a movie that kind of has it all.  Obviously, if you've watched a trailer or the autoplay Netflix bumper, you know that they have action covered, but there is also comedy, romance, singing, and expertly executed dance numbers.  What more could you ask for?  I only have a couple of minor quibbles for RRR.  I don't think the CGI on the animals is the best you've ever seen, but that might be for the best because they do some pretty crazy stunts with them, and nobody wants to see an animal in peril.  I wasn't the biggest fan of the English actors in this.  I'm not sure if S.S. Rajamouli is just better at directing people who speak Telugu, but the majority of the white actors felt like Imperial officers from Star Wars for the majority of this.  That said, these are pretty minor flaws, and I'm not going to hold it against this hugely enjoyable experience.  There's a solid chance that this will get promoted to a five-star movie if I give it a second watch, and let me tell you: I highly desire to watch this again.",
            "review_date": "2022-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it was a long movie, the numerous plots converged into one massive hit that is RRR. Seeing something so outlandish, fun and action-packed was refreshing while trying not to be too serious about itself. I think if it were too serious, the depiction of British rule in India would have met backlash or not lend itself to a wider worldwide audience. It wanted to depict the struggles of being under colonial rule, as well as marrying depictions of well-known characters and gods in their culture. While some may find this to be nonsensical, especially the action scenes, personally, I think this was a benefit, because the British rule was harsh and cruel, and this may be harder for the wider audience to stomach. The costume design, set design and actor choice were impeccable. While the storyline was 3 hours long, it was gripping throughout! The multiple storylines created emotion as well as story and character development that was fulfilling. The FX used lent itself well to the outlandish nature of the movie, and used only during action scenes or montages. The music and dance used in the film was fantastic and fun, providing moments of relief and highlighting the relationships between the characters.",
            "review_date": "2022-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true masterpiece with bunch of emotions and bromance. #RRRforoscars",
            "review_date": "2022-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic film that's extremely entertaining from start to finish. Takes us on a tour de France between different genres seamlessly. Albeit ridiculous, that's part of it's charm.",
            "review_date": "2022-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The problem with The Batman, Endgame & The Irishman is that at a certain moment you feel that they're quite lengthy, but this isn't the case with RRR because it deserves a 3 hour runtime, also it's a perfect balance of emotional moments, character bonding, realistic natural comedy, over-the-top action, an inventive choreographed dance, a satisfying romance it have all those stuffs if there is someone who still don't experience this my recommendation for you is that if you don't have any problem with over-the-top action or if you don't have any problem with action sequences where they break all the rules of physics then this one is for you.",
            "review_date": "2022-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The songs are an exaggeration, but it's a real fresh air in the midst of so many ideological and political films.",
            "review_date": "2022-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My first 5-star review of the year, and it is well deserved.  While the dialogue can seem stale at times, the story is taut and engaging.  What sets it apart however is the dynamic nature of its tone.  From deeply enthralling drama to hilarious comedy, into outlandish dance sequences that lead to action set pieces that will blow your mind.  To me, this is why you watch movies.  To see something you have never seen before.",
            "review_date": "2022-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie. It shows Indian standards of movie making! Kudos to director and all the cast and crew…",
            "review_date": "2022-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe there are movies which are more serious, have a better plot or better character development. But I've never have seen a movie where every bit of film making technique tells the story. Every cut, every score, every slow mo, every action scene progresses the story. The cinematography is just awesome. It is a 3h long movie, but there is not a single scene where it feels too slow or boring.\n\nThe only unfortunate thing is the musical after the movie ends, it really has very bad Indian Hindu nationalistic vibes.",
            "review_date": "2022-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Film is too Awesome. A Patriotic Film which Everyone Indian shoudl watch. Moreover, the Songs and Small Details are awesome too. Worth to Watch in Theatres",
            "review_date": "2022-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The writing is quite mediocre, but I would be lying if I said I didn't enjoy the movie! The visuals are on another level and there were moments where the cinematography was just pure art. The action sequences are also over-the-top and excellent.",
            "review_date": "2022-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Boring. Waste of time. Only for a showoff. That's all. Also not a good theme. Just a huge stunts, build-up and showoff movie. A child story and no reasonable and no logical fights. All about 2 guys shutting down a kingdom, is that enough for a feature length 3 hours movie. Worst theme. Ok for children to watch, coz no logics are needed.",
            "review_date": "2022-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So so much fun-oh it is foot tapping, over the top CGI, adventure, comedy and even romance and the so many animals-totally over the top and one of the best movies for a long time.",
            "review_date": "2022-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must watch film!! Is anything required to describe ?? Cast, cinematography, choreography , direction everything nailed it .. SSR supremacy yet again!! No words to speak.. Full of emotions.. Jai hind",
            "review_date": "2022-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another superb movie . 🇮🇳❤❤",
            "review_date": "2022-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly the greatest film to ever grace my flatscreen. I am honored to have existed at the same time as RRR.",
            "review_date": "2022-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest movie in the history of all cinema combined",
            "review_date": "2022-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can't believe how great this movie is! Start to finish it never got boring. And for a 3 hour movie that's rare! Indian Films are gonna start kicking USA's ass lol",
            "review_date": "2022-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3 hours of wtf action and entertainment! You have to suspend disbelief and physics and you will enjoy from start to finish. I was thoroughly impressed by this gem of a movie. The action sequences, special effects, story, dancing… it was a melting pot of so much thrown at you; somehow worked!",
            "review_date": "2022-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So surprised with just how enjoyable this film was. Great casting and some really cool martial arts and fight scenes. One awesome dance scene had me laughing out loud. I also loved how over-the-top evil the British were. One star removed as it got a little slow in act 2 - it's a three hour movie and some editing would really tighten it up.",
            "review_date": "2022-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you did not watch RRR, you are missing out so much fun in your life.",
            "review_date": "2022-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "S.S. Rajamouli is a visionary director. His imagination and execution are on another level!",
            "review_date": "2022-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Every person should get a weapon.'  It's not a film about what Republicans hope for the future of America, but rather an awesome cinematic flick.  It is a lot of different things all in one, and they all work.  If you want violence, blood, gore, humor, romance, all combined into one long set piece with dance and sone this is for you.  Here's the thing: this is the 3+ hour film you never knew you wanted.  Totally worth the watch and I was always into it.  N. T. Rama Rao Jr. and Ram Charan have charisma and chemistry.  The violence may be over the top, but who cares!  Final Score: 9/10",
            "review_date": "2022-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Adrenaline filled entertainment at its absolute best. I haven't really branched out into Tollywood or Bollywood films before and this was an amazing introduction. I love that the over the top action had an actual purpose to it, and it wasn't just there for the sake of being there. For example, the introduction to Bheem's character of him catching a tiger was there to not only make him look cool but capturing the tiger actually had a purpose that was paid off later in the movie. All of the dramatic and over the top moments in this movie are like that; they are there for entertainment purposes but they also serve the overall story, and this is why I think this movie works so well. It was a perfect example of using crazy sequences in order to create better storytelling. I didn't mind the over the top moments because without them this story wouldn't have been as good and I wouldn't have cared about it as much. The movie made me love the two lead characters because it made them seem so cool and heroic, and this was thanks to the dramatic action and moments. The story is also massive and well thought out, and it has something for everybody to enjoy. This movie just made me so happy and I loved every minute of it.",
            "review_date": "2022-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A freaking action movie MASTER PIECE!\n\nI'm sorry if you are not going to have a guy graving and throwing a motorcycle to his enemies, or a single guy taking on a hundreds of people mob then you don't deserver to be called an action movie, go to bed :P",
            "review_date": "2022-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An action fest! Tollywood shows Hollywood how it's done. Unexpected twists, incredible action and creative stunts in an immersive story.",
            "review_date": "2022-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is great and I highly recommend it. Though this isn't a review on the movie and it's more on the scarcity on how you can watch the original Telugu version. Whether through legal or illegal means, this movie is extremely hard to find in the original Telugu. The only legal means i could find is zee5, another streaming service that no one will have or people would only get for one thing then imminently cancel.\n\nIllegal means only has it in either Hindi or Tamil. So you might as well just watch it on netflix in Hindi with english subtitles.\n\nAgain, Not a review, just a warning on where to get it and what to expect",
            "review_date": "2022-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome Movie. Most entertaining I have seen in a long time. ",
            "review_date": "2022-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Second half was not at all best.",
            "review_date": "2022-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie of all time till date.Both actors were phenomenal.SS rajamouli get it's right again with these 3 hours of  actionpacked magnum opus.",
            "review_date": "2022-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Bheem-Raju love story is something else.",
            "review_date": "2022-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a ride. From the first scenes to the end… non stop action and story. It works. I'm never usually a fan of movies with subtitles but this was amazing.",
            "review_date": "2022-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a masterpiece. Will definitely be coming back to rewatch.",
            "review_date": "2022-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movie ever with all the entertainment elements needed like action, drama, historic, choreography, musical, VFX, etc.",
            "review_date": "2022-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"RRR\" reminds me of the time I drove 50 miles to see \"Star Wars\" in the first few days after it opened. I had never seen anything like either of these movies! \"RRR\" is a buddy film, an action film, a romance, a bromance, a historical epic, a thriller, a comedy and a Western - all rolled into one. Spectacular!",
            "review_date": "2022-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cheesy, over the top, ridiculous, unbelievable, on the nose, cliché... and one of the most entertaining movies you will ever see. This will make you laugh, cry, want to dance, say \"wft\", and start your own revolution. Just an all around GOOD TIME watching a movie in the style of summer block busters but Indian style.",
            "review_date": "2022-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its a mess of a film, continuity is all over the place, dialogue not synchronized to the lips, unjustified reactions from the whites and forced emotion via 800 slow motions shots. All together making it even more epic to watch, it was so weird yet so awesome you cannot look away. The dance speed is crazy. Then to look at the endless comparisons to Fast & the Furious by the critics on RT adds even more to the confusion.",
            "review_date": "2022-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Remember when men could be men and brotherhood wasn't a dirty word? Hollywood  doesn't but this movie sure does. RRR is awesome with insanely over the top action sequences and an engaging story to boot. I've had to look outside of western cinema as it's mostly boring Marvel movies that are creatively bankrupt and this fills the void with ease.",
            "review_date": "2022-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you like bells and whistles it's a movie for you.\nBut if you are a hardcore movie watcher who prefer nolan movies over Micheal Bay movies, this is not for you.",
            "review_date": "2022-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An epic in every sense, even in terms of runtime, which may have benefited from fewer slow-motion moments. Each scene has magnificent visuals, and the soundtrack is a wonderful fusion of traditional and contemporary sounds. The plot is straightforward, but there is a lot of drama and outrageous action that intensifies as the movie goes on. The CGI is a little overdone, and the terrible British dictatorship is a touch much, but it still looks good. Although I did thought the musical performance at the end was a satire, the movie is heartwarming and hilarious at times.",
            "review_date": "2022-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": ")\nGreat Performance from the lead Actors🔥🔥🌊🌊\nSuperb Action Sequences.\nExcellent story.",
            "review_date": "2022-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is wild. Like a true Bollywood epic it is over-the-top in every way, but it has a huge heart. This one, however, adds deep allegory, mythological/religious themes, historical context, and the most mind-blowing fight scenes. It's just amazing. I'm not deep into Bollywood, so perhaps people who are Bollywood aficionados have a different reaction, but I think people should see this film. It's just a feast.",
            "review_date": "2022-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Typical Indian movie for the times. Nothing new with the exaggerated and super fake fighting scenes and the extremely overdone and predictable from beginning to end plot. I love Ram Charan but even having him and some of the other important characters trying to make this a half decent movie doesn't change the fact we've seen this type of movie hundreds of times now. Make more interesting movies with better writing and maybe possibly, hopefully with a bit more believable fights that aren't so ridiculously inhuman that it just makes you scoff at how dumb it is. I'm hoping that this fake and unbelievable fighting that started with dabanng will end very soon because it just makes people cringe more than anything now. There also needs to be work done on making the story better and less predictable then what we've been getting everyday for the past decade or more now.",
            "review_date": "2022-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the first bit of Indian cinema I have ever viewed and I am hooked.\n\nI absolutely loved the 3 hours I spent watching RRR. It took me a while to get to it because the run time seemed daunting but I am glad that I finally carved out time to watch it. RRR is over the top and ridiculous in all of the best ways. The visuals, action, dancing, all of it - A++. \n\nMy only minor gripe would be that the plot was easy to figure out. It was not ground breaking by any means and it was clear to figure out what the \"twist\" was. This did not detract from my enjoyment of RRR at all, but if I had to find one thing to critique, this would be it.\n\nOverall, I really enjoyed RRR. It was unlike anything I've ever watched and I am excited to explore more Indian cinema. Many thanks to Straw Hat Goofy for recommending this one on TikTok.",
            "review_date": "2022-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is instantly one of my favorite movies ever!",
            "review_date": "2022-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Weird that people either hate or love this thing.  'RRR' gets points in the West for just plain not being like anything else.  I feel like a missed much of this film as I suspect a lot of it is common Bollywood trope, and there were a bunch of cultural and political references that I had no clue about.  The film them proceeds to be as whacked out as possible, as if Hunter S Thompson was filming Indian history.  The narrative and battle scenes made zero sense and were completely implausible.  I guess fine if you are making a cartoon, which is basically what this film is, replete with mustache twirling British baddies.  I found myself fast forwarding through the 'action' scenes to get to the maudlin dialogue.\nAll that said, the cinematography, visuals and stunts are impressive, and I thought the bromance worked pretty well.  I especially liked the Raju cop character.",
            "review_date": "2022-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was the ultimate movie. I have nothing but positive things to say about it. Although, the one and only negative is that it has a 3 hour runtime, when it definitely could have been longer. I can't begin to describe how much I loved this movie. It was perfect in every conceivable way. I have recommended this movie to everyone I know, and I think it should be an actual crime to not watch this masterpiece.  From the acting to the directing, the cinematography and editing, even the vfx are all amazing. And don't get me started on the multiple musical/dance numbers performed throughout. This movie redefined my definition of what a film was, because until now, I had yet to see a truly perfect piece of cinema such as RRR.",
            "review_date": "2022-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesomely entertaining!  Visually amazing.  The cgi animals were great.  It took me some time in the beginning to get into the swing of its story telling process, but once I did I found it to be completely engrossing.  The two main actors were also amazing, their dancing was terrific, they were both strong and handsome and so agile and completely sold the scenes with cgi animals that I totally believed it. Great movie, watch it!",
            "review_date": "2022-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My brother trapped me at my sisters house with no way to get home. Forced to watch a movie, that wasn't even in my language, i fell into a deep slumber. The nap was great the movie was not. Enjoy reading the screen!",
            "review_date": "2022-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you liked Lord of the Rings and others like it, this will be a treat. If you just like to watch fantastic movies,  great acting, unbelievable cinematography, lighting, directing, editing, this movie is for you. \nCertainly the best I've seen in the genre.\nNow,  if only the actions movies made in America used a third of the morals and ideas and beauty of this movie, I bet our young generation would be much better served",
            "review_date": "2022-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent story and movie. Slightly less flamboyant than some Indian movies.",
            "review_date": "2022-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epically absurd, outlandishly silly, yet captivatingly entertaining!!! I've never seen anything quite like this, but I couldn't give it a perfect 5 out of 5 simply because you can only suspend your disbelief so far!!!",
            "review_date": "2022-07-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply amazing. Hollywood needs to take a lesson from this movie. ",
            "review_date": "2022-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a wonderful production.    great dancing, costume, scenery, singing.  except for the violence, i would give it five stars.  best picture i seen this year.   great cast.    dancing number outstanding.   good story.   if you not British, you will love it.   if more people from the academy see it, it could win best picture of the year.  special effect and stunt was really good.",
            "review_date": "2022-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As someone who usually doesn't like over-the-top action sequences, I genuinely liked this film (even though some over-the-top scenes bothered me just a little bit). That being said, this movie is all about patriotism and emotions. A visual spectacle with spectacular CGI and cinematography.",
            "review_date": "2022-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know what I just watched but it was the most entertaining movie I have ever seen",
            "review_date": "2022-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's just fantastic. The story is simple, but overall ends up being brutal. It's three hours long and somehow soaks in every minute. I only wish Netflix had the original Telugu version in Netflix so the dubbing wouldn't look and sound weird. There is no other movie like this.",
            "review_date": "2022-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There were a lot of great things about the movie, and I was hooked on the action within the first minute.  However, at times it got so cheesy that I had to laugh.   I realize that many people love this type of sentimentality, but I'm just not one of them.",
            "review_date": "2022-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie was shockingly fantastic. I've never seen a Bollywood film in my life, but this was a great story, entertainingly absurd in parts, touching, maybe a tad long but better than 99% of films you can watch. Just a solid character driven film.",
            "review_date": "2022-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Blew my mind; \nInsane action pieces ✅️\nGreat chemistry between protagonists ✅️\nAmazing songs and dancing ✅️\nEmpowering message about freedom ✅️\nUnintentional message about gay rights ✅️\n\nI think I have a double crush 🏳️‍🌈",
            "review_date": "2022-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "UMMM!!!! I'm really disappointed by the movie. I mean the acting and action scenes were good but was ruined by the story. I dont know why internationally people are appertaining. I mean WHYYYY!!!! The ending of this movie was wayy to over. COuld not make myself happy. Rather watch KGF or Vikram",
            "review_date": "2022-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb film, a must watch one.",
            "review_date": "2022-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RRR ended up being one of the biggest Indian movies for many obvious reasons. This is an astonishing spectacle of epic storytelling, incredible technical craftsmanship and a typically Indian, highly enjoyable cocktail of different genres put together into a messy, but eclectic mix. The immense silliness of its action sequences was downright ridiculous and frequently quite dumb, but there is no denying that the movie is hugely entertaining and never boring, which is an impressive accomplishment given its staggering three-hour runtime. The main bromance and the infusion of Indian Mythological elements into a period piece were the two standouts plotwise while the movie's big heart and electrifying performances from its two stars were its biggest selling points.",
            "review_date": "2022-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wasn't sure what to expect going into the movie, but man, 10 minutes in and I was sold! Epic action sequences and a good story that grabs you and draws you in for the entire length.  It was like watching Michael Bay and Baz Luhrman make a movie together.  It is not for everyone, but if you wanna be entertained for 3 hours, I would recommend it!",
            "review_date": "2022-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a mixture of all blockbusters movies together. Have everything from dance number to action, romance and bromance. Absolutely loving it.",
            "review_date": "2022-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RRR is a wonder to behold. Like a South Asian historical action fantasy myth come to life but with music and dancing! Has so many moving parts, it's a miracle that it all comes together in such a mind blowingly great way. Incredible production with superb performances. Three hours of thrills that just fly by. Please see this fabulous film!",
            "review_date": "2022-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a very entertaining movie! It has it all, the history, the action, the sorrow, the laughter, and the romance! Great actors! Action packed 3 hours. True enjoyment!",
            "review_date": "2022-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's action, it's heart, it's one of my favorite movies of the year! Yes, it is long..BUT WORTH IT! Everything is answered by the end and you will laugh and cry! SEE THIS MOVIE!",
            "review_date": "2022-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Story well told. You will want to watch thid movie over and over for the insane sequences, dance steps and the emotional roller coaster you will be thru.\n\nOne of the Best movies I have ever watched",
            "review_date": "2022-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the best movie in recent time. Specially Ramcharan acting is excellent.",
            "review_date": "2022-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From the perspective of a white Londoner, I cannot emphasize how much this film rules.",
            "review_date": "2022-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most expensive Indian film produced to date at the time of its release, RRR is a mega-blockbuster that uses heavily fictionalized accounts of famed Indian independence leaders as inspiration for an buddy-action epic with exuberance and creativity in that uniquely Bollywood style. I imagine the rough American equivalent would be if Ben Franklin and George Washington teamed up in their younger years for a dash of revolutionary guerrilla warfare, but there's no way a Hollywood studio would be able to make that work. \n\nS. S. Rajamouli creates a sweeping film that is less concerned with the tightness of its writing (and certainly not with realism) as it is the visual spectacle; while the quality of the CG might not be up to the standard of other big-budget productions, RRR makes up for it largely with its willingness to use it in creative ways. In this director's world, emotion is the standard currency, so if we want a joyful dance-off between our two protagonists (who are again, real-life Indian revolutionaries) against an entire British garden party, we'll get one. With leads as charismatic as Ram Charan and Jr NTR, this script conveys just as much about male friendship as it does about the Indian struggle against the British Raj. Representative of quite a bit of what is distinctive and enjoyable about Indian film. (3.5/5)",
            "review_date": "2022-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must watch 💥\nBrilliant movie🔥",
            "review_date": "2022-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Second half should have been better",
            "review_date": "2022-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In trance after witnessing this. Absolute Spectacle.",
            "review_date": "2022-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved it to the core!!",
            "review_date": "2022-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "sensational, spectacular and  heart touching",
            "review_date": "2022-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely drags a tiny bit, but it's so full of action and heart that it makes it worth the extremely large time stamp. Was awesome all the way through, particularly the third act and the opening sequence are absolutely awesome. The subtitles, which would normally turn me off, were barely an issue because of how great the film was. Highly reccomend this experience.",
            "review_date": "2022-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie with lot of emotions,drama ,fights .",
            "review_date": "2022-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that you never seen before and you'll never gonna watch in the future too...🔥🔥\nBrace yourself while watching...#RRR\nProud to be that the creator of this cinematic visual grandeur from our Motherland #India\nWatch it in Netflix (Hindi) to only enjoy the movie. Watch it in Zee5 (Telugu) to feel the #Roar🔥🔥",
            "review_date": "2022-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent new age taking with weakest 2nd half and worst climax. As a biggest fan of Baahubali, couldn't enjoy this half baked film 💔\n\nEven I like SSR's 16 years old works better than this. Just rating it 5 as a fan of Tarak, SSR, MM Keeravani since 2 decades ago.\nDespite of having worst non emotional, meaningless plot, this film had a good first half where we can find mixed emotions, good friendship, nice characterizations, etc. We can binge watch first half, and few scenes in second half. The climax is as bad as heck couldn't watch that sequence patiently. It's choreography is worst of all other rajamouli's films. Apart from new age filmmaking, he disappointed as a director too 💔 He limited Keeravani's work a lot in background score, which resulted a lot of emotional lack in the film.",
            "review_date": "2022-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie of all time.",
            "review_date": "2022-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow , Speechless.. Luckily I watched it in India and the craze in the theatre was massive.. SS Rajamouli is a visual genius.. So happy that the foreign viewers are seeing true full blown Indian cinema..",
            "review_date": "2022-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie gave me the best experience that I have ever had in theater. A complete action-packed emotional movie which includes Bro-mance, rom-com, Action sequences those make our jaws drop and also the technicalities and photography of the film is top-notch and last but the least the performances by lead roles is just splendid. Everyone on the screen gave their best and lit the screens on fire and they have definitely made the same in the hearts of viewers. This is a must watch magnum opus made by SS RAJAMOULI and he is gonna continue this series of blasting theaters every time he made a project.",
            "review_date": "2022-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It left me speechless while watching this movie. It is so magnificent that I'm in awe the entire time. It deserves all the attention it was given.",
            "review_date": "2022-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Movie of 2022 !! Emotional + thriller + Romance + Bromance + Top level Cinematography + Amazing Dialogues + Goosebumps guarantee . Just 10/10 Indian 🇮🇳 movie !! You will love it . Don't waste your time just watch it now on Netflix 🔥",
            "review_date": "2022-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best Action movie in recent times, first one hour you will be in wow mode, middle half\nthere will be Big Bang, finally the climax is very well composed, will keep your ears at\nmaximum level of sound effects, don't miss this Indian epic movie.",
            "review_date": "2022-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Three hours without and dull moment 👍🏻👍🏾",
            "review_date": "2022-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome vfx with brilliant narration through out the movie. Every department worked very well to get this output.",
            "review_date": "2022-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the Best movies I've ever watched. Believe me or not I've watched this movie 9 times in theatre and it was still great as the first time. Both Actors performed very well especially the actor RAM CHARAN who played the Cop was extraordinary, like he Portrayed different shades in him easily. Worth your time. Watch it in theatres bcz it's such a grand spectacle...",
            "review_date": "2022-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie is good to watch with high resolution . Top notch visuals and great acting",
            "review_date": "2022-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "RRR is a visual wonder. Its a fictional story based on a lives of Alluri Sitarama Raju and Komaram Bheem.  The way in which director S.S. Rajamouli portrayed the characters was awesome. The main highlights of the film include: The entry scenes of both actors Ram Charan and  NTR; The interval fight between the two; The climax fight.",
            "review_date": "2022-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Its an absolutely overpower",
            "review_date": "2022-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the greatest movie experience ever.",
            "review_date": "2022-06-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "HOLY COW!!! I could never describe how EPIC this film is! Everything is just WOW! I could safely say this movie is a little better than Avatar and I am proud of it. That's how excellent this movie is. It was extremely moving and this could be best watched via IMAX. I will be watching this movie again tonight with a friend! I can't get enough of it!",
            "review_date": "2022-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A grand scale film that isn't without its flaws, but led by strong performances from its 2 lead actors. There are moments where it feels like things were overdone and also the overall film length could've been shorter, but they decided to include a lot of backstory and parallel storylines that took time to get covered and align well.",
            "review_date": "2022-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the greatest theatre going experience of my life. This movie is a ballistic thrill ride, filled with heart, jokes, and some of the best action scenes I've ever seen. Few movies come close to the sheer chaotic spectacle this experience provides. Please go see it with friends in a movie theatre if you can!",
            "review_date": "2022-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i really like the movie, its a fun & highly entertainment, so story telling is the best core of the movie & over the top action its ok just like marvels do without any logics or reality and fun fact is its have all genres 3hours run time is just fly like nothing because of thr great character i would recommend to watch everybody.✌️",
            "review_date": "2022-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I completely enjoyed this film.  It's long, but I never once found myself bored.  Great action sequences.  Not a movie I would typically watch, but once I started, I couldn't turn it off.  It captured me.",
            "review_date": "2022-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Definitely a fun time, all about the bromance but that section was the shortest it seemed.",
            "review_date": "2022-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An epic in every way including run time, which may have been helped by having less slow motion scenes.  Every scene is visually stunning and the music is a great mix of traditional and modern styles.  The story is simple but with plenty of drama and over the top action which gets more extreme as the film progresses.  The evil British tyranny is a bit excessive and the CGI is a bit obvious, but still looks good.  It's a fun film throughout, heartfelt and humorous at times, although the musical number at the end did make me think it was a spoof.",
            "review_date": "2022-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In two words: Batshit insane. The political (historical) backdrop and the religious mumbo jumbo were nothing more than superficial plot devices. Even the brutality was absurdly cartoonish (the Braveheart scene in particular) but the film, with its over-over-over-the-top wackadoodle action sequences, daffy man-love scenes, romance novel cover art erotica cheesiness, and nonsensical pacing was nothing short of spectacular. I loved it.",
            "review_date": "2022-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "ABSOLUTELY MINDBLOWING!! Watched this masterpiece in theare and am forever grateful that I did that! From the start its already on full flow drama and action. The plot, the drama, the action, the songs AND THE DANCES!, the friendship and the values, portrayed in this SS Rajamouli Sir masterpiece is just crazily superb. Ive been raving about this movie endlessly, since 1 month+ ago I enjoyed this movie. CANT MOVE ON, 😭😭😭 you should just watch this movie!!! 💥💥💥🔥🔥🔥🔥🔥🔥💧💧💧💧",
            "review_date": "2022-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a piece of utter nonsense!  Even worst than typical Bollywood films.",
            "review_date": "2022-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is great movie with lot of emotions. The actors Ntr and ramcharan did their best. Especially NTR in komaram bheemudoo song did very very good, literally cried after watching that song.",
            "review_date": "2022-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An epic tale of when men were men and women were women. We'll never get a story like this in the USA again. My heart soared and my feet wanted to dance. I wanted to thrust my fist in the air to celebrate the victories on screen.",
            "review_date": "2022-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stepped out of my comfort zone and caught RRR. Bollywood has never really been my cup of tea but I loved all the wonderfully zany energy in this. Stellar pacing for a 3 hour runtime. Ludicrous over the top stunts were so fun to watch. A fun viewing experience all around.",
            "review_date": "2022-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unstoppable and life altering. Needs to be seen on the big screen in its original Telugu language!",
            "review_date": "2022-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "utterly speechless!!!!!! 🤯 epic doesn’t even do justice to describe the nuance of this movie. I came in clueless, but then ended up leaving the theater tenderly and refreshingly being reminded how much I fell in love with cinema. what a treat. masterful piece of art 🎬",
            "review_date": "2022-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Truly an exceptional mix of different genres and it excels at every genre. Action, emotion, drama, romance and even musical all packed in one. \nFull enteRRRtainment.",
            "review_date": "2022-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, this is wonderfully unbelievable. If only they had a dance numb—oh, never mind.",
            "review_date": "2022-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "SS Rajamouli strikes back after being dormant for 5 years! This is an absolutely amazing film and truly shows how far Rajamouli went with this one concept. The songs are absolutely amazing and some of the best songs in any film he has made (Awesome job MM Keeravani) and the drama really tears me up. The dynamic between Bheem and Ram just works so well. This is an absolute masterpiece and I think everyone should give it a go.",
            "review_date": "2022-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is complete trash. There is no story just random action and promotion of hate. Movies like this make money from\n1. associating with Indian history of struggle against british.\n2. associating one way or another with religion. \n\nThese days I am seeing many south Indian movies are making money out of these 2 topics which is totally wrong. Also such movies promote hate towards foreigners. The way they show 1 super fit Indian hero fighting 10 white guys, its totally wrong. They also show white men smaller and weaker. Jr NTR is only 5'5\" and in this movie he is shown crazy tall and bulky. Almost as big as a tiger. I am myself an Indian but these movies are selling false information. This brings arrogance in common Indian folks. They just start feeling they are some gods and they start to treat others with disrespect.",
            "review_date": "2022-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I usually don't dig Bollywood movies that were too over-the-top, which is like most Bollywood movies. However, I gotta give it to RRR for making it actually fun and exciting.\n\nHorrendous CGI aside, the dance scenes were super dope, especially that dance battle. Me and my boy actually wanted to give the dance a try. It won't be that good, but the point is that the actors were damn entertaining and amazing executing those moves. \n\nThe action scenes were just as badass. It's so hilariously ridiculous and stupid that I loved it. It's basically a superhero movie. The two actors were also the important part that made these scenes entertaining. \n\nThe story itself was not bad, even though it dragged so much during the middle part. I was bored for a good chunk, waiting for more action scenes. The backstories didn't really add much to the present plot, even though they provided some more fun action. And of course, I didn't feel any emotional connection to any of the characters, as I just wanted this movie to be all about the over-the-top action.\n\nOverall, it's a highly entertaining movie that I had a great time even though there's still many problems with it. 7.5/10",
            "review_date": "2022-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Waste of time, too much of illogical action.",
            "review_date": "2022-05-30",
            "source": "rt",
            "lang": "en"
        }
    ]
}