{
    "rating": 9.0,
    "release_date": "2022-07-13",
    "num_reviews": 38,
    "genres": [
        "Korean"
    ],
    "summary": "Ui-gang is a hit man who has decided to retire. He has a nice house and all the money he needs, but one day his girlfriend takes a trip to Jeju Island and leaves him with a request. Her companion on the trip has a 17-year old daughter Yoon-ji who will be left alone during their three week vacation. Ui-gang reluctantly agrees to look after Yoon-ji and make sure she doesn't get into trouble.",
    "reviews": [
        {
            "content": "Am entertaining, stylish action film. Easily four stars, but it earns the extra star for referencing one of my favorite action movies to come out of Asia: The Man From Nowhere.",
            "review_date": "2023-04-22",
            "source": "rt"
        },
        {
            "content": "This is an action movie to watch. While it takes ques from John Wick, with gun-fu, great gun play, frenetic visuals and music, The Killer also takes strong influence from the Raid franchise, especially the second movie.  The overall aesthetic, the added brutality and gore, the extended fight sequences and prominence of the martial arts are all more rooted in The Raid.\n\nThis is a quality movie for an action flick aficionado, and while it doesn't break a lot of new ground, it is fun and satisfying.  It's the kind of movie you'll watch dozens of times when you can't think of what to watch.",
            "review_date": "2023-03-25",
            "source": "rt"
        },
        {
            "content": "It was an amazing thrill riser with so many twists and turns. I loved every minute of the film.",
            "review_date": "2023-03-08",
            "source": "rt"
        },
        {
            "content": "I love the action and storyline, Jann Hyuk really embodies the cool assassin role, all the fight scenes flow really well and are shot perfectly to catch your eye. Lee Seo-young does a great job as Yoon-ji, I hope to see her in more films! I saw this a few times in theatres with friends and every time our group was happy coming out of the theatre, it's just a good movie.",
            "review_date": "2023-02-27",
            "source": "rt"
        },
        {
            "content": "The Killer is an extremely captivating action movie, full of excellent fighting scenes! Jang Hyuk, as Bang Ui Gang, shows a lot of irony, humour and care for loved and weak ones in the same time. Jang Hyuk delivers an excellent performance and a strong personal charisma. This movie is a must watch!",
            "review_date": "2023-02-24",
            "source": "rt"
        },
        {
            "content": "The action was fast-paced and continually changing. There were more kills than I could count, but surprisingly there was warmth and humor.",
            "review_date": "2023-02-24",
            "source": "rt"
        },
        {
            "content": "Excellent movie. My friends invited me to watch the movie with me at a theatre. I loved it so much; it captured my attention very well I would 100% recommend.",
            "review_date": "2023-02-23",
            "source": "rt"
        },
        {
            "content": "Best action I've seen in a while. The choreography was brutal and beautiful! Given Jang Hyuk and Bruce Khan being in this movie, you will see some top level fights. I also loved The Swordsman by the same director! Great action there too.",
            "review_date": "2023-02-07",
            "source": "rt"
        },
        {
            "content": "easy plot with realistic fighting,no mercy for the bad guys.",
            "review_date": "2023-02-06",
            "source": "rt"
        },
        {
            "content": "If you like action movies, if you like Korean films, if you like The Swordsman, if you like John Wick films, you will enjoy this movie. The great fight choreography, a somewhat familiar yet interesting plot line, and an intriguing and exciting soundtrack topped off with Jang Hyuk's solid acting and stuntman work (not to mention great looks) make this movie a must-see for the \"you fucked with the wrong guy\" film fan. See it when you can. You're welcome.",
            "review_date": "2023-01-24",
            "source": "rt"
        },
        {
            "content": "I love this movie he is like the Korean jhon wick",
            "review_date": "2023-01-03",
            "source": "rt"
        },
        {
            "content": "If you love action movies, I feel this movie is for you. Although the action sequences are really good, the story still feels void. Could have worked a little more on the storyline. But still, to be honest, I absolutely loved the action sequences and I'd happily recommend this movie.",
            "review_date": "2022-12-01",
            "source": "rt"
        },
        {
            "content": "Excellent action plenty of martial arts and gun play very satisfying.",
            "review_date": "2022-09-08",
            "source": "rt"
        },
        {
            "content": "Any movie from Jang Hyuk is the best, unbelievable and mazing movie ever. Jang he is the best actor ever!🤗",
            "review_date": "2022-08-30",
            "source": "rt"
        },
        {
            "content": "Action sequences are really cool, but most of the film is kinda weak, they could go deeper into the corruption related sex trafficking plot.",
            "review_date": "2022-08-22",
            "source": "rt"
        },
        {
            "content": "Spectacular action, a fun world, and surprisingly interesting characters that leave you wanting to know more",
            "review_date": "2022-08-07",
            "source": "rt"
        },
        {
            "content": "The movie is fast paced, action packed in the way of a John Wick film with subtitles.  The lead mercernary is assigned to babysit a neighbor's daughter and spends most of movie protecting her from harm.  Loved it.",
            "review_date": "2022-07-28",
            "source": "rt"
        },
        {
            "content": "Great movie. Action is amazing.",
            "review_date": "2022-07-22",
            "source": "rt"
        },
        {
            "content": "Action pack from beginning to the end, must see. Jang Hyuk is such an amazing actor, cant wait to see him again on the big screen",
            "review_date": "2022-07-22",
            "source": "rt"
        },
        {
            "content": "Korean John Wick with hints of the Man from Nowhere. Not to take anything from the film by comparison however the stunts were too crisp suggesting choreography. Other then that it was great",
            "review_date": "2022-07-22",
            "source": "rt"
        },
        {
            "content": "This was a fantastic movie! This was wonderfully directed, Jang Hyuk knocks it out of the park. If you are a fan of John Wick and Taken then youll love this movie. A+",
            "review_date": "2022-07-21",
            "source": "rt"
        },
        {
            "content": "Too bloody but action is good",
            "review_date": "2022-07-19",
            "source": "rt"
        },
        {
            "content": "Just incredible! Jang Hyuk has a charming cool air about him, perfect casting for this role. Lee Seoyoung is amazing for her acting debut. The whole cast made the story very engaging, I have seen it twice in theaters with friends and I am going for a third time. The story is easy to follow but still has twists in it that made it enjoyable to watch. The stunts and action in this movie are so well executed. I definitely want to see a behind the scenes for this film and hope it gets released.",
            "review_date": "2022-07-19",
            "source": "rt"
        },
        {
            "content": "He is absolutely a great actor. Always manages to bring the character to life in all his work.",
            "review_date": "2022-07-19",
            "source": "rt"
        },
        {
            "content": "Very little realism, so we lost interest.  So very disappointing as we had high expectations.  As others noted, it's kinda like a Korean 'JOHN WICK\" movie with all the preposterous impossible violence, choreographed.  'Hero' 'Killer' walks thru rooms and hallways shooting 'bad guys' who pop up and get shot down with increasing rapidity, like 8 or 9 within a few strides and seconds.  Preposterous.  And so was the usual kung fu style fights.  If KF was real ... we would be seeing it in UFC/MMA matches but we never do.\nKorean language, so it's like reading a book/ subtitles for 2 hours.  I usually have much higher regard for Korean movies.  I notice that one of the actors was named \"BANG\" !  Oddly appropriate.\nGiving it a lousy 2 RT stars, higher than it deserves.\nSaw it opening Thursday, 7-14-2022, in 'lerton, at AMC  with A-List tix.",
            "review_date": "2022-07-18",
            "source": "rt"
        },
        {
            "content": "This is a good action movie. But As good as the other Korean action movie : The Man From Nowhere in 2010. That was the best Korean action movie I ever seen.",
            "review_date": "2022-07-18",
            "source": "rt"
        },
        {
            "content": "Satisfying action. Jang Hyuk doing what he does best!  The bad guys get what they deserve without hesitation or useless conversation.  They could have made the movie longer and used that time to add depth to the characters.",
            "review_date": "2022-07-18",
            "source": "rt"
        },
        {
            "content": "Great action movie.  Interesting characters, non-stop action.  Sub-titles are enough for non-Korean speaker to understand story.",
            "review_date": "2022-07-17",
            "source": "rt"
        },
        {
            "content": "Full action packed movie. Good story line as well-being",
            "review_date": "2022-07-17",
            "source": "rt"
        },
        {
            "content": "This move surprised me this moved at a brisk pace and I usually watch movies from Hong Kong and Korea and the main actor was so stoic but powerful and the main bad guy was a another surprise I need to see this movie again and I can’t wait for the Blu ray I highly recommend this movie get to the theater now👍🏾😁😁",
            "review_date": "2022-07-16",
            "source": "rt"
        },
        {
            "content": "Its predictable and youve seen this before but its one you wont mind. Enjoyable and nice how it all ties together at the end, bit of a shocker.",
            "review_date": "2022-07-16",
            "source": "rt"
        },
        {
            "content": "Classic action style film. John Wick fans will love this.",
            "review_date": "2022-07-16",
            "source": "rt"
        },
        {
            "content": "An action-packed story full of twists and turns! \n\nOne Thing I Liked = The fight scenes and the high body count throughout the movie!\n\nOne Thing I Disliked = I wish there were a little more story structure to support the many action scenes.",
            "review_date": "2022-07-15",
            "source": "rt"
        },
        {
            "content": "fun, high-body count movie with the best husband.",
            "review_date": "2022-07-15",
            "source": "rt"
        },
        {
            "content": "Cinematography great easy to follow engaging story line edge of seat action scenes.",
            "review_date": "2022-07-15",
            "source": "rt"
        },
        {
            "content": "I love Jang Hyuk. I've seen many of this Korean dramas and films and he never disappoints. He can do comedy, drama, romance, and of course action, and he does his own stunts. I heard he also did much of the fight choreography in The Killer and it's amazing. If you like action films this one won't disappoint.",
            "review_date": "2022-07-14",
            "source": "rt"
        },
        {
            "content": "A no-brainer actioneer, extra point for Jang Hyuk who did his own stunts",
            "review_date": "2022-07-14",
            "source": "rt"
        },
        {
            "content": "Fantastic action and fast paced! It should have gotten a wider release!",
            "review_date": "2022-07-14",
            "source": "rt"
        }
    ]
}