{
    "rating": 9.5,
    "release_date": "2022-09-30",
    "num_reviews": 63,
    "genres": [
        "Hindi"
    ],
    "summary": "Vikram Vedha is an action-thriller showcasing the face-off between a tough cop Vikram and a dreaded gangster Vedha. The film underlines 'between Good & Evil, what you choose, defines you'.",
    "reviews": [
        {
            "content": "Awestruck by the plot and hrithik and saif's acting.",
            "review_date": "2022-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Masterpiece A perfect remake and Hrithik was mind blowing 🥵🔥. Both HRI & saif nailed there characters 🔥",
            "review_date": "2022-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fast paced slick thriller.",
            "review_date": "2022-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie. Plot was great and acting",
            "review_date": "2022-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hrithik is a treat to watch! Such great performance.",
            "review_date": "2022-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Storytelling was great.specially  vedha's character was magnificent.Hrithik nailed it...saif was good as a cop.",
            "review_date": "2022-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good script, good acting, good visuals  a treat",
            "review_date": "2022-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Many people are saying its a critic remake, don't listen to those cockheads the movie isn't a remake its the same director and watching it isn't like you won't fall for those bangers inside the content because you've watched before you'd still get goosebumps and it is a complete package drama, action, romance, dance, songs none of them would make you feel bored at any chance\n a flabbergasting acting done hritik and saif.",
            "review_date": "2022-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie is real shitty movie, bad sound, nonsense edit, idiotic plot. The worst movie of 2022.",
            "review_date": "2022-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films of Hrx . Proud to be a Hrx fan .",
            "review_date": "2022-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hrithik was awesome.... great title track and bgm",
            "review_date": "2022-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The screen presence of Hrithik is magnetic and will captivate you. I would go so far as to say that it matches peak Bachchan. The Story and screenplay keeps you absolutely hooked and on the edge of your seat. The Vikram Betaal folk used to structure is screenplay is amazing. It was my favorite Indian film of 2022 (as of October) and in fact my favorite since 2020. Don’t miss this one.",
            "review_date": "2022-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Don't read the reviews, just go and enjoy the show. You'll love it!!",
            "review_date": "2022-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw it five days ago and can't get it out of my mind.  It was a great movie that I saw after a king time.",
            "review_date": "2022-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Vikram - Vedha (2022)\n    If you're looking for what just might be recognized as the very highly tense action thriller of the last few years, then, go no farther, you'll find it all here . . I guarantee it.  This action-packed high octane film, rocks!\nAnd, if you don't agree to its hyper intensity, with special clashing twists and turns, you most certainly will upon the 'AlCOHOLIA' celebration!\n  When going to see this film\nbe sure your mind is sharp and alert, for all the intracacies that you will be exposed to.\n  The idea of 'Circles,' as presented in the movie 'Dark City,' (1998), will be further clarified in this action-packed thriller.  And, flavors of Ben Afflect's 'Accountant,' John Travota, and Nicolas Cage's, 'Face Off,' and, Russell Crow's 'L.A. Confidential,' will also be well noticed, where choices, punishment, corruption, and, just a simple one-on-one, and, varying phylosophies of rationalzation, motives and riddles, intervene.\n  And, let me run this by you, and see if you might not agree, upon an old Japanese saying, 'Life is an Illusion.'\n  This film is very well acted by all who participated in it.  I give it easily five stars.  My only pieve, was, it was awfully loud.  But, this may have been the fault of the projectionist.  I didn't want to miss the first part of this film, as I've complained up-front before about these things, so, I just jammed my ears with kleenex, in hopes that that, would curtail the concussive blows of the fuller force - if you know what I mean.  But, I must say it did enhance the special effects, when the base notes, and, emphasis, came into play.\n  I plan to soon watch, and, willingly pay the extra ticket price to see this in IMAX.  Be prepared for a doozy of an all-out war between rivals who clearly believe their reasons should be validly pursued.  \n                   Would you like to . . . ?\n                                    \n                                   by Doug Obujen",
            "review_date": "2022-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Twist n turn in movie plot. Love it. Kept u on the edge of the seat",
            "review_date": "2022-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yeah,a good by performance by all there are many twist and turns and there is a suspense in end which fills you with curiosity.Must go to watch it.",
            "review_date": "2022-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply masterpiece\nNot comparing the two movies but I must say this 2022 version really holds its ground\nThe cinematography, color grading, camera shots and angles, use of macguffin, direction, and obviously the performances of the cast really elevated the movie to higher level",
            "review_date": "2022-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best movie.good action. Good acting overall best movie 👌",
            "review_date": "2022-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gripping Screenplay and Awesome acting from Hrithik. Add Saif and the addictive BGM and you have a winner all the way.",
            "review_date": "2022-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must See Twice SO GOOD .",
            "review_date": "2022-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining plot and funny mostly.\nSometime phases felt bit draggy due to poor direction",
            "review_date": "2022-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Out n out Hrithik Roshan show. Throw anything at this man, and he sure can find a way to come on top of it. This man can do anything and do it better than anyone else in the business. Everytime he comes on screen the entire hall just goes crazy. Hrithik is one of the very few stars who push the envelope with every movie they do. He has given one of his best performances. Irrespective of how this movie fares at the box office, this sure will go down as one of Hrithik's best works.",
            "review_date": "2022-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best story, direction and music.",
            "review_date": "2022-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Action packed movie. Excellent lead actors. Highly engrossing till the end",
            "review_date": "2022-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome Bollywood movie after a long time. Amazing acting, great story, fabulous background music. A great movie that entertains, without shaming your sensibilities. A must watch!",
            "review_date": "2022-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant movie 🔥 HRITHIK is just wowwww \nMust watch",
            "review_date": "2022-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clashing with PS1 was maybe the biggest mistake the creators of VV could have committed, considering how VV is a remake of a Tamil movie and the audacity of trh creators to release it alongside the biggest historical Tamil project? Coming to the movie, it's your turn of the day massy action masala movie...it lacks the depth which the original one had, it tries to compensate for the lack of depth with over the top action scenes, not sure if the audience really appreciates such a compensation. The supporting cast do their part pretty well, the lead actors look cool flying and jumping around. A pretty average movie through and through.",
            "review_date": "2022-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What to say about the movie the story the performances of starcast it was just Awesome mindblowing the direction stylish  action power packed dialogues Hats off to Mr hrithik Roshan for giving the knockout performance he has lived the character of Vedha Thank you  so much for the effort irrespective of its numbers more than numbers movie wins hearts of audience which is above All I give 4.5 out of 5 its amazing",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Blockbuster movie and better than the original",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Loved it! Amazing performances and storyline. Would recommend to anyone! ❤️",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant piece of work. Amazing movie ",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is really a Booster Dose to BOLLYWOOD and INDIAN CINEMA. Thanks to Deadly Gangster Vedha(Hrithik) and Super Cop(Saif). I appreciate your energy, fitness and struggle towards this Mind Blowing Movie.",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great storyline and a Mass entertainer. Better than the Original in some point",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great watch. Hrithik is awesome",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is f***ing brilliant what a movie best story best action hrithik roshan won our heart man",
            "review_date": "2022-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie was very good but the recliner on the seat didn't work",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The lead actors did an amazing job and the story telling was extraordinary",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome storyline and suspense don't fall for bad reviews by critics.",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb movie. Will watch again with my dost !! !! M4 BOYZ",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The sound was too loud. the  script stretched. The original Vikram Vetal has more interesting stories.. The dance item was too  close to the taste of south than north and misused the skills of Rhittik .  I can go on and on.",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All style and hardly any substance make VIKRAM VEDHA a poor movie. The emphasis in the film was more on Hrithik's style, swagger, and his ability to be totally unfazed by any danger of any sort including death. Once again as is the norm in Hindi movies for the longest while, logic takes a complete back seat in this film. The gunmen are literally spraying him with bullets and not a single one touches him. Not much attention is paid to the story. Once again the songs were totally unnecessary. Everything about the film at best was average.\n5/10",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good action pack movie",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'Vikram Vedha' is an absorbing game of cat-and-mouse that delivers a faithful hero-laden visual spectacle.",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb film,very well written and directed,all the actors have done a great job,saif ali khan impresses as vikram but hrithik roshan as vedha steals the show,hrithik is effortless and proves again that he is a phenomenal actor.",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant script and screenplay. This is a very intriguing story that was well directed to make a highly engaging film. Hrithik Roshan is superb as the intelligent, ruthless and powerful Vedha.\nHe manages to deliver a hugely impactful performance in a controlled manner without any hamming at any point. Saif Ali Khan is effective as the Vikram who is the quieter character and who goes through a transformation.\nAnother thing I loved about the movie was the background score. It is really awesome, especially during action scenes and manages to give the movie an added dimension of fun/ gangsta vibe. \n\nOverall I loved the movie and would recommend it as a definite theater watch.",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best action movie ever!!!!!!",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Few of those movies which are even better then original. Mind is blown by Hrithik's act..!! WoW ⭐️⭐️⭐️⭐️⭐️",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice story, good performances for all actorsmust watch",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie was absolutely amazing!!! I liked everything and disliked nothing.",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Storyline is very good. Cast and acting is excellent.",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Actions were great. Hrithik has acted very well. Great twist in story. Keeps you entertained throughout. Must watch.",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strong on testosterone. Decent plot. Charismatic leads.",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Saw the first half n this movie is awesome. High hope on 2nd half.",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Vikram Vedha is an overall decent movie. I felt there was nothing bad nor good althought I loved seeing Saif and Hrithik. If you are planning to go to the theatres for Vikram Vedha I would recommend it but do not go with high expectations you will regret it.",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "he is a good film 😊😊😊😊😊",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It was an amazing movie!! Way better then I expected! I enjoyed every second of it!!",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good movie please watch it",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid movie lots of fun. The acting was good. The dance sequence in the movie came from out of nowhere, and didnt have anything to do with the plot, but it was still in entertaining Dan sequence. A cartoon at the beginning of the movie sets up the premise which it doesnt quite pay off, The premise of a trickster storyteller. But overall it was very enjoyable",
            "review_date": "2022-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "excellently directed movie\nwonderful acting",
            "review_date": "2022-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not interested in hindi and bollywood movies",
            "review_date": "2022-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing definitely a watch",
            "review_date": "2022-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is Lit🔥🔥🔥. The bearded Gangsta dude is so cool. The BGM and the action sequences were fire yo. The story about everting is not black and white there is always more to the gray is amazing. dark knight themes in the movie. Amazing 👏👏👏",
            "review_date": "2022-09-30",
            "source": "rt",
            "lang": "en"
        }
    ]
}