{
    "title": "Elevator to the Gallows",
    "rating": 7.7,
    "release_date": "1961-06-10",
    "genre": [
        "Drama",
        "Thriller",
        "Crime",
        "Film-Noir"
    ],
    "summary": "(aka Elevator to the Gallows) A re-release of Louis Malle's 1957 masterpiece of suspense and film noir starring Jeanne Moreau, in the role that catapulted her to international stardom. (Rialto Pictures)",
    "critic_reviews": [
        "A consummate entertainment rich with the romantic atmosphere of Paris in the 1950s. Coming at a turning point in French cinematic history, it drew upon several major talents - director Louis Malle, star Jeanne Moreau, cinematographer Henri Decaë, musician Miles Davis - and achieved near-legendary results with all of them.",
        "As French crime thrillers go, this is about as good as it gets.",
        "A suspenseful, elegant entertainment.",
        "It is not free of plot-holes...but what a supremely stylish and watchable picture it is.",
        "The construction has a mocking fatalism that might have felt oppressive, but Malle and his actors keep you constantly on the edge of your seat, wondering what curse will befall the desperate lovebirds next.",
        "The ambition is bracing, but critical hindsight obscures how exciting Malle’s noir thriller is on its own terms.",
        "A plan for a perfect murder goes wildly wrong in this 1958 melodrama by one of France's great filmmakers.",
        "Malle, only 25 when the film was released, bounces confidently among several threads -- classic French policier, juvenile delinquent film, doomy tale of tragic love, clock-ticking thriller.",
        "Superb.",
        "A tightly structured thriller with a brilliantly moody performance by Jeanne Moreau, and depending on your point of view, it's either one of the few genuine French noir films or an early entry in the New Wave.",
        "Moreau's nocturnal wanderings are made unbearably poignant by an exquisite Miles Davis jazz score that became famous in its own right.",
        "It's precisely Malle's omnivorous appetite that makes his first feature, adapted from a policier, so delectable, one stuffed with many sumptuous sights and sounds.",
        "These 1950s French noirs abandon the formality of traditional crime films, the almost ritualistic obedience to formula, and show crazy stuff happening to people who seem to be making up their lives as they go along.",
        "A classic European film noir with an irresistible score by Miles Davis, it builds tension from a series of seemingly minor mistakes that echo the political/military context of the postwar era.",
        "It’s no masterpiece, but it’s slick and tense, and the camerawork has something of the in-the-moment, on-the-ground immediacy of the French New Wave films.",
        "The film's look makes a divine accessory for its music, which Miles Davis composed. There's not even 20 minutes of it in the film, yet it still defines the atmosphere, transforming a crime yarn into a bebop noir."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "I am not hear to rate Elevator to the Gallows but one of my favorite films by Louis Malle because unfortunately it is not in metacritic. Au Revoir Les Enfants is a tale of two boys and their friendship that develops through struggle and I am not hear to rate Elevator to the Gallows but one of my favorite films by Louis Malle because unfortunately it is not in metacritic. Au Revoir Les Enfants is a tale of two boys and their friendship that develops through struggle and understanding. The story is a beautiful and sad meaning that pops out of Louis Malle's somewhat autobiographical film. Because this is German occupied France their is pain and tragedy sweeping across the nation and all that pain is really connected with these two little boys secret and I will guess that you will just have to find out what that secret is. But this movie has made me think since it's story is so meaningful and proud. But yet you still will think that their is no end to this horrible fate that is to come. Becaue you will be saying at the end of the the film Au Revoir Les Enfants( Goodbye, Children ).",
            "review_date": "2006-04-20",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Fantastic film that anticipates the French New Wave.The cinematogrophy is incredible,and the jazz score by Miles Davis is one of the best ever ,in my opinion.Highly recommended.",
            "review_date": "2011-03-07",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Elevator to the Gallows is so well made it’s hard to believe this is a feature debut of a 24 year old filmmaker. The jazz score by Miles Davis adds something. I expected a straight cat-and-mouse/run-for-your-life thriller, but instead got aElevator to the Gallows is so well made it’s hard to believe this is a feature debut of a 24 year old filmmaker. The jazz score by Miles Davis adds something. I expected a straight cat-and-mouse/run-for-your-life thriller, but instead got a crime story told with three intertwining parts. For sure, the parts tie together and wrap up brilliantly, in a way that only noirs do.",
            "review_date": "2023-01-04",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 19
}