{
    "title": "Yojimbo",
    "rating": 7.8,
    "release_date": "1961-09-13",
    "genre": [
        "Action",
        "Drama",
        "Thriller"
    ],
    "summary": "A crafty ronin comes to a town divided by two criminal gangs and decides to play them against each other to free the town.",
    "critic_reviews": [
        "[Kurosawa] was deliberately combining the samurai story with the Western, so that the wind-swept main street could be in any frontier town, the samurai (Toshiro Mifune) could be a gunslinger, and the local characters could have been lifted from John Ford's gallery of supporting actors.",
        "Less visceral than the battle scene in Seven Samurai, this is more of a free-for-all, with brute force leaving no room for skill.",
        "Yojimbo does not cause viewers to ponder deep issues in the way Rashomon does, nor does it possess the epic grandness of The Seven Samurai, yet it must still be considered in the top tier of Kurosawa's films. Stylish, compelling, and involving, it became as much a blueprint for future productions as it is an homage to past ones.",
        "Something of a textbook example of the perfect crowd-pleaser, Kurosawa’s tale is sociopolitical wish fulfillment via archetypal samurai drama, albeit with a twist or three.",
        "The filmmaking is marvelously austere, yet in its sudden bursts of action electrifying, in its stern morality sobering, in the blackness of its comedy often quite delicious.",
        "Though this lacks the epic stature of Seven Samurai, Kurosawa here again shows his mastery of the medium.",
        "You won't find a more bone-jarring set of fight scenes than the ones on display here, while Mifune's blood-letting drifter offers a masterclass in justice-dispensing cool.",
        "With Mifune's tongue-in-cheek performance and the wildly stylized battle scenes featuring mallet and pistol-wielding samurai, YOJIMBO may just be the first post-modern samurai film.",
        "Far from being just another vehicle for Mifune, this belongs in that select group of films noirs which are also comedies.",
        "As in most Westerns, the dramatic penetration is not deep, and the plot complications are many and hard to follow in Japanese. Kurosawa is here showing more virtuosity than strength. Yojimbo is a long way (in the wrong direction) from his brilliant Rashomon."
    ],
    "reviews": [
        {
            "review_title": null,
            "content": "Sauron's forces have laid siege to Minas Tirith, the capital of Gondor, in their efforts to eliminate the race of men. The once-great kingdom, watched over by a fading steward, has never been in more desperate need of its king. But canSauron's forces have laid siege to Minas Tirith, the capital of Gondor, in their efforts to eliminate the race of men. The once-great kingdom, watched over by a fading steward, has never been in more desperate need of its king. But can Aragorn (Viggo Mortensen) answer the call of his heritage and become what he was born to be? In no small",
            "review_date": "2022-09-19",
            "source": "metacritic",
            "lang": "en"
        },
        {
            "review_title": null,
            "content": "Amazing performance by Toshiro Mifune. Yojimbo is iconic and Eastwood-esque.",
            "review_date": "2021-08-22",
            "source": "metacritic",
            "lang": "en"
        }
    ],
    "num_reviews": 13
}