{
    "rating": 9.1,
    "release_date": "1964-01-18",
    "num_reviews": 290,
    "genres": [
        "Western"
    ],
    "summary": "The Man With No Name (Clint Eastwood) enters the Mexican village of San Miguel in the midst of a power struggle among the three Rojo brothers (Antonio Prieto, Benny Reeves, Sieghardt Rupp) and sheriff John Baxter (Wolfgang Lukschy). When a regiment of Mexican soldiers bearing gold intended to pay for new weapons is waylaid by the Rojo brothers, the stranger inserts himself into the middle of the long-simmering battle, selling false information to both sides for his own benefit.",
    "reviews": [
        {
            "content": "I was bored when I watched this the first time in a few parts, but then I gave it a rewatch and liked it a lot better. Clint Eastwood and his presence on the screen coupled with Ennio Morricone's brilliantly beautiful music is classic cinematic perfection. I feel like this had to be one of the most violent movies at the time it came out since Clint Eastwood got beat up and tortured so much in one scene, which takes guts to show in a Hollywood/American culture at a time when movies were supposed to be more pleasant and less risk-taking. This is one of the first westerns I've ever watched and it only got better from here!",
            "review_date": "2023-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yee haw!  Yojimbo, Japanese film, remixed into an American western.  I'd pay a fistful of dollars to watch it in theaters ... maybe ;)",
            "review_date": "2023-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Fistful of  Dollars is a true classic, that shaped the spaghetti western sub-genre in infinite ways. Beyond just being influential (though it was clearly influenced by another movie), it's just an entertaining action film.",
            "review_date": "2023-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An All Time Classic. The only real problem is the pacing which is good still but it takes its time with scenes and doesn't really have the epic scale of Leone's later works to justify it sometimes. This could've probably had 5-10 minutes cut off certain scenes. Besides that this is masterfully edited, acted, shot with an incredible music score. This film is full of mood and style. Ramon is an excellent menacing, ruthless and memorable villain. The story very much is very witty and is similar to that of The Sting. Anyone should give this a watch once.",
            "review_date": "2023-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the few perfect westerns",
            "review_date": "2023-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cleverly written and incredibly directed, A Fistful of Dollars features an amazing score and a breakout turn from Clint Eastwood that marked a defining turn for Western movies.",
            "review_date": "2022-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best of Movies/TV Series Collection",
            "review_date": "2022-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Fistful of Dollars cleverly introduces us the complicated hierarchy and relations in a small western town, with its crafty but simple protagonist. This movie will always remain one of the most iconic westerns of all time.",
            "review_date": "2022-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a tough one. Some aspects of this movie are incredible but others are really weak. It averages out to an overall passable but forgettable experience.\n\nBy far the best part of this movie is the music. It's worth watching for the soundtrack alone. The costume and set designs are also really solid. Clint Eastwood's performance is charming and charismatic, making him hard not to root for.\n\nHowever, the audio dubbing is TERRIBLE. Not just the dialogue, but all of the sound effects sound awkward and unrealistic. It's mostly this reason that the film has no sense of immersion. The voice acting is generally stiff as well. On top of that, the stunt acting is mostly mediocre but sometimes laughably bad. Finally, the fact that virtually the entire cast is Italian people in brownface doing awful Mexican accents made this film difficult to watch for me.\n\nAlso, the entire story relies on Clint Eastwood being basically infallible while everyone around him is a complete imbecile. There's no sense of tension; every scene ends with the protagonist either executing a ridiculous plan or just shooting everyone because he's apparently that good of a shot. None of the character motives are ever very clear.\n\nIt's culturally relevant and the music is bomb, but other than that it's objectively just not that good of a movie.",
            "review_date": "2022-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked the music featured - the famous score by Ennio Morricone, which certainly does add atmosphere and tension to the relevant scenes, as well as highlighting the isolated, somewhat desolate surroundings. Easwtood does, of course, play the very sly and laidback man with no name, although his character is referred to briefly as 'Joe'. Some scenes are rather slow paced and thus may put off some but the confrontation/fight scenes are, obviously, the opposite - there's a real frenetic energy which energised me while watching.\n\nI liked that it has a more budget feel to it - that its clearly not a Hollywood film, featuring characters of different ethnicities/nationalities, the visually grainier feel to the shots and so on. Also the very bright red blood used didn't seem esp. realistic but I suppose there is a certain charm to that somehow.\n\nI can understand the appeal of this film, its one of those whereby characters can say more in their moments of silence, via their facial expressions than by dialogue, so suffice to say I'd certainly recommend this film to fans of Westerns, more specifically Spaghetti Westerns (if you haven't seen it already).",
            "review_date": "2022-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a classical western tale",
            "review_date": "2022-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hadn't see this one for decades.  Still holds up with Clint as the anti-hero who does good.  His good looks & swagger didn't hurt, either.",
            "review_date": "2022-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's easy enough to buy into the praise heaped all over A Fistful of Dollars, but if you look at it objectively you might find that it's a decent movie, but maybe not the cinematic masterpiece that so many viewers claim.  The good?  It's the debut of Clint Eastwood's ‘Man With No Name' character, a steely-eyed killer with a clear moral compass.  The cinematography is generally excellent, giving a true feel for what it must have felt like in the Old West. As well, Ennio Morricone's score is catchy and effective.  The bad?  The dubbing is absolutely horrendous, and it's not helped at all by the wooden acting and corny dialogue.  The ugly?  The plot is often impossible to follow, implausible and ludicrous throughout.  Give it a watch but don't feel pressured by the hype into saying it's the greatest Western ever.  It's not.",
            "review_date": "2022-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie. It's a little on the shorter side, which plays to its benefit as an awesome badass Clint Eastwood cowboy adventure playing two families against each other for his own benefit. The only problems with the film is the lip syncing being poor due to it being filmed in Italy, I felt that the head family members of the Baxters, one of the families, are barely fleshed out (Idek their names), and besides Clint, and maybe Ramon and Silvanito, the rest of the supporting cast is very weak. Perfect soundtrack.",
            "review_date": "2022-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Like I say, anything Eastwood. And for you haters, go suck a duck.",
            "review_date": "2022-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is criminally underrated. Yes, the inspiration from Kurosawa's own film is pretty easy to see, but it has Leone's own touch and stands on its own as a fantastic film. While it isn't quite as good as The Good, The Bad, and the Ugly and said Kurosawa film, it's still an example of masterful direction with a phenomenal script.",
            "review_date": "2022-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Fistful of Dollars is not quite as good as The Good, The Bad and The Ugly from the Three Dollars trilogy(or Once Upon a Time in America and Once Upon a Time in the West), and I also think the film that inspired it Kurosawa's Yojimbo is the superior film. That said, that is not down-grading A Fistful of Dollars in any way, it is still a truly great film. As with all Leone's it is incredibly well made, the scenery is epic and looks gorgeous and the extreme close ups really helps to enhance the unrelenting violence. Ennio Morricone's score is wonderful with its minimalist style really fitting with the movie. The story is both elegiac which helps to give that feel of mystery to the Man with No Name's character and thrilling with the violence and the camera work. Leone's direction is as ever superb, as is the acting. Clint Eastwood became an international superstar and you can see why, he oozes charisma and his idea to make The Man with No Name mysterious with minimal dialogue proved to be a great one. Of the supporting cast, Gian Maria Volonte is especially impressive, as Ramon he snarls very convincingly. All in all, a great film. 9/10 Bethany Cox",
            "review_date": "2022-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For an old film I enjoyed and wasn't a bad Western...Clint Eastwood a great hero in this",
            "review_date": "2022-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Western that launched the careers of Clint Eastwood and Sergio Leone.  Eastwood is superb as the lead, playing him as a man of few words but epic action (something that would become a trademark of many future Eastwood performances).  He gets great support from the rest of the cast, particularly Gian Maria Volonte as the villainous Ramon.  Behind the camera, Sergio Leone crafted a western that reset the genre, complete with anti-heroes and shady values (Eastwood's Joe is not exactly a pure hero).  It is matched by a nicely twisty plot along with some epic shootouts.  All in all, a classic western through and through, and Eastwood & Leone were just getting started.",
            "review_date": "2022-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The worst Spaghetti Western ever!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2022-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This simple, straight forward narrative offers no frills and would actually feel borderline parody if released today, largely because of just how often elements and tropes from this film can still be found in movies currently being released. (Which only seems fair since Leone apparently \"borrowed\" quite a bit from Kurosawa's Yojimbo)\n\nIt is hard to judge Eastwood in this role as he has become the universal mold used when assessing future Western protagonists. Would there be any point today to assess Michael Jordan's performance with the Bulls in the 1990s, since it is now basically unanimously agreed he is the best to ever play the game?\n\nWhile Eastwood would likely be the MVP for most here, I'm giving it to Ennio Morricone whose score was instantly recognizable and somehow created a nostalgic feeling in me while watching a movie I had never seen.",
            "review_date": "2022-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first film of the dollars tilogy.\nLike wine, the older it became, the better it gets.\nMust-watch italian western film with Clint Eastwood.\nWhat a soundtrack from Ennio Morricone, there's a reason if Tarantino loves Sergio Leone's movies and Ennio's music",
            "review_date": "2022-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One town, two gangs, and Clint Eastwood, \"the man with no name,\" in the middle.  Who do you think wins?",
            "review_date": "2022-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Leone's first film of the Dollars trilogy set the standard for the successors, but stands out as an iconic film that helped shape westerns of any age that followed.",
            "review_date": "2022-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A supremely entertaining western from 1964!\n\nI will say the dubbing nature of 'A Fistful of Dollars' is a little distracting early on, but by the time the opening portion concluded I was incredibly interested in what was happening onscreen. The pacing is excellent, thanks to some very fine cinematography, great action sequences and a top notch score.\n\nClint Westwood debuts as a leading movie star and is terrific throughout, portraying the wonderfully named J̶o̶e̶ \"the Man with No Name\". It's little surprise these are the films that truly made him. Away from Eastwood, I really enjoyed the trio that played the Rojo brothers - Gian Maria Volonté (aka Johnny Wels), Sieghardt Rupp and Antonio Prieto. They're just as important as the main man and play the roles superbly.\n\nBring on the sequels!",
            "review_date": "2022-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Having only fairly vague memories of Yojimbo, its still pretty clear how much of a copy of that film this is. I wouldn't hold that against it too harshly however. It's pretty entertaining but nothing in this for me to see it as truly great.",
            "review_date": "2021-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While not the best cowboy movie this film still boasts An impressive score by Ennio Morricone and A strong protagonist Clint Eastwood once again establishes himself as one of the biggest BadAsses in cinema history the final showdown is epic yet another great entry in the dollars trilogy",
            "review_date": "2021-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can't get much more classic than this movie. Clint Eastwood is at his best!",
            "review_date": "2021-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hard to get excited about a hero that has no truth in him and no loyalties; only a love of coin",
            "review_date": "2021-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone's groundbreaking spaghetti western, this is the first of the 'man with no name' trilogy. Giving Clint Eastwood's character no real background or reason makes the film all the more exciting, and the loosely connected trilogy culminates in The Good The Bad and The Ugly (1966) one of the finest films ever to grace a screen. But this is where the idea was born.",
            "review_date": "2021-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another sphagetti western that made Clint Eastwood a star!!!!!",
            "review_date": "2021-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Aside from the bad dubbing and one overlong sequence of people being gunned down, this film is nearly perfect and basically the greatest Western of all time.",
            "review_date": "2021-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm new to Leone. Recently watched Once Upon a Time in the West and was absolutely spellbound. That got me stoked to catch up on what I always hear celebrated as a classic, but good lord, Fistful of Dollars is tough to watch. It has its moments of humor and Clint Eastwood cool, but it has a paper-thin story and just way too much absurdity for me to overcome suspension of disbelief. There's very little tension or suspense, just ridiculous and repetitive montages of bloodless shootings with guys grabbing their backs and falling over. For the most part it's nicely shot, but the day-for-night  scenes and poor dubbing just makes it all seem farcical. It's weirdly paced and drags in a way that the significantly longer Once Upon A Time... does not.  In the latter, character and plot are slowly revealed in a way that keeps one invested. Here we have a nameless dude with a barely-hinted-at traumatic back story carrying the narrative weight, and I just didn't care. The Morricone score is iconic and might account for the indelible imprint this film has made on the culture, but it just feels like this is a case where the reputation far exceeds the reality. I kept looking for a way to watch it at 1.5x speed but I guess that's not an option on Amazon. I toughed it out till the end, hoping for redemption, but it just got stupider and stupider. Was this intended as a satire? It's so over the top and illogical that's the only reading that makes sense, but I think people do really take this seriously. I like silly genre films, but this one just feels tired and dated, no fun at all.",
            "review_date": "2021-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A total masterpiece, which does not suffer the weight of the years that have passed since its release. Even today it is possible to appreciate the innovations that the director has brought to the genre, bringing it freshness, offering entertainment to the viewer, despite being a \"grown-up\" genre.",
            "review_date": "2021-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing western movie, love Clint Eastwood movies",
            "review_date": "2021-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fistful of dollars is just so classic.",
            "review_date": "2021-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Fistful of Dollars offers some exciting and violent western action and a great, classically masculine performance. The soundtrack is tremendous",
            "review_date": "2021-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Without comparing it to its sequels, A Fistful of Dollars is not exactly the most interesting movie about Clint Eastwood's Man With No Name character. While the beginning and end are very well done, the second act of the movie seems to really drag on.",
            "review_date": "2021-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great to finally watch this classic and iconic film ",
            "review_date": "2021-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This classic spaghetti western was very good. Clint Eastwood, Marianne Koch, Joe Egger, Gian Maria Volonte, and the rest of the cast did a spectacular job in this classic movie. The plot to the movie was thrilling, dramatic, and action-packed. It's about fighting for justice and getting it by any means necessary. If you haven't seen this classic western movie yet, check it out sometime. It's a definite must see.",
            "review_date": "2021-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"A fistful of dollars\" is a very ironic name for this movie, as it was literally made for a very low amount of money, which is 200,000$. For such money and the release date, the movie is amazing. All the cliché we see in nowadays westerns are obviously ripped off from this movie. It is not as good as \"The good, The bad and The ugly\" or \"For a Few Dollars More\", but it sets the tone for the entire genre. The best part about this movie is Clint Eastwood and his coolness, nothing else. Pure 1 hour 40 minutes of him being awesome and pure testosterone! If you want to watch some classic with the feel of a muscular cowboy being oddly cool, then this movie is for you, but make sure you watch other parts of the trilogy too, if you don't like this one! They are also amazing! \n9/10, awesome character, awesome setting, respect for the job made for low budget and the announce date can't give me the opportunity to give this movie any less.",
            "review_date": "2020-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Taking inspiration from a Japanese master, and introducing the world to American star Clint Eastwood; Fistful of Dollars, as the first popular \"Spaghetti Western\", is a Western with personality a-plenty.",
            "review_date": "2020-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the quality and iconic italian western",
            "review_date": "2020-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic...The origin of many genres, albeit picturing white as good and Mexican brown as the bad",
            "review_date": "2020-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A pretty good start to the man with no name trilogy",
            "review_date": "2020-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just an iconic movie. Sergio Leone, Clint Eastwood, Ennio Morricone with a soundtrack that defined what a western theme should be. I don't need to say anything more.",
            "review_date": "2020-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolute Classic One of the Best 😎✌🏻",
            "review_date": "2020-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic western that is often copied  but never beat.",
            "review_date": "2020-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good 60's Western, the start of the Man with no Name and the \"Dollars Trilogy\". Clint is great in this, Gian Maria Volonté (Though listed under a more American sounding name) plays a good villian here, though not quiet as good as he played El Indio in For a Few Dollars More. The weakest in the trilogy but still a great watch.",
            "review_date": "2020-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perfect western with great soundtrack",
            "review_date": "2020-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed this one a lot, the movie's got a good plot and Clint Eastwood gives a really good performance throughout as usual. \n\nAlso, I really liked the fight scenes which he had throughout this movie, they were very clever and amazingly done. I especially enjoyed the end gun fight scene, I love that scene so much. \n\nOverall, it's a great western with a good plot and a great amount of action throughout, worth the watch.",
            "review_date": "2020-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone directing, Clint Eastwood as lead, Gian Maria Volonté as Ramón, and  Ennio Morricone's soundtrack are all captivating. More engrossing than other westerns, you feel closer to the lead, brought in on his wit and cunning, and to the events, the whistling wind and Ramón's menace.",
            "review_date": "2020-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An unnamed stranger (Clint Eastwood) arrives at the little town of San Miguel, on the Mexico–United States border. Silvanito, the town's innkeeper, tells the Stranger about a feud between two smuggler families vying to gain control of the town: the Rojo brothers, Don Miguel, Esteban and Ramón (Gian Maria Volonté) and that of the town sheriff, John Baxter (Wolfgang Lukschy), his matriarchal wife Consuelo and their son Antonio. The Stranger decides to play each family against the other in order to make money, and proves his speed and accuracy with his gun to both sides by shooting with ease the four men who insulted him as he entered town. The Stranger seizes his opportunity when he sees the Rojos massacre a detachment of Mexican soldiers who were escorting a chest of gold that they had planned to exchange for a shipment of new rifles. He takes two of the dead bodies to a nearby cemetery and sells information to both sides, saying that two Mexican soldiers survived the attack. Both sides race to the cemetery; the Baxters to get the \"survivors\" to testify against the Rojos, and the Rojos to silence them. The factions engage in a gunfight, with Ramón managing to \"kill\" the \"survivors\" and Esteban capturing Antonio Baxter. While the Rojos and the Baxters are fighting, the Stranger searches the Rojo hacienda for the gold. While he is searching he accidentally knocks out a woman, Marisol. He takes her to the Baxters, who, in turn, arrange to return her to the Rojos in exchange for Antonio. During the exchange, Marisol's son, Jesús, runs towards her, followed by her husband, Julio. While the family embraces, Ramón orders one of his men, Rubio, to kill her husband as he has already told him to leave town. Silvanito attempts to protect the family with a shotgun with the Stranger backing him up. Neither Ramón nor any of his men attempt to challenge the Stranger, knowing that he is too fast on the draw...\n\nPromoting \"A Fistful of Dollars\" was difficult, because no major distributor wanted to take a chance on a faux-Western and an unknown director. The film ended up being released in Italy on 12 September 1964, which was typically the worst month for sales. The film was shunned by the Italian critics, who gave it extremely negative reviews. Some American critics felt differently from their Italian counterparts, with Variety praising it as having \"a James Bondian vigor and tongue-in-cheek approach that was sure to capture both sophisticates and average cinema patrons\". Despite the negative reviews from Italian critics, at a grassroots level, its popularity spread and over the film's theatrical release, it grossed $4 million in Italy, about three billion lire, more than any other Italian film up to that point. The release of the film was delayed in the United States, because distributors feared being sued by Kurosawa. As a result, it was not shown in American cinemas until January 1967. Upon the film's American release in 1967, both Philip French and Bosley Crowther were unimpressed with the film itself. Critic Philip French of The Observer stated: \"The calculated sadism of the film would be offensive were it not for the neutralising laughter aroused by the ludicrousness of the whole exercise. If one didn't know the actual provenance of the film, one would guess that it was a private movie made by a group of rich European Western fans at a dude ranch... A Fistful of Dollars looks awful, has a flat dead soundtrack, and is totally devoid of human feeling.\" Bosley Crowther of The New York Times treated the film not as pastiche, but as camp-parody, stating that nearly every Western cliche could be found in this \"egregiously synthetic but engrossingly morbid, violent film\". He went on to patronize Eastwood's performance, stating: \"He is simply another fabrication of a personality, half cowboy and half gangster, going through the ritualistic postures and exercises of each... He is a morbid, amusing, campy fraud\".\n\nThis classic Sergio Leone 1964 Spaghetti Western has all the trademarks from the director that started a whole new look and feel of the western genre. The film, an international co-production between Italy, West Germany, and Spain, was filmed on a low budget (reported to be $200,000), and Eastwood was paid $15,000 for his role. Released in Italy in 1964 and then in the United States in 1967, it initiated the popularity of the Spaghetti Western genre. It was followed by For a \"Few Dollars More\" and \"The Good, the Bad and the Ugly\", also starring Eastwood. Collectively, the films are known as the \"Dollars Trilogy\", or the \"Man with No Name Trilogy\". All three films were later released in sequence in the United States in 1967, catapulting Eastwood into stardom. The film has been identified as an unofficial remake of the Akira Kurosawa film Yojimbo (1961), which resulted in a successful lawsuit by Toho, Yojimbo's production company. \"A Fistful of Dollars\" was at first intended by Leone to reinvent the western genre in Italy. In his opinion, the American westerns of the mid- to late-1950s had become stagnant, overly preachy and not believable. Despite the fact that even Hollywood began to gear down production of such films, Leone knew that there was still a significant market in Europe for westerns. He observed that Italian audiences laughed at the stock conventions of both American westerns and the pastiche work of Italian directors working behind pseudonyms. His approach was to take the grammar of Italian film and to transpose it into a western setting. Clint Eastwood was instrumental in creating the Man with No Name's distinctive visual style as well. And Clint Eastwood truly personify the character with hardly any dialogue (which was Eastwood´s idea to cut down the dialogue) and I love the closeup structure in the film and the rotoscope title design. And adding to that we get beautiful visuals, great action and stand offs and proper western atmosphere. And Ennio Morricone´s soundtrack really sets the bar for how a western should sound like. \n\nTrivia: Clint Eastwood's trademark squint was caused by the combination of the sun and high-wattage arc lamps on the set. This has been described as the first \"spaghetti western\", but when this movie was made, there had already been about twenty-five such westerns produced in Italy. This was, however, the first to receive a major international release.",
            "review_date": "2020-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There is a before and after Clint Eastwood and Sergio Leone redefined westerns. This is a \"must see\" film which originated a new way of western movies, which Clint Eastwood continued back in the US with Outlaw Josey Wales and Pale Rider.",
            "review_date": "2020-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the best western stories of all time. If you're a fan of Eastwood movies then this is a must see. A true classic.",
            "review_date": "2020-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this movie was was my first western. I can say this if you like fire guns lots of corps this is a movie for you. I have only watched one but I know get the idea of these types of movies. I enjoyed it a lot",
            "review_date": "2020-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone is simply magnificent making film, beautiful cinematography",
            "review_date": "2020-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Most of what makes A Fistful of Dollars great is owed to Kurosawa, but it deserves credit for recognizing the themes present in the original work, their effective adaptation into a western setting, and the establishment of Eastwood's iconic Western persona. (4/5)",
            "review_date": "2020-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I expected more from this movie classic after reading other reviews, but the acting and dialogue was just too contrived to be taken seriously. It was entertaining but not very authentic even though the film was an innovative departure from the classic western where the good guy was more virtuous than Clint Eastwood's character, Joe.",
            "review_date": "2020-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it's a very influential and pretty well-crafted film, it is derivative of a superior one (Yojimbo), and Toshiro Mifune is much more interesting character as the Samurai than Clint Eastwood is as the Man With No Name.",
            "review_date": "2020-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone directed this reworking of a classic of Japanese cinema, producing a really stunning movie. It seems almost unfair to call this a Spaghetti Western as that moniker has so many negative connotations but this is such a great example of the genre that it transcends the label. Clint Eastwood, in his first starring role, made his name with this and the two sequels and he really is fantastic as the enigmatic gunslinger who sets two rival outlaw families against each other for his own financial gains. He is electrifying in the role and set the standard for this kind of role. Leone's visual style and the stunning Ennio Morricone score produce a truly memorable cinematic experience which is a feast for all the senses.",
            "review_date": "2020-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Fistful of Dollars defines the Spaghetti Western genre. I love the performance of Clint Eastwood, the setting of the town, the story, and the gun fights. Despite the movie has connections with Yojimbo, A Fistful of Dollars replaced samurai and swords with cowboys and guns. Without this movie, Western movies would never achieve success in the near future. Overall, The Man With No Name survived this review by a long shot.",
            "review_date": "2020-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Fistful Of Dollars is not as good as later installments to the Dollars Trilogy but it still is a very good western.  It is full of iconic moments and Clint Eastwood is absolutely awesome as the man with no name.  A Fistful Of Dollars is a solid western that is worth a watch if you have not seen it.",
            "review_date": "2020-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic Clint Eastwood western.",
            "review_date": "2020-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fabulous. One of those films I can watch over and over again. The Man With No Name makes his first on film appearance and it is perfection.",
            "review_date": "2019-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know if as Italian I have to like \"Spaghetti Western\", but just for the soundtrack and for the direction, the movie deserve to be watched.",
            "review_date": "2019-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "4th best western ever",
            "review_date": "2019-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The world's introduction to Clint Eastwood and Sergio Leone!\n\nDirector Sergio Leone splashes into the dirty desert world of Westerns with A Fistful of Dollars (1964). \n\nLeone clearly had a lower budget as the whole film takes place on one big town set alongside the surrounding mountains. The props look cheaper and the music repeats the theme a lot. The main theme is cool with a distinctive whistle whenever Clint Eastwood enters a scene. These are not complaints because you get to focus in on the action and dialogue instead of the background.  Leone makes the most of his little set by defining the Western film genre forevermore!\n\nUnfortunately, the dubbing is bad for certain characters. There is an ungodly annoying boy whose dubber is too old and too obnoxious to have gotten the part, but I ignore him. Hearing Eastwood's natural voice is nice at least. The dubbing is the only real issue I have with A Fistful of Dollars and the delivery is still wonderful for a majority of the cast.\n\nLeone's direction is killer from the get go as he introduces Eastwood with a legendary close-up of his face as Clint tilts his hat up to reveal his deadshot eyes. Leone captures a sense of dread in town with numerous warnings of death in this tale of gaining wealth, stealing money, saving families, rescuing women, and liberating a town. It's all classic hero tropes directed with Leone's lush style of gritty realism and sweat beaten brows.\n\nNotably, A Fistful of Dollars was the first time most people saw Clint Eastwood act. He enters the Western genre young, handsome, and earnest. His acting is already iconic and mature here. Eastwood uses his intense piercing eyes to glare at his enemies, observe deadly situations, and build tension during a gun duel. He speaks with his unique gravel like voice out of the corner of his mouth for a cool and masculine effect. Eastwood makes you believe his nameless hero is an untouchable gunfighter from the first draw. Clint Eastwood is thoughtful, masculine, heroic, kindly, and cool as he defines the quiet Western hero from this point on within A Fistful of Dollars.\n\nI must mention how cool his outfit is in A Fistful of Dollars. Clint Eastwood dons a cowboy hat, blue collared shirt, black jeans, wool jacket, and a killer poncho for the total Western hero fashion guide. All this complete with cowboy boots and spurs alongside Eastwood's gun holster and pistol. He looks cooler than literally any other Western hero as far as I'm concerned.\n\nMarianne Koch is pretty as Marisol, a captive woman stolen from her husband and son. She doesn't do much, but when she looks at the screen or Eastwood, she entrances you immediately. You feel so sorry for her character just by a few looks of her sad eyes. Similarly, you feel awful for the matriarch of the Baxter family Consuelo Baxter, played by the mysterious and lovely Margarita Lozano.\n\nFurthermore, Jose Calvo is awesome as the middle aged bar owner that befriends Clint. He is informative, funny, sweet, and cool as he helps Eastwood defend his home. Any time he is on screen, you are drawn to his warm character Silvanito. Likewise, I love the elderly undertaker Piripero, played by the giddy and delightful Joseph Egger, that also befriends Clint's nameless wanderer. They are the two best characters besides Clint's protagonist.\n\nGian Maria Volonte is outstanding as the cruel and devious Ramon Rojo. His villainous charisma is iconic as he kidnaps Marisol, murders dozens of men, and mercilessly beats on Clint Eastwood. You revel in the moment Clint bests him in their final quick draw duel. Leone directs their last encounter so perfectly. Volonte's shocked face seeing Clint alive, Clint appearing out of the smoke, Clint's metal plate trick, Clint's rapid fire pistol draw, and the pistol versus rifle debate. Leone was a master of directing and the last 15 minutes of A Fistful of Dollars is as genius as any sequence in any Western.",
            "review_date": "2019-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Eastwood spaghetti western.",
            "review_date": "2019-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not bad.  Plenty of violence and delightful villains.  ",
            "review_date": "2019-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "all the 3 movies u have to see must !",
            "review_date": "2019-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clint Eastwood plays the part of Joe so well",
            "review_date": "2019-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great score and directing",
            "review_date": "2019-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great start to the \"Dollars Trilogy\" and homage(though uncredited at the time) to my favorite Kurosawa's film \"Yojimbo\". No one could play \" The Man With No Name\" but Eastwood who channeled Toshiro Mifune's Sanjuro.",
            "review_date": "2019-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The final duel is simply one of the tensest final scenes I've ever seen! But aside from it, the shootouts and gun fights are surprisingly boring, monotonous, and unvaried. One the other hand, the action and fight scenes that don't feature guns are so much fun, especially since Leone's style of camerawork and direction here are their best. I'm not exaggerating or anything; but A Fistful of Dollars really has some of the most inventive, and some of the coolest, camerawork and editing scenes I've seen in a Western film.\n\nI haven't seen Kurosawa's Yojimbo yet; but I really liked the story of this film. It's a story full of surprises, and twist and turns that kept me quite engaged and engrossed most of the time. While the movie has its slow parts, and the plot doesn't evolve very smoothly; it gets messy and muddled halfway through, A Fistful of Dollars's story never loses its track. The movie also feels somewhat heavy-handed at times, largely because the dialogue gets clumsy and overly expository at moments.\n\nI could have never imagined any actor who can be perfectly fit for this role as Clint Eastwood. He is as charismatic, bad-ass and tough as ever as the central character, Joe, and this was quite important, since this movie has this kind of story that focuses primarily on one protagonist (this is my favorite kind, btw).\n\nOverall, Per un pugno di dollari is yet another great Leone Western that makes me excited to keep exploring his small but very solid filmography.\n\n(8/10)",
            "review_date": "2019-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent music, cinematography, direction. Dubbing misses sometimes. But, can't get cooler than the man with no name.",
            "review_date": "2019-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Blobbo never like this one. Thin plot, bad dubbing.",
            "review_date": "2019-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that revolutionized the western genre, which still can be seen today. The technicolor is beautiful, the musical score is memorable and most of all, younger Clint Eastwood is unforgettable, he's just great. This is the role that projected him in the mainstream spotlight. It's a stylish movie, focusing on longer shots/scenes, and also has a small touch of the revisionist genre that would come a little later. Overall this is a main classic of the western genre, as well as a Clint Eastwood classic. And it's an entertaining must-see for any movie goers. Recommended!!",
            "review_date": "2019-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Undeniably a classic, featuring memorable characters, Clint Eastwood at his gritty best, and memorable shootouts.",
            "review_date": "2019-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fistful of dollars. This films only big down point is the dubbing, but there are still a few other things but there mainly small nit picks. The acting is great from the squinting all the way to the emotion. The style is also amazing from the look to how the characters are. The characters are well written and well acted and are also really good protagonists and antagonists. The action is amazing from the guns to the angles. The music is also so amazing conducted by Ennio Morricone. Over all I give it a 8/10",
            "review_date": "2019-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the slowest, most boring movies I've ever seen. Lame. Unbelievably boring. Waste of time.",
            "review_date": "2018-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film that birthed the \"spaghetti western\" genre  A Fistful of Dollars is often overlooked in favor of the more popular For a few dollars more and The Good, the bad and the Ugly. I feel that this is wrong as A Fistful actually contains a far more menacing performance by the brilliant Gian Marie Volonte as Rojos Ramos than El Indio which he portrayed in the 2nd film. Itâ(TM)s a strange travesty as the character of the middle brother was played by a sensual ease by the charismatic actor. Even the scene of his introduction where he mercifully guns down the soldier battalion is shocking. What a character- an equal of Eastwood's Joe. Any other actor perhaps would have faltered. The film also contains the shocking gunning own of the Baxter's which is quite visceral. A fistful of Dollars is taunt and has a great flow. I totally get the appeal of the 2nd and 3rd film in the series(especially when you count the presence of Van Cleef and Wallach) but this film is unjustly overlooked. What a great film and what an introduction of the iconic cool The Man with No Name.(Masterpiece in my opinion).",
            "review_date": "2018-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even when it leans on its source material, it stands on its own legs thanks to a compelling antagonist and a winning performance in Eastwood. Also, yknow, it completely reinvented the western while looking incredible doing it.",
            "review_date": "2018-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing trilogy. Who doesnt love Clint Eastwood?\n\nThese films have incredible camera work, musical scores and amazing dialogue. Cant go wrong",
            "review_date": "2018-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone begins the Dollar Trilogy with a strong entry, featuring taut cinematography, great suspense, and a memorable performance from Clint Eastwood as the Man with No Name.",
            "review_date": "2018-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Maybe it’s dated, maybe I don’t understand it’s brilliance, but the first of this series was a bit of a dud to me. Lots of down time but I understand it’s part of the style. Probably my least favorite of the series but still has a few good moments",
            "review_date": "2018-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clint Eastwood was not director Sergio Leone's first choice for the 'Man with No Name' role, but he's excellent, and a huge part of why this film is successful.  He has the look of a rattlesnake in Leone's tight shots, exudes confidence and is tough, and yet he's also wryly playful.  His best lines occur early on, when he calls out four men for trying to intimidate him by shooting at his mule when he rode into town.  He says, \"I don't think it's nice, you laughin'. You see, my mule don't like people laughing. He gets the crazy idea you're laughin' at him. Now if you apologize, like I know you're going to, I might convince him that you really didn't mean it.\"  It's easy to see why this film and the rest of the Spaghetti Western films which shortly followed established Eastwood as a star.  His poncho and thin black cigars are also iconic.\n\nLeone's direction is also strong.  He creates a gritty, dark mood in this film, combines those tight shots on his actors with wide panoramas, and makes great use Ennio Morricone's music.  The film was shot in Spain and has some gorgeous shots early on, but I would have loved to have seen more of them.  The dialogue was clearly dubbed in afterwards, and except for Eastwood, is sometimes hard to understand.  José Calvo is good as the innkeeper who befriends Eastwood, but John Wells (Gian Maria Volontè) as the main villain is just average.  I was not happy that Leone had pirated Kurosawa's film Yojimbo (1961) to make this one, but tried to keep it out of my mind.  It's an entertaining movie, the birth of a great collaboration between Eastwood and Leone, and seems to have been influential to the entire genre, and for all that it's worth watching.",
            "review_date": "2018-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From Clint Eastwood, AND Lee Van Cleef'S iconic performance.A Fistful of Dollars took the western down trails it had never explored.",
            "review_date": "2018-07-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ennio Morricone gave a classic soundtrack to thIs Sergio Leone epic.A visual and sound masterpiece. A must watch. My favorite.",
            "review_date": "2018-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "more than a handful..\n\nFistful Of Dollars\n\nThe camera work is not only supported but celebrated with an amazing cinematography as it does usually on such western feature. As much as simple the plot goes, the weaving of the whole structure goes dull in its first act, as it grows obvious. It is rich on technical aspects like sound effects, background score and editing. Sergio Leone is no short on execution and has probably improved on his skills as it keeps the audience engaged and doesn't unnecessarily chews off the character's perspective. Clint Eastwood holds on to its role and delivers the expectations and doesn't require any support at all. There are few action packed sequences and whistle-blowing dialogues that can only come out of a fanboy's perspective and this is the key that makes the feature stand alone in its franchise. The choreography too has improved a lot and so has the meddling of the emotions among the characters that is done well within shorter runtime of almost 100 minutes that helps factor in on its favor. Firstful Of Dollars is more than a handful and even though its reach for something more colossal that its potential fails in here, it still grasps a whole lot of popcorn fun in here.",
            "review_date": "2018-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great western, that started the great spaghetti westerns. The usage of Yojimbos story in the wild west works very well. And there are several iconic moments to be found here.",
            "review_date": "2018-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Truly Classic Western",
            "review_date": "2018-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Favorite after Good, The Bad, and the Ugly!",
            "review_date": "2018-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably Clint's worst Western movie. Terrible Western.",
            "review_date": "2018-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I loved it. Clint Eastwood as the Man with No name is my favorite movie character of all time.",
            "review_date": "2018-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's nice to see a protagonist who is allowed to be greedy, but still holds the moral high ground. The only issue I have with the plot it why fire wasn't used earlier long before Eastwood came.",
            "review_date": "2017-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Fistful Of Dollars: A Fistful of Dollars is a smart, original and powerful western. With Akira Kurosawa's Yojimbo template,as well as a stunning and powerful preformance from Clint Eastwood, makes it a western masterpeice.",
            "review_date": "2017-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have loved this movie all my life",
            "review_date": "2017-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm desensitized. It was good. I think I appreciate it for its true merit. However I admit to tuning out the final 30 minutes, which proved to be very good from what I did pick up on.",
            "review_date": "2017-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've watched many films in the Western genre over the years mainly starring actors such as John Wayne or James Stewart and directed by John Ford and Anthony Mann respectively.\nThis 1964 film is my and indeed was at the time the U.S./U.K.s first foray at a new genre of Western, the Spaghetti variety!\nShot on a shoestring budget the cast is unknown and gritty. Be it not just in names but unshaven and dirty looks.\nClint Eastwood in his first film role is fantastic as the 'Stranger's or Man With No Name character who rides into the town of San Miguel penniless but rectified this by identifying the unique opportunities that lie ahead in putting the two ruling families in the town (The Romps and the Baxters) who co-live in the town at war.\nThe film was directed by an Italian Sergio Leone and has a mainly European crew and locations including Spain standing in for the U.S. \nTelevision commitments at the time prevented Clint from starring in an American shot film apparently.\nThe music score by composer Ennio Morrecone is excellent and adds to the gritty atmosphere.\nThe first of what became known as the 'Dollars' trilogy. Now for part II, For A Few Dollars More.",
            "review_date": "2017-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first in a new era of tough-guy westerns with ridiculous story, gratuitous killing and only 4 different gunshot sound effects.",
            "review_date": "2017-09-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "clint eastwood proves over and over that hes the ultimate badass",
            "review_date": "2017-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Fistful of Dollars represents western cinema at it's most daring. When blood wasn't present in westerns, Leone introduced graphic violence instead of the standard \"gun is pointed, fired, and the person it was aimed at would just fall.\" So many of Leone's mannerisms have become so incredibly famous that it is hard to recognize that it's all the result of one film. The traditional \"western movie soundtrack\" style originated from Ennio Morricone's beautiful and haunting work, the \"silent bounty hunter\" type character that is so prevalent in westerns originated from The Man With No Name, who speaks with his guns instead of his hands. This movie has no fluff. Everything is straight to the point, and the action is fast paced, but the fight scenes are long. Nothing feels out of place, with the exception of a few dubbed over voices for characters portrayed by non English speakers, but that goes to show that a multi-lingual cast can still play cohesively in a movie when it is put together by a master like Leone.\nThis is a movie that should not be missed by ANYONE.",
            "review_date": "2017-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clint Eastwood is one of the finest actors out there and he even more proves it in this great western.",
            "review_date": "2017-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still effective and original over 50 years on.",
            "review_date": "2017-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can see why A Fistful of Dollars is a classic. It features villains you hate, a protagonist you admire, an entertaining story and plenty of action. Clint Eastwood is iconic in his role as the Man with No Name (\"Joe\"), as is the music by Ennio Morricone. I really enjoyed this movie.",
            "review_date": "2017-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the first act of the Dollar Trilogy, and Leone, Morricone and Eastwood aren't cheating. Astonishing are the shots merged with the score, astonishing are the echoing dialogues and the terrific construction which shape altogether 'A Fistful of Dollars' - a superb western whose only improvement that I can think of would be its connection with other films that will come, enriching it with the adding of new characters who would share the sensational dimension of the landmark Man with no Name, whose impressive sangfroid and stoicism is even a source of comedy.",
            "review_date": "2017-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Once again Sergio Leone's westerns surprised me. And Eastwood also did an outstanding performance.",
            "review_date": "2017-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fistful of dollars is a film that I consider to be a work of art; Since the soundtrack is very good and stays in the head up to the photograph which is good; Not to mention the script that binds you in history; You will never know what will happen; You wait and be surprised; A great movie",
            "review_date": "2017-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've watched Yojimbo (1961) many times but couldn't remember whether I'd seen this film from Sergio Leone's Man with No Name trilogy or not.  You can see why Kurosawa and co. successfully sued to get a part of the profits - Clint Eastwood effectively takes over the Toshiro Mifune character, albeit transplanted to the West (although Yojimbo clearly borrowed from the western genre too).  Of course, Eastwood brings his own unique iconography (lots of squinting) to the part just as Mifune had earlier (lots of scratching) - both were larger than life (and went on to play the same character in one or more sequels).  Leone uses the widescreen gloriously and the Spanish terrain is a good stand in for the Mexican setting.  The plot famously sees the Man/Samurai arriving in a lawless town and playing two rival gangs off against each other until both are dead and he can ride away with all of their money.  He's tough, cool, and in some ways more moral than the rest.  The bad get what's coming to them and the innocent and vulnerable are set free, all to the magnificent sounds of Ennio Morricone.  I still can't remember if I'd seen this before (or one or both of its sequels), so there is something about the blur of characters here (aside from Eastwood, of course, and Gian Maria Volontè as Ramon) that makes it difficult to stick.  For my money, I prefer Once Upon a Time in the West (1968) or Akira Kurosawa, for that matter.  Still, you can't deny the trailblazing effect of Leone's trilogy and Eastwood's dogged longevity.",
            "review_date": "2017-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The beginning to \"A man with no name\" Sergio Leone creates a western masterpiece that still holds up today. A Fistful of Dollars may not be as good as The Good The Bad and The Ugly but it is still a great film. Clint Eastwood is the ultimate smart, witty, and dangerous man. This film paved the way for Westerns.",
            "review_date": "2017-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "about as realistic as most Westerns, which is to say not realistic whatsoever, and as such tedious to watch. A waste of a few hours. Not one interesting or believable story line.",
            "review_date": "2017-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first great western of Mr. Eastwood's great career!\nYou need to see it!",
            "review_date": "2017-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clint Eastwood is a true cowboy!",
            "review_date": "2017-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Already getting Red Dead vibes. I love the almost cheesy dubs that the characters say. It's pretty easy to tell how this movie was influenced by Kurosawa's, Yojimbo, which is another amazing movie. I love all the eccentric and funny characters in this movie. Clint Eastwood is one handsome devil.  \n\nI love the whole hacienda feel of the houses and locations. I can hear where the soundtrack for Red Dead originated from. The harmonicas, timpani, and guitar compliment the movie perfectly. It's crazy how Ramon set the whole killing up. \n\nClint's character is very wise and quick-witted. It's funny how he creates a rival between the two groups and how he makes it seem like the other group did it. Wow, you really get to see just how vicious and relentless the Rojos are when they start burning down that house. \n\nIt's crazy to see how badly they fucked Clint up. I love the little old man who makes coffins. He's someone I'd love to have at a party or as a family member. Love the use of quick zoom in's to show intensity. It's amazing how great of a shot Clint's character is. \n\nWonderful Western movie! Makes me want to watch the other ones. The style and visualizations of the movie we're innovative for it's time. I can see where Tarantino might have gotten inspiration.",
            "review_date": "2017-03-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's unfortunate Clinton has shown his right wing political extreme opinions. I can no longer enjoy any of his cool western movies. Very sad to see his legacy turned into a pile of crap with his bigoted anti black president rants.",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good film to watch as a newcomer to Western films... Awesome. Great acting, soundtrack, visual style and story",
            "review_date": "2017-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great western. Sergio Leone knocks another one out of the park. Not quite as good as Once Upon a Time in the West but still amazing.",
            "review_date": "2017-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "10 out of 10:\n\nPacked with plenty of action to satisfy western fans, A Fistful of Dollars helped western films along with its great directing and acting.",
            "review_date": "2017-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent kick off for this trilogy.   Clint as the man with no name. Not as good as the good,  the bad and the ugly,  but still a great watch.",
            "review_date": "2016-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Godfather of Spaghetti Westerns.  Of course I'm referring to the trilogy and it's titular star.  After seeing so many other cowboy classics afterwards copying this franchise's formula, I must say I wasn't blown away by this.  It was still entertaining though and I respect its legacy.",
            "review_date": "2016-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Music and directing take over this spaghetti western beauty.",
            "review_date": "2016-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Poignant, but well executed and score and acting that makes every moment entertaining and fulfilling.",
            "review_date": "2016-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just about everything in this movie is iconic from the music to the costumes to the characterizations, but ya know what stands out most to me on revisiting the film again after a few years? Gian Maria Volontè's performance as Ramon, the villain. He is hands down one of the most intimidating and frightening villains in movie history and should get a lot more credit than he does for the effort.",
            "review_date": "2016-05-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Fistful of Dollars is the excellent beginning to Leone's dollars trilogy. As a love letter to Kurosawa's Yojimbo, the film creates a gritty old west and introduces a slick, sharpshooting man with no name. Few characters compare to the cool Clint Eastwood gunslinger, who has served as an icon when it comes to the Western genre. While not my favorite of Leone's westerns, A Fistful of Dollars set the pace for what his films evolved into and those films will remain as classics for the rest of time.",
            "review_date": "2016-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Clint Eastwood movie",
            "review_date": "2016-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone's spaghetti Western amped up the genre's violence, but also has unexpected heart. Ennio Morricone's, er, I mean, Dan Silva's, soundtrack also elevates the film to high art.",
            "review_date": "2016-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The more often I watch it, the more I like it. Sergio Leone re-inventing a genre, and Eastwood is the right man at the right place.",
            "review_date": "2016-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the 1st in The Man With No Name trilogy.  It introduces the righteousness of Eastwood's protagonist, \"The Man With No Name\".  This film is a great Leone spaghetti Western, and one of the best ever made.  A classic.  You do not have to watch this prior to watching The Good, The Bad And The Ugly or For A Few Dollars More.",
            "review_date": "2016-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this film spawned a era of these types of films. this may have been one of the first but is not the best and is average",
            "review_date": "2016-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was hard to follow and often made me zone out. The movie had pretty over dramatic acting. I thought it was very random overall. The movie was very confusing and left was to many questions unanswered.",
            "review_date": "2016-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tremendous box office to budget ratio, this film has an intricate story for its time and genre.",
            "review_date": "2015-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Fistful of Dollars is a fine western. The action sequences are great, the score is obviously memorable, and Clint Eastwood's grizzled performance is is considered iconic for a reason; that said, it's more than certainly the worst in its trilogy given the fact that the series' reputation and what the film actually delivers are so disparate. It feels extremely long at only 100 minutes (which is obviously inherent to the genre), with several superfluous sequences involving characters rambling off unnecessary exposition and a tedious back-and-forth narrative that takes far too long to corral the two competing families into the climactic showdown, dragging out the proceedings in a way that never feels compelling. While A Fistful of Dollars doesn't measure up to its legacy, it is the first in the trilogy and it's certainly possible that it was a dry run for those later installments that might prove more rewarding.",
            "review_date": "2015-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rough and brutal but Leone is beginning to finesse his art in this film.",
            "review_date": "2015-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The only reason that i don't give this picture 5 full stars is that i consider the second movie superior to this one.",
            "review_date": "2015-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My mistake, four coffins.",
            "review_date": "2015-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great western in a great trilogy.",
            "review_date": "2015-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A satisfying start to Leone's legendary \"Dollars\" trilogy, \"A Fistful Of Dollars\" presents thrilling action, a charismatic lead performance, and some fantastic score work from Ennio Morricone.",
            "review_date": "2015-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply fuckin fantastic.  Such a great remake of Yojimbo.  And I'm still on the fence as to whether this is my favorite of the man with no name trilogy.  There's just to much to state.  Beautifully shot, scored, written and acted, this is the quintessential western to me.",
            "review_date": "2015-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Surprisingly enjoyable (I say 'surprisingly' because this isn't exactly my genre).",
            "review_date": "2015-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My introduction to proper spaghetti westerns. I can't stand flutes, so that was starting to get obnoxious. There was a lot more humor than I thought there would be, and not just because of the terrible dubbing! I honestly didn't know what the hell was going on for the first half of the movie. Can't you just make the gangs wear one color/style of clothing like in modern-day movies?! There were a few random way-too-long shots of the hero riding around or fight scenes with nothing happening, but other than that, the pacing was great, and the movie really held up.",
            "review_date": "2015-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some aspects of the film may not hold up well today, but Clint Eastwood's performance as a gunslinging anti-hero and a terrific ending make ''A Fistful of Dollars' a film western buffs can thoroughly enjoy.",
            "review_date": "2015-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though not the best of the Sergio Leone trilogy and not Eastwood's best Western this is still an iconic piece of cinema that features a great lead role, fantastic score, is well shot, the plot is decent and the action still thrills to this day.",
            "review_date": "2015-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An unusually stylish western, \"A Fistful of Dollars\" kicks off a brilliant trilogy, and leaves room to improve.",
            "review_date": "2015-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After having watched a major part of Kurosawa's oeuvre (not the least Yojimbo), it's only fitting to move on to the early films by Sergio Leone. This is classic spaghetti western, with Clint Eastwood's inscrutable hero, Gian Maria Volonté as the perfect bad guy, Ennio Moricone's haunting music and widescreen photos from ground level of boots with spurs tingling. Beautiful! OK, so it's totally over-the-top, the make up blood looks like ketchup and the dialogue is sometimes a bit stilted, its still highly enjoyable. \n\nSomething I wasn't prepared for was just how hard I was hit by the drama with the young boy and his parents. I realise now that the last time I saw this film, I didn't have any kids myself...",
            "review_date": "2015-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "93%\nWatched this on 1/7/15\nThis is as good as The Good, The Bad and The Ugly(1966). Clint Eastwood single handedly holds this movie and it benefits from Sergio Leone's taut direction and superb background score. Now all that's left for me is to see For A Few Dollars More. The film is slick, shiny and utterly stylish with Clint Eastwood all over it.",
            "review_date": "2015-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's Robin Hood for the first half, Die Hard for the second, and a great early modern western.  Quite a body count.  It's always interesting to me that it sometimes takes a European to capture the heart of American folklore.  Good on ya, Mr Leone.  Grade B+",
            "review_date": "2015-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the first Clint Eastwood movie I watched. And was it amazing!! Add to it the score from Ennio Morricone and some great screenplay... It's wonderful all through (only to be bettered by For a Few dollars more).\nMust watch.",
            "review_date": "2015-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "*Whistling Intensifies*",
            "review_date": "2015-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"A Fistful of Dollars\"--Sergio Leone's first entry in the \"Dollars\" or \"Man With No Name\" trilogy--begins with an opening title sequence reminiscent of a James Bond opening credit sequence--the stylized cartoonish animation with an exciting boisterous soundtrack (and people getting shot). Not to mention that Leone even references the iconic 'eye' from the Bond sequences. You could even nickname Fistful of Dollars \"Western James Bond\". It has the trademarks and quirks of a Bond movie, but has it's own uniqueness to it. Sergio has fun modifying the Hollywood clichés known during the movies contemporary time. You think something's going happen, it does, but in a completely different manor than you expected. The plot is as exciting as Ennio Morricone's score. Eastwood's subtle, Max Rockatansky/James Bond/Indiana Jones performance is iconic, yet has it's own quirkiness to it. If only Sergio had a bigger budget than $200,000, the cheap action (e.g. the gun trade where we first see Ramon) would have been much more realistic than a bunch of extras playing Cowboys and Indians.",
            "review_date": "2015-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not even a fan of Spaghetti westerns nor western films in general, but this is bad ass. Heard Sergio Leone is a great director and started to get hooked up with this Dollars trilogy. This is a story of a man who has been in a town, stranded between both gangs and involved badly as things get worse. I love the whole revenge thing. I like stories that involve people, who are very important to the protagonist. And Clint Eastwood is the man, I love him in this film. He is very charismatic as a leading character. He handles that 45 like a boss. And Gian Maria Volonté as Rojo, another bad ass villain. Just watching their facial expressions, it is acting at its best. I love the story, I love the performances, I love the wonderful deserted setting, whether it's day or night, and the ending is one of the most bad ass ending ever in a western. I love the score too. It is a western masterpiece and I can't wait to watch the sequel. 4/5",
            "review_date": "2015-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "''When a man's got money in his pocket he begins to appreciate peace.''",
            "review_date": "2015-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As a trilogy, this was a revolutionary western, that changed the way the genre was produced.",
            "review_date": "2015-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This first of three western's is a very strong start to the series. The movie starts off slow but once you hit the half way mark, it's very well paced. Clint Eastwood is very good as the unnamed cowboy who comes to town in the middle of a family feud. He makes friends, enemies, and the movie plays out exactly how you might expect. The western showdowns are very intense and well executed, and the action scenes are all pretty well done. The music and cinematography are great. It's a very well made and interesting western that doesn't have the greatest rewatchability factor or any real twists, but its a fun movie. A Fistful of Dollars gets 4/5 stars (B+).",
            "review_date": "2015-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can really appreciate a film like this, just have to forget it's twice my age",
            "review_date": "2015-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm not even a fan of Spaghetti westerns nor western films in general, but this is bad ass. Heard Sergio Leone is a great director and started to get hooked up with this Dollars trilogy. This is a story of a man who has been in a town, stranded between both gangs and involved badly as things get worse. I love the whole revenge thing. I like stories that involve people, who are very important to the protagonist. And Clint Eastwood is the man, I love him in this film. He is very charismatic as a leading character. He handles that 45 like a boss. And Gian Maria Volonté as Rojo, another bad ass villain. Just watching their facial expressions, it is acting at its best. I love the story, I love the performances, I love the wonderful deserted setting, whether it's day or night, and the ending is one of the most bad ass ending ever in a western. I love the score too. It is a western masterpiece and I can't wait to watch the sequel. 4/5",
            "review_date": "2015-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Treating myself to a rewatch of the so-called \"Man with no Name\" trilogy. Very few examples I can think of where vision and music compliment each other so well in the way Leone and Morricone do (Spielberg and Williams are the best other example I can think of)",
            "review_date": "2015-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If it wasn't for Sergio Leone's Once Upon A Time in The West- This would easily be the greatest western ever made, the funny thing about that is, it was made by Italians not Americans. \"My maul don't like people laughing, you see, it's the crazy idea that your laughing at him.\"",
            "review_date": "2015-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kanye West once declared that his presence was a present, but if Kanye West's presence is a present then Clint Eastwood's presence is comparable to that of a new yacht, a smattering of diamonds and gold bars, and a lifetime supply of fried chicken (and if not one of those gifts sounds enticing, then you probably don't exist).  Eastwood is not the kind of actor that smells like a SAG meeting or a thespian conference.  Rather, he possesses enviable tenacity, scowling as if he'd prefer to be angrily smoking on a dimly-lit street corner in Detroit, or somewhere dirtier.  \n\tWhen he makes his first appearance in \"A Fistful of Dollars,\" I felt an uncontrollable urge to loudly ask \"who is that?\", despite being completely aware of his momentous career.  Wearing a weathered cowboy hat, an armor-like poncho, a ten-day beard, and a hardened grimace, he looks considerably iconic.  Eastwood remains nameless for the remainder of the film (most movie buffs refer to him simply as \"The Man With No Name\"), but he doesn't need a title to define him.  He is a presence.\n\t\"A Fistful of Dollars\" familiarized the world with the magnetism of Clint Eastwood, but it also popularized the spaghetti western (one could instead refer to it as the Italian western, but that would be too politically correct), a now much-lampooned sub-genre that slapped the Hollywood western in the face and smacked some sense into its overtly bright and patriotic adventures.  A gaga assembly line of close-ups, uncomfortable silences, sweat, and gunfights, the spaghetti western laughed at Roy Rogers and Randolph Scott hard.  Riding into the sunset or wrangling an unruly horse were now stale, predictable.  The spaghetti western pushed the Old West into the borders of Mexico and made sure to prove that violent sadism can be just as brilliantly conceived as a long-tracking shot in a healthily budgeted Hollywood thriller.\n\tThe Man With No Name is billed as an anti-hero, a gunfighter almost as villainous as the said-villains but ultimately too clever to be marked as a stock rival.  In \"A Fistful of Dollars,\" he finds himself in San Miguel, a tiny border town that is caught in the feud between two powerful families wanting to gain control of the territory.  The Man With No Name sees opportunity among the bitter rivalry; by countering the families against each other, he would thereby receive the monetary benefits of the soon-to-be massacred parties.  \n\tTruth be told, there are no nice people in \"A Fistful of Dollars.\" They are all so obsessed with furthering their own statuses that any sort of morality has been dead and gone for years, guns and money currently serving as the only forms of life's importance.  Many have rendered the film as being a tepid exercise in arty bloodshed, but that would only be true if it had the same Technicolor innocence as a Roy Rogers or Randolph Scott movie (there those names are again!).  I have always asked myself two questions when it comes to movie violence: (1) Does the violence feel out of place, not matched by the tone of previous scenes? (2) Do you leave the theater so disturbed by the carnage that it serves as the only thing you remember about the film a year later?\n\tUltimately, these are probably stupid questions to ask, as they do not directly apply to \"A Fistful of Dollars.\" It creates and lives in its own universe.  You aren't entirely sure what year it takes place in, where San Miguel actually sits, and how these characters became so outrageously handy when it comes to gunplay.  Violence is a part of the equilibrium.  In San Miguel, the kill-or-be-killed philosophy is shown in its truest form.  No pistol parties would be as harmful as banning breathing.\n\tSergio Leone is as inventive as Alfred Hitchcock or Steven Spielberg, but because he, along with his films, attract only a small demographic of people, his popularity wanes down to that of a cult filmmaker.  For someone who promoted a new genre and perfected it single-handedly, he deserves much more credit.  As his first hugely influential film, \"A Fistful of Dollars\" doesn't have the same unbearably tense patience of his spaghetti masterpiece, \"Once Upon a Time in West,\" but it is so outwardly daring that you can still feel the aftershocks of the groundbreaking waves it made back in 1964.  His style has been imitated time and time again, but still intact is that original underlying feeling that no one has done this before.  It is a provocative and flashy work that walks alone on a dusty path in the desert of cinema.  \n\tWith its flaws in mind, saying Leone was finding his footing wouldn't be entirely accurate.  In \"A Fistful of Dollars,\" you see him trying something unheard of with much luster, and it's immediately apparent that a snowball effect will ensue: The more movies Leone makes, the better they will get.  Though he only directed a total of seven, they all contain enough personality to bolster the projects of director who has made hundreds of movies.  \"A Fistful of Dollars\" is certainly one of them.",
            "review_date": "2015-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite Eastwood western with a solid yet simple story with intelligent dialog and just enough action to keep it interesting.",
            "review_date": "2015-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone transports 'Yojimbo' to the Spaghetti Western genre and in the process gives us a first glimpse of cinemas most iconic figures Clint Eastwood and the 'Man with no Name'. Morricone's soundtrack is colossal.",
            "review_date": "2015-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good Spaghetti western flick for Clint Eastwood's first major feature film that made him a star",
            "review_date": "2015-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great opening credits with darn raw music! The rest of the film has a great score as well, one of the best by Ennio Morricone. The plot is as simple as it is genious. Straigh forward western with some tasty spices.\nEastwood as the coolest cat in the west. He has so many tricks and he is the slickest performer of them. \n\nA very cool story, well told. The atmosphere is superb. Time flies and this is nothing but enjoyable. Guns, punchlines, horses, ricocheting bullets, girls and bad guys - it got it all. It may seem a bit over the top, even clicheful, but it takes it to the maximum limit and it all works out brilliantly. It never feel overdone or stupid, just perfectly timed and entertaining - I want more horse chasing scenes in today's movies. Fancy cars don't got anything on horses in 100 km/h.\n\nThere are also several camera treats here, they are well placed and capture scenes from great angles. Stylistic stuff. The first from Sergio Leone's trilogy about \"The Man with No Name\" and I believe it the first true \"Spaghetti Western\" as well and a remake of Kurosawa's \"Yojimbo\", a director I haven seen anything of yet. I'm really looking forward to the next two, but I'm afraid that they can't be as good with increased playtimes. Sure they can, but right now, it seem hard to top this.\nThat final scene is flawless and a perfect ending for a very good film.\n\n9.5 out of 10 caskets.",
            "review_date": "2015-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spaghetti western with a plot that I found hard to follow, I must have lost concentration at a critical point. Will pay more attention when watching Yojimbo I think. I got enough to say it's a cool film.",
            "review_date": "2014-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It gave us one of the most famous western heroes and ushered in a new age of westerns.",
            "review_date": "2014-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "return on the shooting location in 2014\nhttp://lieuxdetournages.over-blog.com/2014/04/pour-une-poignee-de-dollars-sergio-leone-1964.html",
            "review_date": "2014-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Fistful of Dollars is a story about a small Western town that is being terrorized by 2 gangs. Then a quiet stranger wanders into town, and he manages to pit these 2 organizations against one another in hopes that he can profit from it. The most interesting aspect of this film was that Clint Eastwood did not play a traditional white-hat type of character. He wasn't particularly altruistic, he just wanted a paycheck. That actually gave his character some depth, and kept me guessing as to when he would reach a breaking point and decide that a job was going a bit too far for him. The biggest issue I had with the film was the audio. Apparently the actors were all talking in multiple different languages and they just dubbed in all the lines. Even Eastwood, who is speaking English, doesn't totally line up his lips to the words so it's clear they used ADR for him too. It is an awkward experience watching the unsynched dialogue, and I think some of the acting performances suffer because I'm not even sure they are actually saying the words that are being put in their mouth. That's the biggest hurdle to enjoying A Fistful of Dollars. Once I got past that, it was a very good film.\n\nThere are 2 things I think we all can admit that Sergio Leone is the master of in his spaghetti-westerns. First of all the music. It has this unique style that mixes a number of sounds you don't often find in film scores, which have now become synonymous with Westerns. It just fits so perfectly and it is used brilliantly throughout the film. But the bigger one is the fact that Sergio Leone is the master of the stand-off. That final sequence where Eastwood comes face-to-face with his enemies is so intense. Even though it had been spoiled for me by Back to the Future 2, there were still some surprising moments in the end. That is the kind of satisfying conclusion that the audience craves. We see the anti-hero going mano-a-mano against the villian and only one of them will be able to walk away. That whole sequence alone is probably better than most action movies I've seen this year. The movie did drag at a few points getting there, but once you hit that moment it's all been worth the wait. I can't wait to explore the other movies in Leone's Man-With-No-Name Trilogy, because I imagine he only got better. For Western fans A Fistful of Dollars is a must-see.",
            "review_date": "2014-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolute classic Clint Eastwood.",
            "review_date": "2014-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid first movie of the dollars trilogy. Clint Eastwood plays the famed man with no name very well, and the last half of the movie is really, really good.",
            "review_date": "2014-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Western Movie.Clint Eastwood Is Great In His First Movie Role And Sergio Leone Delivers A Western Masterpiece.The Movie Is Just Brilliant.B+",
            "review_date": "2014-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very unoriginal. It's too close to Yojimbo.",
            "review_date": "2014-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone's creates the pessimistic and desolate world of the spaghetti westerns with this flick, where  the characters are trapped in a world of constant conflict and death, where you can only get by being subordinate to those who have the gun and power or being a wisecrack like our main protagonist here.\n\nThe landscapes shots are panoramic and great, which will eventually become his signature style, but at the same time it reminding us this was always a terrible place to settle anyway being in the middle of a scorching desert. The juxtaposition of the town in the landscape makes for a very dismal and miserable place where there exists no prosperity or joy for the residents but the constant reminder of death and brutality at the hands of those who control power. Thus one resides to being docile and making the care necessities of life the priority.\n\nAlong comes the cynical rogue gunslinger who'd do anything to get rich even going to the point of inciting a war between two rivaling factions. He has adapted himself to the this tough world and has mastered the trades to flourish within it. He's apathetic but his actions reveals that he once had a good human heart. Clint Eastwood plays the character with roughness akin to a razor blade scraping a rock. He's never deterred and his own rules and conviction which inadvertently causes a chain of events that results in a bloody massacre. He's not someone who we root for, because his motives are unclear and always has a sinister, in addition to a indifferent, connotation.\n\nThe film is anything but triumphant, because in the end the actions of the protagonist never changes the direction of the cruel world he inhabits but he merely exists to propagate it. Although whenever he sees a glimpse of real human feeling of love trickling through the hard layer of misery and despair, he knows it's a rare thing and he does everything to make it escape before it vanishes. He cannot feel love, because his heart's gone too cold and he cannot change the grim world because that's the only place where he knows how to live. He just straddles along in his horse waiting for his next fix of violence and gold.",
            "review_date": "2014-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Plot is about as thick as any other western - not at all! A good one to get you ready for the infamous The Good, The Bad, and The Ugly though.",
            "review_date": "2014-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nice performances by Eastwood and Volonté, but it is clear that Leone's style is unripe.",
            "review_date": "2014-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As beautiful as it is, I can't shake the feeling of watching a blatant Yojimbo ripoff from my head. The true fascinating entertainment comes from the observation how Leone adapted a samurai story and its visual and cultural elements into a genuine classic western.",
            "review_date": "2014-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clint Eastwood is one badass mofo and it makes for an awesome western flick. Morricone's unique music sets the tone so well.",
            "review_date": "2014-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A landmark Western and first of Sergio Leone's Spaghetti Trilogy, it also follows The Magnificent Seven as an excellent example of a plot from a Kurosawa samurai movie crossing over into the western genre, this time with 1961's Yojimbo.\nClint Eastwood is The Man With No Name, a drifter who rides into a small Mexican town where two rival gangs are embroiled in a power struggle. Eastwood makes himself a mercenary for hire, first to the Mexican family, The Rojo's, who control the town's liquor, but then switches to the other side, The Baxter's, who control the town's firearms.\nEastwood is superb as the mystery man with little to no honour or morality, a man who can speak entire sentences without having any dialogue through his facial expressions alone.\nThough A Fistful Of Dollars is nowhere near as good as The Good, The Bad & The Ugly, it does make a great first installment to a classic trilogy of films.",
            "review_date": "2014-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I sure do miss when films were this amazing. Westerns were the big sellers back then and this film clearly shows why the genre lasted for so long. The idea of a western film can be easy to do on paper, but delivery and direction is the most important part of any movie. A Fistful of Dollars perfectly captures the western feel while having a great atmosphere of the dark and grittiness. This is when the grit was actually good and had things to back it up as these were the times bodies dropped like flies. Clint Eastwood as the unknown traveling cowboy is one of the best characters in the genre because of how much he does. The man sees that there is a town in danger because of a power struggle between two groups as the government cannot do anything as even they get slaughtered by the rouges. The film also explores into a nice sense of humor at little bits that really gets you to feel how everyone feels, again creating the western atmosphere correctly. I even love how the overall set up for this film works out, it makes you wonder what is going to happen. There are many scenes that make you wonder what is happening and seeing things end one at a time easily fulfills the plot with a great pace. The best part to a good build up though is the suspense and when things start firing it keeps getting more and more suspenseful. A masterful film, and even saying that doesn't fully honor A Fistful of Dollars. It easily stands up to the test of time and easily keeps Clint Eastwood as the western icon.",
            "review_date": "2014-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Fistful of Dollars begins a trilogy of western classics, with an undeniably top-notch performance from Clint Eastwood, a clever and interesting story, and of course Ennio Morricone's iconic score.",
            "review_date": "2014-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clint Eastwood's acting and Sergio Leone's directing was a magical combination from the beginning.",
            "review_date": "2014-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A western classic that's typically really good and heightens Eastwood's acting career by his fine performance. (B+)\n\n(Full review coming soon)",
            "review_date": "2014-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A solid debut from now acclaimed director Sergio Leone, but Kurosawa's Yojimbo (the movie that inspired it) is much better.",
            "review_date": "2014-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Undeniably iconic but arguably thinner than Kurosawa's grey-moral landmark about justice and sacrifice. In the end, A Fistful of Dollars achieves grandeur but in expense of conflict and depth that made Yojimbo a classic.",
            "review_date": "2014-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While \"A Fistful of Dollars\" is a seminal film that changed an entire genre, I find it far more dated than later Eastwood westerns. Some sweeping vistas and good acting can't make up for some terribly cheesy action scenes and awkward writing.",
            "review_date": "2014-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Eastwood is iconic as Leone is masterful in the emergence of the classic mid-century genre of spaghetti westerns, as A Fistful of Dollars is a cunning start to the historic trilogy.",
            "review_date": "2014-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fitting opening for the Dollars trilogy, 'A Fistful of Dollars' gave the world Clint Eastwood and we could not be more grateful for that.",
            "review_date": "2014-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Clint Eastwood classic. Fun and entertaining this classic is one of his best films.",
            "review_date": "2014-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Considering how many western tropes were in this film, one would almost wonder if it was the origin of them all.\nA good start to the \"Dollars trilogy\" that eventually ends with \"The Good, the Bad, and the Ugly\".",
            "review_date": "2014-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Grade:High 8/10\n\nA Fistful of Dollars is a western classic and one that helped cement\nthe westerns of the 50's and 60's in the memories of fans and new\naudiences alike. With a smartly written, acted and directed story you\ncan't help but watch this and enjoy it and take in the sights of this\nwonderfully set movie. I enjoyed all of it and for those who enjoy\nwesterns I couldn't recommend this more as a piece. I felt it was a an\nExcellent and Great film and below is why I felt that about it, and so\nmany other people did too.\n\nThe story as I say is smart and well thought out, and with some great\ncharacters and parallel families, it just makes for one big and fun\nwestern, oh and with some bloody violence too. I guess to say this is\nfun is the wrong word and although it is hugely enjoyable the story is\ndark and makes for drama at some points, but then goes into some good\nold gun shoot outs(including the old extremely loud gunshots we got in\nclassic western films). Finally we get a character who guides us\nthrough a slow plot but he does it so well it seems even faster.\n\nClint Eastwood in the main role without a name is superb and his\nmenacing voice coupled with his great performance makes for an\ninteresting acting role indeed. I loved the supporting cast and even\nthough no one stands out anywhere near Eastwood, they still do a great\njob and do what all supporting casts should do even today in film.\nFinally on the acting it is strong, for some films like this they don't\nall do well but in this you feel everyone does what there meant to do\nall the way through.\n\nDirector Sergio Leone does his job here every well and if it wasn't for\nthe other films in the Man With No Name series then this would be his\nfinest by far. He also had a hand in writing this as well and with a\nmassive writing team we got a great script that when put together with\nthe film is just superb. I liked the chase scenes, gun scenes and\nanything in the beautiful landscape and for when this was made the\nquality of the stunts and deaths are great and they don't seem cheesy\nat all which can happen so often in films of this era.\n\nI felt criticism wise that although it warrants very very little, the\nstory could be seen as over dramatic and too much cheesy lines and\nviolence that doesn't fit in with the more quiet scenes. I don't feel\nthey affected it and weren't cheesy etc but that is what could be said\nabout the film. As I have said before I think you have to form your own\nopinion if you like it or not as I couldn't really find much to\ncriticise this about really.\n\nI would Recommend this to those who enjoy a good western film or those\nwho like a good bit of action but it also being drama and tense moments\nwhere a shoot-out could happen any second. I believe many will enjoy\nthis as the story is thick with smartly written lines and I said about\nthe tense shoot-outs, well they are every tense and in a sense you\ncould describe this film as a thriller film because sometimes your\nheart can beat faster when the more quiet stand off's are around.\n\nOverall I give it a high 8/10 and it is a Great and Excellent film and a firm\none of that. I think some will like this film even more than I do,\nwhere as some I believe will dislike it, but the only way to find out\nis to watch it, because the film is classic cinema using one of if not\nthe most famous western star of all time in Clint Eastwood. Finally I\nwill say this is a must for all cinema lovers as it is truly a cinema\nclassic and to say this is in the series that includes \"The Good The\nBad And The Ugly\" it really is a great series of films, just excellent.",
            "review_date": "2014-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great spaghetti western from one of the masters, Sergio Leone. Somewhat a remake of another classic, Yojimbo, A Fistful of Dollars showcases Sergio's keen eye for detail and masterful story telling. While the movie's become overshadowed by his later works, like The Good, the Bad, and the Ugly, there's still a lot of that definitive western charisma that makes these movies one of a kind. A must watch for movie fans, and a great one for introducing people to the rich world of Italian westerns.",
            "review_date": "2014-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true western. Even better most of the wild west movies made by American directors. Sergio Leone's masterpiece, helping Clint Eastwood the best cowboy ever on screen. And beautiful score by Ennio Morricone.",
            "review_date": "2014-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Leone is on grand form with this adaptation of Kurosawa's epic Yojimbo. It is hit and miss at times, but nonetheless a great example of the director's title as the head honcho of spaghetti Westerns.",
            "review_date": "2014-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely loved it. Thoroughly entertaining Western from Leone.",
            "review_date": "2014-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Poor dubbing was the only issue",
            "review_date": "2014-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this western! Great story, badass Eastwood!",
            "review_date": "2014-04-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A solid if over-rated Gang/Revenge/Western mash-up. The movie greatest and enviable legacy is making Clint Eastwood a star.",
            "review_date": "2014-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Last night, I got a chance to see the classic 1964 spaghetti western, A Fistful of Dollars on the big screen for the very first time. The film starred a young Clint Eastwood as a cynical gunfighter with no name who comes to a small border town & offers his services to two rival gangs. The two gangs are unaware that the mysterious figure is playing both sides. Famous Italian director Sergio Leono who also co-wrote the screenplay with Victor Andres Catena & Jaime Comas crafted a spectacularly entertaining, & wryly funny first chapter of the famous \" Man With No Name \" trilogy which includes itâ??s 1965 follow-up, For a Few Dollars More & the iconic 1966 film, The Good, the Bad, & the Ugly . The performances from this small cast were excellent. The action scenes were intense, shockingly violent & heart-pounding. The look of the film was stunning from the landscape of the desert to the small town. The music in the film was fantastic especially  during the back & forth close-ups on their faces during the big showdown at the end of the film. For those who havenâ??t seen this film, I HIGHLY recommend seeing it to appreciate the old time movie making.",
            "review_date": "2014-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The original spaghetti western-- the acting  is still a bit wooden, but the music, the realism and grimyness must have been a shock to the original audiences.",
            "review_date": "2014-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Fistful of Dollars has classic Sergio Leone direction and a witty script, but lacks everything else needed to be an exceptional western. As a result, A Fistful of Dollars is far inferior to the classic The Good, the Bad, and the Ugly",
            "review_date": "2014-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Get three coffins ready\"\n\nA Fistful Of Dollars is the first of the Sergio Leone Spaghetti Westerns I am going to watch, since as a big Clint Eastwood fan, I feel ashamed to say I haven't lost myself in the 'Dollars' trilogy just yet. It's the first in the series, and as much as I haven't gotten into the series till now, A Fistful of Dollars makes it challenging for me to watch A Few Dollars More, because this regarded 'classic' didn't necessarily blow me away. It's a solid western, featuring Clint (never fails), but as I have heard, lays the template for the next films where Leone really begins to take his form as an epic storyteller.\n\nClint Eastwood is the man with no name, who decides to stay around a bad town, where the only money that comes through is for booze and guns. It's small town, run by two gangs, the Baxters and the Rohos. When a small town like this one has two bosses, it never goes well. The Man is warned to leave unless he wants to be shot dead, but he sees a fair opportunity to make a few dollars. He approaches both gangs offering his work, but not for cheap. Both gangs get interested in him, and let him help with their objective. What both groups don't know, is that The Man is playing both sides, trying to take advantage of everyone for his gain. Everybody's packin' heat, but The Man is confident he'll come away with the last laugh.\n\nIt is an iconic movie, but I feel like it is the stepping stone in this series. It's a legendary series, one of the biggest in cinematic history, but 'A Fistful' kind of feels like a bit of a prologue to what could possibly be two much more enthralling entries. I haven't seen the other two, but from what I've heard from some people, is that the whole thing really picks up with a Few Dollars More and The Good, The Bad, The Ugly. That being said, it isn't necessarily a bad thing. I like to think that great series are built like this. A first movie that doesn't really wow, but leaves room for it later. There are a lot of series where the original movie can blow you away, but leaves nothing for the sequels that come off as lackluster. I feel it's the exact opposite here, where the trilogy will only get more entertaining with each passage. Still, A Fistful of Dollars is an entertaining movie.\n\nA couple things bothered me. One, it may have been a bit too short. If we saw a little bit more interaction between Clint and the two gangs, showing his fake dedication and watching it grow, only to come down to an even greater finale, I think that would have worked well. Maybe this isn't the case, but I still think that the finale here is a great one. The movie really does slow sometimes, but it's a couple of different iconic scenes in here that make the whole movie a bit more badass. Clint Eastwood is badass per usual, but not really as much as I'm used to. It was like a reserved badassery, but maybe that's the nature of his character. When it comes to cons, the acting is pretty B-Level (not surprising to me really), and the dubs for some of the characters (who I presume are speaking italian) are pretty shotty. It's still a solid western, that has atleast captured some of my interest to check out the next one.\n\nA Fistful of Dollars acts as a stepping stone for the rest of the 'Dollars Trilogy'. While expecting more, it's still a solid spaghetti western with some memorable scenes.",
            "review_date": "2014-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not that great of a movie, overrated..",
            "review_date": "2014-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie. Not as compelling as  Once Upon a Time in ghe West, but easier to follow than The Good, The Bad and the Ugly. I have to say it has worst fake movie blood I have ever seen...almost bright orange.",
            "review_date": "2014-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. One of the greatest western movies in this series and the wester action genre",
            "review_date": "2014-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First episode of the Dollars Trilogy this film is a classic Sergio Leone Spaghetti Western movie with a Clint Eastwood in great shape, some awesome characters and the most amazing soundtrack thanks to legendary Ennio Morricone.",
            "review_date": "2014-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it's a western with just enough action to make it  interesting & worthy",
            "review_date": "2014-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wish now I had watched Yojimbo.  If this movie is just the homage, Yojimbo must be amazing, because this was totally badass.  I'm not big into old Westerns, so I don't have a lot of experience in saying what's a good Western and what's not, but I can confidently say this movie, really the entire trilogy, should be watched at least once.  \nEastwood is so smooth as the gunfighter, so charismatic, it's easy to see how the character is one of Hollywood's most recognizable icons.  He is the alpha definition of the lone good guy anti-hero from which other great characters, including Han Solo, were born.\nThe plot is such a recognizable plot now.  Skilled fighter breezes into a town ruled by feuding gangs, then plays the system where the gangs devour themselves while he walks away a little richer (in spirit?).  It's almost like this is how Romeo & Juliet should play out instead of the way it did.  And since the plot is borrowed from Yojimbo, it bears noting again the genius of Akria Kurosawa who directed that and Seven Samurai.  The stories are masterpieces.  They're so easy and simple to comprehend, and lend themselves to nearly any time and situation, much like many of Shakespeare's plays.  It takes a genius to create a template for a tale that speaks to a basic, understood element of the human condition.  In this case, the nature of the hero, even one who doesn't want to seem comfortable with the role.",
            "review_date": "2014-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic cool.   One of the few movies I can watch more than one time.",
            "review_date": "2014-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A satisfying plate of spaghetti western filled with some real nasty bad guys and a fantastic musical score. The movie plays as you'd expect and entertains throughout leading to a great ending. Well worth tracking down.",
            "review_date": "2014-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone's Spaghetti Westerns are my transition to Western films in general. They were the first Western films that I truly appreciated. After Leone's trilogy, this led me to other western films like The Magnificent Seven and 3:10 To Yuma. A Fistful of Dollars was the first of the trilogy and in my opinion is the weakest out of the three.\r\n\r\nThe film was written by a couple of writers, one of which includes Sergio Leone. This is the area of the film that I felt was the weakest as simple the plot may be, it lacks a strong build up to the memorable and exciting climax. The characters aren't as interesting in this film in comparison to the subsequent films, an example of poorly written characters in this film are The Baxters. They feel two dimensional and plain. I did enjoy the banter between Clint Eastwood and Jose Calvo. The dialogue in this film feels a lot more cheesier than the other films, most of it is good but there are moments that feels cringe-worthy. It is definitely a big risk in creating a protagonist with no background, it can be hard to empathise with but at the same time it allows the audience to become curious of the character and allows him to become unpredictable. The film's plot showcases the protagonist's greed and it's aftermath.\r\n\r\nThe film's biggest strength is Leone's direction. Leone wanted to create something different from other westerns and focused on building tension between events making it much more effective. Leone has created something patient and at times quiet, in particular the first few minutes of the film. The film is definitely limited by it's budget, with the setting feeling plain and lifeless.\r\n\r\nMassimo Dallamano is the cinematographer of this film, and also for the next film. Dallamano and Leone has focused on using close ups and at times they are extreme. These shots are commonly found on iconic moments of the film, like the climax or the switch in the middle of the film. The film's overall look feels much more grittier, this may be due to budget constraints or the filmmakers are not as confident with their shots in comparison to the subsequent films. There is a particular scene, which I thought was beautifully done and the scene was the first time we see Eastwood uses his gun, having the camera placed low and shooting it on the point of view of the gun.\r\n\r\nOne of the most memorable aspect of this film is the score. Ennio Morricone has created something that sticks with you and have you thinking of his score when you ever think of a Western situation. The beautiful sound of the guitar as it plays Eastwood out and that whistle that sticks with you throughout the film. The score is definitely influenced from the previous released Western films in that era but makes it his own. The score doesn't try to sound complicated or innovative but rather stripping it down, which fits the protagonist of the film.\r\n\r\nEastwood definitely stands out in this film, as his character and his portrayal of it is the main reason people are so hooked to this film. Eastwood has created a character that makes the audience wonder and at times idolise as he never seems to get corrupted by the cliche things found in Westerns, aside from money of course. The other stand out in this film is Gian Maria Volonte playing the film's antagonist and Jose Calvo as Silvanito. Volonte creates a villain that doesn't feel over the top and times look really cool and slick, while Calvo plays as the comic relief supported by the banter between him and Eastwood.\r\n\r\nThis film may not be perfect in my eyes, while other praise it. It definitely is an important film for me as it introduced me to a genre of film that I never thought I would appreciate. A Fistful of Dollars sets up the style and genre that is found on Leone's next few films.",
            "review_date": "2014-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "when a man with a .45 meets a man with rifle...",
            "review_date": "2014-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Leone's filmmaking, Eastwood's performance, and Morricone's score are all a bit raw and undisciplined in this first teaming, but all the elements of greatness are evident, just waiting to be refined.",
            "review_date": "2013-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good film right here. I loved Clint Eastwood's performance and he really killed it here for sure. In addition, the cinematography was top-notch and the setting/decor was also really well done and really fit the \"Western\" theme extremely well. Another positive here was definitely the action sequences as well as the build-up of the conflict. Both really hooked you in and left you wanting more, while providing thrill after thrill.\n\nDespite those positives, there are some definite negatives. One of the biggest ones would be the shootouts actually, as when somebody gets shot, it looks extremely fake. Now, watching this in 2014 and comparing it to films of today is unfair, but regardless, even with the 1960's technology available to them, I really wish that he at least looked somewhat realistic and not just completely acted. Another would be the dubbing. For when this film came out, it is impressive, but at times, it was painfully noticeable and really hampered my enjoyment of the film. \n\nHowever, aside from these two things, I really enjoyed this one. It is a great way to kick off the \"Man With No Name\" trilogy and serves as a strong introduction to Clint Eastwood's character and, really, Sergio Leone's style.",
            "review_date": "2013-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's Leone's satisfyingly simple mix of guns, cigars, action, and Clint Eastwood that makes a spaghetti western classic, as well as reinvent the genre.",
            "review_date": "2013-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Filmed beautifully with assuredly cool cinematic flair, Sergio Leone's seminal Western is a breath-taking masterpiece of iconic stylishness and hard hitting violence.",
            "review_date": "2013-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie features a lone man coming into a town of two families that's always bordering the edge of full-scale gunfighting.  He double-crosses both families, and works for his own cause.  Sound classic?  That's because it is.  It's the godfather of Spaghetti Westerns, and one of my favorite films of all time.",
            "review_date": "2013-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everyone should see this trilogy. Required viewing. Sublime",
            "review_date": "2013-12-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stealing only from the best of cinema, both Western and Eastern, director Sergio Leone and actor Clint Eastwood debut strongly in A Fistful of Dollars, a low-budget film in the Wild West centered on a drifter (Eastwood) caught in a feud between two rival gangs in a town held hostage. Some tropes have not stood the test of time too well (ex. Damn the pride of a ruthless killer, foregoing strategy for principles), others have stood well (ex. Every action sequence, most prominently the now classic \"showdown\" stance... though Leone would soon perfect this in later movies). Add some refreshing twists, like the complete absence of exposition for Eastwood's character, and you have a pretty good Western action flick.",
            "review_date": "2013-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A textbook model for the spaghetti western, A Fistful of Dollars is a fantastic movie that benefits greatly from Clint Eastwood's stern performance and director Sergio Leone's masterful touch.",
            "review_date": "2013-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite out of the dollars trilogy",
            "review_date": "2013-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The quintessential 'spaghetti western', it exemplifies the brilliance of Sergio Leone's direction influencing all Westerns to follow. And equally a newcomer whose talent still shines to this day, the incomparable Clint Eastwood: this film helped make him a star. Also of note: the film score perfectly sets the tone and period.",
            "review_date": "2013-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The definition of Spaghetti Western. Eastwood shines amid several strong performances and innovative camera work.",
            "review_date": "2013-10-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Spaghetti western in which a star is born!!! (Well of course he was already pretty big in rawhide)",
            "review_date": "2013-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliantly made with a musical score that sticks on to you for life and to mention the bad-ass performance by Clint Eastwood. Spaghetti western at its finest.",
            "review_date": "2013-10-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's interesting how this was a re-imaging of Yojimbo, but not a complete ripoff. I liked Yojimbo better, but only because this was a pretty general Western. It had some great shootoffs, but it wasn't Eastwood or Leone's best stuff.",
            "review_date": "2013-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone's Spaghetti Westerns are my transition to Western films in general. They were the first Western films that I truly appreciated. After Leone's trilogy, this led me to other western films like The Magnificent Seven and 3:10 To Yuma. A Fistful of Dollars was the first of the trilogy and in my opinion is the weakest out of the three.\n\nThe film was written by a couple of writers, one of which includes Sergio Leone. This is the area of the film that I felt was the weakest as simple the plot may be, it lacks a strong build up to the memorable and exciting climax. The characters aren't as interesting in this film in comparison to the subsequent films, an example of poorly written characters in this film are The Baxters. They feel two dimensional and plain. I did enjoy the banter between Clint Eastwood and Jose Calvo. The dialogue in this film feels a lot more cheesier than the other films, most of it is good but there are moments that feels cringe-worthy. It is definitely a big risk in creating a protagonist with no background, it can be hard to empathise with but at the same time it allows the audience to become curious of the character and allows him to become unpredictable. The film's plot showcases the protagonist's greed and it's aftermath.\n\nThe film's biggest strength is Leone's direction. Leone wanted to create something different from other westerns and focused on building tension between events making it much more effective. Leone has created something patient and at times quiet, in particular the first few minutes of the film. The film is definitely limited by it's budget, with the setting feeling plain and lifeless.\n\nMassimo Dallamano is the cinematographer of this film, and also for the next film. Dallamano and Leone has focused on using close ups and at times they are extreme. These shots are commonly found on iconic moments of the film, like the climax or the switch in the middle of the film. The film's overall look feels much more grittier, this may be due to budget constraints or the filmmakers are not as confident with their shots in comparison to the subsequent films. There is a particular scene, which I thought was beautifully done and the scene was the first time we see Eastwood uses his gun, having the camera placed low and shooting it on the point of view of the gun.\n\nOne of the most memorable aspect of this film is the score. Ennio Morricone has created something that sticks with you and have you thinking of his score when you ever think of a Western situation. The beautiful sound of the guitar as it plays Eastwood out and that whistle that sticks with you throughout the film. The score is definitely influenced from the previous released Western films in that era but makes it his own. The score doesn't try to sound complicated or innovative but rather stripping it down, which fits the protagonist of the film.\n\nEastwood definitely stands out in this film, as his character and his portrayal of it is the main reason people are so hooked to this film. Eastwood has created a character that makes the audience wonder and at times idolise as he never seems to get corrupted by the cliche things found in Westerns, aside from money of course. The other stand out in this film is Giari Maria Volonte playing the film's antagonist and Jose Calvo as Silvanito. Volonte creates a villain that doesn't feel over the top and times look really cool and slick, while Calvo plays as the comic relief supported by the banter between him and Eastwood.\n\nThis film may not be perfect in my eyes, while other praise it. It definitely is an important film for me as it introduced me to a genre of film that I never thought I would appreciate. A Fistful of Dollars sets up the style and genre that is found on Leone's next few films.",
            "review_date": "2013-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No one makes spaghetti westerns anymore.",
            "review_date": "2013-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "spicy spaghetti western,typical Eastwood Style!!",
            "review_date": "2013-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest remakes of all time.",
            "review_date": "2013-08-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Clint Eastwood was made for Western films, and Sergio Leone to direct them.",
            "review_date": "2013-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story had no depth. Watching dozens of unarmed innocent people run out of a burning building and getting gunned down like arcade ducks is just not my idea of a good climax. Bonus: I only paid $1.43 for the discs. Disclaimer: I am a huge fan of The Good The Bad and The Ugly.",
            "review_date": "2013-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Fistful Of Dollars - Sergio Leone's direction is spot-on, Clint Eastwood's lone ranger is superb and Ennio Morricone's score is sublime.",
            "review_date": "2013-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sergio Leone created a hell of a spaghetti western that is a masterpiece to its genre.\nClint Eastwood gives a memorable performance along with the rest of the ethnic cast.\nPlus, Ennio Morricone composed the best and most fitting score for the soundtrack, he is a master.\nGreat spaghetti western flick.",
            "review_date": "2013-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Leone's first western certainly isn't his most ambitious. However, the familiar, simple take it has on the anonymous-man-coming-to-town-and-helping-the-good-guys story is so wonderfully told with the director's unique touches of style and unflinching propensity for violence. The action is fun, intense and exciting, and the bad guys are presented so that hating them is an absolute joy. Gritty and engrossing.",
            "review_date": "2013-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really enjoyed the lawless setting of the US / Mexican border. These Clint Eastwood Spaghetti Westerns are the oldest westerns I can watch. I don't have any nostalgia for old westerns and can't take the bad acting, bad dialog, and cheap western town scenery.",
            "review_date": "2013-07-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the few old westerns I can watch and enjoy.",
            "review_date": "2013-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not quite on the level of the movie that \"inspired\" it, but still a superior western and a career-maker for Eastwood.",
            "review_date": "2013-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant film. If you don't like this film, then you don't know true westerns.",
            "review_date": "2013-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorites of all time!!!",
            "review_date": "2013-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My reviews of the entire Dollars Trilogy is here and what better way to start off, but with the beginning of the trilogy? Here is my review of \"A Fistful of Dollars. The story is about \"Joe\" or simply, the Man with No Name, as he takes on a war in a forgotten little town that is run by death and misery. It is up to \"Joe\" to end this war and bring peace and happiness to the town as it once was. I can't express my happiness of how this film turned out. It has been MANY years since its release and still stands out. The performances are just stunning especially from the legendary, Clint Eastwood, who delivers a badass mysterious bounty hunter/killer. The movie IS pretty long, but that didn't stop me from having fun with this movie. Seriously, this movie is THAT old and yet it never kept me bored. The gun battles are well done and the setting is just perfect. The final fight scene is probably the most badass and most recognizable scenes to date. Having Back to the Future parody this scene and yet it is still pretty badass. No matter how old this film is, it still holds very well and it gave one iconic actor his most iconic role yet. I got nothing else to say about A Fistful, but it is just a pure badass western..........go see it.",
            "review_date": "2013-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Fistful of Dollars is a genius film for its time and for all of movie history. Clint Eastwood, though the only real relevant actor in the film, carries the show on his shoulders to complete perfection, which is part of what makes him one of the greatest actors of all time. If you took the fragments of this film solely capturing his journey into the Mexican village full of violent murders capped off with facing the vicious Ramon, it would be enough on its own to make its own movie. And it would still be fantastic enough to be the classic that it is.",
            "review_date": "2013-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film that made the spaghetti westerns a household name and gave rise to one of the most iconic western stars, Fistful of Dollars is a  near beautiful masterpiece.  What puts it near the top of all westerns is easily the story.  In just under an hour and forty-five minutes, Sergio Leone puts great work into turning a classic samurai film into a classic western with the twists and iconic moments kept intact.  Eastwood is perfect as The Man with No Name and his counterparts do a near perfect job at keeping up.  For 1964 Leone takes a bold direction with a western that clearly pays off in a big way.\n\nWhile film is technically a remake, it still holds up extremely well and is a great example of what makes a good western.",
            "review_date": "2013-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While not as good as the third entry, still a great movie. Eastwood is fantastic as the infamous Man with No Name. The shootouts were extremely entertaining, and the finale was great. A great movie overall.",
            "review_date": "2013-07-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good movie, my favorite of the Dollars Trilogy.  This movie would not have been made if not for Yojimbo and probably should not be rated higher on the tomatometer (just sayin) but it is great in its own right nonetheless.  The 'apologize to my mule' scene is one of my favorites.  Eastwood is something else on screen and this may be his best role.",
            "review_date": "2013-06-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yes, Leone directed it and Eastwood is in it, but did I like it, well no. I'm not a huge western fan to begin with, and the storytelling dearth of A Fistful of Dollars threw me off. Now, when you look at its historical importance and meaning it's evident that the film's value cannot be undermined. I just didn't enjoy it very much, it's not my cup of tea. And that's well basically it. The Leone frame is rich in drama and composition, the epic nature of the frontier as accentuated beautifully. It's just not for me. Recommended, if for nothing else, to see a collaboration of two masters of cinema.",
            "review_date": "2013-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fairly bleak, visually striking film that uses the small, conflict ravaged town it's set in to great effect. Eastwood plays an interesting if sparsely written hero, someone manipulative and self-serving while still having enough of a moral compass to put himself at risk over innocents.",
            "review_date": "2013-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is obviously a classic western which portrays many stereotypical western movie situations that you may or may not have seen done as a parody in recent years.  The quality of the film making and of the acting performance by a young Clint Eastwood astonished me, especially for a 49 year old film.  Frankly, I love this movie, and from what people tell me, it is the least successful of the trilogy.  Obviously... I can't wait to watch the next one.",
            "review_date": "2013-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Had a mini-marathon of the first two films of Sergio Leone's Dollars trilogy that I still haven't seen a.k.a. films I should have seen by now. The first one is a Western remake of Akira Kurosawa's \"Yojimbo\" and pretty much follows the same plot. It's my least favorite of the trilogy but that's not to say it isn't a pretty great film. It takes a while to get going and could have used a bit more of the black humor of the original but when it gets going, it never lets up. Extra points for the great Ennio Morricone score.",
            "review_date": "2013-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Fistful of Dollars, the first entry in Sergio Leone's epic dollars trilogy, is an outstanding western with a well written story and mesmerizing performances!",
            "review_date": "2013-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfect remake of a perfect film. A Fistful of Dollars may not quite be as good as Kurosawa's Yojimbo, but it's way more fun. Clint Eastwood, while not Leone's first choice to play \"Joe\", he's definitely the only guy who could match Toshiro Mifune's quiet, cool and intelligent loner. It is the film that created a genre and for good reason, it oozes cool and has style in spades. Leone's unique style on A Fistful of Dollars has become iconic, and for good reason. It's extreme closeups weren't something seen in westerns often, especially American westerns. The fantastic and quick editing gives it that style I talked about. Then there is Ennio Morricone's score that is also iconic and was so influential. The main theme will get stuck in your head for days. Everything about this movie is a classic. Guess what it only gets better with these three icons of cinema with their next two Dollars/Man With No Name movies.",
            "review_date": "2013-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good movie for its time, but it definitely shows its age. The lip syncing is some of the worst I've ever seen.",
            "review_date": "2013-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a great realistic and gritty take on the modern Western. Plus a great character development by Clint Eastwood.",
            "review_date": "2013-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Sergio Leone's great masterpieces and one of the greatest films in the world. Clint Eastwood plays the role perfectly and Ennio Morricone's great music in the background make this film even more enjoyable to watch.",
            "review_date": "2013-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic film. Sometimes it was hard to realize what was going on, but overall one of my favorites.",
            "review_date": "2013-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Inspired by the Kurosawa classic \"Yojimbo,\" \"Fistful\" is compact and simple compared to the epic \"The Good, The Bad and The Ugly,\" but has its fair share of moments.  After years of outdoor shooting on \"Rawhide,\" the sensitivity of Eastwood's eyes culminates in the epic presentation of his trademark squint, a coping mechanism for the bright Spanish sun.  He keeps it cool though, the coolest yet.  Like Leone's other works, the film has plenty of style with an epic and violent tone.  The visual quality is good and the audio is post synchronized, which presents the same issues as it did in the 1966 finale/prequel.  Ennio Morricone's score is beautiful, yet an order of magnitude smaller than his work on \"TGTBaTU\" or \"Once Upon a Time in the West.\"  I would say that the moments of greatness manage to justify the plethora of similar films that would follow.  (5 April 2013)",
            "review_date": "2013-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The lesser of the three films. They get progressively better.",
            "review_date": "2013-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic spaghetti western",
            "review_date": "2013-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two things a western must have: an ever more intriguing storyline, tied with an utterly bad-ass character (in this case Clint Eastwood unforgettably dressed in his poncho, with a cigar poking out his mouth). Both are more than covered in this film, while adding a brilliant village and utterly perfect soundtrack. A godly manifestation of a western.",
            "review_date": "2013-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As I imagined, western is not for me. Though it's clear Tarantino is a fan",
            "review_date": "2013-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The one that started it all! The film that introduced America to a true cinematic hero (Eastwood) and the film making world to a genius of a director (Leone). If you like westerns, it's a must. This one has a lot of good, violent bloody shootouts, it's an absolute blast!",
            "review_date": "2013-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My favorite Eastwood western with a solid yet simple story with intelligent dialog and just enough action to keep it interesting.",
            "review_date": "2013-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great spaghetti western, more to the serious side but funny.",
            "review_date": "2013-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The one that started it all. A wandering gunfighter plays with two rival families whose hatred has torn apart a whole town. While the story may have been lifted off Kurosawa's film 'Yojimbo', a Fistful of Dollars is the unique stylised vision of a legendary filmmaker in his own right Sergio Leone, who revolutionised the western genre and kickstarted the influential celebrated cinematic movement now known as the spaghetti western. Brimming with visual creativity that is instantly iconic, starring an iconic Clint Eastwood and a crazed Volonté, with a pacing dictated by the wonderful score by Ennio Morricone, this film is simply wonderful and nothing short of age defining.",
            "review_date": "2013-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is such an essential film because of it's influence of the latter two films in the trilogy. The film itself is so stylish in it's visuals and script, that looking away seems impossible.",
            "review_date": "2013-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To be honest, I found it pretty crude and boring. It's a first movie, and quickly eclipsed by its sequels. There are glimmers of genius, mostly a collection of beautiful, evocative close-up shots, and the general air of malevolence and nihilism.",
            "review_date": "2013-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great start for many people in this film from Clint Eastwood about to start his journey as one of the most influential actor out there. The ground breaking music from Ennio Morricone, the great western director Sergio Leone. But its a more then great start for the truly amazing film trilogy \"The Dollars trilogy\".",
            "review_date": "2013-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fistful Of Dollars takes elements of Akira Kurosawa's Yojimbo and makes them its own. Clint Eastwood as the man with no name is truly cinemas first one liner badass.",
            "review_date": "2013-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An isolated town in Western America where the emphasis on death seems an ordinary seems an ordinary thing in this town. A lone ranger plans on cleaning this town up.\nThis film is so amazing because of the protagonist 'the man with no name'. He says very little wasn't afraid to use violence to proove his point. it's because he says very little what makes him mystique. He is one of the greatest characters i have ever seen along with 'the godfather'.\nThe film itself is an amazing watch it rejuvantes the western genre, Joe wearing the Poncho with his cigar and squinting eyes and rugged beard and an amazing confidence which i admire.\nThe score is very recognisable and works so well, they use it awful lot but it makes the character seem more powerful.\nOne of my favourite parts of the film is when Joe walks upto the four cowboys who think they can mock anyone. Joe with his head tilted downwards lifts his hat up and asks them to apologize very calmly and shoots all four of them so quickly and this is when i see his true power.\nThe film is directed by Sergio Leone and the film was known as a spaghetti western made in Italy and differed from the classic western with cowboys and Indians this one involves the mexican Outlaws and A lone ranger. Although some cliches exsit with a typical damsel in distress and the guns and clothing. Theres also typical stereotypes including the bad guys being bad, the towns people remain scared and hidden.\nJoe is like a middle man in this film, he intends on flushing out the bad guys out, like most westerns the woman in distress is saved by Joe valiantly.\nJoe really does walkaway with 'a fistful of Dollars' by tricking the good guys and the bad but has to endure torture and little blood on his hands.\nClints persona in this film carried on during his time as an actor and is such a true actor and makes me jelous of his presence.\nCinemotagraphy the film uses cliched super zoom shots showing emotion, Joes squinting eyes is enough to disturb any man. Long shots and for for the shoot showing shadows of the midday sun is nothing new but Sergio films has some of the actors flaws which show the film was set in europe. With some actors voices being pretty poor as they are italians playing mexicans can be spotted especially the little boy when he cries 'mama'.\nOverall the film is an amazingly crafted film flourishing the talents of Clint Eastwood and is worth the watch.",
            "review_date": "2013-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Starring Clint Eastwood with director Sergio Leone, this western adaption of Yojimbo has a poncho-wearing gunslinger (Eastwood) playing to rival gangs off of each other. Upon entering the town, the man with no name is soon disturbed by the Baxters and he makes light work of four men. Then, he decides to join the rival Rojos gang while spending the rest of his time at the local saloon. After a massacre takes place over some gold, the man uses two of the bodies to lure both sides out to a cemetery  In the ensuing chaos, the Rojos capture one man and then the man with no name sends a hostage over the the Baxters. He was able to get money from both sides before the exchange took place. That night the Rojos celebrate and the gunslinger sneaks off to rescue a woman who is captive. He does a virtuous deed but is found out and the Rojos beat him to a pulp. Using his ingenuity yet again, the man escapes to fight another day. Thinking he received help from the Baxters, the Rojos brutally wipe them out. With his friend the innkeeper in trouble, the man returns for the final showdown. He outwits his foe and beats the sharpshooter, Ramon, at his own game. As would become the norm  the man would ride off as the victor in one of Leone's famous panoramic shots.",
            "review_date": "2013-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great start to a great trilogy, Clint Eastwood begins his iconic \"The Man With No Name\" character superbly. Very clever and entertaining, well paced, and stylish, this film redefined the western genre and created an iconic character that would change film making forever. You just can't get any cooler than Clint Eastwood, and he does what he does best here.",
            "review_date": "2013-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The first of the brilliant 'spaghetti western' films. Clint Eastwood stars as his cool 'The Man with No Name' role, it's hard to imagine somebody else in the role. Ennio Morricone's score is remarkable.",
            "review_date": "2013-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It may not register as a big hit in effects, but the early signs of great story teling put this one down in the history books",
            "review_date": "2013-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This clever classic grabs you're attention  with it's interesting yet mysterious scenario and has you on the edge of your seat until the very end.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        }
    ]
}