{
    "rating": 9.7,
    "release_date": "1964-08-04",
    "num_reviews": 110,
    "genres": [
        "Japanese"
    ],
    "summary": "Aging samurai Hanshiro Tsugumo (Tatsuya Nakadai) arrives at the home of Kageyu Saito (Rentarô Mikuni) and asks to commit a ritual suicide on the property, which Saito thinks is a ploy to gain pity and a job. Saito tells Tsugumo of another samurai, Motome Chijiiwa (Yoshio Inaba), who threatened suicide as a stratagem, only to be forced to follow through on the task. When Tsugumo reveals that Chijiiwa was his son-in-law, the disclosure sets off a fierce conflict.",
    "reviews": [
        {
            "content": "Tarantino had to see this movie. Lots and lots of talk.",
            "review_date": "2023-04-13",
            "source": "rt"
        },
        {
            "content": "Watching this movie is like staring into the face of god. Simply perfection. My favorite movie ever by far. A true masterpiece of the highest sort.",
            "review_date": "2023-03-12",
            "source": "rt"
        },
        {
            "content": "100% and 97%?? Dang. I mean the film is well-made and has good sequences/scenes and some good acting but that was about it. Other than that I feel it's for sure overrated. In my opinion it's just a fair black and white Japanese movie about Samurai, suicidal customs, and a sad family story, nothing more really. There's way too much talking for much of the movie and it got kind of boring and even hard to follow. I feel like I would like it more if I spoke Japanese and didn't have to rely on subtitles constantly. It just didn't hit hard enough like I expected it to and if it weren't for some of the more impressive filmmaking techniques then I would've rated it lower.",
            "review_date": "2023-02-19",
            "source": "rt"
        },
        {
            "content": "I didn't care for Seven Samurai, mostly because of the slapstick elements that I found jarring. Harakiri is deadly serious by comparison. There is an air of tension and mystery that is built up to around the half hour mark, when the film is at its most engrossing. It lost me a bit in the middle, with about 30 minutes of flashbacks that really could have been told in a few lines of dialogue. Stick around for the third act though, and you're rewarded with some striking visuals and a memorable duel.",
            "review_date": "2023-02-05",
            "source": "rt"
        },
        {
            "content": "One of the most beautiful and emotional Samurai films I have ever had the pleasure of watching! The story actually goes in a uniquely different portrayal of the Japanese feudal system and even of the Samurai code. It has a very human touch that is truly inspiring and heart wrenching all the same. With an intense and emotional buildup, the last half an hour really explodes into \"an orgy of violence\" as my good friend and frequent film watcher Brad said. The violence, unlike most modern films, is an expression of a means to an end and upholding personal honor for oneself and their family. It is justified and beautiful in it's savagery and blood lust. Tatsuya Nakadai does an amazing job and his portrayal of the down and out samurai is brilliant in it's complexity! This is truly a marvel to behold thanks to Criterion's stunning Blu-ray transfer of this gorgeous B&W film! Highly Recommended!",
            "review_date": "2022-08-22",
            "source": "rt"
        },
        {
            "content": "One of the best films ever made. Its inventive cinematography, superb acting, and wonderful storytelling through flashbacks make this a \"Citizen Kane\" of Japanese films.",
            "review_date": "2022-01-20",
            "source": "rt"
        },
        {
            "content": "Very atmospheric. Reminds me of Kaneto Shindo's films. Great lighting too. I love the intensely suspenseful music. Wow, this is heavy. This samurai wants to kill himself on this guys land because he can no longer live in poverty and without job. Wtf that's odd. The previous samurai, Motome, that came to the Iyi house said the same exact thing Hanshiro said. Ok this is interesting. Saito's men are trying to see if Motome is genuine about his desires to commit suicide or if he's just trying to get a job, food and new clothes from them. It's so crazy to think that this was a thing back in the days. That this was a part of the samurai code of honor and that the other samurai's had to witness this act while this person basically disemboweled themselves. It perplexes me how such a violent, brutal and selfish act was considered honorary and was a thing allowed to go on back then. I guess that's why it's forever gone now and not practiced anymore. Omg holy shit! They gave Motome his own sword to kill himself with! It's not a real steel sword, it's made out of bamboo!! Oh fuck, this is gonna hurt him. Well, he probably shouldn't have posed as a samurai with a fake sword. That scene was so visceral, I wasn't expecting it to be so bloody. \n\nThere were so many formalities in Japanese culture back in the days. Wow, this Hanshiro guy is quite the remarkably disciplined man. Hmm, it seems Saito and this Iyi clan are pretty corrupt and dishonorable. God the backstory to what happened to Hanshiro and Motome is so sad and tragic. Poverty killed the family, quite literally. It killed Hanshiro's daughter and his little grandson since they couldn't afford to hire a doctor for help. It's crazy how relevant this story is to this day. Unfortunately poverty will always exist and will always be relevant. And poverty breeds desperation.  What's disgusting is how this Iyi clan almost took pleasure in knowing that Motome's death was not a clean one, it was a brutal one. It really is a series of unfortunate events and circumstances. I love how Hanshiro said that the samurai honor is just a facade. \n\nDude omg I love the shift in tone towards the end. When he throws the topknots of the two samurai's he's already fought. It's going to get epic as fuck! Wow, that shot of them two walking through the cemetery and the bamboo tree path was incredible. That duel at the end between Hanshiro and Omodaka was gorgeously cinematic. The wind blowing, the statues in the background, the landscape. It was perfection. The build up to that final battle at the Iyi house was beautiful. Wow, funny how Saito wants to cover up the truth of what happened because of pride and reputation. But he also skewed the truth to make Hanshiro look like a hero, saying that he was the only one who committed harakiri. When in fact Omodaka did the same at his home, but now Saito wants it to be known that they died of illness. That they didn't die with samurai honor. I guess in the end Hanshiro did make a lasting impact on Saito. Hanshiro went out like a badass, on his own terms. And on top of that he defiled the Iyi clan and their house and left the whole place bloodied and scarred so they'll never forget him - leaving his legacy for all to see. Even though those fuckers at the end pulled out muskets and shot him.\n\nGracefully shot and elegantly poetic. A thought-provoking and tragic movie about honor, corruption, hypocrisy and poverty. I love the intensity, seriousness and stillness of it all. I love how the story unravels and how we discover how Hanshiro and Motome's stories are intertwined. We get beautifully tragic backstory on Hanshiro, Motome, and their family including Hanshiro's daughter/Motome's wife and their grandson/son. Masterfully crafted story telling. As the story unfolds, everything starts to piece together brilliantly like a jigsaw puzzle. I'd watch it again for sure.",
            "review_date": "2021-12-24",
            "source": "rt"
        },
        {
            "content": "I lost my time with this overestimated movie of samurais. Judge by yourself, no matter what this is not the best Japanese film in history and period. 3/10",
            "review_date": "2021-12-23",
            "source": "rt"
        },
        {
            "content": "It starts off slow as harakiri itself, but eventually gets to it's moral message and a gory ending",
            "review_date": "2021-12-17",
            "source": "rt"
        },
        {
            "content": "As good as 'Seven Samurai' (one of the best Japanese films ever made)",
            "review_date": "2021-11-21",
            "source": "rt"
        },
        {
            "content": "The samurai code exposed as a facade. One of the best samurai films to come out of Japan. This is a long but gripping story where the suspense and intrigue is nicely built.",
            "review_date": "2021-10-10",
            "source": "rt"
        },
        {
            "content": "Desperate times.  So in Japan in the 1600s, it was a time of peace.  Naturally, if it is not wartime, there isn't a large demand for samurai, which made men in that profession struck by poverty.  With no other options to turn to, some samurai go estate to estate, asking to commit seppuku (honorable ritualistic suicide for the layman) in their courtyard.  Most lords don't want to deal with this, so they either hire the samurai on retainer or throw them a bit of money to make them go away.  This story is about one house that calls the suicide bluff and makes the samurai go through with it.  Now I've seen this one before, but it was quite some time ago.  It was easily over a decade in my past, and I remember it being an emotional doozy, but I wanted to keep working my way through the Top 250 Narrative Feature Films list on Letterboxd because it is so diverse.   Hara-Kiri is even better than I remember, which would be an odd thing to say if I wasn't talking about a movie.  This is a great movie to recommend to people.  It's obscure enough that not a ton of people have watched it, but if you are in that minority who has seen it, then you already know that it is universally loved.  In critical circles, everybody knows Akira Kurosawa when it comes to Japanese cinema, but Masaki Kobayashi is a director who has also put some top-notch films into the world.  Hara-Kiri is the total package when it comes to filmmaking, and this is what I'm talking about when I'm bringing up craft.  The storytelling in this is nothing short of amazing.  The narrative is constantly shifting and presenting you with new information, and your engagement will be kept locked because you need to see how it will play out.  It's a movie that almost demands multiple viewings because once you know the second half, it changes your entire perspective of the first, which speaks volumes on the masterful script.  The acting is also standout; that can be hard to recognize with subtitles, but you can still notice the commitment here.  The music is minimalistic, but it comes in at all the right times to heighten specific moments.  All of the camera work is smooth and deliberate, and it is executed in such a way that you always notice what you're supposed to take in at the exact right time.  Stateside, this movie is somewhat of a well-kept secret, but it should be mandatory viewing for any cinema fan.  There's obviously a difference in cultures with there being so much emphasis on honor, but for the sake of the story, you're always able to put yourself in the shoes of the protagonist.  You sympathize with the dilemma these people are in, and in the moment, you understand why they would make this all-in move.  Hara-Kiri is an incredible movie that you should see at least once in your lifetime, if not more.",
            "review_date": "2021-09-03",
            "source": "rt"
        },
        {
            "content": "Hara-Kiri is a brilliant and cerebral work which represents one of the high points of the samurai genre, featuring a brilliant exploration of Kobayashi's signature theme of societal hypocrisy.",
            "review_date": "2021-05-09",
            "source": "rt"
        },
        {
            "content": "Masaki Kobayashi's Harakiri has a simple premise: in 1600s peace-time Japan, an obsolete, out of work ronin comes to a palace seeking a place to honorably execute the ancient ritual of Harakiri, for he desires to die with honor rather than live in poverty. This premise and its eventual resolve would take roughly 10 minutes of screentime. What actually happens in Kobayashi's masterpiece is nothing short of breath-taking.\n\nWith the help of a cast masterfully led by Tatsuya Nakadai, he crafts an amazingly intricate, mostly flashback driven story of family, tradition and duty with layers and layers of social commentary. Spoilers aside, Kobayashi proves here that he can convey more information with a perfectly placed dutch angle or a passing glance that many others can do with hours of footage.\n\nThis film can and should be analyzed, and it has been, thoroughly, but what it really needs is to be watched. By anyone who loves cinema out there. Trust me, you will be amazed.",
            "review_date": "2021-02-21",
            "source": "rt"
        },
        {
            "content": "A masterful criticism of Japanese traditionalism and the conventional reverence for authority and order. There is a stunning contrast between Nakadai's destitute samurai (moral, capable, and hot-blooded, yet looked down upon and left without companionship) and the suit of armor that is frequently shown throughout the film (formal and rigid, but cold, hollow and representative of the formality and bureaucracy that the film so clearly seeks to criticize). There is sorrow not only on the surface level in the misfortunes that befalls the ronin Hanshirō, but also in the film's final revelation, that his struggle was ultimately doomed to be omitted from posterity in a final \"history is written by the victors\" twist. The film is not a character study, as much as a wider criticism using a single focal character as a means to an end, but Tatsuya adapts to the role exceptionally well, and a supporting performance from his foil in Rentarō. As I look back on my favorite classic Japanese films, there is a common thread throughout all of them - screenwriter Shinobu Hashimoto, who may not be a household name in the same manner as Kurosawa or Toshiro Mifune, but deserves just as much credit. Rashomon, Ikiru, Seven Samurai, Throne of Blood, and Harakiri are each complete masterpieces and treasures of world cinema thanks in large part to his exceptional skill in the writing room, and his powers are on full display here, blending Japanese culture and philosophical musings into incredibly potent storylines and crafting some wonderful, often deeply tragic characters. (5/5)",
            "review_date": "2020-12-27",
            "source": "rt"
        },
        {
            "content": "Engrossing tale of honor and tragedy, wonderfully directed.",
            "review_date": "2020-06-29",
            "source": "rt"
        },
        {
            "content": "it made me change my opinion on samurai",
            "review_date": "2020-06-16",
            "source": "rt"
        },
        {
            "content": "\"UN HOMBRE BUSCANDO SU DESTINO\"\nCuando Tsugumo empieza a contar su historia todos callan, ya que sabes que este hombre es alguien que le pertenece a su pasado, presente y futuro, que sus palabras fueron escogidas con cuidado y que traen consigo un mensaje amargo de cariño, perdida y redención, cuando Tsugumo habla todos prestan atención, porque saben que no son solo palabras.",
            "review_date": "2020-04-25",
            "source": "rt"
        },
        {
            "content": "It is one of the best works of The Japanese Cinema! It greatly teaches us how honor and pride are exaggerated and when it's tested many fail to stay true to the person they thought they were. How everyone can be pathetic and helpless. That we should ask why they act as such, instead of judging them blindly without knowing anything about their life. That no one is higher or better than others but just less troubled.",
            "review_date": "2020-03-27",
            "source": "rt"
        },
        {
            "content": "A great jidaigeki film that is beautifully directed and emotionally powerful with critical political themes.",
            "review_date": "2019-11-29",
            "source": "rt"
        },
        {
            "content": "Nerve-wrenching narrative! ",
            "review_date": "2019-10-26",
            "source": "rt"
        },
        {
            "content": "If you are expecting a samurai action film then look elsewhere; however, if you are fine with an initially slower pace this film will have you gripped by a tale of shocking wrong-doing and a man trying to set things right. \n\nThis dark tale unravels in a manner one could attribute to a director like Tarantino and Tatsuya Nakadai absolutely owns the screen with his performance.\n\nAvoid, trailers / wikipedia / reviews that give away the plot and just let this film wash over you and I hope you'll love it as much as I did.\n\nDef one of the top samurai films of all time. 10/10",
            "review_date": "2019-10-22",
            "source": "rt"
        },
        {
            "content": "An epic tale to convey an important message- In human misery, honor merely means anything than living.",
            "review_date": "2019-10-12",
            "source": "rt"
        },
        {
            "content": "\"Harakiri\" shows the pain of reality, harakiri culture, and Japanese culture into the minds of viewers, raising many questions while interpreting the symbol of the tradition. There is a parallel, creating a symbol of exposition from a different perspective but we still see him as we listen to him. Easy to draw a line, with more political debates about morality. There is a good reason why humans suffer too deeply. Because, as we know, especially in this pop culture era, samurai isn't just about sword and sword. It's about identity, personality, and a sense of Japanese discipline towards themselves; for the sake of the name, for the sake of the clan, in order to maintain honor and dignity.",
            "review_date": "2019-07-22",
            "source": "rt"
        },
        {
            "content": "Sly, slow moving, brilliant. Best use of interiors and exteriors in any film I have ever seen...Kobayashi's masterpiece. ",
            "review_date": "2019-07-14",
            "source": "rt"
        },
        {
            "content": "This is what filmmaking can accomplish in its best moments...apart from stardom, fancy effects or big budget...nothing more to say",
            "review_date": "2019-02-17",
            "source": "rt"
        },
        {
            "content": "This film was solid.",
            "review_date": "2018-11-10",
            "source": "rt"
        },
        {
            "content": "I guess this is where I look like the big, dumb, ignorant American. I've never been all that fond of foreign films because of reading subtitles. Many times I've been able to get over that because the action and story have overshadowed that aspect. In Harakiri it was much harder. A big part of my problem is the fact that this whole movie is just guys telling stories. So there's a lot of dialogue, and it feels like I'm reading a book. \n\nNow that's basically the only major problem I had with Harakiri. If I was reading this as a book it would be a thrilling one. The characters experience some heavy emotional battles, and the confrontations between the ronin and the members of the house of Iyi are intense. There's even a few actual sword fights in the film, including one at the climax that is crazy. I certainly wouldn't call Harakiri boring, which was a concern considering all that dialogue. \n\nTatsuya Nakadai is superb in the lead role. He has a line delivery that makes it clear he's pretty much dead inside. However, he also has a few moments where he shows more emotion, and it works so we know what he's feeling. Akira Ishihama was also great as the younger ronin. His desperation was palpable. The violence and blood is about what you'd expect from a movie titled after a method of suicide, even in black-and-white it's tough to watch. \n\nI was unsure where the plot would go from the beginning, and I loved the first story. On the flip side, it seemed that once Tsugumo got into his story I knew where it was heading. There was a lot I saw coming in that tale, and I kind of wanted it to go a little faster. Again, I admit that I'm being a dummy with a short attention span. I can see why Harakiri is so beloved, and I liked it. There were just a couple of aspects that didn't fit my personal taste and kept me from loving it.",
            "review_date": "2017-05-09",
            "source": "rt"
        },
        {
            "content": "Visually Appealing. A samurai tale about vengeance and honor.",
            "review_date": "2017-04-05",
            "source": "rt"
        },
        {
            "content": "Harakiri is an excellent samurai film with emotional storytelling, profound themes, gorgeous cinematography and very engaging fight scenes",
            "review_date": "2017-02-12",
            "source": "rt"
        },
        {
            "content": "Pretty good Samurai film with a typically deep story that keeps you interested throughout.",
            "review_date": "2017-01-07",
            "source": "rt"
        },
        {
            "content": "What is more dishonorable, out of work Samurai (Ronin) asking a clan to commit hara-kiri in their courtyard out of a desire to gain employment, with no intention of committing the act, or those in houses being cruel to them?  When the country dishonors its Samurai, and they are driven to acts of desperation, leading to cruelty and further dishonor, the country spirals, and this movie set in 17th century seems to reflect decline in then present day (1962) Japan.\n\nThe movie is quite beautiful visually, with traditional Japanese architecture and at one point a swaying bamboo forest framed beautifully by director Masaki Kobayashi. The story is taut and works on many levels, first and foremost as a vengeance with honor tale, which might remind you of an American Western, including a couple of epic battle scenes.  It also has the individual man, disillusioned and saying that the Samurai code he lives by is a façade, and yet acting honorably, against a multitude misled by corrupt leaders.   It's one against many in a battle that is timeless and certainly relevant today, and whose results are sadly akin to the entropy of the universe.  \"Who can know the depths of another man's heart?\" the Samurai asks, signaling a need for empathy.  Indeed.",
            "review_date": "2016-11-30",
            "source": "rt"
        },
        {
            "content": "Melancholy look at samurai traditions. Fantastic epic ending with the storm and swaying bamboo framing duels to the death.",
            "review_date": "2016-09-17",
            "source": "rt"
        },
        {
            "content": "Harakiri does have a somewhat boring second act and that family stuff was unnecessary, but the storytelling here is fantastic with such a great use of flashbacks, a very unpredictable nature to it, clever themes and so many memorable scenes. It also has such a strong visual flair with many great shots, it is well directed and acted and it is overall such an interesting, really well crafted picture.",
            "review_date": "2016-05-07",
            "source": "rt"
        },
        {
            "content": "One of the best Japanese films ever made, especially outside of Kurosawa. The cinematography is arresting and the story pulls you in, and when someone dies, you are stricken with sadness.",
            "review_date": "2016-05-04",
            "source": "rt"
        },
        {
            "content": "A layered, complex and stunningly realized action epic. It's certainly among the strongest samurai films ever put to film.",
            "review_date": "2016-03-23",
            "source": "rt"
        },
        {
            "content": "Kobayashi's film feels like a horror film or at the very least a potently grim fable.  Told mostly in flashback by Tatsuya Nakadai, a masterless samurai, who has turned up at the castle of the Ii clan, asking permission to commit ritual suicide to end his miserable life.  The stark black and white serves only to highlight the stark coldness of the feudal system and its unfeeling code of honour (that may be really just a front for authoritarians who take pleasure in sadistic treatment of underlings, or so Kobayashi seems to be implying).  As his story progresses, Nakadai's samurai gradually reveals his hand, undermining the moral rectitude of the clan that has put on such airs of superiority.  Of course, the film crescendos with violence and ends very bleakly.  In 2012, Miike Takashi remade the film in colour and 3D but that version seems almost pointless in its close transcription of the powerful and gripping original. Unbearably tense.",
            "review_date": "2015-11-06",
            "source": "rt"
        },
        {
            "content": "I'd give it six stars if that were possible.",
            "review_date": "2015-07-21",
            "source": "rt"
        },
        {
            "content": "What befalls others today, may be your own fate tomorrow.",
            "review_date": "2015-05-28",
            "source": "rt"
        },
        {
            "content": "One of the best films of all time. A must watch.",
            "review_date": "2015-02-20",
            "source": "rt"
        },
        {
            "content": "Resolvi assistir a esse filme japonês da década de 60 após ler o post do Rodrigo Cunha da Cineplayers. Achei excelente mesmo depois de tanto tempo.",
            "review_date": "2015-01-23",
            "source": "rt"
        },
        {
            "content": "Beautifully written, wonderfully directed and amazingly acted. Harakiri is a creative, inteligent and awesome film. One of the few movies you can call it perfect.",
            "review_date": "2015-01-15",
            "source": "rt"
        },
        {
            "content": "An epic tragedy about tradition tearing a family apart and a man's quest for inner peace that gives a powerful emotion punch, and measured doses of visceral violence.",
            "review_date": "2015-01-04",
            "source": "rt"
        },
        {
            "content": "If you are already a fan of Akira Kurosawa's movies, this is definitely something worth checking out.\n\nFull review at filmbroadcaster.weebly.com",
            "review_date": "2014-04-08",
            "source": "rt"
        },
        {
            "content": "While this film shows it's age somewhat in it's pacing, it is a tremendously powerful story, which is told with great acumen.  I highly recommend this to any and all looking for a great film.",
            "review_date": "2014-02-24",
            "source": "rt"
        },
        {
            "content": "A phenomenal and heartbreaking film. This was the first I saw of Tatsuya Nakadai's work--and he's been my favourite Japanese actor ever since. I definitely have to see more of Kobayashi's films! =)",
            "review_date": "2014-01-29",
            "source": "rt"
        },
        {
            "content": "One of the best Samurai films ever made, and a biting indictment of Japanese feudal (and pre-World War) culture. There are images in this film that will stay with you forever.",
            "review_date": "2013-09-15",
            "source": "rt"
        },
        {
            "content": "By far my favorite samurai film.",
            "review_date": "2013-06-20",
            "source": "rt"
        },
        {
            "content": "An undoubtedly powerful samurai drama, Harakiri is a film that will keep you guessing until the very end. It's a story of bravery, family and honor, not to mention dishonor, and it is a wonderful film that should be treasured for its intensity of emotion and drama.",
            "review_date": "2013-06-15",
            "source": "rt"
        },
        {
            "content": "Starting the film in the midnight is not recommended. In the beginning the rhythm is slow  and the flashback you may don't understand. when you get into the movie, definitely masterpiece. It talks about humanity, nobility and revenge of a samurai. The screenplay, shooting, editing is accurate and neat. Checking the extra bonus in the DVD, you will be amazed to know that Tatsuya Nakadai was 30 years old to act a samurai with 50.",
            "review_date": "2013-05-07",
            "source": "rt"
        },
        {
            "content": "Harakiri is a brilliant, under-appreciated drama that deconstructs the fantasy and illusion behind samurai ways, but also that of who we feel are heroes, and also the hypocrisy of what believe to be honor and integrity. It's a harsh and honest drama about life itself and it holds no illusions about such things.\n\nThe film is about a samurai named Hanshiro Tsugumo, who has come to the residence of the Iyi Clan with the intent to commit the ritual suicide practice of harakiri.\n\nThe members of the Iyi Clan are suspicious of his intentions, especially after a previous samurai named Motome Chijiiwa came to their residence with claims of the same thing, only it turned out he was there for money out of pity (Or possible employment) and had no intention of killing himself. However, the clan made him go through with it, by making him perform the ritual with his own bamboo sword, rather than give him one of their swords to use.\n\nBut, Hanshiro has no intentions of money or employment...he simply wants to die. But, before this, he wants the clan to listen to his life story of what led him to this point. Things become more troublesome for the clan when he reveals his connection with Motome, the fact that three of their members are suspiciously absent that day he requests them to be his second (The person who decapitates the person performing the ritual. They are also the main people responsible for Motome's death), and how he begins to criticize and tear apart their enclosed world to expose the hypocrisy rife throughout it.\n\nThe story is brilliant, especially how it so carefully unravels who Hanshiro is and how he so daringly picks apart at the samurai life and how it cost him everything in his life that should have been more important. He is by far the most interesting character and one of the most fascinating characters I have ever watched in a film because he is so well rounded and fully developed as a tortured soul.\n\nNaturally, the actor playing Hanshiro, Tatsuya Nakadai steals the show as the lead character and it was damn-near impossible to take my eyes away from the screen as I watched him perform so brilliantly and absorbed himself completely in the role. The other actors are also quite good, like Akira Ishihama as Motome Chijiiwa and how he reveals who his character truly was, rather than how he is portrayed by the Iyi Clan and what drove him there. The acting at times almost feels like a product of divine intervention as so many brilliant actors were cast in a brilliant film as there is not a single weak element.\n\nHarakiri is a must-see drama for anyone who loves a good drama. It's a scathing, honest, and brutal drama (The bamboo sword disembowelment scene made me cringe more than most gory films). It's also a great drama about the reflections about how harsh and terrifying life itself can be due to the cruelty and hypocrisy of human nature, especially in places where we would like to believe there was honor and integrity. Harakiri demolishes that fantasy, and it does so in an engaging, riveting, and masterful way. It's an important and masterful film that is worth seeing should you come across it.",
            "review_date": "2013-04-30",
            "source": "rt"
        },
        {
            "content": "Mein Wissen über japanisches Kino der 50er und 60er beschränkte sich bis jetzt fast ausschließlich auf die Werke Akira Kurosawas, von denen ich auch nicht unbedingt viele gesehen habe. Was mich an Kurosawas Oeuvre immer störte, war der Schauspielstil der anscheinend den Japanern innert war.\n\nHarakiri\" überzeugte mich des Gegenteils! Hier zeigt sich, dass den Japanern der 60er naturalistisches Schauspiel keineswegs fremd war. Tatsuya Nakadai heißt der Mann, der als Ronin an den Hof des Iyi-Clans kommt um dort feierlich Selbstmord zu begehen.\n\nIch erwartete ein Samuraispektakel und bekam ein Drama über die Abgründe der japanischen Moralvorstellungen, eine Geschichtsstunde und herzzerreißende Momente im Leben eines Mannes, der alles verloren hat.\n\nAber lassen wir uns zuerst noch einmal auf der Zunge zergehen, wie dieser Film anfängt: Ein arbeitsloser Samurai sucht einen Platz um ehrenvoll Selbstmord zu begehen.\nIn unseren Breiten würde solch eine Prämisse für eine Komödie taugen. In Japan ist sie der Nährboden für einen extrem kraftvollen Film über Ehre, Tugend, Stolz und Familie.\n\nTechnisch ist Kobayashi auf einer Ebene mit Kurosawa, wobei man zugeben muss, dass ihm der große Meister doch noch einiges voraus hat. Der Inhalt von Harakiri\" jedoch, ist besser und emotional mitreißender, als alles was ich bisher von Kurosawa zu sehen bekommen habe.\n\nEine Gruppe Männer sitzen und reden, und schätzungsweise 70% des Films stellen Flashbacks dar, und doch bricht der Film immer wieder in ansatzlose Gewaltorgien aus. Bestialisch, martialisch wie sich der Chijiwa mit einem Bambusmesser entleibt oder schließlich Hanshiro im großen Finale durch die Klansburg gehetzt wird. Dieses große Finale war es vielleicht auch, die dem Film etwas sein Pathos nahm. Schlussendlich bricht dann doch das Samuraispektakel los, das ich schon die ganze Zeit erwartet hatte, und es befriedigte mich dann doch nicht. Ein stilles Ende, für diesen stillen Film, hätte wohl besser gepasst.\n\nAber ich will mich nicht unnötig beklagen. Wie oft sieht man schon einen so exzellent gearbeiteten sowie emotional niederschmetternden Film?\n\nDies ist die ultimative Aufdeckung von Heuchlertum in der japanischen Gesellschaft - don't miss it!",
            "review_date": "2013-04-29",
            "source": "rt"
        },
        {
            "content": "Masaki Kobayashi's tormented drama is a timeless tale about the changing of times. How the lives we create, built on shifting sands, can so easily disintegrate with the advancement of a simple breeze.\n \nDuring the Edo Period, which saw the rule of the Tokugawa shogunate, peace and stability ruled the land. Forced to disband, many warrior clan released thousands of Ronin (lordless samurai) out into the land. Many became impoverished; stripped of their life's work.\n \nThis particular story follows the aging warrior Hanshiro Tsugumo and his request to commit Hara-kiri on honorable grounds. There he is greeted by Umenosuke Kawabe, the feudal lord of the Lyi clan. Still drunk on the power and tradition of the Bushido Code, Umensokuke is intent on letting Hanshiro fulfill his request. Lately, there have been a slew of Ronin who in demanding honorable death; are really expecting coin.\n \nWhen Hanshiro inquires about a man who recently made a similar demand, a game of mental chess ensues between Hanshiro and Umenosuke. It soon becomes apparent that Hanshiro has a connection to a previous Ronin, Motome Chijiiwa, who recently spilled his own blood in this place and Kobayashi masterfully unravels the story through a series of flashbacks.\n \nReleased during a time when \"Chambara\" (sword fighting films) were vogue, Kobayashi subverts the glamorization of the samurai genre. Through his protagonist, he reveals the Bushido code to be merely a facade. A societal adhesive that many clung to even when the ever-evolving society rendered it obsolete.\n \nHe also undermines the glamor of Chambara pictures by revealing the stark reality of the \"honorable\" samurai culture. When Motome is forced to commit Hara-Kiri with a sword made of bamboo (he sold his real sword to help out his ailing son), it is agonizing to watch. Thrusting the dull blade into his gut over and over again, a swordsman stands by anxiously; waiting until he feels the ritual is complete before decapitating the poor soul. Using well placed dolly shots & canted angles, Kobayashi & cinematographer Yoshio Miyajima ratchet up the intensity. This coupled with a close-up of Motome's sweating brow as he laboriously impales himself - fully comprehending the horror of this act of \"honor\"- renders the viewer unable to find glory or honor in this act of self-immolation.\n \nKobayashi frequently cuts to an image of armor that sits inside the Lyi palace to augment his message. Inside the armor is no living flesh. It is merely the relic of a bygone era. Sadly, many are unwilling to let go of the reigns, forcing their anachronism onto others in order to save face.\n \nIt's a film that looks at humanity's capacity for change. In it, Kobayashi shows the viewer the folly of clinging to what is no longer; the irrationality of adhering to the impractical and the foolishness of coercing others to follow suit. For as the film warns: \"What befalls others today, may be your own fate tomorrow.\"",
            "review_date": "2013-01-28",
            "source": "rt"
        },
        {
            "content": "One of the best samurai based films that I have seen. It is more about the ways of a ronin, the customs and traditions they followed in committing sepukku, the circumstances that drove a samurai to commit it etc. It paints a grim picture but also showcases the bravery of the ronin during that time.",
            "review_date": "2013-01-19",
            "source": "rt"
        },
        {
            "content": "Honestly I think this may just be one of my new favorite movies. Everything to me was just perfect. The story was intricate and told through flashbacks but simultaneously in the present. And boy o boy how I loved the cinematography. A lot of really nice framing and moving shots that make the films more dialogue heavy sections more interesting and the action scenes much more intense. Probably the most emotionally charged samurai film I have seen.",
            "review_date": "2012-12-14",
            "source": "rt"
        },
        {
            "content": "The highest praise that I can give this film is that it makes you think. The plot starts off very slow but half an hour in and I was hooked. This movie deals with a lot of political issues and on the morality of war and suicide. It asks the question what would you do to save your family? The answers are shocking and horrifying.",
            "review_date": "2012-11-18",
            "source": "rt"
        },
        {
            "content": "An absolutely hypnotic, mesmerizing film\nthat explores the emptiness of samurai culture in 16th century Japan. The direction and acting as well a the simplistic beauty of the film is astonishing.",
            "review_date": "2012-11-04",
            "source": "rt"
        },
        {
            "content": "Through flashbacks we see the Dickensian misfortunes that drove a young samurai to seek assistance from a wealthy lord through a dishonorable ruse.  His backstory is too melodramatic to have much impact, but his father-in-law's plan to turn the tables on the lord is ingenious.  \"Harakiri\"'s reputation for being a critique of bushido and the samurai film genre is probably overstated.  The stylish slash-em-up at the end of the movie represents an attack on lords who fail to follow the samurai code of ethics, but is not necessarily a rejection of the code itself.",
            "review_date": "2012-10-16",
            "source": "rt"
        },
        {
            "content": "A marvelous tale of betrayal and vengeance.  Everything unravels phenomenally, making this an excellent gradual masterpiece.",
            "review_date": "2012-10-12",
            "source": "rt"
        },
        {
            "content": "Similar to Samurai Rebellion, Harakiri is a beautifully crafted tale with fascinating storytelling and strong imagery culminating in an explosive, awe-inspiring action climax.",
            "review_date": "2012-10-07",
            "source": "rt"
        },
        {
            "content": "Love the use of storytelling in this film and the final confrontation is brilliant.",
            "review_date": "2012-09-14",
            "source": "rt"
        },
        {
            "content": "A little slow to start, \"Harakiri\" is a classic, if not quintessential samurai film. Having less to do with ritualistic suicide, and everything to do with honor, this film digs deep into the plot and builds momentum until the very last drop of blood hits the floor . . .",
            "review_date": "2012-09-08",
            "source": "rt"
        },
        {
            "content": "Such an incredible movie! Groundbreaking story! Next to Seven Samurai, this perhaps is one of the best samurai movie there is. It takes a single idea or tradition of harakiri to question the morality and honor code of the bushido against the feudal system leading it to hypocrisy. Aside from being a samurai film, this perhaps is the best revenge story I've seen. It didn't use mere violence to take vengeance rather uses the bushido to hit it where it hurts the most. What can I say, I can keep on rambling all day of how good it is.",
            "review_date": "2012-08-04",
            "source": "rt"
        },
        {
            "content": "Fantastic. So much heart and soul was put into this samurai film, that I was caught off guard haha. Fair warning, there's barely any action in this one. Instead, LOTS of flashbacks, character development, and sorrow. A great dive into 17th century Japan's political system and ideals.  Can't wait for Miike's remake!",
            "review_date": "2012-07-25",
            "source": "rt"
        },
        {
            "content": "powerful samurai story",
            "review_date": "2012-07-16",
            "source": "rt"
        },
        {
            "content": "\"The suspicious mind conjures its own demons.\" - Hanshiro Tsugumo",
            "review_date": "2012-07-12",
            "source": "rt"
        },
        {
            "content": "Soube hoje que hÃ¡ uma refilmagem, de 2011, mas nem vou tentar. Esse original aqui Ã (C) perfeito. Ã uma daqueles filmes que ficam conosco por muito tempo.",
            "review_date": "2012-07-11",
            "source": "rt"
        },
        {
            "content": "Now this is a badass Samurai movie, and the best one I've seen. It's like Rashomon meets Yojimbo but more intense, like Kurosawa channeling Hitchcock. There are more mind games than there is swordplay and it's all carried out wonderfully. Beautiful black and white cinematography, a clear and focused narrative, sympathetic characters - and it lacks the almost comical overacting that some similar movies have (I'm looking at you, Rashomon). The characters' actions and motivations make sense within the time period and Kobayashi lays out the important elements for us so that we understand. As stories by turns brutal and sympathetic are told in flash back, we gain a better understanding of the \"present\" portion of the movie which finally collapses into a violent struggle. Excellent film.",
            "review_date": "2012-07-06",
            "source": "rt"
        },
        {
            "content": "Majstorsko delo tempa i naracije, prica o casti i postovanju tradicije koja vas od starta uvlaci u svoju misteriju i polako otkriva odgovore. Siromasni, ostareli samuraj dolazi do uglednog klana i moli ih da izvrsi samoubistvo pred njima, stvar koja je smatrana za casnu smrt u doba feudalnog Japana. Pre nego sto pocnu pripreme za njegov cin, gospodar klana ga upozorava - on nije prvi koji je zatrazio da izvrsi harakiri u njihovom domu...",
            "review_date": "2012-07-03",
            "source": "rt"
        },
        {
            "content": "one of the best samurai films ever if you like anything kurosawa did check this out its amazing",
            "review_date": "2012-07-01",
            "source": "rt"
        },
        {
            "content": "This, and Twilight Samurai are my two favorite  samurai films",
            "review_date": "2012-05-15",
            "source": "rt"
        },
        {
            "content": "Samurai Honor. But what will a samurai resort to in extreme conditions. Politics and culture clash as you admire the tension surrounding the characters. \n\nA brilliant and haunting music score.",
            "review_date": "2012-04-16",
            "source": "rt"
        },
        {
            "content": "Samurai movies struggle to improve on this story. The stakes never drop and each actor contains worlds of expression. My only (ONLY) nitpick is that the action choreography is not convincing for the level of buildup that goes into it; nonetheless, this is a gorgeous and masterfully told story that has multiple lessons embedded about authority and honor.",
            "review_date": "2012-04-07",
            "source": "rt"
        },
        {
            "content": "Reall great movie. Yojimbo is better though. :)",
            "review_date": "2012-04-06",
            "source": "rt"
        },
        {
            "content": "Great movie. Brilliant story.",
            "review_date": "2012-04-04",
            "source": "rt"
        },
        {
            "content": "Where the action is lacking, the plot and acting are spot on making \"Harakiri\" a very important film for any Japanese cinema fanatic.",
            "review_date": "2012-04-04",
            "source": "rt"
        },
        {
            "content": "Harakiri tells a tale of masterless samurai Hanshiro Tsugumo who sets out to end his unfortunate life honorably by performing the infamous ritual suicide Harakiri. The name and genre set certain expectations, but against traditional samurai film themes, Harakiri has something else in store for the viewer. Instead of violence and action the film focuses on drama surrounding an aging samurai Hanshiro Tsugumo and his family's misfortune.  \n\nFrom seemingly straightforward initial setting Harakiri's story starts building complexity after Hanshiro Tsugumo arrives at the Lyi clan's gates requesting permission to perform Harakiri at their estate. Setting in the 17th century Japan when the country was going through fundamental changes and also an uncommonly long period of peace brought by the powerful Togukawa shogunate, the Samurai warrior class found itself slowly dwindling. With permanent peace, the samurai class was left without means to provide for their families which made some desperate individuals to disgrace themselves by resorting to begging. Thus upon his arrival to Lyi Clan's estate, Hanshiro Tsugumo is greeted with a warning tale of one such samurai (Motome Chijiwa) who before him had requested permission to perform Harakiri at Lyi clan's compound in hopes of impressing the Clan of his valor and receiving employment. Lyi clan however called out the ronin's \"bluff\" and forced him to go through with the gruesome suicide ritual with his fake bamboo swords! Unbudged by Lyi clan's warning tale, Hanshiro Tsugumo insists in performing the ritual suicide. Unsuspecting the Lyi clan grant Hanshiro Tsugumo's wish and play straight into his scheme for revenge. \n\nHarakiri is surprising, involving and perfectly constructed samurai drama which has very little room for improvement. The tangible atmosphere of ancient Japan with its samurais and their overwhelming sense of honor provide a perfect setting for the tragic tale. During the running time the story grows from its simple beginning into something much greater. Much of the films resolve depends on the Director Masaki Kobayashi and the lead actor Tatsuya Nakadai, who both outdo themselves and make the film into a truely unforgettable experience.",
            "review_date": "2012-03-25",
            "source": "rt"
        },
        {
            "content": "A different style of samurai film that has some heart-breaking moments. The final fight scene is tackled differently too.",
            "review_date": "2012-02-22",
            "source": "rt"
        },
        {
            "content": "One of the finest samurai period pieces ever to be placed on film.  It's not full of sword fights and bloodshed (although they do make an appearance in this 2.25 hour film), but instead the drama and story itself is riveting and timeless.  I don't know what else to say other than you must see this film if you enjoy the period pieces that flooded the screens back in the 1950s - 1970s in Japanese theater.  If this doesn't excite you there is no need to seek this out, as it may be too long with too much reading (subtitled).  Otherwise, a must-see.",
            "review_date": "2012-02-05",
            "source": "rt"
        },
        {
            "content": "This is one of the most suspending story with least ostentatious cinematic effects ever seen.",
            "review_date": "2012-02-04",
            "source": "rt"
        },
        {
            "content": "Hanshiro's main grievance in this film is that the samurai's code of honour is nothing but a facade.  the overall contention is that regardless of any code of honour, a man will do what he has to do in order to survive in his most desperate hour.  the framing of the story is outstanding.  at the beginning, the audience has every reason to believe that Motome is just another spineless mooch defaming the good name of proud and decent samurai.  Hanshiro is more stoic, but his motives appear to be much the same--his introduction to the house is even worded almost identically.  as he tells his story, however, the audience learns with the rest of the noble samurai that all is not as it initially appeared.  the audience, like the lord of the Iyi house, has to choose which course of action was, is, and will be most acceptable.  feelings about the ending will thus differ and further thus lead to conversation and debate.  a thought-provoking modern examination of classical Japanese ideology.",
            "review_date": "2011-12-31",
            "source": "rt"
        },
        {
            "content": "It starts off great, feeding the viewer red herring stories without all the information to sway the way one feels about them.  The overall story is masterful, full of twits and turns and getting to the root of the warriors code and what it truly means.  But the film is quite tragic.  The first act of harakiri performed with a bamboo blade was one of the saddest things I have ever seen.  It was just so cruel and painful.  But this is one of the better samurai films that I have seen, for sure.",
            "review_date": "2011-12-30",
            "source": "rt"
        },
        {
            "content": "My new favorite Samurai film, it's very a-typical and anti samurai film. I was left speechless after watching this masterpiece.",
            "review_date": "2011-12-28",
            "source": "rt"
        },
        {
            "content": "This is a rare film in that when i saw it, it instantly became a top tier favorite. I watched it again to maybe bring it down a peg and instead I came out loving it more. This is the first film of Kobayashi's that i have seen and the hype going into this was insane. But this film exceeds the hype. Hashimoto's screenplay is masterful. Not only is it a well told story that is engaging from beginning to end, it also breaks down mores both of the time the film depicts and of current society. The acting is note perfect with Nakadai really blowing me away. I can't heap enough praise onto 'Harakiri'.",
            "review_date": "2011-12-17",
            "source": "rt"
        },
        {
            "content": "An ode to true honor and value in life... Not everything is as it seems..",
            "review_date": "2011-12-07",
            "source": "rt"
        },
        {
            "content": "Saw the remake first, and while I really liked it, this is the better version. The anger and rage felt at the samurai traditions were very palatable. Watched this and Samurai Rebellion the same night, great double feature.",
            "review_date": "2011-12-06",
            "source": "rt"
        },
        {
            "content": "3.5: I strongly considered 4 stars, but I'll need to see it again before I elevate it to that level.  The first and third acts are brilliantly effective.  It is a samurai film that endeavors to refute the code of the samurai.  It seems incredibly sacrilegious, and yet I tend to think it is one of the most honest and forthright samurai films I've seen.  The staging and execution is superb.  The action leaves something to be desired - it is neither Kurosawa nor Miike nor Tarantino - but it works reasonably well.  The back-story in the second act is the only section that lags a bit, but the opening and closing make up for it.  It ended up almost completely surprising me, which is very refreshing.  This makes sense though, as I couldn't really figure out where it was going midway through the first act.  It ends up being very thought provoking and satisfying, even as it hacks at and tears down the concepts that have grown near and dear to our hearts and minds.  Refreshing and exhilarating.  I definitely think Miike has seen this and I wouldn't be surprised if Tarantino has as well.",
            "review_date": "2011-11-18",
            "source": "rt"
        },
        {
            "content": "Ahhh, the cold, quick, judgments of a bureaucratic (or feudal) system - still relevant.",
            "review_date": "2011-10-16",
            "source": "rt"
        },
        {
            "content": "Armoton kreikkalainen tragedia.",
            "review_date": "2011-10-13",
            "source": "rt"
        },
        {
            "content": "Intense and beautiful.",
            "review_date": "2011-10-09",
            "source": "rt"
        },
        {
            "content": "Masaki Kobayashi's stunning and stunningly underrated tale of rebellion and justice is a cold slap in the face to the very thing most samurai films celebrate: the strict and unflinching code of the warrior. It carefully un-spins and becomes more tragic as it goes along, revealing nooks and crannies of the story with a gentle but horrifying rhythm. Tatsuya Nakadai plays Hanshiro Tsugumo, a father who arrives at the manor of Lord Iyi and requests to commit Harakiri, the ritualistic samurai act of disemboweling oneself, with the chief retainer's permission and assistance. When he has his audience, Tsugumo unleashes a story of great sadness, anger and violence upon both the manor and us, but as the film progresses it becomes clear that, after years of practiced samurai code, Tsugumo will get no sympathy from this manor even when he has us in tatters. Kobayashi cleverly acquires our care in this way, along with our rage, and after a while he strips the samurai structure bare naked and reveals its many glaring flaws. The reason the film is so powerful and ageless is that the criticism applies not just to the samurai code but to rigid structuralism in general, pointing out that no matter what the organization or politics, a system must always take into account human error and exception.",
            "review_date": "2011-10-07",
            "source": "rt"
        },
        {
            "content": "totally badass. watch this.",
            "review_date": "2011-09-05",
            "source": "rt"
        },
        {
            "content": "A masterpiece!!!!!!!\nThank you Mr Kobayashi",
            "review_date": "2011-08-16",
            "source": "rt"
        },
        {
            "content": "I absolutely love this film. Kobayashi is an absolutely incredible, underrated director that never received the credit in North America he deserved. This film is right up there with the Master Kurosawa's best-and that is saying alot. Perfect character development, with a slow but delibrate pacing. As the plot unfolds, and starts to reveal itself, you become completely involved. It's been stated that this is an \"anti-samurai\" film, and that is absolutely true. If you're expecting something on an epic, \"Seven Samurai\", scale, you may want to look elseware. Not to take anything away, as this is an absolutely brilliant film.",
            "review_date": "2011-07-27",
            "source": "rt"
        },
        {
            "content": "A deeply moving film about desperation and question of whether or not ritualism and rigid codes led to inhuman practices. It's masterfully made and beautifully acted. I must get the Criterion Collection DVD of this. Rarely do films of this type, the so-called \"samurai films\" have this effect on me.",
            "review_date": "2011-07-11",
            "source": "rt"
        },
        {
            "content": "I'm rubbish at long, old, black and white slow-moving Japanese dramas..zzzzz. But this one's a gem.  \r\nUnemployed samurai  have started turning up at feudal lords homes, requesting to commit hara-kiri.  In respect of their honour, they get offered a job instead... but this just encourages more samurai to turn up with the same request. What to do?  \r\nOne house decides to take the next samurai up on his offer and let him kill himself  in the hope of discouraging others.  However the samurai who comes after, has a hidden agenda ...\r\nThe film reminded me of Twelve Angry Men. The whole drama is played out in the rooms and courtyard of the feudal lord (with a few flashbacks) and most of the time is spent in cat-and-mouse dialog as the lord and the samurai try to get the upper hand, one wanting an end to these perky samurai, the other having a story to tell and wanting it heard. \r\nFascinating.",
            "review_date": "2011-06-03",
            "source": "rt"
        },
        {
            "content": "A fantastic anti-samurai film. Nakadai is amazing as always.",
            "review_date": "2011-05-10",
            "source": "rt"
        },
        {
            "content": "Harakiri is one of The most realistic movie i ever seen with very strong story.This movie is easily the best samurai movie ever made,it is a masterpiece by every definition of the word and one of the best storytelling films ever.The main point of the movie is  to expose the inhumanity of a Samurai code vs a strategy based man who wants to survive both physically  and morally.Harakiri is Totally engrossing,memorable and highly recommended for not only for samurai fans this is a must watch for every movie buffs.",
            "review_date": "2011-05-05",
            "source": "rt"
        },
        {
            "content": "Probably the best amongst the samurai movies i ever watched.Seppuku is beautifully crafted and i think its is as good as or even better than many of the works of kurosawa. Absolutely a  must watch for filmbuffs.",
            "review_date": "2011-05-01",
            "source": "rt"
        },
        {
            "content": "\"Wat anderen vandaag overkomt, kan morgen ons lot zijn.\"",
            "review_date": "2011-03-15",
            "source": "rt"
        },
        {
            "content": "\"Harakiri\" tient son nom du fameux suicide rituel d'abord réservé aux samouraï, connu aussi sous le nom de seppuku ! Cela consiste à s'auto-mutiler au niveau du ventre et de la poitrine mais comme cela ne tue pas forcément (ou alors après une très longue agonie), un tiers s'assure de la mort par une décapitation. Est-ce qu'on aura droit à une vision complaisante de cette acte dans le film de Kobayashi ? Est-ce un film qui sert de cour magistral sur les pratiques samouraï ? Du sous-Kurosawa ? Bah non !!! C'est bien au-dessus de tout ça !\r\n\r\nLe personnage principal du film est Hanshiro Tsugumo, un ronin qui cherche en haut lieu la possibilité de faire seppuku. Il trouve finalement un endroit et le seigneur des lieux, sceptique, l'interroge quant à la sincérité de sa requête, même s'il s'avère que Tsugumo pense ce qu'il dit, il lui est quand même raconté l'histoire d'un ronin, Motome Chijiwa, venu avant lui, ayant perdu le même maître, fait la même requête, mais pour qui les choses ne se sont pas vraiment passé comme prévu. Tsugumo affirme ne pas le connaître, mais dit-il vraiment la vérité ?\r\n\r\n\"Harakiri\" a peut-être un titre simple, mais son intrigue l'est beaucoup moins, ce qui semble être une formalité aussi bien pour le personnage de Tsugumo que pour ses hôtes va donner lieu à des histoires bouleversantes sur la famille, la solidarité et l'honneur. Avec un rythme un peu lent mais soutenu, magnifiquement filmé comme si chaque plans étaient des toiles de maîtres dans des décors sans artifices ni fioritures, \"harakiri\" est beau, contemplatif et colle aux personnages dont leur interprétation ajoute à l'éclat de ce film !\r\n\r\nC'est aussi une oeuvre qui tire à boulet rouge sur l'utilisation abusive d'un code d'honneur dont les gens se servent pour laver leurs linges sales en secret. Et c'est pourquoi ce film n'a absolument rien de ringard même presque 50 ans après sa sortie car, cela s'applique aussi bien aux samouraï qu'à d'autres ordres, d'autres personnes pays ou cultures !!! Peu d'action, mais beaucoup de réflextion et de dialogue millimétré qui se suive avec le même regard ahuri que n'importe quel morceau de bravoure, mais on n'est pas fâché devant un acte final renversant et lourd de sens, chargé de symbole (les fusils qui mettent Tsugumo à terre, ce qu'aucune épée n'a pu faire). \"Harakiri\" laisse une empreinte durable chez le spectateur, un grand film, tout simplement !!!",
            "review_date": "2011-02-19",
            "source": "rt"
        },
        {
            "content": "By far the bleakest samurai film I've ever seen. Beautiful cinematography, brilliant acting, brilliant writing, brilliant editing...  One of the best works by Masaki Kobayashi.",
            "review_date": "2011-01-21",
            "source": "rt"
        },
        {
            "content": "This is the best anti-samurai movie I've ever seen, questioning the normal view on the matter. Set in the beginning of the shogunate era, it shows the impact in the social order and the ultimate consequence for becoming \"obsolete\".",
            "review_date": "2011-01-15",
            "source": "rt"
        },
        {
            "content": "Wholly engrossing critique of the feudal system.",
            "review_date": "2011-01-02",
            "source": "rt"
        },
        {
            "content": "I recently watched Harakiri, a 1962 Japanese drama film by Masaki Kobayashi. I must admit that I was in a mindset that Japanese film means- Kurosawa, Mifune and Shimura. But Nakadai's mighty performance in Harakiri proves that he is without any doubt one of best actors in the history of cinema. Unfortunately, he is so underrated!\r\n\r\nSet in feudal Japan this film involves a masterless samurai presenting himself to a powerful clan and asking to commit Harikiri. However, through a series of beautifully knitted flashbacks, we realize that to die in honor is not his only motive. The events that follow are slap on the politics in a feudal system and the hypocrisy involved. Timeless, compelling, poetic, and tragic, the movie has one of the most pessimistic endings ever, which made me wonder how the history is made, how the historical events are interpreted and who decides what would be written in the chronicles. It redefines the word- 'pride'!\r\n\r\nHarakari is simultaneously a samurai and an anti-samurai film. The viewers are bound to look closer at the noble Samurai code of behavior and how its abuse impacts the fate of an individual and the society in general.  The intense sword fights, the court scenes, the flashbacks, and the dutch angled close ups during the Harakiri ritual- it indeed is one of the most horrifying tales of human psyche ever told! This is one film that cuts open your bowels, pulls your soul out, and makes you stare it right in its face!",
            "review_date": "2010-12-31",
            "source": "rt"
        },
        {
            "content": "A great samurai movie by Masaki Kobayashi. AWESOME movie. The movie starts off too damn good and ends well too. The end duel scene is very well shot. GREAT :)",
            "review_date": "2010-12-15",
            "source": "rt"
        },
        {
            "content": "Wow, what a movie! Truly remarkable film. Fight scene at the end really made up for the overall length (a filling 2:15). Can really see much modern influence paying homage (Kill Bill scene at the restaurant). \n\nWay ahead of it's time. Must see.",
            "review_date": "2010-12-15",
            "source": "rt"
        },
        {
            "content": "Not as good as the story of \"Samurai Rebellion\", but exceeding it in certain scenes and an excellent companion piece. Kobayashi is definitely among my favorite directors with the way he uses the camera to draw even more emotion out of a scene, as well as his interesting choice in subject matter. If you're interested in seeing man's inhumanity to man on display, this is your director.",
            "review_date": "2010-12-08",
            "source": "rt"
        },
        {
            "content": "i cant give 5 star but even though it is more than 2 hrs, does not bore and could be, should be, would be part of the classic movies",
            "review_date": "2010-12-05",
            "source": "rt"
        },
        {
            "content": "My personal favorite samurai flick",
            "review_date": "2010-12-01",
            "source": "rt"
        }
    ]
}