{
    "rating": 9.1,
    "release_date": "1964-06-17",
    "num_reviews": 70,
    "genres": [
        "English(UnitedKingdom)"
    ],
    "summary": "In 1879, the Zulu nation hands colonial British forces a resounding defeat in battle. A nearby regiment of the British Army takes over a station run by a missionary (Jack Hawkins) and his daughter (Ulla Jacobsson) as a supply depot and hospital under the command of Lieutenant John Chard (Stanley Baker) and his subordinate Gonville Bromhead (Michael Caine). Unable to abandon their wounded soldiers even in dire circumstances, the regiment defend their station against the Zulu warriors.",
    "reviews": [
        {
            "content": "Fantastic it shows the bravery of both sides in the conflict (although yes it does make the British seem like heros) it's just an amazing film yes the deaths and effects weren't that great but what do you expect it's made in 1964.",
            "review_date": "2023-04-03",
            "source": "rt"
        },
        {
            "content": "One of those films that seems to be timeless. Set in the 1870s helps. No cars or Pop music or city scapes to date stamp it. Good acting at times a bit over done. A who's who of British actors. Caine. Hawkins & Co all compete for the honours. The remake was career suicide for the people silly enough to attempt a remake. You wouldn't do a James Bond remake. Some things can't be improved on so any attempt at doing so is a step backwards. This is a 90% film. A film you actually watch and not just have on to fill some time in. A Saturday night film if ever there was.",
            "review_date": "2023-02-21",
            "source": "rt"
        },
        {
            "content": "Such an underrated movie! Definitely a must see, If you encounter somebody who has not seen this movie who is interested in military history show them this.",
            "review_date": "2023-01-18",
            "source": "rt"
        },
        {
            "content": "What a masterpiece! Brilliant film one of the best war movies ever made.",
            "review_date": "2022-12-29",
            "source": "rt"
        },
        {
            "content": "There's no way any studio would make a film like this today.  A European colonial army acting bravely in Africa?  It's too politically incorrect.  However, the Zulu warriors are depicted as acting valiantly as well, and if you can ignore the question of whether the British had any business being there in the first place you're in for a first class war film.  The film builds suspense for the big battle scene, and the battle scenes themselves are excellent.  Despite some sanitized effects - people get shot all over the place but you see very little blood - the battlefield is populated by hundreds of extras, not CGI cutouts.  They don't make them like this any more.",
            "review_date": "2022-12-17",
            "source": "rt"
        },
        {
            "content": "Wow....The scale of this is the very definition of a Epic Film. The acting across the board is phenomenal with lots of good chemistry among the all star cast with fantastic dialogue. (Such a good choice to have Richard Burton do the narration with his distinct voice) The cinematography, it is not an overstatement to say this is one of the most gorgeous and breathtaking films I have ever seen. The sheer scale and scope of the battle and backgrounds give such weight to the battles and story. The music is phenomenal with a unique blend of traditional war scores and African Battle Hymns...its such a eerie, epic and memorable sound. The editing is very well done really the only minor complaint of the whole film is during the first half after they the Reverend leaves the camp and we get introduced to the enlisted soldiers it can feel like there isn't any cohesive narrative for a good 20 minutes but it's still well done nonetheless. The pacing is phenomenal with the last hour being a battle of truly epic scale that is nonstop and never feels over the top or pointless which is a remarkable achievement. Sometimes also the accents can be a bit hard to understand with some characters more than others but that's not the films fault that's just my ignorance being American lol. Everyone should watch this once and use subtitles. An All Time Classic.",
            "review_date": "2022-12-04",
            "source": "rt"
        },
        {
            "content": "A stunning film with great cinematography that tells a remarkable true story. Action scenes are not up to modern standards. Great characters (though one sided as the Zulu are treated with respect but no individual characters).",
            "review_date": "2022-09-30",
            "source": "rt"
        },
        {
            "content": "One of my all-time favorite war movies.  A little bit dated, perhaps, but still great action and drama.",
            "review_date": "2022-08-31",
            "source": "rt"
        },
        {
            "content": "jolly good show! Perfect depiction of ISandlwana. There is no other available!",
            "review_date": "2022-07-09",
            "source": "rt"
        },
        {
            "content": "One of the great movie battle scenes of all times. The acting by Stanley Baker and Michael Caine along with the real Zulu warriors chants when preparing battle are real. This is according to a friend from South Africa who worked on the set during the outdoor filming in South Africa. He told me they had to set up a special medical center to stitch up minor wounds on over zealous Zulu warriors during the filming.  The Zulu short spears and shields were real and the property of the individual Zulus",
            "review_date": "2022-06-21",
            "source": "rt"
        },
        {
            "content": "I remember the directing of the scenery as well as the build-up to the battle scenes being pretty good. It was a movie with stakes at some parts for sure, however other parts such as the actual battle scenes were really unconvincing and laughably fake (when it showed people getting stabbed with a blade going to their side and dramatically showing that they got stabbed in response). I don't normally make this kind of commentary much but look at when this movie came out and how it ended. One could say that the film was a reflection of the racist backlash toward African-Americans participating in the civil rights movement who were fighting for freedom/equality, autonomy, and justice, just like the native Africans were trying to do in this movie for their own land. The Africans ended up losing on their own territory and not gaining what they deserved to begin with but instead bowed down in defeat to the white people. Even people who love this movie have to admit to that connection.",
            "review_date": "2022-05-01",
            "source": "rt"
        },
        {
            "content": "Great movie about the heroic battle at roukes drift . With caine and baker starring with an excellent supporting cast. Great battle scenes .",
            "review_date": "2021-11-30",
            "source": "rt"
        },
        {
            "content": "The breathtaking story of Rorke's Drift with Michael Caine giving the performance of his career. Stunningly realised, the film seems years ahead of its time in terms of its sophistication.",
            "review_date": "2021-11-16",
            "source": "rt"
        },
        {
            "content": "Brilliant movie, truly inspiring",
            "review_date": "2021-11-11",
            "source": "rt"
        },
        {
            "content": "One of the best, everyone should have the DVD",
            "review_date": "2021-10-17",
            "source": "rt"
        },
        {
            "content": "Thrilling military strategy at play!\n\nCy Endfield's historical war epic Zulu (1964) really aged well. You see the British and Welsh soldiers fighting alongside one another despite their difference with a realistic depiction of Western military tactics and formations on display as the Battle of Rorke's Drift. Endfield directs Zulu with history and entertainment in mind as you get to see the rows of British flanks fire and reload along the North and South defensive walls while Zulu braves swarm in huge numbers in clever waves. Stephen Dade's cinematography is amazing with long panning shots of sweeping natural terrain. Zulu looks gorgeous. John Barry's music is a triumphant and ominous score full of sweeping melodies and bombastic noise. After all the engaging warfare, you're left to wonder why England even in Africa for Imperialism? What was the point of all this bloodshed?\n\nCy Endfield's direction acquaints you with these rough brute Brits for the first hour so you get the layout of this outpost, then the last 70 minutes is all gripping action. It's a shame Endfield was blacklisted in America as a \"Communist,\" otherwise we could have gotten more films from him as he had to flee to England to film great pictures like Zulu there. John Jympson's editing cuts neatly across the battlefield for 138 minutes that goes by quickly.\n\nJohn Prebble and Cy Endfield's script also fairly portrays the Zulu warriors as brave, determined, with advanced military strategies of their own. It's fascinating to see a mostly historically accurate depiction of British forces defending a Natal outpost during the Anglo-Zulu War in 1879 when they are vastly outnumbered. Zulu is astonishing in scope with scores of extras in gigantic encounters. Care to watch 139-141 men approximately defend against 3,000 to 4,000 Zulu warriors?\n\nMichael Caine is fantastic for such a young man when he portrayed Lieutenant Gonville Bromhead as eager for glory and arrogant for command. He is a real presence with his sly jabs and huge commands. Caine was born to be a star as evidenced in Zulu. Stanley Baker is excellent and interesting as Lieutenant John Chard, who was an engineer in charge of building a bridge, then he must take command to defend against the incoming 4,000 Zulu braves. His insecurity, uncertainty, and nervousness is intriguing, especially when he must be brave himself and stand up to Michael Caine and insubordinate men.\n\nJack Hawkins is fun as the raving mad missionary Otto Witt, who preaches peace and religion during a war. Iconic Swedish actress Ulla Jacobsson is drop dead gorgeous as the goodhearted, if naive daughter of the missionary named Margareta Witt. She delivers real empathy, but to no avail as this is a war that will be fought.\n\nJames Booth is a real jerk as the selfish Private Hook and Nigel Green is highly entertaining as the strict Colour Sergeant Frank Bourne.\n\nIn all, Zulu is a timeless war giant that is sure to shock any viewer when they see the odds.",
            "review_date": "2021-07-09",
            "source": "rt"
        },
        {
            "content": "Yes, yes, it's idealised 'history', and we Brits are really the bad guys, but you know what?  I don't care!  A small band of mostly misfit soldiers stand against a mighty enemy (the Zulus are shown to be brave men, and valiant warriors) and eventually survive.  Great set battle scenes, and music.  For me, the show is stolen by my personal hero, Colour Sergeant Frank Bourne.  Possibly Jason's great-great-grandfather.  Yes, he's that hard!  Perfect for an afternoon on the sofa with popcorn.  Zulus sir, thousands of 'em......",
            "review_date": "2021-02-26",
            "source": "rt"
        },
        {
            "content": "This legendary piece of film-making is as good as it gets on every level. The actors performances are faultless, the scenery breath-taking and the story is all the more incredible because it really happened. Allow the odd historical inaccuracies and just imagine how you would have reacted given the circumstances these soldiers found themselves in. A film that defies a remake on the premise that you cannot improve on perfection. Nuff said!",
            "review_date": "2020-12-30",
            "source": "rt"
        },
        {
            "content": "A very cinematic interpretation of the Battle of Rorke's Drift, Zulu is positively brimming with wide landscape shots, carefully choreographed battle scenes, and characters that are given enough distinctiveness to craft a winning narrative (the independently-minded rogue vs. the authoritative sergeant, for instance), even if some artistic license was apparently taken on this account. Still, the film is limited by the technology of its day, and much of the hand-to-hand combat is rather poorly executed. The playful antagonism between Caine and Baker's characters is great, and the film notably stands out for building up minor subplots such as this (along with Reverend Witt's appeal to religious morality) before dashing them all in the face of overwhelming and prolonged combat. The film does take far greater care to place due respect to the capability of the Zulu warriors than might be expected for a film of the period, though it does sidestep the historical context that places the Zulu people as simply reacting to hostile combatants provoking them in their own homeland, and thinking about the engagement as a conflict between a contingency with state of the art weaponry vs a force whose kit consisted predominantly of a spear, shield, and loincloth does knock the argument of numerical superiority down a peg or two, doesn't it? (3.5/5)",
            "review_date": "2020-11-22",
            "source": "rt"
        },
        {
            "content": "Just great classic movie and lots of entertainment",
            "review_date": "2020-09-19",
            "source": "rt"
        },
        {
            "content": "This is my favorite movie of all time. And \"Introducing Michael Caine\"! Fantastic recreation of an historical event. Natal Province is beautifully filmed. Anti-colonial and even anti-war, dare I say. But fantastic action and character development. Men behaving well under unbearable strain, for a change...",
            "review_date": "2020-09-17",
            "source": "rt"
        },
        {
            "content": "I'd recommend that you watch this film. It's great",
            "review_date": "2020-09-09",
            "source": "rt"
        },
        {
            "content": "One of the best films ever made.",
            "review_date": "2020-08-26",
            "source": "rt"
        },
        {
            "content": "Despite the RT criticisms, the movie was, by Hollywood's fungible historical standards, a fairly accurate depiction of the battle.  The combat scenes inside the hospital are worth the price of admission alone.",
            "review_date": "2020-08-04",
            "source": "rt"
        },
        {
            "content": "As a student of the Zulu wars,I can certify that this movie is remarkably realistic and accurate in its portrayal of the Rorke's Drift action.Although some of the characters are \"prettier\" than the persons they are representing, I think this is allowable, but the action follows very closely the actual events.An excellent movie and highly recommended.\nFor an interesting lead-up, \"Zulu Dawn\" should be watched.",
            "review_date": "2020-08-01",
            "source": "rt"
        },
        {
            "content": "Based on the true story of the battle of Rourke's drift. This is how 150 British soldiers held out against countless brave Zulu Warriors in Zulu Land. Classic cinema. Star performances. This film gets the audience to respect both sides. 1879 south Africa. An un easy truce between the Zulu empire and the British Empires existed with relative peace for some time. Border clashes happened due to the discovery of diamonds in Kimberley. The Zulus had to fight to preserve their own way of life. Which was a brutal warrior culture, similar to the ancient Spartans of Greece. The film respects the Zulu and does them justice. And when anyone in the film dismiss them as a \"bunch of savages\" there is always someone to correct them. Bare in mind when this film was released. And the context, it would have been easy to be basised against the Zulus. But that's not the case. The British fought for their lives and the Zulus, to defend their way of life. The two British officers are great characters. They have two different personalities. Conflicting with each other. One, a pompous man of privilege. The other is a more down to earth officer who may have risen from the ranks. But its Bromhead, the pompous one, played by Sir Michael Caine, who grows the most. \n\nWatching the Zulus play psychological warfare by chanting, singing, and smashing their shields together. Its very cool. Showing the Zulus tactics like the \"horns of the buffalo\".. a tactic development by Shaka Zulu at the very start of the Zulu Kingdom. This tactic secured them an Empire. The British also use their own tactics which also secured them an Empire. The greatest empire the world has ever seen. \n\nThe greatest scene in the film is when  the Zulus  and the Welsh soldiers  start singing. Its amazing. Singing an old Welsh song called \"Men of harlech\"\n\nAfter the battle is over there are no cheers from the British soldiers. They are not happy. They are just thankful to be alive. \n\nNot all the film is accurate. Some things in the film simply didn't happen. The sing off didn't happen. At the end the Zulus saluting  the British out of respect. That didn't really happen either. The zulus didn't  retreat out of respect. They retreated because they where not suppose to be there. The Zulus didn't want to give the British a reason to invade. It's only a couple small historicall inaccuracies. And none of them are insulting to either side. The Zulu king approved of the film and even attended the premiere. All in all? It's a great film.",
            "review_date": "2020-01-21",
            "source": "rt"
        },
        {
            "content": "A stirring, tension-filled action movie showing the tenacious courage of the British defenders against the accomplished and courageous Zulu warriors shows a refreshing balance in terms of respect for each side in what was a fairly unimportant engagement, were it not for having occurred a day after Isandlwana, one of the British Army's worst defeats of the colonial era. So it's all about pride; for the Zulu impi involved, the fact that it had been held in reserve at Isandlwana and hadn't 'washed its spears' and for the British, a chance to regain some pride in their fighting prowess after the disaster. \nFor students of history, the movie is awash with errors; the 24th of Foot were not a Welsh regiment at the time; Private Henry Hook had an impeccable record and would go on to further good service; Reverend Witt wasn't there during the siege and Colour-Sergeant Bourne, so magnificently played by Nigel Green in the movie was, in truth, only 22 years old and the youngest Colour-Sergeant in the British Army at the time. But these facts aren't criticisms of the movie's accuracy, merely grist to the mill of historical purists.",
            "review_date": "2020-01-13",
            "source": "rt"
        },
        {
            "content": "A true classic, great battle scenes and accuracy",
            "review_date": "2019-03-03",
            "source": "rt"
        },
        {
            "content": "You don't know your courage and fortitude until you are forced to use it. There are a lot of interesting and clever tactics used by the Zulu generals in the movie, and it's fascinating to watch. As a war film this was quite an interesting one for the fighting sequences specifically, but less so for the script. Michael Caine and Nigel Green put in a hefty performance each, but the film still ends up less interesting than other films in the same genre. It doesn't help to watch the blatant racism and sexism either to make you root for the British side of things. The main thing to laud here is the same thing that the Zulus lauded, the bravery of fellow warriors.",
            "review_date": "2019-02-23",
            "source": "rt"
        },
        {
            "content": "For a movie that's over 50 years old it still holds an interest. ",
            "review_date": "2019-02-06",
            "source": "rt"
        },
        {
            "content": "Another Historical masterpiece which tires to be authentic and doesn't try to be biased when it comes to warfare it simply shows soldiers trying to survive it is a movie for anybody who is interested in the past with an unbiased view.",
            "review_date": "2018-11-19",
            "source": "rt"
        },
        {
            "content": "On the 22nd of January 1879, a force of 20,000 zulu warriors massacred 1,700 british troops on the slopes of a hill known as Isandlwana in the Kwazulu-natal province of South Africa. a small group of survivors escaped from Isandlwana and made it to a British army hospital and supply depot that had been set up at the Rourke's drift mission station. there were just 122 soldiers at Rourke's drift, many of them were either sick or wounded. the senior officers commanding the station made the decision to stay and fight as they concluded that the wounded and sick would stand no chance out in the open against the advancing Zulu's. defensive positions around the station were quickly established. the Zulu's arrived at the station at 4 pm on the 22nd and commenced their attack. this film gives you an impression of the fighting that took place over the ensuing 12 hours. Zulu is a timeless masterpiece of cinema. I have lost count of the number of times I have seen this film since it first came out in 1964. I always find something new to take away from the production with every viewing.",
            "review_date": "2018-07-15",
            "source": "rt"
        },
        {
            "content": "Unusually for an action movie and perhaps this films greatest assets is its intelligent and RESPECTFUL depiction of the Zulu enemy. Featuring Michael Cain in this breakthrough role, Stanley  Baker leads a great assemble which who carry the day with a winning combination of stiff upper lips and Welsh sinning!",
            "review_date": "2018-06-09",
            "source": "rt"
        },
        {
            "content": "An absolute Classic, what few minor historical leniency it takes do not hurt the accuracy and only enhance the story, amazing acting, amazing action, abit slow at times, a true classic",
            "review_date": "2018-02-07",
            "source": "rt"
        },
        {
            "content": "An all time great and must see.",
            "review_date": "2018-01-21",
            "source": "rt"
        },
        {
            "content": "these zulus are bloody savages!",
            "review_date": "2018-01-08",
            "source": "rt"
        },
        {
            "content": "Great movie. Well acted.",
            "review_date": "2017-05-15",
            "source": "rt"
        },
        {
            "content": "A fascinating and well-made historical film (although the fighting is cheesy at times--people drop dead from tiny pokes that wouldn't break the skin). It leaves you with a strange feeling. You root for the \"underdog\"--the vastly outnumbered British army--knowing the subsequent history of South Africa, you know the Zulu and other Africans wouldn't fare well under the British or Dutch. It still treats the Zulu people reverently, and the performances all around are top-notch.",
            "review_date": "2017-04-18",
            "source": "rt"
        },
        {
            "content": "Well, for a war movie, it's pretty slow, nothing very interesting really happens during the first hour. But, Stanley Baker, Nigel Green and Michael Caine lead this movie into being an interesting movie on a certain negelected moment of war. Although, the war action and fighting is done in a very corny old way, but for the time, it's very impressive, and it must've taken a lot of work to do. Recommended !!",
            "review_date": "2017-03-13",
            "source": "rt"
        },
        {
            "content": "This is one of the most thrilling war movies ever made.  The acting, directing, story line, and action definitely make this a fully riveting film.  It has always been one of my favorites.",
            "review_date": "2017-01-05",
            "source": "rt"
        },
        {
            "content": "An action packed war epic, Zulu is an extraordinarily entertaining film with a resonant message about violence.",
            "review_date": "2016-10-29",
            "source": "rt"
        },
        {
            "content": "A classic movie, clever action, a great story. Fire!",
            "review_date": "2016-09-24",
            "source": "rt"
        },
        {
            "content": "Tribal bodies are swimming through weeds over sharp-edged mountains to battle at red coats with patterned shields and unmagical scepters, ruining their mud hospital with languages of heat in tongues of flames against ruined alcohol.  One crazy soldier relishes shaky sips from a smoked vial before living his then nightly daze of the Zulu Tribe's rapid marches however awkward and to the point the folks with ash'd skin, the British fools, absorb their gravity by stomping hills and working guns out formal piles of weapons.  Someone's after royal badges and will leave them in hot dust, only to help a tribe with ammo of the warring dead inside the great outdoors.  So, what's the brush at their ankles?  The late 1800's is an eclipse of races which hurts the eyes of crude soldiers on this unfair couple of days; in particular to \"crude sagacity of dominance\" by the British and the Zulu Tribe's sundances of warfare, the white and the black are in their own melting pots even if some of their kins will become supper for the Earth to cherish their rotten muscles.  At this point, a fancy hat is hardly a shield when its down shadow looms over places with wild toasters; if one army gives a salute, the other army thinks its pretension.  The British armies put so much harm on other armies as well as themselves, and plenty of British residents today are more worried about the names of things; in other words, names that mean nothing.  It doesn't matter if God's name is Jesus; people are dying here!  Army movements here are either lucrative or diminished soon, bodies flowing over golden weeds of bloody waste, treading on a bright planet during momentary hours of peace when even a wild cat with a fuzzy knob of a dangerous tail hurries against lazy gunshots on divided paws.  There's something rich about sunlight as it hits Mr. Caine's temple, so I remark here on the mysteries of shadows and try to define them: slight at moments, dark against flames, becoming ingredients to humanity's melting pots while turning the spectrum of hate into something massive: the eclipse of a smile beyond a fighter's gasping approach, switching her or his face's reflections of odor into resounding thuds of psychological impediments.  Everything has a smell, lots of colors, becoming mediums for camera angles; at least, everything shown.  When pleasure exists for a soldier, something has to give.  Consider this blue sky land as the azure colors of the horizon change gradually with the soaking dips of history; a commonplace historian might say that the Zulu Film is historically accurate on a mild summer day, horrible coffee in hand, reading the newspaper while being a blithering pedant of familiar objects.  DVD's permanent at all in small ways signify little; reality changes, and millions of seeds die in the womb before anybody is born.  The Zulu Tribe resists goofy temptations to launch as imbecile fools; war is a poor accolade since, quite simply, plenty of sides are wrong, the right sides destroying humans like bugs as if deer look at them too closely.  What's notable here is that the British army and the Zulu army own materials that aren't weapons, so their patronizing arrogance lives on for some expert kinds of materialism; what's ironic here is that the actors have to act out pompous stubbornness by being less self-disdainful and livelier in probable tunes of physics for fictional, historical spirits.  Of course, it's not that clothes mean nothing; it's that wearable uniforms exist on people's figures in spite of most bodily actions.  I know that golf channels advertise clothes; businesses accidently imply that materials are behaviors, so indeed actors must constantly struggle against the urge to run on happy dreamlands when reality is screaming at their faces.  History movies of very many kinds have to serve as fictional obras which still get at the partial truths with special information: a deniable plot, more questions, examples laminated in video forms, requisite camera angles rather than perfect ones ever, inscribing technological descriptions of conditioned monsters across the sands of time with presentations that may make you queasy yet soothe my attention spans.  Africa has its blinds of madness which are constantly downplayed by the African tribes' gay wits; I've watched so many cheap documentaries about tribes in Africa, and \"Zulu\" has reasonable physics since one of its creators for the movie for sure had the learned help of studying tribal rumors about foul play and forced kinds of understanding for armies.  I actually consider an African tribe as a kind of army.  I'm the kind of guy who listens to foreign languages even if I don't naturally speak them (sometimes I make up sounds); not only there's those profits of visual learning when I ignore my own desires sometimes, but nations of cultural types of charm if occasionally failing to be inevitable dominance or imprisoning submission gear themselves for troublemakers.  In one of the beginning legend slots of \"Zulu,\" a Zulu Warrior tugs at the clad dress of a prestigious, temperamental woman prior to his inconvenient death by a quick spear, chanting a showy song that is unwelcoming for the Zulu Tribe's reunion celebration.  What if a leader is like some butler for our privileges?  I'm most certainly not in that much glee for American Freedom when it's defined by world leaders through personal tastes and exotic reasons; let's amplify \"Zulu\"'s involving meanings or else dispute with ourselves how we live while others suffer.  There's this unmelted exchange by the British Army and the Zulu Army between freedom and compassion, shared context of meaning possibly illusionous because of intense whispers between soldiers and battle-cries among warriors.  An arbitrary motive that a historian can have is often needed in order to define the truth with optional bias; however alas, some political thinkers are horrible philosophers because they're bad anthropologists constantly feeling the need to pick sides without being so careful due to lack of descriptions.  Once I had a black preacher at a ghetto church who told the doubtful crowd to drink the Bible; I'm still drinking it, but humanity at large is still open and long for me to handle, and \"Zulu\" is a tough poetry source of shattered alcohol and tattered sundances.",
            "review_date": "2016-08-26",
            "source": "rt"
        },
        {
            "content": "A fun movie despite it myriad of issues. It's Michael Caine in a red Victorian jacket, people!",
            "review_date": "2016-02-09",
            "source": "rt"
        },
        {
            "content": "Tarda en arrancar, pero una vez en faena el espectáculo es inolvidable.",
            "review_date": "2015-08-23",
            "source": "rt"
        },
        {
            "content": "Great story telling with a fine cast and some of the best battle scenes.",
            "review_date": "2015-08-20",
            "source": "rt"
        },
        {
            "content": "Tegnap a Film Café esti repertoárjában sikerült elcsípni ezt az üde és friss darabot 64-b?l. Az üzenete világos: ne szívózz a britekkel, mert hozzák a haverokat és beütik az arcod. Még akkor is, ha a saját földedet véded ellenük, ahol egyébként semmi keresnivalójuk.",
            "review_date": "2015-06-26",
            "source": "rt"
        },
        {
            "content": "Has one of the most fascinating battle sequences put to film. I loved the scene where Caine says the Africans are mocking them with their music, but the other guy says the Africans are saluting them for fighting so well against impossible odds. \n\nI doubt a movie like this could get made today where without context I couldn't help think people might overreact and call it racist. If the movie wasn't bloodless I'm not sure if it could have been made in 1964. Or maybe I'm the one overreacting thinking society is too sensitive. Anyway, great movie and it's good to see Caine in a movie where he lets loose a little and doesn't seem so stiff. The man was born to play Alfred in the Batman movies.",
            "review_date": "2015-03-25",
            "source": "rt"
        },
        {
            "content": "The most rousing war film ever, Great cast , Very good score, and singing too.",
            "review_date": "2015-02-16",
            "source": "rt"
        },
        {
            "content": "Best action movie ever. The suspense will have your heart beating louder that the Zulu warriors beating their shields!  A hundred Redcoats with single shot Martini-Henry rifles defeat 4,000 Zulu warriors armed with over 1,000 of the same rifles.  Michael Caine's first movie and a testament to the bravery of the Zulus.",
            "review_date": "2015-01-19",
            "source": "rt"
        },
        {
            "content": "So dated especially the comedic dying aka acting. But the characters are two - dimensional and you can't help rooting for them. It is an unbelievable story that dras you in. \n\nCaine displays his early promise and Baker is at the top of his game. For its time also pretty even handed - this is no Colonial apologist.",
            "review_date": "2015-01-04",
            "source": "rt"
        },
        {
            "content": "one of the best films ever. A pinnacle of film making.",
            "review_date": "2015-01-03",
            "source": "rt"
        },
        {
            "content": "One of my favourite films. The classic formula of background, build-up, heightened tensions and culmination, in a closed environment. The portrayal of  Hook was shameful however, so maybe a remake is due, alas Follywood would probably be even more slanderous in the face of dramatisation. \"You're all going to die!\"... as ever, the god believers are wrong. ;)",
            "review_date": "2015-01-03",
            "source": "rt"
        },
        {
            "content": "One of the best war moves ever made and one that still stands up after fifty years. Plenty of heroes, but no silly villans.",
            "review_date": "2014-12-31",
            "source": "rt"
        },
        {
            "content": "I don't really understand how critics loved this movie. It's not horribly bad, but I find that the big problem is the film's pacing. The film constantly alludes to a battle that happens later in the film, but spends half of it hanging around in the soldiers' quarters. It seems very pretentious that the film delays the fighting, but then again, a lot of historical films did this, and probably still do this today. To top it all off, the film is riddled with historical inaccuracies, to the point that I can't actually go into detail. Meanwhile, the performances are actually quite good, though the film's horrid pacing does not help the cause. The only thing that does help, however, are the film's picturesque visuals, which bring the film's setting to life when the acting fails. This is the kind of film that tries to be a grand historical recreation, but it suffers because of this pretention of grandeur. After all, if I can't enjoy the grandeur, then what's so grand about it?",
            "review_date": "2014-12-27",
            "source": "rt"
        },
        {
            "content": "The epic photography, acting and attention to detail make this a wonderful film worthy of multiple viewing. The only reason I give it 4.5 not 5 stars is that I think it would have been even better without some of the factual changes. The soldiers were mostly from a Warwickshire regiment rather than Wales; Otto Witt was younger and left to join his family at a nearby farmstead; Hook was not a malingering rogue; there were native Natal forces fighting with the British; the Zulus did not sing to salute them but because they were short of supplies and a relief column did appear; starting with 20.000 rounds the defenders ended with only 900! \n\nHowever, the basic story is told accurately and the attack on the hospital is more or less exactly what happened as was the retreat to the inner redoubt. In fact, there's so much detail in this film it could well have been longer rather than shorter.\n\nThose that complain about colonialism, racism and sexism in the film miss the point. This film tells it as it was and I think is probably the most accurate film of a single battle that has ever been made. In retrospect Michael Caine is given top billing but this is surely Stanley Baker's film from start to finish.\n\nIn reality, the colour sergeant eschewed a VC and asked for promotion instead. He went on to be a Lt-Col and was the last survivor of the battle to die aged 91!",
            "review_date": "2014-12-27",
            "source": "rt"
        },
        {
            "content": "In 1879, a communiqué from Lord Chelmsford to the Secretary of State for War in London, details the crushing defeat of a British force at the hands of the Zulus at the Battle of Isandlwana. In the aftermath of the battle, the victorious Zulus walk amongst the scattered bodies of dead British soldiers and gather their rifles. At a mass Zulu marriage ceremony witnessed by missionary Otto Witt (Jack Hawkins) and his daughter (Ulla Jacobsson), Zulu King Cetewayo (Chief Mangosuthu Buthelezi) is also informed of the great victory earlier in the day. A company of the British Army's 24th Regiment of Foot, is using the missionary station of Rorke's Drift in Natal as a supply depot and hospital for their invasion force across the border in Zululand. Receiving news of Isandhlwana from the Natal Native Contingent Commander Adendorff, who warns that an army of 4,000 Zulu warriors is advancing to the British position, senior officer Lieutenant John Chard (Stanley Baker) of the Royal Engineers assumes command of the small British detachment. Lieutenant Gonville Bromhead (Michael Caine), an infantry officer, is rather put out to find himself subordinate to an engineer due to the latter's slightly earlier commission. Realising that they cannot outrun the Zulu army with wounded soldiers, Chard decides to fortify the station and make a stand, using wagons, sacks of mealie, and crates of ship's biscuit to form a defensive perimeter. Witt becomes drunk and demoralises the men with his dire predictions, causing the soldiers of the Natal Native Contingent to desert. Chard orders him to be locked in a supply room. The soldiers begin to feel nervous when they hear a strange beating sound coming towards them. They realise the sound is the Zulu army. Although the army is not yet in sight, they hear the sound of the Zulus beating their shields with spears. Bromhead says 'it sounds like a train in the distance'. As the impis approach, a contingent of Boer horsemen arrives. They advise Chard that defending the station is hopeless. They retreat in haste, despite Chard's desperate pleas for them to stay. The Zulu army, having formed a line of attack along the Oscarberg, approach to within 100 yards (91 m) of the station, ominously rattle their spears against their shields, and then charge. The British open fire and manage to kill at least 60, but Adendorff informs them that the Zulus are testing the British firepower. Witt again predicts the soldiers' inevitable fate, before escaping the battle with his daughter; this causes further demoralization of the defenders. Chard is concerned that the northern perimeter wall is undermanned but realises that the attack will come from all sides. The defenders are surprised when the Zulu warriors open fire on the station with rifles, taken from the British casualties at Isandlwana. Zulu fire inflicts minimal casualties but further affects the morale of the British defenders. Throughout the day and night, wave after wave of Zulu attackers are repelled. The Zulus succeed in setting fire to the hospital, leading to intense fighting between British patients and Zulu warriors as the former try to escape the flames. Private Henry Hook (James Booth) takes charge and successfully leads the patients to safety.The next morning, the Zulus approach to within several hundred yards and begin singing a war chant; the British respond by singing \"Men of Harlech\". In the final assault, just as it seems the Zulus will finally overwhelm the tired defenders, the British soldiers fall back to a small redoubt constructed out of mealie bags. With a reserve of soldiers hidden within the redoubt, they form into three firing ranks, and seamlessly pour volley after volley into the waves of attacking warriors, inflicting heavy casualties. Finally the remainder of the Zulu forces withdraw. After sustaining no attacks for three hours, the defenders are still recovering when the Zulus re-form again on the Oscarberg. Resigned to their imminent defeat, the British are astonished when the Zulus instead sing a song to honour the bravery of the defenders before peacefully withdrawing...\n\n\"Zulu\" is one of those epic lavish costume dramas from the 60´s and it´s nicely shot with beautiful sceneries and strong performances from the actors including a young Michael Caine. Michael Caine, who at this early stage in his career was primarily playing bit parts, was originally up for the role of Private Henry Hook, which went to James Booth. According to Caine, he was extremely nervous during his screen test for the part of Bromhead, and director Cy Endfield told him that it was the worst screen test he had ever seen, but they were casting Caine in the part anyway because the production was leaving for South Africa shortly and they had not found anyone else for the role. And despite the fact that the director took some creative freedom with the true story, this is yet a powerful piece with historic roots. Most of the characters in the film were based on actual participants of the battle, but their behaviour is mostly fictional - something that has provoked disapproval: in an interview on the DVD, the descendants of Private Hook objected to his portrayal as a thief and malingerer (although his character acts bravely near the end of the film during some desperate fighting). Indeed, Hook's elderly daughters walked out of the film's 1964 London premiere. My only objection to \"Zulu\" is the quite \"theatrical\" battle scenes that hardly convince anyone in 2014.",
            "review_date": "2014-11-09",
            "source": "rt"
        },
        {
            "content": "one of the best movies ever. visual effects are a bit dated, but really this movie could not be redone any better.",
            "review_date": "2014-10-03",
            "source": "rt"
        },
        {
            "content": "Out on the dusty African plains a small group of British and Welsh soldiers stand pat to fight thousands of angry native types (imagine Custer winning The Little Big Horn) . Michael Caine's first up in the big leagues is a memorable actioner about resolve, courage and grit in the face of overwhelming odds. Released in 1964 it doesn't contain the blood orgy saturation we've come to expect of modern cinema (or even television for that matter!), nor is anyone human save the white people (and this despite long lingering opening shots of topless tribeswomen dancing! - National Geographic-style soft porn), but the thrills work nonetheless.",
            "review_date": "2014-09-23",
            "source": "rt"
        },
        {
            "content": "This movie makes what was a relatively small battle into an epic struggle with great acting from all of the actors no matter how big or small the parts they played were.",
            "review_date": "2014-07-07",
            "source": "rt"
        },
        {
            "content": "Normally, I can't stand imperialism in Africa, but I like how at the end the British and the Zulus subsided their differences.",
            "review_date": "2014-05-26",
            "source": "rt"
        },
        {
            "content": "Once a daringly-grand show piece Zulu has lost a lot of its punch over the years, reducing its impact against the modern movie goer who is used to huge sets and grand movie budgets. Despite this its still a good piece of Golden Age Brit cinema that's worth a look for anyone with good taste in cinema.",
            "review_date": "2014-05-18",
            "source": "rt"
        },
        {
            "content": "I personally rooted for the Zulu to kill all the racist, imperialist British.  I won't spoil the ending, but it is true to history, somewhat.  Some of the fighting scenes look a little lame today, but it's entertaining and the hour-long buildup did not bore me.  So blimey, this is a dandy film.  Cheerio brave chaps.",
            "review_date": "2014-05-15",
            "source": "rt"
        },
        {
            "content": "I used to watch this as a kid on Sundays with my father. It was always on TV for some reason. It's a pretty sad movie and i'm sure i've watched it more times than i've ever wanted to but it was always engrossing if you were patient enough with it. There's great scenes that look beautiful and Michael Caine is pretty good, not that i'm much of a great fan of his, but he was okay. It's just sad, that's all i can say.",
            "review_date": "2014-03-06",
            "source": "rt"
        },
        {
            "content": "Not as grand or moving as some other epics of the day, but Zulu is a large drama that takes its historical tale seriously and takes its time in preparing us for just one battle. One very big battle. Historical inaccuracies aside, of which I'm aware there are many, Zulu is enjoyable if only for the question of how Baker and Caine are going to hold off 4000 Zulu warriors with only 100 British soldiers, some wounded or sick. Goes to show how defensive positions and guns over spears can grant huge advantages. The cinematography does justice to the landscape and the characters often bring color to the otherwise blues and greenish grays of Africa. Caine is not the Michael Caine you know today but much younger and in an arch of carefree officer to embattled brave warrior. Jack Hawkins plays the reverend wonderfully but as this is the only representation of the Church in the movie and it's inaccurate, I found Hawkins' character greatly annoying and a flaw in the movie. Ulla is beautiful but underused. Not one of the pillars in historical films but a solid effort that I can check off the list.",
            "review_date": "2014-03-05",
            "source": "rt"
        },
        {
            "content": "When looked at in terms of the depiction of tactics, Zulu both suceeds and fails to capture but when seen from the aspect of the period in which is was filmed, one can truly admire the film and the grandeur it portrayed.\nOne of the nice aspects of Zulu is seeing a very young Michael Caine in one of his earliest acting roles and possibly the film that launched him into stardom. By todays standards his performance might not seem like much but there's no dennying he does command the screen.\nZulu is highly enjoyable warfare made entertainment and a recommend to any fans of the genre or classic films. Modern day audiences will likely find the pseudo violence silly, the acting stiff and the overall look of the film as being too old... but that's their loss not mine.",
            "review_date": "2014-02-17",
            "source": "rt"
        },
        {
            "content": "A very well produced, shot, and acted film about courage, resilience and pride. It's kindred spirit is letters from iwo jima.",
            "review_date": "2014-02-08",
            "source": "rt"
        },
        {
            "content": "A great British movie with an assembled British cast retelling the story of Rorke's Drift and the events that ensue there on January the 22, 1879 when a handful of British Soldiers stood against an army of 4,000 Zulu warriors and won the day.",
            "review_date": "2013-12-01",
            "source": "rt"
        },
        {
            "content": "best film iv ever seen, james booth (hookie) is great, Stanley baker, nigel green are on top form, always worth watching.",
            "review_date": "2013-11-10",
            "source": "rt"
        },
        {
            "content": "let's just say I won't watch it again.",
            "review_date": "2013-10-06",
            "source": "rt"
        }
    ]
}