{
    "title": "Ninja Scroll",
    "rating": 7.8,
    "release_date": "1993-06-05",
    "num_reviews": 129,
    "genres": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "summary": "A vagabond swordsman is aided by a kunoichi and a spy in battling a demonic clan of killers - led by a ghost from his past - who are bent on overthrowing the Tokugawa Shogunate.",
    "reviews": [
        {
            "review_title": "The leash has come off.",
            "content": "Jubei, a rouge samurai who's wandering the land becomes involved unwillingly in the battle between an evil group of supernatural demon warriors known as the Eight Devils of Kimon and the country's government. After a town was wiped out overnight by a plague, so the eight devils could get in to get perform a certain mysterious task. Jubei soon is joined by a poisonous female samurai known as Kagero to find out the Devils' business is in this town, after one of them wipe out her ninja team and nearly her if it hadn't been for Jubei. He also encounters someone of the past, who he thought that he already had killed. So I've gone back to my roots when anime was a childhood favourite of mine, but this one isn't for kids. I loved this flick when I was in my early teens, so watching it now was such a nostalgia trip and surprisingly it still holds up exceptionally well. The popular worldwide hit \"Ninja Scroll\", which was directed by Yoshiaki Kawajiri (who brought us the excellent \"Vampire Hunter D\") paves way for a maturely slick, extremely violent and intensely erotic outlook. Everything about it comes thick and fast. It frenetically exploits the blood sprayed violence like a running tap, but still never loses that beautifully tender edge that seeps into many of the situations. The compelling premise isn't a mind-bender, although a bit jaded, but its simple origins only enhance the taut lay out and poignantly dark array of blisteringly out-there conflicts. It's surprising in it developments and you're left amazed by the film's personality and unique world that's created. It vividly captures the period of this atmospheric world. They're such an imaginatively diverse barrage of dynamic characters, with the likes of the rock-build demon to the hunchback whose hump are a wasp nest and a snake lady who can actually shed her skin. This gave it a real eastern mythological state and only proves that the bad guys had the most fun. The story might feel like its there only to set up one spirited confrontation after another and really it is. But the story-telling element is effectively defined, as most of the main players get enough time to mould there own back story and present their significance to where it could be heading. Jubei makes a cool anti-hero and Kagero fits nicely along side him. The skillful animation has class, agility, originality and distinguishing details making its way into these stunningly pristine visuals. An aggressively crisp sounding FX makes the experience a whole lot more impressive with such a wide range and the oriental twang found in the eerily mystic music score makes this presentation more brooding in its blinding passion and checkered emotion. Kawajiri faced no restrictions here, and was free to come up with an illustriously innovative and majestic anime piece that works in every frame. \"Ninja Scroll\" is more highly involving than you would believe. Recommended.",
            "review_date": "2006-11-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Godfather of classic samurai/ninja Anime",
            "content": "Ninja Scroll is definetly one of the biggest gems when it comes to traditional-ninja-mythology Anime. The story isn't too complicated but gives each character enough room to unfold their very own personality and ambitions. The pacing of this movie is perfectly balanced between smashing action scenes and calm dialogues. The great combination of sound fx music dark imagery create an absolutely fantastic mystic vibe so you can click in at any time and I guarantee you'll find yourself in a beautiful piece of art. The fight scenes are to this day one of the best the Anime genre has ever produced. Since every character has their own special set of abilities, skills and tricks every fight turns out to be a unique battle between masters of their very own art. Especially the diversity of the villains give the fights a nice kind of variety. Overall this is just a fantastic classic Anime movie with big impact to this day and an absolute must see for every true Anime fan.",
            "review_date": "2019-03-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Entirely captivating",
            "content": "This week I was fortunate to watch three fantastic animes(which I love from watching the likes of Studio Ghibli) in a row, Akira, Ghost in the Shell and this, Ninja Scroll. Ninja Scroll captivated me from start to finish, with the ultra-violent scenes and gore it is perhaps not for all, but from an animation and storytelling perspective it is really one of the most engrossing animated films I have ever seen. The animation is stupendous, every action has so much detail but the backgrounds and colours have many moments of dark or ethereal beauty to them. The music is haunting and sweeping, the characters are interesting with a lot of depth and conflict in them, but other than the fast, clean and incredibly compelling action the star was the storytelling, often dark and poignant but never less than riveting. Overall, captivating from start to finish, a must see. 10/10 Bethany Cox",
            "review_date": "2012-03-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The best in adult Anime'",
            "content": "\"Ninja Scroll\" is a relentlessly adult Anime' from none other than Yoshiaki Kawajiri, the director behind other notable film threats of the genre such as \"Wicked City\" (1987). \"Ninja Scroll\" is also one of the best Anime' films I've ever seen, as it contains more than its fair share of graphic swordplay combat and plenty of exposed (female) flesh, sex, and out-there mysticism.It has one of those murky, hard-to-follow plots typical of a lot of Japanese animation, but it involves a wandering vagabond, Jubei, who also happens to be a master swordsman. He's the best there is, simply put. Like all heroes of his caliber, however, he's not without many demons haunting his past.As the film opens in 17th-century feudal Japan, we already get a sense of just how skilled he is when he strikes down two would-be attackers but leaves a third one alive to tell of the lethal encounter. The main plot of \"Ninja Scroll\" gets underway when a lone female villager blindly wanders into a neighboring village bearing news that a mysterious plague has decimated her community.The local government, fearing an epidemic, quarantines the village until an investigation can be completed. Mixed reports conflict with the official story of a plague, saying that men on horses were seen riding from the village the night before. The chamberlain sends a team of ninja warriors to the village to get to the bottom of what happened there. Along with them, the beautiful ninja warrior Kagero joins them, against the wishes of the team's leader.But the team is ambushed and annihilated by an unseen presence in the woods while on their way to the village, leaving Kagero as the only survivor and held captive by her attacker, a monstrous rock of a man who proceeds to rape her. She is later rescued by Jubei, who takes down Kagero's captor. As it would turn out, Jubei and Kagero become unlikely allies, along with a wandering monk, as they each realize they've been swept up in a covert plot to overthrow the Japanese government.It seems that Himuro Gemma, a former nemesis of Jubei, has enlisted the aid of The 8 Devils of Kimon, a fearsome army of warriors with supernatural abilities, to help him in his devious plans. Some of them include the aforementioned rock, the wasp fighter, the blind swordsman who challenges Jubei to a duel in a bamboo forest, and my personal favorite, the luscious Benisato, who can animate the snake tattoos on her naked body and command them to attack her opponent. So together, Jubei, Kagero, and the monk team up to defeat this supernatural threat to the government.As with most mature Anime', \"Ninja Scroll\" does not come up short on the desserts (you know what I mean). (But, Kagero's rape scene should definitely turn away some viewers.) But aside from that and a twisted plot, it does deliver the goods in terms of identifiable characters you can (somewhat/almost) relate to. Jubei is the only \"normal\" character in the whole movie, being that he doesn't have any supernatural powers (aside from his extraordinary sword skills) and when he gets hurt, he bleeds. Kagero, on the other hand, has a few surprises of her own, as any man who sleeps with her will die because she is literally pretty poison; all of her being is so deadly that even a kiss could kill a man in seconds. Whoa.However, this particular defense (or curse?) represents the basis of Kagero's greatest tragedy, in that she is unable to love anyone who touches her. It makes her the most well-rounded, deep and sympathetic female character in the entire movie (a rare find in Japanese animation), since most women are usually whores or are submissive or weaker when compared to men, and it makes her death that much more emotional and Jubei's quest to avenge her much more romantic.The animation is fantastic and doesn't look dated that much at all. Since \"Ninja Scroll\" is one of the more notorious Anime' flicks out there, you have to wonder: When's this going to get the American cinematic treatment? I mean, after all, \"Ninja Scroll\" is one of the most popular Anime' flicks of all time. And since Hollywood's originality is drying up, they could be pretty thirsty for ideas, and comic books, Japanese horror movies, Anime' and Manga are all looking pretty ripe.I honestly hope this doesn't happen. Besides, I don't think something like \"Ninja Scroll\" could translate that well into live-action anyways without looking ridiculous. The graphic violence won't translate either, since a live-action adaptation of \"Ninja Scroll\" would be justifiably rated \"NC-17.\"\"Ninja Scroll\" is truly one of the best Japanese animated films out there right now. Let it live on in notoriety, without intrusion from us greedy Americans.10/10",
            "review_date": "2005-08-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An absolute favorite, and highly recommended :)",
            "content": "Ninja Scroll is easily one of my favorite anime movies. Great animation (the minimal movement in Japanimation far superior to the over-produced Disney cloned animation style), great story and characters, a decent running time - it all works for me.Recently here in Australia, the movie has thankfully been re-released in the 10th Anniversary Uncut version. After a controversial screening on commercial TV some years ago, the video version was upgraded from MA to an R-Rating, and had some sex scenes cut. The new DVD has been restored, uncut.A classic, highly entertaining and impressive anime - strongly recommended to Japanime newbies :)",
            "review_date": "2003-11-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great high-octane ninja action.",
            "content": "A great movie to just sit back and enjoy, not in the mind set of Akira, Ghost in the Shell or Perfect Blue just a great all out action film. When I first saw this movie I was amazed by the high quality of the action and the animation. To this day they both still stand the test of time. One of the best anime's set around the time period of feudal Japan, although the main reason to see this film is for the characters. Not so much for the good guys but the villains. The designs of the villains are outstanding and there individual powers uniquely brilliant.",
            "review_date": "2003-09-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "probably in my top 10 favorites of anime",
            "content": "Ninja Scroll is memorable in that, for its intended audience, it's got a lot of very well animated violent sequences, some rough but sharply defined characterizations, and a journey/story that is not too hard to figure out. It's got that samurai edge of 17th century lore from Japan, but it's also kinetic in its style, and abrasive at times in what it reaches to accomplish. It's also fun, most of the time, which is hard to be said for some very finely animated but incoherent samurai anime flicks or shows. After a village is destroyed by some weird plague, a samurai goes on a quest to find a dangerous foe who's seeking to overthrow the government. In the meantime, however, this quest involves facing off against deranged, fantastical demons set up by this head-foe. Of course a female counterpart (after being recovered by a near-vicious rape) accompanies him on the journey as well. It's an anime film that more than anything gives some individually memorable sequences, where style is really the key. The director, Yoshiaki Kawajiri, understands the importance of giving the scenes of daring-do a quick (but not too quick) power and splash of violence this level of dark, mature anime requires. But there are also some scenes of just plain dialog that work well too. Like my favorite 'cult' anime film, Fist of the North Star, Ninja Scroll has a story that needs a little paying attention to, but not by a lot. It's more concerned with the fates of the major players, and the side characters that come in and out (including a mysterious old-man character, as almost every anime film has one) are meant more for comic relief or moments of subtle intrigue. With an overwhelming climax, and some very solid swordplay throughout, Ninja Scroll is a must see for genre fans, and it might appeal to non-anime animation fans as well. It's got the thrills of regular samurai films, and the imagination, often over-the-top but sometimes darkly funny, that can only come from 90's era anime.",
            "review_date": "2006-07-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best Anime",
            "content": "Well, well, well.  So what they say is true.  This movie really is the best anime.  From the cover, and from just the name itself, the movie didn't really appeal to me.  I mean, I liked animes only because of their sci-fi nature, I liked the machine vs. man aspect of anime... and then I saw this movie!!I've seen other anime, such as Princess Monoke, but no other anime I have seen even closely compares with Ninja Scroll.  The story is pure brilliance, the animation is spectacular, and there are elements of superb well-crafted love-plot, action, and any other element a great story needs.  If you liked Crouching Tiger Hidden Dragon, then see this gem of a movie.I don't want to go into much other detail, other than just reccommend it to people.  It's simply the best of anime.  I was lucky I saved it!",
            "review_date": "2002-02-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best Anime Movies ever",
            "content": "Ninja Scroll is an Anime Classic which is usually mentioned in the same sentence as Vampire Hunter D or Fist of the North Star. However, I believe that as a movie, Ninja Scroll has a wider appeal.The visuals are top-notch, and the action is fast and clean. The sword fights can be watched frame-by-frame (and may have to be, if you want to really understand what is happening) and your awe at the quality of this movie will just increase. Do I sound like an obsessed fan? Because this movie impresses me so greatly that I cannot over-rate it.\nThe story and characters, though, are the main focus of this presentation, which each battle, duel, and other confrontation serving to move the story forward, develop, reveal, or eliminate the characters - all of whom are revealed in a way that is engrossing.Some maybe turned off by the gore, violence, and low value placed on human life; but that is what this time period was about. This is definately for mature audiences.If you do not yet own a copy of this, watch it as if you had never heard of it and enjoy the story developing. Then be plesantly surprised by the superficial stuff - action, animation, sound, and depth of characters.",
            "review_date": "2003-11-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ninja Scroll captivates.",
            "content": "You need to see this. Ninja Scroll is a personal favorite of mine and I find many amazing aspects to this animated film.The story, ninja action and characters are amazing. Jubei and Kigero's tale is more tragic then anything Shakespeare has thought up. The eight devils of Kimon are each interesting in their own way and some are sure to warrant more interest to you then others. By movie's end, you are sure to have felt many emotions as you watched Jubei's tale unfold.Anyone who wants to write this off as low-class entertainment aimed at a skewed demographic must not have actually bothered to watch the film. This is high class art of the most important sense. A wonderful story with interesting characters and with enough action to fill four other movies. Ninja Scroll takes you on an adventure.You need to see this. Highest recommendation. Please watch it with Japanese language track/ English subtitles.",
            "review_date": "2005-03-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Classic anime for adults",
            "content": "This is a review coming from a true anime fan. I must say that it really is a great film to watch. The animation is done brilliantly and the English dubbing is done realistically.The characters are all quite likable when they are made to be liked. The villains are very scary and the stone guy at the start, damn i won't want to mess with him. The animated scenery is amazing for the nineties. It really makes the characters stand out.The plot is very tense and exciting. Its about a young hero who has to protect a girl who has poisonous body which kills any man who sleeps with her from evil and demonic beings. He is assisted by a con-man and faces someone from his past. This does seem pretty similar to other sorts of films but it is still very gripping.But don't let this cross your mind. It is not a kids cartoon. This is strictly for adults. This is very graphic and the most violent anime since the legendary AKIRA. There is also a rather disturbing rape scene near the start which has definitely earned its 18 rating.",
            "review_date": "2009-03-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Streets ahead of its time...",
            "content": "If you want to see a poor version of this, watch Sword For Truth. If you want to watch how Manga should be made, this is the film for you! The characters match those of folk tales, yet are completely believable, and lovable/detestable at the same time. The storyline is interesting, and the relationships between the characters.The animation is terrific, and even though this film was made in 1993, it still captivates today.Fans of this genre will enjoy this movie, but so will people who aren't into animé.This is a terrific film, and one that you will be able to watch over and over again, if you love quality.",
            "review_date": "2008-04-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Kudos, Kawajiri...",
            "content": "WICKED CITY was among the bootleg anime that was circulated in this country before AKIRA came along and proved, beyond a shadow of a doubt, that American audiences were ready for adult animation. (\"Adult\" in the approach to animated storytelling.) I caught AKIRA during its initial theatrical run and it was satisfying, indeed, to not only see it on the big screen, but to also finally see it dubbed in English. While most anime doesn't make it to the big screens hereabout (curious, indeed, when one considers the fact that Animego is based here), there's anime aplenty at the local retail outlets. It's expensive, but there are several titles worth their weight in cost: WICKED CITY, VAMPIRE HUNTER D, VAMPIRE HUNTER D: BLOODLUST, ROBOT CARNIVAL, GENOCYBER, TETSUJIN 28, any ASTRO BOY (the original black and white series being the best), DEVIL MAN, GILGAMESH, FULL METAL ALCHEMIST, YU YU HAKASHO, NARUTO, KIKI'S DELIVERY SERVICE, GOLGO 13, GHOST IN THE SHELL (any), PRINCESS MONONOKE, METROPOLIS, GACHAMAN (any), PROJECT ARMS, WOLF'S RAIN, WITCH HUNTER ROBIN, BAOH, and NINJA SCROLL, to name but a few. NINJA SCROLL, with its seemingly endless invention, is probably my all-time favorite. The animation is about as good (great) as it gets. Kawajiri's direction is to be envied (even WICKED CITY and VAMPIRE HUNTER D: BLOODLUST, as nigh perfect as they are, can't beat NINJA SCROLL). If you're tired (as am I) of the lackluster Americanimation being cranked out by the studios, switch gears and check out some of the aforementioned anime.",
            "review_date": "2009-01-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Cool ninja anime, that has a rather weak ending.",
            "content": "This movie started out rather fast with some cool action scenes especially involving the one rock dude that seemed very hard to kill. Then you get even more cool action sequences here and there till the end where the last action scene just does not measure up to previous ones. Still, for the most part this movie has enough action and violence to entertain a person. It has nudity too, but not really all that much compared to other anime movies out there. The lead ninja here gets poisoned rather early and has to find a cure and there is a bunch of other things too as we have a couple of rather cool enemy ninja for our heroes to fight off. Then the movie ends just in a rather weak fashion on a boat, I would like to suggest to the people who made this film you save your coolest villains to the finale not the beginning and middle of the film. So overall I enjoyed this movie, however, it needed work for as strong as most of the movie is it suffers from a anti climatic ending.",
            "review_date": "2009-06-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Near to the greatest anime ever made ...",
            "content": "There are some movies that take you to a different place.  There are some movies that make people cry and some that make people think.  This is a movie that does none of the above. It just provides entertainment. It wasn't made to be the greatest movie of all time - even though the creators may think it is.  Yet, who doesn't think the movie they put  out is the greatest masterpiece ever made?  The point I'm trying to make is that Ninja Scroll was not made to appeal to everybody.  It is just the imagination of some men somewhere and they thought it was good enough to put on the screen and make money.To all of the people trying to disseminate the movie and peel out meaning, \"What are you trying to prove?\"  There is blood, gore, some scenes not suitable for children and even some small-minded adults, and bad language, in general.  To all the people who want to sit down and see a well-executed anime movie with a plot with few holes and scenes that are unbelievable few and far between (even in the fantasy animation realm) while not have to think while watching - this is it.  The dubbed version was just as good as the subbed (sub-titled) version.  All you have to do is enjoy.So if you haven't seen the movie and would like not a mind trip like Donnie Darko or 12 Monkeys, or not to have a moment that all is right for the character even though he went though garbage in the beginning like A Beautiful Mind or The Shawshank Redemption, or not to have a good cry like The Green Mile or Braveheart or not even to have to interpret your own meaning of what's really going on like Akira or Princess Mononoke, then just sit back and see how animation and that feeling that makes you wonder 'how did they think to put that in the movie' collides then watch Ninja Scroll. If you go into it with an open mind then you will see why the action fans believe it one of the greatest anime movies ever made.",
            "review_date": "2003-08-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the few text books for Anime storytellers",
            "content": "This movie has SO much going for it. The first I want to mention is the creativity. Anime in general, usually shows a lot of creativity. And this film ensures that. The characters are very unique and all have interesting aspects to them. Whether it be physically or mentally. A great example of this is the character Yurimaru. This is a great character because we see that he has an goal, a desire, an attitude, and an ability to conduct electricity. All the characters are like this, only in different, yet good way. And that's one reason I love this film. Another reason why I love this film is because of the delays/detours the story branches off into every time Jubei encounters another enemy. For instances his second encounter with Tessai. The story doesn't go TOO far astray. And one of he reasons that we know this, because Jubei is always willing to move on, with the twist of his slow death (Simply because he has to). This brings a bit of variety and integrity to the film. And finally the action. I strongly believe that if you have an interesting story and creativity, you won't look at the action with such cynical eyes. Movies that want to be extremely flashy with the action, don't make it as interesting because the viewer knows it for show, and not for the story. But this movie doesn't cross the boundary of action, and move across the territory story, that many films today do. So I can appreciate the action more simply because it fits well. All these aspects of the film (and some other minor ones), make \"Ninja Scroll\" (Jûbei ninpûchô), one of the few ideal Anime films of all time.",
            "review_date": "2003-12-14",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A straight shot of mythological action with no room for a chaser.",
            "content": "let me start out by saying i'm not an anime fan. that is to say, i have an interest in the genre, but for me it boils down to the big three; \"ghost in the shell\", \"princess mononoke\", and the movie this review is for. i'll have to explain that i'm reviewing this movie after seeing it an estimated 8 times at least, therefor i'm trying to think as if i'm seeing it for the first time. this presents the problem of wanting to rave for this movie, but knowing that it is one that truly gets better the more times you watch it. when the opening scene is over you'll give a sigh at the predictably bad diologue and spoon-fed character development coupled with the cartoon fantasy world. however, you're a fool if you don't stick with this movie. these flaws become faint as your engaged in the simple yet brilliant plot and you begin taking note of a few \"wow, that was cool\" moments that this movie is littered with. before you're 20 minutes into it your skepticism takes a back seat and you have no choice except to enjoy the ride. i feel like this is a horrible place to stop the review, but in writing it i've reminded myself of how fun this movie is and i need to go watch it. so in conclusion; if you are looking for a movie that oozes entertainment: violence, sex, love, and intrigue. do not pass this up... really, don't.",
            "review_date": "2006-04-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Winner Of The film Festival of Japan 1993: Ninja Scroll",
            "content": "As the trailer says. Ninja Scroll is one of the better action movies i have seen from Japan, and explosive anime action, that in times is daring, sexy and passionately beautiful, as it shows Japan in carnage. Plague's spread through the towns, well an evil force lurks, with 8 devils rise to take the land. It all begins with Jubei Kibagami (Kôichi Yamadera, Japanese version) a traveller who passes town to town with a hidden past. Well coming across Kagero (Emi Shinohara) a woman who tests food in her village, and has the curse of any man who makes love to her will die. It's beautiful in parts, and the animation is superb. The directing from Kevin Seymour and Yoshiaki Kawajiri is superb. Also written by Yoshiaki Kawajiri. Winner of the 1993 film festival of Japan and worth the watch, i've owned it since i was 16 now, and still gets a play from time to time. 8/10",
            "review_date": "2006-03-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The reason we loved anime.",
            "content": "Ninja Scroll (Jûbê ninpûchô) (1993): 9 out of 10: One of a bevy of Anime films to come stateside in the early to mid-nineties Ninja Scroll along with Akira, Ghost in the Shell, and Urotsukidoji. Ninja Scroll helped set the agenda of anime as a serious art form with very adult themes. Or if you prefer the agenda of cartoons with lots of nudity and violence and tentacle sex.I have seen Akira about half a dozen times and could not describe the plot to you at gunpoint. There is a motorcycle and a nuclear explosion and then it gets a bit fuzzy. Ninja Scroll does not suffer from this.Taking place during the era of the Tokugawa Shogunate local villages are apparently dying from a plague. The local Mochizuki Chancellor Hyobu sends out his sizable ninja force to investigate. Coming along is his female food tester and ninja leader love interest Kagero. While in the woods they run into what appears to be a very large stone golem who slaughters all the ninjas tearing the arms of the ninja leader and drinking the blood that pours out of them. He only spares Kagero as he plans to rape and then kill her or maybe kill and then rape her as he notes it doesn't matter to him.At this point, the sounds of thousands of parents desperately looking for the VCR remote and wondering how Blockbuster could rent such a cartoon could be heard across the land. Also at this point, our hero shows up.Our hero Jubei is a Ronin... well actually he states he is a ninja... Though truth be told he isn't very ninja-like but instead much more of a swordsman. A ninja swordsman ronin perhaps? Anyway, he is a swordsman for hire more interested in doing good than earning gold. A very classic character in both Japanese film and American Westerns where there is much overlap between the two (Seven Samurai and The Magnificent Seven being the most famous.). He also owes a lot to the Lone Wolf and Cub manga.Jubei's key as a character is his superpowers. He doesn't have any. He wins through skill and an awful lot of skin of the teeth luck. He is a very vulnerable hero. There is an appeal to this hero that both anime and western media often forget. Think of the appeal of the bloody foot everyman that Bruce Willis played in Die Hard and now compare to the car crashing into a helicopter superhero Bruce Willis played in Live Free or Die Hard.Jubei needs that luck because he is actually up against the eight devils with the Stone Golem only being the first one. Video game aficionados will recognize this for what it is a collection of spectacular boss fights with the final boss being a man who can shapeshift and regenerate at will. Ninja Scrolls influence on modern video game design and follow up anime such as Naruto is self-evident.The animation all hand-drawn is spectacular. The action scenes are very well staged and the eight demons are extremely grotesque and creative. (There is one demon that is a hunchback with a beehive where his hunch should be or maybe bee. I had the voice of Nicholas Cage in The Wicker Man throughout all his scenes.)Ninja Scroll even manages a bittersweet love story and some nice humor through the chaos. For a brief ninety-four minutes, it packs in a lot of story and characterization without a seemingly wasted frame.\nHighly recommend this film for anime fans who somehow missed it or haven't seen it in twenty years and to newcomers though I do warn the newcomers the first twenty minutes are kinda rough till the characters start to take hold. An excellent action film with a great story and some surprisingly deep characters.",
            "review_date": "2019-08-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Kawajiri's finest film...",
            "content": "Jubei Ninpocho (Ninja Scroll) ***1/2 out of **** Director: Yashiako KawajiriMasterless samurai for hire is \"tricked\" by aging government spy in order to partake in assassinating eight supernatural beings during the era of feudal Japan. Ultraviolent premise is not for all tastes, but fascinating visual punch and original story telling (emphasized greatly by Kawajiri's expert direction) make this a much see for animation buffs.  Kawajiri's finest film to date is dazzling and gripping from start to finish.",
            "review_date": "1999-01-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Royally screwed up",
            "content": "Um...where do I begin?  I watched this in one sitting and I was shocked at how shocking it really was.  I couldn't stop watching it even though it should have a warning label with a skull and crossbones on the front of it. \"Ninja Scroll\" is royally unreal.  It has the shock value, violence and gore of \"Perfect Blue\" and \"Ghost In The Shell\" (they are also Manga, need I say more?).  Unlike the aforementioned, it sticks mostly to action and visual style and opposed to philosophical and emotional value.  The story is relatively straightforward with no major plot twists.  The characters on the other hand were probably from the after effects of major drug use by the writer (look at the demons in the film).  The story, character development, animation, writing and direction were all in a class of their own.  This movie is completely original and almost unmatched by anything currently out there (other Manga productions I have seen rival it).  This should be considered an animated classic for the 1990's.  I give this film a 10 out of 10!Here ends my rant!",
            "review_date": "2002-12-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not bad for animation",
            "content": "I'd like to start off by saying that I am not a fan of anime, I actually only watched this movie because a friend recommended it to me and I remember it being really popular with computer geeks when I was in high school. The reason I never really got into anime was mainly because I was never able to take seriously something that featured a character screaming at the top of his lungs, and the only thing moving on the entire screen was his or her mouth. Just doesn't look right to me and doesn't strike me as very high quality entertainment or even very skilled animation.Ninja Scroll, however, while there are definitely plenty of examples of that, has a lot to offer beyond just an animated action/violence cartoon. There is some serious violence here, but I think that a lot of the novelty is not just to see killing and blood but to marvel at the extent of what can be accomplished in an animated movie that can't be done in a live action film. The story is interesting (although a little difficult to follow at times, what with all of the different names of clans and warlords and ninjas and whatnot), and it pulls you along through the conflict in a world that is far removed from reality but more than able to entertain. There is a variety of sinister and creative villains for our hero to face, and the important thing here is that they are not just a lot of mean guys with big guns. These guys have every weapon from gigantic boomerang/axes to immunity to death to wispy threads not unlike that one that Irene's grandmother gave her as a guide in The Princess and the Goblin (how's THAT for an obscure reference!) except that they entail startlingly accurate deadliness. I am certainly not an expert in the field of anime, but I can definitely say that the anime world has held no interest whatsoever for me, but Ninja Scroll has increased my interest in seeing more.",
            "review_date": "2003-04-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "GREAT ANIME: SEE THIS",
            "content": "Though it contains things only fit for mature audiences (tons of violence, rape, lots of boobies, language) i'd have to recommend this to anyone who enjoys anime (especially Vampire Hunter D: Bloodlust or Mononoke). Great animation, great storyline, and the producers werent afraid to put in <gasp> gore, realistic dialogue that sometimes has swearing, and nudity. 1st rate.",
            "review_date": "2003-06-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Why can't they make \"real\" films like this?",
            "content": "From my young teen day's I was a big Anime fan, but now only a few of these film really excite me, one of them would be Ninja Scroll. Ninja Scroll is a fantastic, samurai themed action adventure; filled with imagination, especially with the designs of the bizarre creatures that inhabit the strange take on Feudal Japan. There is also some of the best animation ever, take Jubei's fight with the blind swordsman in the forest for instance... The animator's under the direction of Anime guru Yoshiaki Kawajiri (Monster City, Wicked City) have created a mood and atmosphere that only animation can pull off. And the fight scenes, this must have been what Ang Lee was hoping for with Crouching Tiger, Hidden Dragon, but animation has no limitations. It's definitely the best in Kawajiri's loose trilogy, much better than Wicked City and definitely on par with the pretty good Monster City (which was probably a prototype for this film). So if you're not put of by the strong scenes of gore, but you like animation at it's finest, then give this a try.",
            "review_date": "2001-10-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ninja Scroll",
            "content": "This anime movie follows lone ninja Jubei; he travels from village to village looking for work but now he is about to get involved in something far more serious. A group of eight demonic ninjas, the Eight Devils of Kimon, has wiped out a village along with most of those sent to investigate. Jubei helps survivor Kagero, a beautiful female ninja and is soon caught in a fight with one of the Eight Devils of Kimon. He then confronted by Dakuan who tells Jubei that he has poisoned him and if he wants the antidote he will have to help defeat the remaining Devils.Together Jubei, Kagero and Dakuan tackle the various Devils; each of them has their own distinctive demonic power; one has skin as hard as stone; one has snake tattoos that become real snakes and another has a wasp hive in his back to describe just three of them. We also learn that Kaguro has a power/curse of her own\u0085 her body is poisonous in a way that means any man who makes love to her will die.This is a really enjoyable film for those who love ninja action and villains with imaginative superpowers. There is a lot of action; most of it is pretty bloody so this definitely isn't a 'cartoon for kids'! This action is well animated and exciting; there is a feeling that just because somebody is a protagonist they aren't immune from real danger. The character designs are impressive and distinctive and the backgrounds look great too. There is some sexual content, including a disturbing assault against Kagero that may bother some viewers. Overall I'd recommend this to older anime fans who are looking for lots of exciting action.These comments are based on watching the film in Japanese with English subtitles.",
            "review_date": "2017-05-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the Best Ninja Stories Ever Told",
            "content": "It was by pure luck I came upon the masterpiece known as Ninja Scroll. My school was having an Up All Night party for the senior class of 2000. Being a senior, I decided to go, but it completely sucked, so around midnight, I decided enough was enough. When I got home I decided to throw on HBO since we were getting a free preview at the time. Well, low and behold an anime flick was on. I decided why not, since I really, really enjoyed Urotsukidoji, Devil Man, Akira and the whole lot. In a matter of minutes I was completely and totally hooked. Leaving that crappy end of the year party was one of the best decisions I've made in my entire life.The story of Ninja Scroll focuses mainly around Jubei. A rogue Ninja who accidentally gets mixed up with an old Nemesis named Gemma. Gemma is now back and has a plethora of supernatural Demons at his side. His goal is to completely rule the Country, and so far, so good. But Jubei also has help in the form of beautiful but deadly Kagema and the old crafty secret government agent Dakuan. They have banded together and are out to stop all of Gemma's devil sidekicks and finally Gemma himself. But with the odds completely against them, this task is almost completely impossible.Ninja Scroll is by far one of the most memorable movies you will ever see. That is if you enjoy your action bloody, your women beautiful, your villains extremely evil, your characters all fleshed out uniquely, your dialogue witty and realistic....see where I'm going here? This is a masterpiece in every sense of the word. I see that some people who enjoy anime don't see the big picture here, and I feel bad for them. This is the ultimate Ninja action flick. It delivers on every single cylinder, and if you haven't seen this film and are a fan of action/adventure/martial arts/anime films it is a must, must see. 10 outta 10 for the incredibly entertaining Ninja Scroll.",
            "review_date": "2008-02-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An anime classic!",
            "content": "In 17th century Feudal Japan, a disease has caused deaths in a village as a masterful swordsman named Juebi is hired to investigate the happenings. He is joined by sexy but literally poisonous beauty Kagero as together with a wise old man they hunt down demons and the mysterious shogun of the dark that wants to overthrow the Japanese government. Could Juebi's old friend Genma came back from the dead as he could be the Shogun of the dark or is it someone else? One of the greatest animated movies of all time and one of anime's biggest hits! this fantasy/action anime feature is not for everyone. There is some sleaze and gore abound but what is unique about this movie is the creatures which are unlike no one has seen and the beautiful artwork this movie shows. Director Yoshiaka Kawajari proves to be one of anime's biggest masters with this, Wicked City, Vampire Hunter D Bloodlust, Animatrix, and more as it's pure creativity at it's best here. Beautiful animated women, gore abound, battles, amazing sword fights, and outstanding animation makes this a winner for fans of animation, anime and fantasy alike.",
            "review_date": "2010-09-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ninja Fun",
            "content": "This film follows a ronin known as Jubei sent to stop the eight devils of Kimon and an extreme disaster from taking place.  This movie is very good if you want to see people being hacked apart.  The reason I think this movie is good is because it also had a fairly good story behind all the blood and guts unlike some of the other anime titles I can think of (Fist of the North Star).  This movie has some very good fight scenes especially the final fight between Jubei and Gemma because the odds are stacked tremendously against Jubei.",
            "review_date": "2000-01-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pretty good.",
            "content": "As far as anime goes, this is a good example of what can be accomplished: a story that translates well. There are too many bad examples, but here (along with Akira) is a good one.  Now there's a sequel... Looks like Jubei will always have ninja problems.Well worth the seeing. An excellent example of Japanese anime artistry (drawing and storytelling).",
            "review_date": "2000-02-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very impressive",
            "content": "I found \"Ninja Scroll\" in an excellent list of Japanese (or Japanese financed/produced) movies and hadn't heard of it prior to that. It sounded interesting enough and so I gave it a try.Now, here I should say what makes or breaks movies for me is mainly an interesting story, good (as in believable) characters and atmosphere. I felt Ninja Scroll had all of it. It might remind you of certain Eastern movies, such as Hidden Tiger, Crouching Dragon or the Matrix (which was actually influenced by this movie) and since it predates them, it makes it all the more original. It definitely isn't a \"cartoon for kids\".The story may not be too inventive, but it kept me interested pretty much from the very beginning. The 8 demons seem a bit like bosses in a video game, but just like bosses in a video game, you're curious about the next one and their skill(s). Maybe not the most inventive idea, but it absolutely works, at least for me.The male and female character don't fall into the traditional \"happy ending\" trope, as it often is the case in Western films.So why just 8? I was thinking to give it a 9, but I'll have to see how knowing the story will affect any re-watches. Still, I can't find much that is wrong with this movie if you're planning to be entertained, I'm certain you will be.Hopefully, there won't be any real life adaptation of this film, I just can't imagine that, especially with CGI. It would just look awkward and even if it was Japan-made, I think some movies benefit from the possibilities only animation offers. It adds to the overall dark tone of the film and makes it a very entertaining one.",
            "review_date": "2019-11-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "the best action anime ever!",
            "content": "This was the first animemovie I ever watched in my teens (i saw a lot s a child, but can't remember any of it..) I was totally blown away and I'm happy to say that because of this movie alone, I am now an (almost) certified otaku with shelves full of animedvd (who wants vhs anyway?) This is simply a must see, for all lovers of action/fantasy/ninja movies. A little warning for the faint of heart: This movie contains more blood than most low-budget splatter movies:-) 10/10",
            "review_date": "2002-01-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Makes Lone wolf and Cub look tame",
            "content": "Ninja Scroll is the benchmark for action manga. The animation is decent, the story is really good and the character design is fantastic (a human beehive? I would have to be smoking a peyote reefer to ever think of something like that!). Jubei (the masterless samurai) is hired to take on several supernatural fighting masters. He is aided and abbetted by the poisoned lady ninja. The whole thing moves at hyper-kinetic speed, people are chopped in half, deals are done and love is made. One of the highlights is the final battle, where things happen with gold that are stranger than anything goldmember has to offer.\nWhat are you waiting? for go get it! (just watch it your without your mum/girlfriend/sister. Women don't seem to be quite as desensitised as men to ultraviolence. Funny that).",
            "review_date": "2002-10-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ninja Scroll",
            "content": "Ah another anime movie I saw back in the 90's because I felt I had to see it as it was seen as the right/popular thing to do/see (so easily influenced when you're young). Yes in my early to mid-teens (can't remember) I did see this anime (somehow) after seeing and hearing lots about it...probably mainly in Forbidden Planet. As I recall I didn't actually like this film upon seeing it (same with most animes at the time) because it simply wasn't really my thing at the time. Back then my young self was all about Arnie and JCVD so this didn't really fit into my wheelhouse.So seeing as I'm on this little anime binge right now its time to revisit this supernatural samurai epic. Firstly what's it all about? Well like other anime films the plot is actually quite simplistic. Taking place in feudal Japan, Jubei Kibagami is a Ronin of sorts, a wandering masterless samurai looking for work. Upon rescuing the female ninja Kagero Jubei finds himself caught up in a battle against the eight devils of Kimon who are a team of supernatural ninjas hired by the Yamashiro clan to protect their secret gold mining operation. The gold are payments to the Toyotomi Shogun of the Dark for protection. In turn the Shogun of the Dark wants to use the gold to buy Spanish weaponry to overthrow the current Japanese government. Bottom line, Jubei and Kagero must defeat all the bad guys to protect the government.Visuals and Animation: So let's just get down to the nitty-gritty. This film looks amazing, stunning, sumptuous. The director is once again Yoshiaki Kawajiri (of 'Wicked City' and 'Vampire Hunter D: Bloodlust' fame) and it is obvious in the style. The animation is silky smooth throughout with tonnes of tiny details. For example there are many simple shots of nature, such as fireflies, rippling water, trees, birds etc...which are there merely to add atmosphere in the moment but at the same time are beautifully drawn and animated. There is absolutely no slacking on any frame of this animation I assure you. Every frame looks like an exquisite watercolour painting from the bamboo forest to the mystical woodlands to the shimmering bodies of water. Add to that various striking sequences that utilise only one or two colours such as red and black or shades of blue which look very dynamic and comicbook-esque.Violence and Non-Consensual Sex: As you might expect with a sword based anime feature there is indeed a lot of violence...and it's amazing. The ninja based action is nothing short of breathtaking as characters whizz around the screen slicing and dicing in super-smooth animation. I think the first fight we see sets out the stall for the film. A group of ninja is massacred whilst investigating an attack on a local village by one of the eight demons of Kimon. They are brutally cut to pieces by his flying blade which then culminates in their leader having his arms ripped off (out of their sockets) in a shower of claret. Said demon does actually eventually get his own blade firmly implanted in the centre of his skull. There are some amazing katana fights between Jubei and various villains which are heightened by the sound effects which really add some weight to the proceedings. And of course you have the obligatory supernatural elements of gore and trickery that are a staple diet of these productions.Another staple of Kawajiri's animes seems to be nudity and rape (gulp!). Yes once again the lead female character Kagero seems to be more of a sexual toy for certain fantasies rather than a strong female character (although she still is that). Now whilst 'Wicked City' was more bizarre with its body horror element this film feels a bit more realistic, almost. Sure the characters doing the rape are supernatural demons but they still have human form and are generally dressed in historic attire. So yeah there are nipples and sucking and fingering and rope bondage and licking...all whilst being unconscious. The fact that Kagero's body is covered in a poisonous toxic that can't be cured makes the porn aspects seem more dangerously kinky and vindicating if that's at all possible, or just me.The other rather hilarious and uncomfortable plot point is the fact that Dakuan informs Jubei that the only way to rid himself of the poison he gave him (Dakuan deliberately injects poison into Jubei via a ninja star to blackmail him into doing his bidding) is to have sex with Kagero. Apparently the toxins across Kagero's body will combat and reverse the poison in Jubei's body. So not much pressure there then! Unfortunately for Kagero Jubei declines (she fancies him) but later on he kisses her and cures himself that way (so why didn't Dakuan just say that?).Representation: Yes there is LGBTQ representation in this old anime film. It seems in times gone by people have been happy to showcase gay characters despite what the far-left Twitterati try to force down our throats. Gemma's right-hand man Yurimaru is his male lover! He even pushes back on a fellow female villain's advances! How about that then! We don't see any man love, surprising when you think about it, but the representation and lovers angst is definitely there.Old Wise Men: Another aspect of these animes that seems to keep popping up is the wise old man character, something I have pointed out in previous reviews. Yep in this story Jubei and Kagero are aided by the short, Yodi-esque, troll-like character of Dakuan. Dakuan is a government spy charged with helping Jubei kill the demons. As already stated he does so by poisoning Jubei and promising him the cure after he completes the mission. As you might expect Dakuan is one of these characters that hides much of his skills, only showing the odd glimmer of what he can do. We know he has some kind of special powers and we know he can move quickly (despite his appearance) and is an expert in stealth. Again, like other similar characters, Dakuan is also the comedic relief in the film.As for the other characters, its the usual anime cliche truth be told. The main protagonist Jubei is your standard good looking western-esque anime hero with a slim wiry physique, lightning katana skills, and long flowing dark hair. His female partner is again your standard attractive western-esque looking heroine with a slim physique, a slightly tomboy-ish hairstyle, and also lightning fast weapons skills.Most of the main bad guys also have a very cliched look about them which we've seen many times now (thanks to films like this). Himuro Gemma is a large hulking handsome western-esque looking villain with a lantern jaw and almost invincible fighting skills (but he is a demon). Whereas Yurimaru is the typical calm but deadly handsome skinny villain who dresses all in white, has even longer flowing hair and looks almost religious. He is able to generate electricity through his body and conducts it down a steel wire he strangles people with. The other demons literally come across like a Capcom fighting roster. There's a ninja bloke who can utilise shadows. A sexy chick with living snake tattoos. A massive bloke who can turn his skin to stone. Another sexy chick who can manipulate gunpowder in all manner of weird ways. And a hunchback with a living hornet's nest in his back!In short almost everyone is very good looking with lovely straight flowing hair and great muscle structure that is either just right, hulking, or monstrous. At the same time there is also that typical exaggerated facial anime style where characters have extremely strong jaws, chiseled cheekbones, and long chins. Their features are basically very prominent...with perfect hair. Oh and everyone is really fit, even the people that don't look it. Can make you a bit self-conscious.As I've hinted at here and there, nowadays this film will come across as rather unoriginal. But that's only because many properties have more than likely been highly influenced by other properties that were originally influenced by this anime. You can spot so many ideas that will have popped up in so many flicks over the years, not to mention videogames. Hell this anime is almost like a 'Samurai Shodown' movie. That's not a bad thing, I love it! Overall the sizzling action sequences, hyper turbo characters, and absolutely gorgeous artwork and animation are just so good and engaging I can't not give this a perfect score. Thoroughly enjoyed every minute of this. A true cult classic, an all-round epic, a work of art.10/10",
            "review_date": "2020-01-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "High fantasy, epic encounters, swords, blood and gore aplenty. Heavy on the supernatural . A key entry into the popularity of the genre.",
            "content": "Before Ninja Scroll my only exposure to anime was Astro Boy. While Astro Boy dealt with somewhat mature and dark themes, it was aimed at a childrens audience considering it was in the morning line-up with Carebears and Tiny Toon Adventures. Ninja Scroll is not for kids! It has extreme scenes of gore, blood, violence and is sexually suggestive. It deals with a wandering ronin named Jubei who suddenly has a key moment in his past come back to haunt him. From that point on this roller coaster of a movie begins. Its dark, fast paced, and with sparse dialogue from the main character you know his mindset is less talk, more action.Along with Akira and Ghost in the Shell these movies paved the way and introduced new fans to the anime genre. I'm really happy a sequel was never made, it wouldn't make sense. An effort was made at spin-offs that were below par and unengaging. The original remains the only one you need to see. A masterpiece!",
            "review_date": "2022-07-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ninja Anime at its best.",
            "content": "Ninja Scroll is by far one of the absolute best anime features including ninjas. Jubei is a ninja-for-hire who's cannot be matched hardly by anyone with a sword. He's thrust into a battle between a small ninja clan and the Shogun of the Dark. The action is wonderful, the surprises, the ninjas, and the various other characters are all interesting. But be sure to watch the Japanese language version. It's hundreds of yards better than the dub.",
            "review_date": "2003-02-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "My favourite anime of all time!",
            "content": "To this day nothing else has beat it for my tastes. I miss the days of ultra violent anime like this. No spoilers if you haven't seen it, just do yourself a favour and watch it.",
            "review_date": "2019-03-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you like adventure stories fasten your seat belt",
            "content": "Stumbled to this masterpiece rambling some guys list about great anime movies. Then I read great reviews from here (imdb), and lets say there where no over praising to this movie. It is simply amazing.I never thought 94 min movie would have so comprehensive look out to the characters and make you like them instantly. And as the movie goes by, fall in love with them. Protagonists are super interesting and deep. The villains are spectacular and creative. It's not common that a guy like me gets tears in his eyes from the romance part, but this movie was something else... This movie will take you to an adventure you have never experienced. Watch it when ever you have the chance, you will not be disappointed. And if you do, get a strong chair because the edge of your seat will have a hard time :)",
            "review_date": "2014-09-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great anime",
            "content": "Ninja Scroll is one of my favourite all time anime.  Great animation, great action, strong yet still vulnerable lead characters, great stuff.Shame that the recently released in Australia 10th anniversary edition is only in 4:3 aspect ratio.  Was it only ever made in 4:3?  It would great in widescreen. 8/10",
            "review_date": "2004-01-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A must watch",
            "content": "Its just too sweet! it makes me happy just watching it. the characters are awsome and so is the music!",
            "review_date": "2018-10-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best Anime ever",
            "content": "There are few animated movies that put it all together.Ninja Scroll intertwines a very compelling high action, violent story (which includes love), with absolutely magnificently detailed visual pictures. If you have never seen anime or have no interest, I will bet you will enjoy this!Yoshiaki Kawajiri has many many great movies and they all have the same high quality art that Ninja Scroll is comprised of.Psychedelics go very well with this movie! The part that kills me is that the Japanese audio is only 2 channel. This makes the movie feel authentic when the characters speak, but during the action scenes it feels less immersive than the English 5.1 audio tracks. Such a trade-off, but I feel the English audio ruins the experience entirely.",
            "review_date": "2019-01-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Anime at its best, and it's not Pokemon",
            "content": "barring Mononoke Hime, of course. Ninja Scroll is an outstanding achievement in animation, not just anime. In many instances - like the fireflies' ravine scene or the night battle in the beginning of the movie - the film is technically superb, far superseding anything that Disney or the Dreamworks ever came up with (or can be expected to come up with, considering their gravitation towards an 8-year old audience). The plot has more twists and turns than your average anime slashing flick and enough to give your system a good adrenaline flush. It is a rather bloody movie, but I would not call it gratuitously violent - somebody had to chop people up, right? There are only 2 and remarkably low-key sex scenes which is a welcomed change from some other anime titles (you all know what they are) bent on depicting in needles anatomical detail endless alien/devil rape scenes... This movie is a must for anime fans as well as for those who want to be introduced to this genre - I'd highly recommend Ninja Scroll over Sailor Moon, if you know what I mean.",
            "review_date": "1999-05-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Anime that got me hooked on Anime!",
            "content": "The Plot: Jubei is a master less ninja who travels the land alone, hiring his services to those with gold...or a worthy cause. His fearsome abilities have served him well, but a hideous plot to overthrow the government threatens to end his wandering ways and possibly his life. When a small village succumbs to a terrible plague, a team of ninjas are sent to investigate and realize that all is not as it seems. Ambushed, they are wiped out by a fearsome man-monster with incredible powers., leaving only one alive - Kagero, a beautiful female ninja whose touch can bring instant death. Jubei saves her from a fate worse than death and unwittingly becomes drawn into a web of treachery. He is soon faced with his greatest challenge, an enemy for whom death holds no fear with the power to destroy Jubei's world. It's an all-out bloodbath when ninja warriors come face to face in this action-packed tribal war. Ninja Scroll features a wicked cast of characters, extraordinary fight scenes and stunning animation from Yoshiaki Kawajiri and Madhouse Studios! My Spiel: Ninja Scroll is a feast of animation perfection. This is a blast to watch every time, from the sweet fight scenes and the sweet visual's this film has to offer. If you are looking for a Samurai/Ninja Anime search no further at only 94 minutes this is full of Adventure from start to finish. I can't say enough of how this movie blew me away after watching it in sync with Wicked City by the same Director. Granted this movie has a partial sexual content just so you know. But but don't let that discourage you, this anime does more then makes up for that with its fights against fantastically gifted enemies and visual aspects and fantastic ideas. Ninja Scroll with it's sweet top of the line animation is truly a joy to watch every time. Easily one of my top 10 favorite animes of all time.Ninja Scroll (1993) Review: 9/10",
            "review_date": "2008-12-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I Fell In Love With This Movie In About 5 Minutes",
            "content": "Ninja Scroll became renowned as the pinnacle of anime with its dazzling action, blood and sex elements.Jubei is one of the classic characters, silent, simple and lethal.What often gets overlooked when people discuss this movie is its elegance. In amongst the brutality it carries a beauty of movement and flow and grace that seem to weave a spell around the death and carnage.Ninja Scroll was and is unique. A true masterpiece and not only in the world of anime. This will not be for everyone, but for that audience that gets it...something special that you will never forget :)",
            "review_date": "2021-03-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Experienced movie!!!",
            "content": "A story of a young, smart and patient man. This movie has a very good story. The main-character is a guy who doesn't care so much about things happening around him. When he meets for the first time the girl, he becomes her bodyguard. He becomes a friend with her and they seems to get along good with each-other. Sometimes they have quarrels though.This movie is good because it has a good story. They fighting scenes are good but not that good. They are instead fast and different from other animated movies. The characters are quiet very often. And that, i think is good because it is then very exciting to watch. There's nothing wrong about this movie but if it had more music it would be better. And if it had more dialog's it would be better too. I would give it a 8,7 out of 10.",
            "review_date": "2002-12-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Possibly the Finest Animated Film Ever Made",
            "content": "Whilst animated films can often be impressive, they lack the realism generated only by live-action.  This tends to leave fans of the film thinking \"If only they made it with proper actors.\" But not Ninja Scroll. This tour-de-force of anime is without a doubt in my personal Top Ten of films.  It does not try to look \"cartoony\" or false, it plays on japanimations strengths, namely the ability to make the the unreal look real.  Packed with top action, endlessly quotable lines (The way to hell is, RIGHT HERE!), superb characters, and the finest, nay, the best final confrontation in cinema history.  This film could be enjoyed by any movie goer, even those that find anime a bit twee.  I have watched this film so many times, and it is ALWAYS a pleasure to behold.  Ninjas, demons, swordplay, explosions, sex, swearing, punch-ups, jokes, plot-twists.  What more can you ask from a film?  If you see this anywhere, buy it.  And if you don't like it, you're not quite right in the head.",
            "review_date": "2000-06-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Amazing action",
            "content": "This film had amazing action and animation ahead of its time. The animation style boasts harsh angles and chiaroscuro lighting to impart the brutality of the fiction world. The action is energetic with very creative villains (the demons) who have interesting special abilities. The overall plot unfolds slowly as we get to know more about the characters and the world. Overall a great watch - if you don't mind all the blood and villainy.",
            "review_date": "2021-02-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "one of the best for sure",
            "content": "i never was a real manga fan , although i have already seen sometimes manga movies i found them interesting but i never said wow this is awesome.....well ninja scrolls is THE MANGA MOVIE really made me say WOW!!! After 5 years i saw more mangas and now i still think ninja scrolls is one of the top 5 mangas of all time.It's bloody action non stop the battles within the characters are the most spectacular i ever saw and believe me i saw many.I think it's the first movie a non manga fan should watch ,a manga fan has already seen it of course as it is considerated as a classic.It is not recommended for persons who don't like violence as some scenes are pretty gore bloody, but someone who likes blood it's an absolute must see here !!! check this out",
            "review_date": "2006-01-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Gory, Bloody, Violent. Awesome!",
            "content": "First of all, i loooove anime movies. They are best (right after Jackie Chan of course)! Ninja Scroll is without a doubt one of the best anime's i've seen. It is very gory, i must say. It is rated R and 18 in many countries. Here in Finland is 16. When i first saw Ninja Scroll, i was about 10-11 years old. I had seen Pokemon's and other kids anime, and i saw Ninja Scroll in the rental store. It was then rated 12! I dont know why, it must have been a big mistake. Well i started watching it alone. Like i said, i was just a kid and stopped after 20 minutes. It was way too violent for me. I literally was shocked. I didnt watch it until year ago. And it didnt shock me. At all. It's a good movie and that is true, its damn true!Watch it if you like anime, and you are older than 14.",
            "review_date": "2004-01-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best ninja anime ever?",
            "content": "Ninja scroll is probably one of the best ninja animes ever made. I'm totally fascinated about how the works of effects, and how they choose to tell the story during the action scenes, such as ninjas fighting. I still do wonder though, if this piece shouldn't have been just a little bit longer. I sort of demand more background information about the characters and about Gemma and Jubeis past. It's for sure one of the best ninja animes out there that I've seen this far in my life. I'll give it a 7, very close to an 8 and it could've been even higher if it would have been like I described it earlier. See this or be square :-)",
            "review_date": "2004-04-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great melodrama!",
            "content": "Regarded as a classic among Anime communities. One of the first few to gain recognition, with Akira and Fist of the North Star. I remember watching this years ago, it is now that I thought I'll add my opinion. Having just watched the anime, it still awes in animation quality.The story is based in Feudal Japan, with many ninja clans. There is an epidemic spreading, and rumours of the 8 ninjas from the Shogun of the dark clan have a secret agenda. The government and the locals clans are suspicious, so they start their own investigation. Jubei (our hero) is in the mix of all of this. Who meets up with Kegero, a survivor in the midst of the investigation.Jubei is the like-able, mysterious, lonesome warrior that really does not want to get involved. The 8 ninjas all have unique abilities, that create great action set pieces. One that can turn himself to stone, the ability to crawl into the shadows, and many other strange powers. Jubei and Kegero have to come against all of these foes and uncover the secret that are behind the Shogun of the Dark.Plot wise, is just enough to get the story going at a fast pace. To me it's like a mixture of Eastern background, with the premise of a Western action movie. It's really there to set up the action. So don't think of it as a great story, it's about character, situation and action.Animation is one of the best there is, though with the use of some flashing lights in backgrounds, (when in action shots,) looks a little cheap. It works. There is some nudity, which I felt wasn't really necessary, but could be needed to boost a higher certificate rating. As this is a very violent movie.The movie does move very fast, and it seems it wants to create a showdown for each of the 8 ninjas in the Shogun of the Dark. At times I felt they could have milked them a bit more, but it stands very well as a 94 minute movie.Overall it is visually a great piece of art, and has started it's own genre. With many spin offs that does not live up to expectations, like Sword for Truth, for one. It is great melodrama at it's best. A movie that could only be animated, and never be a live action.A-",
            "review_date": "2003-08-02",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "My favorite anime movie, yet!",
            "content": "This is my favorite anime movie so far.  The movie was just well made with its superb cartoon and its dialogue works just well with the movie.  This movie is a bit weird with all of its characters characteristics, but you'll find that they are quite amazing of what japanese cartoon can do.",
            "review_date": "2001-04-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "simply amazing!",
            "content": "now, this is another kick ass anime that deserves the highest ratings! never have i seen gore and disembowlment done so well. the fighting is incredible, the monsters are awesome, and the story is very intriguing. some parts may make you sick, so be warned. if you love feudal japan and ninjas, then this is the one to see!!",
            "review_date": "2001-02-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Entertaining",
            "content": "All the people of the town of Shimoda have been killed by a plague. The local government, the Togugawa clan, send a team of ninjas to investigate but all but one of them are wiped out by mysterious forces. The only survivor is a woman, Kagero, who is taken prisoner. A samurai mercenary, Jubei, rescues her but his interest in her mission and cause is temporary...Entertaining Japanese animated action-drama. Some good action scenes, well animated with reasonable amount of intrigue. Broad plot is fairly interesting.The plot is also the weakest part of the movie. Not always coherent, with many random twists and turns, things not making sense and badly badly-drawn (in the figurative sense) characters.Entertaining enough though, just don't try to make complete sense of the story line.",
            "review_date": "2017-07-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Film Class Story -- 8 (Very Good)",
            "content": "Six years ago, I took a film class in college taught by P. Admas Sitney, probably the most cynical and critical man I've ever met in my life. At that time I was watching a lot of anime, and after watching NINJA SCROLL on videocassette, I arranged an appointment with Professor Sitney one sunny afternoon to see what he'd have to say about it.Have you ever watched anime, I asked him. Since he hadn't I lent him my copy of NINJA SCROLL and spent one week wondering to myself whether he'd watch it or not. The following week, he handed me back the video and said, \"It's garbage.\" I was stunned, but he gave me one reason why he thought it was no good. Hollywood, he said, has abandoned the idea of hard eye-straining work. CGI has taken over since the days of Steamboat Willie, and the idea is more money and technology to save on blood sweat and tears. \"That is one of the many problems with modern animation and it is specifically the problem with the video you hold in your hands.\" I was so disappointed that I didn't bother to ask him to comment on Japanese culture (although he did screen RASHOMON in his class), and I was depressed for all of two hours before I found something other to do than sulk on a sunny afternoon.Six years later, I cannot agree with Sitney more. 99 out of 100 anime's in the Japanese market are shot at a choppy 1.0 frames per second and give you a strobe light headache. As for popular animation in Japan, you'll find nothing but Pixar dotting the shelves of your local Tsutaya or Geo video stores. Even the big-name anime's will only get five cover boxes at the most, which all lie in the shadow of hundreds upon hundreds of NEMOS.NINJA SCROLL is very good, and you know, Sitney probably remembers our little visit and parts of the movie. Maybe. The movie features plenty of graphic violence, ninja spirit, and an mediocre storyline. Probably the best part about the movie is its Big Trouble in Little China style team of demons, each one with a quirky power like turning into an army of monkey heads or something. That's the good part. The bad part is that 70 percent of it is very stilted and jilted animation which is too much for an 80 minute production. That being said, please watch NINJA SCROLL and get back to me which you like better, conventional Disney CGI or 0.01 fps hand drawn strobe light. (Plus, you should wait for the full moon to pass, because you never know.)JYjimboduck-dot-com",
            "review_date": "2005-03-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Japanimation at it's best...",
            "content": "Ninja Scroll is deserving of more credit.  It is clearly one of the best Japanimation films ever.  Many believe it to be better than Akira.  Yoshiaki Kawajiri's story comes to life through carefully constructed characters such as the silent but deadly Jubei, and the female who with a poisonous touch, Kagero.  These two team up in an attempt to save an overthrow of the government by fighting some of the deadliest villains of all time.  Each having their own unique power, including the leader of the villians who cannot be killed.  How will they accomplish the task of ridding them from this area in feudal Japan.  You must watch to find out.",
            "review_date": "1998-09-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "GREAT Anime",
            "content": "This is the best Anime ever. It is one of my favorite movies ever. The plot and characters are all great. It's just Wicked.",
            "review_date": "1999-05-10",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Simple and well produced",
            "content": "This isn't meant to be a huge epic, or a movie to make you think about the value of your own life and proceed to set goals to improve yourself. This is a very fun movie about ninjas and supernatural beasts. Who doesn't like supernatural beasts? And ninjas? Anyhow, the fight scenes (Of course there are fight scenes, fight scenes without ninjas? Wouldn't dream of it) are very well animated, and have that certain 'magic' to it.A love story somehow gets into the movie, and it's actually fairly well done, and not something that the producer just threw in for the sake of having romance. The voice dubbing was well done, although I'm sure that the Japanese version was better (everything's better in Japanese!), and I didn't find the liberal use of blood to be all that distracting. Sure, sometimes it seems like their bodies were a geyser, or something, but it wasn't TOO extreme, compared to some other things I've seen.All in all, I'd recommend you see this movie, it's more of a Jackie Chan flick than a Matrix epic, but they're both good, so why not see some nice and fun action? 9/10.",
            "review_date": "2002-06-30",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A staggering, surreal and incredibly violent animated historical fantasy",
            "content": "Yoshiaki Kawajiri's Ninja Scroll (1993) is a stunning, animated fantasy adventure, set during the feudal period of Japanese history, and focusing on a renegade assassin forced to take on a clan of mystical samurai warriors with supernatural, or indeed, superhuman abilities. For me, it is one of the most memorable and rewarding Anime films that I have ever seen, and yet another success for the prolific and highly talented Kawajiri; a director whose notable credits include Wicked City (1987), Hell City Shinjuku (1988) and Cyber City Oedo 808 (1990). The world of Ninja Scroll could be seen as a direct continuation of the worlds of Wicked City and Hell City Shinjuku, with monsters and demons invading a seemingly naturalistic environment and subverting it, whilst simultaneously offering us a film rich in character, action and convincing period detail.The story is full of texture and information, while still managing to find room to pander to the genre's prevalent notions of sexual violence and gore; as limbs are hacked off in jet-streams of blood and characters engage in brilliantly rendered scenes of balletic swordplay, magic-tricks and martial arts. If you're a fan of Kawajiri and of Anime in general then this will appeal, but even so, the style of the film and the world that the filmmakers create is seriously impressive, even for someone unfamiliar with this particular animated sub-genre. I certainly wouldn't class myself as an Anime expert, but I love film, and will generally watch anything, especially animation. If you think a film like this is simply for adolescent boys, you're very much mistaken. The creation of this world shows real skill and imagination, while the overall direction of the characters and the narrative are seriously out of the world.The design of the film reminded me very much of a particular style of Japanese cinema prevalent in the 1960's, when elements of history, folklore, theatre and expressionism were combined to produce ethereal, other-worldly and incredibly stylish supernatural dramas like for example Kaneto Shindō's Onibaba (1964), or perhaps more directly, Masaki Kobayashi's epic, slow-burning masterwork Kwaidan (1964). Like Kwaidan, Ninja Scroll exists in a carefully created, abstract fantasy world of vivid colours and intangible images. These images both tell and propel the story, pushing us further from one vibrant, violent and imaginative fight-sequence to the next as we are introduced to a number of notable characters, from a seductive female assassin whose lethal snake tattoos literally come to life, to a giant man-mountain murderer seemingly made of stone.By the end of the film we start to see elements of political intrigue and corruption developing alongside the historical and supernatural themes, and a depiction of literal inferno of revenge and retribution. Granted, most of these themes can be taken as window-dressing to pad out the scenes of violence and combat, but you could probably level the same criticisms at films like Crouching Tiger, Hidden Dragon (2000) and Kill Bill (2003-2004). I often wonder why so many supposedly serious film fans are snooty when it comes to animation? For me, it presents cinema at its most limitless and pure; a world of possibilities where anything is possible. Just look at Jubei's fight with the blind swordsman in the forest for instance to see an absolutely peerless use of movement, sound, colour and composition. True, it might not be an absolute classic masterpiece, but it is, regardless, a great piece of work.",
            "review_date": "2008-04-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perhaps the best pure action anime film there is",
            "content": "This film is very similar to several other action films (animated or live action) in that we have a plot that resembles a video game and it has even a final boss and everything, including several sub-bosses with their own special skills! The main character is your usual good-guy who appears to be a normal fellow but in fact is the toughest of them all. However, despite feeling like a video game, this film deserves such very high rating (8/10) because it is an almost flawlessly executed pure action movie: it is perhaps the ultimate video-game film. :)If Tarkovsky is the French wine, this is the junk food for film buffs. Highly recommended for fans of action films and even for people that like films in general because this is entertainment!",
            "review_date": "2012-11-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of the best Manga film since \"Fist Of The North Star\".",
            "content": "With Manga films your always guarunteed the usual combination of ingredients mixed in one: violence, blood, crude language and of course sex.The first film to catch my attention was Fist of the North Star, which was without a doubt the best since Akira. .  . But Ninja Scroll would help change that.One of the best kick-ass martial arts adventures to rival the likes of Crying Freeman. This for me is one anime that begs to be converted into a film. I just hope if they do, they can pull it off with just as much style as Cristoph Gans did for Crying Freeman (the same director who brought us \"Brotherhood of the Wolf\" fame).Wonderful animation really helps brings this film to life with sinister voices, lovely music score and violent attacks. Trust me if you want all this look no further. Ninja Scroll really does draw \"BLOOD\".",
            "review_date": "2002-04-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Top-drawer Anime",
            "content": "For those who can get over the stonkingly over-the-top violence, graphic sexual violence and fire hoses of blood, this is one well-polished anime, one of the best examples of the genre I have seen. See this film and marvel at the care that has been lavished on the landscapes, some of them as delicate as Japanese silk paintings, an incongruous backdrop for all the gruesome brutality splashing across the screen. The sunlight, fog and rain sequences are glorious to beholdThere's a bit of plot there too, with our world-weary samurai Jubei coerced into a battle to the death with an old foe. Leaves you begging for a sequel, which must rank it as a success. See it with someone broad-minded.",
            "review_date": "2001-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Waste of time.",
            "content": "I really don't understand what's the fuss about this one. Personally I think that this movie is much overrated than it should be. Nothing in it really touched me or excited me. Generally I love anime, and most of the movies ( animated ) with high marks, turn to be quite good, or at least worthy.The plot is very straightforward, without any interesting deviations or occurrences that could make me be excited.My overall impression of that movie was that everything in it is fictional. There is nothing that connects those characters to real people ( ninjas or other warriors ). This is what I think this movie lacked the most; the detailing, that make the characters less animated, even though they have unnatural powers.There's a lot of mystics, but there is no reality, and mystics alone looses its magic when it can't be compared. Mystics should thrill us, and take us with the gravity of the unknown and the unexplained. But instead, here, it is a casual thing, without any explanations, just to get the plot together.Maybe, It's because of the movie's explicit sex scenes and blood, that others rate it so high, but I just can't find it satisfying enough.I really got disappointed from Ninja Scroll, because I had high expectations about it ( as I explained above ). Maybe seeing it without such an expectation, if the movie's credits weren't so high, I would be less disappointed and rate it appropriately. But then again, I wouldn't probably see it. There's a lot of great anime, and in my opinion this one is far from scratching their middle. Skip this.",
            "review_date": "2006-01-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Pretty Good",
            "content": "This was the first anime movie I have ever sit through, and I have to say it's pretty good. I didn't find it as extreme as other reviewers have, but maybe that's because cartoon violence doesn't have the same affect on me as live action violence. But this being my first experience into anime, it seemed pretty tame. (Do keep in mind that I watched Ichi The Killer the same weekend, so my view may be a bit skewed) But I'd recommend it to any fellow first timers and for anime/magna die hards. The animation was excellent, as well as the voice acting. My only complaint was that I missed out on about 10 minutes of the movie because the disc was scratched or my DVD player sucks. I'm also looking forward to the sequel.",
            "review_date": "2005-10-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Mindless, incredibly fun adult anime (mild spoilers)",
            "content": "You gotta love Yoshiaki Kawajiri.  He knows exactly what he wants and manages to achieve it in almost every anime he makes.  A Kawajiri film almost always has sex, monsters, gore, cynical or dillusioned heroes, and tons of style with absolutely no substance to back it up.  He's like a diseased little second grader, with no real grasp of human psychology but a brilliant understanding of how to make a mindless, purely entertaining film.Ninja Scroll is probably his best work to date.  Its animation is detailed and beautiful, its story lurid and engaging (though somewhat predictable), its monsters terrifying and well designed.  You'll never forget the rock monster or the guy with the wasp nest on his back or the immortal Himuro Gemma.  What sets this apart from Kawajiri's other films, though, is the complex male/female relationship at the core of the story.  Sure, a guy and a girl mistrusting each other at first but eventually falling in love isn't exactly anything new, but it works surprisingly well here.  This is a movie where a guy literally has to make love to an incredibly beautiful nude woman to save his own life, but chooses NOT to because it wouldn't be right.  It's an amazing scene that shows a tremendous degree of restraint on Kawajiri's part, and it brings striking depth and emotion to what would otherwise have been a completely empty movie.If you can stomach the gore and a pretty nasty rape scene, you'll probably enjoy Ninja Scroll.  It's a great little guilty pleasure film, well animated and full of great action sequences.  Pop it in late at night after a really stressful day.  It'll make you feel like a diseased little second grader all over again.",
            "review_date": "2000-11-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not a bad movie, though somewhat clichéd",
            "content": "The first time I saw this manga movie I wasn't all that impressed with it because of the amount of degrading sex scenes and rape in it. At that time I was pretty close minded about the whole thing, and I guess that is a bit degrading but there is more to this movie than just that.Basically a village is infected with a plague and a group of ninja are sent to investigate and are all killed by a huge demon. Slowly the plot untwists to reveal what was going on but I really cannot go too deep into this because I really do not want to spoil it for you. Though it turns out to be pretty ordinary, there are only a limited amount of secret conspiracies that one can do so it comes down to how it is executed as opposed to what it is, and I think the execution is actually quite well done.I guess the thing that makes Manga stand out is the freedom that one has when creating animated features as opposed to normal features. Here we have some rather horrific looking creatures that the heroes confront, including a ninja that strikes from the shadows and a huge rocklike creature that could easily crush a normal human in one of its hands. The animation is also very smooth and a lot of effort has gone into it.The main aspect that stands out is the tragic element to this movie. The main characters slowly become attracted to each other but the problem is that the woman is poisoned. She is immune to her own poison, but if she has sex with anybody else they will be killed by the poison. That literally creates a rift between her and the rest of humanity as she could never truly love anybody because everybody whom she comes close to will reach a point were they will die. As such she distances herself from everybody else, though the main character continues to try to worm his way into her life, not because he wants to sleep with her, but rather because he wants to work with her.Beyond the plot, the movie is well made and the story is very well constructed, creating a relationship that is ultimately terminal. There is only so far that they can go, but there is another hand that keeps on trying to manipulate it. In the end, this movie works out well, leaving us with an empty feeling regarding this lost relationship.",
            "review_date": "2013-10-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Epic samurai/ninja anime",
            "content": "\"Ninja Scroll\" is an action/anime made in 1993 by Yoshiyaki Kawajiri. This film is set in the feudal Japan.Basic plot: A wandering samurai named Jubei Kipagami, who originally served the Yamashiro clan for years ago, is traveling on the land alone. People in a small village have died by a mystical plague, so a team of ninjas is sent to investigate the case, only to get brutally killed one by one by a rock creature named Tessai. The only survivor, the beautiful Kagero, gets raped and blood poisoned by Tessai. But Jubei saves her and kills Tessai, and sets out to annihilate a group called the Eight Devils of Kimon lead by the demonic Gemma Himuro.Throughout this film, there are lots of sword violence and several supernatural violence, which often get bloody result. This is enough to keep the mature fans of Japanese animation and ninjas interested. The soundtrack fits well in many of these scenes, especially during Tessai's attack and the ending scenes. The animation and the graphics itself are beautifully made, and so are the scenes with Jubei and Kagero together.This film is the fourth 18-rated anime I've seen after \"Shadow Skill\", \"Venus Wars\" and \"Akira\", well this film was at least rated 18 in Norway when released on VHS by Polygram Video. Like the other three anime movies I mentioned, this film was also English dubbed, but not subbed in Norwegian. On the Norwegian DVD copy I have, this film has been heavily toned down from being 18 to being rated 10 (!), something I just didn't like because of the fact all the nudity and the gory violence are intact on this DVD edition. In my opinion this film should have gotten at least a 15-rating.Are you a fan of ninjas and anime in general but haven't seen \"Ninja Scroll\", I suggest you to check out this film at least once. Honestly, this have to be one of the better ninja anime I've seen, together with the \"Naruto\" franchise. My overall rating for this film is therefore 9/10.Some of the other movies from Yoshiyaki Kawajiri to be mentioned include: \"Wicked City\" (1987), \"Demon City Shinjuku\" (1988) and \"Vampire Hunter D: Bloodlust\" (2000).",
            "review_date": "2013-10-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "An excellent story breaking the bounds of imagination.",
            "content": "Set in the times of feudal Japan, where samurai and ninjas battled to the death, this finely animated movie has everything you need to make an exciting story to watch. Twists together mystical elements, fast pace martial arts, sword fighting and romance. If you like blood and gore in a movie with an excellent story line then Ninja Scroll is the movie of you!!!!",
            "review_date": "1998-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfectly evocative animation.",
            "content": "This is, quite probably, one of the most amazing full-length animefeatures I've ever come across.  It is animated with such delicateskill that the plot is, at times, secondary to the image appearing onthe screen.The simple beauty of the landscape, the powerful images of thepoisoned villagers, all of these contribute to the mastery that NinjaScroll shows.  There are a few scenes which stand out, at least inmy mind.  The first is the duel between Jubei and Mushizo, thehunchbacked ninja, in the water.  The animation of the combatantsin the fluid environment is exquisite.  Secondly, the animation inthe duel between Utsutsu and Jubei is unparalleled.  The sensethat is given in all of the actions, the tension that is hidden withineach of the figures makes the scene more real than most real-lifecinematic ventures.Don't watch if you're squeamish about violence: there is a surplusof that in this movie.  It's rather dark, but that only serves to add tothe overall effect.",
            "review_date": "2001-05-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Hey, it is the porno/hentai version of \"Mortal Kombat\"!",
            "content": "Tsk tsk, what happened to you Kawajari san? You made good anime cartoons like Lensman, and now look, you are falling into the plotless unoriginal hentai phase.Not that I hate adult only cartoons, some are actually quite funny (Nude and Nuder) or well written (Kizuna). But Jubei Ninpocho is neither. Though the animation is excellent, the plot is almost non-existant, japanese voice acting is just like ANY OTHER ANIME, and not to mention pointless shock value galore (how much red ink did they waste with this movie? It could have all been used to grade school test papers!)If you want good hentai, watch Kizuna or the Korean sex comedy, Nude and Nuder.",
            "review_date": "2003-06-05",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Enjoyable watch / anime classic",
            "content": "Recently had another look at this 1993 animated film, and it's still an enjoyable watch. The animation's great, the action sequences exciting. The setting's dark atmosphere is put across well, aided by the theme song, which really makes you feel something's brewing. The different adversaries and their abilities are entertaining and creatively conceived.The story and structure however are not very original. There's the love story: two kind souls in a harsh world, who meet each other for a brief moment, until fate pulls them apart. And the main character: a lone wolf facing off adversaries, until he eventually gets to the top guy (with whom he shares a dark past). Both have been done many times before, I'm sure, but don't let that hold you back. Instead, you can put on the film, sit back, and I'm betting you'll enjoy the ride.",
            "review_date": "2014-08-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Though famed through out US, not the best. . .",
            "content": "From all the hype and good reviews I have heard various friends of mine tell me about Ninja Scroll, I was expecting something very astonishing along the lines of Akira or Laputa, but what I recieved was a blood bath, that some how had a love story weaved into it, and at least two other very altering scenes.  Yet, with all this \"great\" aspects, the story line was weaker that I would have liked, the direction was very noticable and the events were mostly predicatable.Even though the story line fell short of par in my league, I was still pathetically entertained by the very excitement of this ninja hack-n-slash film, and would recommend it, but would not give it all the hype that it recieved.",
            "review_date": "2000-09-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Worth a look",
            "content": "This isn't really one of my favorites now in 2002, but when I saw it in 1995 (when I finally started getting back into anime again after not seeing any since Getta Robo G and Brave Raideen in the 70s, and Yamato, Macross and Akira in the 80s) I really enjoyed it. The reason I want to comment about Ninja Scroll is to say that I find that a lot of people who consider themselves to be \"hardcore anime enthusiasts\" often dismiss it as shallow and mindless ultraviolence + gratuitous nudity. While that isn't TOO far from the truth, this still has enough going for it to keep it out of the trash bin. The villains, the '8 Devils of Kimon,' are reason enough to give Ninja Scroll a chance.",
            "review_date": "2002-02-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good ninja movie!",
            "content": "After watching \"Sword of the Stranger(2007)\" recently, IMDb recommended me to watch this and so I did! Honestly this was really good, the story line was smoother and funnier, although there is gore but not a large amount as \"Sword of the Stranger(2007)\" had. It was really sad that the ninja girl who occupied the Ninjaguy Jubei and the old man through their journey to travel to get rid of Jubei's enemies from the past, died in the end. Seriously, his past enemies really did become invisible the last time he killed them ahaha!This movie really does sorta remind you of Dragon Ball Z or Sword of the Stranger. Its really good and I would definitely recommend this to all anime fans out there!",
            "review_date": "2017-04-20",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolutely gorgeous!",
            "content": "How often does it happen to you, that you feel the irresistible urge to watch the film again STRAIGHT after you've just finished watching it? Well, certainly not every day - I don't really remember when was the last time when it happenned to me. But Ninja Scroll is a prime example of such film - you'll want to see it again & again & again, and then maybe a couple of times more. It's absolutely fantastic, in every sense & aspect. The plot may seem a little too complex, but actually it is a relief to find a truly challenging film that requires all your attention in order to get its point across to you - especially in the age of no-brainer entertainment. The animation is superb, the characters are intriguing - and ah, the fight sequences.... This is the most smashing action film I've seen in years, all the fights are imaginative and breathtaking. Brilliant, just brilliant, what more can I say? Buy it, rent it, steal it, own it, and watch it, or your life will never be complete!",
            "review_date": "2003-02-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best anime ever?",
            "content": "I've started watching animations 5 or 6 years ago. I was amazed how Manga animation took the term one step ahead of anything ever done in the past.Jûbei ninpôchô or Ninja Scroll is by far the best animated feature i've ever seen. The breathtaking action sequences, the disturbing blood-filled fighting scenes and the brilliant plot are things that i couldn't even imagine before watching it. The incredible attention to detail and beautiful imagery in this movie are something truely profound.The story is very clever and the more times you watch it, the more details you discover, which makes the movie more enjoyable every time because you can enjoy the fighting scenes without having to think about the story-line all the time.I really recommend this film to everyone because it brings to life another era, another world which will leave you stunned, i guarantee it.After watching animation for 4-5 years, i have come to the conclusion ... this is the one!",
            "review_date": "2002-08-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great Anime!",
            "content": "This was one of the best anime movies I have ever seen. Hope there will be a sequel. Jubei is the coolest swordsman ever. Too bad that the stone-man fighting scene was not longer. He was really nasty. Awesome music as well. All in all worth to see :)",
            "review_date": "2002-10-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Anime's Darkest Hour and Thirty-four Minutes",
            "content": "If this movie is worth seeing at all, it's to give you a perspective on how low-brow the majority of denizens of this horrible, horrible world are. Ninja Scroll neatly embodies all the worst things about anime, and through its popularity is greatly responsible for the negative stereotypes about anime held by the US mass media.Ninja Scroll belongs to the 'ultraviolent' class of anime, in which it is common for a sword wound to gush approximately 150 gallons of blood.  In order for a body to hold this much blood, it must be stored in an extremely high pressure gaseous state, because whenever someone is cut they emit an 8 foot high geyser of blood.  Of course ridiculous gore isn't enough to please Ninja Scroll's upscale cadre of fans, so the \"film\"-makers cleverly added copious amounts of sex to keep their attention.  And while many anime movies include so-called \"fan service\", Ninja Scroll uses less subtlety than a 1970's french porno movie directed by Larry Flynt and Wilt Chamberlain. Now you may be thinking, \"Superfluous sex and violence? How can this movie possibly go wrong?\" so let me continue to the discussion of the plot and acting.**Very Minor Spoilers** [Note: It's not possible to -spoil- Ninja Scroll] Ninja Scroll follows the basic plotline used by many serial comicbooks(or graphic novella if you prefer).  Mysterious-Swordsman-Wanderer-Guy with fantastic skills and an unknown past appears and uses his fighting skills to beat Evil-Ugly-Brute-Guy.  Mysterious-Ancient-Sage-Guy shows up and tells M-S-W-G that he needs defeat Super-Evil-Strong-Devil-Boss.  M-S-W-G reluctantly agrees, and he and M-A-S-G go on their quest to defeat S-E-S-D-B, occasionally aided by Pointless-Ninja-Girl-Sex-Object.  Along the way they meet many powerful hyphenated enemies serving S-E-S-D-B, who are defeated by M-S-W-G[note: from now on I'll just refer to him as Jubei{note-in-a-note: Jubei's character is supposedly 'based on' the famous Japanese warrior Yagyo Jubei, however their only connection is the name}]. I'm sure you can figure out the rest of the storyline by yourself. **End of Spoilers**Although the enemies are all based on previous anime cliches(just how many guys with invisible razor strings are there in the world?) they still remain interesting foes for Jubei to face.  The major problem is that there are just so many of these boss-type enemies that each of Jubei's showdowns with them last about 15 seconds or less after the enemy gets done introducing their special powers.  Likewise, the story skips from fight to fight with little to no story/character building in between.  This turns out to be a blessing in disguise, as the acting in this movie is abysmal.  I've only seen the dubbed version of Ninja Scroll, so these comments do not reflect the original Japanese voice acting.  Being that this movie was released in the US in 1995, it's not surprising that the voice acting is flat and lackluster.  Only recently have we started seeing quality dubbed anime(like the excellent Sol Bianca: The Legacy).  With a pure action movie such as Ninja Scroll, good voice acting is not expected, or really needed. However, there is little excuse for the poorly written english dialogue.  Catering to its expected audience, the dub is full of stupid, unnecessary profanity, presumably to make it seem more edgy.  It should be noted that with one exception, there are no profane words in Japanese, so a proper translation should only contain profanity to express extreme emotions.  To round out my critique I should say that the animation quality is not as good as some movies released in the same time period(Ghost in the Shell), it is still pretty decent.In closing, let me say that I'm constantly disgusted by the number of people who rate this Ninja Scroll as their favorite anime.  As an anime fan you should probably watch this at least once, if only to see what the fuss is about.  If you ARE a fan of Ninja Scroll and similar anime, let me give you this advice.  Watch Berserk, then watch Rurouni Kenshin first OVA(Samurai X: Romantic Tales of the Meiji Era in the US), then watch Record of Lodoss War, then Vision of Escaflowne.  By then you should be have been slowly weaned over from ultraviolent anime.  If not, take my other advice and jump into a deep pit.4/10 on quality 1/10 on principle",
            "review_date": "2002-01-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Confusingly plotted and sickeningly violent, but with fantastic action scenes",
            "content": "\"Ninja Scroll\" is a story told so confusingly it makes you think it is much more complicated than it is. Is that the point? You get sparse plot details in the first few minutes which aren't explained until an hour later. By that stage, you can't remember the beginning details, or you don't care.Perhaps as a result the movie feels much longer than it is, at only an hour and a half. The sparse details make you feel like you are watching an epic, when actually, the plot is pretty basic.It is something to do with a battle between ninja teams and a \"vagabond\" caught in the middle. On one side, the ninja are all superhuman or supernatural beings, with abilities such as turning their bodies to stone, generating electricity and being able to hide in shadows. The movie is, really, just a series of fantastic fight scenes, but I kept coming back to the confusing plot.But there is only one reason why anybody watches \"Ninja Scroll\", and I'm aware it's not the plot. It's the action scenes, and they are impressive. \"Ninja Scroll\" is one of few animations I've seen that is sickening in its violence. There are scenes I can't watch, with limbs being torn from bodies by blood-drinking golems and faces being headbutted in.There is also a fairly misogynistic streak in the film you might detect. The female lead, and love interest to the protagonist, is the victim of sexual violence not once but twice. Aside from that the only female character in this movie is spurned by her gay love interest.",
            "review_date": "2017-10-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "pretty cool, but don't expect a real story",
            "content": "this was one of the first anime movies i'd seen, maybe the first, so of course not knowing any better, i thought this was as good as they came. i now know this to be untrue. well, to be fair, i guess it depends on what you're looking for in an anime movie. if you want something original, moving, beautiful, or intelligent--stick with Akira, Royal Space Force, Grave of the Fireflies, Roujin Z, Princess Mononoke, etc, etc...i think these are all examples of what anime can be when people who want to change the worlds perception of anime, make a film. they are all truly works of art, and are generally underappreciated by the public, largely in part to movies like ninja scroll. people see these types of anime, and think all anime is sex, gore,and bad voiceovers. its unfortunate, because the movies i listed above could really speak to many people in unique ways, and hey, those movies aren't without their share of violence either! i like violence too, i just like it with imagination, or on a bigger scale i guess. ninja scroll is very entertaining, and the animation is very very good, its just not what im looking for anymore. i gave it a 7 out of ten for very cool fight scenes , and slick animation, but thats all it is to me.",
            "review_date": "2002-11-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not a single scroll in the anime but who care ?",
            "content": "Because I've been a fan of anime and manga for a long time before I ever watch Ninja Scroll so needless to say I already had my fair share of some of the most brutal ones from the medium but I can't deny that Ninja Scroll is the one that introduces me to the old ultra-violent anime wave in America back in the 80s-90s and the phenomenal career of anime director Yoshiaki Kawajiri. Aside from the whole selling point of the anime for me is the action, the story is pretty generic and the violence against women may come to super-exploited level but compare to an unhealthy amount of trashy Isekai anime that been spit out by the industry right now the sheer brutality and gritty of the anime actually make me appreciated it more over time. If you tired of all the wishy-washy PG-13 of current anime then try Ninja Scroll because it may not be the best anime you've ever seen but it will definitely help refresh your mind",
            "review_date": "2019-08-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One Of The Greatest,,,",
            "content": "first off, I'm not a big fan of anime. I tried to sit through Akira,and it was rough. Akira was a disapointment, but it was visually exciting. For awhile, I almost gave up on anime because a lot of it sucked(I don't care for the violent sex and super-intense gore that pervades through many of these movies).But I happened to come across Ninja Scroll.This movie is excellent. The story is exciting,the characters interesting, and the art amazing! The main character Jubei is surprising as far as Japanese animation is concerned. He is cool, calm,slow to violence but quick to resolution. He actually has a heart and cares for others, and is willing to risk his life for friends and a noble cause. The villains are terrific(a hero is only as good as the villain). Truly menacing and threatening.At certain points in the movie you will actually wonder \"how will he get out of this one?\",and the relationship Jubei shares with the female ninja Kagero is touching and ultimately heartbreaking(and believe it or not, it's tasteful). He doesn't see Kagero as a sex object as would be the norm in Anime, but as a equal and as a friend.Of course it is violent and there are a couple of gratuitous sex scenes, but the overall package is beyond value. Next to Ghost In The Shell and Battle Angel as masterpieces.NOTE please view with engilsh sutitles. If you are like me you'll appreciate Anime that much more when the actual japanese actors do the voices.",
            "review_date": "2000-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ninja Scrolly",
            "content": "This film is exceptional...especially if you consider Hollywood a big yawn. If you ever have had a longing for fantasy, the touch of a woman you couldn't have, extraordinary feats of paranormal strength, and the abiltiy to withstand pummeling blows to the face and stomach from a guy made of rock...then you've always wanted to be Juebi. He is the man, very dude-like without all the white Russian's and he wields his sword with such ki that akido masters, jedi knights, and Lar Ulrich would be impressed with his full accentuation of force. He's beyond the \"lone\" mysterious figure, the one who--as my film professor once coined--\"drops a turd in the punch bowl,\" Juebi is larger than that. I'd put my chips on Juebi if it was Spiderman or Daredevil (wait, maybe not, if Matt Murdock was being payed by Assfleck, then yes), and a whole other slew of video game/comic book characters...maybe not Bugs Bunny, but Fog Horn Leg Horn for sure. The point is...this film is great for the imagination.",
            "review_date": "2005-06-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Anime at its finest",
            "content": "This is the best anime movie that I have yet seen. There is enough blood in it to make even the greatest horror movie buff say \"WOW\". The animation is great, the way the script is set up is sweet. The movie is just all in all great!",
            "review_date": "1999-05-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you have theatre sound,.....",
            "content": "This movie will hold you to the screen. The sound track must be used with good equipment to be appreciated but if you don't have it then the picture will do. This is an absolute must see movie",
            "review_date": "2000-11-28",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good teenager movie",
            "content": "This is a very good movie for adolescent males between 13 and 23 years old. It has good action, sex, characters, and story.  The only flaw is that the dubbed voices of the hero/heroine are terrible -- they sound like amateurs.",
            "review_date": "2002-01-11",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great animation",
            "content": "I brought this film out of faith in the Anime animation. I'd watched many in the past and only four had impressed, so my hopes weren't high. Luckily however this was one of the best, narrowly beaten Akira, I throughly enjoyed the excellent animation, the smoothness of the characters and the great story. Admittedly it's not to everyones taste but if you like manga it's a great example. However if you're a newcomer to the genre, rent Akira, if you don't like that then you've got no chance in the world of adult animation. 10/10",
            "review_date": "2004-12-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The Good Kind of Crap",
            "content": "First of all, the fact that this has a 7.9 on IMDb is freaking retarded. This isn't an action anime masterpiece. Its dumb, its shallow, its exploitative. If anything, it takes itself too seriously, taking time away from the action in an embarrassing attempt to develop the plot, characters and romance. Ninja Scroll is not an anime you wear proudly on your shoulder.But it is one of the better bad anime out there. Its so over-the-top in its gore and sleaze, its impossible to not laugh. The eight evil villains are a blast - they're less ninjas, and more X-men. They're very powerful and unique, but our hero always manages to survive. The action is pretty sweet. I had to rewind because the first scene was so fast, yet so busy! Add some good animation, and you've got action that never gets old.Do not expect a great anime going in, or you'll cringe at the awful dialog and rape scenes. Watch it when you have no dignity to lose. Then you can appreciate Ninja Scroll's bloody insanity.",
            "review_date": "2014-10-06",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good-but serious issues w/ women",
            "content": "I liked it, creative villains, good animation... but the portrayal & what happens to the female characters is quite strange.(1 tiny example- a woman who will kill anyone she has sex with?)",
            "review_date": "1999-07-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "what a beauty!",
            "content": "One of my favourite anime. Strong characters (bad and good), strong story, strong artwork.!",
            "review_date": "2021-10-09",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great animated movie, cool action scenes",
            "content": "First of all, I have only been watching a couple of anime movies before, among Ghost in shell and Akira. Therefore not a huge anime fan that I consider seeing all anime. But, I´m getting used to the stories and the way it´s animated.  Let your prejudices away and you will enjoy it as I eventually did.Anyway, this movie was both well animated and contained excited and bloody action scenes which made my expectation more than a dream. What more can I say, if you liked Akira, this movie is something you gotto see, specially if you´r a anime fan.I gave it 8 out of 10.",
            "review_date": "1999-12-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Awesome classic which every anime fan should see.",
            "content": "One of the best anime movies ever made.\nBeautiful hand drawn animation, great action scenes which would look great if they were live action, memorable and weird characters, an anti-hero main character who is a stone cold badass and cool music too.\nIf you have any interest in anime then you need to pick this movie up, it's absolutely brilliant and for me it ranks up there with Akira and the original Ghost in the shell as one of the best anime movies of all time.\nIt's definitely aimed at adults though so i wouldn't go buying this for your 10 year old who likes Naruto because there's copious gore, nudity and swearing.\nActually do buy it for your 10 year old, they will likely think it's awesome too.Absolute classic!",
            "review_date": "2019-08-31",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "I'm just not into this stuff.",
            "content": "I suppose I will get flamed for this, but I absolutely hated this movie. Yes, I didn't stomach the rape scene. Yes, I thought it was too violent.See, I saw this movie after enjoying a great deal Ghost in the Shell. I suppose I simply wasn't in the right mood to enjoy this movie... but there is more to that I'm sure.The characters are really uninteresting, the plot is weak, and the monsters unimaginative.But what really downs it is the action. I had heard I'd never see action like this anywhere else. Guess what? I thougth Crouching Tiger, Hidden Dragon had much better fights, so add this to great story, likeable characters and beautiful panoramas, there is no way I could possibly enjoy Ninja Scroll.",
            "review_date": "2001-04-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "the audience has spoken.",
            "content": "well, ive looked through the reviews for this movie, and for many others, and i think what i personally have to say is irrelevant. sure, i loved the movie; stunning animation, great story and plot, but i think the best recommendation i can give for this movie is to tell you to look at the other comments. this is the only movie so far i have seen that has nothing but positive comments. this is a must see for anime fans, or movie fans in general.to quote levar burton, in the reading rainbow,\"but you dont have to take my word for it\"",
            "review_date": "1999-10-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "lot less than its reputation",
            "content": "I watched this film because it is an anime very well known outside of Japan and considered very important, \"the founder of anime ninja in the world\".in my opinion is much less interesting than other anime like \"Ghost in the Shell\" and \"Akira\" (to name two well known abroad)the story is fairly trivial , the hero, the girl, the love between them, the old Japanese wise, the (supernatural) enemies. the images are very beautiful, very raw and shocking, the most important part of the movie.In conclusion I would say a lot less than its reputation. 6/10",
            "review_date": "2014-10-08",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Brilliant, must see for any animation film fan.",
            "content": "This movie is one of the best animated and well done movies that have been made. It does have a very high level of violence but that only serves to make the film more powerful. The animation is nearly flawless, not quite as good as Ghost in the shell but not too far off. If you are a fan of animated movies then you have to see this one, it has to be one of the all time classics.",
            "review_date": "1999-10-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Very Entertaining!",
            "content": "One of the better japanation movies, a decent plot and wicked animation make this samurai action flick stand out from the plotless/pointless/ultra-violent label that most anime flicks fall under. pick it up if u have a chance!",
            "review_date": "1999-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "If you are a twelve year old boy you might like this film",
            "content": "I was desperately attempting to find something remotely watchable out of my local Blockbusters' pisspoor 'Gold' collection to complete the three for a fiver deal when I saw 'Ninja Scroll'. The last and only other anime I've seen was a showing of Akira at a local indie cinema a few years back and it was really good fun, well animated, interesting plot, etc. so I thought I'd give this a go. Unfortunately, Ninja Scroll is a big steaming pile of tosh. You'd find more plot depth and character development in an episode of Pokemon, which, in a way, is what this closely resembles. Only with more decapitations. On the plus side I guess it fulfils most of the stereotypes for this kind of thing: gallons of blood spraying out of peoples necks, magical creatures, naive love story, etc. What almost saved the experience for me though was the unintentionally funny DVD extras; first an 'inside the actors studio' with two of the American voice artists:''What preparation do you do for your roles?'' ''I get in my car and drive to the studio.''And an interview with an obviously harassed and irritated director:Apparently serious interviewer: ''Was it your intention to realistically portray female lifestyles in feudal era Japan?'' (note: every female character in the film is a beautiful, scantily clad ninja assassin with ridiculous superpowers) Director: ''No.''",
            "review_date": "2005-08-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Good movie !",
            "content": "Best manga I´ve ever seen. The perfect plot and the fascinating characters make this the most thrilling animated ninja film of all times. Learning the most kewl quotes by heart will certainly make you the life of every party: \"You don't interest me, even in the slightest !\" Don't miss it !",
            "review_date": "1999-12-23",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Possibly a classic anime movie",
            "content": "I saw this movie first now in 2000, its 5 years old now and still technically and cinematically a great movie. This movie should in my opinion be regarded as a classic anime movie. I also enjoyed the setting of medieval Japan, great \"locations\" and beautiful drawings of landscape. I watched it on DVD with both English and Japaneese voice-actors, and the English dubbing was fit to the movie (compared to other anime I've seen). I cannot comment on the Japaneese as I don't speak it.I can really recommend this, also if you haven't seen any anime before. It's a classic.",
            "review_date": "2000-01-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "As an pure action film, is perfecly Ok.",
            "content": "As an pure action film, is perfecly Ok. It has lots of cool fightning, if you like the gory, morbid sort. The animation is good enogh. So if you like a good ass kicking, creapy yet rediculous bad guys, and think a good story(Though I have seen worse) and character developement is for pussies, this is a film for you. If you like this, go see, \"Sword for truth\", its basicaly the same. Average 4.2(10)",
            "review_date": "2003-10-01",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "This Gorefest is More Mature Than It First Seems",
            "content": "Jubei Ninpucho is cleverly structured and although it is not an inherently complex narrative, it features a very clever approach for presenting vital background information. Together with the mostly great animation, this makes for a thrilling viewing for anime fans and fans of (Japanese) action movies. There are some minor drawbacks, like characters that could be more fleshed out and the uneven animation quality - however, the movie succeeds in telling the story it wants to tell and uses very creative visual effects for telling a mature story.Overall 7/10\nFull review on movie-discourse.blogspot.de",
            "review_date": "2018-05-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "One of My ALL-TIME FAVORITE Animation",
            "content": "This movie is thrilling, artistic, and driven!I want the sequel.",
            "review_date": "2021-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Wow!",
            "content": "Sometimes, you see something that really surprises you...This is one of them! Stunning graphics, great story and twists, action galore and insight. Having your sabre in the forehead as your own retribution...poetic justice:)Totally not boring!!! Is this is your first Japanimé, checkout Ghost in the Shell and Spragam.",
            "review_date": "1999-07-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The best Anime movie I have seen",
            "content": "As a fan of the fantasy genre, I know it's hard to portray it on real films and make it look real and convincing as well, (for example: Dungeons & Dragons The Movie which was awful, and we'll have to see if The Lord of The Rings will shed some new light on the genre), therefor a lot of film makers prefer to approach the fantasy genre in the form of animated movies, in which everything looks real. The good thing about Ninja Scroll, is that beside of it's wonderful plot, it makes you feel as though the film is real and you can identify with the characters' feelings. I recommend to see this movie even to people who don't usually watch animated films.",
            "review_date": "2001-06-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The best piece of Manga I ever lied my hands on",
            "content": "The movie beautifully and masterfully shows the battle between Jubei and various devils. Its an action packed Manga with tasteful humor and lovely violent scenes. I recommend this movie to anyone who like mature action movies. Its a masterpiece.",
            "review_date": "2002-02-24",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A bloody tale of love and ninja war!",
            "content": "This film has resonated with me since the first time I caught it on late night television all those years ago. The characters are all wonderfully drawn out. The beautifully shot scenes of ninja battles and landscapes giving us an idea of feudal Japan. The dialogue, which you initially think is too simple and silly, becomes richer and more hilarious the more you watch and listen.I haven't seen a lot of manga but I believe this film is a perfect introduction for a Western viewer in broaching the genre. It has certainly piqued my curiosity about Japanese anime although I can't see myself enjoying any other anime film more than I enjoyed this one.If you haven't seen this movie, go out and get it, but be warned, it isn't for the faint of heart!",
            "review_date": "2008-06-22",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Excellent anime - and more...!",
            "content": "Without a doubt, Ninja Scroll (the US title) is indeed one of the most incredible excursions in anime we have been blessed with. If you are looking for worthy additions to your Japanimation, you *must* acquire this. the voice-over acting is superb, and the animation effects unsurpassed.More interesting yet, some of the visual trickery in use throughout many sections of the film: Watch Jubei reach his *entire* hand into his mouth to pluck out a tooth loosened in a battle with one of the villains. See Jubei take more damage than a barbarian on uppers, and get up to finish the job. Watch as the bodies fly asunder by threes and fours. Great eye candy. A must-have. Especially enjoyable on the mind-expanding substance of your choosing :)",
            "review_date": "1999-04-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Ten Stars!",
            "content": "Jubei is a masterless ninja who travels the land alone,  hiring his services to those with gold... or a worthy cause. His fearsome abilities have served him well, but a hideous plot to overthrow the government threatens to end his wandering ways and possibly his life. Get the DVD!",
            "review_date": "2000-11-13",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Landmark anime action",
            "content": "This anime follows the story of Jubei, a traveling mercenary Ninja who gets conned into a government spy's quest to stop A certain \"Shogun of the Dark\" from starting another civil war, while getting entangled with a beautiful female ninja who has a special skill all of her own.The plot, animations, and characters of this anime are great. While not considered one that raises consciencous \"issues\" like Akira, Ghost in the Shell, or Grave of the Fireflies, Ninja Scroll is absolutely guaranteed to entertain.This anime involves some of the best and bloodiest battle scenes ever seen, and the eight devils of Kumon are among the most memorable villains known to anime. However, the ending battle was kind of a letdown after the unique and exciting fare dealt up by the eight devils",
            "review_date": "2000-06-07",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best ninja film - not fan service",
            "content": "This film is a perfect rendition of modern kung-fu flicks using anime as medium instead of a style. For fans of sword of the stranger and samurai champloo. It set the bar pretty high for following anime releases.",
            "review_date": "2020-06-25",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The first, although not the only, anime I truly enjoyed.",
            "content": "Anime aside, this is a wonderful movie.  The artwork is phenomenal and the character development enviable.  One strong theme is the role of women in Japan's Tokogawa period and the near absurdity (at the time) of a woman ninja.  By taking a man's role, Kegaro denies herself her very gender in the presence of others, as seen in her waiting for Jubei to go down the road before breaking down emotionally after being raped by the demon, and holding her tongue through concrete-thick tension when giving her report to the Duke as he makes \"love\" to a geisha.  There is also a theme of continuance as the film both opens and closes with Jubei travelling to his original destination.  All in all a very well done piece and worth rewatching.",
            "review_date": "1998-12-27",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Best Anime film I've seen yet!",
            "content": "This is the one anime movie I recommend to anyone interested in the genre. Superb animation, Good voice acting, (in the dubbed versions of anime films, this is a rarity,) unforgettable characters. (my favorites are , the shadowy ninja and the blind ninja.)  It's got quite a bit of gore and some (seemingly gratuitous at times) nudity, but don't let that turn you off! Jubeii is one cool character and kigero is not your usual helpless female victim.  My favorite anime film yet!",
            "review_date": "2001-06-15",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "this is the movie that got me hooked",
            "content": "i've seen both akira and ninja scroll, and of the two, i'm glad i saw ninja scroll first. this is the movie that made me addicted to anime. if i had seen akira first (despite the fact that it is a good movie) i think i would have been like many of the people who don't like anime. ninja has what akira lacks, that is a script you can follow, better fighting scenes and more sophisticated artwork. it also lacks (thankfully) what famous anime like curse of the overfiend has, that is an overabundance of graphic sex. it's got the perfect balance to make an action packed ingenious movie. it is a must see. and for the addicts like me... tell your friends to experience this movie first, NOT akira. trust me, they'll be glad you did.",
            "review_date": "1999-07-04",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Absolute MASTERPIECE!",
            "content": "This, together with the Two Vampire Hunter D movies represents in my opinion the pinnacle of japanese cinematographic art. The characters have a wonderful and realistic personal development, they have extremely humane lows and highs, the fights are literally impeccable and often happen so fast you'll need to replay the scene to fully understand\n(blind samurai scene). All of this is topped on the absolutely amazing artwork that would probably be a global hit even if it appeared today, in 2022. I can't believe such beautiful art was created in 1993 when I was still swimming around balls, but so was the world back then. Movies were created for art, and to send a message, not just for profit, like today. I HIGHLY recommend you this movie, alongside Vampire Hunter D, Trigun, Cowboy Bebop, and Ergo Proxy.",
            "review_date": "2022-11-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Gotta Love Ninjas",
            "content": "Ive seen a few Manga movies, and have found them visually stunning but lacking in character and plot development, this however cant be said about Ninja Scrolls, what a movie, I had intially seen this on TV late one night with a PG rating, I was surprised as I saw that the movie was highly unsuitable for kids under 18, that aside I was most impressed despite the violence level showing a story worth sharing and raving about, its basically about a young man called Jubei who finds himself intangled in a civil war of sorts, where he mets a variety of Good and not so Good(evil) characters, heaps of fast paced action scenes, a bit of romance, betrayal and of course MDK (Murder Death Kill) this is an above average, Good vs Evil type of story, a movie that can follow to its conclusion it made me laugh and cry, you wont regret watching it if you happen upon a copy.",
            "review_date": "2000-04-21",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Perfect Anime for Bro Night",
            "content": "If you ever wonder what anime movie you can show your non-otaku friends then this is it, the action is fast paced, animation is beautiful, the characters are lovable and the dialogue is very good or funny in the english dub. Despite it's age it still holds up, and I have never once had a movie night where it was a flop, everyone seem to like or love this movie and you don't have to be an anime fan to enjoy it, maybe that's why it was better received outside of Japan than in Japan.",
            "review_date": "2021-12-16",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Great!",
            "content": "Clearly one of the best amimé´s i´ve seen. This is the one to see if you are new to japanese animation. Excellent animation, a little nudity and lots of action!",
            "review_date": "1999-02-03",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It's an okay film",
            "content": "The animation was not good at all.  It reminded me of Vampire D (1985) which had terrible animation, terrible story and terrible american voices.  The story here is decent and the characters are interesting, but once you've seen Princess Mononoke and Akira, your gonna wonder why there is so much hype around this film.  I'll tell you why = all the comments are from people who like action films regardless of plot or animation quality.  The voices here were terrible too.",
            "review_date": "2001-12-26",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "A well done anime",
            "content": "Ninja Scroll is a pretty solid movie. It has interesting characters who even come across well in the English dub. The plot moves along quickly with a fair bit of nudity and graphic violence. It has a variety of interesting villains with some likeable heroes and overall I enjoyed the characters. The action and animation really sets this apart from many animes. A lot of them suffer from a severe amount of static images or repeat animations, but this one was well animated and engaging to look at.Ninja Scroll probably isn't going to suddenly make a believer out of a non-anime fan but it's definitely one of the better ones and a good place to start if you're interested.",
            "review_date": "2020-11-18",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "The greatest japanese animation film ever.",
            "content": "This film shows what animation can be it has drama,action,and a great cast of characters it is a history making film that i will remember the rest of my life.the lead character Jubei is a great warrior and you find yourself cheering for him and then pitying him a second later.",
            "review_date": "1999-09-19",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Definitely one of the Classics like Akira or Ghost in the Shell!",
            "content": "Although I didn't really like Anime movies at first, I got the taste because of movies like Ninja Scroll. It is a good start for people who are interested in the genre, since the characters are not too freaked out and won't deter you like some other psycho Mangas. The cool main character Jubei Yagyu gives the edge to this film and the superb soundtrack creates a tense atmosphere, which will spellbind you. This one isn't to be missed - If you don't like this one stay away from Anime movies!!!!!!",
            "review_date": "2001-05-17",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "It doesn't get any better",
            "content": "The animation is simply the best, the story is very good and the art is amazing. The movie moves along very fast and has never a dull moment that I wanted turn it off. It has some sex scenes that are not meant for under 18. This is one of my top 10 animes of all time and it worth getting on Blu-ray.",
            "review_date": "2021-12-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Bad story, excessive gore",
            "content": "Ninja Scroll fails to accomplish what they are striving for in the movie except for the excessive quick gory battles.  Ninja Scroll tries to have other themes than gore, but they fail badly on everything but the pointless bloodshed.  The fight scenes are like an old horror movie, they just have a people dying every few minutes and throw as much blood around as they can. I compare this movie to a dragonball z type anime (which I don't even consider a real anime).  If I suggested someone to watch an anime, Ninja Scroll would be on the bottom of the list.",
            "review_date": "2002-07-29",
            "lang": "en",
            "source": "imdb"
        },
        {
            "review_title": "Not bad, but not a masterpiece",
            "content": "This anime wasn't so great, in my opinion.  The action scenes are good, but there's quite a bit of gore in the violence.  Still, the fight scenes are done well and the villains have several different unique abilities.There's also a brief sex scene, and nearly two rape scenes.  It's stuff like this that gives the rest of animation a bad rep.  Although the special trait of the 'ninja girl' is a curious twist, I'm afraid I'm not too fond of the story.On the plus side, it doesn't try too hard to teach morals or have a point. It's the story of two warriors, for better or worse.  I wouldn't suggest this movie, what with the extreme violence on one end and extreme sexuality on the other.",
            "review_date": "2004-04-23",
            "lang": "en",
            "source": "imdb"
        }
    ],
    "vibes": [
        "intact",
        "intriguing",
        "unreal",
        "famous",
        "delicate",
        "glorious",
        "gruesome",
        "incongruous",
        "polished",
        "weary",
        "copious",
        "exquisite",
        "ridiculous",
        "busy",
        "dumb",
        "visual",
        "emotional",
        "western",
        "comic",
        "extraordinary",
        "fortunate",
        "poignant",
        "stupendous",
        "complicated",
        "sparse",
        "gratuitous",
        "alien",
        "anatomical",
        "imaginative",
        "cheap",
        "lonesome",
        "necessary",
        "suspicious",
        "awkward",
        "inventive",
        "minor",
        "clever",
        "anti",
        "fair",
        "accurate",
        "gigantic",
        "obscure",
        "casual",
        "explicit",
        "fictional",
        "unnatural",
        "basic",
        "broad",
        "personal",
        "realistic",
        "impossible",
        "shallow",
        "non",
        "weird",
        "partial",
        "tribal",
        "horrific",
        "ordinary",
        "supernatural",
        "expensive",
        "initial",
        "ready",
        "theatrical",
        "crafty",
        "senior",
        "witty",
        "endless",
        "blind",
        "wonderful",
        "equal",
        "intense",
        "noble"
    ]
}