{
    "rating": 1.8,
    "release_date": "2000-10-27",
    "num_reviews": 170,
    "genres": [
        "Horror"
    ],
    "summary": "As it follows the twisted path traveled by five people fixated on \"The Blair Witch Project,\" \"Book of Shadows: Blair Witch 2\" journeys into a dark and dangerous place where the line between truth and fiction blurs and perhaps vanishes altogether. Individual perception grows increasingly untrustworthy as the film's protagonists find themselves caught in a vortex of unspeakable evil, the origins of which -- human or supernatural -- remain chillingly uncertain.",
    "reviews": [
        {
            "content": "I love how meta this movie is, pre-dating the concept of \"meta\" by at least a decade or longer. This movie focuses on a group of fans of the original Blair Witch movie (a fake documentary, but real in this movie) who travel to the very real town of Burkittsville, Maryland to catch a glimpse of the Blair Witch. From there the movie dives into full-on psychological horror, leaving the characters and you the audience member questioning what's real and what's fake. Overall, the movie's cheesy, but fun.",
            "review_date": "2023-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have never seen the first movie, boy was this a horrible introduction to the series.",
            "review_date": "2023-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Much like the title, Book of Shadows: Blair Witch 2, this movie does everything backwards. Instead of being a thrilling and horrifying found footage movie, like its predecessor, this sequel is more like student-made pseudo-intellectual fan fiction. It's wandered so far off the path of where the first film was, that it becomes almost unrecognizable as part of the original story. This horror flick tries to be so deep in all of its references and editing and cinematography, but it all comes off as pretentious and gratuitous. Book of Shadows was a waste of my time and a sequel I hope to soon forget.",
            "review_date": "2022-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The meta premise of the film is a great idea for a sequel, but that's where the fun ends. The rest of it is marred by absolutely horrid and clichéd made-for-tv cinematography and a complete lack of effective spooks.",
            "review_date": "2022-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the original, but still entertaining nevertheless.",
            "review_date": "2022-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film misses then misses again. It had very brief moments of potential but fails miserably.",
            "review_date": "2022-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A different feel from the original film that takes the fun out of the story and is all about money using a name of a movie that made more than it took to make is just another Hollywood stereotype that's true.",
            "review_date": "2021-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have a soft spot for this film. Its not a good sequel and no way as good as the first. but I do enjoy watching from time to time. I don't know why its rubbish",
            "review_date": "2021-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is terrible, looks like they were going for a massive franchise which ignores the original and adds crappy sequels, but I'm glad they didn't. Definitely a cash grab. 0/100",
            "review_date": "2020-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film does not make any sense. It's a soulless cash grab. The first one was way better than this disaster of a movie. I don't recommend this movie at all.",
            "review_date": "2020-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Book of Shadows: Blair Witch 2 is a case in study on how studio interference can ruin a promising idea. While the Blair Witch Project was controversial/divisive movie, people cannot deny its significance in movie pop culture and because it made twelve hundred times its budget back so naturally a sequel was inevitable. Director Joe Berlinger had the promising idea of making the sequel a satirical psychological thriller and the studio seemed intrigued by the idea and greenlit the sequel. Unfortunately, the studio did a complete 180 and wanted straight up supernatural horror film and as a result the script was change. As a result, it left a horrendously butchered experience of a film as the movie is left with nothing but a confusing story with huge plot holes, clueless directing, and scenes that led to nowhere. (For example, A group of tourists the run into the protagonists were there to show the global obsession of the first film, only for the studio to mandate they get brutally murder by the protagonists just to have some slasher gore.) As result the film was horribly panned by critics and left 16-year gap in terms of sequels. Fans have been hoping for director's cut to be released but as it stands the movie is an incomprehensible mess.",
            "review_date": "2020-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was really a tragedy. Not sure if I've ever seen anything worse honestly. It borders comedy. If you're looking for a scary movie this ain't it.",
            "review_date": "2020-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love everything about this movie, I loved the characters, I felt a great charisma in them, great actors and great cast, the only thing that is not good is part of the script.",
            "review_date": "2020-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Formulaic, but I found it way creepier and effective than the original. Still nothing special.",
            "review_date": "2020-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the book of shadows is no were as good as the first Blair witch. It sort of ruined the whole Blair witch. It is sort of making the first one a joke. when they tried to redeem them selves in the 3rd one they got it all wrong. butt again we could just blame book of shadows for making the 3rd Blair witch not scary and bad. they made book of shadows into a more adult version of Scooby do. But I have to admit it was fun in some places. if this was not linked to Blair witch I would of given a rating of more like three stars. but as hard as you try you just can't like this movie. as a Blair witch fan I am disappointed. if movie were better Blair witch would be no doubt the best horror movies. witch brings me to horror. this is not a horror movie! the dead children part is just not scary. any way half the movie is not set in the woods. when Kim goes to the store to bye beer that dose is when I new What I was in for. In the first blah witch when there in the woods they do not come back out and adding a Tristan who goes mad dose not make it any better. It was a attempt of mocking Michael going mad in the first one. Tristan went mad about nothing. the child part was from I would think the noses out Side the tent in the first. there were children playing. I think what also ruins book of shadows is that you see the ghosts. what makes the first really good is that you can only hear and not see. In the 3rd Blair witch you see the ghosts as well witch is why that Blair witch is not popular as well. even through It is not the Blair witch it still ruins the point. after saying that I would not watch It. I will do a review on the other Blair witches as well butt My points are the same on the third 'do not watch It'. that is all I have to say",
            "review_date": "2020-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A contender for the most disappointing sequel ever. Terrible acting, a dire script and formulaic horror. Forget this and head straight for the remake (Blair Witch) which is pretty decent.",
            "review_date": "2019-11-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I didn't see Book of Shadows back in the day because the reviews were so bad. Then recently I read some stories about how hard the studio interfered and how there were fan edits to fix it. I checked out the theatrical cut out of curiosity. I can't possibly imagine how this film could be fixed. Jeffrey Donovan's the only decent actor in the cast, but he's playing a character that doesn't fit him at all. Who buys his action hero self as a stoner, ne'er do well tour guide? The plot is recycled and silly. It feels like one of those Hellraiser sequels that started as something else and then they shoe-horned Pinhead (or in this case the Blair Witch) in to get views.",
            "review_date": "2019-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Far worse than the first film (which I already didn't like in the first place), Book of Shadows is an in-name-only horror sequel that could've worked as a satire only for the writing to be on the wall, the minute executives decided to play the tone completely straight.",
            "review_date": "2019-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My all time favourite film, love it ",
            "review_date": "2019-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What was the point of calling it Book of Shadows, if there isn't any goddamn book with that name.",
            "review_date": "2019-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is not that bad and it wasnt meant to be scary well at least i dont think it was it seems to make fun of the original as much as continue it if your looking to be scared unless your 12 or 13 prolly aint gona happen that said its got good cinamatography decent acting decent soundtrack and good ending",
            "review_date": "2019-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "didn't hold up to the original ",
            "review_date": "2019-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pure. Garbage.\nDO NOT waste your time on this patheric excuse for a movie.",
            "review_date": "2019-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I couldn't really figure out why I love this movie so much until I realized how much I love the characters!  These are the kind of people I want to hang out with and would go in a heartbeat to the blair witch tour that local boy Jeffery created! Sure he was in a mental institution but he got out and started a wonderful business centering around the Blair Witch Movie much to the surprise of the goth psychic chick that told him \"They let you get out of the mental institution too early!\" and speaking of the goth chick how can you not love her? Waiting for her tour group in a cemetary lying down on a grave? Yes she was a misfit but she was a good person and knew how to stand up for herself when the local grocery store with a low gene pool didn't like her kind shopping at their store: \"Hi Peggy, can you please tell the (b - t c h) at the counter to do her G Damn job and ring up the customer?\" It's such a classic line I absolutely love and feel other people wish they could tell that to rude employees as well!  And then there is the hot Wiccan girl that was not only hot but intelligent in the Wiccan ways and came on the tour to personally talk to the dead blair witch lady. Yes she is not your typical main stream person either but neither am I and that is why I just love this person!  Finally we have the couple researchers, they were probably the most normal of the bunch but I would love to talk to them about their research on the Blair Witch, I know I would make friends with them very easily!!! Oh to be young again and hang out with some misfit millennial youths, that is what life is all about and in case you are wondering? The doctors probably let me out a little too early too!!! ;) Watch the movie and let me know if these people ever go on a tour again, call me and I promise you I will be the first one in the van!!!",
            "review_date": "2019-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One good reason why today's horror movies are just an absolute bust.  Not scary or suspenseful. The title is a joke.",
            "review_date": "2018-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Way better than the first.",
            "review_date": "2018-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Say what you will about the first Blair Witch film, but the one thing we can agree on is that this sequel is terrible. Not only does the film have laughable characters, bizarre editing, and ridiculous visuals; but the story unwell followed, they don't even explain how everything is happening.",
            "review_date": "2018-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really honestly terrible. They turn the volume up unnecessarily to 'scare' you, actors were awful, it was way too cliche, and it wasn't scary at all. It made me cringe a lot, though, if that counts for anything.",
            "review_date": "2018-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terribly forgettable film that lost all the momentum of the first one.  Took 15 years to get back on the horse.",
            "review_date": "2017-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Where \"The Blair Witch Project\" was way too simple and light, \"Book Of Shadows: Blair Witch 2\" got way too carried away with trying to make up for the lack of intensity that the original movie had. However, the result was an insanely sloppy mess, that goes all over the place, coupled with some absolutely awful acting. There was not much I can say this movie has going for it - except for maybe the fact that it tried to be more eventful than the original. The plot of this movie is just a mess, these people go looking for the Blair Witch, which, once again we learn absolutely nothing about, and slowly see themselves get terrorized by the witch, similar to what happened in the first movie. There was a twist that this movie tried to throw in, which I have to say was probably the most interesting thing that happened in this movie, and I can't really complain about that because at least they tried to do something other than leach off of the first movies success. There is so much wrong with this movie, even the title doesn't make any sense. There is no \"Book Of Shadows\" in this movie, nor is there any mention of a book of shadows, no reference, not even a book that could resemble a book of shadows. This movie should have just been called \"Blair Witch 2\", but I guess the producers scrapped the plot entirely for the \"Book Of Shadows\" and just made up some new crap and threw it out. Everything from the way this movie was shot, to the acting, to the actual plot just screams lazy, and although I could see \"The Blair Witch Project\" being good in 1999, I know for a fact that there is no time where this sequel would be anything better than just a trashy movie looking to make a quick buck off of the original movie's success. \"Book Of Shadows: Blair Witch 2\" is terrible.",
            "review_date": "2017-07-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is a great sequel to the mysterious \"The Blair Witch Project\". Even though they ditch the full found footage route, this film is still a great mystery slasher film. This film keeps you guessing until the last reveal. The reveal is no dissapointment. The cast is also good in this film. The D list Dane Cook character is my favorite.\n\n\nRating: 6.5/10",
            "review_date": "2017-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you thought blair witch couldn't get any more dull. Guess again. They may have a bigger cast this time around and a bigger budget but ultimately the result was just as weak. Absolutely horrendous acting and sloppy plot. Once again, a wasted opportunity.",
            "review_date": "2017-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay, well, all in all, the more I think about it, I think they actually wrapped up all the questions pretty well. Oh, except, uh, was that the Blair Witch who was behind it the whole time? Did that Twin Peaks girl have anything to do with it? Oh, and what about the author? Was she possessed or behind it at all? Actually, whoever it was, what was the motive? Why kill all these people? Were they under a spell or just crazy? I mean, we know that this guy  was crazy because he was in a mental institution. In fact, what was up with that opening with the pouring of the mucus into his nose? They never explained that. Hey, how come they saw crazy images sometimes and then didn't at other times? Was there ever a rhyme or reason to it, or did they just do it out of nowhere? For that matter, how do we know the video footage is really what we're seeing? I mean, is that really what happened, or did the ghost or witch or whatever it is play with that, too? We saw clearly he can mess with the footage. Speaking of which, why was the footage only playable when being played backwards? I mean, even then, how did they see the snippets of it when they were playing it forward? Oh, yeah, and did they ever explain why the goth chick was psychic? That was a thrilling backstory, wasn't it? I'm so glad they had that in the movie, that was essential to the plot! Hey, is there any chance that you can explain why you were cutting to those bits of those people being murdered out of nowhere?! Did it add anything to the story? Did it create any suspense? Now that I think about it, from a storytelling point of view, WHAT DOES THIS HAVE TO DO WITH THE FUCKING BLAIR WITCH?* A CONNECTION, IF THERE IS ONE AT ALL, IS BARELY MADE! In fact, wait a minute. (He does a close-up on the movie poster's title) WHAT THE FUCK WAS THE BOOK OF SHADOWS?! (Back to the movie footage) Did they ever mention that in the movie?! Where the hell was that title? They never talk about it! WE NEVER EVEN SEE IT! DON'T YOU THINK MAYBE THE TITLE OF YOUR MOVIE SHOULD GODDAMN HAVE SOMETHING WELL FUCK SHIT DAMN TO DO WITH YOUR MOVIE? IT'S NEVER EXPLAINED! Hey, you know, come to think about it, THIS MOVIE IS BUTT-ASS!",
            "review_date": "2017-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "stupid depressing waste of time",
            "review_date": "2017-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story and script are really not bad. The reason it's so hated is the characters; actors are directed to do the stupidest things and react in cheesy ways, often pure stereotype (and yes, sometimes its plain bad acting). Apart from these aggravating facts, the story has a good structure, including the micro flash forwards that got me invested. It has good momentum, propulsive shifts and some surprising creativity, having fun with the  existing mythology. So i may be one of the 0.1% but i enjoy this movie",
            "review_date": "2016-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very cheap sequel to a decent film. The cliche characters are very hard to watch and the acting is bad. Skip it.",
            "review_date": "2016-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie to an hour and 30 minutes of my life away and I want them back!!!!!",
            "review_date": "2016-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's uninspired trash to be honest. it may claim to be the sequel to Blair Witch but it feels nothing like the original. the movie had potential to be interesting with a plot that often made you question what was going on , unfortunately this movie gave you far too many questions and about ZERO answers. It lacks the subtlety of the first Blair witch and isn't scary at all. Confusing, boring, and a complete waste of time, it's easily one of the worst movies I've ever seen.",
            "review_date": "2016-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's some people out there that actually think this is a good movie....LOL",
            "review_date": "2016-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As is so common with sequels of any genre, the follow-up is either rushed, uninspired, or goes so far out of its way to try something new that it becomes a shell of the original product; this is a mix of those three scenarios. Book of Shadows: Blair Witch 2 is one of the worst sequels I've seen to any film, no matter the genre, and the fact that the studio pumped it out to capitalize on the instant success of the original explains a lot. This movie is not found-footage, and instead exists in a world where the original Blair Witch Project has already come out, and these new characters, much like the production company, want to make a quick buck by creating a supposed \"tour\" in the Black Hills Forest, which then goes awry. The acting is atrocious in this film and it's clear that first-time, feature film director Joe Berlinger was out of his depth in reigning in these performers, who resort to going as over-the-top as possible with their line deliveries. The editing is also terrible, with random inserts of exposition that don't connect to anything, as well as intrusive foreshadowing that really only exists to give the film some gratuitous violence. The film is so lazy, it borrows every cliche from the horror playbook including random ghosts, jump scares, animals acting nuts, and of course, DREAM SEQUENCES! The only good that came from this film was the element of time displacement, which expands the mythology and answers some leftover questions from the first film. Apart from that, this is a complete waste of time and the only enjoyment I reaped from it was rocking out to the Marilyn Manson song that plays during the opening credits, that's as \"scary\" as the film gets.",
            "review_date": "2016-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this film gets a bad rap because of how much it deviates from the original; if you changed the name nobody would know they were sequels, and while it's not an amazing piece of horror, it's as good as a lot of other in the genre.",
            "review_date": "2016-09-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst horror films I have ever scene",
            "review_date": "2016-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this shit... so you don't need to.\nWatch the original instead, not this confused remake aimed at an audience with ADHD.",
            "review_date": "2016-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Fucking witch!\"\n\nYou can tell that there may be a good film lying in here somewhere, but the studio done fucked it up! The film is edited to shit (so many cuts to the present and the past), the characters are unlikable, and the whole thing is confusing. There are some genuinely interesting ideas here (One example: If a group believes in a fictional thing hard enough, can that fictional thing be brought to life?), and the mystery at the heart of the film is actually an intriguing one. Unfortunately, the film throws all the puzzle pieces in a jumbled heap on the table and tells you to get to it. Figuring out what's really going on is just about impossible. It's clear that the group is suffering from severe hallucinations (sometimes even shared hallucinations), and that one or more may be possessed by The Blair Witch at different times. I suppose the simple answer is that the group is slowly being driven mad by The Blair Witch (which begs the question: Was The Blair Witch real all along,  did the group inadvertently bring her to life by believing in her, or have they been driven mad by their obsession over the Blair Witch?). Either way, the film leaves you with many, many questions and tons of almost answers (and the film is assembled in such a way that finding the truth is a herculean task). Hopefully one day we'll get a directors cut, but as it stands now Book of Shadows is interesting, frustrating, and maddening. On the plus side, I actually kind of dug the score and I liked the setting of the warehouse.",
            "review_date": "2016-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "1/5.  It's not boring, but man is it dumb.  Only about 10 minutes take place out in the woods and THERE IS NO BOOK OF SHADOWS IN THE MOVIE!  What?  Really a shameful sequel to a superb film.",
            "review_date": "2016-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is of one of my favorite movies  gotta say. It was frickin creative how they incorporated themes from the first and made a unique, funereal, unsettling \"sequel.\" Way better than the original. The new one coming out... well i don't have high hopes for rehashed browns.",
            "review_date": "2016-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible and tone-deaf attempt at meta. Very 90s.",
            "review_date": "2016-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I bit of a laugh root rather than a good scary movie.  Very low budget like the first but this time it's made to look like a movie instead of real footage.  Hopefully the third instalment does the first some justice.  From the trailer, I can already say it's better than the 2nd but that's not saying much.  I enjoy watching this film however, even though it's not all that great.  It has a somewhat fun amateur story to it like you would see in old school shorts from amateurs that are just enjoyable because of the story.  Like I am zozo",
            "review_date": "2016-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think alot of people missed the intricate crafting of this movie. i recently saw an analysis of this film on youtube, which points out all the little hidden gems. this film may have not captured the shock or horror that the original did, but it definately serves the fans of the franchise. i personally loved this film. the acting was great, the story really delved into the backstory of the blair witch and rusin parr which i think needed to be told. the soundtrack rocked too. poe, marilyn manson how could you go wrong? please watch this film with a hawk eye to catch all the hidden magic in this film.\nhttps://www.youtube.com/watch?v=hAkmHSzUIHQ",
            "review_date": "2016-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For the fucking life of me, why do GREAT scary movies llike this get bad reviews, and SHIT films like insidious 1-3 get all the glory? FUCK THAT!!!!!!!!!! Like the possesed girl in this movie said 'YOURE ALL GONNA FUCKING DIE!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!66suck my balls!!!!!!!!!!!Fucking witch haters!!!!!!! grrrrrrrrrrr!",
            "review_date": "2016-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't help feeling that Book of Shadows is not as bad as everybody says. In fact, I feel like it makes a lot of exploration on the vast mithology of the Blair Witch, and that is just so interesting that justifies the silliness of the movie.",
            "review_date": "2016-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just as great as the original. The confusing plot just makes it better. I'm ready for the third film!",
            "review_date": "2016-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not that bad of a movie, but it's certainly not a great movie by any means.",
            "review_date": "2016-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Blair Witch franchise sold out!  The brilliance of the original film is completely absent in this sequel that simply devolves into a Hollywood teen slasher flick.  A real pity given that its original film was trailblazing on so many levels.  This is far worse than the Godfather 3's insult to its original predecessors.  It's more like The Exorcist 2 vs the original The Exorcist.  Watchable, but completely silly from the outset.  I thought the beginning with the smoking doctor and nurses scene was a joke or parody, then realized it was intentional!",
            "review_date": "2016-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "F. This. Movie.  By the end of this movie, there were so many questions I had that were never answered, like, WHAT THE HECK WAS THE BOOK OF SHADOWS?! Geez. Theres no Book of Shadows in this movie! Is there even a connection to Blair Witch aside from acknowledging it existed?",
            "review_date": "2016-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The sequel to The Blair Witch Project, takes out all the creativity, atmosphere, and realistic performances that made the original great. Replacing it with cliches, a nonsensical, boring plot, and very poor performances from its new cast. Don't watch it.",
            "review_date": "2016-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bearing absolutely no semblance or near connections to the original at all, and not even having the found footage camerawork that helped add, Book of shadows is a drearily dull sequel that fails even to stand on it's own.",
            "review_date": "2015-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was absolutely bad I don't understand why other people are saying that it was good, or saying that it's better than the first one. This was a wretched sequel, terrible acting, plot was a wondering mess, none of the suspense like the first one, all around amateur and absolute disgrace to the \" Blair Witch Project \". As that being said for this being one horrible sequel to a wonderful first installment, I give \" Book Of Shadows: The Blair Witch Project 2 \" an F.",
            "review_date": "2015-10-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The so-called \"one of the scariest movies of all time\" gets a sequel that's caught in the cult following wave and tackled the film with poor results in performances and unclear, ineffective surrounding the filmic \"myth\" within the compelling-turned-disappointing premise, despite being stylized differently in a clichéd horror genre fashion. The only ups this film possess are manageable engaging points when it started to get mysterious, until most of it went down to a conclusion that'd revealed the disturbance within. (C)",
            "review_date": "2015-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kind of interesting!?",
            "review_date": "2015-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This had little to nothing to do with the first movie and brings up the bad memories of Halloween 3.",
            "review_date": "2015-06-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I feel it's underrated because of the straight to video release. The horror was lacking as were the special effects. Aside from that the plot was genius, original, unique, and addressed human psychology accurately. The characters were well developed, although annoying at times to make it realistic, staying true to the formula. Honestly it's better than watching 3 kids running through the woods screaming for a map for 2 hours, in fear of what could possibly be coyote and rednecks.",
            "review_date": "2015-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's a silly film really. Number 1 fan of the original and I'm not too offended. It's not a film to be taken seriously, it features camp performances, not as much grit as it believes itself to possess and a wobbly, rushed direction throughout, especially towards the end. It is however enjoyable for the most part and relatively memorable.",
            "review_date": "2015-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The main problem with this film, aside from it sucking the very life out of you, is that the first one didn't pay off the way everyone hoped it would.Sure, it was initially creepy when it was believed to be real.But, when the truth about the film's origins came out, it became a stupid movie with a shaky camera that made everyone nauseous.A second one was neither needed nor welcomed and it took away from the \"documentary\" style that made the first one so popular.",
            "review_date": "2015-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I will never understand the negativity and poor reviews regarding Book of Shadows. This remains in my top 10 horror movies after years(although, JUST in the top 10). The Critics Consensus above is awful in my opinion with the only, albeit, stinging flaw that they connected this movie to the Blair Witch at all.  They didn't need to but, I suspect that there were behind the scenes factors that forced this script to take that name.\nI'm not going to go on and on about the movie, but I could. \nThe strongest element that has lingered with me and what sets this movie apart is how easily and well the characters are tricked into their situations. \nYes there are elements from other horror and possession-based films, much like every horror and possession-based film. But it works. \nThe characters and their development were nicely fleshed out and they felt a lot closer to real people to me than many other films. \nI enjoyed the suspense and the twists immensely and this movie will continue to rate high in my book.  Oh, and btw, - that \"Movie Info\" - that canNOT be right, can it?  That's like the worst synopsis ever.",
            "review_date": "2015-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Apparently, I'm one of the few people who actually appreciated and enjoyed this film. First of all, it has almost nothing to do with the first film.  Second, I really didn't like the first Blair Witch and thought the sequel was better.  In order to appreciate this film, you need to have some understanding of the occult, particularly of black magick and evil spirits as depicted in legend and folklore.  From the proper perspective, this film is terrifying, whereas the average viewer might be confused or bored.  You see, the way how evil spirits interact with people is to get inside their heads and distort/change how they perceive \"reality.\"  This movie is all about that phenomenon.  Brilliant and underappreciated work.  4.5 stars.",
            "review_date": "2015-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "***Due to the recent RT changes that have basically ruined my past reviews, I am mostly only giving a rating rather than a full review.***",
            "review_date": "2014-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "absolutely terrible. i LOVED the first one. but this is pure crap",
            "review_date": "2014-05-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So many people knocked this one, but I personally enjoyed it a lot.  It wasnt shot in the found footage format like the previous movie.  It was more about telling a story and then I thought had a decent, even if predictable, ending.",
            "review_date": "2014-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie sucks don't ever see it",
            "review_date": "2014-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "YEEEEEEEEEEEEEEEEEEEEEEEEES!!!!!!!!!!!!!!!!!!!!!!!!! Finally, we get a poignant, groundbreaking, and shockingly terrifying film that never lets up. I especially love those scenes where the goth girl just knows about random shit without explanation. It added a beautiful aura to the film's atmosphere. Fuck the first film and its fake groundbreakingness. This is how all films must be made until the end of time.",
            "review_date": "2014-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A slap in the face to fans of the predecessor. You can tell its piggy backing on the success of the first film. The story is confusing and the directing sets a rotten mood that pushes the \"shaky cam\" away from its creator.",
            "review_date": "2014-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is just beyond words... How did they allow this? 2 Directors create a cult classic horror movie and within a year the studios just go and take what made them money and wiped their ass with it. Thats what this film is, one big ass wiping session. Its painful from start to finish, not one moment of it is in anyway enthralling or scary or even enjoyable. If any film maker wanted to continue the success of the original, why not do a take on the Rustin Parr avenue, that could have worked, continue the mythos, create a broader world? Or how about a prequal about Ellie Kedworth, how she came to get banished and how she seeked her revenge, yet again expanding the mythos. These all seem like decent enough ideas right? So what do the film makers of the sequal do? I have no idea... I was watching but nothing was sinking in. It took me three sessions to eventually reach the end of this movie. I dont know the characters names because they are that one dimentional and stereotypical that i didnt care about them in anyway. The script is utterly appauling. A group of blair witch fans go on a tour of the woods where the original is filmed, some crazy drug session follows and in the morning they have unleashed madness upon burkettsville... I mean who cares, its nonesense. It's laughable, that someone actually thought that this would even help the lengevity of a franchise and it didnt, it killed it stone dead. Total and utter waste of time from all involved. As the last words uttered in the film \"I didnt do that\" the answer on every fans lips is \"We know, we wish you didnt either\".",
            "review_date": "2014-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pure garbage from what I can remember.",
            "review_date": "2014-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A pseudo sequel that has no originality,not character development & a cast of really un-atractive people. It's so lame and dull.....pass your way.",
            "review_date": "2014-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You could be forgiven for a moment for thinking that taking this franchise back out of the found footage and bringing a reality-twisting take on it would make it better. You'd be forgiven because you'd be wrong. This does not work and cheapens itself to any other slasher of the early millennium, how this film got a theatrical release is beyond me. It's boring for the most part, contains people you don't even love to hate and a storyline that continues to confuse right through to the end - without ever once being thought to be clever.",
            "review_date": "2013-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Technically Nothing To To With The 1st One But I Thought It Was Way Better!",
            "review_date": "2013-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is so shit that I am sure that this one of the worst films of all time, the acting swayed between over and underacting, the cinematography is terrible and everything about this film makes me want to vomit blood.",
            "review_date": "2013-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well, it's clear this film was made simply because the original was a success, but at least it's interesting, I suppose...sort of. Lets put it this way, as a telepic, Book of Shadows would be pretty decent, but not as a mainstream feature film. It takes an interesting approach as a sequel, but the film doesn't do anything new or creative with it. I'm still curious to see a third Blair Witch film with the original creators behind it. I just have one question: What's the \"Book of Shadows\"? I don't recall hearing about it once in this film.",
            "review_date": "2013-11-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty bad.  Nothing scary about this film, and nothing really to say about it either.",
            "review_date": "2013-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bad, very bad. The only reason it gets the extra half a star is the great performances from its cast, especially Donovan.",
            "review_date": "2013-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In this film's defense, the core idea of the movie is actually halfway clever. The idea of following up The Blair Witch Project with a horror movie based around the huge phenomenon the former would end up catalyzing is strangely meta, and has potential for a clever horror movie in the vein of the very self-aware Scream. But alas, instead of capitalizing on the idea, the filmmakers opt for a slasher that has literally no connection to the Blair Witch lore outside of name dropping the film a few times. The film is titled \"Book of Shadows,\" and yet there is no mention of any book of shadows at all. The filmmakers behind this one seem to think that cramming strange imagery at random counts as suspense and scares, but fail to realize that it's actually just utter nonsense. There's nothing wrong with ambiguity, but when all of the posed questions go unanswered, it's not ambiguity: it's nonsensicality. There's no scares, no thrills, no suspense: like its predecessor, it's a paranoia driven story, but unlike that film, the paranoia isn't effective. The Blair Witch Project works because it's grounded in reality. There's a reason so many people believed it was real footage and not just a movie: everything in the film was plausible. Here, the constant visions of random events posing as \"horror\" are just absurd, and not at all frightening. A pathetic excuse for a horror movie, and a horrible follow-up to a fantastic horror film.",
            "review_date": "2013-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You Know That Film You Watch When You Dont Know Why You Liked It So Much But You Do Well For Me This Is It",
            "review_date": "2013-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fluctuates between being laughably bad and just plain bad.",
            "review_date": "2013-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nowhere near as bad as the rating would have you believe, it's actually a fairly clever, fun film about people making money off the original film's success.",
            "review_date": "2013-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Crunchy sucky-bitchy Blair Witchy movie and also a bit funny... =D",
            "review_date": "2013-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Blair Witch 2 was disappointing for me, it didn't live up to the terrifying original. It was ambitious somewhat, but it got muddled and buried itself in cliches. The poor acting and pacing didn't help either. Atleast there was some atmospheric moments in there every now and again, but that's it sadly.",
            "review_date": "2013-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Blair Witch Project is one of the greatest films ever made in my opinion. It had such fantastic buildup and tension. But this... this... this... this... this... this... this is the worst movie I have ever seen in my life. No jokes. It's just... it's... it's... LOLOLOLOLOLOLLLLLLFSFSDGCCCCCCCCCCCWC3W24R4RWEDXCC....dsddfvsdsssssssssssssssssssdddfgtyyyfyfghffhdyugfrtfuykyujhjokiihujhnikjilikj",
            "review_date": "2013-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Everything that was the brilliant about 'The Blair Witch Project' has been stripped away and result is a dull and irritating horror with very few scares.",
            "review_date": "2013-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I couldn't even watch the whole movie.  Hopefully the (rumored) Blair witch 3 will be much better.",
            "review_date": "2013-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ugh, this has to be one of the worst horror films I've ever seen and almost certainly the worst sequel, since I adore the original film.  It wasn't scary, clever, smart, or funny, even when it tried to be all of the above.  90% of the acting was atrocious.  It seemed to drag on forever, even though it only clocked in at 90 minutes.  But worst of all, my DVD copy came with two books full of advertisements for Blair Witch keychains, baseball caps, serial novels, tee shirts, coffee mugs, and soundtracks.  By judging that alone, we know that Book of Shadows was in no way satire--it was a pure cash cow, and it sucked.",
            "review_date": "2013-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i remember when the first blair witch came out there was a huge hype and i didnt watch it untilll five years later and was amazingly dissapointed. it was an absolutly horrible film and have no idea why it got such a huge buzz in its time. The second blair witch is not shot at all in the same way and is very much different wich is a good thing. The book of shadows definatly overshadows the first one in everyway. it has real actors(good and bad) and a not bad plot. I'd almost recommend it to people if the first wasnt so terrible.",
            "review_date": "2013-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A average sequel to the brilliant first found footage film.",
            "review_date": "2013-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I wasn't exactly bowled over by the \"The Blair Witch Project\" so I wasn't expecting a great deal from it's sequel! Overall it felt very different to the first and was clearly produced in a completely different outlook, unfortunately it fell to far off tracks of what the original was trying to do but provided absolutely nothing substantial in its place... It was truly a confusing and uninspired mess!",
            "review_date": "2013-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Book of Shadows: Blair Witch 2 (Joe Berlinger, 2000)\n\nSo I finally got around to watching the almost universally-reviled Book of Shadows: Blair Witch 2, which as I write this has a 3.9 rating on IMDB and has a 13% critical rating at Rotten Tomatoes that (spoiler alert!) is scarier than anything in the movie. But, you know, I figured \"Joe Berlinger directed this movie. He's half of the team that directed Brother's Keeper and the Paradise Lost documentaries. How bad can it really be?\" By the time I was done watching it, I discovered I had been asking myself the wrong question. Instead, I was then asking myself, \"how does a director with such a proven track record (as well as the aforementioned, Berlinger had also directed at least one episode of Homicide: Life on the Street, one of the best shows ever on television) make a movie this awful?\n\nPlot: Jeffrey Patterson (Burn Notice's Jeffrey Donovan), a resident of Burkittsville, MD (the scene of the original Blair Witch Project), decides in the wake of the film's publicity to start a tourism service. A group of college students and a husband-and-wife professional ghost-hunter team take the maiden voyage, which finds itself in not-so-friendly competition with another guy who had the same idea, and is also on his maiden voyage. The first night, the crew camp out-but when they wake up the next morning after a night of drunken and drug-fueled revelry, they find that they weren't the only ones who blacked out-their everpresent video cameras have lost five hours of time. And during that five hours, the other crew of ghost hunters were brutally murdered. With Jeffrey and his charges the prime suspects, they retreat to the well-guarded house of Rustin Parr, supposedly the first victim of the Blair Witch's possession (and in whose basement the first film's unforgettable final scene takes place), and start dissecting the videotape they do have to try and figure out what happened that night.\n\nWhat makes it even more confusing is that, unlike the first film (let's face it, Joshua Leonard was the only person to come out of that movie with a career), Book of Shadows has a ridiculous cast. Stephen Turner (Seducing Charlie Barker). Erica Leerhsen (Mozart and the Whale). Kim Director (Inside Man). Tristine Skyler (Cadillac Man). Lanny Flaherty (Signs). The list goes on. Ironically, this may point to one of the potholes the movie hit-whereas Myrick and Sánchez specifically sought out inexperienced/first-time actors, the casting team for this movie went for already-established actors, which hamstrings the whole \"we have no idea who these people are\" gig. It's obvious Berlinger and co. still wanted to play on it, however, since they used the same tactic of having the actors use things close to their real names. It seems a little thing, but it shows that somewhere during the development process, a lack of thoughtfulness about the movie's direction crept in. And the finished product shows you just how dangerous that sort of thing can be. Barely coherent, unsure whether it wants to be a horror film or a mundane murder mystery, with odd moments that look as if they were shot by rank amateurs (that stand out far more in a film as otherwise well-shot as this one); it's presented nicely, but little else. *",
            "review_date": "2013-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "To be honest, I gave up after half an hour.",
            "review_date": "2013-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ever wonder why there's no Blair Witch 3?  This is why.  Some compare this to New Nightmare.  The only viable comparison is that they're both horror movies.  New Nightmare is a 9.5, Blair Witch 2 is a .5.",
            "review_date": "2013-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No point watching this film it doesn't make sense it's not smart like it's trying to be the acting is poor, soundtrack is ok but not great doesn't even tie in with the 1st Blair Witch It's not really even really a Blair Witch film apart that their fans of the film and been to the place it was filmed thats it. stay away from this film",
            "review_date": "2013-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought it was interesting at first, I watch the Blair Witch Prohect for the first time about 2 or 3 years ago, and found out there was a sequal, when I asked my step mom about it, she said it wasn't very good and that it should have been rated X. Seeing it now, I agree it's not very good, but it's not very pornographic. I tried to understand the point of the movie, I am not sure if \"the witch\" fucked with the tapes or if what we saw was what the characters thought was happening. I also would like to know what happened to make them like that, I kept expecting to find out they had been drugged, which would be why they couldn't remember, but no none of that. What was the evil thing they brought back? To me it wasn't very clear as to what I should be taking away with me from seeing this movie. I loved the first one, I know that this one wasn't made all that recently, but all the \"found footage\" movies that have been made, except for the Blair Witch Project, I think aren't very good. It gives the original a bad name.",
            "review_date": "2013-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ahhhh.....*Shrug* I don't know.",
            "review_date": "2013-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked this better than the first one",
            "review_date": "2013-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Oh Jesus. This was at least a horror movie, unlike the original one. But still... what the hell were they thinking?",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Way better than the first film. Just insane, but funny. An awesomely bad movie.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "No way as good as the original but a decent horror movie way above the average of the genre.",
            "review_date": "2013-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't know what the fuck was with this movie? ever since The Blair Witch Project, everyone thought the shaky camera technique was scary and since have been exploiting it like hell and Paranormal Activity haven't lost their obsession with this horrible trend yet: fuck you movie! The story is about a group of people who are in the same forest as the forest as the first project and unlike the first project where the three naive morons investigate about the witch, here they're there to do jackass stuff as they're obsessed with the first project: So it's a Blair Witch Project in a Blair Witch Project? It's already dumber than it sounds. Back then when I first used to do reviews online, I would give a specific rating for a specific reason. Here I am going to the same. Out of 10, this movie gets a 2 for two. One of the reasons were that even though both movies had annoying characters, at least in this film, I get to see one of the girls' boobs. The second reason is this wimp who squeals the lines \"I swear to Christ\" in a police station which I still make fun of to this day and those are the only two reasons what I liked about this movie but that doesn't make this movie good. And again like I said earlier, Book of Shadows - Blair Witch 2 gets a 2/10.",
            "review_date": "2013-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I don't even remember watching this, and I'm glad. :)",
            "review_date": "2012-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not really as good as the first but then again it's a great horror film!",
            "review_date": "2012-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had to give it half a star because Flixster won't let me give the film a zero rating. An inferior sequel to \"The Blair Witch Project\" with no plot, cardboard characters, and poor acting and directing. Skip this one.",
            "review_date": "2012-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as good as the first  Blair Witch.",
            "review_date": "2012-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Second rate monster of a film rubbish. This thoroughly second-rate follow-up to the groundbreaking (and highly profitable) horror flick The Blair Witch Project.",
            "review_date": "2012-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Becomes close to becoming so bad it's good, but misses the mark and becomes so bad it's BAD.",
            "review_date": "2012-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I may be yelled at for saying this, but I thought that Blair Witch 2 was better than the Blair Witch Project. I'm just saying this because I really didn't like the filming style of the original. I thought that it was lazy and very poorly made. However, before people begin fussing with me, notice my low rating for this film. I still didn't think that it was that good. The acting was horrible and the script was really mediocre. Plus, the ending left me completely confused. The only redeeming quality of this film is that it isn't \"found footage.\" Despite the improvement over the original, I still can't recommend this film to anyone. There's just not enough in it to create a good horror film.",
            "review_date": "2012-11-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Book of Shadows: Blair Witch 2 wasn't as good as the first film, it lacks the elements of the first film",
            "review_date": "2012-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was worse then the first and that one was pretty darn bad.  i mean like it sucked really really badly",
            "review_date": "2012-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "better than the first one, i thought",
            "review_date": "2012-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are too many things wrong with 'Book of Shadows: Blair Witch 2' to begin to list them all in this finite space. The fact that it can be associated with one of the most well done horror films of all time is a complete embarrassment, as this \"sequel\" shares nothing with its predecessor except its setting and a loose focus on the legend of the blair witch. Ditching the documentary-style for a traditionally shot film, 'Shadows' is a terribly conceived idea from start to finish, and is only made to be clumsier than one would think thanks to an F-list cast, amateur cinematographic work and a nonsensical plot. The film is so bad that it's laughable at parts, and it does not once give the audience a chance to be scared. It's the opposite of scary. Considering how bad this is, it's a wonder that the studio gave this a green light. Although they are two completely different franchises, the differences in quality between 'Shadows' and 'Paranormal Activity 2' are miles apart, with the latter being an example of how to prolong the life of a successful horror series. Seriously, don't even bother giving 'Book of Shadows: Blair Witch 2' a try - there's no point, it's a total waste of time and there it has no redeeming qualities.",
            "review_date": "2012-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sightseers on the Blair Witch Hunt tour get their money's worth when they experience the real curse.  One of those perception versus reality horrors that never seem to work.  I got the feeling they weren't sure how to make a sequel to the original.",
            "review_date": "2012-10-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The studio clearly had no idea what they had on their hands with The Blair Witch Project, as evidenced by the atrocious sequel Book of Shadows: Blair Witch 2.  The found footage style is abandoned, and instead labels itself as a \"re-enactment\" of real events.  But the story is little more than that of a stereotypical horror film, and makes little to no sense.  Something is trying to be said about the reality of film, but it's lost in the convoluted and inept storytelling.  Book of Secrets: Blair Witch 2 is an uninspired piece of garbage with no scares or suspense.",
            "review_date": "2012-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The amount of surprises in this review equals those in Book of Shadow: Blair Witch 2.  There were none.  This is not a good movie and I think we're all aware of that.  The story feels like nothing more than a desperate attempt to wring some more money out of a popular movie, it held nothing by way of surprises, and it lost anything that was special about the first movie.  Skip this movie.  That is all.\nFull review at: http://robertreviewsstuff.wordpress.com/2012/10/24/book-of-shadows-blair-witch-2-2000/",
            "review_date": "2012-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Becomes close to becoming so bad it's good, but misses the mark and becomes so bad it's BAD.",
            "review_date": "2012-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I rate it half a star very bad movie it sucked! Warning: Don't Watch you will be dissatisfied with this movie Don't Watch!! You've been warned",
            "review_date": "2012-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "what happened to the brilliant original.... ill tell you what happened!!!!! they threw it away and puked all over it",
            "review_date": "2012-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Has only 1% to do with the first movie. And has a very non ending.",
            "review_date": "2012-09-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "pretty solid horror movie.  nothing to do with the first one",
            "review_date": "2012-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bonkers sequel to the surprise hit is admittedly nicer to look at with steady camera work and better acting but is, nonetheless, worthless in its horror.",
            "review_date": "2012-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The box office failure of 'Blair Witch 2' proved that the original's success was the result of a brilliant marketing campaign. In saying that, this under-rated sequel is far more easy on the eye with steadycam almost always in effect. And even though the acting here is inferior (with the exception of Erica Leerhsen) and the added edge that the unfolding events could be based on fact non-existent, the overall result is a well written and edited production.",
            "review_date": "2012-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bad writing. Bad acting. Pointless movie. Reasonably decent ending, that is extremely flawed. Blair Witch Project was a scary, creepy movie. This is an empty shallow movie... which isn't scary. It doesn't even give any creeps or crawls. It just 'is'. This movie was hyped up upon so much, and then it seems to have been completely forgotten- I can see why. The only way that movie is related to the first is due to the fact that they set it a year after the release of the first Blair Witch Project. Apart from that, this movie isn't filmed in the same style, there isn't really much connection. If it were a good movie then it would've been good as then it would've still been an original movie, and avoided being a rehash. But this film just failed across the board, and was timed so badly, but also had so many talking scenes about the mystery, but it was poorly written and acted, so it was just bad. \n\nThis film has so many flaws to it, that you just start wondering why you haven't stopped watching it in the first place, as there are things that no-one would do. If you have a miscarriage, the first thing you do is definitely not go on a horror tour. Is it? There are other flaws that will be big spoilers so I won't give it away, but these are so blatantly obvious that I couldn't let it go. The characters are so thick in this movie that you don't feel any sympathy but just find them annoying, and it drove me crazy on some of the things they will do, ad it will annoy you too, because it is so stupidly ridiculous. You could argue that if they weren't stupid then this movie wouldn't work, well it doesn't work anyway, as this movie didn't need to be made in this way. It could have worked, but it just felt unnecessary, and like I was watching a straight-to-DVD movie instead of something that had a lot of money put into it, especially compared to the last one. The first movie's budget was $60,000, while this one had Â£15 million.\n\nThe performances in this movie are pretty atrocious, with some scenes where one person is possessed, and she just walks around the bed really quickly whilst reciting something like she was from a primary school. Everything was so over the top, that it just didn't work, and also they tried to add humor to this movie, and it just wasn't funny, and it also didn't seem genuine which was a big problem because these movies are made to seem genuine. It never felt like I was really watching a Blair Witch movie.\n\nThe way the movie worked wasn't the worst thing, as the way it was filmed was quite clever in the way they made it seem like a documentary, but then I found myself distancing from the characters, as it just didn't feel as real as it would've done, had it been in the 'found-footage' genre. The movie was just messy, with no clear story line or plot, and the structure was all over the place, leaving some stories open, and then just closing them without much explanation.\n\nAnother problem I had was that this movie just wasn't scary in the slightest. It had some of the mot lazy attempts at scares I have seen in a long time, as the scares would be things fading in and out, or it would be flashes of something going 'boo', and that would be it. And it happened only a few times, I would probably call this a bad fantasy or thriller than a horror, because it isn't really a horror that much. Also, some of the editing in the movie is so sketchy, as things are coming in and out of the frame, and the way it is edited, and shot, it results in things being missed and misunderstood. When the end neared, I missed a few major plot points, as it just wasn't portrayed in an effective enough way.\n\nThis is no Blair Witch, it has a decent ending, but has many flaws to the ending. But by the point of the ending, you don't even care, as the movie has been pretty dull and boring for the most part, as it is just people aimlessly walking around for an hour and a half. There is no fun to be had here. No scares to be had here. But there is poorly written dialogue... all the time. Fun! Fun! Fun!",
            "review_date": "2012-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie was too slow to develop and the plot was too convoluted and random to make sense out of. Obviously the producers were trying to attempt to mess with the audiences mind, but for me it just left me scratching my head. Ultimately it does all fall together in the end, but I still found myself asking what was the point?",
            "review_date": "2012-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This plays out like some youtube fan video to me.",
            "review_date": "2012-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "D+\n\nI don't ever remember being scared while watching this. It actually made me disappointed that such a great movie had such a shit sequel.",
            "review_date": "2012-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie without a book of shadows or a witch. Awful.",
            "review_date": "2012-07-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely pointless.",
            "review_date": "2012-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not original and horrid writing and screenplay. Does the first movie no honour and is irrelevant to anything.",
            "review_date": "2012-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is crap beyond believe in comparison to the first, it was fresh and new, this is cliched and tired, oh, and of course, rotten.",
            "review_date": "2012-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A better-than-expected horror sequel. Not nearly as great as the first \"Blair Witch Project\" film, but still a good, watchable movie.",
            "review_date": "2012-06-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lifeless and devoid of scares, Blair witch 2 was an pointless sequel that disgraces the original.",
            "review_date": "2012-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "bad sequel and poor excuse for an addition to the franchise. this was rightfully the last sequel to be made.",
            "review_date": "2012-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than the first in the fact that it at least attempted to have more of a plot line.  Still it was just a horrible movie.",
            "review_date": "2012-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There may indeed be another story to tell about the Blair Witch, but \"Book of Shadows: Blair Witch 2\" is not it. This will go down in history as one of the worst sequels ever, a follow-up that no one asked for and only exists to cash in on the wildly successful original. But while that remains one of the most original and scariest horror films of all time, this is conventional in every way. \r\n\r\nThere's great evidence of tampering by the studio to make this more commercial, but all they've succeeded in doing is making an incoherent mess of a movie that is so bad it tarnishes the reputation of the first film. There's absolutely nothing even remotely scary about this film, as the most it can muster are a lot of shocking images that turn out to be hallucinations anyway.\r\n\r\nGone is the imagination and suggestiveness that made the original so special. Instead, it's replaced by a lot of ridiculous and unnecessary gore that doesn't even make sense within the context of the film. The sequel sets up an intriguing premise that is founded on the basis that the first movie was just that; a movie. What would happen if fans of that movie try to prove its authenticity? But that premise is forgotten about after the first twenty minutes and what follows is an excruciatingly boring and talky film with only the most threadbare connection to its predecessor. And as perhaps a sign of the studio's desperation, the title is completely meaningless. There is no \"Book of Shadows\" in \"Blair Witch 2\", as well as no scares, logic or a coherent story. This may very well be the worst film of the year.",
            "review_date": "2012-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I saw this around the time all of the hype was dying down and remembering how I liked it because it expanded the Blair Witch mythology out quite a bit but due to the random editing it's really hard to enjoy it with constant flashbacks and flash forwards and random flashes of victims being murdered. I admit the Esrever feature on the DVD back in the day made me appreciate it a bit more and even today I still think it's a pretty okay film with everything given. If for no other reason than nostalgia. I really hoped they'd release a Blair Witch 3 to complete a trilogy and even now I don't see why they didn't try a 3rd because the 2nd one wasn't really all that bad, it was just the editing in my opinion.",
            "review_date": "2012-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "this one was better than the 1st one",
            "review_date": "2012-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not much better than its precedessor, but i liked it more, since it isnt as annoying to watch. it still sucks",
            "review_date": "2012-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very different than the first movie. It has some good suspense. The ending is pretty crazy.",
            "review_date": "2012-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "just like the first one",
            "review_date": "2012-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible film, even with the lucious Erica Leerhsen.",
            "review_date": "2012-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the most disappointing \"sequel\" in horror franchise history. Please, let it die.",
            "review_date": "2012-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The much maligned sequel, which I still don't think was as bad as everyone says, though there are some definite corny moments in there.  The film plays with the idea of possession in interesting ways and tries to address the idea of how much a film can be obsessed over in our society.\n\nWorth a rental, not as bad as they'd have you believe.",
            "review_date": "2012-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A 'fictional' account of the post-Blair Witch phenomena. Group of college age kids embark on a Blair Witch tour to study the legend. Largely indistinguishable from other horrors of the era. Sequel and its copies seem to confirm that Blair Witch success could only truly be captured once.",
            "review_date": "2012-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This story is more entertaining than the first movie.  Also the story is better and more interesting.  My issues, though are that the movie gets complicated towards the end.  Also the story isn't as unique as the first one and the stories pretty predictable.",
            "review_date": "2012-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I found it more entertaining & more deserving to be in the the horror genre than its original.",
            "review_date": "2012-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kim: Something happened to us in the woods... something evil. \n\n\"The terror continues...\"\n\nBook of Shadows: The Blair Witch 2 has to be the worst horror sequel I have ever seen. It's worse than Jason X, it's worse than Halloween 3. In saying that, I'm also sort of happy in a way, that Book of Shadows was so terrible. If it had been even a slight success, there would have been a crazy amount of additional sequels dished out. As it is, this killed the sequels and we haven't been shown any for 12 years. Thank God. \n\nBook of Shadows took everything that was cool and terrifying about the original and threw it out the window. The first relied on its small budget as a way to scare. Instead of showing us all the details, they left it to our imagination. This one decides to show just about everything. They show us tons of blood, in a schizophrenic and hectic sort of way. We are shown hallucinations of what characters think is happening and everything seems like it is passing over everything else. It's like a 3 year old with a coloring book. Initially you can see what the picture is, but after they've scribbled on it with ten different colors in incoherent ways, all that's left is a mess. \n\nThis takes place shortly after the hysteria of the first film. At the start we are shown clips of late night shows and critics speaking about the film. We are given a fake news broadcast that is showing us how everyone is overrunning the town of Burkittsville. Locals say it isn't true, and the sheriff tries to keep all the tourists out of the woods. One local takes it upon himself to cash in on the hysteria, creating the Blair Witch Hunt. He takes some tourists out to some spots and they party. They wake up remembering nothing. All their stuff is thrown about and they have weird marks on their flesh. They then retire to the locals house, which is a factory, in order to decode what has happened with their cameras.\n\nDon't watch it. I love the first one, but this is just a waste of time. It adds nothing to the Blair Witch story and only serves as a film Artisan thought they could make some money off of. Once again, Thank God they didn't.",
            "review_date": "2012-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love it..My best friend and I do",
            "review_date": "2012-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "at least the goth girl is hot.",
            "review_date": "2012-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better than the first!!",
            "review_date": "2012-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a terribly misguided sequel this was. The first 3 minutes were pretty promising seeing the reaction to the original film and just how much it really affected people. But once it dropped the whole shaky cam filming style, and began piling on the blood and surrealistic imagery, I knew that things had gone terribly wrong.",
            "review_date": "2012-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible. Sequel gone wrong.",
            "review_date": "2011-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "better than the first",
            "review_date": "2011-12-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was quite excited for this follow up. The original film is a true trend setter and a revolutionary piece of film making, no matter what anyone says. After seeing this for the first time, I was completely and thoroughly disappointed. \r\n\r\nThis sequel takes a page out of the 'Scream' series, as it follows fans of the original film, rather than continuing the original movies mythos. After watching it again however, I came to appreciate what this movie brings to the table. Its not a continuation of the original, but more of a companion. \r\n\r\nIt starts out painfully slow, but once it gets rolling, it has some good scares and does a good job of keeping its viewers on their toes. I am a bit confused, because at no point is there anything about a book, shadows, or a book of shadows. Not a worthy follow up, but gives enough to be an interesting horror movie when looked at through the right lens.",
            "review_date": "2011-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not as bad as allot of people make out, I like the concept of the film trying to be different from the first and making out the first Blair Witch is real and how it can go wrong when people try and cash in on it. The script does run out of steam towards the end, but there is some good stuff in it.  Its not really scary but interesting.",
            "review_date": "2011-12-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "not much better than its precedessor, but i liked it more, since it isnt as annoying to watch. it still sucks",
            "review_date": "2011-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An underrated psychological mind-bender,  WAY better than the first",
            "review_date": "2011-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the worst piece of junk, ever.",
            "review_date": "2011-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst sequels ever made. I'm not sure who'd enjoy this. Fans of the original (like me) are left scratching their heads, wondering how they thought they could make a Blair Witch franchise with this as the second film. All in all, is a colossal blunder that is completely incomprehensible.",
            "review_date": "2011-11-05",
            "source": "rt",
            "lang": "en"
        }
    ]
}