{
    "rating": 9.1,
    "release_date": "2000-10-06",
    "num_reviews": 90,
    "genres": [
        "Drama"
    ],
    "summary": "Selma is a Czech immigrant, a single mother working in a factory in rural America. Her salvation is passion for music, specifically, the all-singing, all-dancing numbers found in classic Hollywood musicals. Selma harbors a sad secret: she is losing her eyesight and her son Gene stands to suffer the same fate if she can't put away enough money to secure him an operation. When a desperate neighbor falsely accuses Selma of stealing his savings, the drama of her life escalates to a tragic finale.",
    "reviews": [
        {
            "content": "Bitter as always, great as always! On top of that, amazing performances, particularly from Bjork!",
            "review_date": "2023-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For exactly the reasons that people might dislike this movie, is why I love it. Björk's music and her acting is spot on.",
            "review_date": "2023-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant performance by Björk.",
            "review_date": "2023-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great characters, love the bit with iron man and Thor, its so sad when he dies, oh wait this is the wrong movie",
            "review_date": "2023-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Even though the performance and acting was great. \n\nI must say a horrible movie. The characters seem unrealistic almost like NPCs. The writing of the story of even it wants to make fun of Hollywood wood ends up ironically creating a version that is worse not for the sad ending but not for the shallow characters including Selma who we spent more than two hours following.",
            "review_date": "2023-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is extremely good 👍🏼",
            "review_date": "2022-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie song ever sung: I've Seen It All!",
            "review_date": "2022-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stupid cringeworthy movie that becomes stupider as it progresses. Bad plot, badly filmed (handheld camera without the hold turned on - why not use a tripod?), badly edited (jumpy sections roughly stuck together), with bad acting, that oddly morphs into arbitrary inappropriate sing-song now and then. Bad music (except the opening instrumental.) An unsatisfying waste of time to watch. Also too long.",
            "review_date": "2022-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it is bjork's fault i saw this movie and my introduction to amazing cinematics of mr. von trier's.",
            "review_date": "2022-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As I've come to expect from Palm d'ore winners, Dancer in the Dark has a unique charm. As an intentionally minimalist film, it asks audiences to suspend their learned dependance upon the technological polish of modern movies. Instead, it asks you to encounter it through the more fundamental elements filmmaking; plot, character, theme, performance, etc... While, to my eyes, the plot has some minor frustrations, Björk's performance is impossible to look away from.",
            "review_date": "2022-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As much as I despise the Dogma 95 style, that honestly contributes nothing but assures that movies filmed under this vow will look awful, which is even more sad because Dancer in the Dark does not fully commit to the rules. In this movie, it at least highlights the crude and ugly nature of an exaggerated and unforgiving caricature of a musical where everything that could go wrong does. It's overly pessimistic and over dramatic for the sheer purpose of poking fun at the narratives you have been accustomed to. Despite being perceived as anti-musical, it ironically contains some of the most effective musical scenes in the genre, thanks to Björk and, most importantly, the patience of the film to not throw them at you one by one.",
            "review_date": "2022-05-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brillant casting and performances wasted to an over complex and almost forcefully depressing plot. \n\nI had to create an account just to express how I much dislike this movie. It's not because it is a \"sad movie\", its so weird and uniquely sad that feels completely artifically driven towards its end, and end that was probably written before the plot it self.\n\nA lot of character behavior cannot be understood before the end, and when the end comes the behavior feels even more artifically introduced to make sure the forceful end happens.",
            "review_date": "2022-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie strength comes from a terrific performance from Bjork and her really nice music and a unique performances. It feels like a cheap movie, but it really isn't, and I like that. There are basically no special effects or anything, almost like a threatrical experience focused on the actors habilities.\n\nThe bad part is the weird plot with an over sinister ending with tons of plot holes, it feels like Lars Von Trier created the end before the middle and Bjork acts almost stupidly throughout parts of the story trying to making sure the end \"feels\" inevitable.\n\nThere were tons of ways to the end being avoidable.",
            "review_date": "2022-03-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lot of strong moments in here where Bjork puts on a terrific and devastating performance but the whole narrative and musical element does not mesh well. I think Von Trier wanted to show a musical in a more reality-based world which I like but the shooting and editing of it is so bad, it's hard to get into.",
            "review_date": "2022-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Often its cynicism is a bit too juvenile (even by Von Trier standards) but there is still something strangely compelling about the film's brutality mixed with these really peculiar songs. Also, I think that Bjork has just the right kind of otherworldly innocence for the role.",
            "review_date": "2022-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"You can't see, can you?\"\n\"What is there to see?\"\nGROAN\n\nDancer in the Dark is an indictment of the film industry, but not so much for the film itself as for the overwhelmingly positive response that it has received. Audiences and critics were so taken by how distinctive and original the film is, with its deliberately rough composition and bizarre blend of sentimental melodrama and musical escapism, that they interpreted novelty alone as an indication of the film being a masterpiece. The design has originality in spades and is certainly different from just about everything that came before it, and for creativity alone it deserves some recognition. Apart from that, however, it's difficult to find many redeeming features in this film; it feels superficial and pandering, attempting to make itself seem important by contrast and not much else.\n\nIt's rare that I actively hate the experience of watching a film, but I felt nothing but loathing watching Dancer in the Dark. Every once in a while, you run into something (a work of art, a type of food, anything), and it just seems impossible to understand the love that others have for it. For me, that is just about everything by Lars von Trier, with the exception of The Kingdom. (1/5)",
            "review_date": "2021-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the worst movies I've ever seen.",
            "review_date": "2021-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A masterful work of genius. This is my first Lars Von Trier film, and I absolutely love it. The camera style is great, the directing is amazing, the acting is wonderful, and overall it's almost perfectly written.",
            "review_date": "2021-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For anyone who has crawled down the Lars von Trier rabbit hole with one of his films and not enjoyed the experience, Dancer in the Dark is something that should be avoided at all costs.  For those who are more appreciative of von Trier's considerable artistic skills, the film is a must see.  Bjork is excellent as the Czech immigrant who moves to the U.S. in order to work and raise money to provide her son with surgery to cure an eye condition that will ultimately lead to blindness.  The film is unrelentingly bleak but is somehow inspirational as a mother sacrifices everything for the sake of her child.  All of von Trier's trademarks are present, including the dizzying camerawork and the disturbing subject matter.  Throw in a few nicely choreographed dance routines (yes, there's dancing aplenty) and you have a bizarre but rewarding film experience.",
            "review_date": "2021-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kind of a masterpiece. No punches held. Bjork is amazing. Tearjerker.",
            "review_date": "2020-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Depressing and not at all interesting besides the acting which is strong.",
            "review_date": "2020-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's truly a unique movie you must see. It's beautiful, funny, and devastating moments and it's not scared to invoke powerful emotions. Selma's character is unforgettable, there's a special kind of awkwardness to her that makes you love and sympathize with her. It's full of iconic shots, a film style that makes Selma's world come to life.",
            "review_date": "2020-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You only need to see one Lars Von Trier movie, especially of the triptych Breaking the Waves, Dancer in the Dark, and Dogville, and this one is it. It's horrifying and harrowing, and when I saw it I spent 10 minutes with my jaw hanging open with tears streaming down my face in public at the opening night of the Edinburgh Film Festival, but there are musical numbers.",
            "review_date": "2020-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie I'll only be able to watch once because of how much it moved me. This film was one of the reasons I went to film school.",
            "review_date": "2019-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pain is bottomless and life is profound.\n",
            "review_date": "2019-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "7 7 7 6 6 7 7 7 7 7 = 68\n6/2, 2019\nNot as good as Breaking the Waves and The Idiots.",
            "review_date": "2019-06-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Didn't enjoy it. The whole thing rang false. But I've never been a fan of Lars Von Trier.",
            "review_date": "2018-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A highly strange film and quite difficult for any evaluation; one should be very cautious in trying to say anything definite about the film. Bjork's performance is undoubtedly outstanding but everything else is of dubious quality, the film is prone to macabre and really weird, edging with pervert, sense of humor.",
            "review_date": "2018-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yet another audience torture session from Danish director Lars von Trier (quite possibly the most misogynistic director of all time).  Every single female character is a half-wit with seemingly questionable motivations.  Its ONLY redeeming qualities are the Catherine Deneuve / Bjork pairing and the spectacular music.  The misery just seeps off the screen and infects the audience.",
            "review_date": "2018-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant masterpiece that pushes the viewer to their breaking point by savagely criticizing Hollywood pandering, deconstructing cinema, and showing with heartbreaking sincerity the horrific reality of American society now and probably forever.",
            "review_date": "2018-03-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I never thought that reviewing this movie was as devastating as seeing it for the first time. It's amazing how perfect Bjork is in Selma's role.",
            "review_date": "2018-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dancer In The Dark (2000) has just became my favorite Lars Von Trier film. I’m still dumbfounded by the fact that THE LARS VON TRIER, the man behind Antichrist/Nymphomaniac/Melancholia, was able to perfectly direct the musical numbers and restrict his pretentious style. But Lars still uses the style of handheld on the cinematography for the majority of the film, and the way it shot close and shakes kinda distracts from the story. Almost all of the cast were amazing, but the actor as Selma’s son gave off a wooden performance just like other kids in a Lars Von Trier film. Thank god he only gets 5 minutes of acting, and the rest of his screen-time is him singing wonderfully during a song. I should note that Björk, the lead actress, actually composed all of the music in this film and I could listen the soundtrack all day. The last five minutes of the film had me full on sobbing for Selma. Not tearing, not crying, SOBBING. I was so convinced that she was a real person that I’ve known for years. The only flaw I found in the writing is that there are a few moments when other characters would just state the obvious or act awkwardly for no reason. Dancer In The Dark is an amazing portrayal of how escapism can cause someone to spiral into madness yet see beauty in the madness.",
            "review_date": "2017-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rarely have I seen a film that would split my life into a \"Before I saw that\" and \"After I saw that.\" Utterly moving, from the acting to the incredible soundtrack. I had even spoiled it for myself by reading the synopsis and listening to the score before watching the movie and I was still just emotionally wrecked.",
            "review_date": "2017-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Dancer in the Dark\" is an innovative and imaginative film where Lars von Trier's direction is sharp by showcasing a deep and genuine story with impressive musical numbers which showcase both emotional and artistic vision. Bjork's performance is the biggest highlight as her performance shows emotion that is powerful yet honest, and conveys a complex character.",
            "review_date": "2017-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this movie.  It tears yoyr heart out, puts it on a plate to serve to you, then crushes your heart again.  It is so moving and beautiful, with excellent music and acting.  I almost wish it didn't leave me emotionally exhausted by the end, but the journey is worth it.",
            "review_date": "2017-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Dancer in the Dark\" is simplistic and at times even tedious; yet Björk's exceptional performance as Selma, as well as an emotional and gripping plot, makes it a movie you're unlikely to ever forget.",
            "review_date": "2017-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is, so far, not only the worst musical I've ever seen, but even the worst movie. I'm sorry, but Lars von trier and Björk do not know how to make an effective musical. I do believe that 6 fantasy musical numbers, bad ones, used as an escape from all the troubles Björk is facing through the overly long, misguided poor excuse of a film this is is not a musical. That's a drama with some singing. Her voice sounds incredibly underdeveloped, everyone else sounds like they're singing for the first time, the cinematography is laughable and the only other movie that I can say is repetitive as this one is the room (2003). My main complaint is when you're watching a musical, you escape into a fantasy world where all conflicts are resolved at the end, or at least ends happily enough and you can't stop tapping your feet, or at the very least, the plot is compelling, the music is excellent, and if it does end tragically, they deserve it, like in Sweeney Todd. This film has none of that. This film is Björk falling into worse and worse traps, while using her own bad music to escape. It's like a musical version of shawshank. Oh yeah, spoiler alert though: most musicals don't end with the protagonist getting hung. Except by that point, you're ready for the movie to be over with that you really couldn't care if she did or didn't get hung. I would not recommend this movie to my worst enemy",
            "review_date": "2017-01-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely powerful , full of drama , excellent photography. Tears inevitably come out .",
            "review_date": "2016-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie. Great acting, great music, great story, very depressing and very moody. Classic Lars Von Trier",
            "review_date": "2016-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Björk's performance was heartbreaking, she was incredible. And the story was just so sad but done very well. Lars Von Trier knows how to make people feel things, and this isn't the exception. \n~August 16, 2016~",
            "review_date": "2016-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Completely soaked in raw and powerful emotion. This movie is as beautiful as it is difficult to watch without having your heart ripped out of your chest. Dark, Grim, Depressing and Powerful. This is a movie that you really need to see at least once just for the reaction from your system. Amazing soundtrack that is tastefully placed throughout. Enjoy.",
            "review_date": "2016-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very depressing and the ending is totally uncalled for, but the musical numbers and Björk's heartfelt performance make this a movie I wouldn't watch again but makes an overall great film. I'd definitely recommend it to anyone who likes Björk because the soundtrack is full of Björk style songs with a bit of a musical theatre spin.",
            "review_date": "2016-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "82%\nSaw this on 7/4/16\nBjork gives an extremely moving performance, but one might wish that it would have been far far better had this not been a musical. The film fails to connect a lot because of these unwanted musical numbers even if the lead character justifies them.  However, the film becomes compellingly engaging and heart wrenching towards the end, thanks much to Von Trier's craft and Bjork's performance.",
            "review_date": "2016-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one frustrates me because I really want to like it, but I just don't that much.  I've never been a fan of Lars von Trier's directing style, there's this \"home video\" quality to this film and that's what I feel like I'm watching sometimes.  The random jump cuts in the middle of dialogue scenes take a lot of emotional weight out of what the characters are saying, and it's just flat-out annoying.  Also, Bjork's character makes some absolute dipshit decisions toward the end and they felt almost inhuman, therefore making the ending ridiculously, overtly sad.  I did like her weird, dark, electronic music scenes which is surprising as musicals are not my forte, but they made the film interesting.",
            "review_date": "2016-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's so compelling and sad, Bjork is a phenomenal actress. She IS Selma.",
            "review_date": "2016-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dancer In The Dark is a seriously weird film. Starting off with a lot of promise, with its raw, documentary-like feel and sensitive performance from Björk, the movie quickly shows it true colours, literally and figuratively, and what follows is 2+ hours of crushing tedium, bland dialogue and maudlin monotony. It appears that it's only way to move its audience is to be as unashamedly downtrodden and bleak as possible, with no space for levity or light relief, and as a result is simply depressingly. Several parts are entirely predicated on characters being curiously incapable of providing basic explanations, and often logic and common sense are cast aside completely. I liked very few parts of it, was bored by most, and outright hated others. I will commend it on being unique however, in that I've never previously witnessed spontaneous musical numbers popping up in a film about a soft-spoken Czechoslovakian immigrant with a heredity eye condition. There's a first time for everything I guess.",
            "review_date": "2016-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the saddest films I've ever watched. Fantastic performance by Bjork. Only downside is none of the songs, aside from the last one which is absolutely heartbreaking, are particularly memorable.",
            "review_date": "2015-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Couldn't finish it. Too depressing. What is it with this director anyway? Does he like being depressed? And I thought Melancholia was bad.",
            "review_date": "2015-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Who said musicals should have a happy endings. Give it to Bjork to make the saddest most grooming musicals ever. \n\nGreat performance, hope she would repeat it again.",
            "review_date": "2015-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An unconventional musical with an excellent performance from Bjork. It's probably the least depressing Lars Von Trier movie I've seen but it still has some dark moments. The musical numbers especially I've Seen It All are well written and crafted plus a great cameo from Joel Grey in the court room song. I wasn't a big fan of the way it was shot, I think it would have benefited from being shot in the traditional way rather than the way they ended up going with. But still, it is a very interesting movie with a great breakout performance",
            "review_date": "2015-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My heart broke into three hundred different pieces while my mind was watching in awe. This is exactly how I felt after I finished Dancer in the Dark (2000).\n\nI can most definitely assure you that the twisted mind of Mr. Lars von Trier has no boundaries when it comes to cinematic genius. Written and Directed by von Trier himself, the film creates a genre of its own playing with both musical and drama along the way. I remember once reading an article somewhere on von Trier and how he expressed his desire to experiment with all the cinematic genres that ever existed... and, oh boy, he is doing it, and he is doing it in his own way. Breaking the Waves (1996) is an unconventional romance that taps on theology. Antichrist (2009) is horror manifested in psychological gore. Melancholia (2011) is a very narcissistic end-of-the-world sci-fi. Nymphomaniac (2013) is porn! There is no wonder then when he tries his hand at musicals.\n\nWhat I am getting at is that watching a von Trier film is similar to eating pickles dipped in ice cream, the only difference is that von Trier's dish actually tastes sublime. He knows how to convince you that pickles are not that salty and ice cream is not that sweet. You realize the discrepancy and the cruel irony only after you have eaten and enjoyed the meal. Proof? Try watching Dancer in The Dark a second time and compare it to any mainstream musical. What you will find is the most basic musical instruments, the dancing that does not even sync with the music, the abrupt shifts, the crude editing, the self-referential camera angles, and exaggerated sentimentality. Funny thing is that despite everything, you still enjoy the story and empathize with the characters wholeheartedly. The canny Dane not only experiments with the genre, he actually destroys it.. mocks it, and in the process, he mocks us as well.\n\nAlthough the film cannot be called a Dogme film, it certainly owes a lot of its stylistic choices to the Dogme rules, which does not strike me as a surprise since the late 1990s was high time for Dogme productions. Personally speaking, there are a lot of things I admire about Dogme films, one of them is the almost always brilliant casting. The cast of Dancer in the Dark seems to be from everywhere around the globe... Icelandic, Danish, French, American, English, German... etc. However, they fit in together harmoniously and not a single actor seems out of place. Despite the hostile tension between her and von Trier during filming, Bjork's performance turns to be a real knockout. I don't know whether she was perfect for the role or vice versa, all I can imagine is von Trier thinking of Bjork and then tailor-writing the role for her. No one, I really mean NO ONE, could have played the helpless blind Selma Jezkova as Bjork did.\n\nYou might have noticed that I did not give a synopsis of the story. With von Trier's I would rather not to. Just be prepared to watch a musical like no other.. a musical where crimes are committed, innocence is murdered and dreams are crushed.\n\nEnjoy it. Break your heart. Then laugh at yourself.",
            "review_date": "2015-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Almost cried. Great stuff. Bkork is amazing in this. Just great. gripping and emotional storm. \tLars von Trier is great too. Dogville was amaze too",
            "review_date": "2015-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you could distill an average improv class into a film, and cast it with local amdram performers, you'd probably end up with something like this. It's almost depressing how the director can make even good actors look and sound like they've never acted before. It could be revolutionary, but I suspect it's really an attempt to restore the monarchy.",
            "review_date": "2015-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not a good film. Boring and dull, with terribly filmed musical numbers. Though Bjork's performance was heartfelt and moving.",
            "review_date": "2015-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The darkest musical ever made? This film seems to one up itself every time you think the protagonist has hit rock bottom.",
            "review_date": "2015-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dancer in the dark is a little treasure of cinema and is unique in his genre. \nThe movie is greatly supported by the actress bjork who, deliver a nearly perfect performance troughout the whole picture. The music of Bjork shows the different moods of happiness and sadness of Selma. The style of Lars von Trier is very innovative and add a sense of brutality in the storyline...",
            "review_date": "2015-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Re-appropriating the conventions of the musical and imbuing them with realism, Von Trier makes \"Dancer in the Dark\" as harsh a film as he can and, as a result, it's hard to sit through, supremely manipulative, and far too long. Nevertheless, the proceedings are buoyed greatly by Björk's Oscar-worthy performance, the impact stemming from her immensely likable portrayal of a poor immigrant trying to support her son in a country that won't accommodate her.",
            "review_date": "2015-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrific movie. Great film-making. Powerful. It has the dogma feel. My wife and I both cried. Good performance by Bjork.",
            "review_date": "2015-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow. I don't even like musicals but the story was so compelling. \"Dancer in the Dark\" is a great film.",
            "review_date": "2015-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bjork's performance had a genuineness about it you don't often experience in cinema!",
            "review_date": "2015-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wish i was blind so i wouldnt have to heer bjorks shitty music anymorwe1",
            "review_date": "2015-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A harrowing emotional experience with a brilliant central performance. Full review later.",
            "review_date": "2015-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bjork for president. Lars is that guy",
            "review_date": "2014-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I almost stopped watching it 15 M in , then again at 20 M. The constantly moving back and forth hand held camera was giving me a headache . But after about 40 m or so that stopped or , i just got used to it. This is a homage to musicals and  simultaneously an anti-musical, the musical numbers are very hard to watch  due mostly to this perhaps being the most disturbing and depressing film ever made. And don't ever think Bjork isn't a talented actress. She most definitely is . The only problem , besides the hand held camera is that this film pushes the envelope for tragic outcomes, but everything that does happen is unfortunately possible. I won't go into the plot. Just watch it but you'll probably won't be able to finish watching. Yes, it is that depressing. Even i skipped parts of it and i love tragic films.",
            "review_date": "2014-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Devastating movie that stays with you even after the film. Not the easiest film to watch but definitely, soul-crushingly worth it. Most especially if you're a fan of Bjork.",
            "review_date": "2014-10-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "wow,what a powerful movie..highly recommended..",
            "review_date": "2014-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The invisible yet amazing strenght of a young blind woman whose motherly instinct comes face to face with the implacable laws of materialism, but defeats them.",
            "review_date": "2014-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yep, it's a Bjork musical. And yep, I really liked it!",
            "review_date": "2014-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An attack on the tear ducts. \"Dancer in the Dark\" is a heartbreaking cinematic masterpiece.",
            "review_date": "2014-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very rare musical, quite cruel but it's Lars von Trier's style, I suppose. :( Poor Selma but you do whatever for your loved ones at any cost. Björk deserves her Palme d'Or.",
            "review_date": "2014-07-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the best Lars von Trier movie ever.. other movies of his are not that \"watchable\"",
            "review_date": "2014-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's hard to finish and hard to forget after you're done. It's a heart breaking...or say heart ripping sad story that reveals the struggle of some unfortunates in the world lacking sympathy and humanity. And how I can relate to the heroine's feeling makes me love it very much. In your own music world, you see and feel what you can't see and feel in the real world, and everyone is nice and everything is beautiful, no matter how cruel the real world you're facing is.",
            "review_date": "2014-07-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With Lars Von Trier as director and Catherine Deneuve as a lead, Dancer in the Dark sounded like a diverse step forward for me to be viewing.\n\nDancer in the Dark ended up being an interesting film which was worth a viewing, but it is clearly a flawed feature.\nThe story in Dancer in the Dark is not that great. Lars Von Trier attempts to disguise the thin nature of the premise with an innovative film style. While the style of everything in Dancer in the Dark is interesting, it cannot fully disguise the nature of the story. It has a lot of potential and some interesting subject matter, but it ends up reducing itself to melodramatic sentimentality and it ges in senselss directions. The style of the film actually becomes an issue here because as thefilm style is really not that normal, it makes the rest of the film feel rather artificial. The premise has a certain level of value, but it ends up being too stuck in Lars Von Trier's nihilistic indulgence to actually stand up at all. I mean, a story about a girl going blind whose life collapses around her could have been interesting, but it needed to be better thought through and executed in an alternative way. If the actual mood of the film reflected the nature of its concepts then perhaps it could have been a lot better, but since it instead went in the direction of being a rather surreal musical film, the tone of the film is just odd. I can say that Lars Von Trier deserves props for his ambition on the project, but despite its potential, Dancer in the Dark never really reaches what it sets out to and instead ends up an unbalanced project which sports a lot of style but little in the way of substance that is not just more melodramatic nihilism. The light spirit of the film does not match the harsh reality of the story, and so the experience of Dancer in the Dark ends up rather strance and even emotionally distant. \nThe visual style of Dancer in the Dark is interesting. Although I thought that at the start I might not be able to enjoy the way that it was filmed in a mockumentary film style and with a rough quality handheld camera, eventually I found that I enjoyed the style. It made the film memorable and gave it a certain sense of imagery that made things feel almost surreal, almost as if the film was giving us insight into the mind of protagonist Selma Jezkova. Everything looks rough and unbalanced, and as the protagonist's vision gradually begins to succumb to blindnesswe gain an understanding of what she is seeing. The style of Dancer in the Dark actually ends up looking pretty impressive, and the cinematography captures both the beautiful nature of the scenery from many interesting perspectives and is then edited at a good pace. As a visual experience, Dancer in the Dark is an easy film to remember because it really proves how much Lars Von Trier is against standard theatrical conventions when it comes to storytelling, and it establishes the nature of his film style, for better and for worse. More so, Dancer in the Dark shows off Lars Von Trier's eye for strong imagery and his ability to build a complex atmosphere than a front for him to reveal his abilities at crafting a decent story.\nAnd although the musical number scenes are a little odd and may even feel somewhat out of place, the film breaks into song in an interesting manner by developing at a decent pace into them before Bjork sings her heart out in the sequences. The tunese are catchy and are nice on the ears, further helping to establish the atmosphere of the film. Frankly, the style of Dancer in the Dark has its pros and it has its cons, but all in all it makes the film a rather trippy experience and therefore a memorable one. It is further enhanced by the talents of the cast.\nBjork Does an excellent job of proving how talented she is as an actress in Dancer in the Dark. While the film serves as a front for her to show off her internationally recognised singing talents, the focus of the importance is more on her acting and she manages to reveal just what kind of skill she holds when it comes to that level of entertainment value. Bjork portrays Selma Jezkova excellently with a performance so full of life that she is able to carry the screen easily by herself. She makes Selma Jezkova a compelling character and a likable one which the audience is able to find themselves caring about. Bjork projects a lot of spirit in her role and manages to show off just what good acting is truly about as well as what versatile talents she has to show off. Dancer in the Dark is a medium for many things, and one of them is the acting talents of Bjork which were good enough to score her a Golden Globe nomination for Best Actress. While the tone of the film is troublesome, Bjork manages to make it work and entertains viewers in the process.\nCatherine Deneuve also gives a nice performance. Although she does not recieve as much screen time as I had hoped, her performance is impressive and entertaining in an innovative way and it projects a lot of spirit within her. She manages to interact with the rest of the cast very well and you could honestly not expect anything less from the Academy Award nominee. Catherine Deneuve manages to work alongside Lars Von Trier very well and he brings out one of her more noticable performances in recent years.\n\nSo Dancer in the Dark is an innovative and stylish film. The fact that it is a lot more style over substance my faze some viewers and turn them off due to the indulgent material as well as the fact that the story is a melodramatic venture which is rather ridiculous, but the visual style of the film is unforgettable due to its colourful and surreal nature as well as the skilled performances from the cast, particularly the leading performance of Bjork.",
            "review_date": "2014-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the my best movies",
            "review_date": "2014-06-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dancer in the Dark is one of the most painful films I had to endure. As the final Dogme film von Trier has directed, it is by far the weirdest and the most depressing. It is a musical drama starring Bjork, Catherine Deneuve and David Morse about the corruption of the justice system, music and joie de vivre. A must see but seeing it once would be enough really.",
            "review_date": "2014-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bjork's performance is absolutely riveting. This film is an emotive masterpiece and without question the most harrowing, beautiful, emotionally engaging musical I have ever seen.",
            "review_date": "2014-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jesus, the ending is brutal. Björk acts so damn well in this, it drove me to tears.",
            "review_date": "2014-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Perhaps the best musical crime drama I have ever watched. Bjork's voice is enchanting.",
            "review_date": "2014-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Horrible film, couldnt stand it one bit. The music is a bit disturbing and so is part of the story. I am not really sure how people like Bjork's singing, but atleast her acting was better than her singing. I would not watch this film again, nor would I recommend it.",
            "review_date": "2014-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "sweet innocent selma. almost too innocent, like a bit too martyr heroic. makes you kinda want to hit her. but even the hardened critic will end up sobbing in a puddled heap of their own soggy heartache on the floor.",
            "review_date": "2014-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm one to say that this movie was quite overrated. I don't know what exactly they were showing at the Cannes Film Festival at the time, but I'm quite sure that there were quite a lot of better choices than this movie. Dancer in the Dark really isn't particularly my idea of what I would choose to win the Palme d'Or. It's a good film, but it's not particularly a great film. I get quite the feeling that the 8.0 rating on IMDb is quite unjustified.\n\nFull review at filmbroadcaster.weebly.com",
            "review_date": "2014-04-03",
            "source": "rt",
            "lang": "en"
        }
    ]
}