{
  "title": "City of God",
  "rating": 8.8,
  "release_date": "2003-01-17",
  "summary": "Welcome to the world's most notorious slum: Rio de Janeiro's 'City of God.' A place where combat photographers fear to tread, where Police rarely go, and residents are lucky if they live to the age of 20.  This is the true story of a young man who grew up on these streets and whose ambition as a photographer is our window in and ultimatelyWelcome to the world's most notorious slum: Rio de Janeiro's 'City of God.' A place where combat photographers fear to tread, where Police rarely go, and residents are lucky if they live to the age of 20.  This is the true story of a young man who grew up on these streets and whose ambition as a photographer is our window in and ultimately may be him only way out. [Miramax]… Expand",
  "critic_reviews": [
    "The film is seductive, disturbing, enthralling -- a trip to hell that gives the passengers a great ride.",
    "Like a bomb exploding in a fireworks factory: It's fierce and shocking and dazzling and wonderful.",
    "A marvelous achievement that refuses to avert its gaze from the poetry and the insane savagery of the hopeless.",
    "Meticulous in its descriptions of well-intended individuals caught up in these ferocious waves of street crime.",
    "An exhilarating slap in the face, bracing and sexy, smart and visceral, stylish and raw -- the advent of a fabulously exciting new moviemaking talent.",
    "One of the most uncompromisingly bleak films I've ever seen.",
    "It's a trip to Hell and back, and testimony for embittered cynics of all that a movie can be.",
    "The film finds a surprising amount of tenderness and humor beneath the brutality. The laughs may catch in the throat, but that's only a byproduct of City Of God's power to leave viewers breathless.",
    "Breathtaking and terrifying, urgently involved with its characters, it announces a new director of great gifts and passions: Fernando Meirelles.",
    "One of the most startling, grittily brilliant films in recent years.",
    "A visual and aural feast that combines elements of classic gangster melodramas, crime epics such as \"The Godfather\" and playful non-linear narratives such as \"Amores Perros,\" City of God explores a deadly culture while feeling more alive than anything that's hit the big screen in years.",
    "As the movie's frenetic visual rhythms and mood swings synchronize with the zany, adrenaline-fueled impulsiveness of its lost youth on the rampage, you may find yourself getting lost in this teeming netherworld.",
    "Emotionally gripping from start to finish, the movie presents an electrifying and unforgettable look at life in a place that God has all but forgotten.",
    "This is one movie in which you don't feel the long-ish running time, in part because there always seems to be a surprise (as well as a new street guerrilla) around every corner.",
    "Despite the grim, serious nature of the subject matter, Meirelles unearths occasional moments of humor, although they are often of the gallows variety.",
    "An epic docudrama - electric and raw.",
    "Undeniably powerful, the work also comes with its own built-in shield against feeling any one character's difficulties too deeply, or for too long.",
    "A tightly woven tapestry of extraordinary breadth, and director Fernando Meirelles's control over the material is extraordinary.",
    "Brutal, tough to watch but impossible to ignore.",
    "In God's ghetto, as in so many of the world's forsaken places, warring armies of infants brandish their weapons of self-destruction, while politicians bluster and inspectors sleep.",
    "For those who didn't get enough violence from Martin Scorsese's \"Gangs of New York,\" welcome to City of God.",
    "Predictably, the violence is overwhelming.  But the massacres are glamorized, and the characters look like they're posing for tourism posters.",
    "It's sensationally well-made: skittery and kinetic, packed with mayhem, yet framed (and narrated) with witty detachment, so that the carnage never seems garish. The film is far from a work of art, but it marks the emergence of a great new action superchef.",
    "Nothing if not confrontational.",
    "The impressive filmmaking craftsmanship and sharp storytelling skills make this two-hour-plus epic fly by.",
    "It takes a strong stomach to sit through its two-plus hours of non-stop brutality (much of it involving very small children).",
    "A razzle-dazzle lower-depths melodrama.",
    "A potent and unexpected mixture of authenticity and flash -- even if this is what happened on the ground, making it worth our time on screen is just beyond the contortionist abilities of even this most acrobatic of films.",
    "But if City of God whirs with energy for nearly its full 130-minute running time, it is oddly lacking in emotional heft for a work that aspires to the epic -- it is essentially a tarted-up exploitation picture whose business is to make ghastly things fun.",
    "Full of action, but no soul.",
    "In its cinematic approach, though, the film is as slick as any Hollywood thriller, directed by Fernando Meirelles with visual flourishes - jazzy editing, lurid colors, crackling sound effects - that dilute the impact of what might have been an indelible cautionary tale.",
    "Undeniably powerful, but also rather numbing."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Such an amazing film that deserves the accolades and acclaimed hype it's garnered. One of the best foreign language films there is and one of the best films personally seen recently, after a long time of being on my to see list but taking aSuch an amazing film that deserves the accolades and acclaimed hype it's garnered. One of the best foreign language films there is and one of the best films personally seen recently, after a long time of being on my to see list but taking a while to get round to it due to being so busy and going through a difficult phase.Perhaps 'City of God' is not for everybody. It is not some audience members' idea of being entertaining, and is pretty unflinching, uncompromising and challenges the viewer. It does, with that being said, a superlative job bringing those qualities to life, and there are others, including myself, who judge films by what they set out to do rather than just wanting to be \"entertained\". There are many hugely entertaining films, while there are others that are clearly intended to be things other than entertainment and either are deep character studies, deliberate mood pieces and poignant dramas and shouldn't be denounced because of stereotypical views of what a film should be like.'City of God' is very well made, with some stunning and hard-hitting images, even if the budget is not high or enormous. It's all audaciously shot and edited with a lot of gritty atmosphere and sense of tension. The music fits well and has some haunting moments without being intrusive, while Fernando Meirelles's direction, particularly in the visual style, is superb.The story is not hard to follow, with lots of provoking thought, tension and emotion, while the action is positively explosive, frighteningly brutal and designed with a real meticulousness. In no way either does it glamorise crime and gives an unflinching view of gangland rivalry, provoking comparisons to Martin Scorsese and 'Goodfellas'.Alexandre Rodrigues and Leandro Firmino da Hora are fabulous in their roles and carry the film and their compellingly real characters adeptly.Overall, a masterwork. 10/10 Bethany Cox",
      "review_date": "2022-05-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "City of God is a jaw-dropping examination of the human condition. Amazingly well shot, well written, and well acted, this movie is a masterpiece. This came out in 2003, and is still surprisingly timeless and relevant. This needs to be aCity of God is a jaw-dropping examination of the human condition. Amazingly well shot, well written, and well acted, this movie is a masterpiece. This came out in 2003, and is still surprisingly timeless and relevant. This needs to be a must-see movie, especially if you are a fellow cinephile!",
      "review_date": "2018-08-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Superb editing, and Fernando Meirelles splashy direction made this movie visually stunning, and this was necessary. Because without being so, City of God wouldn't have been the easiest hard-to-watch movie to be watched! I know that soundsSuperb editing, and Fernando Meirelles splashy direction made this movie visually stunning, and this was necessary. Because without being so, City of God wouldn't have been the easiest hard-to-watch movie to be watched! I know that sounds weird, but I'm not kidding this movie is so disturbing and shocking, but its vibrant visual style made it impossible to look away from.Like the visuals and colors, the soundtrack is so vivid and dynamic to mirror the vicious cycle of violence in the eponymous city, and the slums of Rio de Janiero.That being said, City of God's exhilarating visuals and soundtrack aren't the only, nor even the main two reasons that made it unbelievably engrossing. As what really dazzled me the most this masterpiece is its narrative control. Considering the fact that this movie has this abundance of characters, which all of them are almost equally important, and a non-linear storytelling, it's beyond belief that I haven't felt lost even for a moment. Instead, I found myself caring for each of the main characters for equal measure. Every time our protagonist, Rocket mentions one of the new important characters while narrating the story, I start getting worried a bit because I think this would harm the narrative thread of the story, and make it lose its balance a bit. But every time I ended up being totally wrong till I eventually said to myself: \"More characters, please!\" By the way, the use of voice-over narration in this movie is exceptional!Every single character is as grounded as its compelling and throughly interesting. And they are brought to life by some of the most authentic, honest, and uncompromising performances I've ever seen in film. All the non-pros actors delivered downright terrific performances that I really can't single hand one of them.The only issue I've with City of God is its first fast-paced 20 minutes. Putting aside the magnificent opening scene, everything in the rest of the first fifty to twenty minutes happens very quickly that kept me from being engaged from the start.Powerful, visceral, uncompromising, yet honest, Cidade de Deus is a Latin masterpiece, and easily one of the this century's best movies, so far. I really regret not seeing it till recently, it's a MUST-SEE!(9/10)",
      "review_date": "2018-09-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "City of God follows the fortunes of a group of children growing up in a poor, crime infested part of Rio de Janeiro. The story centers mainly around two characters. Each with very similar lives, but who take vastly different paths. ThisCity of God follows the fortunes of a group of children growing up in a poor, crime infested part of Rio de Janeiro. The story centers mainly around two characters. Each with very similar lives, but who take vastly different paths. This juxtaposition is what drives the narrative in City Of God, and what makes it so compelling.\r Rocket feels out of place in the world he lives. he wants to be a photographer. We know from the moment we meet him that he longs to rise above the horrendous poverty and crime that envelopes him. He stands out in this world, others are naturally drawn to his soft temperament and demeanor even if they don't realize the reason. Rocket does not readily have the means to rise above this world so consequently he comes across many stumbling blocks in his life. One of the more interesting sequences in the film is when Rocket concludes that he has no other options than to resort to the life most of his peers have. How this decision plays out results in some of the more lighthearted moments in City Of God. While Rocket's path may not be more interesting than others in the story, it is the most sympathetic.\r Li'l Ze is the polar opposite of Rocket. He doesn't long to rise above this world, he longs to rule over it. The perverse crime and violence he sees all around him doesn't hinder him, it compels him. Li'l Ze earns the kind of respect that comes from brute force, and he learns these tactics at a frighteningly young age. If Li'l Ze is going to be a criminal he is determined to the most powerful criminal in the City of God. This is his only motivation, and what he allows to define his existence.\r There are many other characters in City Of God. This film has lots of moving parts. However most of the other players move within the framework of the two main characters. Rocket and Li'l Ze are the black and white of the movie, while the other characters represent the shades of gray. It is an interesting way to tell a story, and works exceptionally well here.\r If I have an issue with City of God it is with the way the movie was shot. We get very few static shots in this film. Everything is quick cuts and shaky camera. While this style never completely keeps me from enjoying a film, it can detract from my enjoyment some. It is very hard to get a sense of time and place when this style is employed, City if God was no exception to this. It also make it difficult to differentiate between the good and bad acting within this style. I suppose this can work positively for the director, but I still consider it a detriment.\r Overall I would consider City of God a great crime drama. The story is extremely well told, with many interesting memorable characters. This is the kind of movie that is still with you weeks or months after you see it. I am looking forward to revisiting it in the future.",
      "review_date": "2013-03-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "quite simply the best film you will ever see",
      "review_date": "2010-08-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Filmogaphy on this move is an evolution of anything hollywood ever acomplished. A real lesson on how to film a story that screams reality. One of the most violent movies ever made is also one of the most beautifully filmed.",
      "review_date": "2012-08-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "When the credits begin to roll, your eyes will be wide, thoughts racing, your mind still trying to comprehend the impeccable City of God.",
      "review_date": "2012-11-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Amazing movie, director Fernado teach us that the good cinema is everywhere, the performance are incredible, and all the history of this picture have sense with the real life now, is amazing and maybe one of the best movies foreign language.",
      "review_date": "2013-04-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nan epic tale of violence, retribution, and redemption and the rise and fall of the 80s mafia drug world, its a intertwining plot of two boys who grew up as hoodlums in the number one most dangerous city in South America, Rio De Janeiro's \"Cidade De Deus\".\r Soon their lives begin to go down separate paths, one of them becoming a first time reporter turned news photographer and the other a ruthless and powerful gang leader, as we chronicle the two or three decades of their stories and the insanely hellish violent and costly gang war that defined it. the film also is poetic and presents a modern philosophical tale of the consequences of crime and the rewards of staying on the right track .\r A stunning and unexpected masterpiece from the beautiful country of Brazil its one of those incredible films that is better to be watched quickly or sooner than never, its like Goodfellas meets Pulp Fiction meets the favela life\rone of the best films made in the foreign language of the 21st century and a classic",
      "review_date": "2015-07-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Rough, raw, brutal, intense, beautiful, powerful. These words are only a few that can be used to describe this movie. May be too rough and brutal in it's depiction for some, but you won't forget the experience",
      "review_date": "2011-01-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Cidade de Deus, or, City of God is a Brazilian film, directed by Fernando Meirelles, released in the year 2002, tells the story of life in the slums of Rio de Janeiro, in an area known as the Cidade De Deus, the City of God. Fortunately orCidade de Deus, or, City of God is a Brazilian film, directed by Fernando Meirelles, released in the year 2002, tells the story of life in the slums of Rio de Janeiro, in an area known as the Cidade De Deus, the City of God. Fortunately or unfortunately, you are left in a world you donâ",
      "review_date": "2010-12-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I have been wanting to watch this film for several years now and now that I have, I realise why everyone has been recommending it.  It is well crafted, small character stories of the favelas (slums) of Rio where violence is out of control andI have been wanting to watch this film for several years now and now that I have, I realise why everyone has been recommending it.  It is well crafted, small character stories of the favelas (slums) of Rio where violence is out of control and kids grow up thinking it is a natural way of life.  A story told passionately, by the director that also brought us the brilliant Constant Gardener, using mostly first time actors who grew up in these \"hoods\" and only have to be themselves, thus augmenting the reality feel factor of the film.",
      "review_date": "2012-01-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A rather violent movie with very complex and thought-provoking storyline based on a true story. Great filming and direction. Definitely this movie should be watched by everyone who loves good movies.",
      "review_date": "2014-05-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It's a strong and realistic portrait of difficulties of living in Brazil's favelas .. It's violent, often hard to see, the acting is excellent and the plot just awsome. Moreover, the story is based on true events: that's enforce the realismIt's a strong and realistic portrait of difficulties of living in Brazil's favelas .. It's violent, often hard to see, the acting is excellent and the plot just awsome. Moreover, the story is based on true events: that's enforce the realism and the immersion! Finally, the scenes are wonderfully filmed: the producer dealt an incredible work! Sure we are facing one of the best movies ever made! (specially in foreign country)",
      "review_date": "2014-10-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Such a waste of great performances. No characters are fleshed out to the extent that they become interesting in any way. Rocket, despite being the protagonist, takes a passive, peripheral backseat to the action. The young Lil' Dice is Such a waste of great performances. No characters are fleshed out to the extent that they become interesting in any way. Rocket, despite being the protagonist, takes a passive, peripheral backseat to the action. The young Lil' Dice is played brilliantly and is a very convincing psychopath, but we get to know little about either him or other characters. My interest in the film wandered constantly with so much of the narrative being devoted to exposition. Inconsequential informaion about characters' history and the logistics of the favella drug circuits is divulged by the truckload while the actual story plods throughout. Dramatically hollow and inertly paced, and this is meant to be a thriller? I have no desire to see this film again.",
      "review_date": "2006-11-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I actually feel my grade may be too high. Think the facelessly cheap Black Hawk Down or Spielberg's idiotic mechanical War of the Worlds, only relocated to the slums of Brazil and replete with its own set of hollow cardboard characters. I actually feel my grade may be too high. Think the facelessly cheap Black Hawk Down or Spielberg's idiotic mechanical War of the Worlds, only relocated to the slums of Brazil and replete with its own set of hollow cardboard characters. Honestly, what's all the fuss about? For the record, I vastly prefer video games where, y'know, I'm in CONTROL. And boast better dialogue. They exist, ppl.",
      "review_date": "2005-09-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Utter class! the city of god is a classic film set in the ghetto of brazil, showing real life events and on-goings, amazing story, has to be a all time favourite of mine, 1st discovered it in film studies at college and thought it was class Utter class! the city of god is a classic film set in the ghetto of brazil, showing real life events and on-goings, amazing story, has to be a all time favourite of mine, 1st discovered it in film studies at college and thought it was class from the first viewing! hope to see it again soon!",
      "review_date": "2006-01-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "In my top 5 of Gangster movies, fabulous and scary this is a film everyone should see.",
      "review_date": "2008-03-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Greatest film of all time. I loved the film irreversible and didn",
      "review_date": "2006-10-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Totally involved story of the continuity inherent in Brazilian urban slum crime. Every character is disposable in their roles in this story, which is otherwise totally mesmerizing.",
      "review_date": "2006-06-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I agree with Chris S. Dave H. you've got it all wrong. This is not a Hollywood thriller, this is a neo-realism film, a piece of brazilian national cinema which highlights Brazilian's way of life in order to obtain political change I agree with Chris S. Dave H. you've got it all wrong. This is not a Hollywood thriller, this is a neo-realism film, a piece of brazilian national cinema which highlights Brazilian's way of life in order to obtain political change (wow! I hope I ace my exam!). You are looking at this concept so wrong, unless you understand the purpose of this film you will never see it as being a fantastic acheivement, which is definitely what it is! :)",
      "review_date": "2007-01-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great film in every way, deserves the plaudits and i would say this is a film that everyone who loves film should try and watch. An incredible real life story, told in a very powerful way that will have you gripped from start to finish. Im Great film in every way, deserves the plaudits and i would say this is a film that everyone who loves film should try and watch. An incredible real life story, told in a very powerful way that will have you gripped from start to finish. Im not a huge fan of the \"gangster\" film genre having been disappointed by some of the films in the area that are considered masterpieces, however I challenge anyone to truthfully say that this is below the level of those films. This truly deserves the title of being a Masterpiece.",
      "review_date": "2008-04-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great movie from Brazil. Realistic and well done.",
      "review_date": "2008-06-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Nothing is perfect in film making, but this is as close as you get.Gripping, intelligent, subtle, violent, tragic, it has it all. After this film you really to reflect and sympathise with the poor of Brazil. In my top ten films of all time. Nothing is perfect in film making, but this is as close as you get.Gripping, intelligent, subtle, violent, tragic, it has it all. After this film you really to reflect and sympathise with the poor of Brazil. In my top ten films of all time. And Metacritic, sack your advance scout, Chad S. His review flat out sucked!",
      "review_date": "2007-06-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best Films i ever watched,of course brazilian people will like it more because of the excessive bad language (who makes the film very funny) and the slangs,but everyone must see this film,an epic real story of two drug factions inOne of the best Films i ever watched,of course brazilian people will like it more because of the excessive bad language (who makes the film very funny) and the slangs,but everyone must see this film,an epic real story of two drug factions in a war who envolves the entire community of city of god.",
      "review_date": "2011-09-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "City of God tells its story through multiple small stories and numerous characters yet the tale it tells and the world it shows is remarkably cohesive. A bleak picture is painted of 1960's Rio, one where goodness is easily corrupted and theCity of God tells its story through multiple small stories and numerous characters yet the tale it tells and the world it shows is remarkably cohesive. A bleak picture is painted of 1960's Rio, one where goodness is easily corrupted and the corrupted hold the power.",
      "review_date": "2012-05-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "City of God is a great movie. There's no doubt in my mind that it'll go down as one of the greatest of all-time.  Beautiful cinematography, great direction, fantastic acting, this is one of the more artistic movies you'll see ever. This movieCity of God is a great movie. There's no doubt in my mind that it'll go down as one of the greatest of all-time.  Beautiful cinematography, great direction, fantastic acting, this is one of the more artistic movies you'll see ever. This movie is up there with The Godfather, Goodfellas, and Pulp Fiction.",
      "review_date": "2012-01-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is truly a brilliant movie! Engaging, profound, crude, and touching.  Although humorous at times, some of the scenes are also hard to watch and it might make you question certain values we hold based on things that we take for granted.This is truly a brilliant movie! Engaging, profound, crude, and touching.  Although humorous at times, some of the scenes are also hard to watch and it might make you question certain values we hold based on things that we take for granted. This movie takes you to a reality that most of us have never imagined. I also like the sociological ideas/ message behind this film. It is not my favourite movie ever, but for what it offers, it is definitely a 10. I hope you enjoy it as much as I did. We have it at home.",
      "review_date": "2014-09-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Based on real events this Masterpiece is out of range. No drug / slum or something else movie can compare with this. It's so intimidating and disturbing, you cant believe this is true. Heavily underrated in many ways and absolutely worth the time!",
      "review_date": "2012-02-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Masterfully directed and acted, City of God is undeniably worthy of the praise it has received over the years. Unashamedly brutal and honest, City of God provides a brilliant look at life in the slums of Brazil through the eyes of a boy whoMasterfully directed and acted, City of God is undeniably worthy of the praise it has received over the years. Unashamedly brutal and honest, City of God provides a brilliant look at life in the slums of Brazil through the eyes of a boy who dreams of becoming a photographer and while he is not involved in gang life, he is undeniably touched by it and it is a huge part of who he is. The acting, directing, and cinematography, are all pitch perfect and the storytelling here works very well. It is a great example of world cinema since it is a Brazilian film and a great example of how it does not matter what language a film is in, as long as it is very good and this one certainly fits that bill. Overall, I was very impressed with this film and it undoubtedly rings true for those living in this unfortunate situation. While brutal and sad at times, this one is a foreign language classic.",
      "review_date": "2014-09-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An emotionally visceral, graphically violent piece of cinema, City of God (Cidade de Deus) might be one of the most brutally honest films I've ever seen. Noting is taboo as the movie shows children being shot, countless dead bodies, andAn emotionally visceral, graphically violent piece of cinema, City of God (Cidade de Deus) might be one of the most brutally honest films I've ever seen. Noting is taboo as the movie shows children being shot, countless dead bodies, and ruthless behavior; all the more shocking because it's real. The movie takes place in the City of God, an area in Rio de Janeiro, Brazil, far from the places shown on the touristy postcards. It's a slum, and it seems like you'd be lucky to make it into your 20's living there. The story follows a young man named Rocket as he aspires to be a photographer, while showing bleak backdrop of the drug trade and constant gang warfare in the area. The director purposefully uses little-known actors to make the feel of the movie more authentic, and the way he presents the material through the stunning cinematography and a superb script is amazing. I'm shocked it didn't succeed in getting nominated for best Foreign Language film at the Oscars, but nonetheless it is a powerful and important film that earns its critical praise. Some viewers will be unable to watch parts of this movie; it really is that shocking.",
      "review_date": "2014-10-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the most powerful dramas of the decade is 'City of God.' Fernando Meirelles proves that he can run with the most acclaimed directors in modern cinema with this film. His disciplined style is vigorously enchanting as much as One of the most powerful dramas of the decade is 'City of God.' Fernando Meirelles proves that he can run with the most acclaimed directors in modern cinema with this film. His disciplined style is vigorously enchanting as much as it is appealing. For his furious and violent tale, 'City of God,' he portrays, with shocking realism, the slums of Rio de Janeiro from the late 60",
      "review_date": "2007-08-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Only the best film ever! great soundtrack",
      "review_date": "2009-03-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Outstanding film. It illuminates a reality very few Americans will ever see and does so in a gritty, compelling manner.",
      "review_date": "2005-10-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best movies I have ever seen. World is without end and without reason. People within are curious and ungrasped.",
      "review_date": "2006-07-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Just a brilliant movie on every front.",
      "review_date": "2006-08-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Really one of the best movies I've ever seen. Underrated and by far not as noticed as it should be.",
      "review_date": "2009-06-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Amazing movie, easily one of the best film of this decade. As realistic as it gets. I'm out to buy it, then watch it a few more times.",
      "review_date": "2009-08-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great film. Everyone should watch it.",
      "review_date": "2006-08-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Unique characters drift in and out of gang life, trying to survive in their own ways.  Touches us with elements of familiarity and shows how if the environment were a bit different, these horrible options could become a reality anywhere.Unique characters drift in and out of gang life, trying to survive in their own ways.  Touches us with elements of familiarity and shows how if the environment were a bit different, these horrible options could become a reality anywhere.  Great movie. Well done.",
      "review_date": "2014-01-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great story.  You don't realize how much the character's lives intertwine until a rewatch, which you'll likely be more than happy to do.  Totally unique movie.  Also great music.",
      "review_date": "2020-08-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A theme over approached in Brazilian's theater? For sure,but what matters is the movie is fine. Drama,tension,action and shocking are very well used. Moral of that story is clear, crime doesn't compensates.",
      "review_date": "2018-09-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Dark, sadistic and deeply disturbed. City of God is the sort of film one can respect but it's very hard to enjoy. It brilliantly paced, very engaging but at times absurdly superficial.",
      "review_date": "2015-01-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A very important movie! This one pretend to show to audience the reality in the streets of Brazil. And behind the criminals are people with dreams and thinking in a good life. But thay can't because they have not conditions to leave thatA very important movie! This one pretend to show to audience the reality in the streets of Brazil. And behind the criminals are people with dreams and thinking in a good life. But thay can't because they have not conditions to leave that places. A very good movie",
      "review_date": "2015-04-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An extraordinary film that overpowered me and left me wanting more.\r Watch it online for free: https://www.primewire.ag/watch-393-City-of-God-online-free",
      "review_date": "2016-01-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "City Of God is a brutal cinematic experience that does a fantastic job of immersing the audience member into the film with its outstanding direction and spectacular character performances to deliver a masterful crime epic.",
      "review_date": "2017-08-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie is a march in the history of brazilian cinema. With a history that flows naturally, marked by an excellent cinematography and an editing that put you in the middle of the life of the residents of City of God, this movie is at theThe movie is a march in the history of brazilian cinema. With a history that flows naturally, marked by an excellent cinematography and an editing that put you in the middle of the life of the residents of City of God, this movie is at the sime time heart touching and suffocating. The director Fernando Meirelles does a really good job by leaving us fell like if we were into the situations of the movie and the actors areincredibly natural.For me the best brazilian movie of all times.",
      "review_date": "2017-02-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Transgessor. Daring. Violent. Exciting. It shows with authenticity the life of the inhabitants of the favelas of Rio de Janeiro. With a masterful performance by Leandro Firmino da Hora (curiously, an inexperienced actor at the time), besidesTransgessor. Daring. Violent. Exciting. It shows with authenticity the life of the inhabitants of the favelas of Rio de Janeiro. With a masterful performance by Leandro Firmino da Hora (curiously, an inexperienced actor at the time), besides the good performances of singer Jorge, Alexandre Rodrigues (protagonist of the film), Matheus Nachtergaele, Alice Braga (now known internationally), among others , and also a great script, able to tell several stories in a short time, without making mistakes in the development of any plot ... This is the Brazilian cinema. And this is the naked truth of many cities in the country, which, although it has many political and social problems, proves that it is not artistically limited as many Brazilians and foreigners think.",
      "review_date": "2018-10-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Beautiful cinematography, excellent plot, characters and soundtrack, my favorite brazilian movie so far, one of the best movies of 2000's.",
      "review_date": "2020-03-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the best foreign films I have seen. This style of directing was spectacular and the raw acting was perfect!!",
      "review_date": "2019-07-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I am upset with myself for having not watched this gem of a film sooner, despite being on my watchlist for many years. This film deserves much more recognition and appreciation than it gets, as it does everything so well. The visual style isI am upset with myself for having not watched this gem of a film sooner, despite being on my watchlist for many years. This film deserves much more recognition and appreciation than it gets, as it does everything so well. The visual style is remarkable, the storytelling is powerful, the narrative is captivating, and the acting is very believable. I was thoroughly and consistently entertained. If there's anything that this movie falls short on, it's simply that the storytelling mechanics of jumping from character to character do not allow for the viewer to connect as deeply as they might with a standard film protagonist. However, I think that what was lost in that regard was made up for in the mechanism's ability to show the more complete and intertwined narrative that this film captures. Overall, a wonderful film that's certainly going among my favorites.",
      "review_date": "2020-03-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A classic.An enthralling, smart, powerful & disturbing movie on the slums of Rio.Must see and one of the best movies of 2003.",
      "review_date": "2021-01-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Violent and realistic. It achieves to portray a tragic reality without soften it up unnecessarily (which usually happens), showing all its rawness. Mindblowing directing and editing.",
      "review_date": "2021-07-16",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "breathtaking and terrifying, urgently involved with its characters, the film has been compared with \"goodfellas,\" and it deserves the comparison... highly recommend...",
      "review_date": "2021-05-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The best Brazilian film together with elite troops, how did it not win an Oscar? I do not know",
      "review_date": "2021-10-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the 10 greatest movies of all time. Note: brazilian movies should be watched with original audio.",
      "review_date": "2021-11-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Found this gripping and engaging start to finish. Lil' Dice/Z Had a chance to go into the pantheon of villains but fell off somewhat towards the later half. A rough and brutal breakdown.",
      "review_date": "2022-07-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A gritty movie. Beautifully done, and, as it seems with so many films about brazils less than glamorous underbelly, it captivates the attention with the excitement and vibrant story telling.An awesome movie, which flows from challenge toA gritty movie. Beautifully done, and, as it seems with so many films about brazils less than glamorous underbelly, it captivates the attention with the excitement and vibrant story telling.An awesome movie, which flows from challenge to challenge, with each solution bringing further development in the plot seamlessly.",
      "review_date": "2022-11-10",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 101,
  "genres": [
    "Drama",
    "Crime"
  ]
}