{
  "title": "Dumb and Dumberer: When Harry Met Lloyd",
  "rating": 2.8,
  "release_date": "2003-06-13",
  "genre": [
    "Comedy"
  ],
  "summary": "In the 80s, Harry and Lloyd meet in high school where they cross paths with a mean principal and a bunch of other outcasts much like themselves.",
  "critic_reviews": [
    "In all it's a pleasant surprise if not a great comedy.",
    "Sure, Dumb and Dumberer is dumb, dumber and dumberer than the original, but if you like that kind of banal, rustic and sophomoric humor (and I have to admit, I kinda do), it might be worth a buck or two at a discount theater.",
    "A harmless celebration of idiocy that is the cinematic equivalent of an overeager, block-headed puppy chasing its tail.",
    "Fitfully amusing prequel.",
    "The movie's really about the impressions of the original performances by newcomers Eric Christian Olsen and Derek Richardson. Olsen does an uncanny Carrey, and Richardson vaguely resembles Daniels.",
    "Lacks the heart that might otherwise have breathed life into the pointless shtick.",
    "Without any of the patented Farrelly insight into the insecure, horndoggy teen in every man, and without a grown-up setting in which Harry and Lloyd can transgress like dum-dum geniuses,Dumb and Dumberer is dumberest.",
    "Falls wildly short of its inspirations.",
    "Exactly as you may expect, this thing is good for a few cheap little laughs and no more.",
    "Long, lumbering and endlessly unfunny.",
    "In \"There's Something About Mary,\" the gross gags were hilarious. Here, they're just vile.",
    "Has all the gross-out humor but none of the goofy sweetness. It also has neither of the Farrellys, which is agonizingly evident throughout.",
    "The only bits worth watching are the scenes where Olsen is in full Carrey mode and Richardson is doing his best Jeff Daniels. The spot-on impersonations take the mind off the plot, the poo-poo gags, the clunky chase scene and the ripped-off finale.",
    "To call this effort misguided would be kind. The job this \"prequel\" does on the original Dumb and Dumber is the movie equivalent of surgery that removes all the vital organs and then gives the patient a prosthetic third arm. What's needed isn't there, and what's here we don't need.",
    "It's so sloppy that the flashback montage includes clips from scenes that were cut from the film!",
    "The jokes? \"Chicks are for fags,\" says Lloyd. The film is subtitled When Harry Met Lloyd. Believe me, you don't want to be there.",
    "Levy, Luis Guzman, Cheri Oteri -- utterly wasted. At 82 minutes it feels longer than “Lawrence of Arabia” -- and a lot less funny.",
    "The best thing I can say about this limp prequel to the Farrelly brothers' Dumb & Dumber is that it obliged me to check out the original, which I'd been studiously avoiding for years. If you haven't seen it, it's pretty funny, and mercifully light on the scatology and cheap sentiment of later Farrelly efforts.",
    "While \"Dumb and Dumber\" possessed a bracing, genuine vulgarity, this new film is more often merely disgusting as it piles up jokes involving various bodily discharges and the unpleasant things that can be done with them.",
    "The film's only mildly appealing character is the \"Big A\" store clerk (Brian Posehn) who refuses to be amused by Lloyd and Harry's moronic antics; sadly, even he eventually succumbs to the film's relentless and overarching stupidity.",
    "Wasted comedy ringers Eugene Levy and Cheri Oteri co-star.",
    "So excruciatingly awful, the word \"dumb\" could sue for slander.",
    "Yes, I've seen Dumb and Dumberer, so you don't have to.  As good deeds go, this is about as significant as getting a cat out of a tree, but believe me, you're better off at home, alphabetizing your old comic books, talking to your parents, or watching paint dry.",
    "To call it sophomoric would libel even the most pathetic, pimply underclassman.",
    "I wouldn't want you to consider even renting this thing. It would only encourage another prequel, this time featuring two dumb toddlers who keep walking into doors and become great pals. Call it \"Duh and Duh.\"",
    "Even with its scant running time, this nightmarish travesty barrels along with all the whipcord speed and nimble comedic grace of a loved one’s funeral.",
    "Mind-numbing, soul-testing, character-defiling experience that offers not one nanosecond of comic relief.",
    "No movie could be more aptly compared to raw sewage than this film."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "What The Hell did i just watch? Is this a comedy film?\rMan! this movie is awful.After seeing dumb and Dumber I was skeptic on this Movie, I ask Myself will this unknown actors do a good job portray this roles? well my expectations were lowWhat The Hell did i just watch? Is this a comedy film?\rMan! this movie is awful.After seeing dumb and Dumber I was skeptic on this Movie, I ask Myself will this unknown actors do a good job portray this roles? well my expectations were low but I want to see the execution of it and it was horrible,It is poorly done ,poorly written and poorly acted and the main characters are annoying unlike the original\"annoying yet loveable\" but here nope they're not loveable .It is one of the worst films of all time!",
      "review_date": "2014-12-21"
    },
    {
      "review_title": null,
      "content": "This movie was so bad I stopped watching after 45minutes hoping it would get better. The story sucked, there was nothing funny, and the actors couldn't keep my attention. The first attempt at watching it made me fall asleep ... waste of time!",
      "review_date": "2011-10-14"
    },
    {
      "review_title": null,
      "content": "when they writers made a script they turned it into the three stooges basically . Its funny, retarted , . without Jim Carey in this comedy  the movie is still an even bigger JACKASS . Grade  C- maybe a D",
      "review_date": "2014-04-16"
    },
    {
      "review_title": null,
      "content": "This movie was so unbelievably bad that it nearly destroyed the whole world and everything on it. After I watched it, I lay in a bombshelter for 8 days eating tin food.",
      "review_date": "2005-11-17"
    },
    {
      "review_title": null,
      "content": "All i can say is its a good thing i told the guy i was under 11 and got in for 6$ instead of 14 bcus i wudnt have wnated to waste my money on such a pathetic,worthless,stupid sh.t.",
      "review_date": "2004-01-19"
    },
    {
      "review_title": null,
      "content": "It's documented sequels are usually not as good as the first, and in the case of this movie, it could not be more obvious. In a followup to an already flop movie the sequel makes the first look smart. An abomination to movie sequels.",
      "review_date": "2007-02-12"
    },
    {
      "review_title": null,
      "content": "So bad! I was trying to figure out who find most of the jokes funny. It's too inappropriate for children, too immature for adults. I saw it in my early teen years, and the whole time I was thinking, where's Jim Carry and Jeff So bad! I was trying to figure out who find most of the jokes funny. It's too inappropriate for children, too immature for adults. I saw it in my early teen years, and the whole time I was thinking, where's Jim Carry and Jeff Daniels. Then the credits came on and I realized what an awesome move those guys made in avoiding this.",
      "review_date": "2006-04-16"
    },
    {
      "review_title": null,
      "content": "with out carey and with out danials there is no movie . apparently hollywood didnt care and slaped together a half assed prequel that does no justice to the original. there where a moment or 2 where i laughed thats the only reason ill givewith out carey and with out danials there is no movie . apparently hollywood didnt care and slaped together a half assed prequel that does no justice to the original. there where a moment or 2 where i laughed thats the only reason ill give this 2 points the rest was unbarable crap.",
      "review_date": "2010-08-28"
    },
    {
      "review_title": null,
      "content": "There's a fine line between dumb enough to make a hilarious movie, and so ridiculously dumb that it's hard to even let out a nervous laugh here and there. Though the original DUMB AND DUMBER was a good example of a former, this prequel is theThere's a fine line between dumb enough to make a hilarious movie, and so ridiculously dumb that it's hard to even let out a nervous laugh here and there. Though the original DUMB AND DUMBER was a good example of a former, this prequel is the perfect example of the latter. DUMB AND DUMBERER: WHEN HARRY MET LLOYD is more of an homage to DUMB AND DUMBER than anything. The form of \"dumbness\" isn't even similar to the original, there is no similar plot, and it looks like two truly-smart teenagers imitating the believable stupidity of Jim Carrey and Jeff Daniels. All in all? This isn't worth watching. For fans of the original DUMB AND DUMBER, you'll begin to miss the real Jim Carrey because of the awful impersonations you'll find here.",
      "review_date": "2011-09-02"
    },
    {
      "review_title": null,
      "content": "If you are like me then you will like this kind of humor. I don't see how some people didn't laugh in certain parts. This prequel has some funny moments.",
      "review_date": "2011-11-19"
    },
    {
      "review_title": null,
      "content": "The Farrelly's didn't want to do this movie for fear it would diminish the quality of the original. It wasn't quite that bad thou. It had some really hysterical moments, and Hollywood chipped in with cameos (by Saget, Shia LaBouf, CheriThe Farrelly's didn't want to do this movie for fear it would diminish the quality of the original. It wasn't quite that bad thou. It had some really hysterical moments, and Hollywood chipped in with cameos (by Saget, Shia LaBouf, Cheri Oteri, Mimi Rogers, and Eugene Levy to name a few.) It most defiantly doesn't live up to the original, but surprisingly it wasn't terrible. Eric Christian Olson does a terrific job as Lloyd, the story of how they met, as well as references to the original, and the cameos make this film worth seeing. It really isn't as bad as you might think it would be.",
      "review_date": "2013-02-24"
    },
    {
      "review_title": null,
      "content": "A toilet could write a better movie than this.  First off, I usually like goofy comedies.  I liked the original Dumb & Dumber.  This one was just plain... Sorry that I have to use this word, but it was Retarded!  Perhaps the worst comedy everA toilet could write a better movie than this.  First off, I usually like goofy comedies.  I liked the original Dumb & Dumber.  This one was just plain... Sorry that I have to use this word, but it was Retarded!  Perhaps the worst comedy ever made.  I think the guy who made this was just trying to see if something could be so stupid that it would break the laws of physics.  It just may have done that.",
      "review_date": "2013-05-11"
    },
    {
      "review_title": null,
      "content": "As a prequel, Dumb and Dumberer is the equal to a natural disaster. As your average teenage film (not to be taken seriously) I'd give it a nod. If you compare it to the first, I'll admit that this movie deserves hate. We all expected CarreyAs a prequel, Dumb and Dumberer is the equal to a natural disaster. As your average teenage film (not to be taken seriously) I'd give it a nod. If you compare it to the first, I'll admit that this movie deserves hate. We all expected Carrey and Daniels to return with comical results. Olsen did a great job at playing Lloyd if that's any concillation while Richardson did a decent job as Harry. The rest of the cast should have been replaced for their sleepy performances and while I admire Eugene Levy, he should stick to playing Jim's Dad. If you love crude jokes and short laughs, then dumb and dumberer should garner your vote. In other words, this film is a pretty harmless, pretty reckless tale with a few gags but very poor performances from much of the cast.",
      "review_date": "2013-05-12"
    },
    {
      "review_title": null,
      "content": "This flop is so bad its bad. I did not laugh once in this film, whereas in the first one my stomach hurt from laughing. Don't see this movie. Its NOTHING like the original.",
      "review_date": "2015-07-15"
    },
    {
      "review_title": null,
      "content": "Honestly, the only thing that can get dumber here is the fact that it doesn't have the funniness of the original Dumb and Dumber which made them the best. When immediate cash grabs met Hollywood.",
      "review_date": "2016-01-19"
    },
    {
      "review_title": null,
      "content": "Why everyone hated this movie so much, i believe that the Dumb And Dumber prequel had plenty of hilarious and funny moments. Yeah, it might not be as good as the first one and it's 2014 sequel, but still pretty funny.",
      "review_date": "2020-01-03"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nBoring Film, Dumb and Dumber was a good movie with a good chemistry between our two protagonists, this prequel though in my opinion doesn't cause any harm or doesn't want to make me tear my ears out after hearing a joke but is overall a snore to sit through.",
      "review_date": "2021-06-19"
    },
    {
      "review_title": null,
      "content": "I don’t know why people hate this movie the movie was funny the original movie was way better and dumb & dumber 2014 movie was better than this movie but this movie is still funny this is probably my least favorite of the three dumb & dumberI don’t know why people hate this movie the movie was funny the original movie was way better and dumb & dumber 2014 movie was better than this movie but this movie is still funny this is probably my least favorite of the three dumb & dumber movie but still okay movie",
      "review_date": "2022-08-12"
    }
  ],
  "num_reviews": 46
}