{
  "title": "Pirates of the Caribbean: The Curse of the Black Pearl",
  "rating": 8.8,
  "release_date": "2003-07-09",
  "summary": "For the roguish yet charming Captain Jack Sparrow (Depp), the crystalline waters if the Caribbean present a vast playground where adventure and mystery abound.  But Jack's idyllic pirate life capsizes after his nemesis, the wily Captain Barbossa (Rush), steals his ship, the Black Pearl, and kidnaps the Governor's (Pryce) beautiful daughter,For the roguish yet charming Captain Jack Sparrow (Depp), the crystalline waters if the Caribbean present a vast playground where adventure and mystery abound.  But Jack's idyllic pirate life capsizes after his nemesis, the wily Captain Barbossa (Rush), steals his ship, the Black Pearl, and kidnaps the Governor's (Pryce) beautiful daughter, Elizabeth Swann (Knightley).  (Disney)… Expand",
  "critic_reviews": [
    "Verbinski knows when to break out the stunning action sequences and when to let his characters dominate the film, and he handles both modes expertly.",
    "This is an original work in an antique mood. The actors and authors all have fun with the genre without making fun of it. Rather, they revive it.",
    "Finally, there's a big-budget popcorn movie that delivers what moviegoers hunger for: humor, action, thrills and charismatic characters. Pirates of the Caribbean: The Curse of the Black Pearl is the summer blockbuster we've been waiting for.",
    "A first-rate sail into Adventureland.",
    "Flawed though it may be, it's frequently an unaffected pleasure, in no small part because of Depp but also because of a raffish air that's a welcome respite from the heavy going of \"The Matrix Reloaded,\" \"The Hulk\" and other behemoths.",
    "An exciting time at the movies, where you don’t smell something burning and realize it’s your brain cells dying off. During the summer movie season, that’s rather hard to avoid. But this movie has avoided it and it’s time well spent.",
    "The law of commerce worked this time around: One terrific thrill ride has begotten another.",
    "Pirates of the Caribbean moves easily from sunny 18th-century seafaring adventure to creepy zombie flick and back again.",
    "Bruckheimer -– always eager to egg on the public’s thirst for bigger, louder, stupider –- has done a scandalous amount of damage to contemporary cinema, but for once, his dubious talent for big-buck bombast is exploited for good rather than evil.",
    "A film that dares to be smart, reasonably complicated and scary while swashing its buckles.",
    "Verbinski puts a Jackie Chan flourish of high energy and gymnastic action on the swashbuckling stunts and swordplay and keeps this lark sailing along.",
    "Pirates offers something for everyone: Bloom and Depp for the ladies, big action and Knightley for the men, self-aware gags for the postmodern crowd, Depp and Rush for fans of top-rank scenery chewing.",
    "Letting any other actor run wild like this could have been a disaster, but Depp's peculiar buccaneer is an instant classic of actorly charisma.",
    "Oozes atmosphere. The humor keeps it from becoming too creepy, but there are still a few chills to be had.",
    "An improbably entertaining, if overlong, adventure that brings new meaning to the term \"summer camp.\" Doubloons! Ripped bodices! Unbuckled swash! Rum galore!",
    "A rollicking, jumbo-sized swashbuckler, awash in sword fights, cursed treasures, plank walkings and hurtling cannonballs. This stylish, rousing movie has been directed with refreshing levity and wit.",
    "It's a good thing that Geoffrey Rush and Johnny Depp are on hand to jack up the acting department. Their characters, two world-class goofballs, keep us interested even during entirely pointless swordfights.",
    "Convoluted but diverting.",
    "When Pirates of the Caribbean is good, it's certainly something to behold.",
    "Fortunately, whenever the movie starts to sag, Depp flies to the rescue. It’s a truly piratical performance: with his flamboyantly fluttering fingers he steals every scene in the movie.",
    "The dazzling, high-flying silliness is quite an achievement. The movie is better than it deserves to be, given its origins: a ride at Disneyland and Disney World.",
    "I love it, but much in the way I managed to love \"The Phantom Menace\" -- in spite of its bloat, swaggering self-importance and largely neutered characters.",
    "Children of all ages: Brace yourselves for a helluva ride.",
    "At least the movie Pirates of the Caribbean is fun -- but only as long as you don't expect much. Take it from me: The ride is better.",
    "Pirates is OK, in patches even better.",
    "The picture's constant forward movement and breezy sense of amusement about itself provide a certain mild sort of diversion.",
    "The large cast, costumed and made up as filthy scalawags and sinister buccaneers, gives tremendous energy to every scene.",
    "Trimming half an hour from this bloated, 143-minute blockbuster would have highlighted the film's treasures, not the least of which is Johnny Depp's endearingly eccentric performance as Captain Jack Sparrow.",
    "Director Gore Verbiniski delivers the best one can hope for: a cleverly nostalgic, high-tech copy of the real deal.",
    "Depp swans through this swashbuckler with a scene-stealing gusto unseen since Marlon Brando in \"Mutiny on the Bounty.\" He's comic dynamite, but this plodding, repetitive bore should walk the plank for timidly refusing to light his fuse.",
    "The movie blows, me hearties, but don't you dare miss it...Why? Johnny Depp, that's why...This has gotta rank among the weirdest performances in the zany annals of the silver screen.",
    "This typically bloated production from Jerry Bruckheimer is good swashbuckling fun for the first few reels but eventually slows to a halt under the weight of too many doubloons.",
    "My main complaint -- there's too much emphasis on action -- will strike the film's young target audience as a see-worthy virtue rather than a fault.",
    "Eventually the concept buckles under the heavy blockbuster treatment, becoming a monotonous, repetitive spectacle of endless shipboard sword fights and pirate ghosts in the moonlight.",
    "There may be nothing more fun for actors than experimental exaggeration, especially when filming on a Caribbean island. But there’s nothing that makes an audience feel less welcome than not being in on the joke.",
    "This noisy retread, a secondhand facsimile of a movie, is, except for the headache its boisterous sound level leaves you with, as forgettable as a bad day in the Disneyland parking lot.",
    "Not enough to keep this celluloid ship from sinking under the weight of its own stupidity.",
    "The booty here is 100 percent fool's gold."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "I think it is a very great movie. The atmosphere with the characters, especially Sparrow, the music and the settings are great. I can watch this movie over and over again and I can recommend this movie to anyone who likes this adventure-typeI think it is a very great movie. The atmosphere with the characters, especially Sparrow, the music and the settings are great. I can watch this movie over and over again and I can recommend this movie to anyone who likes this adventure-type of action movies.",
      "review_date": "2010-10-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "64? Why do the critics dislike this movie so much? Every single person I know who has seen this movie loves it! I mean LOVES it! All the girls say it's their favorite movie! It has everything you good want: good acting, humor, 64? Why do the critics dislike this movie so much? Every single person I know who has seen this movie loves it! I mean LOVES it! All the girls say it's their favorite movie! It has everything you good want: good acting, humor, spectacular action scenes, romance, and one of the best soundtracks ever created. Not to mention Geoffrey Rush and Johnny Depp acting together! This movie is awesome. If it doesn't make you want to grab a sword and go off to sail the seas, then you're probably dead.",
      "review_date": "2007-05-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Wonderfully entertaining. The entire concept was portrayed just as you think it would be. Jack Sparrow is one of if not the most amusing character to grace the screen. Excellent!",
      "review_date": "2013-12-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'm writing this review after watching The Lone Ranger. I think the amount of time and dip in quality in between the first Pirates movie and The Lone Ranger really solidifies my opinion on the general decay of Hollywood. I have a limitedI'm writing this review after watching The Lone Ranger. I think the amount of time and dip in quality in between the first Pirates movie and The Lone Ranger really solidifies my opinion on the general decay of Hollywood. I have a limited amount of hope for Pirates 5.",
      "review_date": "2013-07-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The film brings and opens an eclectic version of the well known swashbuckler genre; a light-hearted, and amusing version with a hilarious Depp as the sardonic and metaphorical Jack Sparrow, and everyone else seems to be weaved into the plot.The film brings and opens an eclectic version of the well known swashbuckler genre; a light-hearted, and amusing version with a hilarious Depp as the sardonic and metaphorical Jack Sparrow, and everyone else seems to be weaved into the plot. Bloom and Knightley make a poignant melodramatic piece to the film. It's authentic as it is ludicrous.",
      "review_date": "2013-10-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie itself is very good, but it is the score that brings it to life and steps it up to the next level. Everyone knows the Pirates of the Caribbean theme, and Hans Zimmer is a master at movie scores. With exciting action to witness and aThe movie itself is very good, but it is the score that brings it to life and steps it up to the next level. Everyone knows the Pirates of the Caribbean theme, and Hans Zimmer is a master at movie scores. With exciting action to witness and a great score to hum along to, you can't go wrong with this movie.",
      "review_date": "2013-09-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I loved it. It had dark moments, especially for a Disney movie. Plus it had extremely great humor from Johnny Depp, which added to the excitingly fun movie.",
      "review_date": "2013-11-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A remarkable movie that created a successful franchise while the genre of pirate movies in general was thought to be dead. Also it became the signature role for Johnny Depp (Maybe both a curse and blessing for him). It has a great cast ofA remarkable movie that created a successful franchise while the genre of pirate movies in general was thought to be dead. Also it became the signature role for Johnny Depp (Maybe both a curse and blessing for him). It has a great cast of characters that work well together and won me over easily as I was invested in them. Then there is the engaging story which takes the best from pirate movie themes and adds the titular Curse of the Black Pearl. Finally there is the humor that works so well. The introduction scene for Johnny Depp as Captain Jack Sparrow alone is hilariously funny. Lets start at the beginning. Pirates of the Caribbean was just an attraction in Disney theme parks before and I find it impressive that the project got green-lighted as the last true pirate films Pirates and Cutthroat Island failed while there were just a few attempts in the years before. There are many individual stories or motives of the characters combined into the story. Often these collide or align. Captain Jack Sparrow wants his ship the Black Pearl back and revenge on those who mutinied. Will Turner wants to win the heart of his sweetheart and more out of live. Elisabeth Swan wants more than being what society expects from females and Captain Barbossa and his crew want something I cant spoil. I like how the story unfolds and the twist are great. All characters have relatable and believable motivations and backstories that work well too. I like how the story and characters improve each other as it is interwoven well. It gets also the sweet spot with being serious and having great humor without weakening each other. The curse spices up this movie too. Then there are the actors. I already mentioned Jack Sparrow became Johnny Depps signature role. He impressed critics and fans alike. There is nearly no one who does not have heard of Captain Jack Sparrow. Then we have Orlando Bloom as William Turner who also become a character that easily won me over. So relatable with human flaws but also good hero material. With Keira Knightly as Elizabeth Swan we got actual a strong independent woman who does not want to be chained by expectations and society. She is strong willed, capable and can fend for her own in most situations. With Captain Hector Barbossa by the great Geoffrey Rush we got a great antagonist. He is an interesting character and strong adversary. Great main cast but it ends not there as I want to praise Kevin R Mc Nally, Jack Davenport and Jonathan Pryce as much as the two comic relive pirates that appear in all 3 movies of the trilogy (Forgot their names so shame on me). It has overall an excellent cast that fully delivers. It ends not there as the special effects were amazing. It looked so good back then and holds up and I am nearly ashamed that I cant go into details because of spoilers. The sets are the same. Everything looks natural and believable form ports, ships and towns to weapons and costumes. They took great care to deliver an atmosphere that captures the audience. Of cause I must mention the soundtrack by Hans Zimmer and Klaus Badelt. Hans Zimmer is a legend and Klaus Badeld is underappreciated in the business and together they delivered a great performance that is praised and cherished by many. Overall this became a surprise hit, started a franchise that still continues and is worth watching without doubt.",
      "review_date": "2021-01-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "it's a simple yet amazing movie. it had simple plot of ghost story based around pirate mythology with great actors, soundtrack, and cinematography. it has great charm to it that i think is missing from a lot of films like this and i thinkit's a simple yet amazing movie. it had simple plot of ghost story based around pirate mythology with great actors, soundtrack, and cinematography. it has great charm to it that i think is missing from a lot of films like this and i think that comes from it's characters. it's my favourite disney movie and i hope future movies with replicate what made it great",
      "review_date": "2014-12-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The Curse of the Black Pearl is pretty much the perfect pirate movie. Soulful performances (especially Johnny Depp) and epic action, and while it sheds epicness on every scene, it's never over bloated that it would feel confusing.",
      "review_date": "2016-10-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best pirates of the Caribbean movie of all time. Loved the supernatural element they added to this movie. Captain Barbarossa was a very good villain and one of the best villain performances of this century. Also this was johnny Depp's bestBest pirates of the Caribbean movie of all time. Loved the supernatural element they added to this movie. Captain Barbarossa was a very good villain and one of the best villain performances of this century. Also this was johnny Depp's best performance he has ever given. He was so funny random and just pure jot to watch. I swear there is nothing wrong with this movie. It's prefect in every single way. The locations are great the action scenes are fantastic and this movie is definitively one of my top ten favorite movies of all time.",
      "review_date": "2016-02-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Pirates of the Caribbean: The Curse of the Black Pearl is a masterpiece. Every single main cast character is played very well and is likable. Tiny Easter Eggs are used to connect it to the movie's origin, a Disney Park ride. The script isPirates of the Caribbean: The Curse of the Black Pearl is a masterpiece. Every single main cast character is played very well and is likable. Tiny Easter Eggs are used to connect it to the movie's origin, a Disney Park ride. The script is written very well, and scenes are directed almost perfectly. Character development is \"low-key\" and doesn't feel forced and the movie makes you think. I really enjoy this movie.",
      "review_date": "2017-06-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "We are talking about an epic pirate of modern comedy. Excellent music always listened to in 2019 for the energy it provides. This movie theme is magical he did not wake up! Great effects for a bygone era. A black idea that makes you smile.We are talking about an epic pirate of modern comedy. Excellent music always listened to in 2019 for the energy it provides. This movie theme is magical he did not wake up! Great effects for a bygone era. A black idea that makes you smile. Characters who rock childhood! Welcome to Caribbean Pirate!On parle d'une épopée pirate de la comédie moderne. Des musiques excellentes toujours écoutées en 2019 pour l'énergie qu'elle procure. Ce thème de film est magique il ne veilli pas ! Des effets géniaux pour une époque passé. Une idée noire qui fait sourire. Des personnages qui bercent l'enfance ! Bienvenue dans Pirate des Caraïbes !",
      "review_date": "2019-10-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This may be my favorite movie of all time. The characters are funny, interesting, and acted amazingly. The story is very great also, with a new twist on classic pirate stories. The setting they created alone is worth a award, for making itThis may be my favorite movie of all time. The characters are funny, interesting, and acted amazingly. The story is very great also, with a new twist on classic pirate stories. The setting they created alone is worth a award, for making it feel real. I couldn't find anything wrong with it if I tried. You need to watch this if you haven't already, you won't be disappointed.",
      "review_date": "2017-06-10",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A Classic Of The 2000’sCurse Of The Black Pearl is shockingly awesome with an absolutely amazing performance from Depp, a unique story, and beautiful visual effects.",
      "review_date": "2019-06-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great movie. Hats off to gore verblinski for creating such a stunning film. Everything from the score to the set pieces and the actors are all what makes this a great movie. Not to mention the dedication the directors had when making it.Great movie. Hats off to gore verblinski for creating such a stunning film. Everything from the score to the set pieces and the actors are all what makes this a great movie. Not to mention the dedication the directors had when making it. Truly wort your time, a must watch.",
      "review_date": "2021-07-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "They say the first is always the best and it certainly applies here. Pirates of the Carribean: The Curse of the Black Pearl is the start to arguably one of the best film franchises to date. If you like comedy, action, drama, romance-They say the first is always the best and it certainly applies here. Pirates of the Carribean: The Curse of the Black Pearl is the start to arguably one of the best film franchises to date. If you like comedy, action, drama, romance- actually, if you like watching movies in general, you have got to see this one. I don't usually give films a solid ten (I think this is the first) but I can find no flaws here. It has a great plot, great performance by the cast, great visual effects and very memorable music. Just watch it already.",
      "review_date": "2011-05-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Johnny Depp brings life to this breathtaking, exhausting, amazing and action packed film with a completely funny, unpredictable performance and the supporting cast does well too. I give this film 83%.",
      "review_date": "2011-12-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This pirate adventure tells the story about Jack Sparrow, who meets a young woman named Elizabeth Swann after saving her life. One night, with the gold medallion she carries around her neck, she gets captured by the pirates aboard the BlackThis pirate adventure tells the story about Jack Sparrow, who meets a young woman named Elizabeth Swann after saving her life. One night, with the gold medallion she carries around her neck, she gets captured by the pirates aboard the Black Pearl by the evil Barbossa who is using her to get the cave to find the treasure. However, the whole pirate crew is immortal due to the medallion and can turn into skeletons. With the help of a young man named Will Turner, Jack and his other crew members plan to save Elizabeth and put an end to Barbossa's reign once and for all.\r Wow. I was thrilled when I caught the screening of this in July of 2003 that I have one word to say about it and the word is: FANTASTIC!!! Johnny Depp was very hilarious as Jack Sparrow and he was a very good actor. Orlando Bloom (for some reason, was in the third LOTR movie, which came out at the exact same year this movie did) did very well as Will Turner, Kiera Knightley (from King Arthur) was so cool as Elizabeth Swann and she was so freaking hot! Geoffrey Rush was very frightening, yet entertaining as Captain Barbossa and the rest of the actors did very well at their performances.\r The CGI was pretty cool and even the action scenes were so cool. The storyline was well-paced and the cinematography was great.\r There is nothing negative to say about this film, so I am in good hands.\r Pirates of the Caribbean: The Curse of the Black Pearl is an excellent Disney pirate adventure based on the popular ride from DisneyWorld and one of the best movies ever made from the early 2000s.\r 8/10",
      "review_date": "2011-06-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The first real Pirates movie in history! Easily fun, exciting, and intriguing! It brings out the action in you and swordplay. Johnny Depp is truly a great actor, and Will and elizibeth make great couples.",
      "review_date": "2012-09-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The best Pirates movie so far. Johnny Depp is brilliant, Orlando Bloom is brilliant, Kira Knightly is brilliant.. basically all the actors and actresses are brilliant in their roles, and the story is great. You'd have to be pretty grumpy notThe best Pirates movie so far. Johnny Depp is brilliant, Orlando Bloom is brilliant, Kira Knightly is brilliant.. basically all the actors and actresses are brilliant in their roles, and the story is great. You'd have to be pretty grumpy not to like this thriller of a ride!",
      "review_date": "2015-09-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The first and only the best movie in the series. While enjoying some of the great performances including the plot, characters and action scenes, Johnny Depp was at his most humorous state.",
      "review_date": "2012-08-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Who knew turning a theme park attraction into a movie would create an awesome movie and an incredible trilogy! Thank you Disney! And thank you Johnny Depp for making Captain Jack Sparrow such an iconic character!",
      "review_date": "2011-03-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A smart and dark film at the same time. Yes it is a Disney film but is very scary. i enjoyed every minute of it. Jonny Depp's  peformance is one for the ages.",
      "review_date": "2012-03-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The best film that could ever be made about pirates. Despite some cliches, the film has striking and brilliant action sequences, witty dialogue, and many other great characteristics that make it all its own.",
      "review_date": "2012-11-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I can't believe i forgot to review this saga!! I remember the first time i watched \"Pirates of the carribean\" with my dad. This is without any doubt, the best pirate movie saga yet! I personally like the other part a bit more, but overall iI can't believe i forgot to review this saga!! I remember the first time i watched \"Pirates of the carribean\" with my dad. This is without any doubt, the best pirate movie saga yet! I personally like the other part a bit more, but overall i don't think you should miss any of the series!",
      "review_date": "2015-12-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This film is a film that caught everyone off guard- no one expected a Pirate film to be this epic and amazing!  The film has a surprisingly well written and witty script, a fantastic and perfect performance by Johnny Depp, awesome actionThis film is a film that caught everyone off guard- no one expected a Pirate film to be this epic and amazing!  The film has a surprisingly well written and witty script, a fantastic and perfect performance by Johnny Depp, awesome action sequences, classic and awesome music (Klaus Badelt and Hans Zimmer do spectacular) and the visuals are epic.  This film has classic written all over it and is one of the best adventure films ever made, Disney rarely disappoints lads and lasses.",
      "review_date": "2013-07-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"The Curse of the Black Pearl\" is a movie that focuses too much on preposterous humor. It kills the movie, but Johnny Depp's performance is the sole thing that saves the messy film.",
      "review_date": "2011-09-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Arg this is a pirates life for me! With unforgettable characters, a clever script, incredible action sequences, and an excellent mood, Pirates of the Caribbean is the perfect blockbuster and an incredible ride! :D",
      "review_date": "2011-03-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I absolutely loved this movie. Anything and everything I ever wanted in a pirate movie, all in one place.\r Excellent visuals, fantastic performances and gripping story.\r\n\r\nOverall:\r\nI can not fault this movie for anything. I have watched itI absolutely loved this movie. Anything and everything I ever wanted in a pirate movie, all in one place.\r Excellent visuals, fantastic performances and gripping story.\r Overall:\rI can not fault this movie for anything. I have watched it countless times and will continue to watch it many times more.",
      "review_date": "2013-09-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Simply one of the best movies ever made!! Very suspenseful!!! Very very very very good!!! A huge well done to Gore Verbinski, his crew and all the actors of that picture.",
      "review_date": "2013-08-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A swashbuckling pirate adventure that's fun for all ages. While the franchise has tapered off some in recent years, Pirates is still a fine film and a great start to the franchise",
      "review_date": "2020-03-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One of the most entertaining movies I've ever seen. Johnny Depp delivers his most memorable performance. It combined comedy, horror, adventure and action flawlessly. This is the only movie where I liked Keira Knightley. Orlando Bloom seemedOne of the most entertaining movies I've ever seen. Johnny Depp delivers his most memorable performance. It combined comedy, horror, adventure and action flawlessly. This is the only movie where I liked Keira Knightley. Orlando Bloom seemed somewhat off, though. His acting is the only thing that improved over the next two movies. Sadly, the series on a whole turned out to be a one hit wonder.",
      "review_date": "2013-02-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A fun tale based off a ride. Johnny Depp owns this role and is debatebly  his most known roleof all time. He is so funny and brings such a joy to the film.",
      "review_date": "2014-05-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I like very much how john depp plays the play of the very claver and sometimes stupid pirat who likes very much girls, action and the most of all he loves alchohol an at all he is very funny and he makes movie very funny and it i greatI like very much how john depp plays the play of the very claver and sometimes stupid pirat who likes very much girls, action and the most of all he loves alchohol an at all he is very funny and he makes movie very funny and it i great comedy. I like very much and of this action,comedy and most at all adveanture movie becose i like very muc how the pirates in the end determined thet this girl elizabeth (keira knightley) is not a girl of a pirat and then comes a jack sparrow and will turner (orlando bloom) and jack sparrow fight with barbossa and at same time when jack sparrow shot barbossa in the hart will turner whes father was a pirat give bood to the coins and barbossa dies.",
      "review_date": "2013-03-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'm a teenage girl, and I know most girls LOVE Pirates Of The Caribbean. Yet, I did not like this movie at all. I thought it was boring, dumb, horrible acting and WAY to long. Yes, that's what I think and I'm a teenage girl. I'm a teenage girl, and I know most girls LOVE Pirates Of The Caribbean. Yet, I did not like this movie at all. I thought it was boring, dumb, horrible acting and WAY to long. Yes, that's what I think and I'm a teenage girl. Now, let the gasping begin.",
      "review_date": "2007-06-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Its stupid, its noisy, its messy, its full of terrible acting (except Depp) and silly jokes, its overrated, its catchy, its corny, and its dull; not dull enough to make it the most overhyped movie of all times, but surely dull enough to make Its stupid, its noisy, its messy, its full of terrible acting (except Depp) and silly jokes, its overrated, its catchy, its corny, and its dull; not dull enough to make it the most overhyped movie of all times, but surely dull enough to make it to at least top 10.",
      "review_date": "2007-05-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Awful. Johnny Depp is decent but the story's incredibly boring.",
      "review_date": "2007-05-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The story sucked. Not nearly as good as the first one. The characters didn't even display the same personality as in the first. Seems as if the writers rushed through writing this one. Hugely disappointing.",
      "review_date": "2006-07-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Poor film in many aspects, but an amazing performance by Depp, one of the best actors in the modern game.",
      "review_date": "2005-10-29",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A blockbuster in every way, The Curse of the Black Pearl is a perfect start to a massively grossing franchise that is still going, flawed but definitely enjoyable, much more than a film based on a theme park ride should have been.\rJohnnyA blockbuster in every way, The Curse of the Black Pearl is a perfect start to a massively grossing franchise that is still going, flawed but definitely enjoyable, much more than a film based on a theme park ride should have been.\rJohnny Depp creates a character that will undoubtedly be one of if not the most iconic of all his roles, Captain Jack Sparrow, don't forget the 'Captain' part, he won't like that. A man famous for us often personal and more bizarre roles has created one of the most memorable and comic characters we have seen, and to top it all off, he's a pirate.\rSet in the midst of the age of the cutlass-wielding treasure hunters, Jack lands in Port Royal where inadvertently saves the Governors daughter, Elizabeth Swan (Kiera Knightley). He somewhat befriends blacksmith Will Turner (Orlando Bloom) who sets out with him to capture the infamous Black Pearl, a ship run by the dead who have been cursed after stealing the wrong sort of treasure.\rThe set-pieces are explosive and the dialogue is a homage to the age the film is set in. There is quite a reliance on humour, which pays off in many aspects throughout the film but at other points can fall short of its target, the two high points of this being Jack Sparrow himself played uniquely by Depp, bringing his very own take and charisma to the character, and Geoffrey Rush who plays the Captain of the Black Pearl, Barbosa, whose confident and grumbled Irish accent and command of the screen, along the unfortunately limited screen time himself and Depp share together, make up very dark and witty humour throughout.\rThe heart of the film is lead by Knightley and Bloom who have a blossoming romance on the cards, their scenes can be a little dramatic for the theme of the film, and more time should have been spent getting to know these pirates more, but take the good with the bad I suppose.\rOf course the true brand of the film is that of Jack Sparrow, his mumbling and comedic quips with those surrounding him are electrifying through the talent of Depp, and while the supporting cast are on sound form, he truly steals the show, along with quite the satisfying finale that of course opened all sorts of doors. The film is quite remarkable in the sense of its emergence from nothing, but I suppose if Ron Howard takes inspiration from paintings, a theme park ride is bound to be a creative playground.",
      "review_date": "2013-06-28",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The first film in the series is unquestionably the best. Jack Sparrow is an excellent character, and really carries the movie. It reminds me of the old Marx Brothers films: if not for Groucho, Chico, and Harpo, they would be bland and nobodyThe first film in the series is unquestionably the best. Jack Sparrow is an excellent character, and really carries the movie. It reminds me of the old Marx Brothers films: if not for Groucho, Chico, and Harpo, they would be bland and nobody would care, but thanks to Jack Sparrow  who seems to incorporate the best elements of all three  the movie ends up fantastically entertaining. Will Turner may be the protagonist by any helpful analysis of story structure, but Jack is the reason you're watching, and he's well worth it.\r The Curse of the Black Pearl has a solid, familiar-yet-surprising story at its heart, that never loses sight of where it's going next. This is part of what makes it good: you can guess roughly where it's going next, and have your expectations confirmed, but there's always some surprise complication waiting for you when you get there, so you're never bored. One of the best Disney movies of the 2000s, and well worth seeing by anyone.",
      "review_date": "2013-07-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Pirates sets sail with a witty plot.\rPirates of the Caribbean succeeds with great acting from the likes of Johnny Depp who brings his character an irreplaceable flare. The movie never falls flat but never becomes great with an average plot.",
      "review_date": "2013-11-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I'm not a fan of pirate movies, but I got to admit it... this one did 'pirate' enough to say \"Arr!\" and basically the best in the Pirates of the Caribbean franchise.",
      "review_date": "2016-01-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Pirates of the Caribbean is a totally different pirate movie, which is actually what makes this movie good. While the plot seems kinda dumb, its humor, characters, and overall thrill makes this a interesting touch.",
      "review_date": "2016-03-24",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "One would think it's a curse to have to transform a theme park attraction into a summer cinematic spectacle, but shiver me timbers, the only hex that burdens Disney's Pirates of the Caribbean: The Curse of the Black Pearl is its unwieldyOne would think it's a curse to have to transform a theme park attraction into a summer cinematic spectacle, but shiver me timbers, the only hex that burdens Disney's Pirates of the Caribbean: The Curse of the Black Pearl is its unwieldy title. This rollicking adventure from director Gore Verbinski is in love with the sights and sounds of pirate movie tropes—sailors swinging from ship ropes, sword fights, cannon balls flying through the air, glistening pirate bounty—and benefits immensely from both the filmmaker's successful fusion of arch comedy, swashbuckling action, mild horror (a trick neither his execrable The Mexican, nor his leaden The Ring, could pull off), and his willingness to let Johnny Depp overact his heart out.\r Depp, dressed up in a variety of colorful scarves that only partially contain his unruly tangle of dreadlocks and beaded hair, plays infamous pirate rascal Captain Jack Sparrow with limp wrists, a prancing gait, and a lilting British drawl that turns every “th” sound into an “f.” An androgynous king of the high seas, Sparrow is a gracefully asexual fop who, by embodying both feminine prettiness and masculine brashness, seems well aware of how to bend it like Beckham. Flashing his gold-toothed smile with a roguish delight that playfully hints at the naughtiness being concocted inside his scraggly head, Depp commands the screen so forcefully that it's difficult to sustain interest in the film when he's not front and center. During such lulls, one is forced to contend with the de facto love story between blacksmith Will Turner (Orlando Bloom) and governor's daughter Elizabeth Swann (Keira Knightley), who is kidnapped by the undead crew of the legendary Black Pearl for possessing a piece of their cursed gold. Swann's abduction and Turner's quest to save her (which involves enlisting Sparrow's help) is the plot's catalyst, but since Pirates' greatest asset is Depp's uninhibited antics, things tend to drag when the puckish Sparrow is confined to mere supporting player.\r Bloom does an admirable job looking like a mini-Errol Flynn, and Knightley's delicate features clash winningly with her character's unladylike feistiness, but both are regularly upstaged by Depp, Geoffrey Rush as the decrepit Captain Barbossa, and a gaggle of peripheral characters (pirates and British alike) who contribute to the richness of Verbinski's theme park-inspired tapestry. Narrative repetition muddles up the film's second act, in which the adventurers find themselves visiting, and then revisiting, the same locales and skirmishes, but the occasionally monotonous escapades are bolstered by some playful Harryhausen-esque CGI villains—the Black Pearl's pirates, when caught in a blade of moonlight, are revealed to be walking, talking skeletons—and the director's eagerness to embrace, while slyly poking fun at, the hoary clichés his film must dutifully adhere to. Like the hidden stash of Caribbean rum that Sparrow and Swann enjoy after being stranded on a remote island by the dastardly Captain Barbossa, Pirates of the Caribbean: The Curse of the Black Pearl is an intoxicating delight that abounds with woozy charm and delectable spiciness.",
      "review_date": "2016-03-31",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Beautiful photography, choreography, editing and directing. Gore Verbinski had just finished the equally beautiful The Ring prior to this and was on a run, with The Weatherman coming after, he was up there with Ridley Scott for a few movies.Beautiful photography, choreography, editing and directing. Gore Verbinski had just finished the equally beautiful The Ring prior to this and was on a run, with The Weatherman coming after, he was up there with Ridley Scott for a few movies.  The sequels all suck and the plot is very implausible, as I age any movie where the characters are not all selfish backstabbers seems implausible.",
      "review_date": "2020-06-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Johnny Depp is an awful actor, Jack Sparrow is awkward and lame. Everything else was great, the cinematography, special effects, the acting, and the humor. Overall it's a great movie, but I get a boner whenever I see Captain Jack.",
      "review_date": "2019-03-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "What is with the critics who don't like this film? It's amazing! With Johnny Depp playing the main character it is great and the best movie in ages. The balance of action and everything else works, and I like it.",
      "review_date": "2006-08-26",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Pirates of the Caribbean is a movie with comedy, plenty of pirate adventure, and even some romance. The stroyline is easy enough to follow and the movie delivers some really spectacular pirate action. If you like pirates, Johnny Depp, or Pirates of the Caribbean is a movie with comedy, plenty of pirate adventure, and even some romance. The stroyline is easy enough to follow and the movie delivers some really spectacular pirate action. If you like pirates, Johnny Depp, or some swashbuckling action you will find Pirates of the Caribbean a wonderful movie.",
      "review_date": "2006-07-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I thought that this move was so GREAT!! i think that it was better than the first, except for elizibeth killing Johnny Depp. I thought that it was so funny!",
      "review_date": "2006-07-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is no doubt the best movie ever!! Johnny Depp is charming, funny and sexy!! You can't get a better actor to play such a cool, smart and funny man such is Jack Sparrow!! If I could, I would rate this movie way past 10, so ending This is no doubt the best movie ever!! Johnny Depp is charming, funny and sexy!! You can't get a better actor to play such a cool, smart and funny man such is Jack Sparrow!! If I could, I would rate this movie way past 10, so ending with tht...this is the best movie ever made!!",
      "review_date": "2007-01-02",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "yeah, allright, i think its a really really great movie! love depps performance, the story, the music, the caribbean in background:-) and of course the other actors too. this is brilliant and fun while watching, perfect entertainment! i yeah, allright, i think its a really really great movie! love depps performance, the story, the music, the caribbean in background:-) and of course the other actors too. this is brilliant and fun while watching, perfect entertainment! i love, love it and it's not only me",
      "review_date": "2008-04-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best movie I've seen all year. I enjoyed every one hundred and forty-three minutes of it. JD is cute, even when he looks like a pirate that just washed up on shore.",
      "review_date": "2003-12-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Best movie I've seen all year. I enjoyed every one hundred and forty-three minutes of it. JD is cute, even when he looks like a pirate that just washed up on shore.",
      "review_date": "2003-12-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie rocks the house! I can't get enough of Depp and Orlando!",
      "review_date": "2004-03-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This Film is good for certain points. I am now studying it for my media independant study at college, to be honest in comparison to old 1950s pirate movies its very similar. However the genre has developed and Disney in all honesty hasnt This Film is good for certain points. I am now studying it for my media independant study at college, to be honest in comparison to old 1950s pirate movies its very similar. However the genre has developed and Disney in all honesty hasnt done a bad job at turning the theme park (not video game) into a film. I can see why theyve hired Johnny Depp and Orlando Bloom for the young girls only because its generally men who go to see pirate films because of the swords and guns very phallic symbols if you ask me lol. All in All i think that this movie is great and I would recommend it to most people if you like a good giggle.",
      "review_date": "2005-09-13",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Everything a viewer wants: action, romance, revenge, and a happy ending, albeit, a setup for a sequel!",
      "review_date": "2006-06-21",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Yet another example of why to be wary or critics. If you didn't enjoy this movie, you shouldn't be going to the movies, period. Rarely, a movie comes along that absolutely no one has any business not enjoying unless they have an Yet another example of why to be wary or critics. If you didn't enjoy this movie, you shouldn't be going to the movies, period. Rarely, a movie comes along that absolutely no one has any business not enjoying unless they have an agenda or just love ragging on certain movies. This is one of them. Salon.com's review is particularly repulsively incompetent in its sheer 'incorrectness'. Now I know never to read them again.",
      "review_date": "2006-07-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This seems good enough movie for me to watch. You will like this movie. This is way better than the sequel",
      "review_date": "2006-07-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I knew of the Pirates of the Caribbean franchise since this film came out but was never interested in it until I came across a poll posted on a website asking \"best film trilogy?\" and was curious about it. I already had this film in DVD but I knew of the Pirates of the Caribbean franchise since this film came out but was never interested in it until I came across a poll posted on a website asking \"best film trilogy?\" and was curious about it. I already had this film in DVD but never saw it, I checked and hell, it was very interesting, the setting is good, the story is a littleflat but the ambient was so good and Jack Sparrow is so much of a cool character. Definitely looking forward to seeing the other films and might see again this film several times.",
      "review_date": "2010-01-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It was the best! I think so.",
      "review_date": "2005-12-01",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie is GREAT!! Just needs a little bit more. I'm not sure what but...... I just don't think i can give is a 10.",
      "review_date": "2006-10-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I think this is one of my favorite movies ever. The second is better but I still loved it. It has action, adventure, comedy and romance. what else do you need?!?!? i give johnny depp 2 thumbs up for #1 best actor ever. and i give pirates...anI think this is one of my favorite movies ever. The second is better but I still loved it. It has action, adventure, comedy and romance. what else do you need?!?!? i give johnny depp 2 thumbs up for #1 best actor ever. and i give pirates...an outstanding...AYE!!!",
      "review_date": "2006-12-30",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The movie rocked! Johnny Depp was totally awsome, as always. All the other actors and actresses were great too.....I could watch the movie over and over again without ever getting bored.",
      "review_date": "2006-02-17",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The best Disney movie to be released in recent years.",
      "review_date": "2006-03-25",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I thought Disney would screw this up but they actually did a great job. Depp deserves the Oscar.",
      "review_date": "2006-04-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It was amazing Verbinski brought the best out of Johnny Depp he had him ham it up like Steve Martin and play a serious role like Nicholas Cage all roled into one lovable character. It was a great film but I admit it it wasnt as creative as It was amazing Verbinski brought the best out of Johnny Depp he had him ham it up like Steve Martin and play a serious role like Nicholas Cage all roled into one lovable character. It was a great film but I admit it it wasnt as creative as it could have been but it was the best historical fantasy I have ever seen. The action nailed me to my seat and to take some of the pressure off Jack Sparrow was there a drunken sailor he gave the movie some gteat comic relief. Every actor was perfectly handpicked to be a adventurous comical sailors and pirates. Well done!!!",
      "review_date": "2007-05-05",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "OK I don't understand why people think this is a horrible movie. It's funny, and has an entertaining story. I go to the movies, and buy them on DVD, to have fun, not say \"Wow he didn't say that line with much emotion, OK I don't understand why people think this is a horrible movie. It's funny, and has an entertaining story. I go to the movies, and buy them on DVD, to have fun, not say \"Wow he didn't say that line with much emotion, he's a terrible actor.\" Just enjoy a movie because that's what you're supposed to do with a movie. Oh and about critics, it's better for their paycheck if they give a movie a lower score. They actually don't know what they are taking about.",
      "review_date": "2008-01-09",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "I thought this film was absolutely amazing and everyone i no loves it especially the girls because of the dreamy actor orlando bloom! If i could at least sit and watch them filming i would i love this movie ssssssooooooooooo much!!!!!",
      "review_date": "2008-06-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Well, after being disappointed with \"Matrix Reloaded\" AND \"Legally Blonde 2\", I felt there was no hope for a decent summer flick other than Nemo which I saw enough times. I was actually anticipating on seeing this movie (the trailers were Well, after being disappointed with \"Matrix Reloaded\" AND \"Legally Blonde 2\", I felt there was no hope for a decent summer flick other than Nemo which I saw enough times. I was actually anticipating on seeing this movie (the trailers were the reason), but then the SF Chronicle pretty much gave it a bomb so I was reluctant to see it. But I did. And I had so much fun too. Johnny Depp MADE the movie, he was hilarious. It was like watching \"Monty Python and the Holy Grail\" only a bit more serious and it wasn't set in the medieval times. Had it not had in humor, this movie would have been AWFUL. The plot was very creative (heck if this film had been made into novel and not a movie it still would've been great). The action scenes held my attention better than \"The Matrix Reloaded\"'s did. And it had incredibly cool special effects as well. Yes, it's long but I didn't care. The only complaint I have is that one plot hole about Johnny Depp's character, but I don't want to give it away. Overall, go sea it, and ignore the negative reviews.",
      "review_date": "2003-07-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Well, after being disappointed with \"Matrix Reloaded\" AND \"Legally Blonde 2\", I felt there was no hope for a decent summer flick other than Nemo which I saw enough times. I was actually anticipating on seeing this movie (the trailers were Well, after being disappointed with \"Matrix Reloaded\" AND \"Legally Blonde 2\", I felt there was no hope for a decent summer flick other than Nemo which I saw enough times. I was actually anticipating on seeing this movie (the trailers were the reason), but then the SF Chronicle pretty much gave it a bomb so I was reluctant to see it. But I did. And I had so much fun too. Johnny Depp MADE the movie, he was hilarious. It was like watching \"Monty Python and the Holy Grail\" only a bit more serious and it wasn't set in the medieval times. Had it not had in humor, this movie would have been AWFUL. The plot was very creative (heck if this film had been made into novel and not a movie it still would've been great). The action scenes held my attention better than \"The Matrix Reloaded\"'s did. And it had incredibly cool special effects as well. Yes, it's long but I didn't care. The only complaint I have is that one plot hole about Johnny Depp's character, but I don't want to give it away. Overall, go sea it, and ignore the negative reviews.",
      "review_date": "2003-07-14",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "It was fun, but I have no clue how people can say it was the best movie they've in in their whole lives. I think it's overrated. It was based on a ride!",
      "review_date": "2005-11-04",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This is the best movie I have ever seen in my whole life!!!!",
      "review_date": "2005-05-19",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Because I'm a huge fan of pirates and the Disney Ride itself, I loved the movie. J. Depp was excellent, as were his fellow actors. The plot was genious and entertaining. There were maybe one or two dull spots, but they were necessary to Because I'm a huge fan of pirates and the Disney Ride itself, I loved the movie. J. Depp was excellent, as were his fellow actors. The plot was genious and entertaining. There were maybe one or two dull spots, but they were necessary to explain the plot. I especially enjoyed all of the literary devices used in the film, such as foreshadowing and symbolism. Maybe I'm more of the literary type and that is also why I enjoyed this film. To all of you who gave this movie a bad rating, you are uncultured and need to maybe read a book. For those of you that hate the movie because of the female fasination of the leading males, that's just sad... This movie was an excellent piece of artistry and I enjoyed it very much.",
      "review_date": "2006-01-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Johnny Depp was AWESOME in this movie!!! I loved it. I saw it twice in theatres and bought it the day it came out in dvd.... One of my favorite movies!",
      "review_date": "2006-12-20",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "this movie is the best also dead mans chest.",
      "review_date": "2006-07-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An instantly classic movie that i've seen way too many times because it's so good.  The music is especially awesome as well as the hilarious quirkiness of Captain Jack Sparrow.  Never gets old.",
      "review_date": "2010-08-22",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This may not be the greatest movie ever made but that does not mean it is boring at all. This is a really entertaining movie. The characters are likeable, the action is engaging, and there are some great performances. The film can drag atThis may not be the greatest movie ever made but that does not mean it is boring at all. This is a really entertaining movie. The characters are likeable, the action is engaging, and there are some great performances. The film can drag at times and the story does get a tad overly complicated but not too much. Overall I really enjoy this movie. Pirates of the Carribean: The Curse of The Black Pearl is a ton of fun to watch and just makes you want to be a pirate. I’ve seen it several times and I know I’ll probably wind up watching it again in the future.",
      "review_date": "2013-12-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Actually was pretty good. The only decent film in the entire series if you ask me. While the long run time does hurt it a bit, It was still an enjoyable film.",
      "review_date": "2011-11-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "There is a girl in my class that would have the same opinion of this movie as I do, Great story, interesting plot and hilarious moments... This is truly a great that will go down in history... But the rest might not....... Looking forward toThere is a girl in my class that would have the same opinion of this movie as I do, Great story, interesting plot and hilarious moments... This is truly a great that will go down in history... But the rest might not....... Looking forward to 4th movie coming to cinema soon",
      "review_date": "2011-01-06",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "This movie will make you love pirates if you didn't already love it. Depp is great in this! Lots of cool sword fights and action scenes in it, too! It's a great story, and will want to watch it over and over again!",
      "review_date": "2011-05-18",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Nothing is better than the original, as is the truth with the film that introduced Captain Jack Sparrow to the world that has yet to let go.  The first Pirates movie is a boatload of wacky, PG-13 fun, filled with sword-fights, skeletons,Nothing is better than the original, as is the truth with the film that introduced Captain Jack Sparrow to the world that has yet to let go.  The first Pirates movie is a boatload of wacky, PG-13 fun, filled with sword-fights, skeletons, general hilarity, and the kind of cheesy love story that adds to the movie instead of subtracting from it.",
      "review_date": "2011-08-27",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "\"The Curse of the Black Pearl\" is a 143 minutes ride of a thrilling adventure featuring rich CGI, action-packed tone and a powerful performance from Depp. This is a perfect summer blockbuster.",
      "review_date": "2011-12-11",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "A good movie all around. Good acting, good writing, great score, some really memorable quotes. Depp as Jack Sparrow should go down in film history as one of the greatest characters ever. There is something off about the final scene that IA good movie all around. Good acting, good writing, great score, some really memorable quotes. Depp as Jack Sparrow should go down in film history as one of the greatest characters ever. There is something off about the final scene that I can't quite figure out, but that's my only real complaint.",
      "review_date": "2011-09-08",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "The film maybe long and sometimes too over the top, but Pirates of the Caribbean: The Curse of the Black Pearl is a good popcorn film filled with comedy, drama and action, especially a lot of action. I may have said the acting at times can beThe film maybe long and sometimes too over the top, but Pirates of the Caribbean: The Curse of the Black Pearl is a good popcorn film filled with comedy, drama and action, especially a lot of action. I may have said the acting at times can be too over the top with many of the characters, but some performances like Johnny Depp (Jack Sparrow) and Geoffrey Rush (Captain Barbossa) were believable throughout the movie. The plot for the most part was straight forward, though this would be a film you have to listen carefully, for sometimes the dialogue from some thick speaking actors will recital things too quickly. If you want to hear a good old pirate's tale, then The Curse of the Black Pearl is the film you must keep an eye on. All audience alike will certainly not be disappointed.",
      "review_date": "2011-12-03",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Probably one of the best adventure comedies in film, Black Pearl is incredibly entertaining from start to finish.",
      "review_date": "2019-04-12",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Great story and great original characters. Great mix of action, comedy and suspense.",
      "review_date": "2020-03-15",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "An excellent movie. Just been watching it after dead men tell no tails just came out. Needed to remember the root and they are so fresh.A well writed story, some strong but simple character ( what you expect for a standard popcorn movie). OfAn excellent movie. Just been watching it after dead men tell no tails just came out. Needed to remember the root and they are so fresh.A well writed story, some strong but simple character ( what you expect for a standard popcorn movie). Of course Jonny Depp is shinning as this fancy pirate but the magic works. We're far from its sequel that shows more special effect sequence than real story, taking the time to develope characters and make them truly appreciable.",
      "review_date": "2017-05-23",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Pirates of the Caribbean, The Curse of the Black Pearl, directed by Gregor Verbiniski, is one of the best action/ adventure films of 2003 and was based on a Disney World ride. Verbiniski directed a few other movies before hitting it big withPirates of the Caribbean, The Curse of the Black Pearl, directed by Gregor Verbiniski, is one of the best action/ adventure films of 2003 and was based on a Disney World ride. Verbiniski directed a few other movies before hitting it big with this one. It grossed over 650 million worldwide, and gave Verbiniski the type of success most directors envy. Pirates of the Caribbean will draw you in and keep you hooked, with a burning ship, a mysterious pirate flag, and the grand entrance of Jack Sparrow. With his amazing escape via ship parts and zip lines, a sword fight on roof beams... and that's just the beginning. Then the intrigue truly begins. Have you ever watched a movie, where reality and fantasy come together adding a mythological twist to it? Sit back while the director transports you to a far away place to create this fantastic movie, thatâ",
      "review_date": "2011-12-07",
      "source": "metacritic",
      "lang": "en"
    },
    {
      "review_title": null,
      "content": "Pirates Of The Caribbean: The Curse Of The Black Pearl is flawed fun. It's mostly predictable, it's got some good gags, but it's heavily flawed. The film has literally HUNDREDS of contradictions and plot holes. I enjoyed the film, but thePirates Of The Caribbean: The Curse Of The Black Pearl is flawed fun. It's mostly predictable, it's got some good gags, but it's heavily flawed. The film has literally HUNDREDS of contradictions and plot holes. I enjoyed the film, but the contradicitions were distracting. This film has a fantastic first half hour. It's funny, and thrilling at times. However, after that first half hour, the quality drops. It's still enjoyable, and you will be entertained, but it never lives up to that first half hour. The musical score is VERY good. There were too many hands in the score for me to properly credit anyone, but Hanz Zimmer played a big part in the score, and it shows. The action, is mostly generic, and will never have you on the edge of your seat. At times, the action is even predictable. At the minimum, it's passable, and not terrible. The acting is strong. Performances from Johnny Depp, Orlando Bloom, and Geofferey Rush shine. The story is a little on the cliche side, but it's a silly tale, and no one really cares. In addition to contradictions, there were a lot of moments where I rolled my eyes at the improbability of it all. Of course, teenage boys tend to eat that stuff up. POTC: TCOTBP is a fun, albeit flawed movie, that's probably best for teens and tweens with low expectations.",
      "review_date": "2012-04-19",
      "source": "metacritic",
      "lang": "en"
    }
  ],
  "num_reviews": 138,
  "genres": [
    "Action",
    "Adventure",
    "Fantasy",
    "Romance",
    "Family"
  ]
}