{
  "title": "The Cat in the Hat",
  "rating": 3.9,
  "release_date": "2003-11-21",
  "genre": [
    "Adventure",
    "Comedy",
    "Family"
  ],
  "summary": "Mike Myers stars in the title role of Dr. Seuss' The Cat in the Hat, a film adaptation of the beloved literary classic.  (Universal Pictures)",
  "critic_reviews": [
    "So good it breaks your heart for not being better. It is kept from brilliance by a soggy climax and a clumsy central narrative device.",
    "Myers' Cat, with a voice that crosses Bert Lahr's Cowardly Lion with Mel Blanc's Bugs Bunny, is generally fun, possessed of an anarchic playfulness that balances his sometimes bawdy tendencies.",
    "It's moderately engaging for the first half-hour, somewhat trying during the second half hour, and virtually unbearable over the final twenty minutes. It's a marginally recommendable film for kids, but not necessarily for parents.",
    "It's another overwrought clunker like \"How the Grinch Stole Christmas,\" all effects and stunts and CGI and prosthetics, with no room for lightness and joy.",
    "Long on visual dazzle but short on warmth, and the humor is excessively raunchy for a family film.",
    "Attractively designed, energetically performed and, above all, blessedly concise, this adaptation of one of the most popular American kids' books of all time walks the safe side of surrealism with its fur-flying shenanigans. The younger the viewers, the better reactions are bound to be.",
    "Myers is the movie's fatal flaw, squeezing out the other characters who fatten the plot, mostly with an eye to parents.",
    "Emerges as a lackluster and nearly charmless affair.",
    "Left me feeling empty inside. There’s no warmth and character from the original Dr. Seuss book, and there’s no substance or soul in the story elements.",
    "A few laughs come from Alec Baldwin as Mom’s posturing, deceitful boyfriend, but attempts at inserting risqué modern humour sit uneasily with the playfully innocent surrealism of Seuss’ famous characters.",
    "Although a literal movie adaptation of Seuss' 1957 classic \"The Cat in the Hat\" might have run 20 minutes, is it too much to ask that the filmed material preserve the author's sensibility?",
    "A semi-intriguing abomination, the movie The Cat in the Hat takes a piece of classic childhood Americana and turns it into something garish, dumb, ugly and senseless.",
    "Very young children, it should be said, probably won't have any problem with the movie. It's bright and perky on the surface. But for anyone mature enough to pay closer attention, it's going to fall short of expectations.",
    "Grazer's writing team has filled up the film's 82 minutes with winking product placements, SNL-type goofs, PG gags premised on not quite cursing, a Smashmouth cover of the Beatles' \"Getting Better,\" and a lame subplot about a scuzzy lothario (Stephen Baldwin).",
    "Someone (Myers?) came up with the bright idea of turning the Cat in the Hat into the worst Vegas nightclub spritzer of 1958. He's become a furry version of Rip Taylor: a walking, talking vaudeville idiot box.",
    "It's a sort of soullessly cheerful cynicism that is about as far from Seuss as one can imagine.",
    "Talk about your quick-buck exploitation.",
    "As a British politician said of a corrupt but articulate peer, \"The Cat in the Hat\" is like a rotten mackerel seen by moonlight: It shines as it stinks.",
    "Charmless and grating and immediately forgettable.",
    "It pains me to tell you, But really, it's true: The Cat in the Hat  Is a piece of dog doo.",
    "Where \"The Cat\" book was anarchistic but ultimately sweet-spirited, this movie is ugly, dumb and colossally mean-spirited.",
    "Everything to treasure about that magical, slightly malevolent feline of childhood verse is obliterated in the coarse, charmless Dr. Seuss' The Cat in the Hat.",
    "Dr. Seuss' The Cat in the Hat is gorged with shtick and gadgetry. When it comes to highlighting everything better left in the dark, it makes even the Matrix sequels look like works of genius.",
    "It is an embarrassment and an insult to a character that has been beloved by kids for 45 years.",
    "A vulgar, uninspired lump of poisoned eye candy.",
    "The movie is crass and vulgar almost beyond belief.",
    "Frenetic and cheerless action aside, the film's real problem is the Cat, who looks most unmagically like a second-string college sports mascot and conducts himself like a risque baggy-pants comedian.",
    "If the producers had dug up Ted Geisel's body and hung it from a tree, they couldn't have desecrated the man more.",
    "I do hate to say it -- it's really a drag, but why did they let this Cat out of the bag?",
    "They've taken a classic and they've battered it senseless and, boy, does it stink. It’s so bad it’s amazing it's being released, and box office-goers might soon end up fleeced. And annoyed and bewildered, perhaps even creeped-out by this cacophonous mess which is awful throughout.",
    "Such a remarkable rift between its charming source material and its heinous cinematic realization that the producers may as well have skipped the hassle of securing licensing rights and simply called this mess Mike Myers: A--hole in Fur.",
    "Critics are paid to suffer bad art,\r\nno matter how icky it is from the start. So all we could do was to Sit! Sit! Sit! Sit!  And we did not like it.  Not one little bit.",
    "Like being run over by a garbage truck that backs up and dumps its load on top of you. It's a sloppy and vulgar burlesque, one of the most repulsive kiddie movies ever made.",
    "The ongoing cinematic desecration of Dr. Seuss' legacy continues with The Cat In The Hat, a clattering abomination that makes it depressingly likely that an entire generation of reading-averse children will know The Cat In The Hat as that obnoxious character Mike Myers played in that horrible movie.",
    "Comes scarily close to being the most unendurable Hollywood creation of the last dozen years.",
    "The narrative itself, attributed to three former \"Seinfeld\" writers who also worked on \"The Grinch,\" reeks of desperation."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "What happens when you give a guy with no directing experience the opportunity to direct a film based on a Dr. Seuss book? You get \"The Cat in the Hat,\" one of the worst films of all time. Poorly-acted, poorly-written, completely inappropriateWhat happens when you give a guy with no directing experience the opportunity to direct a film based on a Dr. Seuss book? You get \"The Cat in the Hat,\" one of the worst films of all time. Poorly-acted, poorly-written, completely inappropriate for it's intended audience, indescribably annoying, and filled with awful, annoying characters, \"The Cat in the Hat\" becomes unlikeable from the jump. As soon as I saw the Cat on the poster...well, I jumped because he looked kinda creepy, but I also knew that I was in for a bad time. If I can say ONE good thing about this abomination, it's that it's relatively short, but this definitely feels much longer than the 82 minutes it claims to be. This film is an absolute travesty, and no one deserves to put themselves through this. Please, don't watch this. I BEG of you, DO NOT watch this film UNDER ANY CIRCUMSTANCES.",
      "review_date": "2016-10-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Awful, just plain awful. This is most disrespectful to Seuss's classic book. It's a good thing that Audrey Geisel decided to stop Universal making live-action Seuss movies.",
      "review_date": "2018-07-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The humour was average, the rest of the movie was boring. It's nothing like the book until the part where it starts raining. Only watch if you loved the book so much that you will enjoy this movie.",
      "review_date": "2015-07-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Where do I begin to describe this awful mess of a film? A film that has no right to be called a \"family film\", a film that does everything it can to not be funny, a film that wastes the talent of Mike Myers in the lead role as Dr. Seuss' \"TheWhere do I begin to describe this awful mess of a film? A film that has no right to be called a \"family film\", a film that does everything it can to not be funny, a film that wastes the talent of Mike Myers in the lead role as Dr. Seuss' \"The Cat in the Hat\".\r The movie, directed by Bo Welch, sees two kids Conrad (Spencer Breslin) and Sally (Dakota Fanning) often misbehaving, and their single mother, Joan (Kelly Preston) who works in a Real Estate tries to get them to understand how to behave. Conrad ends up messing the house up, and it seems that Joan is dating their next door neighbor, Lawrence (Alec Baldwin), which Conrad isn't happy with.\r One day, the kids find out that there is a strange, human-like sized cat in their house, this turns out to be \"The Cat in the Hat\" (an obnoxious Mike Myers), who causes chaos once he has entered their lives. We see the Cat doing many crazy and obnoxious things, much to the point where you'd think the movie's plot has gone out for a walk. The colorful cinematography by Emmanuel Lubezki, is more of an eye-sore than it is eye-popping. There is no sense of realism, but at the same time, there is also no sense of whimsy... it lives in a fantasy world where everything is animated to the point where you'd also think, why is this live action, again?\r The humor in this film is also ill-timed, take a scene for example, where Mike Myers' the Cat sees a picture of the children's mother and his hat expands in size as he lustfully gazes at this picture, then the kids tell him that's their mother. Adult humor is allowed in kids' films and can work, but only when its subtle, this joke was not subtle in the slightest. None of them are. Take another scene, where we see our main characters riding along some kind of fantasy roller-coaster, and then the movie stops just so Mike Myers, as the Cat, can insert a little plug to a Universal Studios ride. The product placement and obvious advertising is shameful and should not have been in there to begin with.\r This is a painful movie to sit through, none of the jokes are timed properly, none of the plot makes much sense, and the movie is just weird to look at. Family films could not get more obnoxious than this.",
      "review_date": "2016-08-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was best what they could do? at this point i wasnt satisfied even in 2015 or any time period i rather watch a movie from 90's but not this jokes are terrible nothing really gives this movie anything at all",
      "review_date": "2015-08-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The logos > Everything else. I can't believe that such emotional logos had to come in a terrible adaption that's a disgrace to Dr. Seuss's good name. The next time I see this movie, I'd only be in it for the logos and then leave afterwards.The logos > Everything else. I can't believe that such emotional logos had to come in a terrible adaption that's a disgrace to Dr. Seuss's good name. The next time I see this movie, I'd only be in it for the logos and then leave afterwards. We all thought this movie could be family-friendly after seeing the logos, but nope... we were all wrong. It's like they threw away the charming from the book and use Mike Myers to destroy the movie to become such a mature movie for kids who loves the Cat in the Hat book.\r How did Mike Myers destroy this movie you say and what mature content am I talking about? Look at the many double entendres this movie is hiding and look at the potty humor this Cat's up to. Maybe Tim Allen could be a better Cat.",
      "review_date": "2016-02-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Mike Myers gives a hysterical, over the top performance of The Cat, however the rest of the movie is just a cluster of bad characters that are dull, boring, and uninteresting.",
      "review_date": "2016-04-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "As a kid most books,I read were a bore.But Schulz's and Seuss'\nI used to adore.\n\nThey were clever, delightful,\nand ever so witty.\nAnd Seuss' cool rhymes,\nmade for a nice ditty.\n\nMy favourite of Suess'\nno doubt about that.\nIt was theAs a kid most books,I read were a bore.But Schulz's and Seuss'I used to adore.They were clever, delightful,and ever so witty.And Seuss' cool rhymes,made for a nice ditty.My favourite of Suess'no doubt about that.It was the timeless tale,of the Cat in the Hat.Then the movie came out,when I was just eight.I was so excited,I just couldn't wait.My parents let me see it,I was ever so glad.Little did I know,it would be so bad.The film ignored Seuss completely,and \"modernised\" the tale.Every new addition,was an utter fail.They pandered to kids,I noticed even back then.And the jokes were outdated,even in that Gen.I walked out disappointed,a frown on my face,I thought compared to the book,the movie was a disgrace.Do not rent or borrow,and definitely don't buy.I hope this review,has informed you why.",
      "review_date": "2017-01-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I'm not here to sing the praises of The Cat In The Hat. I'm not even going to defend it, but call me crazy, I laughed during this movie. I really laughed, at more than a few points in the film.",
      "review_date": "2020-03-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The movie has a terrible story and bad acting. The movie has some good jokes, but most are weird. The last bad part is the characters look bad, really bad. It was not good at all.",
      "review_date": "2017-05-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "You know why this is bad. I didn't have to write a review, but I am. look, it could've been a good movie if..................................it wasn't so horrible.",
      "review_date": "2017-03-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It became popular to hate on this movie years ago and it's really unjustified. There's a few things contributing to the hate. First, it's aimed at older kids and the mum forced to watch with them, not the adults commenting. Second, Dr SeussIt became popular to hate on this movie years ago and it's really unjustified. There's a few things contributing to the hate. First, it's aimed at older kids and the mum forced to watch with them, not the adults commenting. Second, Dr Seuss is a popular author, but only in some places. In places like where I live, hardly anyone grows up reading Dr Seuss. This is nothing like its source material. It's sarcastic and third-wall breaking. Third, all it takes is some person on Youtube saying something is bad for my generation to pretend they have no ability to think for themselves. Movie critics on Youtube hate this movie. But for me, I liked this when it came out. It was funny and campy like watching the old series of Batman. Yes, the humour is the kind you roll your eyes at, but that's what it's meant to be. This isn't aiming for groundbreaking. It's aiming for a casual Saturday afternoon where your kids are watching Looney Tunes. It's not aiming for accuracy, it's aiming for parody. And it succeeds. Looney Tunes did the exact same **** But notice how nobody breathes a word of criticism? As for Mike Myers, I liked him in this role. I think people saying he's miscast is, I think, an example of how some people just don't get this brand of humour. He was fine for the kind of role this was.",
      "review_date": "2021-11-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis film was so sublime that I watched it 17 times in a row. I must also add how absolutely amazed I was by the hat!",
      "review_date": "2021-03-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Doing it for Memeulous!! I have to type 75 characters    ignore this bit:)",
      "review_date": "2021-03-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "George memeulos told me to good movie tho but there is a 75 letter thing I have to fill so it is valid",
      "review_date": "2021-03-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "amazing movie, would hand my dvd down to my kids to give to their kids. also, doing this for george memeulous",
      "review_date": "2021-04-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This adaptation of the Cat in the Hat isn't very appealing, but its as comical as the book and Mike Myers' sense of humor as a cat is admirable. You would even have to admire the movie's imagination of its comical material. Sure, the adultThis adaptation of the Cat in the Hat isn't very appealing, but its as comical as the book and Mike Myers' sense of humor as a cat is admirable. You would even have to admire the movie's imagination of its comical material. Sure, the adult content wasn't for children under age 8, but at least its on the range of the average rated PG-movie with language and it's not on a PG-13 level.",
      "review_date": "2012-01-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Ignore the critics. I had a great time watching this hilarious movie. the jokes were funny, and the actors were a lot of fun. you people are just being ignorant.",
      "review_date": "2010-10-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Most underrated movie of all time. I don't get why all the critics hated this. I thought this movie was awesome. Mike Myers did a great job playing the cat! The whole movie was \"enormously funny\" like it said on the DVD case. It has greatMost underrated movie of all time. I don't get why all the critics hated this. I thought this movie was awesome. Mike Myers did a great job playing the cat! The whole movie was \"enormously funny\" like it said on the DVD case. It has great storyline, cast, characters, and jokes. This movie is fun for the whole family, and I recommend you ignore the critics and watch it.",
      "review_date": "2015-01-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It could have been a good, funny classic, with memorable lines and clean Jokes (Cough, Cough, Charlie and the Chocolate Factory, cough.) but the only line that comes to mind is from Charles Dickens A Christmas Carol. \"Dreadful Apparation, It could have been a good, funny classic, with memorable lines and clean Jokes (Cough, Cough, Charlie and the Chocolate Factory, cough.) but the only line that comes to mind is from Charles Dickens A Christmas Carol. \"Dreadful Apparation, why do you trouble me?!?!?\"",
      "review_date": "2006-03-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I liked some of the jokes but the story of the film was nothing like the book, I don't think that good actors like Mike Myers and Alec Baldwin should be doing stuff like this.",
      "review_date": "2011-08-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis movie was SO HILARIOUS and if you're one of those psys, think again!\rBest Scene: Tail Cut \"Son of a bi***!\" I laughed so hard. I was like wtf did I just hear? That was the funniest thing ever put into a kid's movie!",
      "review_date": "2015-02-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "[Reviewing because of The Lorax] The Cat in the Hat is crap. It ruins every aspect of the beloved book, and is very annoying. The only reason this movie is not a 0 is because of Mike Myers' jokes.",
      "review_date": "2012-03-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie was great...You people need to lighten up....my kids 7, 11, 13 all enjoyed it. If your young children even got any of the adult humor....then you had already exposed them prior. This movie was mild compared to what your kids see This movie was great...You people need to lighten up....my kids 7, 11, 13 all enjoyed it. If your young children even got any of the adult humor....then you had already exposed them prior. This movie was mild compared to what your kids see on the Disney Channel Videos....or hear on the radio. I Welcome a Cat in the Hat 2.",
      "review_date": "2006-05-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I enjoyed this adaption because it is funny and unpredictable. I like it because it is different in a positive way. The jokes make sense to a certain extent.",
      "review_date": "2011-12-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Absolutely excellent  myself and my daughter loved it.  I really can't understand why people think it is 'too mature'  it's actually extremely tame  most pop songs and videos have far worse in them!",
      "review_date": "2013-03-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This may seem like a kids movie but I was surprised with the amount of mature humor in the movie, and the story is stupid, and the characters are terrible, this is a movie you want to avoid.",
      "review_date": "2011-02-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I've been watching the same \"Cat in the Hat\" over a million times and I hated the film so much. I don't know how come this is a PG-rated of mature content for fans of Tom and Jerry and Scooby-Doo. But if you ever want to see The Cat in theI've been watching the same \"Cat in the Hat\" over a million times and I hated the film so much. I don't know how come this is a PG-rated of mature content for fans of Tom and Jerry and Scooby-Doo. But if you ever want to see The Cat in the Hat, I suggest you watch the original TV animated classic or just read to the kids for the classic book that I truly liked. The Grinch was half-good, Horton Hears a Who! was my favorite and hopefully, I wish they could make a movie on Green Eggs and Ham and Hop on Pop! But \"The Cat in the Hat\" is rated A for awful and D as in died of family entertainment.",
      "review_date": "2012-03-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "this movie was full of mature themes and it wa creepy! If they want to make a film wwith a talking cat, use animation!",
      "review_date": "2008-07-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Bo Welch never directed a film before in his life, and will never direct again because this film killed his directing career before it really started. If you're going to make a Dr. Seuss film, Hollywood, at least make the message clear andBo Welch never directed a film before in his life, and will never direct again because this film killed his directing career before it really started. If you're going to make a Dr. Seuss film, Hollywood, at least make the message clear and the visual style resemble the book. That's the LEAST you can do, AND GET A REAL DIRECTOR, NOT A PRODUCTION DESIGNER!!!!\r And second, DON'T EXTEND THE PLOT OF THE MOVIE. STICK TO THE CENTRE OF WHAT MADE THE ORIGINAL CAT IN THE HAT BOOK GREAT: GREAT DRAWINGS, GREAT MESSAGE THAT RULE BREAKING IS OKAY AS LONG AS IT NEVER GOES TOO FAR, MODERATE IT. KEEP THE MESSAGE FOCUSED AND CLEAR IF YOU'RE DEMANDING A LONGER MOVIE. DON'T WRITE PENIS INNUENDO JOKES INTO THE FILM. THAT'S NOT KIDS STUFF.\r If you want to see a GOOD Dr. Seuss film, see Horton Hears A Who.",
      "review_date": "2013-08-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I'm probably going to be cursed for giving this movie a good review, but honestly, I don't care. It's my opinion. My childhood was never full of Dr. Suess-related stuff. Sure I have fond memories of reading \"Green Eggs and Ham\" and \"One FishI'm probably going to be cursed for giving this movie a good review, but honestly, I don't care. It's my opinion. My childhood was never full of Dr. Suess-related stuff. Sure I have fond memories of reading \"Green Eggs and Ham\" and \"One Fish Two Fish Red Fish Blue Fish,\" but I didn't feel like my childhood was getting stabbed in the movie. Sure, some of the material in the movie shouldn't be shown to kids, but I'm an adult, so I'm fine. And honestly, in 2003, I was more offended by Ang Lee's  Hulk movie then this.",
      "review_date": "2012-02-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThis film is extremely underrated and misunderstood, and I am going to explain the truth about it in this review. Though it is quite different to the book which it is based on, it is hard to make a very short book into a long film. Also, it is hard to make a non animated version of a Doctor Seuss film. I think this film has become popular to hate, many people I've seen talking about it haven't even explained why they don't like it, they're probably just following popular culture. Sure Doctor Seuss's wife made it clear after this film was made that she hated it, but she was probably fed up after all the Doctor Seuss film adaptations up to that point, this film was probably just the final straw before she banned live action adaptations of Doctor Seuss's book. The acting in this film is good, so is the set design. The villain in it gets his comeuppance, it is funny when the fish says \"Oh my cod''. This film adds in interesting subplots, it isn't too long, it has a good soundtrack and it is fun to watch because of it's craziness.",
      "review_date": "2015-07-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Woah, woah, take it easy people! It wasn't THAT bad! Yes, there are subtle innuendoes. They'll go right over kid's heads! Ok, the one where the Cat mentions his car which has a name that's an acronym for s**t was a step too far but theWoah, woah, take it easy people! It wasn't THAT bad! Yes, there are subtle innuendoes. They'll go right over kid's heads! Ok, the one where the Cat mentions his car which has a name that's an acronym for s**t was a step too far but the others? Nothing that will prompt questions from your kids. Mike Myers was actually pretty good as the cat in my opinion. He was the best thing about the movie! I had a lot of laughs and my biggest complaints were the fact that there were a few SUPER gross scenes, and I found the mother's boss annoying. It's a decent film, unless you think that putting innuendoes in a Dr. Seuss movie is sacrilegious. It really doesn't deserve its 19 metascore.",
      "review_date": "2015-10-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I definitely loved this film! I knew I was watching a Dr. Seuss classic as soon as the film started. The jokes were hilarious and super witty- my kind of jokes :)",
      "review_date": "2016-11-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "huh???????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????",
      "review_date": "2013-10-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "WHAT a bad representation to the best Dr. Seuss book of 1957, I can't believe I had this movie on VHS, I was confused as a kid watching this in 2006, what a disaster to the fans!",
      "review_date": "2015-04-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is by far the worst film of all time the gags are awful and way to inappropriate for children but if  they were well executed i wouldn't have minded the inappropriate gags also everyone in this film is awful the performances ranged fromThis is by far the worst film of all time the gags are awful and way to inappropriate for children but if  they were well executed i wouldn't have minded the inappropriate gags also everyone in this film is awful the performances ranged from bored to complete **** also this movie has some of the worst written dialogue i have ever heard\rVerdict:cancer is better",
      "review_date": "2015-06-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Absolutely AbysmalThe Cat In The Hat is complete and utter garbage from start to finish.",
      "review_date": "2019-06-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is by far the worst Dr. Seuss movie. Sure that's not saying much, but it's horrible. Do NOT watch this movie. It's bad.",
      "review_date": "2019-09-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The film is an utterly dull and disappointing adaptation of the book. The themes are too mature for kids, the dialogue was crap, and it really was an abomination.",
      "review_date": "2014-03-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don't understand all the negative reviews. This movie was pretty trippy, in a good way. I would have spent money to see it again. Possibly even twice, nay, three times.",
      "review_date": "2012-02-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is one of the worst films I have ever seen.  I would go as far as saying that I actually hate it.  It is contemptuous of it's audience, inappropriate and crude.  Any parent who allows their child to watch this should be locked up.",
      "review_date": "2011-05-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The set direction in this feature looks lively and pretty accurate to bring the world of  Dr.Seuss' The Cat in the Hat come to life, while everything else falls completely flat with excruciating execution and irritating  acting. The Cat inThe set direction in this feature looks lively and pretty accurate to bring the world of  Dr.Seuss' The Cat in the Hat come to life, while everything else falls completely flat with excruciating execution and irritating  acting. The Cat in the Hat was one of the worst kids films I have even seen with crude humour that only had a couple of joke that were funny, but not in a film based on a Dr.Seuss creation. Sometimes I wonder who had chosen Mike Myers to play as the Cat. He didn't portray as Dr.Seuss' iconic character through my eyes and was more like himself in a cat costume. The Cat in the Hat becoming a full feature film totally blows, you might as  well read the original book that everyone knows.",
      "review_date": "2011-11-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This next exploitation of Dr. Seuss' work may be even worse than the first- and that's saying something.",
      "review_date": "2012-11-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "THE worst Dr. Seuss adaption I have ever seen in my life.  Thanks Universal for ruining a classic beloved character. The story line was beyond awful and made no sense. Mike Myers was creepy and the  kids were just obnoxious. Probably theTHE worst Dr. Seuss adaption I have ever seen in my life.  Thanks Universal for ruining a classic beloved character. The story line was beyond awful and made no sense. Mike Myers was creepy and the  kids were just obnoxious. Probably the worst thing I've ever seen and am forever disgraced for doing so.",
      "review_date": "2013-12-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "There is nothing enjoyable or redeemable coming from this movie. The acting was lifeless and creepy, Mike Myers was just awful and creepy. I wish there was a way I could count how many times Dr. Seuss rolled over in his grave",
      "review_date": "2018-01-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the worst movies of our generation, it takes every charming moment out of the original book and throws it out the window, ultimate torture for your kids, the perfect treatment for misbehaving children.",
      "review_date": "2015-01-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "People gave this movie 0. You know what I say to that? Get a life you criticizing critic bozos! It was funny for kids and adults and until I read these reviews I thought people had brains. If you can't watch this movie without groaning youPeople gave this movie 0. You know what I say to that? Get a life you criticizing critic bozos! It was funny for kids and adults and until I read these reviews I thought people had brains. If you can't watch this movie without groaning you are a perfectly normal person with great taste. The cat was realistically made and was funny as well. Made the Grinch look more terrible than it really is. Great movie, and if you don't think so, go soak your head.",
      "review_date": "2011-10-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I can't put it any other way, this movie just plain sucks. I mean who openly advertises during a movie? That's not funny, I mean other people who advertise products in a movie have those ads hidden, like a Coke sign on a grocery shop. AndI can't put it any other way, this movie just plain sucks. I mean who openly advertises during a movie? That's not funny, I mean other people who advertise products in a movie have those ads hidden, like a Coke sign on a grocery shop. And Mike Meyers, really? I expected more from you. Racist, sexist, and cliche jokes throughout a movie does not make this funny, it just makes like Family Guy. For a second thought, why was Alec Baldwin the evil guy in this movie? He's usually this warmhearted person who usually helps out the good guy. The only way he ties into this movie as the evil neighbor is the fact that he's in love with the children's mom. The only reason this score isn't a flat out 0 is because there was one funny joke. One! 1/10",
      "review_date": "2013-04-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is an abomination, pure and simple. From the dirty references (The scene with the Cat, and the mom's picture anyone?), to the trashing of the original plot, it's obvious this project was doomed from the start.",
      "review_date": "2014-09-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The worst thing Mike Myers has ever done. This **** is **** messed up I want to **** **** up every **** who was involved in this **** What **** **** would destroy such a **** good Seuss tale? What's the next? The ****in **** Lorax?!",
      "review_date": "2011-08-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It was one of the most horrible, disgusting, incoherent, and juvinille films ever made. The humor was way too mature for little kids, all the actors were acting as if they wanted to be bad. Mike should be ashamed of himself for doing this It was one of the most horrible, disgusting, incoherent, and juvinille films ever made. The humor was way too mature for little kids, all the actors were acting as if they wanted to be bad. Mike should be ashamed of himself for doing this and I bet he's unbeleivably embarressed just to remember saying \"yes\" to playing the cat. You cannot, I repeat cannot, make a movie about a book with at least 4 sentances on each page, and have it a comedy. Shame on you Mike, Alec, and Dakota for being in a movie this bad with talent as good as yours.",
      "review_date": "2005-08-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Thank you, Mike Myers, for destroying a little piece of my childhood.",
      "review_date": "2008-09-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Dr. Suess must be turning in his grave!",
      "review_date": "2009-02-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Not enjoyable at all,it's a mockery to the average film these days,but since it was developed in the 2003...il spare the 1...(horrible movie in total)",
      "review_date": "2009-02-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is the most awful movie I've ever seen. The only people i can see enjoying this movie is 0.01% of adults and 0% of kids. How can it be for children? Its perverted. How can it be for adults? its rediculous. Anyone who gives it a This is the most awful movie I've ever seen. The only people i can see enjoying this movie is 0.01% of adults and 0% of kids. How can it be for children? Its perverted. How can it be for adults? its rediculous. Anyone who gives it a good score is deaf and blind. One guy said it reminded him of his childhood. Dude, if dirty hoes and cats talking about sex remind you of your childhood, you are one sad individual. And the worst part is, some of these \"adult jokes\" don't even go over kids' heads. I'm sure most kids have heard of the B**** word, and when the cat screamed it out right as the bleeper went on, thats totally obvious. Sick and wrong. DON\"T LET YOUR KIDS SEE THIS MOVIE!",
      "review_date": "2007-05-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Alec Baldwin picking at his belly button lint, Enough Said!",
      "review_date": "2009-02-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This film is utterly disgusting. I was actually thinking that, hey, the movie critics could be wrong about this movie, they were on Equilibrium. Then I heard actual people talking about how crappy this movie was. I was pretty convinced after This film is utterly disgusting. I was actually thinking that, hey, the movie critics could be wrong about this movie, they were on Equilibrium. Then I heard actual people talking about how crappy this movie was. I was pretty convinced after a week since it was out that it sucked, horribly. So what possessed me to see this film? Okay, I have this theatre in my town. 1.99 for one ticket. I was extremely bored one day so I decided to go to that theatre to see a movie. I had already seen everything they were playing except for the Cat in the Hat. I decide, hell why not, it might be good, besides, its only 2 dollars. I feel extremely ripped off, that's how bad this movie is. Okay, if you don't know the cat in the hat's plot I suggest you go get a life or maybe end it. The cat in the hat is a story everyone knows. The thing is is that they screwed up such a basic story that it leads me to wonder if they actually read the book. The jokes in this movie were just horrible. Okay, I did laugh a few times, kind of. The thing is is that the jokes were crude and unfitting of this movie. If you want a family film everyone can enjoy, try to put humor in their that is non offensve and funny at the same time, I can think of a few ways you could do that. Mike Meyers plays a horrible cat. He kept on sonding like Doctor Evil or Austin Powers. Maybne that is just how I interpret him. The classic Dr. Suess rhyming was kept at such a minimum that it lead me to beleive who ever wrote the script is in need of an imagination. This movie should have aimed for young children, instead, they decided they should aim it at every age group and then fail horribly. The Cat in the Hat is one of the worst book to movie adaption ever, and also one of the worst movioes of the year (beat only by Gigli, From Justin to Kelly, and Malibus Most Wanted).",
      "review_date": "2003-12-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The most controvsial film ever made. I watched a lot of this on telivison, hopefully to find something to laugh at...and the whole time I keep pressing the Info button on the remote to see if it really is PG. These jokes don't even fly The most controvsial film ever made. I watched a lot of this on telivison, hopefully to find something to laugh at...and the whole time I keep pressing the Info button on the remote to see if it really is PG. These jokes don't even fly over the kids' heads. They're in your face kind of humor. And the story! Two kids are trying to stop their mom from marrying the world's biggest jerk, who wants to punish the boy and send him off to military school and some crap like that... It's terrfying.",
      "review_date": "2006-04-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Spicegirls is no longer the worst movie ever made.",
      "review_date": "2006-04-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The combination of an arguably classic children's book with risque adult humor, anarchistic Shrek-esque children's humor, gratuitous cheesy content, and screaming in your ear for the next 45 minutes results in a uniquely abominable The combination of an arguably classic children's book with risque adult humor, anarchistic Shrek-esque children's humor, gratuitous cheesy content, and screaming in your ear for the next 45 minutes results in a uniquely abominable extravaganza that just doesn't seem to work (and really shouldn't in the first place.) Please spare yourself and your children. Don't see this movie.",
      "review_date": "2006-06-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If Dr. Seuss was still alive to see this, he would shoot everyone in Universal Studios and then himself. This is truly the biggest loogie spat in the proud punch bowl of Mike Myers and the cinematic world. The worst part is the humor. I can If Dr. Seuss was still alive to see this, he would shoot everyone in Universal Studios and then himself. This is truly the biggest loogie spat in the proud punch bowl of Mike Myers and the cinematic world. The worst part is the humor. I can see why a lot of people would think it's immature, but that's not why I hate it, it's more because they're only \"trying\" to be funny.",
      "review_date": "2007-04-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I would've given this a zero, except for Dakota Fanning. This movie is an unforgivable insult to Dr. Seuss and if he was here to see this film he would give up writing in order to hunt down and murder the writers, director and Mike I would've given this a zero, except for Dakota Fanning. This movie is an unforgivable insult to Dr. Seuss and if he was here to see this film he would give up writing in order to hunt down and murder the writers, director and Mike Myers. Preferably by slow, painful, bloody methods, such as draw-and-quartering, disembowlment, and/or stabbing in non-vital but painful areas that would eventually lead to death by bloodloss.",
      "review_date": "2009-02-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "cat that's not your tail what hollllycat that's not your tail what holllly s.........................................................................................................................................................................................................................................................",
      "review_date": "2012-03-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie was ****  I usually like films that are lower down on the meta critic, but this, this is something else, none of my kids liked it, none of my friends like it, I bet even the people who made it didn't like it.",
      "review_date": "2012-03-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "con bromas sin sentido,  una calidad de imagen exquisita y una actuación bizarra e hilarante por parte de mike mayers  ,the cat in the hat es una divertida película que lamentablemente solo le llegara a cierto tipo de personas",
      "review_date": "2013-02-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "0.5/10. That .5 comes from the kids not being painfully awful, unlike the rest of the film",
      "review_date": "2020-05-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I recognise a masterpiece when I see one and the cat in the hat is one of the most perfect comedies I've ever seen and you should absolutely watch it.The story was fantastic, I hated the original dr Seuss book because it had good morals andI recognise a masterpiece when I see one and the cat in the hat is one of the most perfect comedies I've ever seen and you should absolutely watch it.The story was fantastic, I hated the original dr Seuss book because it had good morals and it was well written, thankfully this movie has none of these elements. They found a way to make the story boring, pandering and annoying which is so refreshing, the visual style is amazing creating a very ugly and fake looking world which blew me away.The characters were great as well, they were so unfunny and annoying that I couldn't wait for the movie to be over, the cat character was poorly written and poorly acted, you could just tell he couldn't wait for his paycheck which made the film so charming and likable.This is one of the best movies of all time, it completely misunderstood the meaning of the original material, the story and characters were so incredibly annoying that they made this movie a masterpiece, to all critics who didn't like this movie you just need to have a better brain and laugh at these smart jokes because the movie really made me LOL.",
      "review_date": "2017-08-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The worst Dr.Seuss movie of all time is bad, but it does give me a chuckle sometimes.",
      "review_date": "2019-05-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Horrible! horrible! horrible! Creepy , cringe, the cat is horrible ! Shows butt, talks about death and murder he’s a creep and he talks like an old mobster teaching kids to play with old creepy men? He even says “dirty Hoe! Just kidding babe,Horrible! horrible! horrible! Creepy , cringe, the cat is horrible ! Shows butt, talks about death and murder he’s a creep and he talks like an old mobster teaching kids to play with old creepy men? He even says “dirty Hoe! Just kidding babe, ya know I love you.” He also says “SON IF A “ then goes BEEEEEEEEEEEEEEEPP .... how is this a kids movie???",
      "review_date": "2020-03-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Just cringey and awful to watch. Best part was the beginning and swiftly went downhill from there. What was Mike Myers thinking?",
      "review_date": "2020-11-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Mike Myers was forced to make this film and it shows rough dialogue and very rushed.",
      "review_date": "2020-07-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is the worst Dr. Seuss film ever and I hate how Mike Myers played the title character and this is my least favorite film, but I never seen it. I wish they wanted to destroy all copies and remove it from TV schedule on all channels allThis is the worst Dr. Seuss film ever and I hate how Mike Myers played the title character and this is my least favorite film, but I never seen it. I wish they wanted to destroy all copies and remove it from TV schedule on all channels all around the world and remove it forever on all of the steaming services of the Cat in the Hat 2003 film because they're devolving an animated remake by Warner Bros.",
      "review_date": "2021-02-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "movie bad movie bad movie bad movie bad movie bad movie bad movie bad movie bad movie bad movie bad movie bad movie bad movie bad movie bad movie bad movie bad movie bad movie bad",
      "review_date": "2022-01-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The one thing is would call this movie is \"Trashhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh\"...........................................",
      "review_date": "2022-01-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Cat in the Hat is an okay movie. Its got that unique Dr. Seuss aesthetic to it which is interesting, but in the end is filled with some silly writing and acting choices. Overall its just meh.",
      "review_date": "2016-12-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's another overwrought clunker like \"How the Grinch Stole Christmas,\" all effects and stunts and CGI and prosthetics, with no room for lightness and joy.",
      "review_date": "2016-12-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's another overwrought clunker like \"How the Grinch Stole Christmas,\" all effects and stunts and CGI and prosthetics, with no room for lightness and joy.",
      "review_date": "2016-12-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's another overwrought clunker like \"How the Grinch Stole Christmas,\" all effects and stunts and CGI and prosthetics, with no room for lightness and joy.",
      "review_date": "2016-12-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's another overwrought clunker like \"How the Grinch Stole Christmas,\" all effects and stunts and CGI and prosthetics, with no room for lightness and joy.",
      "review_date": "2016-12-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's another overwrought clunker like \"How the Grinch Stole Christmas,\" all effects and stunts and CGI and prosthetics, with no room for lightness and joy.",
      "review_date": "2016-12-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's another overwrought clunker like \"How the Grinch Stole Christmas,\" all effects and stunts and CGI and prosthetics, with no room for lightness and joy.",
      "review_date": "2017-01-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's another overwrought clunker like \"How the Grinch Stole Christmas,\" all effects and stunts and CGI and prosthetics, with no room for lightness and joy.",
      "review_date": "2017-03-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It's another overwrought clunker like \"How the Grinch Stole Christmas,\" all effects and stunts and CGI and prosthetics, with no room for lightness and joy.",
      "review_date": "2017-03-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Listen; this movie is a mixed bag for me. It's both stupid yet amazing. It's annoying yet hilarious. While Mike Myers, though he did help make the jokes funny, wasn't the perfect casting, honestly, and the Things are horrendous, but I likeListen; this movie is a mixed bag for me. It's both stupid yet amazing. It's annoying yet hilarious. While Mike Myers, though he did help make the jokes funny, wasn't the perfect casting, honestly, and the Things are horrendous, but I like the actors for Sally and \"Conrad\" (Nick). Despite my mixed feelings about this film, I don't hate it, but I don't necessarily \"like\" it, either, though it's going more towards me liking it then hating it.",
      "review_date": "2019-05-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This has to be my favorite Dr. Seuss movie ever. So funny and the way everything looks, I love it.",
      "review_date": "2022-12-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "a crappy abomination ruiner of the original cat in the hat by dr suess! this movie is the worst movie ever from 2003 next to Caillou´s holiday movie!",
      "review_date": "2021-03-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I was once a homeless man wandering the streets of England but after watching this movie my life changed. This movie taught me the importance of learning and helped me overcome my anxiety in the work place. The cats whiskers made me so jolly.I was once a homeless man wandering the streets of England but after watching this movie my life changed. This movie taught me the importance of learning and helped me overcome my anxiety in the work place. The cats whiskers made me so jolly. I even occasionally dress up as my hero, \"the cat in the hat\" for important business meetings giving me the confidence I need to shine like the star I have always been. I hope one day I can become as amazing as my hero. Today I am not only a fully grown man, but a national treasure to my community and nation. My journey all started with this movie. Watch this movie and be prepared for your life to change for the better.Please rate this movie 10 stars if you had similar experiences or are excited of the invaluable prospects this movie has to offer.",
      "review_date": "2021-03-17",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "one of the BEST movies, its honestly ones of the funniest and best movies ever.",
      "review_date": "2021-03-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If I was Dr. Seuss and I was told this movie was in development I would have killed myself before the cancer got me",
      "review_date": "2021-04-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "F*ck this movie seriously f*ck this movie why does the abomination of a movie even exist",
      "review_date": "2021-08-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "----------------------------------6.0/10-----------------------------------",
      "review_date": "2021-12-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Director Bo Welch only excels at directing the set design, but crumples at directing his actors and revising the adapted script.",
      "review_date": "2022-12-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Dr. Seuss was on some serious stuff...like that good good. You'll need to be one some even harder stuff to get through this movie. The low of Mike Myers career. Only good thing about this movie is the beautiful late great Kelly Preston.",
      "review_date": "2021-12-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This was such a funny movie and is way overhated! It would be impossible to make a movie of that book without adding a lot to it, and they did pretty well with that. Mike Myers was perfect as the cat and he was a big part of what made theThis was such a funny movie and is way overhated! It would be impossible to make a movie of that book without adding a lot to it, and they did pretty well with that. Mike Myers was perfect as the cat and he was a big part of what made the film so entertaining. I liked the new characters they added such as Alec Baldwin as the antagonist and Mrs Kwan. The kids and the mom of course have more personality than they did in the book. The designs of everything are cool and look very Dr Seuss like. I watched this movie as a kid and loved it, and I watched it again when I was older and it’s even better since I get more of the adult jokes. The Austin Powers type of humour is what made this one of if not the funniest kids movie of all time! The book was a classic and very charming, and the movie is super fun to watch. This movie does not deserve the amount of hate it gets and if you think of it more as a parody than a film adaption, there is no reason to not like it!",
      "review_date": "2022-03-02",
      "source": "metacritic"
    }
  ],
  "num_reviews": 131
}