{
  "title": "Cool Hand Luke",
  "rating": 8.5,
  "release_date": "1967-11-01",
  "genre": [
    "Drama",
    "Crime"
  ],
  "summary": "When Luke Jackson (Paul Newman) is arrested for drunkenly vandalizing parking meters, he is sentenced to serve time on a prison chain gang. Although the warden, guards and prisoners all try to break Luke's spirit upon his arrival, it soon becomes clear that Luke is not about to play by anyone else's rules. He eventually earns the respect ofWhen Luke Jackson (Paul Newman) is arrested for drunkenly vandalizing parking meters, he is sentenced to serve time on a prison chain gang. Although the warden, guards and prisoners all try to break Luke's spirit upon his arrival, it soon becomes clear that Luke is not about to play by anyone else's rules. He eventually earns the respect of his fellow inmates by refusing to back down in a fight, and he earns their friendship by figuring out a way for them to get their hard labor done in half the time. Luke eventually becomes a symbol of hope and resilience for his fellow prisoners, but the more he becomes revered by the inmates, the more he becomes a symbol of rebelliousness that must be stamped out by the Captain (Strother Martin). [Warner Bros.]… Expand",
  "critic_reviews": [
    "Luke is the first Newman character to understand himself well enough to tell us to shove off. He's through risking his neck to make us happy. With this film, Newman completes a cycle of five films over six years, and together they have something to say about the current status of heroism. But Cool Hand Luke does draw together threads from the earlier movies, especially Hombre, and it is a tough, honest film with backbone.",
    "Paul Newman gives one of his best performances in this prison film, where he inspires life in to his fellow inmates. Has something important to say with several memorable moments and a superb supporting cast.",
    "Mr. Newman is excellent, at the top of his sometime erratic form, in the role of this warped and alienated loner whose destiny it is to lose. George Kennedy is powerfully obsessive as the top-dog who handles things his way as effectively and finally as destructively as does the warden or the guards.",
    "Too cool for words, then switches past midstream into a work of poignancy and power.",
    "One of the sharpest prison dramas ever, although it's graced with some very humorous portions as well.",
    "The incessant, rhythmic swishing of the chain gang’s scythes burrows into your brain – and then adds Newman’s supernova performance. It’s a gulag melodrama, if such a thing is possible.",
    "Newman gives an excellent performance, assisted by a terrific supporting cast, including George Kennedy, outstanding as the unofficial leader of the cons who yields first place to Newman.",
    "An amazing accomplishment by Newman as the best fight man has left in him. There’s also an Oscar winning performance by champion Foghorn Leghorn sound alike George Kennedy.",
    "Cool Hand Luke is a metaphor for the social climate in which it germinated. Luke represents that segment of the population who will not submit, no matter how viciously they are beaten. They repeatedly rise up, convinced not only of the rightness of their actions, but that, in the end, they can make a difference. In the midst of the burgeoning '60s cultural revolution, it's impossible to ignore.",
    "A caustically witty look at the American South and its still-surviving chain gangs, with Newman in fine sardonic form as the boss-baiter who refuses to submit and becomes a hero to his fellow-prisoners. Underlying the hard-bitten surface is a slightly uncomfortable allegory which identifies Newman as a Christ figure. But this scarcely detracts from the brilliantly idiosyncratic script (by Donn Pearce from his own novel) or from Conrad Hall's glittering camerawork (which survives Rosenberg's penchant for the zoom lens and shots reflected in sun-glasses).",
    "Paul Newman tells 'em where to get off in this slick, popular antiestablishment drama set in a prison camp. Stuart Rosenberg's direction is a horror, but the cast teems with so many familiar faces that this film can't help but entertain.",
    "Rosenberg's treatment of evil, personified by the brutal prison guards, descends too often from portrayal to caricature. Still, there is enough left in the old theme to make Luke a prisoner of grace, and a picture of chilling dramatic power.",
    "Newman remains watchable and glamorous throughout, bloody, muddy or coated in torso-flattering sweat, but the film’s efforts to sentimentally humanize him by psychological revelation are clumsy."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "This film got me from the first frame to the last. It's not even because of the story (which I love, of course) - it's just so very well made. And so modern. The kind of angles and perspectives the camera uses, the way it zooms in and out orThis film got me from the first frame to the last. It's not even because of the story (which I love, of course) - it's just so very well made. And so modern. The kind of angles and perspectives the camera uses, the way it zooms in and out or even allows itself (literally) to get dirty - the way this whole picture was shot is just something I haven't seen in an American film released prior to this one.",
      "review_date": "2017-11-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nCool Hand Luke is the first Paul Newman movie that I have seen, and is generally older than the films I watch, but I greatly enjoyed it. It's a prison movie where a newcomer rebel changes up the way things go around the prison, earning the respect and admiration of the biggest/baddest guy in the prison, as well as everyone else. There are some comedic moments (the eggs), some heartwarming moments (between Luke & Dragline), and moments of inspiration of Luke's determination. This movie reminds me a lot of Shawshank Redemption in those ways, though with very different outcomes. It's an excellent movie that grew on me as it continued.",
      "review_date": "2021-02-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I love old movies and saw the great reviews of this one and I love Newman so i gave it a shot. Acting was perfect, well done...cinematography was great...but the story draaaaaaged..I kept thinking ok something exciting willI love old movies and saw the great reviews of this one and I love Newman so i gave it a shot. Acting was perfect, well done...cinematography was great...but the story draaaaaaged..I kept thinking ok something exciting will happen......nada......waited some more and found that movie ended. Lacked excitement for me that’s all. I love Newman and will watch his other older movies.",
      "review_date": "2020-06-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "All-time favorite movie!  Newman is a national treasure, full of humor in this inspirational epic!",
      "review_date": "2019-10-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Cool Hand Luke is a 1967 drama film, I guess crime is another genre you could stick it under... I think they are stuck inside a prison but not sure but anyway, Cool Hand Luke stars Paul Newman and George Kennedy... Cool Hand Luke is a film ICool Hand Luke is a 1967 drama film, I guess crime is another genre you could stick it under... I think they are stuck inside a prison but not sure but anyway, Cool Hand Luke stars Paul Newman and George Kennedy... Cool Hand Luke is a film I grew up with as a child so I'm very familiar with the film and I surely remember it well. The acting is excellent especially from Paul Newman and all the actors are great in the film and it's full of excellent characters even the people who are dislikeable. The carwash scene is genius but the ending is a bit sad but didn't ruin the film. Only negative I have about Cool Hand Luke is we didn't know if Luke (Paul Newman) lived or died at the end of the movie after he got shot because it didn't show us so that was a shocker but besides that this film is perfect. A classic in all departments.",
      "review_date": "2020-09-05",
      "source": "metacritic"
    }
  ],
  "num_reviews": 18
}