{
  "title": "The Good, the Bad and the Ugly",
  "rating": 9.1,
  "release_date": "1967-12-29",
  "genre": [
    "Adventure",
    "Western"
  ],
  "summary": "For three men the Civil War wasn't hell... it was practice! Clint Eastwood returns as \"The Man with No Name,\" this time teaming with two gunslingers (Lee Van Cleef and Eli Wallach) to pursue a cache of $200,000 and letting no one, not even warring factions in a civil war, stand in their way. [MGM]",
  "critic_reviews": [
    "Though ordained from the beginning, the three-way showdown that climaxes the film is tense and thoroughly astonishing.",
    "An improbable masterpiece -- a bizarre mixture of grandly operatic visuals, grim brutality and sordid violence that keeps wrenching you from one extreme to the other.",
    "There are two kinds of people, my friend. Those who love Sergio Leone's The Good, the Bad, and the Ugly, and those who resist the machismo and gallows humor of what is arguably the definitive spaghetti western.",
    "Gorgeously stoic art film.",
    "A massive, many-faceted film that continues to hold up, viewing after viewing.",
    "All told, and in giant widescreen, it's only blood-red adolescent fun, but it blooms like Douglas Sirk with a Gatling gun compared to the teenage demographic's current fare. Matrix, schmatrix: This is the season's supreme party movie.",
    "A curious amalgam of the visually striking, the dramatically feeble and the offensively sadistic."
  ],
  "reviews": [
    {
      "review_title": null,
      "content": "Honestly if you were to ask me what's my personal favorite movie, I'd have to say \"The Good, The Bad and the Ugly\". While the film does have a few lighthearted or comedic moments it's by enlarge extremely serious and deals with war in anHonestly if you were to ask me what's my personal favorite movie, I'd have to say \"The Good, The Bad and the Ugly\". While the film does have a few lighthearted or comedic moments it's by enlarge extremely serious and deals with war in an admirably restrained manner. Sergio captures the epicness and chaos of the old west but it doesn't choke itself to death on atmosphere. While I thought Leones own \"Once upon a time in America\" was his best work this comes in an extremely close second. It really does nothing wrong. One of the few films I could honestly call perfection",
      "review_date": "2010-08-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Serio Leone's directing + Ennio Morricone's Music + Clint Eastwood, Lee Van Cleef and Eli Wallach in a climatic 3-way showdown = Win.",
      "review_date": "2008-06-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Superb and excellent. Cool humor and great action scenes. Could watch it any time and not get bored. Classic line by Eli Wallach-\"if you wanna shoot, shoot don't talk.\"",
      "review_date": "2007-01-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Boasting one of the great scores of all time and the very soul of all Westerns, this movie is a true masterpiece. It's uncompromising, and quite happy to point out to you that it's not sorry for anything it does. All three of its Boasting one of the great scores of all time and the very soul of all Westerns, this movie is a true masterpiece. It's uncompromising, and quite happy to point out to you that it's not sorry for anything it does. All three of its main characters are engaging, just twisted enough to make you wonder just which one is \"The Good,\" and keep you going.",
      "review_date": "2007-03-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the best films of all time. Quentin Tarantino calls it the best directed movie of all time and i agree. Clint is a fantastic lead character, Leone is a great director, and the music by Morricone is superb.",
      "review_date": "2008-07-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"Compelling story, memorable performances, breathtaking landscapes, and a haunting score\". The good, the bad and the ugly is not only the definitive western, but also and unquestionably one of the greatest movies of all times! Maybe the most \"Compelling story, memorable performances, breathtaking landscapes, and a haunting score\". The good, the bad and the ugly is not only the definitive western, but also and unquestionably one of the greatest movies of all times! Maybe the most simple and perfect analogy of real life ever created!",
      "review_date": "2008-08-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A true cinematic marvel - undoubtedly the best representative of it's genre, surpassing even that other heavyweight \"The Searchers\". Leone (with Morricone's phenomenal score) weaves a stunningy beautiful yet desperately sad A true cinematic marvel - undoubtedly the best representative of it's genre, surpassing even that other heavyweight \"The Searchers\". Leone (with Morricone's phenomenal score) weaves a stunningy beautiful yet desperately sad tapestry of a west torn by civil war. The actions of our leading trio are ant-like in this scale, but this contrast drew me in, and the ruthless and brutality portrayted somehow gains reason. Exquisite piece of film - just watch with fresh eyes, and ignore pop culture's never-ending parody and reference to this Italian-made brilliance.",
      "review_date": "2009-03-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "the best film i have ever seen, an absolute classic.",
      "review_date": "2007-12-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Spectacular, dazzling, cool, and superb.",
      "review_date": "2007-08-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Without a doubt the best western movie ever probably of all-time",
      "review_date": "2007-08-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The best movie I've EVER seen.",
      "review_date": "2008-06-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A masterpiece. A movie that epitomizes what cinematic art is all about. Brilliant narrative, acting, directing, cinematography and a legendary score. I can easily say this is one of the best films of all times.",
      "review_date": "2009-05-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A masterpiece, not only for  lovers of the good old-fashioned westerns, but for anyone who loves cinema in its broadest sense. Fabulous interpretation, visually brutal and is one of those movies that grabs us to the screen in despair forA masterpiece, not only for  lovers of the good old-fashioned westerns, but for anyone who loves cinema in its broadest sense. Fabulous interpretation, visually brutal and is one of those movies that grabs us to the screen in despair for having no idea of how the movie will end. Eastwood at his best.",
      "review_date": "2012-08-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the best films ever made. No, really, if you haven't checked this out yet, do yourself a favor and give it a watch. The soundtrack is also worth checking out.",
      "review_date": "2011-03-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A Masterpiece, A Classic, A Movie I will never get bored of watching. I became an instant fan of Clint Eastwood. I will die to meet him. When I watched this movie, Its been days since I saw a True Classic.Hats off to all the Crew and Cast ofA Masterpiece, A Classic, A Movie I will never get bored of watching. I became an instant fan of Clint Eastwood. I will die to meet him. When I watched this movie, Its been days since I saw a True Classic.Hats off to all the Crew and Cast of \"The Good, The Bad, And The Ugly\" !!!",
      "review_date": "2011-08-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A lot of the open space that would otherwise seem unnecessary, is actually used to its fullest potential in ‘The Good, the Bad and the Ugly.’ The intensity of scenes, sometimes involving only one man in the vast sprawling desert, easilyA lot of the open space that would otherwise seem unnecessary, is actually used to its fullest potential in ‘The Good, the Bad and the Ugly.’ The intensity of scenes, sometimes involving only one man in the vast sprawling desert, easily capture the essence of the film, surprise, intrigue and some fine camerawork which is held true throughout the course of the film, director Sergio Leone intentionally misleads the viewer with various angles in an attempt to mask the outcome of an event, he does this so well. The pressing matter, however, is why this movie is so good? Or masterful for that matter. It will always be known as a \"Spaghetti Western” even if its content is vastly superior to many of the westerns that have come and gone, it has garnered its critics for presumably being part of the 'Dollar’ trilogy’, yet it survives to be not only the best Western film, but one of the finest films of a cinematic generation, the style and beauty on screen utilises each and every detail, whether its the sun soaked sand or the populated battlefields of a civil war, the film has a massive scope of perfection and subtlety. Clint Eastwood again places the cigar in his mouth as the 'Man With No Name’, another problem with the marketing of a great film, he’s clearly called “Blondie” in the film. The performances of the three main leads are exquisite, alongside Eastwood, we have Eli Wallach as a  of a man called Tuco, an shaky and untrustworthy acquaintance of Blondie, he never stops and also never misses an opportunity to get one over on his partner. But we also have the cool, focused and dangerous stance of Lee Van Cleef as Angel Eyes, his opening scene as he he sits down for food with his target is expertly filmed to outline the cruel and materialistic side of this man, but also the dangers of crossing guns with him, his moments of in the film are made up of fear and his piercing stare, giving relevance to his name. Moments like these are what the film is about, it doesn’t hold heavy dialogue but instead lets the scenery speak for itself, one of the final scenes of the film has the three characters face off in a three-man showdown, this is a long and suspenseful scene, one which gradually draws the viewer in from long shot to extreme close-ups, we witness the distance these men are from each other, right up to the sweat and stubble on their chin, perfectly capturing a scene that doesn’t necessarily differ from many duels, but the delivery of suspense along with a riveting score gives it vital importance. The character of Blondie is a benchmark of the Western age of film, this guy doesn’t even have to talk much to be appreciated, a creation of power and order need not speak, he just needs to act out his myth or legend, something Leone and Eastwood bring to the Man With No Name in flawless style. He is after gold that the other two men are also after, the catch being that Tuco knows the graveyard its buried in, but Blondie knows the exact name of the grave, while Angel Eyes was led onto the track through his own menace and curiosity. The graveyard part of the film is only one of its many highlights, another being a civil war part where the two partners decide to take down the bridge in an attempt to further their journey. The landscape, creation of memorable moments and a story which intertwines with pivotal segments of history, amount to the flawless art that is this film, it has wit and character dynamics that separate the film from others, each leaving a rather different taste in your mouth, at 180 minutes long, each and every scene needs to be soaked up with the brilliance of its content, and the talent of those involved.",
      "review_date": "2013-11-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "My favorite movie ever. I'm a huge fan of Western's and have have seen mostly all the John Wayne classics, but nothing beats  Il buono, il brutto, il cattivo  It's the greatest western ever and one of the best films in cinema history.",
      "review_date": "2013-06-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "never has a movie been so good that after i get up watching it, there is no voice in the back of my head picking out small little pickings that i disliked about this film. this is in my opinion, the GREATEST MOVIE OF ALL TIME.",
      "review_date": "2019-04-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I've seen this movie 20 times, and remember watching it with my Dad when I was a kid. It does not get old. This is what a Western should be. I'll take Eastwood over Wayne any day.",
      "review_date": "2010-08-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie has become a classic. The fact that Clint Eastwood is a genious on screen makes this movie one of the all time best in my book. This ends the trilogy so even thought the otther 2 films also have a high standard this movie isThis movie has become a classic. The fact that Clint Eastwood is a genious on screen makes this movie one of the all time best in my book. This ends the trilogy so even thought the otther 2 films also have a high standard this movie is probably the best of the three. Its well worth spending the time to watch it,",
      "review_date": "2012-05-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "They was the good, they was the bad, and they was the ugly. This is the best movie of 1966 by far, I mean the score in this movie was Brilliant and the actor who played the ugly is funny as hell.",
      "review_date": "2015-03-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "You have to like westerns to love this movie, and it is very good along those lines.... I honestly don't know what could be done to make it any better.",
      "review_date": "2011-06-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Good, the Bad, and the Ugly is Sergio Leone's masterpiece. It is beautifully shot, first of all, with creative cinematography and a certain style that many westerns have tried to copy but can never live up to. The musical score drives theThe Good, the Bad, and the Ugly is Sergio Leone's masterpiece. It is beautifully shot, first of all, with creative cinematography and a certain style that many westerns have tried to copy but can never live up to. The musical score drives the movie forward and can be suspenseful or adventurous interchangeably. The acting is pretty good, and the story is intriguing. The character motivations are very sensible, and not predictable (most of the time). The dialogue crackles with wit and chutzpah that produces many a movie quote. The best part of The Good, the Bad, and the Ugly (besides the classic, tense, edge-of-your-seat final shootout scene), is the beginning. For the first five minutes there is no dialogue spoken, something only the best movies and best filmmakers can do. This is one of the best movies ever made, behind The Shawshank Redemption and The Godfather.",
      "review_date": "2014-04-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "10/10 ................................................................................................................................................",
      "review_date": "2015-03-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "If you're gonna watch the best western ever, than watch it, don't read about it. This truly is an example of master film making. Leone's directing, Eastwood/Wallach/Cleef's acting and the greatest soundtrack ever composed by Ennio MorriconeIf you're gonna watch the best western ever, than watch it, don't read about it. This truly is an example of master film making. Leone's directing, Eastwood/Wallach/Cleef's acting and the greatest soundtrack ever composed by Ennio Morricone make this the greatest western ever filmed. A timeless classic that will live on forever.",
      "review_date": "2015-05-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Probably the most all-round film there is, never mind in just the Westerns! Everything fits in with the larger scheme, especially  the civil war backdrop to the journey of Blondie and Tuco, which splits their own selfish journey fromProbably the most all-round film there is, never mind in just the Westerns! Everything fits in with the larger scheme, especially  the civil war backdrop to the journey of Blondie and Tuco, which splits their own selfish journey from America's personal revolution. Alongside Leone's other work this takes the finest parts from each, but this was a role Eastwood was born to perform as our ever-so-cool anti-hero who we would all want to be.The infamous 'Dance of Death' is a perfect way to close the open-ended trilogy, as are some ideas carried over into both 'Once Upon A Time(s)...', but the double-crossing, almost twisted-romance between Tuco and Blondie is the  central beat of the film, with van Cleef showing us what Blondie could have been on the other side of the law. Pretty much the complete film, if you ask me.",
      "review_date": "2011-03-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "After watching this movie I would have to say that Clint Eastwood is my favorite actor alive today. The man is the epitome of coolness and has had some of the greatest action and westerns of all time to his name such as the Dollars Trilogy,After watching this movie I would have to say that Clint Eastwood is my favorite actor alive today. The man is the epitome of coolness and has had some of the greatest action and westerns of all time to his name such as the Dollars Trilogy, Dirty Harry and of course Unforgiven.",
      "review_date": "2011-06-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "In my opinion the ratings for this film are just right.  The film is one of the best, if no the best, performance that he has done. It is one of few films in a franchise to not only match previous films but also out rank them and becomeIn my opinion the ratings for this film are just right.  The film is one of the best, if no the best, performance that he has done. It is one of few films in a franchise to not only match previous films but also out rank them and become greater then the previous. The film shows the good, the bad and the ugly on their quests to earn money in the world of the wild west. If you enjoy gripping action scenes the build tension and suspense mixed with bits of humour this is a film that must be watched.",
      "review_date": "2011-05-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An unquestionable classic, you would have to be bordering on bonkers to miss the brilliance and breathtaking beauty of this film. The quintessential western film, unassailable best of its genre .",
      "review_date": "2012-01-21",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "They do not make westerns like they used to. This is the quintessential spaghetti western. I love Clint Eastwood, as the man with no name. This film should be on everybody's must see list.",
      "review_date": "2012-02-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Quintessential spaghetti western.  Perfect balance between desert spaces and dusty characters.  The three main characters are fun to follow through the story.",
      "review_date": "2012-05-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The work of art that redefined the era of spaghetti westerns still remains just as epic and enjoyable as it once stood the day it was released in 1966.",
      "review_date": "2015-05-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Not boring. One to be watched once or twice in a life, but people are definitively more clever, sensitive and aware of the psychological ropes used at that time nowadays.",
      "review_date": "2014-09-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The opening credits rolled together with Morricone's score. Right there on I knew the film is going to be a classic. It has great character introductions: Tuco crashing on the glass window, Angel Eyes' standing on the door as if Death isThe opening credits rolled together with Morricone's score. Right there on I knew the film is going to be a classic. It has great character introductions: Tuco crashing on the glass window, Angel Eyes' standing on the door as if Death is waiting and there is no way out, and of course, Blondie's menacing \"Yeah, but you don't look like the one who'll collect it.\" line. These stylistic introductions by Sergio Leone captures the audience on what is to come.Yup, what is to come is not as dull as the deserts of Spain. It has a very compelling plot which dwells on the morality of the characters in the backdrop of the Civil War. All three characters are crooked gunslingers, their eyes are all focused on the gold but the Civil War would spell their differences. The Bad really is bad, The Ugly do have a displeasing personality, but The Good... we don't even know why he was called one until he comments about how men are wasted in wars. He even offered alcohol and cigar to the dying men of war. The writers did not shy away on portraying the horrors of war because one will know a person's morality on how he views injustice. Does he take advantage of this for personal gain (The Bad), does he go against it (The Good), or just don't care at all (The Ugly). Lastly, the film won't be a cinematic classic without the cinematography and Morricone's score. The combination of these two elements was perfectly executed especially into its climactic ending of the three main character's stare downs and their hands slowly creeping on their guns while Morricone's The Trio is playing on the background. The establishment of eye lines together with camera angles were perfectly executed. Of course, i would not forget the classic intro. I mean that intro is a stable in those western-inspired films whenever there's a stare down happening in the middle of the town.I believe this is the epitome of Western movies. All the western-inspired films in the modern times definitely stole a lot from The Good, The Bad and The Ugly. Indeed, a masterpiece in all aspects.",
      "review_date": "2020-07-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A true cinematic marvel - undoubtedly the best representative of it's genre, surpassing even that other heavyweight \"The Searchers\". Leone (with Morricone's phenomenal score) weaves a stunningy beautiful yet desperately sad tapestry of a westA true cinematic marvel - undoubtedly the best representative of it's genre, surpassing even that other heavyweight \"The Searchers\". Leone (with Morricone's phenomenal score) weaves a stunningy beautiful yet desperately sad tapestry of a west torn by civil war. The actions of our leading trio are ant-like in this scale, but this contrast drew me in, and the ruthless and brutality portrayted somehow gains reason. Exquisite piece of film - just watch with fresh eyes, and ignore pop culture's never-ending parody and reference to this Italian-made brilliance.",
      "review_date": "2016-04-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "MASTERPIECE\rIn this world there's two kinds of people my friend:\rThose who love this movie\rand those who love this movie\r I'm  one of those who love this movie",
      "review_date": "2016-03-16",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I have seen this movie no less than 25 times. I have been a western fan since a little boy. This is by far one of the best westerns ever made. The music, the acting, the storyline. Everyone has their favorite character. Gotta go now, I haveI have seen this movie no less than 25 times. I have been a western fan since a little boy. This is by far one of the best westerns ever made. The music, the acting, the storyline. Everyone has their favorite character. Gotta go now, I have to take Tuco for a walk.",
      "review_date": "2018-10-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "\"You see in this world, there are two types of people my friend, those who love this film and those who're retarded.\" This quote should be shared everywhere. Also, it's a spoiler free review, and it may seem to be a little vague. ..Good :\"You see in this world, there are two types of people my friend, those who love this film and those who're retarded.\" This quote should be shared everywhere. Also, it's a spoiler free review, and it may seem to be a little vague. ..Good : It's a f**king masterpiece. Don't agree with me? I don't give a s**t. Leone's visual storytelling has never been so great. The scores, the activities of the characters, the scenes were enough to tell the story. The dialogues are simply conversations between the characters. In the entire three hour runtime, there isn't a single expositionary dialogue, except for a total of 5 minutes. That's a very difficult task to do, and it does it with such an ease that we don't even notice it during the first viewing. Many difficult scenes have been shot very perfectly, which feels really obvious. There are a few point of view shots which makes it more interesting. The characterizations given to each of the three lead characters justify them as good, bad and ugly. There are many moments which justify their characterizations. Clint Eastwood, Lee Van Cleef and Eli Wallach have done a complete justice to their roles. This movie, being set in the American Civil War, has some elements of it. However, it doesn't glorify the war and doesn't take any side. It portrays war as one of the worst things - just like in the way it should be. The war scenes are too damn good. Well choreographed and incredible cinematography. You can see a whole bunch of people engaging, and it obviously was not CGI. It wasn't really necessary to show all of that, but it did and it was great (Sergio Leone f**king rocks!). The violence does feel real and legit, in contrast to many older \"yuoppikaayaaayokaaiyaay\" Westerns. Last but the important thing would be music, Ennio Morricone's score is entirely of next level good. Incomprehensibly great. It complements every scene and either escalates the tension (eg. the final showdown) or just develops emotional and dramatic factors. Also, contrary to this, there are some moments of silence which serve similar purpose of escalating the tension and drama. The music is so good that even if you (somehow) end up not liking the film, you will definitely love the score by Morricone. It has absolutely no negatives whatsoever. It deserves every bit of praise it receives. ..Conclusion : This is the Citizen f*cking Kane of Westerns. Every Western film (not necessarily Spaghetti) is compared with this. There is a reason why. This is a highly recommended film not only for Western lovers, but for every movie lover out there. As for me, I heard a lot of great things about it, then, I was ready to be disappointed, but I was blown away by it. It was way above my initial expectations, and delivered a lot more than that. Recently, only Infinity War managed to do so. It is a gem of a movie. ..Rating. ..Score : absolute 10/10Grade : golden A+",
      "review_date": "2019-03-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "In my opinion, the best Western movie ever made. Super interesting and great characters.",
      "review_date": "2019-06-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Three thugs come into information about a certain treasure hidden somewhere in a graveyard, which precipitates in a battle of wits and endurance that takes us through deserts, prisoner-of-war camps and battle encampments. There's never a dryThree thugs come into information about a certain treasure hidden somewhere in a graveyard, which precipitates in a battle of wits and endurance that takes us through deserts, prisoner-of-war camps and battle encampments. There's never a dry moment, well except for the weather.\r The Ugly, Tuco, is a low-life, good-for-nothing, petty thief who has an unwritten contract with Blondie a.k.a the Man with No Name (Clint Eastwood) which the latter usurps, making him want to seek vengeance. Some might find him the most sympathetic one because he talks about his life, which the others don't, and we know that he didn't know any better, or things might have been different. He overestimates his intelligence and suffers for that at the hands of the other two. But if he sets his mind to something, he will take such offence that he will pursue his enemy to the extreme.\r The Bad, Angel Eyes, is singularly portrayed as the villain without redeeming qualities. Early on he kills a child to distinguish himself from the other two, though the others are not so much saints and Tuco is a rapist. Their life is hard and given the circumstances the other two might have done the same in the heat of a gunfight to save their skins, but the important thing is that they are not shown to do so and this is what immediately sets him apart and paves a separate path for him.\r The Good is not so much good in character as in looks. The Man with No Name roams the desolate landscape in search for bounty. But since he appears to be the protagonist, he may come across as the most sympathetic one from the three. He is a man of few words. Initially it feels like he may get overwhelmed by the barbarity displayed by the other two, but through a combination of wits, deceit and an unmatched prowess at gun toting, he displays a skill at killing that often intimidates his peers.\r Each of them kill with impunity and without remorse, sometimes over nothing at all. As they pursue this treasure, their paths cross several times. They change sides at first opportunity. They cannot sit down and talk about splitting it because The Man could never agree to that. Whether Angel Eyes would have is never really explored.\r While these three compete for gold, in background we are constantly reminded of the Civil War. The battle sequences near the end were well shot and captured the chaos of a battle as accurately as it could be on the camera. The camera pans out and shows us the opposing sides and their positions. Glimpses of the war are shown throughout the length of the movie, sometimes a makeshift hospital in the ruins of a building, cannon balls landing in towns and streets, armies marching. No side is shown to be the more sympathetic one. No slaves are shown, not one. Leone clearly did not want to be caught up in a debate. The story he wanted to tell had little time for such discussions. But what he did want to show was the futility of war. Countless suffering youth is shown time and again.\r What I loved about the movie is that it was more than just mindless killing and violence. Plenty of time is spent between action to let us reflect on our surroundings and what is going on in there. Hardly a moment is lost in a scene which does not have a bearing on later events. Everything is intricately plotted, meshed together perfectly. Leone spends a lot of time creating tension through silence. Even amidst all the carnage, the tone is always playful. Leone doesn't let the movie get too serious, often flanking scenes of death with humorous ones.\r There is a fair amount of convenient coincidences throughout the movie but if you start paying attention to them and seek them out deliberately, it would distract from the whole experience. For as much a serious movie as it is, the intention clearly had been to make a movie that could be enjoyed several times without overbearing with the serious part. Some of the scenes stretch the imagination, like Blondie's ability to shoot off the hats of people from far away.\r The score is iconic and added humour and a sense of thrill to the action it supported. The set design was fabulous. The towns, houses, rooms and their furnishings shows almost perfectly the world of that time. The eye for detail was impressive. Nothing seemed to be out of place. Costume was spot on. Cinematography really helped paint a picture of the action taking place.\r The last sequence was riveting as the three stand in a Mexican stand-off. This is where we finally realize that the other two, no matter how cruel they could be, are really at the mercy of this mysterious person who is not named once. There was never a time these two could have outsmarted him. While they fidget about, The Man remains passive, defying every expectation. Nevertheless, the way luck plays its part in saving his neck time and again had a greater role than any other, without which no one could survive in this world.",
      "review_date": "2013-12-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A masterpiece of cinematography, music, and complex characters, 'Good, Bad, Ugly' is an absolute classic. Sergio Lione did what many people in 1967 thought was impossible: he made the spaghetti westerns a art form of their own. Eli WallachA masterpiece of cinematography, music, and complex characters, 'Good, Bad, Ugly' is an absolute classic. Sergio Lione did what many people in 1967 thought was impossible: he made the spaghetti westerns a art form of their own. Eli Wallach has the most underrated supporting role in all cinema. Everything else: the action, gunfights, the final showdown, it all comes through for a thoroughly satisfying three hours.",
      "review_date": "2014-03-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Not just a great western, a great movie, a masterpiece. Sergio Leone at his best, all the actors at their best. Not a typical western screenplay, but it's still brilliant and memorable. Brilliantly executed, like Casablanca, one of the moviesNot just a great western, a great movie, a masterpiece. Sergio Leone at his best, all the actors at their best. Not a typical western screenplay, but it's still brilliant and memorable. Brilliantly executed, like Casablanca, one of the movies closest to perfection.",
      "review_date": "2014-08-13",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the best Western films ever made, The Good, the Bad and the Ugly final 20 minutes are out of this world. Stunning.",
      "review_date": "2019-06-08",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Everything in this movie is amazing. The instantly recognizable music by Ennio Morricone. The costumes that are instantly believable as what cowboys would have worn. The incredibly well played characters. The story that pulls you into theEverything in this movie is amazing. The instantly recognizable music by Ennio Morricone. The costumes that are instantly believable as what cowboys would have worn. The incredibly well played characters. The story that pulls you into the movie. Everything.",
      "review_date": "2018-09-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "One of the greatest westerns ever made with a plot surrounding lot's of money, american civil war, gun battles n other stuff that works entirely fine on this film.",
      "review_date": "2019-07-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Good, The Bad and The Ugly reminds us to never judge a book by the genre from which it was produced. Iconic in every facet, Leone transcends the discriminating image of 'spaghetti westerns' that society projected on his work. The filmThe Good, The Bad and The Ugly reminds us to never judge a book by the genre from which it was produced. Iconic in every facet, Leone transcends the discriminating image of 'spaghetti westerns' that society projected on his work. The film does have its problems: Eastwood is flat even for his standards, and the multilingual lip-syncing makes the film seem embarrassingly amateuristic at times. But the only thing that sticks is the grandiose imagery, lifted out of mortality by Morricone's masterful score that put him on shortlists beside classical composers. This film is a stylistic masterpiece.",
      "review_date": "2020-04-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "10/10..........................\rThe film title, the story, the characters, the performance, the score, the settings - everything is awesome. Such a beautiful masterpiece.",
      "review_date": "2015-05-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is so impressive. You will enjoy the story, your ears will be impressed with the soundtrack, and you will like actors so much. My love to Clint Eastwood started here. He's so awesome as the main character — The Good. Personally, IThis movie is so impressive. You will enjoy the story, your ears will be impressed with the soundtrack, and you will like actors so much. My love to Clint Eastwood started here. He's so awesome as the main character — The Good. Personally, I consider this film to be the best, the most fascinating movie that you can ever find. If you haven't ever watched Westerns, this is a good movie to start with you to love such kind of films.",
      "review_date": "2016-07-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I decided to watch this movie based on the great reviews it received. Unfortunate for me, it was a complete waste of time. I came into the movie knowing it was long, but was told it was worth it. That statement caused me to waste 3 hours ofI decided to watch this movie based on the great reviews it received. Unfortunate for me, it was a complete waste of time. I came into the movie knowing it was long, but was told it was worth it. That statement caused me to waste 3 hours of my life. Anyway, on to the reasons why it was a waste. The movie itself had a decent storyline. The problem with this movie, however, was that it is the longest, drawn out movie known to mankind. This movie could have been played out in literally 20 minutes based on what all happened in the movie. Instead, viewers get to wait 30 minutes while it shows Clint Eastwood crawl 20 feet through the sand not saying a word. Against my better judgment, I continue watching, waiting for something spectacular to happen in the end. As the end approaches, viewers get to wait through yet another drawn out scene, of 3 men standing in a triangle pointing guns at each other. After, 10 minutes of watching that, I lost interest of who was going to die anyway. It literally switches cameras more times than I can count. Then, the finale comes. That is when I comprehend just how much time had been lost in this movie. I am writing this review as a friendly favor to warn you of this lame excuse of a movie, because no one was there to warn me.",
      "review_date": "2020-11-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Good the Bad and the Ugly.How about The Bad Actor the Generic Goofy Villain and the Only Likable Character would be the best words to describe this film. The Good the Bad and the Ugly is a classic of it's time and influential in theThe Good the Bad and the Ugly.How about The Bad Actor the Generic Goofy Villain and the Only Likable Character would be the best words to describe this film. The Good the Bad and the Ugly is a classic of it's time and influential in the Western genre. However it is far from the best Western movie and is more suited to be watched on a airplane when people are about to vomit. It is overly long, overbearing and pretentious. The main character is cool looking but lacks the depth that other better protagonists have like Django Freeman from Django Unchained and Marquis Warren from The Hateful Eight. The Man with no Name is a flat, uninteresting, frivolous character who has the personalty of a run down car. The Man with no Name is more of a wizard with magic sharpshooting skills than an actually cowboy. Clint Eastwood is a sub par actor at best and his directing is good but he has yet to actually make a good script that would make his films a bit more tolerable.Oh and if any old time critics or hardcore Eastwood fans got a problem with my review, they can shove their pompous opinions up their ass and **** somewhere else. Sometimes people say you have to watch a movie twice to get it but two hours and a half of boring bullcrap is enough for me.Opinions are subjective and that word is kryptonite for film critics.Django Unchained is the best western of all time, so suck on that.",
      "review_date": "2018-11-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "As long as I live, I will never understand the appeal of this cheap spaghetti western. It's overacted, way too melodramatic. Indeed it does have a great score, but otherwise is an unimpressive western. It's just a cheap Italian As long as I live, I will never understand the appeal of this cheap spaghetti western. It's overacted, way too melodramatic. Indeed it does have a great score, but otherwise is an unimpressive western. It's just a cheap Italian made garbage.",
      "review_date": "2008-08-31",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A dead, dry, boring, dull, cheesy terrible movie.",
      "review_date": "2008-08-03",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Good, the Bad, and the Ugly is the best of the Dollars trilogy. Rather than put the talented gunslinger against dumb criminals three talented gunslingers are all bitted against each other. This results in a story that stands out from theThe Good, the Bad, and the Ugly is the best of the Dollars trilogy. Rather than put the talented gunslinger against dumb criminals three talented gunslingers are all bitted against each other. This results in a story that stands out from the others. We already know that these guys are awesome so putting them up against regular bad guys doesn’t create a lot a tension but when these guys are up against each other there is a lot more tension. All of this results in a quite suspenseful and engaging climax, which, like most of the action in the film, is intense as the film takes time to build up the action as well ass create atmosphere and tension resulting in one of the most entertaining westerns.",
      "review_date": "2015-05-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Seriously good spaghetti western with with good characters, humour and one of the greatest scores ever written.",
      "review_date": "2019-04-07",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Good film here. If I was rating based on undoubtable influence, my rating would be higher, but since I am not, it is what is. I love the cinematography and the score, oh my God, the score is phenomenal. The editing is also really good. ClintGood film here. If I was rating based on undoubtable influence, my rating would be higher, but since I am not, it is what is. I love the cinematography and the score, oh my God, the score is phenomenal. The editing is also really good. Clint Eastwood is also great as expected in his trademark role as the \"Man With No Name\" and I really did enjoy Sergio Leone's direction, even if it entirely cheesy. However, what does prevent me from loving these spaghetti westerns even more is two-fold. Firstly, this one is particular was a tad long and drawn out. I feel as though it could have been a bit shorter and still accomplished the same as it did in three hours. Next up, and the most egregious, the dubbing. Ugh, I hate dubbing and here, it is baaaaddddd. There are moments when it is not as noticeable, but there are so many times when it is painful how bad it is. While the praise this one receives is very appropriate for a film of this caliber, I cannot enjoy it as much as most for those two reasons.",
      "review_date": "2014-03-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A mixture of tensity and fear, this genre defining movie really does set the standard for all those after it. Eastwood plays the role of \"The Good\"  perfectly, adding mystery to his character through one facial expression and tone. WallachA mixture of tensity and fear, this genre defining movie really does set the standard for all those after it. Eastwood plays the role of \"The Good\"  perfectly, adding mystery to his character through one facial expression and tone. Wallach plays \"The Ugly\", a man with no shame, a man full of greed and betrayal. And Van Cleef plays \"The Bad\" who has no remorse for his actions or the consequences that unfold. This amazing portrayal of the west brings the trio together through unbelievable storytelling, driven by a soundtrack composed by Ennio Morricone, to serve for one of the best ending scenes in modern cinema.",
      "review_date": "2014-09-04",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The best western to see is \"The Good, The Bad, and The Ugly.\" It shows influences to the Civil War in the Western genre with excellent performances by Clint Eastwood, Lee Van Cleef, and Eli Walchi. It consists of the Western action withThe best western to see is \"The Good, The Bad, and The Ugly.\" It shows influences to the Civil War in the Western genre with excellent performances by Clint Eastwood, Lee Van Cleef, and Eli Walchi. It consists of the Western action with thrills and humors through these three actors.",
      "review_date": "2014-07-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It is Sergio Leones masterpiece and also one of Ennio Morricones most remembered work. An extremely well crafted movie that can be used in film schools and is entraining. Also a prime example for the show not tell rule. The characters don'tIt is Sergio Leones masterpiece and also one of Ennio Morricones most remembered work. An extremely well crafted movie that can be used in film schools and is entraining. Also a prime example for the show not tell rule. The characters don't use much words but you miss nothing. Everything is told via the scenery, acting, mimic and music. It is the one Western that frequently appears on the top movies of all times list. I must again praise the director and the crafting. Many scenes are done in one shot and are visually impressing. The sets and requisites are mindbogglingly good. They even used time appropriate guns. For some scenes they had Spanish soldiers as extras. Then there are the main actors. Clint Eastwood as “The Good” in his persona as tight-lipped gunman, Lee van Cleef as “The Bad” and Eli Wallach as “The Ugly”. They deliver a flawless performance here and nailed the roles. The acting, gestures and mimic are prime examples for great acting skills and you would not believe that a Western has such a good performance. Then there is the story that is always engaging. A cat and mouse game between the three protagonist. A game of scoundrels. No one can rate this movie without giving Ennio Morricone credits for the soundtrack. Like Sergio Leone said ”Ennio Morricone does not make music. He is telling stories with his scores and more of a director”. Here you can see why. His scores improved the scenes and deliver an intensity that I cant describe. Just the final stand-off is of the highest calibre and even if you don't watch the movie you should a least watch it on YouTube. The main theme has transitioned the movie. Everyone has heard it and knows it is from this movie. It is used so many times in other movies, shows and media that I can probably fill a book with it. There is only one flaw in this movie. The synchronisation is horrible in the English version (In German it is O.K). maybe a warning for some. The film is matured and does not shy away from the ugly truth of a lawless area and immoral acts. Overall it is a classic and deserved its place in movie history.",
      "review_date": "2020-10-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Best western ever made with marvelous performances and iconic soundtrack.A movie so thrilling and so quotable that you just can't get enough of it despite of it's running time.\"There are two kinds of people in this world.Those with loadedBest western ever made with marvelous performances and iconic soundtrack.A movie so thrilling and so quotable that you just can't get enough of it despite of it's running time.\"There are two kinds of people in this world.Those with loaded guns and those who dig...you dig.\"",
      "review_date": "2014-10-12",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "best movie ever.......................................................................................................................................................",
      "review_date": "2014-12-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A three-hour epic tale of the worst parts of human soul. The movie goes on and puts you right in the middle of the story. Soon you'll find out that no one is really \"good\" in The good, the bad and the ugly. The harsh wild west makes peopleA three-hour epic tale of the worst parts of human soul. The movie goes on and puts you right in the middle of the story. Soon you'll find out that no one is really \"good\" in The good, the bad and the ugly. The harsh wild west makes people greedy, dirty, selfish and violent; you have to be \"bad\" to survive.\rdark humor, memorable quotes, well-done characters and finally, the epic music made by Ennio Morricone make this movie one of the best movies ever made, and probably the best western.",
      "review_date": "2015-01-15",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This review contains spoilers, click expand to view.\n        \nThe Final Chapter of one the biggest tough western franchise in history Sergio Leone finally makes his third and last Dollars installment more advanced and original in design, with an amazing plot and lots of good use in money to film all the battle scenes, gunfights, with beautiful exterior shots of the Spaniard Plateau landscape serving as the Old West and a massive well done score by Ennnio Morricone\r Clint Eastwood reprises his tough guy performance as the poncho wearing grizzled faced gunslinger with no name but being referred to as \"Blondi\", who stumbles on a hunt for a treasure trove of Confederate gold deep in the old southwest, where he faces competition by ruthless mean eyed bounty hunter Angel Eyes (Lee Van Cleef) and greedy hot-tempered oafishly comical bandito outlaw Tuco.\r the film is climatic with the Civil War raging on as the rivaled triumvirate dash down to Mexican territory to reclaim the treasure before the other those. this is probably the most ambitious western since John Ford's the Searchers but more darker and bloodier, and is as glorifying for the Western genre with many memorable scenes and lines from the last climatic Mexican standoff to lots of memorable punchlines delivered by the three vicious characters and Morricone's famous opening theme.\r Eastwood, Van Cleef, and Wallach are awesome playing their roles well like three dogs of different brute lifestyles fighting over a pile of bones, and a well deserved international Box office score, this film is probably the best western ever made.\r A 5 Star Masterpiece with a Monumental Scope that still is as grand and equally comparable to Kurosawa's Seven Samurai",
      "review_date": "2015-04-26",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Great movie, one of the best westerns I have seen. Really interesting story and even if you are not into westerns, I think you will like this. I may have not seen many Clint Eastwood movies before as I am not American, but this certainlyGreat movie, one of the best westerns I have seen. Really interesting story and even if you are not into westerns, I think you will like this. I may have not seen many Clint Eastwood movies before as I am not American, but this certainly shows why everyone loves him there.",
      "review_date": "2018-02-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "It feels strange to rate something like \"The Good, the Bad and the Ugly\" with only a \"seven\". But the truth with film classics is that they are not really all perfect films, some are just \"good\".",
      "review_date": "2016-10-29",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The highest user score on Metacritic's history. May I help you rise the score up just a bit? If you say yes to this question, then I shall bot this movie until it gets up to 9.9. Nah, just kidding.",
      "review_date": "2016-02-01",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Yes, it's campy.  Yes it's cheesy.  Yes it's spaghetti.  But it is the best in all of those categories and more.  Every time I aee a negative review, I ask \"Did you not know what this was all about before you watched it\"?   Read a review orYes, it's campy.  Yes it's cheesy.  Yes it's spaghetti.  But it is the best in all of those categories and more.  Every time I aee a negative review, I ask \"Did you not know what this was all about before you watched it\"?   Read a review or two before watching it, then If you're shallow enough to not like it, so be it.   Anyways, this is THE BEST western of that era.",
      "review_date": "2016-03-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "An essential of western spaguetti genre. Amid the Civil War, the restless search of a nameless bounty hunter, an enforcer and an outlaw for a treasure that won't share 50-50. The final duel of gunslingers is for antology. A must to see inAn essential of western spaguetti genre. Amid the Civil War, the restless search of a nameless bounty hunter, an enforcer and an outlaw for a treasure that won't share 50-50. The final duel of gunslingers is for antology. A must to see in holidays with a big bag of popcorn.",
      "review_date": "2019-04-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "La mejor película de la 'Trilogía del dólar' pero la que menos me gusta personalmente, no es del todo lo que esperaba.",
      "review_date": "2018-01-18",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "La fin de la fameuse trilogie du dollar a mis les **** plats dans les grands et bénéficie de gros moyens : moult figurants, des canons, bien des décors et des explosions, une grande bataille... Le spectacle est assuré puisque ce troisièmeLa fin de la fameuse trilogie du dollar a mis les **** plats dans les grands et bénéficie de gros moyens : moult figurants, des canons, bien des décors et des explosions, une grande bataille... Le spectacle est assuré puisque ce troisième volet se déroule pendant la guerre de sécession tandis que nos \"héros\" (qui n'en sont pas, loin de là) malins comme des lièvres, profitent de la moindre opportunité qui s'offre à eux... et notamment la perspective d'un gros paquet de beaux dollars...Si Gian Maria Volonté n'est plus là pour faire le vilain, ce sera Lee Van Cleef \"l'autre chasseur de primes\" qui s'y colle, avec grand talent : le regard perçant, les traits acérés, la brutalité et le meurtre comme seules lignes de conduite, un authentique prédateur...L'inamovible homme au poncho qui parle peu, l'inénarrable personnage qui a fait la gloire de Clint Eastwood est bien sûr la pierre angulaire de ce trio, complété par un nouveau, l'excellent Eli Wallach en bandit sournois, assassin et traître, la réincarnation de Judas en personne... En vérité, voilà une belle brochette de salopards, sauf que l'un (le bon !) est un peu moins salaud que les autres, car tout simplement plus pragmatique...Le premier tiers du film (qui dure dans la version longue 3 heures) est rigoureusement parfait et aligne ses séquences avec une ironie et une maîtrise admirables ; puis on découvre au fur et à mesure les scènes inédites, souvent intéressantes ici et là, qui précisent quelques évènements. Au bout de 2 heures, ça tient encore le coup même si le brio du début est nettement retombé...La dernière heure accumule les lenteurs, des lenteurs inhérentes au métrage original : la partie du pont aurait dû être escamotée, car elle n'apporte rien à l'intrigue... On sent là les défauts à venir des films suivants de Sergio Leone qui va se laisser aller au remplissage inutile...Le film n'en reste pas moins agréable à voir ou à revoir, pour ses personnages que l'on dirait sortis d'une bande dessinée, la musique tonitruante d'Ennio Morricone ou ses dialogues savoureux, surtout dans la version française dont les voix caverneuses  et charismatiques mettent sérieusement à mal la version originale, améliorant ainsi à son insu ce western décidément atypique.",
      "review_date": "2018-12-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is one of the greatest films of all time. The action is perfectly shot and everything is beautiful about this film. The score by Ennio Morricone is the greatest score in cinema history. The only problems I have is that there are momentsThis is one of the greatest films of all time. The action is perfectly shot and everything is beautiful about this film. The score by Ennio Morricone is the greatest score in cinema history. The only problems I have is that there are moments that prolong the movie making it unnecessarily three hours and Clint Eastwood in this movie needed more character development, but that’s it. And those critiques are only nitpicks. This is a gorgeous and engaging movie experience that must be seen. Now stop reading reviews and go watch it now. But if you have seen the movie and want to see the public opinion, my opinion in that the movie is close to becoming a masterpiece and is one of the greatest American classics of all time while still being the best Western of all time. If you like cinema, watch it. If you like action, watch it. If you like history, watch it. If you like a well-bodied drama about cowboys, watch it. If you like a good western, watch it.  Go see now!",
      "review_date": "2017-03-23",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This epic features a coherent story, complex characters, iconic performances, mesmerizing landscapes, one of the greatest movie endings ever, and a timeless score by Ennio Morricone. It's easily one of the best (if not the best) westerns ofThis epic features a coherent story, complex characters, iconic performances, mesmerizing landscapes, one of the greatest movie endings ever, and a timeless score by Ennio Morricone. It's easily one of the best (if not the best) westerns of all time, If you haven't watched it yet, I envy you, because that means you haven't enjoyed the most entertaining 3 hours in your life yet. (9/10)",
      "review_date": "2018-05-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Good, The Bad and the Ugly is a film which is a masterpiece and the best example of the western genre. Almost everything about this film is perfect, the acting is great, the directing, the writing. I could go on about how good this filmThe Good, The Bad and the Ugly is a film which is a masterpiece and the best example of the western genre. Almost everything about this film is perfect, the acting is great, the directing, the writing. I could go on about how good this film is but I think others have always said what needs to be said. The only issue I have with this film and the only reason why this film doesn't score a 10 is because there are issues with the sound design, mainly the ADR for the dialogue. Other than that, this film is perfect.",
      "review_date": "2018-06-22",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Acredito que seja o filme mais fraco da trilogia, porém não deixa nada a desejar.A trilha sonora é lendária. Toda trama envolvendo os três personagens é muito bem amarrada. Inclusive, gostei de darem mais tempo de tela aos outros senãoAcredito que seja o filme mais fraco da trilogia, porém não deixa nada a desejar.A trilha sonora é lendária. Toda trama envolvendo os três personagens é muito bem amarrada. Inclusive, gostei de darem mais tempo de tela aos outros senão Clint Eastwood. Não gostei muito da desconstrução do \"olhos da lei\"x, que no segundo filme chamou muito minha atenção. Tuco tem uma personalidade bem peculiar, e seus momentos no filme são excelentes.",
      "review_date": "2020-07-24",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "So much runs through the viewer's mind during the climatic graveyard scene near the end The Good, The Bad, and the Ugly. Somehow, through all we've have been put through for the last 3 hours, the brutality of America's bloodiest war, theSo much runs through the viewer's mind during the climatic graveyard scene near the end The Good, The Bad, and the Ugly. Somehow, through all we've have been put through for the last 3 hours, the brutality of America's bloodiest war, the many, many twists and turns that we've been put through, the highs and lows of the truly epic journey across America's sun-scorched, anarchic, savage bastard child west, nothing else matters besides what is going right now at this very instance. Despite Morricone's heavenly \"Ecstasy of Gold\" drumming everything, meaning the scene, its characters, the action, and the audience along, it's really a moment of restrained triumph, as Tuco the Ugly frantically gallops across this massive graveyard which more closely resembles some great Roman coliseum in search of the one thing that he could ever mean something to someone like him, some arbitrary object of gratification with which we, the audience, have had dangled in front of us for what feels like an eternity. Suddenly, the whir of excitement and triumph comes to a dead stop. The heavenly mariachi is silent now, and the almost spiritual catharsis which has briefly unified this character, this film, and this audience as one shared soul in search for something greater has finally hit a fever pitch from which words escape. The entire world has stopped and even the Heavens seem to have lent its undivided attention - Tuco has found the gold.Somehow, despite Clint Eastwood's top-billing and his position firmly at the bottom of the film's title, Tuco scans as the main character of this affair. He sets the adventure in motion, he discovers the gold, and most importantly, he's the one we empathize with, the one we actually care about. Somehow, his greed, his wretchedness, his disregard for anything which could be considered ethical or cosmically important in any way do nothing to hinder our view of him as a sympathetic human being as deserving as anyone of just one moment of satisfaction. He suffers all throughout the movie as some creature who has never been loved or even tolerated by anybody else. He can't even get by for his own brother, who couldn't loathe him any more were he the devil himself. Like many of the greatest characters of the genre - Cormac McCarthy's Judge Holden, Jesse James, among others, he embodies the wild west in human form - an amoral force for chaos that we, against our better instincts, have qualities that we see in ourselves.The Good, The Bad, and The Ugly is the idealized west and it's also the grim, violent, bleak west. Its gorgeous landscapes that seem to melt like butter across the screen and then some and its gunslinging good guys and bad guys that we can't help but throw our weight behind are all present and accounted for, just as are the harsh, morbid realities that plagued real people that really existed and really felt at this time. It's this atmosphere, of grit and spit and grime and dirt and famine that make The Good, The Bad, and The Ugly as profoundly timeless as they are. This is no surprise coming from Sergio Leone, the man who could make riveting cinema out of 10 uninterrupted moments of three guys waiting for a train in the middle of a desert.It should come as no surprise that among this film's many merits is the simple reality of just how ahead of its time this movie was. Its archetypes and arid, scenic backdrops aren't just present in modern fiction, they're almost the bread and butter of a well-told story. Star Wars, Red Dead Redemption, Blood Meridian, Grand Theft Auto, Pulp Fiction, Breaking Bad; just drops in the pan of the vast sum of works of fiction that almost certainly owe more than their fair share of inspiration to this film. We certainly don't love these settings and these characters because they bring out the best in us. There are absolutely no morals, no higher truths with which to ascribe to, and certainly very little compassion on display here. And yet, it would be a difficult position to defend that they bring out the worst in us either, being that they are able to get us to feel tremendously for the plight of even the most wretched characters and see some great redeeming power in the virtue of earnestness for earnestness's sake. Most accurately is that these stories simply bring out the most human in us, and that is the very essence of storytelling itself.",
      "review_date": "2020-04-10",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The greatest most epic western ever made, Eli Wallach steals the show as Tuco in what might be the best uneasy alliance in film history with Clint Eastwood's Blondie. The ending of the film is the greatest ending I have ever seen to a motionThe greatest most epic western ever made, Eli Wallach steals the show as Tuco in what might be the best uneasy alliance in film history with Clint Eastwood's Blondie. The ending of the film is the greatest ending I have ever seen to a motion picture, the way the cinematography and music comes together in that final scene is sublime, spiritual and hypnotic in fact the ending is the greatest scene in film history everything from the moment they arrive at sad hill up until the end credits is absolute perfection.All film is subjective but that was simply my experience with it, the soundtrack to the entire film is beyond great and everything before the ending is also excellent with the highlight for me being Tuco in the gun shop, extremely entertaining scene. An absolutely astonishing film.",
      "review_date": "2020-06-09",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The zenith of entertainment, it is staggering this film was made in 1966. Incomparable in terms of contemporary cultural sustainability, it is stylistically timeless. The acting, appropriate to its purpose, retains honesty and integrity; theThe zenith of entertainment, it is staggering this film was made in 1966. Incomparable in terms of contemporary cultural sustainability, it is stylistically timeless. The acting, appropriate to its purpose, retains honesty and integrity; the pathos is impeccable, and the story never takes itself seriously yet still emotes intense emotional response after innumerable viewings. It even manages to sneak in powerful anti-war, anti-discrimination messages, all the more poignant for the Vietnam era in which it was created. Cinematically, the attention to detail is as good as it gets: swathes of panorama balanced with vignettes, facial twitches replace dialogue that would otherwise crush the tension and momentum. Authenticity drips from the staging of every shot. And of course the score, which by any standard must have been ground breaking at the time and is as timeless as the production. Criticism may be levelled at any part of the movie by pedants and professional nitpickers, but the composition of elements integrate into a whole to form a masterpiece that surely remains unparalled. Who would have believed that a Western, and a spaghetti western at that, would have become the Mona Lisa of our times?",
      "review_date": "2020-06-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The Good The Bad and The Ugly is a good movie. The plot is good the characters are good and unique in there own ways. If you liked A Fistful of Dollars and For a Few Dollars More you will like this movie as well.",
      "review_date": "2020-09-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Well what do you know? Another amazing movie from Sergio Leone. The Good, The Bad and the Ugly has so much good about it, and quintessentially it is one of the best westerns ever made. There may be nothing new about the story at first glance,Well what do you know? Another amazing movie from Sergio Leone. The Good, The Bad and the Ugly has so much good about it, and quintessentially it is one of the best westerns ever made. There may be nothing new about the story at first glance, but that's the point, Leone is paying homage to the Hollywood western, and despite the initial simplicity there is also a complexity mainly in the film's characters. Regardless of whether simple or complex it is, The Good, The Bad and the Ugly does have a compelling and brilliantly written story.But there are other assets that make The Good, The Bad and the Ugly so good. The dialogue is always excellent, while Leone's direction is superb once again. The characters are great and are superbly played. Clint Eastwood gives one of his best performances ever here, and Eli Wallach is perfectly cast and more than a match for him. I was also very impressed with Lee Van Cleef, who I recognised from High Noon and such, but he makes a bigger impression here. The Good, The Bad and the Ugly is also the most violent of the trilogy, and one of the most violent of the genre, not a bad thing whatsoever.The pace was spot on too, even though the film is nearly three hours long, it is never boring or dull. The best things though about The Good, The Bad and the Ugly are the visuals and Ennio Morricone's score. The film looks amazing, the cinematography is gorgeous and the sweeping images and scenery are very lovingly crafted. Morricone's score is even more impressive than that, it is simply one of the best film scores I've ever heard, and if I had to say which was Morricone's best score, I would immediately say this.Overall, there is nothing bad or ugly about the film. The film is amazing. 10/10 Bethany Cox",
      "review_date": "2022-03-14",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "Still a good Western tale and the casting was awesome, but that music score added an extra layer of magic to it all.",
      "review_date": "2023-02-06",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I really couldn't understand most of the reviews here that place this film as a great western or even the best ever for some fans. In my opinion this is just a watchable and good western, but not much more than that.I think the onlyI really couldn't understand most of the reviews here that place this film as a great western or even the best ever for some fans. In my opinion this is just a watchable and good western, but not much more than that.I think the only possible explanation would be that IMDb reviewers consider \"spaghetti\" westerns a sub-genre within the western genre. If that is so, \"The Good, The Bad and the Ugly\" would probably stand among the best (if not the best)in the \"spaghetti\" westerns ranking. But the point is that in my opinion there are no sub-genres within the western genre. So I analyze this film just for what it is: a western film.In such terms, this film has its moments, fine open-wide outdoor locations, good action gunfights (though hardly believable) and an acceptable plot. Good acting too mainly in Eli Wallach's Tuco.But what really demerits this movie is its incredibly unnecessary overrun; there's no way the story can stand almost 3 hours in duration and so the development is definitely slow. Overruning has always been a characteristic of director Sergio Leone; he sort of engages madly with some sequences and he goes on and on and on at it (the final duel here is an example with all those unnecessary close shots in the men's faces and eyes). Another clear sample of what I'm saying was the incredibly long -and even boring- opening sequence of \"Once Upon a Time in the West\", where Leone takes more than 10 minutes in the opening sequence where three gunmen are waiting for Charles Bronson at a train station.Come on guys, let's face it. \"Spaghetti\" westerns are \"B\" movies and even if at the very start they could have seemed sort of original and somehow enjoyable, once you take an honest critical look at them they're not great films but just good a few of them but no more than that. Sorry again.",
      "review_date": "2021-11-05",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "A classic and arguably the greatest western of all time.The sprawling story set against the backdrop of the civil war is exceptionally well told, brutal, and has plenty of twists to sustain it's near 3 hr runtime.And the score by EnnioA classic and arguably the greatest western of all time.The sprawling story set against the backdrop of the civil war is exceptionally well told, brutal, and has plenty of twists to sustain it's near 3 hr runtime.And the score by Ennio Morricone is one of the most recognisable in movie history.A fitting conclusion to the \"Man with no name\" trilogy.",
      "review_date": "2021-06-20",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "What's left to say about this? Although I find it a bit long, its characters are unique and hilarious, the score is probably one of the best ever made and the plot reaches unseen levels of epicity.",
      "review_date": "2021-06-02",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This movie is amazing. It's like a work of art. You get mesmerized by it and you become so interested on what's going to happen next. I love this movie",
      "review_date": "2021-01-25",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "This is a classic by all means, the score, the visual storytelling, and intense standoffs. This film is definitely a must-see.",
      "review_date": "2021-06-30",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The best western of all time... Sergio Leone was the king of western director and the soundtrack by Ennio Morricone is simply epic!",
      "review_date": "2021-10-11",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "The acting, the script, and the storyline form together to create what is arguably Leone's best work to bring a fantastic end to the \"Dollars\" trilogy featuring Clint Eastwood's iconic \"Man With No Name\".",
      "review_date": "2022-01-19",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I don't care about the weird dubbing situation and I don't care that Angel Eyes is criminally underused. The film is GOATed for the 'Ecstasy of Gold' sequence. The greatest movie score of all time.",
      "review_date": "2023-01-28",
      "source": "metacritic"
    },
    {
      "review_title": null,
      "content": "I respect that the film was ground-breaking and its day and is an important part of film history. But compared to modern works, for me, it does not have much going for it.",
      "review_date": "2022-04-14",
      "source": "metacritic"
    }
  ],
  "num_reviews": 95
}