{
    "rating": 9.3,
    "release_date": "1993-09-16",
    "num_reviews": 50,
    "genres": [
        "Drama",
        "Lgbtq+"
    ],
    "summary": "Douzi (Leslie Cheung) is sent to an operatic school by his mother. Shitou (Fengyi Zhang), also a student at the school, befriends him, and the two endure abuse by the wretched school staff. As they hone their talents, Douzi develops romantic feelings toward Shitou, however his love is not reciprocated. When Shitou is tricked into marrying a young prostitute named Juxian (Gong Li) to save her from her tawdry life, the friendship falters and changes.",
    "reviews": [
        {
            "content": "Facinating and classic movie.Record and show the pathetic Chinese history from Qing dynasty to CCP period",
            "review_date": "2023-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brutal film and released during a brief period of Chinese political opening for the cultural scene. The scope is vast and like the film To Live, it can't really do justice to the enormous events within Chinese society over the fifty or so years in question. There are some brilliant aspects to the film including the female lead who really stood out and owned her scenes. However, it does grow tired in places and Chinese opera is painful to listen to. Decent but not as good as other Chinese classics of the era in my opinion.",
            "review_date": "2022-09-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All performers are great in particular for the leading actress, Gong Li portraying the most \"Hot\" mistress...she has an excellent character in this motion picture, Farewell My Concubine 1993...\n\nNevertheless, singer-actor, Leslie Cheung Kwok-wing is also good within his inside feeling when...",
            "review_date": "2022-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Despite three hours of screentime covering nearly 40 years to develop these characters, substantial scope with set design to match, and a willingness to portray the sordid history of Communist rule in China with an appropriately grim tone, Farewell My Concubine feels rather tame. The affection between Cheung's Douzi and Fengyi's Shitou just doesn't feel convincing enough to carry a film of this kind of ambition; when crises occur and betrayals take place, they seldom carry much in the way of weight (or consequences), robbing the audience of direct involvement. Instead, the film's plot comes off much more melodramatic than it should, becoming more of a checklist of 20th-century Chinese history told through a love triangle and catty dialogue than a deeply affecting drama, despite strong performances from the leads.\n\nStill, it remains ambitious and took genuinely daring leaps with both its incorporation of homosexuality into traditionally conservative Chinese society, and its gruesome depiction of the Cultural Revolution, and deserves credit for each. Plus, it does look pretty darn good. (3/5)",
            "review_date": "2021-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If you have enough nerves, then watch it. The plot is moving slowly; however, it shows almost 50 years of Chinese history. You may even cry at the end.",
            "review_date": "2020-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After I saw this movie, I can't sleep well. Because I've never seen about this directing, and Kaige Chen showed the greatest expression through face looks of actor and actress. Especially, the homosexuality actings of Leslie Cheung. He showed a heartbreaking and pathetic performance. He had had physical and psychological abuse through the academy of Beijing's opera since he was young in the movie's story, this shows that not only Leslie Cheung but also the child actor also improved the film's perfection. Because child actors also showed good performance. it was also great to express the emotions between each character through cinematic props. One prop expresses the situation in the characters' childhood, and the conflict between the characters in China's changing times as they grow physically and psychologically. Surprisingly, it makes the characters in the movie seem to be real historical figures.",
            "review_date": "2020-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest movie I've seen this year",
            "review_date": "2020-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "9 8 9 10 8 10 9 10 9 9 = 91\n2020/01/16\n One of the best Chinese film in film history. Comprising wholesome in the aspect of history, portraying the story by strong affection of characters, Chen Kaige uses a proficient way to create a film and enhances it up to the classics film in Mandarin.",
            "review_date": "2020-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely beautiful but sad story",
            "review_date": "2019-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the Best Chinese Film I have ever seen. Best Script Best Performers Best Director. Best of the Best.",
            "review_date": "2019-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Farewell My Concubine surely is complicated and dated in the area of sexuality and it is a very long movie, but it mostly doesn't feel too long given its solid pace, strong direction and an emotional first act. The story is flawed, but the characters are memorable and the film is so well shot, scored and epic in scope.",
            "review_date": "2019-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most beautiful movie and the actor\nI totally lost track of time ",
            "review_date": "2019-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best movie ever produced in Chinese movie history.",
            "review_date": "2019-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the classics, reminds me how great Chinese cinema could be before the money ruined it. Aged very well",
            "review_date": "2019-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love, friendship, betrayal, and desire.  \n\nDirection and editing are succinct and effective, as the gap between each scene packs as much implication as the scenes themselves.  Characters are genuine and sophisticated, with dilemmas between selfish and selfless acts.   Acting is incredible across the board, so much so you start to wonder if this movie could be the \"chicken or egg\" to one of the protagonists' actual real life circumstances.",
            "review_date": "2017-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing production! One of my favorite film!!!!!",
            "review_date": "2017-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a difficult watch at nearly 3 hours long. There are a few interesting moments but way too many slow and boring bits.",
            "review_date": "2017-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's easy to see why Farewell My Concubine is considered a classic. It is a beautifully shot, sweeping epic with magnetic performances from Leslie Chung, Zhang Fengyi and Gong Li. Unfortunately, it's strengths are also its weakness. While the scenes of the Beijing Opera are spectacular and the relationships between the leads engaging, the film has bitten off a bit more than it can chew. Set over a period of almost half a century, there is just too much ground to cover, even with a generous runtime. The extensive time period covered is further complicated by the fact that the 20th century was such a complex time in Chinese history, with ever shifting political and social changes. As a result, for those who are not already familiar with early 20th century China, much of the film becomes muddled as it jumps from decade to decade. Even for those who are familiar with the underlying context can at times experience a bit of whiplash as the film jumps forward in leaps and bounds, drawing out the small intimate moments and jumping over big events that would set the stage for the film's commentary. It is in these small moments that Farewell My Concubine cements itself as a spectacular work, worthy of every ounce of praise it has recieved. Unfortunately, it seems a little to he'll bent on leaving nothing out, which means the emotional core of the film gets buried under thw burocratic nonsense.",
            "review_date": "2016-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best Chinese movie!",
            "review_date": "2016-06-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Editing/storytelling is a little confusing at times, but regardless the film is a tour de force.",
            "review_date": "2016-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is the best films in China ??????",
            "review_date": "2016-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great performances, epic scope, fascinating historical film.",
            "review_date": "2016-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've waned to see it since I first heard about it in the newspaper when I was like 8 or 9 years old and it did not disappoint. It was very well done and handled the 50 year scope of the story very well. I enjoyed this movie a lot.",
            "review_date": "2015-12-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An intriguing tale, with a fascinating chunk of modern Chinese history serving as the background. Spanning over 50 years, the film tells about the ups and downs of a traditional Peking Opera troupe, and its two stars, from 1924 to 1977. Not only do we see the various political events of the time, but also how the traditional opera and its stars are treated during different eras.\n\nThe two stars, Dieyi and Xiaolou, are brought up and trained to play specific roles - that of concubine and king respectively - in a famous play. Dieyi (Douzi) is trained, or should I say, forced to behave, sing, move and dance like a girl, from a very young age. The two of them share a unique and close bond, and this balance gets affected when a woman, Juxian, enters the picture. Their political naiveté get them into many problems, but it's their properly unresolved love triangle that causes more trouble.\n\nThe lines between fact and fiction are blurred when we realise the similarities between the play and their actual lives. Dieyi's devotion to opera and Xiaolou are as strong as the concubine's devotion to the king. (The lines are blurred even more when Leslie Cheung, bisexual himself, takes his life in 2003) The end is inevitable, as we realise while the story progresses, but it's reached with proper momentum and after an intriguing chain of events.\n\nThe acting by the three leads is really terrific. Leslie Cheung as the female-role playing opera star who's completely devoted to his art, Fengyi Zhang as a talented and playful man who can easily separate his private and work lives, and Gong Li as the prostitute-turned-wife whose shades of determination and compassion keeps us from not having a fixed view of her character. With Chen Kaige's talented direction and Gu Changwei's spectacular cinematography, the movie has many colourful and memorable scenes.\n\nI really liked the movie, and wasn't bored for a single second. The movie deals with so many interesting themes - Modern Chinese history, sexuality, art and its reception, devotion and passion - but yet it somehow makes me feel that it had the potential to be much more compelling. Other than the political events, the characters could have been explored a little more.",
            "review_date": "2015-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies ever made. The plot is multi-layered and complex but drama is deep and the portrayal of the brutalities and hypocrisies of the communists is significant.",
            "review_date": "2015-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While it contains much sadness, the relationships redeem the hardships of the film. A beautifully dense film.",
            "review_date": "2015-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There are epic movies which drag and then there are epic movies with drag. This one's the latter.",
            "review_date": "2015-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Farewell my concubine is a landmark film in Chinese cinema and one of the Chinese movie that is able to combine great story telling with amazing cinematography. It reaches into the heart and soul of being Chinese during the tumultuous period of China, and it is done using a famous Chinese folklore that revolves around the Opera gangs. Leslie Cheung's performance in the film is one of the best I've ever seen in any movie, his own persona shines throughout the film, portraying a characters that is resilient but at the same time vulnerable. His love story with Duan is sad, touching and one for the ages. This movie is just amazing, unfortunately Chen Kaige fails to reach this similar height in his later films.",
            "review_date": "2014-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "27/30. Very moving depiction, though I expect the extended opera scenes and the extensive historical and theatrical references would be challenging for (if not wasted on) Western audiences.",
            "review_date": "2014-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A love triangle that spans decades. But can any survive? A flamboyant opera that thrills its audience. The performances by its leads and the supporting children together with the poetic screenplay gives the movie a near perfect score.",
            "review_date": "2014-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I sort of overall liked it, but the movie was kind of slow, and it didn't get me super involved in the characters.  I think there was some sort of subtle Asian-ness going on that I somehow missed, and understanding it would have made me appreciate what was happening more.  I also was kind of disappointed that all of the characters were really just terrible people.",
            "review_date": "2014-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How long has it been since I have seen such a beautiful film like this one?\n\nFull review at filmbroadcaster.weebly.com",
            "review_date": "2014-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of those epic films that similar to the Chinese film \"To Live\" spans the decades of tumultuous 20th century Chinese history from the Warlord period through WWII and into the Cultural Revolution.  As in the film \"To Live\" this film also has another great performance from Gong Li, but playing a very different role here.  Nevertheless, still brilliant in her performance and strong performances all around.  In the foreground of the story is a somewhat complex friendship that has its roots in the Warlord period and is tested repeatedly by numerous violent and political upheavals, but still manages to endure into the year 1977.",
            "review_date": "2014-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very rich story, very rich characters",
            "review_date": "2014-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The length of this film felt unnecessary. Nevertheless it was epic. Leslie is mesmerising, not to be missed by Leslie Cheung fans.",
            "review_date": "2013-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My most favorite epic Chinese movie ever.",
            "review_date": "2013-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Honestly, I think I am too young to fully appreciate this movie for what it is. It is a beautiful epic love story about three people, their love triangle, and its ill fate... But because their love story is so deeply rooted into China's political history throughout the 1900s, I felt like I wasn't able to fully appreciate the movie the way it should be appreciated... Idk. Perhaps if I was older - or just more educated and less ignorant - and understood the significance of each of the events that happened in the movie, I would have enjoyed this film more. But, that said, all three actors did a friggin' amazing job. Leslie Cheung was brilliant. His character just goes through the story so painfully, his ending was long called for. But yeah. Beautiful story etc., but I couldn't relate to the plot. Oh, and it was really effing long, Jesus.",
            "review_date": "2013-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most interesting love stories ever put to film. Its a movie I know I will watch many times for years to come.",
            "review_date": "2013-05-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Farewell my Concubine is undoubtedly one of the greatest movies ever made. It spans throught 5 decades of chinese history, and follows one of the most interesting characters I've ever seen. It's costumes are spectacular and the cinematography is brilliant. What makes this one of the greatest movies ever made is the acting. For me, there were no actors in this movie, only the characters. It is a class of acting that you seldom see in Western cinema. If you won't watch the film on the heart-wrenching story alone, then watch it for one of the greatest performances of all time by Leslie Cheung. \n\nThis is the story of two men, Douzi (Leslie Cheung) and Shitou (Fengyi Zhang), who met as apprentices in the Peking Opera, and remained in contact for over 50 years. Both of them grew up to star in the opera 'Farewell My Concubine,' where Douzi played the Concubine and Shitou played the King of Chu.\n\nOver the years we see the era of the Warlords (1920s), the Japanese invasion (mid 1940s), the retaking of China by the nationalists (late 1940s), and then the communist era of Mao Zedong. This epic story spans all the way to 1977, and not once does the excitement or attachment to the story falter.\n \nLeslie Cheung truly embodied this character and brought it to life. It was all in his eyes, every emotion that you could imagine. The anger, frustration, terror, love, and heartbreak all came across plainly on his face. There hasn't been a performance that moved me this much in a long time. From losing the man he loves to overcoming an opium addiction, every single movement, word, and expression was perfect.\n \nLi Gong also gave a breathtaking performance as a former prostitute and the wife of Shitou. Honestly, there is nothing this woman can't do. She's able to display such strength, and such fragility, all wrapped up into one character. Together, Gong and Cheung have brilliant chemistry as two 'women' who want the same man. \n\nThere is plenty of brutality in this film, mixed with plenty of tenderness. It's not completely tragic, for there is a lot of hope in these characters. You cannot describe this film with a genre or a word. It's more than a period drama, or a romance, or a tragedy.\n \nThese characters are interesting enough from a psychological perspective alone. If there's one thing I love Farewell My Concubine, it's that it begs you to discuss it afterwards. It leaves you to connect the dots when it comes to motives, feelings, and symbolism.\n \nI was thrilled from start to finish with this masterful film. It truly is one of the greatest movies ever made. Schindler's List may have won Best Picture at the Academy Awards during the same year, but for me this is a film worthy of that title. There's nothing I could fault about Farewell My Concubine. I recommend this movie to anyone who is interested in history and psychology.",
            "review_date": "2013-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story of China joining the modern age seen through the lives of two principal performers of the Beijing Opera.  Cruel, majestic, courageous, sweeping, and glorious, this is not to be missed.  Of course, the singing can only be an acquired taste, but this is still about the story, magnificently told.",
            "review_date": "2013-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A film exploring Sino-Japanese hostility and the Cultural Revolution, homosexuality, personal identity,abandonment, love, lust, the strange and brutal world of Peking Opera and so much more and doing it all in such a beautiful package. While it may be very long, I never felt it was too long. Be warned, this film will not make you feel good for most of its running time!",
            "review_date": "2012-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "well it was nice but too much violence in the beginning and from the poster i thought it's about the story between a man and woman ..it's quite not.....it's well acted but couldn't get involved emotionally in this story",
            "review_date": "2012-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply Glorious! the first Asian movie that really open my eyes ti explore about this very industry further, still the best to date",
            "review_date": "2012-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Epic and devastating, this film captures a time period with so much sincerity that one feels his heart aching once it is over........",
            "review_date": "2012-09-01",
            "source": "rt",
            "lang": "en"
        }
    ]
}