{
    "rating": 8.8,
    "release_date": "1993-02-12",
    "num_reviews": 670,
    "genres": [
        "Romance",
        "Comedy"
    ],
    "summary": "Phil (Bill Murray), a weatherman, is out to cover the annual emergence of the groundhog from its hole. He gets caught in a blizzard that he didn't predict and finds himself trapped in a time warp. He is doomed to relive the same day over and over again until he gets it right.",
    "reviews": [
        {
            "content": "Entertaining Yet Predictable.\n\nGroundhog Day is an entertaining and enjoyable film that I would recommend, though it falls short in a few areas, which causes me to deduct one and a half stars. Firstly, while the movie provides laughs and amusement, it doesn't offer much in terms of thought-provoking storytelling or creativity. Secondly, Phil's personality transformation appears rather sudden and lacks a clear motivation for the change. Lastly, the plot is fairly predictable, following a familiar redemption arc. Despite these shortcomings, the film remains a good watch, especially for those seeking a lighthearted comedy.",
            "review_date": "2023-04-18",
            "source": "rt"
        },
        {
            "content": "This is becoming a yearly re-watch for me. This and scrooged are neck and neck for the best Bill Murray movie in my opinion. The moral of the story here is great. And the jokes are timeless, no pun intended. It's not exactly perfect, but it's pretty great. 8.75/10",
            "review_date": "2023-03-07",
            "source": "rt"
        },
        {
            "content": "Almost as funny as what about bob",
            "review_date": "2023-02-26",
            "source": "rt"
        },
        {
            "content": "What is my favorite Bill Murray movie? Ghostbusters? Stripes? Scrooged? *ahem* Garfield? Sorry, something got caught my throat. Well, if the day is any giveaway, it's Groundhog Day. This movie is charming on many  levels. Murray is at his peak, in my opinion, as the almost Scrooge-esque, egotistical news reporter forced to relive the Groundhog Day festivities until he learns to be a better person. If you've never seen this movie, first, I'm jealous and second do yourself a favor and watch it before the day ends.",
            "review_date": "2023-02-23",
            "source": "rt"
        },
        {
            "content": "This perfectly shows what you be able to do with days you actually hate... you start to love them, while changing your personality to a good one. Great movie, with some laughters and a nice message.",
            "review_date": "2023-02-10",
            "source": "rt"
        },
        {
            "content": "I did not expect a rom-com out of this. That's something that cinemas have been missing since the late 2010's : romantic comedies. But with this being a rom-com, the overall bland/deadpan sarcasm of Bill Murray and the cheesey score I can see how this film would be a cult classic for females everywhere, but definitely not for me as a male who does not delude myself with the threat of the sweetest of illusions : romance.\n*I happily walked out after Murray's character stayed up 'til 6 am reading to his love interest. The 2020's are honestly better off without the rom-com in retrospect. Capatlist society needs more reality if it is to survive.",
            "review_date": "2023-02-05",
            "source": "rt"
        },
        {
            "content": "One Of The Feel Good Comfort Movies That I'll Love To Re-Watch Every Year In Groundhog Day. Very Heartwarming Story, Really Great Humor, And Memorable Characters. R.I.P. Harold Ramis.",
            "review_date": "2023-02-03",
            "source": "rt"
        },
        {
            "content": "The way I define a classic movie is simple. You have watched the same movie multiple times, and still watch it every time it's on. Groundhog Day is a genuine, 5 star classic, thanks to Bill Murray's best role to date. Great acting, a unique plot and lots of laughs. I guarantee that future generations will be watching this flick long after we are gone!",
            "review_date": "2023-02-03",
            "source": "rt"
        },
        {
            "content": "Loved it at first release and still fantastic after 30 years.",
            "review_date": "2023-02-03",
            "source": "rt"
        },
        {
            "content": "A profound movie, wrapped in Bill Murray humor.   The only thing that changes is Mr Murray's character attitude towards life & other folks.  Once he embraces positivity, curiosity and service to others his life changes for the better.",
            "review_date": "2023-02-02",
            "source": "rt"
        },
        {
            "content": "Funny, exciting and an incredible way to pass the time! I definitely recommend it.",
            "review_date": "2023-01-15",
            "source": "rt"
        },
        {
            "content": "At first, I heard of Bill Murray as a comedian. The title wasn't intriguing at first for me to watch, but after seeing it, it made sense about why this film is called Groundhog Day. There are quite a few laughing moments and the chemistry between Bill Murray and Andie MacDowell is present and natural. Murray did a great job in acting his character as someone who didn't have a life, but then found out what he wanted in a believable manner. Andie MacDowell added more essence to the film with her influencing Bill's character about thoughts and passion. A refreshing film to watch.",
            "review_date": "2022-12-22",
            "source": "rt"
        },
        {
            "content": "A clever, funny film that you will never really forget. One of the best movies of all time.",
            "review_date": "2022-12-16",
            "source": "rt"
        },
        {
            "content": "\"Groundhog Day\" is a must-see film that portrays the wonderful life of Phil Connors and his adventures on Groundhog Day. Stuck on re-living the exact same day, he distracts himself with heroics and antics, building the right relationships and becoming the next world genius.",
            "review_date": "2022-12-11",
            "source": "rt"
        },
        {
            "content": "I just watched it again about a month ago. Still very funny. It was totally hilarious the first go around. \n\nI cannot believe that, as I write this, the audience rating is only 88%. That is crazy. I almost always give higher weight to the audience rating, but this is definitely a 100% comedy. Of course, there are perfectionists and I would certainly understand if the audience was only 97%. But the fact that the critics, who are paid perfectionists, are 97% should tell you something.",
            "review_date": "2022-10-24",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is a wonderful movie. Essentially it is a one-joke comedy, but what makes Groundhog Day so delightful is that whereas it could have been derivative and predictable, the film is always full of life and full to the brim with fresh ideas. The script is a delight, always funny, quotable and witty, while the story has a surprisingly refreshing concept and several great scenes.\n\nThe cinematography is beautiful, and the locations and production values are consistently striking. Also Harold Ramis's direction is excellent, the pace rarely lags and all the characters are credible. The acting is wonderful too, and by far one of the best assets of this film. Bill Murray gives one of the best performances of his career, Stephen Tabolowsky gives a superb turn as the nerdy insurance salesman and the lovely Andie McDowell has never been better.\n\nIn conclusion, a delightful film that works on all levels. 10/10 Bethany Cox",
            "review_date": "2022-09-21",
            "source": "rt"
        },
        {
            "content": "Probably the most clever script I have ever watched. A swiss clock. A masterful lesson in writing... and the acting, the pace, the cinematography...al is top notch\n\nNo surprise is considered one of the greatest movies ever made by many people.",
            "review_date": "2022-09-11",
            "source": "rt"
        },
        {
            "content": "Bill Murray’s best movie ever. Yes it is even better than Ghostbusters.",
            "review_date": "2022-08-14",
            "source": "rt"
        },
        {
            "content": "I don't even like romantic comedies……but this movie is incredibly watchable for both guys & girls! I bet you watch it more than once…it's that good! Enjoy!",
            "review_date": "2022-08-14",
            "source": "rt"
        },
        {
            "content": "Ah…………Groundhog day… ...simply a perfect movie.... …Bill Murray and Andie McDowell give this story pathos, humor and soul. Can't recommend it enough.",
            "review_date": "2022-08-14",
            "source": "rt"
        },
        {
            "content": "This is a great classic bill murray movie its great fun.",
            "review_date": "2022-08-14",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is a movie for the whole family. Bill Murray and Andie MacDowell are ideal for this movie.",
            "review_date": "2022-08-14",
            "source": "rt"
        },
        {
            "content": "Bill Murray being Bill Murray in another lighthearted comedy from one of the best eras in comedy film yet. It's comedy could be considered a bit dated as time has went on, but Murray proves again why he's considered a master of the comedy actor craft. They nailed the length on this film, it's not long enough to be a drag but long enough to get plenty of great quips and witty ideas in. Definitely a classic.",
            "review_date": "2022-06-27",
            "source": "rt"
        },
        {
            "content": "An original feel good movie with an amazing performance by Bill Murray.",
            "review_date": "2022-06-06",
            "source": "rt"
        },
        {
            "content": "One of my favourite all time movies which has a deeper message that the majority may miss.  When Billy Murray gets stuck in a time warp so to speak he becomes a case study of paradoxically of both the very rich, privileged and talented in our society and those living not by choice at the bottom of it.\n\nThe very poor and under privileged often feel they have no future and no hope and nothing to lose.  Every day is the same for them because they have no achievable goals to drive them on, every day is a battle for survival.\n\nA person living at the top may often feel the own way. They have made it so what do they do next.  They feel little consequences for their actions because they believe their wealth will protect them.  They realise they can't climb any higher. \n\nBill Murray when stuck in his timewarp goes through different stages.  First of all it is to live life with no consequences taking whatever he wants, then he gets bored with that and becomes disillusioned and self destructive. Finally he reaches the stage of enlightment where he realises his greatest happiness which he never gets tired off day after day is the fullfilment of helping others.\n\nThose stages are so common seen with people living at the bottom and top of society but often they don't progress beyond the second stage.",
            "review_date": "2022-06-06",
            "source": "rt"
        },
        {
            "content": "Witty, lighthearted, magical. This is a representation of everything you should expect from a 90s \"romcom\" (in a way it is a romcom). The quips are eccentric and executed at perfect timing. The movie is just the perfect length. The plot may seem dark and predictable as a first guess, but upon watching the movie one is left dazzled. The story contains just the right amount of comedy, drama, and romance (and of course fantasy). Also, very often does one know what the protagonist will do next; this movie keeps one wondering what he's thinking, how he'll change this, what he'll do to solve that… There's always something new when you least expect it. Bill Murray looks like he was made for the role and plays it so naturally. Andie MacDowell is vivacious and simply breathtaking. The ending is given justice and doesn't seem rushed at all; very few movies give the ending the dedication it deserves like this. This is one of the movies I would see again (and they aren't that many). Several have sure given me a good feeling, but the way I felt after watching  Groundhog Day can only be compared to the way I did after Singin' in the Rain. That's how astounding Groundhog Day is.",
            "review_date": "2022-06-01",
            "source": "rt"
        },
        {
            "content": "Hi bill what time is it I think I'm lost would you help me get home.",
            "review_date": "2022-05-24",
            "source": "rt"
        },
        {
            "content": "Though predictable at times, this movie is nothing short of hilarious. It has heartfelt and very clever moments, and it especially benefits from Bill Murray's amazing performance!",
            "review_date": "2022-05-01",
            "source": "rt"
        },
        {
            "content": "boring movie, with a lot of cliches",
            "review_date": "2022-04-04",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is a wonderful movie. Essentially it is a one-joke comedy, but what makes Groundhog Day so delightful is that whereas it could have been derivative and predictable, the film is always full of life and full to the brim with fresh ideas. The script is a delight, always funny, quotable and witty, while the story has a surprisingly refreshing concept and several great scenes.\n\nThe cinematography is beautiful, and the locations and production values are consistently striking. Also Harold Ramis's direction is excellent, the pace rarely lags and all the characters are credible. The acting is wonderful too, and by far one of the best assets of this film. Bill Murray gives one of the best performances of his career, Stephen Tabolowsky gives a superb turn as the nerdy insurance salesman and the lovely Andie McDowell has never been better.\n\nIn conclusion, a delightful film that works on all levels. 10/10 Bethany Cox",
            "review_date": "2022-03-14",
            "source": "rt"
        },
        {
            "content": "It revolves around Bill Murray, who shines with an outstanding performance. The comedy was nice, but for me as someone from generation z it was a bit old (with respect). Other than that, the core message is easily understandable and admittable, the whole story arc satisfying, and in conclusion, it is a nice upbeat movie.",
            "review_date": "2022-03-01",
            "source": "rt"
        },
        {
            "content": "This is a great comedy that i watch every year in February. It has a lighthearted tone, in a situation that at times can be extremely dark. Bill Murray is at his best.",
            "review_date": "2022-02-19",
            "source": "rt"
        },
        {
            "content": "Absolute classic that is a much watch for everyone.  Bill Murray is fantastic.",
            "review_date": "2022-02-17",
            "source": "rt"
        },
        {
            "content": "Definitely Ramis' and Murray's best film. Everything in this story unfolds so perfectly.",
            "review_date": "2022-02-10",
            "source": "rt"
        },
        {
            "content": "One of the very best movies ever.",
            "review_date": "2022-02-09",
            "source": "rt"
        },
        {
            "content": "Bill Murray is brilliant and this script is as clever as the first Back to the Future script which says a lot. This is a Classic!",
            "review_date": "2022-02-07",
            "source": "rt"
        },
        {
            "content": "if you haven't seen this movie, you're not human",
            "review_date": "2022-02-01",
            "source": "rt"
        },
        {
            "content": "All time classic! Classic performances from Bill Murray and Andy McDowell.",
            "review_date": "2022-01-05",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies I would give it 10 stars if I could ",
            "review_date": "2021-12-31",
            "source": "rt"
        },
        {
            "content": "Timeless classic.  One of the best movies ever made.",
            "review_date": "2021-12-06",
            "source": "rt"
        },
        {
            "content": "In a beautifully apt way, it's a movie I enjoy seeing time and time again.",
            "review_date": "2021-11-20",
            "source": "rt"
        },
        {
            "content": "seen it over 100 times and it only gets better.",
            "review_date": "2021-11-20",
            "source": "rt"
        },
        {
            "content": "Hilarious in moments, but the story does drag on and on and on (intentionally, I assume) to a point of too much annoyance for its own good.",
            "review_date": "2021-11-10",
            "source": "rt"
        },
        {
            "content": "A must see classic starring the lovable Bill Murray. It's hilarious, entertaining and still has a very serious edge to it. Honestly one of the best movies of all time and not afraid to say it. If you haven't seen it yet - please get it done",
            "review_date": "2021-11-01",
            "source": "rt"
        },
        {
            "content": "Funny and deep. A classic.",
            "review_date": "2021-10-21",
            "source": "rt"
        },
        {
            "content": "Bill Murray lifting an interesting but limited premise to a classic.",
            "review_date": "2021-10-16",
            "source": "rt"
        },
        {
            "content": "In a time when, for a lot of us, it seems like Groundhog Day is an every day occurence (for others, definitely not so much) this seems like a reasonable choice, even though I'm sure everyone has seen it. It's a terrific premise, produced with heart and humour, and to boot, Andie MacDowell doesn't have any misconceptions about the weather. Bill Murray is the perfect foil for Phil Connors, the man who finds himself reliving the same day over and over. There are benefits of course, but even as dark as the times currently seem, it's probably not a life you want to be living in the long term. So just watch Bill Murray struggle with it for a couple of hours instead.",
            "review_date": "2021-08-19",
            "source": "rt"
        },
        {
            "content": "Endlessly quotable. Probably best Bill Murray comedy.",
            "review_date": "2021-08-13",
            "source": "rt"
        },
        {
            "content": "First half was kinda slow and predictable if you've watched this type of movie before but the second half just felt really nice for the main character and you can see his development clearly.",
            "review_date": "2021-08-12",
            "source": "rt"
        },
        {
            "content": "The first time you see this you will think it's stupid.  This one has to be watched again to pick up on the underlying fun.",
            "review_date": "2021-07-01",
            "source": "rt"
        },
        {
            "content": "Bill Murray & Harold Ramis create supergems.",
            "review_date": "2021-06-10",
            "source": "rt"
        },
        {
            "content": "A Good Rom/Com with Bill Murray 8/10",
            "review_date": "2021-06-10",
            "source": "rt"
        },
        {
            "content": "A remarkable movie which makes a very good job in showing you the psychology of a man who trapped in the same day. The balance of humor and seriousness was well adjusted that it never bores you.",
            "review_date": "2021-05-08",
            "source": "rt"
        },
        {
            "content": "Just an alright movie.",
            "review_date": "2021-04-22",
            "source": "rt"
        },
        {
            "content": "Interesting to see Bill Murray play such a sarcastic ass. He's acting as if he's an exec or something. He's just real bitter towards life but of course with that Bill Murray charm we all know and love, its hard to hate his character. This is like Twilight Zone meets Truman Show. I can already tell that the whole reason for him having to relive the same day is so that he can learn to become a better person, be nicer to others and figure out what it is he should actually be doing. \n\nI love this movies humor. All the colorful and charming characters, even the extras like the two armored bank truck guys who were kind of like The Stooges. Murray's really clever with his humor. Holy shit! I couldn't believe that was Michael Shannon! He's so young and charismatic. And Andi McDowell, she's really cute and charming. Has a very genuine feel about her I find attractive. She's almost angelic, like some kind of fun goddess or something lol. \n\nDefinitely kind of dark when he kills himself everyday using different methods. I mean what would you do if you were in that situation? It's like a nightmare you have to relive every day. But with everything in life, it's the way you view it - your out look on life. The movies main message and moral is that you have to be honest and true to yourself, and to also learn from your past mistakes so that you can better yourself. Groundhog Day asks a rather interesting question: If you had to relive the same day over and over again, how would you do it? So beautiful the way he tries to make that old man's life the best since he knows he's going to die. Buying him soup and a whole meal. Really sweet movie that wears its heart on its sleeve. A hilarious feel-good romantic comedy with some clever philosophical and spiritual themes. I loved this movie and I'd watch it again in a heartbeat!",
            "review_date": "2021-04-21",
            "source": "rt"
        },
        {
            "content": "I liked it in the past but I just couldn't get into it in 2021. I don't think it has aged very well. It's a lot slower than I remembered.",
            "review_date": "2021-04-03",
            "source": "rt"
        },
        {
            "content": "One of Murray's best and delightfully funny with a romantic touch.",
            "review_date": "2021-03-31",
            "source": "rt"
        },
        {
            "content": "Watched this movie 100\nTimes!Great classic!",
            "review_date": "2021-03-27",
            "source": "rt"
        },
        {
            "content": "Maybe it's the fact that it's the first time I've seen this and that I've already seen any number of time loop movies the reason why I didn't fully enjoy it.\n\nMaybe they were pioneers on this formula, but for me is nothing new and to be honest, I'm not a huge fan of this time loop thing. Every single movie is the same. This unbearable and annoying guy (in this case Bill Murray) wakes up every morning and it's the same day as yesterday. The clock reaches a certain time, the loop starts again, with one or more characters retaining the memories from the previous loop. He starts being a good guy, enjoying life, being nice to people, and the time loop stops. \n\nYes, there are some special moments, laughs, Bill Murray being annoying until he's not, yes, you will have a good time, but definitely can't consider this one of my favorites (as I read much of you do).",
            "review_date": "2021-03-16",
            "source": "rt"
        },
        {
            "content": "There's a reason Groundhog Day was the opening-night film in 2003 for the Museum of Modern Art's \"The Hidden God: Film and Faith\" series. No matter what god we believe in, there is a spirituality about Groundhog Day that taps into our core beliefs.\nAnd no matter how terrible Phil acts or what he does to himself -- to the point of trying to kill himself -- it's still funny, too.\nIt's a combination that few movies have ever really captured.",
            "review_date": "2021-03-04",
            "source": "rt"
        },
        {
            "content": "I didn't watch this movie until 2021 and I didn't get what I expected. I found myself crying multiple times throughout the movie. I thought it was going to be a silly 90's Rom-Com but it reached me more deeply than I imagined it would. This is now one of my favorite movies of all time. It was thoughtful, funny, heartwarming, and thoroughly enjoyable.",
            "review_date": "2021-02-27",
            "source": "rt"
        },
        {
            "content": "The movie is so funny because Bill Murray keeps living Groundhog day!!!!!!!!! Also, he is the movie's funniest star!!!!!!!!!!!!!!!!!!!",
            "review_date": "2021-02-16",
            "source": "rt"
        },
        {
            "content": "Love it so much. A great feel-good movie.",
            "review_date": "2021-02-15",
            "source": "rt"
        },
        {
            "content": "perpetual hate, perfect",
            "review_date": "2021-02-15",
            "source": "rt"
        },
        {
            "content": "Delivering lots of laughs, thoughtfulness and romance, this inventive classic is bound to keep you entertained throughout.",
            "review_date": "2021-02-11",
            "source": "rt"
        },
        {
            "content": "No groundhogs were injured in making this movie.",
            "review_date": "2021-02-11",
            "source": "rt"
        },
        {
            "content": "Wonderful to see again on full screen!",
            "review_date": "2021-02-09",
            "source": "rt"
        },
        {
            "content": "Good movie to rewatch on groundhogs day ",
            "review_date": "2021-02-06",
            "source": "rt"
        },
        {
            "content": "A really original comedy, with a nice performance from Bill Murray. It establish a good equilibrium between romance and comedy, having some fiction to improve them.",
            "review_date": "2021-02-05",
            "source": "rt"
        },
        {
            "content": "I guess this one is a classic for a reason! I thoroughly enjoyed the vast majority of this film, and Bill Murray's performance is like 80% of the cause. He's just so damn funny; this movie would never work with a different actor. The plot is interesting and a little silly, and it's fun to watch Phil's spiral into ridiculousness as he tests the rules of the universe. Unfortunately the rest of the cast can be a little wooden at times. Also, the ending felt a little unrealistic as Phil's behavior didn't really change that much, so it felt more like he just got \"lucky\" by getting the girl this one time, not that he had actually recognized his faults. But that's a minor gripe in a very, very entertaining film.",
            "review_date": "2021-02-04",
            "source": "rt"
        },
        {
            "content": "I just dont remember all the laughs from watching at home. We thoiroghly enjoyed being together in the theater. Great laughs!",
            "review_date": "2021-02-03",
            "source": "rt"
        },
        {
            "content": "Certainly a strange movie that has been remade to poorer effect, Groundhog Day is an understated classic.  At heart a morality tale with a brilliant storyline, it is cloaked in actual humor and entertainment, vs some of the more preachy crap out there.  I always thought he was overrated, but Bill Murray lives up to his reputation as the loveable asshole here.  There are no huge special effects or big budget extravaganzas, but instead we see a jerk get his come-uppance in a very odd sort of way, and everyone is better for it.",
            "review_date": "2021-02-03",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies",
            "review_date": "2021-02-03",
            "source": "rt"
        },
        {
            "content": "This movie is almost 30 years old and yet so many of the jokes are still hilarious.",
            "review_date": "2021-02-03",
            "source": "rt"
        },
        {
            "content": "I feel like Ive seen this before...",
            "review_date": "2021-02-03",
            "source": "rt"
        },
        {
            "content": "I keep watching this movie over and over as if I were stuck in a never ending vicious cycle! Please HELP!!!",
            "review_date": "2021-02-03",
            "source": "rt"
        },
        {
            "content": "One. Damn. Good. Movie.",
            "review_date": "2021-02-03",
            "source": "rt"
        },
        {
            "content": "Your review will help others decide whether to watch.",
            "review_date": "2021-02-03",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is a clever and funny film that showcases Bill Murray's comedic and dramatic talent.",
            "review_date": "2021-02-03",
            "source": "rt"
        },
        {
            "content": "Still a classic. Just bought on prime so I can watch anytime.",
            "review_date": "2021-02-03",
            "source": "rt"
        },
        {
            "content": "Great movie that doesn't miss a beat. It is so consistent throughout and shows strong character development. It is a must see.",
            "review_date": "2021-02-02",
            "source": "rt"
        },
        {
            "content": "Absolute classic. Best holiday movie about the best holiday.",
            "review_date": "2021-02-01",
            "source": "rt"
        },
        {
            "content": "Masterpiece, whatever your taste is you'll love it.",
            "review_date": "2021-02-01",
            "source": "rt"
        },
        {
            "content": "A great film with a great story and great laughs!",
            "review_date": "2021-02-01",
            "source": "rt"
        },
        {
            "content": "Your review will help others decide whether to watch.",
            "review_date": "2021-01-31",
            "source": "rt"
        },
        {
            "content": "I just love that movie.  I matter how many times I’ve seen it, it somehow is always amazing!",
            "review_date": "2021-01-30",
            "source": "rt"
        },
        {
            "content": "An excellent movie that really showcases Bill Murray’s comedic ability.",
            "review_date": "2021-01-30",
            "source": "rt"
        },
        {
            "content": "Bill Murray at his absolute best, hilarious witty and dark humor!",
            "review_date": "2021-01-29",
            "source": "rt"
        },
        {
            "content": "This is one of the least-dated movies to be deemed a classic that I have yet seen. Most films with such a moniker have aspects of timelessness but they really seemed to go out of their way to make sure this one wouldn't be heavily identified as an early '90s movie. The comedy only ever reached the level of chuckle-worthy rather than full-blown belly-laughs, but they did a good job with their jokes per minute rate. The movie succeeds in spite of this because the drama & plot premise were of a very high quality, with both Murray & MacDowell putting on perhaps career-best performances. MacDowell had a Louis-Dreyfus air about her in this that obfuscates her origin as a model, hired as an actress for her looks. My wife suspected going into this that she had seen enough later derivatives of the time loop plot that this would be uninteresting but ultimately admitted that this far exceeded her expectations. Kudos!",
            "review_date": "2021-01-14",
            "source": "rt"
        },
        {
            "content": "A better study of the human condition than Blade Runner.",
            "review_date": "2021-01-01",
            "source": "rt"
        },
        {
            "content": "I love this movie.  Watching it over and over again just seems right.",
            "review_date": "2020-12-30",
            "source": "rt"
        },
        {
            "content": "Da un aire fresco y divertido con un mensaje con buena ejecución, y si es eso una buena película para pasar el rato y pensar un poco acerca de las decisiones humanas",
            "review_date": "2020-12-29",
            "source": "rt"
        },
        {
            "content": "Everyone should watch this movie at the end of 2020. It's warm, sweet and very funny in parts. This movie hasn't aged at all.",
            "review_date": "2020-12-29",
            "source": "rt"
        },
        {
            "content": "It's always fun to watch Bill Murray go slightly crazy searching for love and meaning, and this movie is one of the best versions of that. I often find Andie MacDowell's acting irritating, but here she is almost endearing.",
            "review_date": "2020-12-29",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is an incredibly original and hilarious fantasy comedy movie that delivers one of actor Bill Murray's funniest performances. It's mean-spirited yet heartwarming humor and storytelling make for an experience I'm sure people won't mind repeating.",
            "review_date": "2020-12-29",
            "source": "rt"
        },
        {
            "content": "Bill Murray is great as the local town weatherman who slowly loses his sanity when he unexpectedly repeats the same day over and over and over again. Bill’s Trademark funniness, is what makes the movie and his funniest moments is when he constantly gets slapped in the face, arrested, killed, and then has to repeat the day in those alternating scenarios. Also he is apparently not a Sonny and Cher fan lol. This movie is a Classic!",
            "review_date": "2020-12-27",
            "source": "rt"
        },
        {
            "content": "Great performance from Bill Murray and a tremendous script make for a wonderful, fun, amazing film. Beautifully directed and surprising to the viewer, still a great film even after multiple viewings.",
            "review_date": "2020-12-14",
            "source": "rt"
        },
        {
            "content": "Made me laugh and also the love's not missing.",
            "review_date": "2020-12-13",
            "source": "rt"
        },
        {
            "content": "Such a great movie.   Love the lesson here and the fun elements and sometimes I wish I could do things over and over until  I got them right.  Then time could move on.",
            "review_date": "2020-12-03",
            "source": "rt"
        },
        {
            "content": "Such an original, touching movie with so many valuable life lessons. \nMakes me want to start every day with a better attitude and lots of love!  💚 💚 💚",
            "review_date": "2020-12-01",
            "source": "rt"
        },
        {
            "content": "A bit too sugary for my liking, but definitely interesting and entertaining",
            "review_date": "2020-11-10",
            "source": "rt"
        },
        {
            "content": "An entertaining film with excellent acting and direction, with however a decidedly sexist subtext. Phil Connors is fated to relive the same day over and over again until he learns how to be a better person. Initially he uses information gained on successive groundhog days to pretend that he was at school with a woman called Nancy, who naturally then has sex with him. On the same day. He  then uses the same technique to discover what his co-worker Rita likes and doesn't like and uses that to ingratiate himself with her next time round by pretending to share the same interests and values. Whereupon she falls in love with him, despite one of the most horrendous mullets ever seen on screen. All on the same day, don't forget. The culminating party scene abandons any pretence at logic, with Phil now a brilliant pianist, which must have taken several thousand groundhog days to accomplish, and his piano teacher proudly announcing that he is her pupil, although she has of course only met him that day. Still, none of it is really meant to make sense, it's good fun, and it's worth watching for Andie MacDowell's enchanting performance alone.",
            "review_date": "2020-10-27",
            "source": "rt"
        },
        {
            "content": "One of the comedy's you have to see",
            "review_date": "2020-10-25",
            "source": "rt"
        },
        {
            "content": "Classic Bill Murray movie! Laughed from beginning to end. True comedy genius. We don’t see many comedies like this anymore. ",
            "review_date": "2020-10-08",
            "source": "rt"
        },
        {
            "content": "This movie is a masterpiece.\n\nIt is the pinnacle of film-making, with no perceptible flaws.\n\nShort, succint, taut, original and impactful film about a man who repeats the same day until he acheives perfection along with the movie.",
            "review_date": "2020-09-28",
            "source": "rt"
        },
        {
            "content": "I've watched this movie over an over and over again through the years. The best comedy ever made!",
            "review_date": "2020-09-23",
            "source": "rt"
        },
        {
            "content": "On February 1, TV weatherman Phil Connors (Bill Murray) reassures his Pittsburgh viewers that an approaching blizzard will miss Western Pennsylvania. Alongside his producer Rita Hanson (Andie MacDowell) and cameraman Larry (Chris Elliott), Phil travels to Punxsutawney for his annual coverage of the Groundhog Day festivities. Phil makes no secret of his contempt for the assignment, the small town, and the \"hicks\" who live there, asserting that he will soon be leaving his station for a new job. On February 2, Phil awakens in the Cherry Tree Inn to Sonny & Cher's \"I Got You Babe\" playing on the clock radio. He gives a half-hearted performance reporting on the groundhog Punxsutawney Phil and the festivities. Despite Phil's prediction, the blizzard strikes the area, preventing all travel out of the town. Phil desperately searches for a way to leave but is forced to spend the night in Punxsutawney. The next morning, Phil wakes again to \"I Got You Babe\" and the same DJ banter on the radio. Phil experiences the previous day's events repeating exactly and believes he is experiencing deja vu. He again unsuccessfully attempts to leave the town and retires to bed. When he awakes, it is again February 2. Phil gradually realizes that he is trapped in a time loop that no one else is aware of...\n\n\"Groundhog Day\" was seen as a significant change from the previous works of Murray and Ramis. Kenneth Turan appreciated it as a gentle, endearing, and smaller-scale film. Hal Hinson called it the best American comedy since 1982's Tootsie (also featuring Murray). He said that Groundhog Day demonstrated Ramis's capable comedic timing, and offered a clever plot without pretension. Critics compared it to a combination of It's a Wonderful life and the surreal science-fiction/horror television series The Twilight Zone (1959). Roger Ebert compared it to the Murray-starring Christmas-comedy Scrooged (1988), featuring a similar transformation from selfish to selfless. He said that where that film offered a \"grim discontent\", Groundhog Day offered optimism. Critics agreed that the film had an obvious moral, but disagreed on its presentation. Desson Thomson said that the film was initially intriguing but deteriorated into a Hollywood-style morality tale. Conversely, Turan said that Groundhog Day started as a traditional Hollywood story, but is earnest enough to convert the audience by the end, and has a \"romantic innocence\" that prevents it becoming formulaic. Hinson said that the moral core of the story is never presented in a way that insults the viewer's intelligence or requires they sacrifice their cynicism to accept it. He continued that Phil evolves into a better version of himself, but he never stops being a jerk. Janet Maslin said that the film balanced sentimentality and nihilism. The Hollywood Reporter appreciated that the film endorsed small town morals and their positive effect on Phil. The New Statesman said that it appealed simultaneously to cynicism and optimism.\n\nOf some reason I have never seen \"Groundhog Day\" properly despite the fact that Bill Murray is one of my favourite actors. \"Groundhog Day\" has some sort of moral pillar as the foundation. Be good, do good and find happiness in life sort of. Bill Murray is Bill Murray, but the film itself is not amongst his strongest ones if you ask me. \"Groundhog Day\" was considered a box office success on its release, if a modest one, earning over $70.9 million to become one of the highest-grossing films of 1993. It also received generally positive reviews. Reviewers were consistent in praise for the film's successful melding of overly sentimental and deeply cynical moments, and for the philosophical message beneath the comedy. It received multiple award nominations and won a BAFTA award for Best Original Screenplay. For all its success, the film marked the end of Ramis and Murray's long collaborative partnership that had produced films like Caddyshack (1980) and Ghostbusters (1984). The pair did not speak after filming until shortly before Ramis's death in 2014. The film was a showcase for Murray; previously seen only as a comic actor, his performance led to more serious lead roles in critically acclaimed films.",
            "review_date": "2020-09-06",
            "source": "rt"
        },
        {
            "content": "I thought this was a really funny film. One of my favorite Bill Murray films of all time.",
            "review_date": "2020-09-05",
            "source": "rt"
        },
        {
            "content": "\"What would you do if you were stuck in one place and everything was exactly the same and nothing that you did mattered?\"\nThis comedic fairy tale, opting for more subtle and situational based humor, also offered a level of pathos I was not expecting. Murray is perfect for his role but it is MacDowell who totally shines here, bringing a positive energy and an infectious smile, providing a much needed contrast to Murray's pompous and cynical weatherman. This movie definitely hit me at times, in a way it couldn't have five or six months ago, as many of us may have now had a small taste of what it feels like to relive the same day over and over, and more importantly what we require to find positive meaning in a life that can begin to feel more and more repetitive.",
            "review_date": "2020-08-31",
            "source": "rt"
        },
        {
            "content": "Fantastic watch, will watch again, and do recommend.\n\nBill Murray carries this time-shift-loop adventure in hilarious form.  The writing is excellent with a \"redeemable protagonist\" trope mixed in.\n\nThe movie is creative with it's divergent time lines and even manages to maintain proper story arcs as Phil continues to loop.\n\nThe supporting cast is wonderful in each of their roles, and manage to do repeat acting excellently.\n\nThis was a popularizing (if not a birth) to a genre, everyone should have watched this movie at some point.",
            "review_date": "2020-08-21",
            "source": "rt"
        },
        {
            "content": "Hardly a wasted moment",
            "review_date": "2020-08-01",
            "source": "rt"
        },
        {
            "content": "Loved this movie. Everything about it is great, super entertaining.",
            "review_date": "2020-07-28",
            "source": "rt"
        },
        {
            "content": "A classic comedy and another example of the greatness of Bill Murray.",
            "review_date": "2020-07-19",
            "source": "rt"
        },
        {
            "content": "Takes a little time to get going, but once the day starts repeating, we have lift off!",
            "review_date": "2020-07-17",
            "source": "rt"
        },
        {
            "content": "A near perfect classic.",
            "review_date": "2020-07-09",
            "source": "rt"
        },
        {
            "content": "A fantastic Bill Murray film that has a great message and offers a brilliant story with a side of very well put comedy.",
            "review_date": "2020-07-06",
            "source": "rt"
        },
        {
            "content": "Really funny film! One of my favorite Bill Murray films of all time.",
            "review_date": "2020-06-28",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is an incredibly entertaining comedy with a brilliant concept,  in which it explores the idea in a funny and heartwarming way. Bill Murray gives an excellent lead performance, and his character's arc throughout the film is rewarding to watch and feels very natural. Many of the different scenarios the film plays with are genius and properly explores the time loop idea, so doesn't feel disappointing at all, with hilarious antics and enjoyable sequences. The only thing holding it back is that it's repetitive nature can at times feel a little annoying.",
            "review_date": "2020-06-22",
            "source": "rt"
        },
        {
            "content": "A sweet and funny story about an obnoxious reporter trapped reliving the same day over and over. The perfect Bill Murray part. Added Groundhog Day to the pop culture lexicon.",
            "review_date": "2020-06-16",
            "source": "rt"
        },
        {
            "content": "It blends drama and comedy with great effect, with a smart and heartful script, a truly original premise, plenty of laughs and great lead performance from Bill Murray.",
            "review_date": "2020-06-12",
            "source": "rt"
        },
        {
            "content": "An easy watching feel good Bill Murray 90s movie. What is not to like.",
            "review_date": "2020-05-17",
            "source": "rt"
        },
        {
            "content": "This is Bill Murray at his best and one of my favorite comedies of all time. This movie is a must watch and a true classic.",
            "review_date": "2020-05-16",
            "source": "rt"
        },
        {
            "content": "One of a kind. Groundhog Day is a masterpiece that has a great message that fits perfectly in its sensational spirit.",
            "review_date": "2020-05-01",
            "source": "rt"
        },
        {
            "content": "A fun movie based off Punxstawny, a town close to my college. Interesting film development repeating days over and over on end.",
            "review_date": "2020-04-28",
            "source": "rt"
        },
        {
            "content": "I really enjoyed this film. Bill Murray was the perfect casting choice for the character of Phil who had to relive the same day over and over. The plot developed nicely and in a way that felt natural, realistic and unforced. Phil's descend into insanity as he experiences similar events and comes across the same people every time he wakes up produced the funnier moments in the film. While his situation brings out the worst in him, it also brings out the best in him. It's that aspect that of the film that really stood out to me! While it's not quite 5 stars, it's still a really fun and entertaining film.",
            "review_date": "2020-04-26",
            "source": "rt"
        },
        {
            "content": "Groundhog Day: An absolute classic with overwhelming charm and grace balanced out with deft drama that emphasizes on emotion with character to create a truly unqiue comedy that holds to this day.",
            "review_date": "2020-04-23",
            "source": "rt"
        },
        {
            "content": "More than a romance, more than a time-travel film, more than a dark comedy, it transcends genres.",
            "review_date": "2020-04-21",
            "source": "rt"
        },
        {
            "content": "This comedy classic was funny and entertaining. Bill Murray, Andie MacDowell, and the rest of the cast did a fantastic job in this movie. The plot to the movie was funny and dramatic. It's amazing he keeps reliving the same day over and over again but it's for a purpose and that's what makes this movie a classic. If you haven't seen this movie yet, check it out sometime. You'll love it and get a good laugh out of it.",
            "review_date": "2020-04-10",
            "source": "rt"
        },
        {
            "content": "It's got a slow start but after that it starts to get better and Phil (Bill Murray) does an amazing job throughout this movie, he gives a good performance in this movie and he gives a lot of laughs throughout it. Also, this movie has got an interesting story which makes the movie pretty good and lots of the scenes throughout it are quite funny. Overall, It's a really good comedy movie to watch, I'd recommended it if you're wanting something to watch.",
            "review_date": "2020-04-10",
            "source": "rt"
        },
        {
            "content": "I've finally watched 'Groundhog Day', probably one of the longest gaps between discovering a film and actually viewing it. I now get why it's a highly rated one.\n\nBill Murray is the sole reason for that. His performance here is tremendous, his delivery is absolutely perfect for the role. Cool to see Michael Shannon in his silver screen debut, I like a lot of his work; most notably as Van Alden in 'Boardwalk Empire'.\n\nBack to this, the premise is portrayed nicely despite the repeat nature of the events. I do have questions about it, there's a few holes as well as the overall blurred message it attempts to set, but there's no doubting it's a funny film; which is most important when it comes to comedies.\n\nIn regards to the ending, I expected it to conclude under a different tone. To me, what Phil does during the penultimate revisits isn't massively different to what he does for the final time, the motives seem similar. About the tone, I thought it was going to stick with the one it set around the elderly gentleman but it doesn't.\n\nThat last paragraph isn't an important matter, I'm certainly over-analysing it, but these are just my thoughts.\n\nA must-watch.",
            "review_date": "2020-04-10",
            "source": "rt"
        },
        {
            "content": "This is one of the best movies ever made, and has made a profound impact on culture itself. This is just a fantastic film, that depicts a childish and depressed man go through the same day over-and-over, learning how to enjoy life instead of wanting it to be over. It is a film that makes you smile, cringe, nod, cry, and think. This is just a great film from start-to-finish, and considering many things had to stay the Same every time, they did a surprising job replicating that as best they could. You may not like this guy, but that is the Point. \nI think everyone would go about this differently, but it does give a unique perspective on life and I think Everyone Everywhere could learn from this film, If I didn't already Know a Massive percentage of people cannot learn from television.",
            "review_date": "2020-03-30",
            "source": "rt"
        },
        {
            "content": "This is our life now.",
            "review_date": "2020-03-30",
            "source": "rt"
        },
        {
            "content": "4.5/5.  A true classic.",
            "review_date": "2020-03-29",
            "source": "rt"
        },
        {
            "content": "Believe it or not, I've never seen Groundhog Day until tonight (I'm that guy).  I've heard amazing things, though, and the RT score alone would have you believe it's this otherworldly comedy that absolutely must be seen. Well, I finally did, and at the risk of the ire of every other person to ever see the movie, I was unimpressed.  I saw it with my 15 year old son, and neither of us laughed more than maybe once.  Murray was decent in it, but it was far from his funniest role, and while the premise was good, it got annoying seeing the same thing after awhile. The chemistry between Murray and McDowell is non-existent, and McDowell's forced southern accent and flat acting is painful. I also kept finding myself saying that no one would ever act like that if they were stuck in the same situation.  For example, if you tried to kill yourself once, and you knew it wouldn't work, would you try 10 more times, several of which were probably painful? If it were funnier, I could overlook all of that, but at best, it's mildly amusing.",
            "review_date": "2020-03-26",
            "source": "rt"
        },
        {
            "content": "Witty, sharp, and just a tinge of some life lessons. Groundhog Day is like what life is like in this quarantine/stay-at-home situation, albeit without any of the consequences as Murray can just relive the day again with a clean slate.",
            "review_date": "2020-03-24",
            "source": "rt"
        },
        {
            "content": "This movie shows how great an actor Bill Murray is.",
            "review_date": "2020-03-22",
            "source": "rt"
        },
        {
            "content": "I love this movie. It's timeless and great for just a lighthearted good time",
            "review_date": "2020-03-21",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is much more than a self centered man reliving the same day over again. It is a movie about kindness and never giving up.",
            "review_date": "2020-03-18",
            "source": "rt"
        },
        {
            "content": "Classic, lol that Bill Murray was just sexually harassing andie mcdowell at the beginning and that's just supposed to be cool.",
            "review_date": "2020-03-11",
            "source": "rt"
        },
        {
            "content": "If you don't love love this movie, we can't be friends. Bill Murray is the best.",
            "review_date": "2020-03-07",
            "source": "rt"
        },
        {
            "content": "Almost perfect, light and deep. So well told, perform and accomplished. Best of Bill for sure. Classic",
            "review_date": "2020-03-03",
            "source": "rt"
        },
        {
            "content": "There's so much to discover upon multiple rewatches, and the blend of comedy and drama are absolutely perfect.",
            "review_date": "2020-02-21",
            "source": "rt"
        },
        {
            "content": "9/10 would punxsutawney again",
            "review_date": "2020-02-18",
            "source": "rt"
        },
        {
            "content": "At the very least it's incredibly thought-provoking. Thankfully, the film is also lead by Bill Murray, whose comedic timing is matched only by his dramatic talent. (A-)",
            "review_date": "2020-02-10",
            "source": "rt"
        },
        {
            "content": "Is it a comedy? romance? psychological magical realism? Who cares, this movie is one of the most unique and strangely captivating I've ever seen.  Slightly reminiscent of Scrooge/A Christmas Carol, it spans all emotions and facets of a human, shifts between light and dark, and in the end, is genuinely moving.",
            "review_date": "2020-02-08",
            "source": "rt"
        },
        {
            "content": "[MASTERPIECE] Groundhog Day is quite possibly my favorite comedy movie, despite being quite missable upon first viewing. However, upon second viewing, it becomes clear that this is a great movie. It is one of those movies that makes you laugh, cry with happiness, and laugh some more.",
            "review_date": "2020-02-07",
            "source": "rt"
        },
        {
            "content": "I love this movie.  Bill Murray's mannerisms and delivery of lines are timeless.  I have seen this movie over and over and over and over will continue to do so.",
            "review_date": "2020-02-06",
            "source": "rt"
        },
        {
            "content": "Horfdi a hana heima hja Pabba 1 feb (ekki annann Feb, en þettaer skrifad 2 Feb 2020 sem er Groundhog Day!!)",
            "review_date": "2020-02-02",
            "source": "rt"
        },
        {
            "content": "Simultaneously funny and dramatic with a compelling story and solid character development for Bill Murray's character, coupled with a time loop that's sure to leave you theorizing why Murray is the only one who seems to be aware of it, Groundhog Day is a '90s classic with a memorable premise that lends itself surprisingly well to different types of movies.",
            "review_date": "2020-02-02",
            "source": "rt"
        },
        {
            "content": "Possibly the best movie and performance of Bill Murray's career, Groundhog Day is a creative, funny, memorable and touching story of a man stuck reliving the same day over and over again with a fun experience for all ages. From the directing and casting, this flick is truly one of the best movies of the nineties and one of the best comedies of all time~",
            "review_date": "2020-02-02",
            "source": "rt"
        },
        {
            "content": "Clever, funny and feel good movie.  One that can easily be watched over and over again!",
            "review_date": "2020-01-30",
            "source": "rt"
        },
        {
            "content": "Funny, and helped largely by Murray's off-beat performance.",
            "review_date": "2020-01-24",
            "source": "rt"
        },
        {
            "content": "I just got the chance to see this again on New Year's Eve.  It came up for $5 bucks on iTunes so I decided to pick it up, and I'm glad that I did.  It was as good as I remembered.  The concept certainly is a novel one.  This is a very funny take on a man living Groundhog Day over and over again.  He must have lived it again so many times that he basically has every conceivable experience one could by living the same day over in the same local context.  I particularly love how he went from being a beginner piano player to being some kind of master maestro at the instrument .  Bill Murray and many other cast members nailed their performances.  Excellent movie here.  It was a special joy watching this with my daughter who also enjoyed it. I'll certainly watch again someday.",
            "review_date": "2020-01-14",
            "source": "rt"
        },
        {
            "content": "Well crafted in every way. Top 5 comedy all time.",
            "review_date": "2020-01-04",
            "source": "rt"
        },
        {
            "content": "Bit late to see this classic,  27 years late to be exact. LOL.  It's a hilarious take on a twilight zone setting yet underlies a profound life lesson of love and transformation.  Best comedy fantasy I've seen!",
            "review_date": "2020-01-01",
            "source": "rt"
        },
        {
            "content": "Absolute masterpiece.  Funny , lighthearted feel good movie .",
            "review_date": "2019-12-28",
            "source": "rt"
        },
        {
            "content": "I can't explain it. I mean a lot of people will understand. This is absolutely my favorite movie ever.",
            "review_date": "2019-12-19",
            "source": "rt"
        },
        {
            "content": "On a technical level, this movie is great. On a performance level, this movie is great. On a writing level, this movie is great. On a comedic level, this movie is great. On a dramatic level, this movie is great. On an entertainment level, this movie is spectacular.",
            "review_date": "2019-10-24",
            "source": "rt"
        },
        {
            "content": "Bill Murray takes what would be an average film and makes it one everyone should see. ",
            "review_date": "2019-10-10",
            "source": "rt"
        },
        {
            "content": "Some funny moments in this Harold Ramis comedy with Bill Murray taking the limelight. Just like the film though I found myself going round and round in circles. ",
            "review_date": "2019-10-09",
            "source": "rt"
        },
        {
            "content": "Bill Murray shines here with Harold Ramis's comedic direction. Our star is hilarious and portrays confusion then acceptance of his situation, going from being a miserable mean-spirited person to understanding that life can be about helping others. The perfect day doesn't consist of everything being about you, but making the world a little bit better of a place.",
            "review_date": "2019-10-08",
            "source": "rt"
        },
        {
            "content": "In the top 5 of my all time favorites!",
            "review_date": "2019-09-28",
            "source": "rt"
        },
        {
            "content": "Bill Murray expands his impressive legacy with this. It does actually make you feel a strong connection with his character and pulls you in for the whole movie.",
            "review_date": "2019-09-24",
            "source": "rt"
        },
        {
            "content": "Bill Murray shines in this movie, and the plot gets better throughout the hour and a half. ",
            "review_date": "2019-09-14",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is non-stop Bill Murray at his best.\n\nNothing else matters.",
            "review_date": "2019-09-13",
            "source": "rt"
        },
        {
            "content": "Regardless of whether you want to call it a film about life or self-improvement, questions like 'what if there is no tomorrow?' or 'what would you do if you were stuck in one place, and every day was exactly the same, and nothing that you did mattered?', makes Groundhog Day a picture with a simple yet thought-provoking plot and undoubtedly one of the best Bill Murray films!",
            "review_date": "2019-08-21",
            "source": "rt"
        },
        {
            "content": "The Edge of Tomorrow before the Edge of Tomorrow. Funny and cute.",
            "review_date": "2019-08-13",
            "source": "rt"
        },
        {
            "content": "One of the Funniest movies from the 90's",
            "review_date": "2019-08-08",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is Harold Ramis's masterpiece. Funny and thought provoking at the same time. ",
            "review_date": "2019-08-05",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is a 1993 comedy/drama directed by Harold Ramis. The film stars Bill Murray as Phil and Andie MacDowell as Rita.\n \nThe premise and story of the film I personally really enjoyed, from the multiple possibility's of living the same day over and over, to how well it was done in execution.\n\nThe acting was also very strong, especially Bill Murray as Phil, I found that he gave a really relatable but still stylised performance.\n\nThe characters I also found to be very enjoyable and relatable, especially Phil in the second act, I found that the writers really knew what they wanted to do with the character, and did it.\n\nThe film also had a very good soundtrack, from Weatherman to I Got You Babe.\n\nThe comedy in my opinion was very good and written well, especially one joke involving a piano teacher and a student.\n\nThe film at points also had some very strong atmosphere, especially in the second act with the character Phil.\n\nThe film I personally really enjoyed, and I hope to watch it again on Groundhog Day.\n\nOver all I give it a\n8/10",
            "review_date": "2019-07-08",
            "source": "rt"
        },
        {
            "content": "Fantastic and entertaining. Ironically, I'm not sure I liked Bill Murray.",
            "review_date": "2019-06-03",
            "source": "rt"
        },
        {
            "content": "Best movie I've seen in a while. Love Bill Murray",
            "review_date": "2019-05-29",
            "source": "rt"
        },
        {
            "content": "Existing is not living. And kindness is a value that every single one of us should live by. These are what this well-acted, well-directed and well-written film is all about... \n\nPhil learned them the hard way. We shouldn't.",
            "review_date": "2019-05-05",
            "source": "rt"
        },
        {
            "content": "Brilliant! A total classic. End of.",
            "review_date": "2019-04-29",
            "source": "rt"
        },
        {
            "content": "A funny old movie, everyone can enjoy it",
            "review_date": "2019-03-16",
            "source": "rt"
        },
        {
            "content": "Best movie with Bill Murray in it. Loved it.",
            "review_date": "2019-03-16",
            "source": "rt"
        },
        {
            "content": "Simply one of the best films of all time.",
            "review_date": "2019-03-02",
            "source": "rt"
        },
        {
            "content": "Bill Murray shines as he should inside Harold Ramis direction on a completely original and thought-provoking comedy that, although odd, it provides one of cinemaâ(TM)s common subjects to explore, as well as an iconic and memorable plot that granted the actor one of his all times favorite roles among fans, nevertheless the clever writing and flow throughout every possible option available for our character to explore, something a little bit thrown away by the predictable and cheesy conclusion",
            "review_date": "2019-02-24",
            "source": "rt"
        },
        {
            "content": "Doesn't everybody know this one? Bill Murray plays a generally bitter, unpleasant weatherman who turns on the charm while the cameras roll but tumbles backward into mean, icy sarcasm just as soon as he's out of the frame. Forced to relive the same day on an endless loop, a much-loathed Groundhog's Day on-location report, he slowly works through his issues, loses the chip on his shoulder, finds personal fulfillment and learns how to share a meaningful moment. It's a simple idea, thoughtfully explored, that doesn't run short on heart, ideas or surprises.\n\nMurray is perfect in the role, able to convincingly evolve from contemptible jerk to charismatic goofball, but it's the in-between steps that really make his journey remarkable. His growth doesn't come without pains and struggles, missteps and setbacks, and we share his agony over those tough lessons and bitter disappointments. By the time his sentence in that circular purgatory is at an end, he's hit rock bottom, explored his darkest impulses, reached out for salvation, failed, improved and found peace within himself.\n\nAndie MacDowell is adorable as Murray's co-star, the ever-optimistic, spritely target of our affections, while director Harold Ramis gives the whole package a warm, friendly sensibility that keeps things on the up-and-up and still allows some wickedly dark material to sneak through. A fantastic, character-driven comedy with laughs to spare and sweet, enduring lessons to teach. Worthy of annual viewings.",
            "review_date": "2019-02-11",
            "source": "rt"
        },
        {
            "content": "A surprising inventive, warm and endearing existential comedy!",
            "review_date": "2019-02-01",
            "source": "rt"
        },
        {
            "content": "Might just be the most rewatchable movie ever.",
            "review_date": "2019-01-27",
            "source": "rt"
        },
        {
            "content": "The best, GREATEST fantasy comedy romance movie ever made!",
            "review_date": "2019-01-26",
            "source": "rt"
        },
        {
            "content": "Pretty good but sometimes the plot gets old and sometimes it's not entertaining to see thing repeated over and over with slight changes",
            "review_date": "2018-11-27",
            "source": "rt"
        },
        {
            "content": "Very funny and original.",
            "review_date": "2018-11-14",
            "source": "rt"
        },
        {
            "content": "Funny movie about deja vu with Bill Murray, what's not to love?",
            "review_date": "2018-11-14",
            "source": "rt"
        },
        {
            "content": "This movie was tough for me to rate. At some points in the movie I was laughing from Murray's sarcastic jokes and the next I was cringing at something he did. I did enjoy the movie though especially when watching it on groundhog day.",
            "review_date": "2018-11-07",
            "source": "rt"
        },
        {
            "content": "There was no yesterday and no tomorrow. Everything is the same or is it what we really feel; get up in the morning, go through the same activities, go to school, go to campus, go to work, is everything just the same yet? \"Groundhog Day\" is a simple film but it's more than that. It's a real meaning of life, a philosophical meaning about life itself. This film has such melancholy moments; sometimes you laugh, you cry, you happy, and you feel uneasy. However, Bill Murray's character as Phil makes the film uncomplimentary from the comedy itself. Bill Murray's performance as the man who lives through the same day over and over again is beyond acting in acting. He acted but acted again. He never let go of his character regardless of the various situations he lived. He is a good and bad character. At the end of the movie, we can finally hear \"Almost Like Being in Love\" by Nat 'King' Cole instead of \"I Got You Babe.\"",
            "review_date": "2018-10-31",
            "source": "rt"
        },
        {
            "content": "One of the most quotable movies.",
            "review_date": "2018-10-11",
            "source": "rt"
        },
        {
            "content": "Wow amazing to think now 25 years have past since its 1993 release.I never get fed up of this movie even after seeing multiple times over the years. Bill Murray best ever movie performance. I hope they never remake this as only Bill Murray could play this part. Shame Andie McDowell never really capitalized on this movie success. She is super gorgeous even now. She is nearing 60 now and Bill nearing 70. Unique wonderful original movie with great characters and a beautiful ending. A masterpiece.",
            "review_date": "2018-10-07",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is interesting, engaging, and thought provoking: A true classic.",
            "review_date": "2018-10-01",
            "source": "rt"
        },
        {
            "content": "My favorite movie off all times, brilliant.",
            "review_date": "2018-09-16",
            "source": "rt"
        },
        {
            "content": "Groundhog Day: 10 out of 10: Bill Murray is a weatherman who, with his crew (Andie MacDowell, Chris Elliott), get trapped in Punxsutawney, PA by a snowstorm after covering the annual titular Groundhog Day festivities. When Murray wakes up the next morning it slowly dawns on him that it is Groundhog Day yet again and he isn't just stuck in town he is stuck in time. \n\n\nThe Good: Every fall newspapers and websites will point out those wacky colleges with their wacky classes. You know the What if Harry Potter is Real? at Appalachian State Univ. or Philosophy and 'Star Trek' at Georgetown. I would take a course that examines the philosophy behind Groundhog Day. Heck, I might join a religion that embraces the same.\n\nIt is such a simple premise and yet Director Harold Ramis and star Bill Murray take it some many wonderful wacky ways. In reality, for most of us through most our lives we live the experience of Groundhog Day. Every day is the same. With the same people and the same conversations in the same town eating the same food. The twist is that in Groundhog Day the universe resets at 6:00 am to the tune of \"I've Got You Babe\". As a result there are no consequences for your actions. You learn from the previous day and the board is reset with no one the wiser. This allows the character to go to a dark place of human nature (This being a romantic comedy Murray really doesn't go very dark). \n\nGroundhog Day predates modern choice-based video games by around ten years yet it is a prime example of (to steal from TV Tropes) Save Scumming to get that Golden Ending. Keep repeating the same actions over and over again till you get that perfect ending or in the ways of my new Groundhog Day religion... Nirvana. \n\nThe Bad: Well it is a nineties Romantic Comedy so the soundtrack has to be awful. Not Bridget Jones Diary awful mind you \"(It's Raining Men... really?) but pretty awful just the same. There is a Nat King Cole song at the end (but of course there is) and that Sonny and Cher earworm on the clock radio but it is composer George Fenton that wins the top honor with a horrible funk mess containing on the nose lyrics called \"The Weatherman\". \n\nThe Ugly: Before you go to bed think of how many days actually take place over the course of the movie.... Yeah, that is a bit frightening.\n\nIn Conclusion: Before ya, all go reboot this with Jonah Hill or something please keep in mind this movie only works with Murray. He is perfect for the role and the role is perfect for him. Anything else is heresy.",
            "review_date": "2018-09-03",
            "source": "rt"
        },
        {
            "content": "this one is supposed to be #1 here.",
            "review_date": "2018-09-02",
            "source": "rt"
        },
        {
            "content": "\"Groundhog Day\", a comedy released in 1993 follows the story of Phil Connors - a weatherman who finds himself repeatedly trapped in the same day, Groundhog Day. Phil must figure out how to break the cycle, if there is a way to do so. The film is certainly one that brings thoughts and feelings of hope with the central theme being, \"if you could do something over again, would you make it better?\" In the film, Phil goes from one extreme to another in his quest. Though at first choosing to create more chaos, Phil evolves over the course of the film to then choose to use his repetitive day to find ways to better the lives of those around him. As a result, the story proves to be very well-done structurally. Over time we begin to feel for Phil and empathize with him. By the end of the film, we feel success in his prevail. Leading the cast as Phil, Bill Murray does an excellent job playing every inch and aspect of the character. Murray's ability to deliver snarky sarcasm in a way that makes him endearing truly grounds us in our affection for the character. His chemistry with Andie MacDowell also proves to be unwavering. With a film that takes place in the same place over the span of the same day, director Harold Ramis excels in his ability to keep the film entertaining and interesting no matter the circumstance. This is also evidenced in the superb production value. Overall, the film proves to be a hit. It's no wonder it's been able to stand the test of time and still connects with audiences to this day!",
            "review_date": "2018-08-27",
            "source": "rt"
        },
        {
            "content": "Best comedy movie of all time if you ask me. Not only hilarious, but also endearing and full of charm and heart. ",
            "review_date": "2018-08-26",
            "source": "rt"
        },
        {
            "content": "Bill Murray's greatest achievement with Harold Ramis.",
            "review_date": "2018-08-23",
            "source": "rt"
        },
        {
            "content": "One of the best comedies of all time. This is the Bill Murray classic.  Watch it again and again and again...keeps getting better",
            "review_date": "2018-08-22",
            "source": "rt"
        },
        {
            "content": "Greatest movie ever...",
            "review_date": "2018-08-19",
            "source": "rt"
        },
        {
            "content": "Wholesome and uplifting, its the type of movie you can watch at any time, any place and any number of times.",
            "review_date": "2018-08-18",
            "source": "rt"
        },
        {
            "content": "Such an amazing film. Changed my life. Never will be people understand how incredible this film is and it's influence. Bill Murray should have at least been nominated for the oscar.",
            "review_date": "2018-08-08",
            "source": "rt"
        },
        {
            "content": "Wow this is a great movie! It has everything; love, laughs, heart!",
            "review_date": "2018-08-02",
            "source": "rt"
        },
        {
            "content": "The concept of the movie still blows my mind to this day",
            "review_date": "2018-07-27",
            "source": "rt"
        },
        {
            "content": "Bill Murray at his best",
            "review_date": "2018-07-15",
            "source": "rt"
        },
        {
            "content": "If I had to wake up on the same day every morning, I'd make sure to watch Groundhog Day first thing.",
            "review_date": "2018-07-13",
            "source": "rt"
        },
        {
            "content": "Groundhog day may seem tame by today's standards- but remember this was the film that started the whole time relapse continuum in the first place. However, just a concept cannot carry a film and this is where Groundhog succeeded and many others failed- It had a heart and a good story. Bill murray plays a weather reporter who must relive the same day- groundhog day every day. Featuring great performances from Murray and Mcdonald, and fantastic direction from Harold Ramis Groundhog Day is a movie that will still be watched a hundred years from now.  (Great comedy-philosophical drama).",
            "review_date": "2018-06-20",
            "source": "rt"
        },
        {
            "content": "This is an amazing movie",
            "review_date": "2018-06-12",
            "source": "rt"
        },
        {
            "content": "It's just charming how Harold Ramis directed this comedy which shows the real comedic talent of Bill Murray. He is not just delivering some funny script lines, he's performing with his full body. It's funny when he looks, when he reacts, when he wakes up (every morning). That's something which is missing from comedies nowadays. And Groundhog Day doesn't need to explain everything to us. Murrays weatherman ist reliving the same day again and again. Why? We don't know. But it's not relevant for the story. Reitman focuses on Murray and on the recurring events that vary from time to time. This is definitely one of Murrays classics (along with Scrooged).",
            "review_date": "2018-06-02",
            "source": "rt"
        },
        {
            "content": "Absolutely.must.watch",
            "review_date": "2018-06-01",
            "source": "rt"
        },
        {
            "content": "Wholesome movie with a nice message. Watching in 2018 has made me painfully aware that one had to do little more than be white and well-dressed to be perceived as a \"ladies man\" in the early 90s, though.",
            "review_date": "2018-05-05",
            "source": "rt"
        },
        {
            "content": "A bit of a slow start but 15 minutes into Groundhog Day I realized how much a work of genius that this movie is. Wonderful tale of redemption and selflessness.",
            "review_date": "2018-03-29",
            "source": "rt"
        },
        {
            "content": "Funny, terrific and intelligent. Bill Murray is a class act in \"Groundhog Day'.",
            "review_date": "2018-03-24",
            "source": "rt"
        },
        {
            "content": "there wasn't one today..\n\nGroundhog Day\n\nEven though the premise had the potential and sometimes it does wander off on dark tracks the maker picks the smart approach on narrowing down the complexity to light and breezy tone that is mildly soothing and satisfying. Harold Ramis could have done some better work in it along with editing the screenplay a bit tighter too; around 90 minutes would have been adequate. Bill Murray is excellent as the protagonist in this fantasy and he pulls it off all alone in his shoulder with head held high and doing some of his career's finest work. Groundhog Day is a beautiful feature that explores the innocence and priorities of human nature by projecting some dark and practical work on screen that is supported by stellar performances.",
            "review_date": "2018-03-03",
            "source": "rt"
        },
        {
            "content": "Excellent and funny story about second chances.",
            "review_date": "2018-03-02",
            "source": "rt"
        },
        {
            "content": "Comédia com fluxo temporal, muito bom!",
            "review_date": "2018-02-25",
            "source": "rt"
        },
        {
            "content": "1001 movies to see before you die.",
            "review_date": "2018-02-24",
            "source": "rt"
        },
        {
            "content": "My favourite movie of all time. Only one of those, you know. ",
            "review_date": "2018-02-04",
            "source": "rt"
        },
        {
            "content": "One of the all time greats. Seen it at least 200 times in since it came out and am entertained and enlightened each time. ",
            "review_date": "2018-02-03",
            "source": "rt"
        },
        {
            "content": "An all time classic.",
            "review_date": "2018-02-03",
            "source": "rt"
        },
        {
            "content": "Classic! I have seen it over 50 times",
            "review_date": "2018-02-03",
            "source": "rt"
        },
        {
            "content": "If you’re not 100% in love with this movie, you’re crazy. ",
            "review_date": "2018-02-02",
            "source": "rt"
        },
        {
            "content": "One of my all-time favorites!",
            "review_date": "2018-02-02",
            "source": "rt"
        },
        {
            "content": "One of the all time best. Bill is a genius. ",
            "review_date": "2018-02-02",
            "source": "rt"
        },
        {
            "content": "Another Bill Murray classic that keeps the audience engaged and entertain from open to close. This movie has a message that hits home after every watch. No one can keep from smiling as that Sunny and Cher song pops on the radio every morning he wakes up. Watching Murray do his best to keep himself entertained and from going crazy is just a delight to see. A must watch for everyone!",
            "review_date": "2018-02-02",
            "source": "rt"
        },
        {
            "content": "I love this movie. period, end of story.",
            "review_date": "2018-02-02",
            "source": "rt"
        },
        {
            "content": "Probably Bill Murray’s best film. Excellent plot that has become a classic!",
            "review_date": "2018-02-02",
            "source": "rt"
        },
        {
            "content": "A wonderful classic movie with a great message to its audience and great acting. Even though the plot progression may seem a bit predictable, you're still feeling the main character's relief by the movie's conclusion.",
            "review_date": "2018-02-01",
            "source": "rt"
        },
        {
            "content": "No, this movie is not dark or sad or realistic. It isn't about war. But it manages to be an excellent movie none the less. One of the many gems of the 90s. This is Bill Murray at his sweetest. The story was a risky one but was handled perfectly. Only this movie can make the February 2nd over and over again enjoyable.",
            "review_date": "2018-01-24",
            "source": "rt"
        },
        {
            "content": "The great idea behind it, the comedy, the best Murray, the meaning of it all... so many reasons to love this movie! And just like in \"Groundhog Day\" I'd watch it over and over and over again.",
            "review_date": "2018-01-24",
            "source": "rt"
        },
        {
            "content": "Story about a self centered jerk who is forced to repeat the same day over and over again forever. Bill Murray really comes into his own here and proved he isn't just a comic actor. Andie McDowell does a good job and I usually can't stand her. One of my favorite movies.",
            "review_date": "2018-01-19",
            "source": "rt"
        },
        {
            "content": "A well-written movie where Phil (our hero) carves out his recursive day and follows through on some ideas and things I would've done myself. The way his repeats are presented leave him open for interpretation.",
            "review_date": "2018-01-07",
            "source": "rt"
        },
        {
            "content": "In a film that relies on the premise of a man reliving the same day over and over, it would be easy for Groundhog Day to fail due to monotony. However, not only are there a number of things happening during the course of Phil Connors' (Bill Murray) day, the success of the film comes from Phil's countless attempt to perfect those things. From ice sculpting to having a fling, I looked at Phil's day-to-day as less of striving for perfection and more of a long blooper reel. You'll crack up as Phil makes mental notes aloud of something he needs to correct. It's especially funny watching the reaction of those around him who he's spent a lifetime of days getting to know, yet they have no idea who he is. They feel like they should know him just as well, yet their facial expressions clearly indicate they don't. The devil is fully in the details.\n\n\n\nYes, Phil Connors, famous weatherman, is reliving the same Groundhog Day over and over again in a town that he hates. His ensuing failures and successes of handling the same day repeatedly give you multiple reasons to laugh repeatedly. Unlike a number of comedies, the film is a great on a number of levels, layered with both solid character development and a heartwarming message. Self-centered Phil learns the importance of what it means to live each day to the fullest. Of course it doesn't hit him right away, but I imagine we would react similarly if put in his shoes. Phil experiences a gauntlet of emotions including disbelief, despair, relief, and invigoration. \n\n\n\nAnd that's exactly where its power lies. While it's a film with a premise mired in fantasy, Groundhog Day fully and completely represents our realities as human beings and how we choose to shape those realities. Classic film. I give it a 90.",
            "review_date": "2018-01-04",
            "source": "rt"
        },
        {
            "content": "With a great balance between devilish glee and heartfelt sincerity from Bill Murray, Groundhog Day offers an easily digestible tale that creates a charm of its own, even if some of the middle section of the story isn't the most beliveable or understandable.",
            "review_date": "2018-01-03",
            "source": "rt"
        },
        {
            "content": "Something keeps nagging at me about Groundhog Day, this week's classic on the Everyone is a Critic Movie Podcast. I like the movie but something about Groundhog Day seems to bring out my inner pedant. Whether it's the questionable timeline, the questionable motivation for those many timelines or something in the manner of Bill Murray's slightly awkward performance, I can't seem to embrace the film as fully as so many others have.\n\nGroundhog Day stars Bill Murray as Phil Connors, a narcissistic Pittsburgh weather man who is tasked with traveling to Punxsutawney, Pennsylvania for that yearly tradition of Groundhog Day. Punxsutawney has become famous for its Groundhog Festival at which the titular rodent, known around town as Phil, is pulled from his fake abode to announce whether he sees his shadow. The notion is that if the groundhog can see his shadow there will be six more weeks of winter. https://geeks.media/classic-movie-review-groundhog-day?_ga=2.87345624.1126457623.1513947710-953607229.1513947710",
            "review_date": "2017-12-28",
            "source": "rt"
        },
        {
            "content": "An absolute classic due to its novel premise, 'Groundhog Day' is utterly charming, with a relateable cast and exaggerated yet magnetic character development. Points for not rewarding the creepy stalker behaviour, too!",
            "review_date": "2017-12-28",
            "source": "rt"
        },
        {
            "content": "Puntaje Original: 7.0\n\nGrounghog Day te llega a atrapar tanto como el protagonista en el tiempo, aparte de una entretenida, divertida, original y creativa historia que te hará pasar 100 fantásticos minutos.",
            "review_date": "2017-12-18",
            "source": "rt"
        },
        {
            "content": "The crown jewel of Bill Murray's comedy. High-concept comedy masterpiece.",
            "review_date": "2017-12-15",
            "source": "rt"
        },
        {
            "content": "Way better than Before I Fall.",
            "review_date": "2017-11-26",
            "source": "rt"
        },
        {
            "content": "An absolute masterpiece. Why is such brilliance so rare these days?",
            "review_date": "2017-10-20",
            "source": "rt"
        },
        {
            "content": "This is still one of my favorite movies. A classic film that created a new meaning to \"Groundhog Day.\"",
            "review_date": "2017-10-19",
            "source": "rt"
        },
        {
            "content": "Only cuz its a classic",
            "review_date": "2017-10-13",
            "source": "rt"
        },
        {
            "content": "Quite funny.  Plots were far better than the recent mivie Before I Fall.",
            "review_date": "2017-09-27",
            "source": "rt"
        },
        {
            "content": "Only Bill Murray could've handled the mad concept of Groundhog Day as well as he did, the brilliant concept and theories behind the film drive the force of the picture. Murray's dry, sarcastic wit and deadpan delivery perfectly counteract the Punxsatawney residents who flit with small-town comedic absent-mindedness. Andie MacDowell meanwhile perfectly counteracts Murray's dryness with warming optimism and brilliant capabilities in her delivery. The soundtrack is also great, but really makes me never want to hear \"I Got You, Babe\" ever again. The film serves as a great satire of the 9 to 5 grind and a wanting to escape from the grind of working life. A film to watch again and again and again and again and again...",
            "review_date": "2017-08-10",
            "source": "rt"
        },
        {
            "content": "Is it snowing in space?",
            "review_date": "2017-07-27",
            "source": "rt"
        },
        {
            "content": "I watch it every Groundhog Day like I've never seen it before, it has that ironic ability.",
            "review_date": "2017-06-30",
            "source": "rt"
        },
        {
            "content": "An amazingly original, clever film that combines Bill Murray's excellent acting with clever writing. One of the most intelligent comedies of all time, Groundhog Day satisfies and exceeds expectations.",
            "review_date": "2017-06-25",
            "source": "rt"
        },
        {
            "content": "This is one of those films that plays in the background during holidays you never really watch properly. Having actually watched it now I can see why it has become a classic film. Some good jokes and the film addresses what would go through everyone's minds if they had the chance to live without consequences. My main criticism is that the film rushes to the repetition and then plays on this fir the rest of the 90 minute run time. It felt like it could have been a good 20 minutes shorter. I also didn't like how there was no real explanation over why Phil was repeating the same day over and over, it just seemed to be happening and yo me this made the moral at the end less clear/impactful.",
            "review_date": "2017-05-14",
            "source": "rt"
        },
        {
            "content": "Renown as quite the 90's Classic, this was one I'd always heard about but never had the pleasure of seeing. I fully understood the concept but was dubious as to how this might be portrayed to make it compelling viewing. Whether I had already made my mind up about this before witnessing it, I didn't actually find it an unmissable watch. Of course I thought it was clever and the producers set themselves a real challenge in ensuring they replicated several scenes in the same manner. However, when you know what's coming it maybe didn't have the same visual impact. For me, it was like living the same moments over and over again with only a slight variation on the ending in some of them - sometimes he'd fall asleep, sometimes he'd get arrested, sometimes he'd have a drunken one night stand, and sometimes he'd even commit suicide. Regardless though, it always took us back to the same morning so like Bill Pulman, I started to find the routine a tad monotonous. Why the cycle would suddenly end when he finally does something righteous, I don't know, but I guess it fits with the fantasy type theming of this movie. I know it was primed at being romantic and comical but it didn't really grip me that hard on those elements - I was mainly just glued to see what he did actually do to break the cycle. I can't honestly say that I saw what gave this film a real name for itself back in the day, but nevertheless it was still something a bit different. I think it showcased various elements of what one would do if faced with such a situation; abusing the privileges before slowly succumbing to the depression it would cause. Had it gone on much longer, I think I would have felt the same - Enjoyed it at first, but the repetition soon led to boredom creeping in.",
            "review_date": "2017-04-16",
            "source": "rt"
        },
        {
            "content": "I can not find a single thing wrong with this Bill Murray classic. With a hilarious story, great characters, and stupendous jokes. This is one of the greats.",
            "review_date": "2017-03-27",
            "source": "rt"
        },
        {
            "content": "Bill Murray holds together this original plot by Harold Ramis. What starts off as a comedy slowly has a romantic element titrated in, so that all audiences can watch and enjoy Phil (Bill Murray) learn selflessness, community and what's important in life.",
            "review_date": "2017-03-20",
            "source": "rt"
        },
        {
            "content": "It's a sweet warm film and it's a storyline and message but sadly i felt the film in general and the humour was a little old-fashion, although Bill Murray did play his part really well. can't help be very it could be so much better.",
            "review_date": "2017-03-20",
            "source": "rt"
        },
        {
            "content": "A classic! Murray's best by far. Original and well executed, it still makes me laugh too.",
            "review_date": "2017-03-12",
            "source": "rt"
        },
        {
            "content": "Such a solid solid movie. It was straight up hilarious!! Bill Murray is such a genius in it as well. I feel sad it took me forever to see it.",
            "review_date": "2017-02-11",
            "source": "rt"
        },
        {
            "content": "Bill Murray, the key ingredient to an enjoyable movie.",
            "review_date": "2017-02-10",
            "source": "rt"
        },
        {
            "content": "Classic! Bill Murray in his prime. Amazing story, scenery, and supporting characters. Philosophical too, digs into the virtues of doing good things, being good for goodness sake. Just lovely, and funny.\nWatched at Eau Claire with Clay (Flashback Film Fest), February 4, 2017",
            "review_date": "2017-02-06",
            "source": "rt"
        },
        {
            "content": "10 out of 10:\n\nA smart story that's both funny and sweet.",
            "review_date": "2017-02-03",
            "source": "rt"
        },
        {
            "content": "A perfect movie. Lots of laughs, some tears. Extremely well done.",
            "review_date": "2017-02-02",
            "source": "rt"
        },
        {
            "content": "?????? ??? ?? ???????? ???? ????? ? ?????? ??? ?????????? ????? ??????????? ????.",
            "review_date": "2017-02-02",
            "source": "rt"
        },
        {
            "content": "One of Bill Murray's best. Witty and unique.",
            "review_date": "2017-01-25",
            "source": "rt"
        },
        {
            "content": "Still five stars.   Holds up!",
            "review_date": "2017-01-17",
            "source": "rt"
        },
        {
            "content": "Perfection....a kind of movie that comes very rarely....",
            "review_date": "2016-12-28",
            "source": "rt"
        },
        {
            "content": "I believe no movie is perfect but Groundhog day comes close. This is my all time favorite movie watch it if haven't before.",
            "review_date": "2016-12-07",
            "source": "rt"
        },
        {
            "content": "Holiday based movies are nothing new. There's a seemingly endless supply of Christmas and Halloween movies. Thanksgiving has a select few quality entries. Valentine's Day has all kinds of romance movies. There's plenty of war movies fitting for Veteran's Day, even. But who would have thought that one of the most delightful holiday based movies would be based around one of the most seemingly insignificant holidays of the year: Groundhog Day?\n\nHarold Ramis has crafted a surprisingly beautiful and touching film here, a poignant portrait of existentialism and life itself that hits pretty hard for a movie that seems to be first and foremost a comedy. The comedy genius himself, Bill Murray, delivers what he does best - dry goofball humor - but also brings plenty of dramatic, and even rather dark, moments that really prove the duality he is capable of bringing. Murray really sells you on his character, starting out as a cynical and arrogant weather reporter who learns more about himself as he lives the same day over and over. It's ultimately a story of a man discovering his own humanity, and Ramis tells it with enough heart and charm that makes it an endlessly rewatchable classic. How fitting.",
            "review_date": "2016-12-01",
            "source": "rt"
        },
        {
            "content": "Comedy film masterpiece with absolutely astounding screenplay and performance from Bill Murray. A film with genuine message.",
            "review_date": "2016-10-17",
            "source": "rt"
        },
        {
            "content": "Another movie that shaped how I view stories. This is an example of a simple, creative premise executed perfectly. Not only that, it's executed with purpose and theme in mind. I think the one thing they could have done to completely ruin this movie is explain why he's looping the same day over and over, but they never do it. I read somewhere that in the first draft he was going to be cursed by a witch in order to start the cycle, and that would have completely ruined this movie. It doesn't matter what's causing his to loop, so the movie doesn't address it. I think that's brilliant.",
            "review_date": "2016-10-11",
            "source": "rt"
        },
        {
            "content": "Excruciating to watch, but so rewatchable at the same time. Murray's deadpan humour suits this romantic comedy.",
            "review_date": "2016-09-25",
            "source": "rt"
        },
        {
            "content": "One of the best movies I've seen.\nThis classic inspired so many other good movies. An AMAZING idea INCREDIBLY put together with perfect acting, and a strong story. \nIts hard to find ANYTHING wrong with this movie. Then you realize that there isn't anything wrong with this movie. Its one of those movies that are just perfect. \nA must-see masterpiece.",
            "review_date": "2016-08-26",
            "source": "rt"
        },
        {
            "content": "Ironically, you can watch this movie over and over again. ;)",
            "review_date": "2016-08-21",
            "source": "rt"
        },
        {
            "content": "What would you do if you were to live a random day over and over again? Groundhog Day anwers this question quite accurately for Phil Connors.",
            "review_date": "2016-08-20",
            "source": "rt"
        },
        {
            "content": "One of the best movie ever made! Truly a classic! This movie makes you laugh,sad, and sometimes gets crazy with the story and the performance by the fellow actors!",
            "review_date": "2016-08-09",
            "source": "rt"
        },
        {
            "content": "Murray is one of my favorite actors",
            "review_date": "2016-08-07",
            "source": "rt"
        },
        {
            "content": "Sometimes you'll feel stuck in an endless loop until the movie switches into a funnier, warmer and heartful direction and you realize how much fun Murray's movies were back in the day. It will bring joy and make you think about everyday interactions, but most of all make you work as a person because time isn't timeless.",
            "review_date": "2016-08-06",
            "source": "rt"
        },
        {
            "content": "What a great surprise this was!",
            "review_date": "2016-07-30",
            "source": "rt"
        },
        {
            "content": "Bill Murray at his best!",
            "review_date": "2016-07-18",
            "source": "rt"
        },
        {
            "content": "I generally don't like Bill Murray and am not a fan of most of his movies (sorry!), but I do like this one. The scenes where he wakes up everyday to that Sonny and Cher song and goes crazy and his reactions are the best parts of the movie and are genuinely funny. The character development of how Murray is a grouch at the beginning of the movie and how he transitions into a more caring character is interesting. I don't know.. how the movie slowly but surely transitioned into a 'rom com' really, really bugged me. The movie shouldn't have been how he got together with Andie MacDowell (whose I personally couldn't stand). It deserved better.",
            "review_date": "2016-07-11",
            "source": "rt"
        },
        {
            "content": "Has to be amongst the greatest movies ever made. Perfect casting throughout, top notch writing and performances, a heartwarming comedy set in the longest of winters!",
            "review_date": "2016-07-09",
            "source": "rt"
        },
        {
            "content": "Amusing and delightful. Bill Murray is fantastic in this one. So funny, whilst generally quite nice and gentle.",
            "review_date": "2016-06-29",
            "source": "rt"
        },
        {
            "content": "It's Groundhog Day! Groundhog Day is a very funny Bill Murray movie and it is a hilarious comedy movie. The plot of the movie couldn't be better. I would very much suggest this movie.",
            "review_date": "2016-06-13",
            "source": "rt"
        },
        {
            "content": "Groundhog Day (1993) ??? 1/2 101m. D: Harold Ramis. Bill Murray, Andie MacDowell, Chris Elliott, Stephen Tobolowsky, Brian Doyle-Murray. Hilarious, near-classic comedy about Scroogelike weatherman who finds himself literally living the same day over and over again. Consistently offbeat and satisfying, with a lot of big laughs and some very tender moments. One of those rare films that gets funnier with each viewing. Murray's best starring role to date. Ramis cowrote screenplay with Danny Rubin.",
            "review_date": "2016-05-31",
            "source": "rt"
        },
        {
            "content": "This movie should be considered a psychological film, because Ramis makes one feel Phil's pain.",
            "review_date": "2016-05-29",
            "source": "rt"
        },
        {
            "content": "The opening song is absolutely horrible but if don't like this movie, go ahead and smack yourself in the face. Then wake up tomorrow and smack yourself again.",
            "review_date": "2016-05-28",
            "source": "rt"
        },
        {
            "content": "Great film! Really funny and a get idea for a film",
            "review_date": "2016-05-16",
            "source": "rt"
        },
        {
            "content": "Grounghog Day te llega a atrapar tanto como el protagonista en el tiempo, aparte de una entretenida, divertida, original y creativa historia que te hará pasar 100 fantásticos minutos.",
            "review_date": "2016-04-25",
            "source": "rt"
        },
        {
            "content": "The amazing thing about the movie is how it's about a man reliving the same day over and over again, but  never becomes repetitive. \"Groundhog Day\" is sensational and a definite classic.",
            "review_date": "2016-04-24",
            "source": "rt"
        },
        {
            "content": "Always vastly underrated and so much to like about this wonderful film. Bill Murray excels with classic comedy timing and pathos, The chemistry with Andie MacDowell is the key, it isn't what a wonderful life but it's a not a bad runner up!",
            "review_date": "2016-04-14",
            "source": "rt"
        },
        {
            "content": "Easily one of my top 10 favorite movies of all time",
            "review_date": "2016-04-12",
            "source": "rt"
        },
        {
            "content": "A comedy that sees Bill Murray stuck reliving the same day over and over again. This film is inventive and is timeless classic. I wouldn't describe it as laugh out loud, more like a comedy drama but still worth a watch!",
            "review_date": "2016-04-04",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is a classic, and it proves that by the amazing story it has, the screenplay, and the amazing performances.",
            "review_date": "2016-03-26",
            "source": "rt"
        },
        {
            "content": "\"It's me! NED RYERSON!\"",
            "review_date": "2016-03-13",
            "source": "rt"
        },
        {
            "content": "Rating: 87%\nAs touching as it is irreverent, Groundhog Day is a fun and entertaining film that sees one of Bill Murray's finest performances.",
            "review_date": "2016-03-13",
            "source": "rt"
        },
        {
            "content": "A movie full of laughs and an original plot about a man realizing what life is all about creates for a classic.",
            "review_date": "2016-03-11",
            "source": "rt"
        },
        {
            "content": "This made my  top ten list.\n.",
            "review_date": "2016-03-05",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is an exceptional, defining comedy with an inventive plot, an amazing cast, engaging characters and moments, and a consistently more interesting climax - there's a reason why it's such a talked about comedy, it's one of the greatest comedies ever.\nPhil Connors is a Pittsburgh weatherman who, alongside his producer and cameraman, heads to Punxsutauney for Groundhog Day coverage. He soon finds himself living the same day over and over again, starting over again at 6am each day no matter where he is, dead or alive. Phil goes to last resorts of madness and eventually love over his odd predicament.\nGroundhog Day is amazing. To me, it is one of the greatest comedies of all time and is enjoyable each time you watch it. The story is rich with fresh uniqueness and is consistently engaging as each day goes on for Phil - it's a root for the main character's desire type plot. Murray shines bright in his main character role, pulling off original sarcasm turned to madness to good samaritan behavior excellently and hilariously - the entire cast is amazing and makes the film even more exceptional. Groundhog Day likes to toy with viewer moods a bit - originally chuckle provoking but as the days go by, more tragic events occur - these events seem a little off in the original mood but add more to the story and are a minor flaw. I can't complain much - Groundhog Day is an exceptional textbook example of a great comedy with a fresh new story and an amazing cast that really delivers.",
            "review_date": "2016-03-04",
            "source": "rt"
        },
        {
            "content": "No issue with suspending disbelief with this original, wacky, romantic comedy. Both Bill Murray's and Andie MacDowell's best work IMHO.",
            "review_date": "2016-02-26",
            "source": "rt"
        },
        {
            "content": "Another Bill Murray classic!",
            "review_date": "2016-02-16",
            "source": "rt"
        },
        {
            "content": "Groundhog Day\nBill Murray & Andie McDowell are in top form in sweet & sarcastic Romantic Comedy/Drama/Fantasy with an existential twist. \nHarold Ramis said that it's like Beauty & The Beast.  LOL!\nI saw parallels with another film we saw recently, About Time, in which the main character finds out that you cannot make someone fall in love with you.  I also saw flashes of A Christmas Carol/It's a Wonderful Life, where supernatural events changed the nature of the protagonist. There is also a strong parallel to karma, the modern concept of karma, but also to the Christian concept of redemption. \nA funny bit of trivia:  The most amusing & last encounter between Phil Connors & \"Needlenose\" Ned Ryerson on the street, the \"I-don't-know-where-you're-headed-but-can-you-call-in-sick?\" scene, was ad-libbed.",
            "review_date": "2016-02-13",
            "source": "rt"
        },
        {
            "content": "I could watch this over and over and over and...",
            "review_date": "2016-02-06",
            "source": "rt"
        },
        {
            "content": "Bill Murray is great in this film that manages to be be both gut busting funny and deeply emotional at different times. Most of the acting is okay, but it's strength lies in the script and direction it takes with being both family friendly and some crude humor thrown in.",
            "review_date": "2016-02-06",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies!  Perfect classic movie.  Watched it over 30 (?) times and still love it, every single time!!  The romance in this movie is amazing.  If you love romance movies, this is for you!",
            "review_date": "2016-02-02",
            "source": "rt"
        },
        {
            "content": "A good movie to watch ..today...or any day",
            "review_date": "2016-02-02",
            "source": "rt"
        },
        {
            "content": "Diving right into the plot without trying to explain the fiction behind it, Bill Murray gives us all we need, and more. The groundhog may not appear to often, but for that, you'd need to watch 'Caddyshack'.",
            "review_date": "2016-01-28",
            "source": "rt"
        },
        {
            "content": "Learn how to play piano in one day! Musicians hate him!",
            "review_date": "2016-01-20",
            "source": "rt"
        },
        {
            "content": "heartwarming, if not too exciting ..",
            "review_date": "2016-01-15",
            "source": "rt"
        },
        {
            "content": "Probably my favorite comedy from Bill Murray.\n\nPersonal Grade: S\nTechnical Score: 74%",
            "review_date": "2016-01-15",
            "source": "rt"
        },
        {
            "content": "Both snarky and heartfelt, Groundhog Day takes a complicated idea and boils it down to nothing more than a genius vehicle for this wildly entertaining romantic comedy.",
            "review_date": "2016-01-04",
            "source": "rt"
        },
        {
            "content": "A pretty clever nice comedy that takes the day repeating element in a really dramatic/realistic way, but still with a lot of great comedy from master Bill Murray, also great script.",
            "review_date": "2015-12-25",
            "source": "rt"
        },
        {
            "content": "Man, I hadn't seen this in like forever. But really, this is a great funny, feel good dumb classic. Best Bill Murray movie ever.",
            "review_date": "2015-12-23",
            "source": "rt"
        },
        {
            "content": "Probably my favorite Bill Murray movie.",
            "review_date": "2015-12-21",
            "source": "rt"
        },
        {
            "content": "Not as funny as it is an excellent movie with a great message.  Lovely romance as well.",
            "review_date": "2015-12-21",
            "source": "rt"
        },
        {
            "content": "One of my favorites of all time, Murray and MacDowell are can't-miss.",
            "review_date": "2015-12-08",
            "source": "rt"
        },
        {
            "content": "A great performance from Murray. Wonderfully told story that not only makes you laugh but also tugs at the heart.",
            "review_date": "2015-11-13",
            "source": "rt"
        },
        {
            "content": "a witty script that gets beautiful and thoughtful as the story progresses and the character matures. Classic Hollywood entertainment at its best",
            "review_date": "2015-11-13",
            "source": "rt"
        },
        {
            "content": "Great happy movie, bill murray at his best, good life lessons",
            "review_date": "2015-11-07",
            "source": "rt"
        },
        {
            "content": "Charming performance from Murray and an original concept at the time makes Groundhog day an instant classic.",
            "review_date": "2015-10-30",
            "source": "rt"
        },
        {
            "content": "Feels like I keep watching this movie over and over :P",
            "review_date": "2015-10-29",
            "source": "rt"
        },
        {
            "content": "A sweet and romantic film about redemption.",
            "review_date": "2015-10-18",
            "source": "rt"
        },
        {
            "content": "Very entertaining kind of twilight zone kind of comedy.",
            "review_date": "2015-10-12",
            "source": "rt"
        },
        {
            "content": "I never saw Groundhog Day until this very day. It's one of those movies I missed when it came out and just never got around to although, of course, I know it is one of those films that have become a part of our cultural references. I thought of it as just a good comedy that people use as a figure of speech for getting caught in a repetitive cycle. But now that I've seen it, I knew at some point way before it was over, that I was watching a masterpiece, one of those great movies and NOT just because, like \"It's A Wonderful Life\" (another of the great classics), it has a plot that has been endlessly borrowed by television shows and other movies. It is not a movie that declares itself to be profound or important. It comes across as a story that gets to the essence of a man's nature without ever bragging about the fact. Suddenly, you realize you are watching one of the most memorable movies you will ever see. An amusing thing for me is that, had I seen it over twenty years ago when it was released, I would be like the main character because I would have watched the movie countless times by now.",
            "review_date": "2015-09-26",
            "source": "rt"
        },
        {
            "content": "Funny, smart, touching, and with a brilliant original premise, this classic just might bring us Bill Murray's best performance.",
            "review_date": "2015-09-26",
            "source": "rt"
        },
        {
            "content": "A true classic with an amazing message: Live as though you know what you should be doing and live acquiring. Bill Murray is charming as fuck!",
            "review_date": "2015-09-19",
            "source": "rt"
        },
        {
            "content": "I am not usually a fan of romantic comedies but this managed to win me over. Maybe it's because of Bill Murray's performance, or the plot device where he has to relive the same day over and over again. Andie MacDowell also delivers a charming performance and I enjoyed how their relationship grew over time. This is definitely a comedy worth checking out.",
            "review_date": "2015-09-18",
            "source": "rt"
        },
        {
            "content": "A flawless, endearing and heart warming offering from Harold Ramis and a measured and masterfully funny turn from the one and only Bill Murray. Supporting player Macdowell bounces off Murray beautifully, a superb tale of conceit and ego being washed away to allow love to finally touch this lonely isolated man. The themes of time and its value, of change and becoming a good person all course through the film wonderfully. One review spoke of shades of Capra's 'It's a wonderful life' but I also felt a sense of 'Beauty and the Beast' the breaking of the spell and the romance element. In the wrong hands could of easily fell flat, Murrays performance was really engaging.",
            "review_date": "2015-09-14",
            "source": "rt"
        },
        {
            "content": "The entire film's pacing is excellent however the end was brought on rather abruptly and a feeling of dissatisfaction was evident.",
            "review_date": "2015-09-13",
            "source": "rt"
        },
        {
            "content": "It gets a bit repetitive, but Groundhog day is a funny and smart  movie that deserves a viewing.",
            "review_date": "2015-08-24",
            "source": "rt"
        },
        {
            "content": "I watch it again,and again,and again.....",
            "review_date": "2015-08-19",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is one of the first repeating the same day movies, but is actually the most famous out of it until Edge of Tomorrow come out and is just as well known as this. I got a bit of doubt of this before watching it, which I didn't know why, and I thoroughly enjoyed it. Bill Murray is very enjoyable in this and got a lot of laughs out of me. I was a bit worried at first about whenever or not the film is going to be repetitive and boring, but it never felt like it was that which I wanted to see where it's going. The writing by Harold Ramis and Danny Rubin is really great that knows how to make a character cynical, but also know how to make a sweet film as a result. The chemistry is pretty good, and the characters are well done and three-dimensional. There are a lot of jokes in it, and they were really funny. Groundhog Day is a classic movie that deserves the praise that it has got.",
            "review_date": "2015-08-18",
            "source": "rt"
        },
        {
            "content": "A classic endearing, heartwarming film, filled with jokes that last a lifetime, and feels like it hasn't even aged a day.",
            "review_date": "2015-08-13",
            "source": "rt"
        },
        {
            "content": "Love this flick. Bill Murray at his best.",
            "review_date": "2015-08-08",
            "source": "rt"
        },
        {
            "content": "One of my all-time favourite films!",
            "review_date": "2015-08-06",
            "source": "rt"
        },
        {
            "content": "Original, well scripted, well acted, fantastic film.",
            "review_date": "2015-08-03",
            "source": "rt"
        },
        {
            "content": "The very fact this movie exists means my favorite novel, Replay, might never in this medium and that still drives me crazy.",
            "review_date": "2015-08-02",
            "source": "rt"
        },
        {
            "content": "This is an amazing on funny movie with a very interesting plot.",
            "review_date": "2015-07-31",
            "source": "rt"
        },
        {
            "content": "Una de las mejores comedias de todos los tiempos, y una de las mejores películas de Bill Murray, esta película no solo destaca por su ser una idea inteligente, sino realmente fresca en su momento.\n\nEl rey del espectáculo es sin duda Murray, que está fantástico como Phill, y nos ofrece ese \"gilipollas con corazón\" al que tanto nos acostumbró en sus trabajos. Andy McDowell está más...menos presencial, pero cierto es que no le dejan tanto tiempo en pantalla como para demostrar nada.\n\nLo genial de Atrapado en el tiempo es como estructura su guión y edición y nos hace participe de la verdadera desesperación que está sintiendo Phill al estar atrapado en el mismo día; y como consigue sacar el mejor provecho de ello. Su arco de personaje es perfecto y se puede ver su progresión y maduración poco a poco, sin ninguna trampa de guión (salvo quizás el mendigo).\n\nEn definitiva una comedia de obligado visionado.",
            "review_date": "2015-07-26",
            "source": "rt"
        },
        {
            "content": "Kiva idea, hauska komedia. :) (Suom. Päiväni murmelina)",
            "review_date": "2015-07-19",
            "source": "rt"
        },
        {
            "content": "Great feel good story in the end. A reminder to appreciate the important things in life.",
            "review_date": "2015-07-13",
            "source": "rt"
        },
        {
            "content": "Funnier than I expected!",
            "review_date": "2015-07-02",
            "source": "rt"
        },
        {
            "content": "Gee!! I should have watched this movie a long time ago. What was I doing?\nFirst of all, I would like to say that I am very happy. I am so glad that I just watched this movie.\nThe first 10 or 15 minutes of the movie is kinda boring and slow. Then the movie gets more and more interesting. It gets better and better. Wow!!! Groundhog Day is awesome and so adorable. Such a lovely movie. Bill Murray is incredible. The whole cast is incredible. Dialogue is well-written. In the end, I would say Groundhog Day is an excellent comedy-drama-romance movie. And of course, I love it.",
            "review_date": "2015-06-29",
            "source": "rt"
        },
        {
            "content": "An interesting premise, that for a change is decently followed through by the movie.\nOk watch.",
            "review_date": "2015-06-18",
            "source": "rt"
        },
        {
            "content": "Very good movie with a great concept. It later inspired Edge of Tomorrow, which is another great movie.",
            "review_date": "2015-06-11",
            "source": "rt"
        },
        {
            "content": "Groundhog Day repeats the same February 2nd day over and over again, but if you stay until the very end, I promise you won't be disappointed. Unless you have a heart of stone, in which case, I rescind that promise. \n\nGroundhog Day surprised me as it progressed to contain romance, quality, and heart. It inspires people to not take each day for granted.\n\n- Screeningmovies.weebly.com",
            "review_date": "2015-06-06",
            "source": "rt"
        },
        {
            "content": "Simply a great, funny film.",
            "review_date": "2015-05-31",
            "source": "rt"
        },
        {
            "content": "incredibly good. it's totally abt life, u know...",
            "review_date": "2015-05-31",
            "source": "rt"
        },
        {
            "content": "incredibly good. it's totally abt life, u know...",
            "review_date": "2015-05-31",
            "source": "rt"
        },
        {
            "content": "Of all of the films that span the career of Bill Murray, I may have found my all-time favorite. Groundhog Day is a heartwarming film. A true one, not some cliched schmaltz you normally associate romantic comedies with. This, to me, is in the same league as Capra. The best film made by the late, great, Harold Ramis. It starts out as the sarcastic comedy that Murray and Ramis are known for (in the vein of Ghostbusters). Then it turns into a psychological dark comedy, of which we follow Phil's decent into madness in cheery Punxsutawney. Then, a romantic comedy, that pays tribute to that age old premise of going back in time, to get the girl. C'mon, you've all had that desire. Then, something really special happens. We see Phil, not only mastering his sensitivity with women, but with humanity, period. Suddenly, Murray transforms into the world's greatest good samaritan, after spending so much time taking advantage of everyone. This is what you call, ingenious story and character development. It's wholesome, but not saccharine. It's incredibly funny and really, unexpectedly touching.",
            "review_date": "2015-05-28",
            "source": "rt"
        },
        {
            "content": "Great movie! Bill Murray's best work!",
            "review_date": "2015-05-28",
            "source": "rt"
        },
        {
            "content": "Classic bantz babes. She really is. She ground. She hog.",
            "review_date": "2015-05-24",
            "source": "rt"
        },
        {
            "content": "Sweet, charming, and heart-warming. The more you watch it, the more it starts to grow on you. This film made me fall in love with Bill Murray. What a magical film and its effect continues to influence today's movies. Groundhog Day is a smart and funny comedy drama that highlights Bill Murray's wonderful talents as a dramatic actor who can also infuse laughs at the same time. Love it!",
            "review_date": "2015-05-22",
            "source": "rt"
        },
        {
            "content": "This is actually one of my favorite movies.  It stays with me for the last 20 years and it teaches me how to live my life.",
            "review_date": "2015-05-21",
            "source": "rt"
        },
        {
            "content": "The only think I can remember is the Penn State hoodie.",
            "review_date": "2015-05-17",
            "source": "rt"
        },
        {
            "content": "Funny and sometimes over-the-top, Groundhog Day is the perfect comedy to have a good time.",
            "review_date": "2015-05-15",
            "source": "rt"
        },
        {
            "content": "The humor is fantastic, the writing is fabulous. Great acting.",
            "review_date": "2015-04-04",
            "source": "rt"
        },
        {
            "content": "Didn't I already rate this movie, Excellent",
            "review_date": "2015-03-30",
            "source": "rt"
        },
        {
            "content": "Bill Murray delivers comic perfection, but it's the tightrope between pathos and existentialism that the screenplay manages to walk that is most engaging about this classic.",
            "review_date": "2015-03-27",
            "source": "rt"
        },
        {
            "content": "A comedy whose heart is bigger than its laughs, and that isn't a bad thing.",
            "review_date": "2015-03-25",
            "source": "rt"
        },
        {
            "content": "A slyly profound comedy of choice and time. Murray finds perfect pitch while the script adds more laughs, wit and depth with each repeating day. An essential comedy. An essential movie.",
            "review_date": "2015-03-25",
            "source": "rt"
        },
        {
            "content": "Brilliant Ramis concept with outstanding acting to go along with everything else; you should watch this once a year; it's flat-out awesome!",
            "review_date": "2015-03-25",
            "source": "rt"
        },
        {
            "content": "Decent movie I guess.",
            "review_date": "2015-03-15",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is a great movie with a terrific original premise. Having the main character Phil, played by Bill Murray, be a easily unlikable character allows for some great storytelling and character development that you don't get a chance to have in other films. By giving Phil unlimited days to grow and change, while everyone around him will always remains unchanged, only highlights Phil's journey to become a better man that much more. In that journey there is a lot of comedy, with terrific directing from Harold Ramis, and one of Murray's best performances. I love this movie, and no matter how many times I see it I always enjoy it, and it who doesn't love seeing a groundhog driving a pickup truck. \n5 Beards Out Of 5\nCheck out my video review @ https://www.youtube.com/watch?v=u0Hr0ox9BaY",
            "review_date": "2015-03-15",
            "source": "rt"
        },
        {
            "content": "There are a few reasons why Groundhog Day is widely considered to be a classic. Bill Murray being amazing is obviously the first, the premise and execution are genius, the movie is equal parts funny and touching, but also because weatherman Phil's personal transformation is so relatable and easy to pull from, it's hard not to take something away, no matter your thoughts on the film itself. While the ending is probably a touch sappier than it needs to be, Groundhog Day is ultimately about human connection and the capacity for change, and it's beautiful portrayal of why those are so necessary proves it will continue to resonate for many more Feb. 2nd's to come.",
            "review_date": "2015-03-07",
            "source": "rt"
        },
        {
            "content": "This movie will forever be a masterpiece in my book, it's a classic.",
            "review_date": "2015-03-04",
            "source": "rt"
        },
        {
            "content": "The movie has aged well and is arguably Murray's best comedic performance in the 90s. I would recommend this to anyone seeking a solid movie with numerous funny scenes.",
            "review_date": "2015-03-03",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is a clever and funny film that showcases Bill Murray's comedic and dramatic talent.",
            "review_date": "2015-03-02",
            "source": "rt"
        },
        {
            "content": "Probably Bill Murray's most fitting role. The story of a grumpy weather reporter re-living the same day over and over again. Witty and creative,  this is a movie that will leave a big smile on your face.",
            "review_date": "2015-03-02",
            "source": "rt"
        },
        {
            "content": "Simultaneously hilarious and heartfelt, Groundhog Day is not only a showcase for Bill Murray talents in both comedy and drama, but a film which crackles with life.",
            "review_date": "2015-03-01",
            "source": "rt"
        },
        {
            "content": "The best rom com. No words!!",
            "review_date": "2015-02-27",
            "source": "rt"
        },
        {
            "content": "The best Bill Murray movie there is.",
            "review_date": "2015-02-18",
            "source": "rt"
        },
        {
            "content": "This is one of the most heart touching films ever. The movie shows how your suppose to not care about yourself, and help others. Care for one another. Very romantic and funny. Must watch this film!",
            "review_date": "2015-02-15",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is one of those rare comedies that is both kind, heartfelt, smart, and very, very funny.Strong performances, original setting, and great writing make Groundhog Day a true classic.",
            "review_date": "2015-02-15",
            "source": "rt"
        },
        {
            "content": "The concept of time loop always excites the plot, because the story may be repeating in the same phase but changes in narration, people get with the baffled situations and the exploring idea along with the characters in the movie; this is the beauty of such genre.\n\n1993's ''Groundhog Day'' is one such kind of movie that has a good combinations of fiction, curiosity, love, values of feelings and the beauty of knowing new things in our daily life. This movie revolves around the weather reporter Phil who visits Punxsutawney to report about the Groundhog Day with which he is least interested, after his first day in that place he plans to get back but due to weather impediment he has to stay back in that place and from here the film gets its twist and the flow of curiosity where Phil get stuck with the Groundhog Day again and again, such an exciting plot surely never disappoints its viewers.\n\nSome catchy phrases from the movie like ''what if there is no tomorrow? There wasn't one today'' this actually gained my attention, the scene where Phil helps the beggar to make him feel good in his last days of living was portrayed so emotionally that turns to be the enlightening once, overall this movie is best of its kind, Bill Murray and Andie performed the best, movie has a good grip in its full flow and never creates the confusion.",
            "review_date": "2015-02-15",
            "source": "rt"
        },
        {
            "content": "A great repetitively heartwarming film featuring lead actor Bill Murray.",
            "review_date": "2015-02-14",
            "source": "rt"
        },
        {
            "content": "I used to be as pretty as Andi McDowell, back in 1993.  (Sigh).  I can see why this movie was so beloved back then... a quirky little town in PA... an obscure holiday... a supernatural twist... but twenty years later, it doesn't hold up so well.  You cannot recapture the past.",
            "review_date": "2015-02-08",
            "source": "rt"
        },
        {
            "content": "A little predictable, but Murray's sarcasm and deadpan wit make this a classic.  Don't forget about Needle-nose Ned.  Bing!",
            "review_date": "2015-02-07",
            "source": "rt"
        },
        {
            "content": "what a difference a single day can make. especially when that day gets relived infinite times.\na simple romantic comedy with deep philosophical interpretations.",
            "review_date": "2015-02-07",
            "source": "rt"
        },
        {
            "content": "The Future is Not a Given\n\nThis comedy will always be relevant. The title is now a conceptual metaphor for inescapable daily routines. February 2, 1993 was a turning point for both character Phil and actor Bill. Mr. Murray transformed from a callow comedian with an edge to a mature actor with an edge, tempering sarcasm with solemnity.\nBefore GHD: Ghostbusters, Stripes, Caddyshack, Meatballs.\nAfter GHD: Rushmore, Hamlet, Lost in Translation, Broken Flowers.\n\nGroundhog Day sets out to accomplish the inconceivable, where few comedies, or movies of any kind, or art forms of any device dare to tread. It is determined to ultimately answer: How does one find true happiness. The kind of baby that might have been hatched by crossing Woody Allen and Dali Lama. What's truly amazing is that it pretty well achieves this without being pretentious or portentous. Its humble, pedestrian style coincides with it's charitable message. Furthermore, it's a riot!\n\nWhat do you do when the snowstorm of life traps you into a place you don't want to be? Self-destructive anarchy is an option: drinking, stealing, screwing, lying, joyriding and suicide. But this is a big storm so long-term solutions are required. The good news if you're lonely and unhappy? You probably have more time to dedicate to self- improvement (music lessons, ice sculpturing).\nBut challenging the self must have worthwhile outcomes. Phil, believing he's magical, challenges himself to get Rita to sleep with him within 24 hours. He's being dishonest, still playing games and ends up getting slapped in the face repeatedly. It appears that Phil's obstinate pattern of narcissistic behaviour is the cause of this inert existential loop, and one that traps everyone he is in contact with. When he finally realizes that while money, sex and immediate self-gratification might have their perks, they are short-lived and vastly overrated, and a major personality overhaul will be required to escape this Kafkaesque nightmare. An endless, insanely frigid winter is bound to contain him (them (us)) unless new strategies are introduced, alternative energies adopted, the shift away from a self-serving paradigm sustained.\n\nTo his credit, Phil refuses to be cornered into the status quo and become one in a million zombies chanting \"it is what it is\".  Phil actually starts to recover when he gives up trying. When he dismisses the quick fixes (sex, booze, anger, lying and fighting), when he relinquishes his ego and lets go of his smarmy King Joffrey-Justin Bieber juvenility, when he learns to be himself, like himself, settle into his own skin so he can thrive in and, in turn, improve his surroundings. In a reversal of \"It's a Wonderful Life\", rather than Bedford Falls being worse off from George's absence, Punxsutawney is better off with Phil's presence. Routine days require routine acts of kindness and Phil and the entire town collectively benefit from it. Phil is a born-again humanist, one who rescues himself from himself, escaping a solipsistic rotation of mutually-destructive behaviour simply by being a good Samaritan. The forecast: many rewarding days of sunshine.\n\nI always had a bit of a problem with the ending. That the cycle of unhappiness only ends when the guy gets the girl. But now I see that getting the girl was coincidental (and symbolic). Before he gets the girl he has to get himself. That's how you put a reverse spin on a downward spiral. The girl is now able to love the boy because he is love-worthy. The boy could be anyone. A politician. A corporation. You.",
            "review_date": "2015-02-05",
            "source": "rt"
        },
        {
            "content": "Incredible premise that still holds up today, but could have seen less of the love story and more of Bill Murray's comedic antics.",
            "review_date": "2015-02-03",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is a really great move. The concept it very original and interesting, and it's executed so well. It could have felt boring or repetitive, but the direction is great, with some truly amusing scenes. It's well paced and cleverly written. It also has some heart and character development. The plot takes different turns to consistently keep you interested, and its an overall really well made and entertaining movie. The way this movie is executed is so great, making for a smart an genuine comedy. Groundhog Day gets 4.5/5 stars (A).",
            "review_date": "2015-02-03",
            "source": "rt"
        },
        {
            "content": "5 Stars \nThis movie is one of my ALL TIME favorite movies. I watch it every year. There is no aspect about this movie, that I do not like. Brilliant, Brilliant, Brilliant.",
            "review_date": "2015-02-02",
            "source": "rt"
        },
        {
            "content": "Fun movie to watch especially on Groundhog Day!",
            "review_date": "2015-02-02",
            "source": "rt"
        },
        {
            "content": "Make yourself a better person, one day at time.",
            "review_date": "2015-01-31",
            "source": "rt"
        },
        {
            "content": "I reconsidered my life after watching this movie.",
            "review_date": "2015-01-31",
            "source": "rt"
        },
        {
            "content": "Comic perfection. Full review later.",
            "review_date": "2015-01-29",
            "source": "rt"
        },
        {
            "content": "Bill Murray's best performance. Simple idea done the best way possible.",
            "review_date": "2015-01-26",
            "source": "rt"
        },
        {
            "content": "In my top 3 of my all time favorite movies",
            "review_date": "2015-01-15",
            "source": "rt"
        },
        {
            "content": "94%\nWatched this on 13/1/15\nBefore there was a Run Lola Run or Edge of Tomorrow or Source Code, there was Groundhog Day and Bill Murphy is such a talent that he alone is sufficient to run the movie. The film is hilarious and at the same time emotional, dramatic and even dark. There isn't even a single bad moment in this film. Andie MacDowell also gives a fine performance.",
            "review_date": "2015-01-13",
            "source": "rt"
        },
        {
            "content": "A movie that, like its main character, resists the passage of time and it's still great.",
            "review_date": "2015-01-08",
            "source": "rt"
        },
        {
            "content": "This sensational film is a unique look at a stubborn grumpy man realizing what is important in life and changing his ways.\n\nMurray plays a reporter who is sent to report groundhog day in Punxatony the home of groundhog day....\n\nwhat happens next is he relives the same day over and over and over...groundhog day in Punxatony. \nIt's a great experience in filmmaking.  \nIt's awesome to see what he does different everyday and how he adapts to the same circumstances day after day after day. \nIt's fun to watch Murray in this film because his talents are utilized so well. He shows range of comedy and drama here.  \n\nAndie McDowell is good here as the romantic object of Murray.\n\nA fun, unique film that really stands alone in the romantic comedy circles.",
            "review_date": "2014-12-29",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is a 1993 American comedy film directed by Harold Ramis. \nThis comedy with a unique and memorable storyline is a classic. Murray is superb in his role and there is a message there for all of us. Considered one of the top fantasy films of all time.\n1001",
            "review_date": "2014-12-23",
            "source": "rt"
        },
        {
            "content": "A successful dramedy that, unlike most films, makes the most out of it's high concept.",
            "review_date": "2014-11-16",
            "source": "rt"
        },
        {
            "content": "Very funny and clever, with lots of interesting  ideas. 83/100",
            "review_date": "2014-11-14",
            "source": "rt"
        },
        {
            "content": "Forgot how perfect Bill Murray is.",
            "review_date": "2014-11-10",
            "source": "rt"
        },
        {
            "content": "classic murray and alot of my faves",
            "review_date": "2014-11-09",
            "source": "rt"
        },
        {
            "content": "Sweet, yet hilarious movie where Bill Murray has done outstanding once again.",
            "review_date": "2014-11-02",
            "source": "rt"
        },
        {
            "content": "The way Murray carries his character through the film's emotional arcs is astounding.",
            "review_date": "2014-10-29",
            "source": "rt"
        },
        {
            "content": "Almost a perfect movie.  R.I.P to Director Harold Ramis.  This was his best movie!",
            "review_date": "2014-10-28",
            "source": "rt"
        },
        {
            "content": "Original, interesting, smart, a little boring, funny and well acted movie",
            "review_date": "2014-10-28",
            "source": "rt"
        },
        {
            "content": "everything happened so a sappy love story could be told. \nbut ok, it was entertaining.  a christmas/festive season-appropriate watch.",
            "review_date": "2014-10-12",
            "source": "rt"
        },
        {
            "content": "Although it's the same day repeated, but Harold Ramis manages to make everyday fresh as new assisted by Bill Muray's and Andie Macdowell's performances and chemistry, and a number of hilarious laughs.",
            "review_date": "2014-10-11",
            "source": "rt"
        },
        {
            "content": "Funny movie!! Another great bill Murray and Harold Ramis movie. First movie I think ever to have the same day over and over and over again. Love it and love Groundhog Day as the setting of day.",
            "review_date": "2014-10-10",
            "source": "rt"
        },
        {
            "content": "Original, interesting, smart, a little boring, funny and well acted movie",
            "review_date": "2014-10-10",
            "source": "rt"
        },
        {
            "content": "It is a bit too long and it is pretty uneven, but Groundhog Day is a surprisingly good film with excellent premise, superb acting, fine characters, great approach, charming story, some funny scenes and it is an overall fun movie and a nice mix of genres.",
            "review_date": "2014-10-07",
            "source": "rt"
        },
        {
            "content": "A  tale of two movies.The first half is very funny and the last 40 minutes suxxxx arse.",
            "review_date": "2014-10-06",
            "source": "rt"
        },
        {
            "content": "For a film that repeats one day continuously it certainly seems fresh with every viewing. With Bill Murray's delivery and Harold Ramis's writing the laughs keep coming and Andie MacDowell's warm personality really makes you wish this day will never end :)",
            "review_date": "2014-10-05",
            "source": "rt"
        },
        {
            "content": "Whats great about this movie is that it is diverse in many ways. It gets funnier and smarter for every scene till it ends.",
            "review_date": "2014-10-05",
            "source": "rt"
        },
        {
            "content": "With some taste of Twilight Zone,bright comedy of a weather man in a time vortice;the scene of armor truck robbery is cool.",
            "review_date": "2014-09-29",
            "source": "rt"
        },
        {
            "content": "On the shortlist of films I never get tired of watching.",
            "review_date": "2014-09-28",
            "source": "rt"
        },
        {
            "content": "A film you can watch again, and again and again...and again",
            "review_date": "2014-09-25",
            "source": "rt"
        },
        {
            "content": "Groundhog Day overcomes the somewhat gimmicky premise and potential monotony of a man forced to live through the same exact day a thousand times over through wit, charm, and of course, humor; delivering what is arguably Murray's best performance.",
            "review_date": "2014-09-25",
            "source": "rt"
        },
        {
            "content": "Wait, have I really not reviewed this movie? Have I REALLY NOT COVERED one of the greatest films of all time?!?!?!?! I feel ashamed of myself. So many unforgettable moments..... the suicide montage, that \"I am God\" speech........ pure cinematic perfection. And Bill Murray is still Bill Murray, so that only makes things better.",
            "review_date": "2014-09-20",
            "source": "rt"
        },
        {
            "content": "This movie is incredible as always!",
            "review_date": "2014-09-20",
            "source": "rt"
        },
        {
            "content": "In its lightness, there is depth. GROUNDHOG DAY is the most though-provoking comedy-fantasy I'd seen (before the darker 'Being John Malkovich'), starring a bemused Bill Murray who in full circle captures the confusion, frustration, and acceptance of his existence in a time loop. An inventive blend of humor in the briskest setting possible, GROUNDHOG DAY also grows of sweetness as the day revolves (along with Andie MacDowell). But more than the genre crisscross, it's a candid re-examination of life and the many possibilities one can strike when trapped in the time capsule. The whole Groundhog Day may turn out as a rehab stint for Phil, but for viewers, the individual realization of stepping into Phil's shoes is the residue of the chuckles cracked. Finally seeing GROUNDHOG DAY is really (pun intended) a day well spent.",
            "review_date": "2014-09-09",
            "source": "rt"
        },
        {
            "content": "\"Groundhog Day\" is fantastically funny and romantic. Bill Murray and Andie MacDowell stars one of their best films. Unforgettable and smart, one of the most funny comedies ever made. Without doubt, you'll have a joyful time watching this comedy.",
            "review_date": "2014-09-02",
            "source": "rt"
        },
        {
            "content": "A must see film, just for once",
            "review_date": "2014-08-26",
            "source": "rt"
        },
        {
            "content": "So funny. Classic bill murry. Everyone should see this movie once in their life.",
            "review_date": "2014-08-25",
            "source": "rt"
        },
        {
            "content": "iyi güzel de niye öyle oldu arkada? ?",
            "review_date": "2014-08-25",
            "source": "rt"
        },
        {
            "content": "Not as funny as I hoped, the movie is still good and has a cool plot. Murray humour makes me chuckle, but doesn't give me big giant laughs like other actors can. Still this movie had me laughing a few times and the whole stuck in a time loop idea is cool. A little overrated, but still pretty good.",
            "review_date": "2014-08-14",
            "source": "rt"
        },
        {
            "content": "Nothing but a cult movie....",
            "review_date": "2014-08-10",
            "source": "rt"
        },
        {
            "content": "Hilarante y conmovedora.\nPara empezar su trama es creativa, además juegan con esta primicia de una forma asombrosa. Con el ingenio de Ramis y el carisma de Murray hace que vea la película mas de una vez.",
            "review_date": "2014-08-05",
            "source": "rt"
        },
        {
            "content": "Perhaps it's dated, but I just don't think this movie is that funny.",
            "review_date": "2014-08-04",
            "source": "rt"
        },
        {
            "content": "My gosh this movie is perfect. When it's dark, it's really dark, like so depressing that it feels like there are ninjas cutting onions in my room. But I guess you have to be sad sometimes, just to know how to appreciate all the beautiful simple things in life. I know this sounds stupid, but oh boy, do I wanna be stuck in the same day everyday just so I can learn to play the piano, French, Italian and poetry? Yes I do. Even though it's not the point of the movie at all haha.  But yeah, seriously, of all the movies that I've ever watched, tomorrow never seems so goddamn bright!",
            "review_date": "2014-07-28",
            "source": "rt"
        },
        {
            "content": "Loy Machedo's Movie Review - Groundhog Day\n\nI remember as a child watching photographs of this movie in the movie album selection wondering if I should rent out the movie or not. Bill Murray's funny expression in the clock with Andie MacDowell's cute face in the front - well still remember it. However, the name 'Groundhog' always made me dislike the movie. Strangely, it also left a curiosity as to what the movie was all about. So, since I was a young teenager added to the fact that the movie wasn't in the genre of action, animation or hardcore sci-fi (which was my passion those days) I never got around to watching the movie. \n\nFast Forward 20 years. It was only when I was reading the movie reviews of Edge of Tomorrow (2014) that the name Groundhog Day kept popping up. Almost every reviewer stated phrases like 'In the lines of Groundhog Day' or 'The movie was Groundhog Day meets....' - I was like, Man I need to watch this movie (especially since I loved Edge of Tomorrow). And guess what - I loved the movie to bits!\n\nMurray plays Phil Connors, an arrogant and egocentric Pittsburgh TV weatherman who, during an assignment covering the annual Groundhog Day event in Punxsutawney, Pennsylvania, finds himself in a time loop, repeating the same day again and again. After indulging in hedonism and numerous suicide attempts, he begins to re-examine his life and priorities. What makes the movie really funny is the split personality - Phil displays a charm and wit on camera that evaporates the moment the red light goes off; he is bitter, appallingly self-centered, and treats his co-workers with contempt, especially his producer Rita (Andie MacDowell) and cameraman Larry (Chris Elliot). And what makes the movie really entertaining - is how Bill changes with time and how he eventually ends up falling in love with Andie. \n\nBill Murray and Andie MacDowell share an online screen chemistry that is truly second to none. And if nothing else - you will just admire and adore Bill Murray for making your laugh with his expressions and his mannerisms. \n\n\nLoy Machedo's Moment of Truth\nWith Bill Murray, A great script, excellent editing and a very touching ending - you will love this movie.\n\nLoy Machedo's Overall Rating\n9 out of 10\nWatch it!\n\nLoy Machedo\nloymachedo.com | whoisloymachedo.com",
            "review_date": "2014-07-19",
            "source": "rt"
        },
        {
            "content": "Good movie, what prevents it from a great movie is that ending because nothing changed in the end besides him finding a girl he likes so I guess true love works to stop days from repeating over and over",
            "review_date": "2014-07-15",
            "source": "rt"
        },
        {
            "content": "Brilliant movie! I've seen this multiple times! The chemistry between Bill Murray and Andy MacDowell is just fun!",
            "review_date": "2014-07-06",
            "source": "rt"
        },
        {
            "content": "Not only a brilliant comedy, but just a brilliant movie in general. \n\nIts the movie Edge of Tomorrow wanted to be, but failed. Its a wonderfully sweet movie at times, amazingly funny, gets into some great dark humor near the ending. \n\nDefinitely one of my all time favorites. \n\nSad to see such a great talent leave us though. :( \n\nR.I.P  Harold Ramis. (1944-2014)",
            "review_date": "2014-07-02",
            "source": "rt"
        },
        {
            "content": "it reminds me of Chandler Bing..",
            "review_date": "2014-06-30",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is a sharp, witty satire on the facts of life and how the passing of time is critically important for life to go on. This movie could've been undermined very easily with the wrong screenplay, but it gets it almost perfectly right.",
            "review_date": "2014-06-30",
            "source": "rt"
        },
        {
            "content": "Groundhog Day was never going to sweep the Academy Awards away but what it does do is provide you with a unique concept which is thoroughly enjoyable from start to finish. Whilst similar ideas have been provided in other films, Groundhog Day gives it a fresh and funny feel through the comedic talents of Bill Murray.\nSome of the lines are fantastic and really make you chuckle out loud. The film never explains how Murray ends up in this situation but you have so much fun that it never really bother you too much. Harold Ramis brings a wonderful directing style to the movie which can't be easy due to the number of repeated scenes.\nI believe that if there was any other actor in the lead role, then Groundhog Day might have not worked as well. Bill Murray brings his humour to a clever script and a fantastic family comedy.",
            "review_date": "2014-06-29",
            "source": "rt"
        },
        {
            "content": "Bill Murray is a magical man.",
            "review_date": "2014-06-28",
            "source": "rt"
        },
        {
            "content": "Might be the best movie Harold Ramis made with Bill Murray.",
            "review_date": "2014-06-28",
            "source": "rt"
        },
        {
            "content": "Bill Murray gives off one of the finest performances of his career in this comedy masterpiece.",
            "review_date": "2014-06-27",
            "source": "rt"
        },
        {
            "content": "Bill Murray plays Phil Connors, a tv reporter, who gets stuck up in groundhog day. He gets to live the same day over & over again till he meets the love of his life, his producer Rita played by the extremely pretty Andie MaCdowell. Even for a film about repetition, Murray's bittersweet off beat comedy never gets tiring. What a wonderful film !!",
            "review_date": "2014-06-25",
            "source": "rt"
        },
        {
            "content": "Beautifully written and acted Groundhog Day is a wonderful movie.  Bill Murray is charming and funny.  The plot keeps you guessing till the very end.  All in all a great flick.",
            "review_date": "2014-06-22",
            "source": "rt"
        },
        {
            "content": "\"Groundhog Day\" presents an intelligent and inventive premise in its romantic comedy plot while presenting its leading actor Bill Murray in on-key comic timing and dramatically sweet charm.",
            "review_date": "2014-06-17",
            "source": "rt"
        },
        {
            "content": "\"Groundhog Day\" is fantastically funny and romantic. Bill Murray and Andie MacDowell stars one of their best films. Unforgettable and smart, one of the most funny comedies ever made. Without doubt, you'll have a joyful time watching this comedy.",
            "review_date": "2014-06-16",
            "source": "rt"
        },
        {
            "content": "Remembered more for its heartwarming message about selflessness more than its humor, Groundhog Day is one of Bill Murray's absolute best movies.",
            "review_date": "2014-06-14",
            "source": "rt"
        },
        {
            "content": "It's a very, very good comedy... I should like that will happy in my life, realy!",
            "review_date": "2014-06-13",
            "source": "rt"
        },
        {
            "content": "A funny, heartwarming, and smart movie with a great performance from Bill Murray.",
            "review_date": "2014-06-13",
            "source": "rt"
        },
        {
            "content": "Uniquely sweet that warm your heart.",
            "review_date": "2014-06-11",
            "source": "rt"
        },
        {
            "content": "While some would consider it boring for how much it repeats, this movie describes emotion and is done too well for me to say that it's bad. It is very well done and Bill Murray has one of the best performances I've ever seen in this film, although the writing is extremely well done.",
            "review_date": "2014-06-07",
            "source": "rt"
        },
        {
            "content": "Groundhog Day, a rare comedy with something to say about the human condition, answers the question how should we deal with life and death? Watching Bill Murray desperately work through dying and death's stages: recognition, denial, depression, anger, acceptance we see our own attitudes and behaviors only in slightly less dramatic and comedic expression. Should I try to save the world? Can I conquer it? Should I sit back and watch it burn? Or add fuel to the fire just to feel some sense of control? Groundhog Day concludes that maybe even the most arrogant of us can let go of our fear and lust driven megalomania and embrace this life as a beautiful mystery affording the brief opportunity to love. In fact, some of us are lucky enough to live out a slight number of days, repetitive as they may seem, allowing us to learn that to love is to give and receive untethered by the strings of fear, self-loathing, and pride. Now if I could just get that Sunny and Cher song out of my head.",
            "review_date": "2014-06-06",
            "source": "rt"
        },
        {
            "content": "I wonder if he just done everything in that town.",
            "review_date": "2014-06-04",
            "source": "rt"
        },
        {
            "content": "The answer to the question of realistic time travel is construction of a second layer of causation, which is the model used by Groundhog Day. Viewers appreciate internal consistency, which accounts for the reason this movie about time looping gets consistently higher reviews than any other in its genre. Movie makers and other creators, pay attention and learn: the laws of the reality you construct must have integrity to be enjoined.",
            "review_date": "2014-06-03",
            "source": "rt"
        },
        {
            "content": "This movie perfectly blends Bill Murray's wry humor with a high-concept plot.",
            "review_date": "2014-05-31",
            "source": "rt"
        },
        {
            "content": "Funny movie that's fun to watch.",
            "review_date": "2014-05-25",
            "source": "rt"
        },
        {
            "content": "Groundhog Day!  What a great way to start the day...100% brilliant.",
            "review_date": "2014-05-25",
            "source": "rt"
        },
        {
            "content": "One of the greatest comedy / sci-fi concept all time. It was like you feeling a jet lag after you watched it. Fun experience.",
            "review_date": "2014-05-20",
            "source": "rt"
        },
        {
            "content": "Who would of thought a movie about a guy that keeps living the same day over and over again would be any good? Bill Murray's as Phil Connors is genius. Not only is this movie funny but also has its fare share of drama, This movie rules.",
            "review_date": "2014-05-15",
            "source": "rt"
        },
        {
            "content": "One of the best movie of all time! Bill Murray, nuff said.",
            "review_date": "2014-05-13",
            "source": "rt"
        },
        {
            "content": "One of the best movies ever made. Hilarious and brilliant.",
            "review_date": "2014-05-05",
            "source": "rt"
        },
        {
            "content": "Amazing concept, unforgettable execution - a family favourite",
            "review_date": "2014-05-04",
            "source": "rt"
        },
        {
            "content": "Smart, sweet, wise, realistic story with sci fi twists, beautiful and touching",
            "review_date": "2014-04-22",
            "source": "rt"
        },
        {
            "content": "A funny romantic comedy, with an outstanding performance of Bill Murray at the presenter who repeats one day, February 2, the Groundhog Day, repeatedly. First, come the surprise, then frustration, then to use the situation to his own benefit and finally redemption.\nThere are no pretensions of a scientific support, about time travel, parallel universes or things alike. It just happens. Enjoy the film.",
            "review_date": "2014-04-19",
            "source": "rt"
        },
        {
            "content": "\"What would you do if you were stuck in one place and every day was exactly the same, and nothing that you did mattered?\"  \"That about sums it up for me.\"\n\n\nThere are films that don't necessarily need inventive and artistic camera shots, or groundbreaking special effects, or even gorgeous cinematography to be considered masterpieces. Sometimes a film like Groundhog Day comes along with a smart and charming story with performances and characters that are so well developed that it automatically connects with audiences by reaching for the heart, and turning it into an instant classic. With a premise that might seem boring due to the fact that the lead character has to repeat and live the same day over and over again in a small Pennsylvania town, director Harold Ramis manages to catch our attention by creating interesting characters and through a witty script he introduces important themes such as existentialism in a rather refreshing and light way. It is a very spiritual film without ever feeling religious. In a way the story reminded me of Dickens' A Christmas Story where you have an egocentric and arrogant character who is transformed once he experiences a supernatural event. In Groundhog Day the transformation is much more subtle while at times it does go to dark places. Ironically Bill Murray went on to play Scrooge in one of the many adaptations of Dickens' classic tale. Murray is the heart and soul of this film and although he is hard to like at the beginning of the film there is something about his performance that keeps us interested in him. This isn't one of those laugh out loud comedies (I don't think I laughed at a single scene), but it is so charming that it is impossible to resist and it leaves you with a smile on your face during its entire running time. Once it ends we realize how philosophical this film really was, but Ramis kept us so entertained that we didn't really pick up on it until the very end.\n\nThe original screenplay for Groundhog Day was co-written by Harold Ramis and Danny Rubin. It centers on a weatherman named Phil Connors (Bill Murray) working as a TV meteorologist for a local Pittsburgh station. Phil is an arrogant narcissist who is expecting to work for a more important broadcasting channel soon. On the eve of Groundhog Day, he is sent to the small town of Punxsutawney to cover the annual festivities along with his producer, Rita (Andie MacDowell), and cameraman Larry (Chris Elliott) with whom he doesn't get along very well. Phil hates this assignment which he has covered over the past four years so he doesn't put much effort into his report. After covering the event an unexpected blizzard forces the roads to close so Phil and his crew are stuck in Punxsutawney for another day. The next day Phil wakes up and realizes he has to relive Groundhog Day all over again and he's the only one that notices that the day unfolds in the exact same way. Everyone else seems to be living the day for the first time, but he finds himself stuck in the same day over and over again like if he were trapped in a loop hole with no way out.\n\nThe premise seemed boring for me at first considering I thought it was going to repeat itself too many times, but Murray's character is so fun and he relives each day in so many different ways that it managed to keep me entertained. At first Phil feels like he has gone mad and tries to rationalize things, but once he realizes his fate he decides to take advantage of it. Being the self centered person he is, Phil lives knowing he wont have to suffer any consequences, but eventually he grows tired of this hedonistic lifestyle. He feels so desperate that he tries to commit suicide in every possible way, but no matter what he does he still wakes up the next morning reliving Groundhog Day. Eventually Phil gives up on living for himself and begins looking at others and caring for them. He begins to find purpose and joy in life in helping others. Ramis has made a deeply spiritual and philosophical film without the audience realizing it at first. It could have become tedious and preachy, but it never does because the characters are subtly transformed and the growing chemistry between Phil and Rita is believable. Ramis found a way to reach out to our hearts and remind us that life isn't about living for ourselves, but finding pleasure in helping and caring for others. Groundhog Day is a movie about self-improvement and becoming a better person and I can't think of a better actor to have pulled it off so well as Bill Murray did in his transformation here.",
            "review_date": "2014-04-16",
            "source": "rt"
        },
        {
            "content": "this gave my heart a boner",
            "review_date": "2014-04-16",
            "source": "rt"
        },
        {
            "content": "I watched it for the first time and immediately understood why it is a classic. Perfect ending.\n\nDoes Andie McDowell know what accent she's supposed to have?",
            "review_date": "2014-04-06",
            "source": "rt"
        },
        {
            "content": "Original and funny. Murray is master here.",
            "review_date": "2014-04-06",
            "source": "rt"
        },
        {
            "content": "While slow at times, and not very funny, Groundhog day is still to this day a sweet romance story with an interesting storyline and some good performances. Never again will I think of Sonny and Cher the same way.",
            "review_date": "2014-04-05",
            "source": "rt"
        },
        {
            "content": "Having now seen Groundhog Day myself, I wonder how teenagers - whose opinions of this film are probably not influenced by nostalgia - react to this film.  Compared to comedies today, it is slower paced, strives for less belly-laughs, and is mostly just a quieter film.  Do teens today have the patience to sit through 5 minutes of set-up with a significantly smaller gag ratio than today's comedies?  Groundhog Day would never have been profitable, had it been made in the present.  Which is a sad thing, as Groundhog Day reminds one of how charming the \"quiet\" comedy could be.\n\nTV weatherman Phil Connors is as arrogant as they come.  He's rude to those around them, and insists he's a star.  Due to unexplained circumstances, however, Connors is set in a time loop, in which he must relive Groundhog Day, over and over again.  And he has no idea how to get out of the loop.\n\nSimply summarized, Groundhog Day is as pleasant as a film gets.  While belly laughs are rare, there is a satisfactory amount of chuckles and smiles throughout the movie, but even then, one could argue that there are less such instances than in other comedies.  For me, Groundhog Day is good entertainment, in spite of slightly less plentiful gags than modern audiences are used to.  The story and protagonist are interesting enough that the film still works in spite of all that.\n\nGroundhog Day has its sweet moments, mostly because of the romance between Connors and new producer, Rita Hanson, that works surprisingly well.  Even when working with occasionally cheesy dialogue, the two leads have great chemistry, and thus, their relationship remains interesting and believable.  It gives the film a much needed extra dimension.\n\nMy sole complaint (which is more a matter of preference than anything), is that Groundhog Day elects to avoid some of the darker elements of its premise.  Groundhog Day is played mostly for comedy.  Though it is implied that Phil Connors is frustrated with living the same day over and over, there is no dramatic scene or outlet to truly express this.  Even during a montage in which he tries to commit suicide in various ways, it is done for purely comedic purposes.  The ending is also a pinch unsatisfying, thanks to a cop-out that results in a somewhat hasty finale.  The lighter tone of the film is largely to blame for this. \n\nGroundhog Day boasts an enjoyable cast.  Bill Murray is delightful in the lead, beautifully balancing humor and drama.  Andie MacDowell generally gets it right, but falters at time with some of the less intelligent dialogue.  Stephen Tobolowsky is a highlight among the talented cast, portraying an overly-friendly insurance agent named Ned Ryerson.  The film wisely chooses to limit his presence to just a few scenes, thus eliminating any chance of him becoming overbearing or obnoxious as he well might have with more screen time.\n\nGeorge Fenton's score is playful and fun.  Though it does contain some unfortunate '90's synths and at times, ill-suited electric guitar, it's a pleasing and enjoyable effort by Fenton.\n\nOne could argue that Groundhog Day is an overly sentimental and innocuous film - a good time-killer, but nothing more.  I would argue that it's a bit more than that.  It does some interesting things with its premise, and has more depth than one might expect (even if it could have supported significantly more).  Even if the ending disappoints a bit, and there aren't many big laughs, Groundhog Day is entertaining enough and funny enough in an endearingly mild way to make for pleasant and likable entertaining.  Labeling it as a masterpiece - as many have come to do so - is absolutely stretching things more than a little.  But even if its cultural significance didn't make it a must-see by most standards, it's an enjoyable enough film that it deserves a recommendation anyway.",
            "review_date": "2014-04-01",
            "source": "rt"
        },
        {
            "content": "Get's a bit preposterous after awhile.",
            "review_date": "2014-04-01",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is a pretty well renowned comedy from the early 90's, so I'm not even going to bother summarizing it in depth. I guess it won't hurt to include the basic premise. Phil is a tv reporter sent to Puxsatawney (don't know if that's even right) to report on Groundhog day. Being in the town he hates so much, he can't wait to report and just leave. Instead, a storm traps everyone in town, and he's forced to stay overnight with his crew. The next morning, he realizes he's living the exact same day over again. The day after that, it's the same situation. Knowing every day is the same with a clean slate the second he wakes up,  Phil's life changes radically when he decides to take advantage of the new realm he's living in by making decisions he would never do in his boring old life. Fuck, I just said I wouldn't summarize. Oh well.\n\nIt's easy to see why Groundhog Day is regarded as a comedy classic. Bill Murray is at the top of his game here, and Harold Ramis really created a interesting concept that was perfect for comedy and just ran with it. Besides the campy 80's ish' feel to the whole thing, there's really not that much wrong with it. I'm really surprised I never fully watched it until recently, and I gotta say it definitely receives marks for it's originality. There was nothing before or after like it, and that's why movies like Groundhog Day continue to stand out. It's funny, philosophical, and just plain fun to watch. Perfect for FRIDAY NIGHT PIZZA PARTIES. Fuck I'm just way too lazy for this right now.\n\nGroundhog Day is an innovative comedic effort from Harold Ramis, featuring a fantastic premise and awesome job done by Bill Murray.",
            "review_date": "2014-03-30",
            "source": "rt"
        },
        {
            "content": "One of the best movies I've ever seen. It is one of my 20 most favorite films of all time. Rod Leveridge",
            "review_date": "2014-03-27",
            "source": "rt"
        },
        {
            "content": "One of the most well written comedys of the 90's.",
            "review_date": "2014-03-25",
            "source": "rt"
        },
        {
            "content": "It's a shame that following this film Murray and Ramis had a falling out with each other (it's unclear if the two reconciled before Ramis's death). I've talked about chemistry between performers, but I feel people underestimate how important the chemistry between a director and actor can be toward benefiting a film. Behind the camera and in front of it, this was Murray and Ramis at the top of their game together. Groundhog Day is certainly funny - even darkly funny at times - but it's also heartfelt without ever feeling contrived. Sure, Ramis has done films that are funnier, but I can't think of a film he's ever made - and the same can be said of Bill Murray's performance - that's as deep and meaningful as this one.\n\nFull review at http://silverscreenfanatic.com/2014/03/18/benjamins-stash-11/",
            "review_date": "2014-03-18",
            "source": "rt"
        },
        {
            "content": "Unique and drama-filled, but it still fits to the comedic genre.",
            "review_date": "2014-03-11",
            "source": "rt"
        },
        {
            "content": "It took me a long time before I got around to seeing Groundhog day, but I always looked forward to it for being a comedy led by Bill Murray.\n\nGroundhog Day features a story that has been told many times before, sourcing as far back as the 1892 story \"Christmas Every Day\", and so to succeed the film has to take a fresh angle on the concept of being forced to relive the same day over and over. And luckily, thanks to Harold Ramis' clever writing combined with his most skilful direction, Groundhog Day comes out as a seriously successful and entertaining comedy film, moreso than his directional debut Caddyshack which I found myself not to be impressed with.\nGroundhog Day takes the simple nature of its story and manages to fill it with a lot of meaningful drama for its protagonist as well as a lot of comedic opportunities which are harnessed as best as they could be, and it helps to overshadow the fact that the story never explains how the day is stuck in an infinite loop. And while the film does encounter some tonal shifts which make the humour go between slapstick gags, dark humour and romantic comedy without ever having a consistency, Groundhog Day still proves to be thoroughly successful.\nHarold Ramis holds a tight grip over Groundhog Day as a means of ensuring that it succeeds, and with his experienced wisdom in comedic filmmaking her puts out an excellent effort in Groundhog Day where he takes the story on an intelligent journey without ever exiting its simplicity or even the same day for a time period of over 10,000 years. Yes, it has been confirmed by Harold Ramis that Groundhog Day lasted over 10,000 years in the eyes of Phil Connors, and the idea of that makes the comedic impact of the film all the more hilarious.\nI found myself laughing consistently at the gags in Groundhog Day and learning something from them as they began to be more philosophical in their exploration of life. Groundhog Day is a very intelligent film which asks what the meaning of life is when you are faced with an unwanted immortality and life which is stuck in a loop and reminds us one of the most important meanings of life. Viewers that walk away from Groundhog Day having enjoyed 101 minutes of well constructed comedic material may also find themselves walking away with a greater look at their own life and sense of one's direction. Groundhog Day has some crude humour, but it never deviates from the positive meaning and good intentions of the filmso it is likely to leave audiences with a smile on their face and a sense of happiness to see it come together so well in the end.\nFrom a dramatic standpoint, Groundhog Day is a very intelligent success. It proves to be a more insightful and intelligent film than you'd expect or than it even needed to be, because Harold Ramis' dedication to making Groundhog Day an original effort never fails. In Groundhog Day, the dramatic elements surrounding protagonist Phil Connors never come up short and make a compelling effect which the viewer is really able to feel for, so Groundhog Day even uses its zany plot to connect to its viewers on an emotional level.\nA lot of the success in Groundhog Day is thanks to the talents of the late Harold Ramis who wrote the film with Danny Rubin and then directed it to a becoming a memorable and entertaining experience, and it succeeds from a visual standpoint as well since the scenery is lush and shot with fine cinematography. The musical score is also good.\nBut the most memorable aspect of the film is the dedication of Bill Murray in the lead performance.\nBill Murray's lead performance in Groundhog Day is the most unforgettable element of the film. The Academy Award nominated comedian and actor has a real legacy to him for his success over several decades, and Groundhog Day is one of his most notable efforts. In Groundhog Day he keeps himself in tune with the comedic atmosphere as it charters through the aforementioned territory of slapstick gags, dark humour and romantic comedy. There is not a single moment where he slips up, because his dedication to the character Phil Connors makes the story a lot more compelling since he is a very likable protagonist and his chemistry with the other actors and ability to engage with all the comedic elements of the film is just refreshing. Bill Murray is both successful as a comedic actor and a dramatic one in Groundhog Day, and his chemistry with Andie McDowell makes the romantic element of the film a stronger one instead of just a simple subplot played off as another unexplored idea. Bill Murray is the single greatest comedic virtue that Groundhog Day can boast, and his collaboration with Harold Ramis brings out some of the best talents that they both have to offer. It is a shame that this film ended up causing a more than decade-long conflict between them in the aftermath.\nAndie McDowell also gives a good performance. Her charm in Groundhog Day is reminiscent of the kind of charm that Julia Louis-Dreyfus put into her performance as Elaine Benes in Seinfeld, but in a more restrained and friendly effort. Her chemistry with Bill Murray has a genuine feel to it which is enlightening and friendly. She has a smile which just lights up the screen, and so she is a real genial presence in Groundhog Day.\nChris Elliot manages to bring his own comedic touch to his supporting performance in Groundhog Day, and Stephen Tobolowsky has his moments.\nHarold Ramis' small cameo was also a nice touch.\n\nSo it's easy to see why Groundhog Day is considered to be a comedy classic, because the film is both hilarious and touching thanks to Harold Ramis' tenacious handling of the story and Bill Murray's unflinching lead performance.",
            "review_date": "2014-03-10",
            "source": "rt"
        },
        {
            "content": "Bill Murray's deadpan delivery shines in Groundhog Day, and for good reason. It makes the rather uninspiring plot watchable and very entertaining. The dramatic transformation of his character from selfish to selfless is reflected in the characters he interacts with every single day, while remaining comical throughout. His constant desire to please his beloved is astonishing and charming. Groundhog Day is a timeless film that, despite its flaws, has become a cult classic.",
            "review_date": "2014-03-04",
            "source": "rt"
        },
        {
            "content": "This movie is an absolute classic - a romantic comedy with a truly original story. Succesfully balancing the underlying drama with the romance and comedy to back up and drive the story. Perfectly executed by both the acting cast - with Bill Murray in the lead role and performance of his life - aswell as by the director Harold Ramis. Simply wonderful...",
            "review_date": "2014-03-04",
            "source": "rt"
        },
        {
            "content": "Funny, Romance, Science-Fiction, Comedy and drama. Almost all about life on one screen. Good acting, and script. But it has not good enough on cinematography. Once more this movie gives another choice about life.",
            "review_date": "2014-03-04",
            "source": "rt"
        },
        {
            "content": "I remember reading somewhere that Harold Ramis said that the character of Phil Conners actually spent somewhere between 10 and 15 years trapped in the same day. \n\nIt's an all time classic which never gets old. Bill Murray is at the top of his game in this one.",
            "review_date": "2014-03-02",
            "source": "rt"
        },
        {
            "content": "What a great movie. It's more than you expect.",
            "review_date": "2014-02-28",
            "source": "rt"
        },
        {
            "content": "Con una historia y y trama inteligente y dulce se vuelve una pelicula fabulosa",
            "review_date": "2014-02-28",
            "source": "rt"
        },
        {
            "content": "Very funny at times. Good story and Bill's performance was enjoyable. I'd recommend it.",
            "review_date": "2014-02-27",
            "source": "rt"
        },
        {
            "content": "One of my favourite movies. Bill Murray in one of his best roles.",
            "review_date": "2014-02-27",
            "source": "rt"
        },
        {
            "content": "One of the best rom-coms ever!",
            "review_date": "2014-02-25",
            "source": "rt"
        },
        {
            "content": "Una gran película!! #retropelícula",
            "review_date": "2014-02-24",
            "source": "rt"
        },
        {
            "content": "Easily one of the best comedies of all time. Murray's deadpan yet insane performance and Ramis' slick, intelligent direction are the biggest highlights.",
            "review_date": "2014-02-24",
            "source": "rt"
        },
        {
            "content": "Just like the countless Groundhog Days that Phil lives again and again, this film deserves to be watched again and again for all its charming, witty, humorous, and warm-hearted natures. This is the primary example about a comedy can be attractive, intelligent, and bring smiles, big smiles, to its audience without being cynical and/or obscene. To the memory of Mr. Harold Ramis (1944-2014).",
            "review_date": "2014-02-24",
            "source": "rt"
        },
        {
            "content": "Existentialism abounds.",
            "review_date": "2014-02-17",
            "source": "rt"
        },
        {
            "content": "The story is about a bored weatherman is sent to cover the ground hog and his shadow on Groundhog Day, only to discover that the same day repeats itself, no matter what he does. This movie is funny in a dark twisted way and the writing is smart.",
            "review_date": "2014-02-13",
            "source": "rt"
        },
        {
            "content": "My favorite movie of all time.",
            "review_date": "2014-02-12",
            "source": "rt"
        },
        {
            "content": "One of Bill Murray's best films. Murray's character is trapped in a nightmare that can only be awakened through a something he knows but isn't quite ready to deal with. It the whole self exploration plot that gets me every time and the characters match it perfectly.",
            "review_date": "2014-02-11",
            "source": "rt"
        },
        {
            "content": "Good movie, Am I right or Am I right or Am I right? Right right right.",
            "review_date": "2014-02-11",
            "source": "rt"
        },
        {
            "content": "Gets better with age. A modern comedy classic.",
            "review_date": "2014-02-05",
            "source": "rt"
        },
        {
            "content": "HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHHAHAHAHAHAHHAHAHAHAHAHHAHAHA!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2014-02-03",
            "source": "rt"
        },
        {
            "content": "Probably the best movie of all time.",
            "review_date": "2014-02-02",
            "source": "rt"
        },
        {
            "content": "Dej'a vu at its finest... ?",
            "review_date": "2014-02-02",
            "source": "rt"
        },
        {
            "content": "A brilliant classic that can be seen again and again. It's become so mainstream people refer to anything similar as ground hogs day",
            "review_date": "2014-02-01",
            "source": "rt"
        },
        {
            "content": "Phil: 'What would you do if you were stuck in one place and every day was exactly the same, and nothing that you did mattered?' \nRalph: 'That about sums it up for me.' - It's like I said, I love this film, I've seen it over a hundred times, call me Bronco.",
            "review_date": "2014-01-31",
            "source": "rt"
        },
        {
            "content": "Childhood favorite of mine.",
            "review_date": "2014-01-30",
            "source": "rt"
        },
        {
            "content": "Well written and directed.  Bill Murray's best performance in a movie.",
            "review_date": "2014-01-27",
            "source": "rt"
        },
        {
            "content": "Groundhog Day seems like it would be more good in theory than in practice. It is understandable how one might think that a movie about a man reliving the same day over and over could get boring. And I think that is the true brilliance of the film... it doesn't. The film is so brilliantly executed. It's fascinating watching Phil go through different stages as time progresses (or doesn't...). First he goes through frustration and denial, then acceptance, then he begins to use his misfortune for his benefit, then he slips into depression and then he ultimately becomes a better person, using his curse to help others. This a comedy that is so ingenious that it is a shame that it's not more widely known. Groundhog Day, in my opinion, should be a classic.",
            "review_date": "2014-01-23",
            "source": "rt"
        },
        {
            "content": "I've finally seen it.  The incredible amount of references I've heard to this movie for decades after its release testify to its delightful originality and earn it obvious classic status.",
            "review_date": "2014-01-23",
            "source": "rt"
        },
        {
            "content": "A sweet and tender comedy that has a moral and its lessons.",
            "review_date": "2014-01-22",
            "source": "rt"
        },
        {
            "content": "Re-run: What if you get stuck today in a loop for your entire life without tomorrow?",
            "review_date": "2014-01-09",
            "source": "rt"
        },
        {
            "content": "Very engaging and entertaining as well as funny and sweet. It was a very rewarding experience!",
            "review_date": "2014-01-06",
            "source": "rt"
        },
        {
            "content": "The most brilliant film I've ever seen in an hour encapsulates the essence of the creation of man! So deep and true simply genius!",
            "review_date": "2014-01-06",
            "source": "rt"
        },
        {
            "content": "Funny in an old school way. at times silly, at times even a bit deep and dark. A feel good movie and a 90's comedy classic. In the end it doesn't matter that it doesn't make sense.",
            "review_date": "2014-01-05",
            "source": "rt"
        },
        {
            "content": "What if you could only live the same day over and over again?. This is a main plot in Groundhog Day, where Bill Murray finds himself living on February 2, everyday. This comedy still as fresh as it was 21 years ago.",
            "review_date": "2014-01-05",
            "source": "rt"
        },
        {
            "content": "Not sure if this was entertaining at the time, now just good enough as background noice. Bill murray, so annoying.....although he did have a decent plan going on....",
            "review_date": "2014-01-04",
            "source": "rt"
        },
        {
            "content": "A brilliant, charming and inventive romantic comedy, and Bill Murray is simply superb in this understated and endearing role.",
            "review_date": "2013-12-29",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is an ingenious, heartfelt romantic comedy that showcases an excellent performance by Bill Murray, and is still influential with its smartly unique premise.",
            "review_date": "2013-12-27",
            "source": "rt"
        },
        {
            "content": "Haven't seen it in a while but I still remeber it just fine. I don't much like romantic comedies for starters, but this one was funny and likeable. Bill Murray is at his funniest and he defintley knows what he's doing, the writers also manged to create an intresting premesis that keeps us interested with the whole movie.  A true comedy classic.",
            "review_date": "2013-12-24",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is charming and heartfelt, and Bill Murray avoids sentiment in favor of a funny, profound performance.",
            "review_date": "2013-12-19",
            "source": "rt"
        },
        {
            "content": "I wish I could give this movie 6,7 or 10 stars!",
            "review_date": "2013-12-18",
            "source": "rt"
        },
        {
            "content": "This movie is just relentlessly happy, funny, and Bill Murray - need I say more?",
            "review_date": "2013-12-18",
            "source": "rt"
        },
        {
            "content": "bit repetitive with no story",
            "review_date": "2013-12-15",
            "source": "rt"
        },
        {
            "content": "I can't not watch this movie when it's on, I have too!!! And I still think it's funny after all these years, classic!!",
            "review_date": "2013-12-15",
            "source": "rt"
        },
        {
            "content": "Awesome movie, very original, one of Bill Murray's best",
            "review_date": "2013-12-09",
            "source": "rt"
        },
        {
            "content": "Groundhog driving a truck with Bill Murray, priceless",
            "review_date": "2013-12-08",
            "source": "rt"
        },
        {
            "content": "Do it again and again till you get it right. \"Groundhog Day\" is a memorable movie and Bill Murray have done a great job.",
            "review_date": "2013-12-07",
            "source": "rt"
        },
        {
            "content": "A truly wonderful movie. Watch it. A truly wonderful movie. Watch it. A truly wonderful movie. Watch it.",
            "review_date": "2013-12-06",
            "source": "rt"
        },
        {
            "content": "Every time I watch this movie, I step into the shoes of Phil Connors and imagine what I could do with one day and all the time at my disposal. How would I utilize all that power? Would I do good things with it, or would I surprise myself and do evil things? And if I could choose a day which day would I choose? Just too many questions to get lost in. All-around excellence.",
            "review_date": "2013-12-05",
            "source": "rt"
        },
        {
            "content": "Half-hour too long.\n\nhttp://pandoraxsage.blogspot.com/2013/10/the-movie-watching-project.html",
            "review_date": "2013-12-02",
            "source": "rt"
        },
        {
            "content": "absolutely delightful - even better with multiple viewings.",
            "review_date": "2013-11-29",
            "source": "rt"
        },
        {
            "content": "If you haven't seen this movie... shame on you. Easily one of the best romantic comedies to ever grace the screen. This movie nails it BIG time. On a side note, I can only imagine just how many people watch this every year on groundhog day. It's that good.",
            "review_date": "2013-11-15",
            "source": "rt"
        },
        {
            "content": "A bit saccharine sweet for my taste - didn't pass the 5 laugh rule either",
            "review_date": "2013-11-14",
            "source": "rt"
        },
        {
            "content": "Murray displays perfectly and passionately the effects of what too much of a good thing could really do to a person yet still manages to squeeze out some of the refreshingly sarcastic comic relief we've come to expect from him.",
            "review_date": "2013-11-07",
            "source": "rt"
        },
        {
            "content": "Filme que até se vende como bobo, mas que mostra um coração e uma inteligência tão incomuns. Bill Murray excelente.",
            "review_date": "2013-11-07",
            "source": "rt"
        },
        {
            "content": "Looking at the plot this movie would be nothing special. But Bill Murray + good lines make it quite special.",
            "review_date": "2013-11-07",
            "source": "rt"
        },
        {
            "content": "Finally a film in the National Film Registry that I get! Forget the fact that Groundhog Day is hilarious, what makes it such a philosophically-important, cultural phenomenon is that you're constantly reliving each day with Bill Murray, resulting in you sub-consciously re-evaluating your own life. Groundhog Day was an experience that I encourage everyone to take.",
            "review_date": "2013-10-31",
            "source": "rt"
        },
        {
            "content": "Modern classic comedy - better than most SNL alum - though not as good as Ghostbusters either. Well edited, with Macdowell as the tasty treat worth going through all that repetition.",
            "review_date": "2013-10-30",
            "source": "rt"
        },
        {
            "content": "Absolutely love this movie!! This and What about Bob tie for my favorite Bill Murray movies.",
            "review_date": "2013-10-24",
            "source": "rt"
        },
        {
            "content": "Just love it it it it it it etc",
            "review_date": "2013-10-23",
            "source": "rt"
        },
        {
            "content": "Wonderfully original and a comedy classic, Bill Murray makes this funny movie Head-crackingly hilarious.",
            "review_date": "2013-10-09",
            "source": "rt"
        },
        {
            "content": "The was a very long day !!! Dark , funny , makes u think !",
            "review_date": "2013-10-07",
            "source": "rt"
        },
        {
            "content": "Murray and MacDowell are both perfect in this and they are brilliant in this. One of Murrays funniest movies.",
            "review_date": "2013-10-05",
            "source": "rt"
        },
        {
            "content": "Wonderfully cast and directed, Groundhog Day is a funny, light-hearted romantic comedy. The chemistry and the way they play off each other really shines through, this probably makes for a stronger movie then would have been - luckily for us, because it's a classic.",
            "review_date": "2013-09-30",
            "source": "rt"
        },
        {
            "content": "Immortality and omniscience make the main character walk from hedonism to nihilism and finally Philanthropy.",
            "review_date": "2013-09-26",
            "source": "rt"
        },
        {
            "content": "an amazing time travelled love story take an audience to a place where there never thing of",
            "review_date": "2013-09-26",
            "source": "rt"
        },
        {
            "content": "Groundhog Day - a light, charming classic.",
            "review_date": "2013-09-22",
            "source": "rt"
        },
        {
            "content": "I've seen funnier comedies but not many deeper ones.",
            "review_date": "2013-09-14",
            "source": "rt"
        },
        {
            "content": "A cute romance possessing endless charm and clever jokes cracked by the entertaining lead character.",
            "review_date": "2013-09-08",
            "source": "rt"
        },
        {
            "content": "The funniest well written comedy of all",
            "review_date": "2013-09-06",
            "source": "rt"
        },
        {
            "content": "This is a classic.. example of a movie that does not know how to execute.  The plot is cute and probably the reason it is considered a great American comedy, but if we are being honest it makes absolutely no sense.  Cheap laughs and poorly executed",
            "review_date": "2013-08-26",
            "source": "rt"
        },
        {
            "content": "Simple movie about one specific message..Love your life and let it go because you cannot stand to live your days the same. You have a great chance every day's morning to learn new things, help poor people, love, and laugh.",
            "review_date": "2013-08-20",
            "source": "rt"
        },
        {
            "content": "Honestly enjoyable and well written romantic comedy that delivers on a good concept with excellent acting from bill murray",
            "review_date": "2013-08-17",
            "source": "rt"
        },
        {
            "content": "classic romance comedy.",
            "review_date": "2013-08-17",
            "source": "rt"
        },
        {
            "content": "Very funny, one of my favorite movies.",
            "review_date": "2013-08-13",
            "source": "rt"
        },
        {
            "content": "Bill Murray classic comedy",
            "review_date": "2013-08-11",
            "source": "rt"
        },
        {
            "content": "Creative and heartfelt, and certainly not without plenty of laughs.  Bill Murray manages to pull off all sides of Phil Connors with great charisma and solid comedic timing.  Groundhog Day does tend to fall into formulaic patterns, but even those seem to turn into strengths thanks to its charming script.  Your only complaint may be...it's a tad repetitive.",
            "review_date": "2013-08-10",
            "source": "rt"
        },
        {
            "content": "one of the best bill murrays",
            "review_date": "2013-08-10",
            "source": "rt"
        },
        {
            "content": "One of my top 10 movies!",
            "review_date": "2013-08-09",
            "source": "rt"
        },
        {
            "content": "I thought that this film lacked drive and delivered a sloppy performance",
            "review_date": "2013-08-09",
            "source": "rt"
        },
        {
            "content": "Possibly my favorite comedy",
            "review_date": "2013-08-06",
            "source": "rt"
        },
        {
            "content": "bill Murray is epically funny",
            "review_date": "2013-08-05",
            "source": "rt"
        },
        {
            "content": "Pure genius.. seeing it quickly explained to me why it's one of the highest rated movies in it's category.",
            "review_date": "2013-08-02",
            "source": "rt"
        },
        {
            "content": "I really liked this movie and you will too. It actually wanted to make me the same day over and over.",
            "review_date": "2013-07-30",
            "source": "rt"
        },
        {
            "content": "Good funny not as good as some of bill Murray's other movies but still good",
            "review_date": "2013-07-30",
            "source": "rt"
        },
        {
            "content": "A fantastic movie that is humorous, sweet and affectionate in equal measure. Bill Murray delivers a charismatic and almost riotous deadpan performance; it is clear he is enjoying himself in the one of his finest roles.",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "Charmingly funny with a hint of clever cynicism that is eventually replaced by love, spirit, and a great moral. Even though the movie revolves around repetition, it doesn't get boring or old.",
            "review_date": "2013-07-23",
            "source": "rt"
        },
        {
            "content": "ADD and a plot that repeats over and over are not conducive.",
            "review_date": "2013-07-20",
            "source": "rt"
        },
        {
            "content": "a true rarity-a movie Hollywood hasnt done over and over and over and over and over....",
            "review_date": "2013-07-20",
            "source": "rt"
        },
        {
            "content": "One of the best comedies I've seen in my life!",
            "review_date": "2013-07-20",
            "source": "rt"
        },
        {
            "content": "Greg: In this special edition of Reel Heroes we look back at one of our favorite heroes: Phil Conners from Groundhog Day.\n\nScott:  Greg, this is one of my all-time favorite movies, and it's no coincidence that it's due to the strength of its hero character.  For me, Phil Connors is one of the most memorable movie heroes I've ever had the pleasure of watching on the big screen.\n\nGreg: It is a great movie and a lot of fun. Phil Conners is Pittsburgh's most egotistical weatherman. We meet him on Groundhog Days where he has a special assignment to Punxsutawney to report on Punxsutawney Phil - the groundhog who reveals whether winter will last another six weeks, or if Spring has sprung. Phil and his producer Rita are snowed in when a blizzard hits the town. They have to stay the night, but when Phil wakes up the next morning he finds he's stuck in a time loop - Groundhog Day is repeating. Every morning he wakes up and every morning it's Groundhog Day again.\n\nScott:  At first, Connors uses the repetition of the day to steal money and to manipulate women to sleep with him.  Yet the one woman he grows to love, his producer Rita, won't succumb to his advances.  Connors grows depressed when he realizes that his methods will never allow him to achieve real intimacy with Rita. He becomes suicidal, believing he is stuck, alone forever, in a dull town on an endlessly cold winter day.\n\nGreg:  In the end, however, he resolves that if this is to be his only day, he is going to make it the best day he can. He learns everything there is to know about each person in town. He memorizes every recurring event and schedules himself to arrive at just the nick of time to catch a boy from falling from a tree, he replaces a flat tire, he even saves the mayor's life by performing the Heimlich maneuver.\n\nScott:  Greg, what every movie-maker should learn from this movie is the importance of hero transformation.  We see so many movies where the hero does great deeds but never shows any real change.  Right before our eyes, Phil Connors evolves from a disgustingly self-absorbed jerk to an enlightened altruist.  It's fun to watch, but also very moving because most of us can relate to his feelings of emptiness and his futile attempts to remedy his situation.  We are then witness to what one can do to turn one's life around.\n\nGreg: What really struck me about Phil is how he uses his situation to attempt to get Rita to go to bed with him. Everyday he asks Rita out and learns something new about her. The more he learns about her, the more he seems like the perfect man for her. As if he is reading her mind. But at the end of every day, she sees through his plan and slaps his face. This is Phil's lowest point. He realizes he can never have her and goes into a deep depression. He gives up his plan and goes about killing himself daily, only to wake up each morning on Groundhog Day again.\n\nScott:  Rita plays a fascinating role here.  She is not only his love interest, but his mentor, too.  This is rare but it works very effectively because Connors falls in love with Rita precisely because she holds the key to his transformation.  Her wisdom, compassion, and optimism trigger his metamorphasis.  This movie is a very misleading comedy -- it makes you laugh, but you can't help but feel that the movie delivers a powerful message about life, priorities, and the challenge of finding true love.\n\nGreg: It's only after Phil completely gives up on attaining Rita that he begins refining himself. He focuses on becoming the best Phil he can be. He becomes selfless, doing everything he can to help the members of the community. Once Phil stops thinking about himself, he can give Rita the attention she deserves. And it's this selfless quality that makes Phil a man Rita can love. She finally stays the night with him - a chaste night of slumber. And the spell is broken. Phil wakes up and it's the day after. And he receives his wish: he has won Rita and he can get on with his life.\n\nScott:  You can't get a better story of redemption than this one.  He took actions enabling him to go from the most suicidal low possible to the highest of heights.  After just writing our tribute to Roger Ebert, it's nice to know that Ebert placed this movie on his list of \"Great Movies\".  The film was also added to the United States National Film Registry for being \"culturally, historically, and aesthetically significant.\"\n\nGreg: You can hardly get higher praise than that. Groundhog Day is an example of how heroes set the standard for our ideal behavior. Phil had to start out immensely flawed in order to become someone we would recognize as iconically good.\n\nScott:  This is Bill Murray's greatest role and finest performance in the movies.  The movie employs a unique premise to teach us that whatever our flaws or circumstances, we can redeem ourselves.  It's one of the best movies, and best heroes, of the 1990s.",
            "review_date": "2013-07-12",
            "source": "rt"
        },
        {
            "content": "Really well-made and original story of the time. I will never get tired of watching this",
            "review_date": "2013-07-12",
            "source": "rt"
        },
        {
            "content": "One of my favorite films. Murray plays a jerk news reporter caught in a time loop, being forced to relive the worst day of his life every day. Murray acts out the stages of grief at a great pace and Andie MacDowell plays a perfect foil to the narcisitstic Murray.",
            "review_date": "2013-07-11",
            "source": "rt"
        },
        {
            "content": "Brilliant and hilarious",
            "review_date": "2013-07-04",
            "source": "rt"
        },
        {
            "content": "Perfect film making.",
            "review_date": "2013-07-04",
            "source": "rt"
        },
        {
            "content": "Funny movie with even funnier outcomes, Groundhog day is that rare comedy classic that so may movies and TV shows have copied off of.",
            "review_date": "2013-07-03",
            "source": "rt"
        },
        {
            "content": "Could have very easily been a train-wreck. It's a wonderfully original and refreshing comedy.",
            "review_date": "2013-07-02",
            "source": "rt"
        },
        {
            "content": "Top comedy of all time for me",
            "review_date": "2013-06-27",
            "source": "rt"
        },
        {
            "content": "A hilarious with a great message and story that will keep any viewer hooked until the end.",
            "review_date": "2013-06-27",
            "source": "rt"
        },
        {
            "content": "In Groundhog Day, legendary comedian Bill Murray plays Phil, a meteorologist who is sent every year to Punxsutawney, PA to cover the Groundhog Day festivities. This event is something Phil can't stand. He's ready to leave, but a blizzard strands him, and by the next morning, he finds that he's living Groundhog Day over and over and over again. He then proceeds to do whatever he wants.\n\nAndie MacDowell stars as Phil's producer Rita, Chris Elliot plays cameraman Larry, Stephen Tobolowsky plays Ned, an annoying high school friend of Phil who is now an insurance salesman, Brian Doyle-Murray plays the town mayor, and director Harold Ramis cameos as the town doctor.\n\nWhen I first heard that there was to be a film about someone living the same day over and over again, I thought it was the stupidest idea ever. But with Bill Murray in the lead, I figured it can't be that bad. Watching the film, I realized that Bill Murray is a talented comedian and is pretty funny in the role. There is also some good comedy, with the best scenes being Murray's suicide attempts, such as electrocution by toaster oven, driving off a cliff, running himself over, and jumping off a building.\n\nWhat's wrong with Groundhog Day, if there's good comedy? Well, there's just not a lot of comedy in this. In the second half of the film, Phil uses his repeated days to attempt to fall in love with his female producer. While many view these scenes as touching, I view them as boring, wishing that the comedy would return again. I liked MacDowell in her role, but during the romantic scenes with Bill Murray, their chemistry is off, heavily. Also, I had no idea where the film was heading. It was advertised as a comedy, but the film turns from comedy to romantic drama, which didn't make much since if it was advertised as a comedy. When I want comedy, I want comedy, not a melodrama.\n\nSo in the end, while Groundhog Day has some decent comedy, it's overuse of melodrama weakens the film as a whole. Honestly, I thought that the story was done much better, and funnier, in a Donald Duck cartoon.",
            "review_date": "2013-06-26",
            "source": "rt"
        },
        {
            "content": "One of my Fav movies!!!",
            "review_date": "2013-06-24",
            "source": "rt"
        },
        {
            "content": "So enjoyable in every respect. I wouldn't mind watching it again, and again, and again...",
            "review_date": "2013-06-22",
            "source": "rt"
        },
        {
            "content": "Ehh defiantly better films out there.",
            "review_date": "2013-06-18",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is one of the greatest comedies ever made, it may not be as outright hilarious as some other films, but it does pack its fair share of laughs. The real gem of this film though, is in the highly creative and cleverly written screenplay. Bill Murray gives a wonderful performance, one of his best actually, but this screenplay is one of the greatest ever to be written. It is probably the most imaginative way to convey the theme that a monotonous and routine life is not worth living unless love is involved. Groundhog Day is one of my favorite films, and a must see for everyone.",
            "review_date": "2013-06-18",
            "source": "rt"
        },
        {
            "content": "A great American comedy collaboration between Ramis & Murray as the latter puts in a great performance as a man stuck in a time loop on his most hated day of the year. Often funny & with a nice romantic undertones the repetition never gets boring as each subtle moment is nicely directed & performed superbly by Murray.",
            "review_date": "2013-06-09",
            "source": "rt"
        },
        {
            "content": "Classic movie about the importance of being sincere and choosing to be happy.",
            "review_date": "2013-06-09",
            "source": "rt"
        },
        {
            "content": "My favorite comedy metaphor for life. Shawshank is my favorite serious movie metaphor. As said in the latest Muppets movie: \"Growing up is just becoming the person you want to be.\" My favorite movies show me how someone did that.",
            "review_date": "2013-06-04",
            "source": "rt"
        },
        {
            "content": "A film with a clever premise and good performances but the film quickly grows tiresome.",
            "review_date": "2013-05-27",
            "source": "rt"
        },
        {
            "content": "It can drag on a bit too much towards the end giving off a feel of repetition, however that could also work in \"Groundhog Day\"s favor, touching excellently on themes of respect for one's self and others with an always witty performance from Murray.",
            "review_date": "2013-05-26",
            "source": "rt"
        },
        {
            "content": "even though I'm a little tired of watching this one...the concept was so cool and Bill's facial expressions crack me up every time. Gotta love the Sonny and Cher song evry time I hear it now.",
            "review_date": "2013-05-21",
            "source": "rt"
        },
        {
            "content": "Phil Connors (Bill Murray) is a self-centred TV weatherman who finds himself caught in a personal time warp. Suddenly, he's having the worst day of his life . . . over and over and over again! With no tomorrow to worry about and plenty of time on his hands, Phil explores some of his favourite fantasies, becomes an expert at all things trivial and pointless, but continually strikes out with the one woman who matters . . . his producer Rita (Andie MacDowell).\n\nalso stars Chris Elliott, Stephen Tobolowsky, Brian Doyle-Murray, Marita Geraghty, Rich Ducommun, Robin Duke and Rick Overton.\n\ndirected by Harold Ramis.",
            "review_date": "2013-05-16",
            "source": "rt"
        },
        {
            "content": "Best Movie Ever.  One of the few movies I enjoy watching every couple years",
            "review_date": "2013-05-11",
            "source": "rt"
        },
        {
            "content": "You'll never hear \"I've Got You Babe\" the same way again.  One of Bill Murray's best (along with \"What About Bob?\").",
            "review_date": "2013-05-11",
            "source": "rt"
        },
        {
            "content": "A weird film where the same thing happens over and over again!",
            "review_date": "2013-05-11",
            "source": "rt"
        },
        {
            "content": "With Bill Murray's best performance and a hilarious story and script, Groundhog Day is probably the most landmark film towards comedy. its funny as well that the film is about the repetition of one day, and you can watch Groundhog Day a hundred times, its still the same humour and laughs.",
            "review_date": "2013-05-08",
            "source": "rt"
        },
        {
            "content": "BILL MURRAY. THIS IS HIS BEST ROLL.",
            "review_date": "2013-04-30",
            "source": "rt"
        },
        {
            "content": "interesting story.. one needs to do something to make the endless one day repeating stop :)",
            "review_date": "2013-04-27",
            "source": "rt"
        },
        {
            "content": "Bill Murray's witty demeanour guides the audience through this comedic tale of redemption and self-improvement. Accessible to any type of viewer.",
            "review_date": "2013-04-17",
            "source": "rt"
        },
        {
            "content": "An interesting thought experiment on the nature of morality and existence. The film blends just the right amount of comedy and romance with philosophy to make a deep film that is fun to watch at the same time.",
            "review_date": "2013-04-15",
            "source": "rt"
        },
        {
            "content": "I laughed my ass of at that dude in the glasses saying, 'watch that first step, its a real doozy!' lol!",
            "review_date": "2013-04-11",
            "source": "rt"
        },
        {
            "content": "Rita: It's beautiful. I don't know what to say.\nPhil: I do. Whatever happens tomorrow, or for the rest of my life, I'm happy now... because I love you.",
            "review_date": "2013-04-09",
            "source": "rt"
        },
        {
            "content": "I could watch this movie over and over and over again - ok - I have - I own the DVD but if I'm channel surfing I can't help but abandon the other show I'm watching to enjoy whatever is left of the movie.  Although . . . I must admit I cringe during the last couple lines of the movie - wish they had left them out - watch it and judge for yourself.",
            "review_date": "2013-04-06",
            "source": "rt"
        },
        {
            "content": "So enjoyable on every level. One of my favourites!",
            "review_date": "2013-04-01",
            "source": "rt"
        },
        {
            "content": "the stupidest movie ever done",
            "review_date": "2013-03-31",
            "source": "rt"
        },
        {
            "content": "a comic time warp \n28 3 2013",
            "review_date": "2013-03-28",
            "source": "rt"
        },
        {
            "content": "imagine relive a day over and over ,, but living groundhog day wouldnt be my choice now my birthday that would be better then id never age for the rest of my life ,, I like this movie and it was good",
            "review_date": "2013-03-27",
            "source": "rt"
        },
        {
            "content": "Usually not a fan boy of Rom-coms but this critically acclaimed American classic is funny and heart-warming in all the right places.",
            "review_date": "2013-03-27",
            "source": "rt"
        },
        {
            "content": "I just didn't like it. Perhaps it was Bill Murray's performance. Perhaps it was the tedious nature of the story.",
            "review_date": "2013-03-26",
            "source": "rt"
        },
        {
            "content": "Although I've heard this story before (a Hewy, Dewy, and Louie cartoon in \"Mickey's Once Upon a Christmas\", I saw that one first) , this is still a fun film. Weird, but fun. I saw this on Groundhog Day 2013 on TV, and I did enjoy it. I hope to watch it again next year, and I highly recommend it.",
            "review_date": "2013-03-24",
            "source": "rt"
        },
        {
            "content": "As a child I always wanted to be stuck in one day but was terrified that it would happen on a school day and that I would be stuck going to the same classes day in and day out.",
            "review_date": "2013-03-23",
            "source": "rt"
        },
        {
            "content": "I dont like repeating things.",
            "review_date": "2013-03-23",
            "source": "rt"
        },
        {
            "content": "Best comedy ever. Has deep meaning and great humor!",
            "review_date": "2013-03-23",
            "source": "rt"
        },
        {
            "content": "I remember seeing this in 3rd grade at the movie theater",
            "review_date": "2013-03-21",
            "source": "rt"
        },
        {
            "content": "Boy what a great comedic concept. Bill Murray is a master of his craft, and here walks a razor thin line between insufferable and charming in a way that seems impossible. I can imagine no other actor that could have achieved this; this is really one of the funniest performances of all time, driving a well-crafted and thoughtful script (Plus: Ned Ryerson). Granted, most of Chris Elliot's gags fall flat, and certain elements of Andie MacDowell's character are kind of head scratching, but I adore this movie. Really, really, really funny.",
            "review_date": "2013-03-19",
            "source": "rt"
        },
        {
            "content": "Literally fell of my chair at the theatre. It swung up, and I was laughing too hard to get back on my feet... ass... you know what I mean. ^^",
            "review_date": "2013-03-17",
            "source": "rt"
        },
        {
            "content": "Clever, and it gets really, really funny as it goes!",
            "review_date": "2013-03-16",
            "source": "rt"
        },
        {
            "content": "The premise wears thin but the performances are good and there are some really funny moments in the script.",
            "review_date": "2013-03-16",
            "source": "rt"
        },
        {
            "content": "Funny. Iconic. Original. Awesome. Of you can tolerate the heavily dated music, you could probably watch it back to back.",
            "review_date": "2013-03-14",
            "source": "rt"
        },
        {
            "content": "Bill Murray is as sharp as a tack in this pseudo comedy/romance/fantasy film of Groundhog Day that takes an interesting look at \"What do you do if you can live forever but there is no tomorrow?\"",
            "review_date": "2013-03-10",
            "source": "rt"
        },
        {
            "content": "Silly romantic comedy. Bill Murray did the best he could, but my question is why did he even do it?",
            "review_date": "2013-03-08",
            "source": "rt"
        },
        {
            "content": "A comedic classic to some, but I didn't see a \"classic\", just a good movie. I wouldn't put it with the likes of Ghostbusters or Caddyshack in the Ramis/Murray collection.",
            "review_date": "2013-03-07",
            "source": "rt"
        },
        {
            "content": "\"Phil\" (Bill Murray) is a Pittsburgh TV weatherman with a bad attitude. On Groundhog Day, he has to go to Punxsutawney, Pennsylvania to cover the Punxsutawney Phil ceremony. \r\n\r\nHowever, this Groundhog Day is unlike any other. And it gives \"Phil\" a chance to change his ways. \r\n\r\nLet me say first, even though there are slight differences each time, the repetitiveness of the scenes gets boring real quick. Only Murray's sense of humor saves these scenes, especially when they are shown back-to-back. \r\n\r\nOut of the entire cast, Murray is the best. When we first meet \"Phil,\" Murray makes him arrogant but pretty comical with some quick wit. He has some pretty good chemistry with Andie MacDowell, especially when her character starts to fall for \"Phil\" (each time he experiences the day). \r\n\r\nThe supporting cast had very little development in this movie. The only time they had any development was when \"Phil\" was memorizing what they told him. A lot of the development is mostly repeated when \"Phil\" interacts with them each time he replays the day. \r\n\r\nThe comedy mainly relies on Murray, who is his typical self. There is nothing too over the top, and doesn't produce a gut-busting laugh. The most this movie will produce is some pretty good chuckles. \r\n\r\nThe biggest problem this movie has is the repeating scenes. Although \"Phil\" experiences them differently after he begins to realize what is going on, they are pretty limited in what they can do while playing the scenes pretty much the same each time. \r\n\r\nI would not put this on your \"Must See\" list. But if you see this on television, and there really isn't anything else on, then check this out. You won't be too disappointed.",
            "review_date": "2013-03-07",
            "source": "rt"
        },
        {
            "content": "This time looping tale about Phil Conners is simply spectacular. It has the perfect balance between drama and comedy, and it has wonderful morals.",
            "review_date": "2013-03-04",
            "source": "rt"
        },
        {
            "content": "classic bill murray!",
            "review_date": "2013-03-03",
            "source": "rt"
        },
        {
            "content": "It somehow never overstays its welcome. Also, Bill Murray.",
            "review_date": "2013-03-02",
            "source": "rt"
        },
        {
            "content": "A watched this one over and over again :-)",
            "review_date": "2013-02-26",
            "source": "rt"
        },
        {
            "content": "I'd call this movie \"Family Man 2\". I wish I could live todyay over and over... Second chances every day. -- with roomie at dorm.",
            "review_date": "2013-02-22",
            "source": "rt"
        },
        {
            "content": "Andie MacDowell is pahnts, but Bill Murray is AWESOME.",
            "review_date": "2013-02-21",
            "source": "rt"
        },
        {
            "content": "Bill Murray is perfect in this witty and sarcastic comedy.",
            "review_date": "2013-02-19",
            "source": "rt"
        },
        {
            "content": "Murray can make anything shine in this thoughtful fantasy-comedy.",
            "review_date": "2013-02-18",
            "source": "rt"
        },
        {
            "content": "Very disappointing, was expecting a much better final product!",
            "review_date": "2013-02-16",
            "source": "rt"
        },
        {
            "content": "Genius. One of my favorite movies of all time.",
            "review_date": "2013-02-15",
            "source": "rt"
        },
        {
            "content": "One of the crown jewels of American comedy.",
            "review_date": "2013-02-14",
            "source": "rt"
        },
        {
            "content": "Chaque fois un délice.... Et chaque fois je me dis que Hollywood n'en fait plus des comme ça. Des films grand publique qui sont plaisant à regarder et que les artisans semblent avoir eu plaisir à faire... GROUNDHOG DAY... FERRIS BUELLER.... HOME ALONE..... Peut-être l'une des plus éclatées comédie romantique!",
            "review_date": "2013-02-13",
            "source": "rt"
        },
        {
            "content": "A good take on a romantic comedy. An easy watch I wouldn't of cared if the film did keep going on and on.",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "A great premise with lots of laughs from Murray that makes an easy to watch again and again.",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "I enjoyed watching the emotional trouble that Bill Murray's character was dealing with. My only complaint is that it sometimes gets boring watching the same scenes over and over again.",
            "review_date": "2013-02-09",
            "source": "rt"
        },
        {
            "content": "awesome awesome movie!!!",
            "review_date": "2013-02-09",
            "source": "rt"
        },
        {
            "content": "An unparalleled, wholly original philosophical experience with a powerhouse performance from Bill Murray.",
            "review_date": "2013-02-09",
            "source": "rt"
        },
        {
            "content": "Never really got this one.",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "Nostalgia de la infancia... y Bill Murray!",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "Bill Murray sarcasm at its finest",
            "review_date": "2013-02-06",
            "source": "rt"
        },
        {
            "content": "Nonstop laughs, for real.",
            "review_date": "2013-02-05",
            "source": "rt"
        },
        {
            "content": "Been to Punxatawney,  Not the same place as the movie...regardless...",
            "review_date": "2013-02-05",
            "source": "rt"
        },
        {
            "content": "This one is a very funny film at the beginning. Then it gets boring and repetitive. However, at the end it starts to deal with the sense of life, whatever is important about it and what really makes it worth to live another day. Good metaphor, but rather slow.",
            "review_date": "2013-02-04",
            "source": "rt"
        },
        {
            "content": "I love the way it dodges all the cliches and pitfalls that come with the murky rom-com territory it occasionally wades into.",
            "review_date": "2013-02-03",
            "source": "rt"
        },
        {
            "content": "One of the greatest comedies of all time. An annual event come February 2nd.",
            "review_date": "2013-02-02",
            "source": "rt"
        },
        {
            "content": "My favourite movie. I take away something new from it every time I watch. A classic!",
            "review_date": "2013-02-02",
            "source": "rt"
        },
        {
            "content": "20 years old!!! Here we go!",
            "review_date": "2013-02-02",
            "source": "rt"
        },
        {
            "content": "brillint. watching it again today...",
            "review_date": "2013-02-02",
            "source": "rt"
        },
        {
            "content": "Very sad movie(yes really) but tons of great lines.",
            "review_date": "2013-02-02",
            "source": "rt"
        },
        {
            "content": "20th Anniversary tribute to the hilarious movie Groundhog Day!\n \nhttp://youtu.be/YZJehuoQoPQ \n \nLots of fun to watch!",
            "review_date": "2013-02-02",
            "source": "rt"
        },
        {
            "content": "I love this movie. I love Pa.",
            "review_date": "2013-02-02",
            "source": "rt"
        },
        {
            "content": "There were some great films released in 1993 like Schindler's List, The Fugitive, Jurassic Park, Benny and Joon, Sleepless in Seattle, Fearless (see it), and Red Rock West, but the one movie I could see \"over and over\" again is \"Groundhog Day\" !",
            "review_date": "2013-02-01",
            "source": "rt"
        },
        {
            "content": "This really funny comedy shows a nice fantasy to be stuck in for a while, and it's also a nice film to watch around the holiday traditionally. (B+)\n\n(Full review coming soon - with better wording)",
            "review_date": "2013-02-01",
            "source": "rt"
        },
        {
            "content": "It is worth seeing just for the clock scene haha!",
            "review_date": "2013-02-01",
            "source": "rt"
        },
        {
            "content": "Outrageously good. Andie MacDowell's stunning.",
            "review_date": "2013-02-01",
            "source": "rt"
        },
        {
            "content": "This charming existential comedy is like a fine wine -  it improves as I age...",
            "review_date": "2013-01-30",
            "source": "rt"
        },
        {
            "content": "It's like my life!  Everyday is the same!",
            "review_date": "2013-01-29",
            "source": "rt"
        },
        {
            "content": "Saw for the third time the other night.  It's still just as funny and wonderful as it was in 1993.",
            "review_date": "2013-01-28",
            "source": "rt"
        },
        {
            "content": "Groundhog Day is a funny and clever movie that shows us that if we live our lives to please ourselves we will never truly be happy.",
            "review_date": "2013-01-27",
            "source": "rt"
        },
        {
            "content": "found it boring, monotonous and obnoxious. sorry. i don't get the hype.",
            "review_date": "2013-01-26",
            "source": "rt"
        },
        {
            "content": "Classic comedy with some outright laugh-out-loud moments that make me wet my pants. Great concept that is stolen and abused by more movies than should be allowed. One of Bill Murray's best.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "i would so take advantage of the process in this movie",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "Exactly how a good comedy should be. Groundhog Day has enough funny moments without making you feel like you're being drowned by joke after joke and focuses more on a very creative and clever storyline. I think it covers just about every good and bad thing about playing out the same day, everyday and on the whole it's very, very enjoyable.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "Super classic. It will question your religion!",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "The only reason that this movie is not one of the best ever made is that the makers of it did not INTEND to do so...the brilliancy of each scene arises only in retrospective .So 5 stars for fate 3 for trying",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "decent enough, neither bad or good there are some good bits sandwiched in between some blar moments.",
            "review_date": "2013-01-20",
            "source": "rt"
        },
        {
            "content": "+ Murray on his A game... infinitely rewatchable.\n- some distracting silliness here & there.",
            "review_date": "2013-01-20",
            "source": "rt"
        },
        {
            "content": "A romantic comedy with themes of insanity and suicide? With Bill Murray? It works, it's brilliant.",
            "review_date": "2013-01-15",
            "source": "rt"
        },
        {
            "content": "When I first heard of this movie, I was actually kind of happy. You know why? Because they finally made a movie about a holiday in February. And most of all, this has one of my favorite actors, Bill Murray. He was so funny in this. When ever it's Groundhog Day, I turn on this movie right away!",
            "review_date": "2013-01-14",
            "source": "rt"
        },
        {
            "content": "There's a reason it's considered a classic.",
            "review_date": "2013-01-09",
            "source": "rt"
        },
        {
            "content": "Funny, insightful, bordering philosophical. How would you live your life if it was the only day you ever had - over and over again?",
            "review_date": "2013-01-07",
            "source": "rt"
        },
        {
            "content": "Very good movie. I liked the concept - Bill Murray living the same day over & over again. Must watch.",
            "review_date": "2013-01-07",
            "source": "rt"
        },
        {
            "content": "Bill Murray is a genius, this movie proves it",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "The classic time loop scenario, done as only Bill Murray can do....",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "I love the scene when he grabs the toaster and takes it upstairs to the bathtub.  Priceless.",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "not really a great film, but certainly a classic!",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "Fantastic movie. funnny!",
            "review_date": "2012-12-28",
            "source": "rt"
        },
        {
            "content": "I love it. Watch it a 2nd or 3rd time and you'll see why.",
            "review_date": "2012-12-27",
            "source": "rt"
        },
        {
            "content": "An original romcom that, while not laugh out loud funny, is very funny in many other different and clever ways.",
            "review_date": "2012-12-26",
            "source": "rt"
        },
        {
            "content": "bill murray makes me laugh just lookin at him. whata classic",
            "review_date": "2012-12-26",
            "source": "rt"
        },
        {
            "content": "Creative and original, \"Groundhog Day\" might not be as funny as I hoped, but its storytelling inspires me to be more imaginative in my work.",
            "review_date": "2012-12-26",
            "source": "rt"
        },
        {
            "content": "Great movie, I loved it! Such an inspiring and funny comedy.\n\nHowever, if I may make some professional editorializations...\nI really think Bill Murray missed out on a golden opportunity here to expand the movie's target audience. I mean, don't get me wrong, the humor was decent, but there's not a lot in here for those who are looking for an action thriller. It's a real shame, especially considering the context of THIS movie. A guy can do whatever he wants, and relive the same day with no consequences, and he passes up an opportunity to go at it GTA style? I'm disappointed.\n\nHere's my suggestion. (Warning: Minor plot spoilers follow)\n\nThere's a scene in the movie where Phil, the main character, catches a boy just as he's falling out of a tree (he knows this because already he's lived it). I'm thinking, instead of catching the kid, he could just punt the sucker for a really NOICE combo! In fact, since he already knows it's going to happen, I would say why not step back a few hundred feet and get a real nice running start? And then, when it actually happens, make sure to get a really nice close-up shot, I mean everything! The works! I'm talking slow-mo, instant replay, trajectory cam, you name it. Man, I'm telling you, there are some sick fuckers out there who would pay to see that kind of shit. You could even have a big \"MULTI KILL\" counter for every time he does it (obviously he's got to do it more than once, since he's probably not going to get it right the first time).\n\nJust my 2 cents.",
            "review_date": "2012-12-25",
            "source": "rt"
        },
        {
            "content": "So smart and full of great performances! I have to watch it again!",
            "review_date": "2012-12-24",
            "source": "rt"
        },
        {
            "content": "One of the few comedies with a genuine, non-superficial moral to the story.",
            "review_date": "2012-12-23",
            "source": "rt"
        },
        {
            "content": "When a film manages to be great despite the fact that it stars legendary charisma black hole Andie MacDowell, it's a real testament to its virtues.  MacDowell is not able to suck away enough of Bill Murray's massive store of charisma to harm the film.  While Chris Elliott is clearly shaken by her proximity, he comes away largely unscathed.  The very simple premise is mined for more comedic than you'd expect anyone to be able to get from it.  A class act all around.",
            "review_date": "2012-12-22",
            "source": "rt"
        },
        {
            "content": "Excellent. Hilarious, intelligent and highly enjoyable.",
            "review_date": "2012-12-22",
            "source": "rt"
        },
        {
            "content": "Bill Murray is brilliant and plays a great a-hole",
            "review_date": "2012-12-21",
            "source": "rt"
        }
    ]
}