{
    "rating": 9.5,
    "release_date": "1993-12-12",
    "num_reviews": 410,
    "genres": [
        "Biography",
        "Crime",
        "Drama"
    ],
    "summary": "Unemployed young Irishman Gerry Conlon (Daniel Day-Lewis) gets by as a petty thief in 1970s Belfast. When local IRA leaders get fed up with him, he flees to England and meets up with his friend Paul Hill (John Lynch). On the same night that the IRA bombs a nearby pub, the friends get kicked out of their communal digs and are forced to sleep in a park. He returns to Belfast, but is arrested as the prime suspect in the bombing and imprisoned, where he spends 15 years trying to clear his name.",
    "reviews": [
        {
            "content": "I love this movie! Recently I showed it to my son who is 16. We had a long conversation about been in the wrong place and some how  the life will pass over us and follow.. we can just watch and accept our reality o fight like Guissepe the father who never stopped believing and working for justice.",
            "review_date": "2023-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the Name of the Father is a tough look at persecution and suffering, but I feel like that's a bit undercut by the fact that a large part of this film was shot in Kilmainham Gaol. It's tough to think about corrupted justice when the movie takes place in the same jail as Paddington 2. \n\nOne of the classic dramas about a fight to right a political wrong, In the Name of the Father doesn't necessarily ask you to explore difficult characters or complex situations, but it creates a compelling story regardless. Capturing all the forgotten confusion of the Troubles with really solid production value and injecting it with a flawed protagonist, the script isn't just a fight for freedom as it is a forced coming-to-terms between a slightly alienated father and son. The story might have gotten some additional mileage out of focusing more on Emma Thompson's crusading lawyer, but the lack of a payoff (no charges were ever brought against the offending officers) was probably a damper on that front, plus when you've got Day-Lewis directors tend to try to keep him front and center - half the Guildford Four are completely forgotten about. Perhaps told with slight exaggeration, the film uses its Hollywood beam for the right reasons, in order to (very successfully) place the audience front and center, giving you the same sense of betrayal that any innocent person would feel when their government decides they are the people at fault. \n\nAuthenticity aside, Day-Lewis gives an exceptional performance as an evolving character and the atmosphere that director Jim Sheridan crafts is dangerously and bitter. What the film might not have in complexity, it makes up for in poignancy. (4/5)",
            "review_date": "2023-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great acting makes this a solid movie but the plot is slow and lacks excitement.",
            "review_date": "2022-10-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the greatest movies of all time for sure. Incredible story and acting by the man himself Daniel Day-Lewis. A fantastic movie in every way and shape, including the soundtrack that went on with the story perfectly. The strongest ending in cinematography and the flawless plot, along with everything else, make this movie by far one of the all-time greatest in cinematic history.\nTiocfaidh ár lá.",
            "review_date": "2022-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What makes In the Name of the Father a good film are basically the acting performances, with the brilliant Daniel Day-Lewis in the role as Gerry Conlon, once more showing his incredible versitilaty as a character actor, creating yet a unique expression with simple means. Also Pete Postlethwaite as his father Guiseppe does an outstanding performance, and the highly realistic locations are definitely adding to the good result. The film is being described as a 'crime drama', but 'political drama', or consequently slash 'prison drama', has to be a better categorization. Nevertheless, the political issues around the IRA and their counterpart, the British government, as principal topics, are not given enough space. The selection of time spent on the different main stages of the plot and its fundamental issues isn't all that easy to accept as being spot on. In the first third we get to know the main characters and their relations very well, and the same goes for the depiction of the environment and conditions in the prison. A result is that the pivotal and final phase about solicitor Gareth Peirce's investigation and the fight against the British legal establishment, as well as the ultimate trail, is given far to little space, and her character otherwies solidly performed by Emma Thompson, is barely established. It must most likely have been a difficult question of prioritization in the basic editing, but some of the scenes in the first two stages could easily have been compressed or rejected. The film could even be made 20 minutes longer, as it regardlessly passed the two hour limit. Questionable priorities with vague intentions and motivations, together with not killing a few rather obvious darlings, or even giving a length expansion a go, probably and sadly has ruined the chance to create a wider insight into the political game that this story and its victims truly has deserved. The difference is that ultimately it could have been an icon of a political drama.",
            "review_date": "2022-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well acted and appropriately angry but this is such a Hollywoodized version of what actually happened (complete with a crowd pleasing court room finale) that the movie undermines its own narrative. Something slower and quietly sad may have been less popular but it would probably be more of an effective tragedy.",
            "review_date": "2022-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A brilliant film that shows how versatile Daniel-Day Lewis is. This film turns your stomach and it is so heart-wrenching that this is a true story. It's powerful and entertaining, and is a must watch for everyone.",
            "review_date": "2022-01-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another great performance by Daniel Day-Lewis and a compelling story makes In the Name of the Father a memorable viewing experience.  Based on a true story, Gerry Conlon (Day-Lewis), his father Giuseppe (Peter Postlethwaite), and a large group of others are wrongly convicted for an IRA bombing outside of London that left four dead and countless others injured.  It's a powerful story of social and judicial injustice, an upsetting but ultimately uplifting tale that will soften even the hardest of hearts.  No director can explain the plight of the Irish more effectively than Jim Sheridan.",
            "review_date": "2021-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overrated but not bad. It's definitely one of the better IRA films, but that's because almost all of them are terrible. It was too drawn out, predictable, and bland because it's all been done before. There was no reason the film had to go on for so long. However, it's a true story so I suppose there wasn't much else they could have done events wise. The acting was reasonable, and the cinematography, visual effects, and soundtrack were all fine. It's not as impressive as most people claim, but it does portray an unfortunate true story well enough.",
            "review_date": "2021-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I cried from this film 5 times because daniel day lewis act i love this actor and i love this film so much this film is one of top ten films of me my raiting is 10 from 10",
            "review_date": "2021-04-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gripping story with a fantastic Daniel Day-Lewis performance. Its not overly complex and is a simple telling of the aftermath of the Guildford bombings. Once it has finished you will find yourself googling 'did that really happen?'. Postlethwaite is awesome as DDL's father. Could be the best British film of the 90s?",
            "review_date": "2021-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another Daniel Day-Lewis acting triumph but I find the film itself to be only decent, nothing to really excite.",
            "review_date": "2021-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Somehow, I had not realized this was a true story until the closing text. I had never even heard of the \"Guildford Four\". While it is categorized as a \"courtroom drama,\" the couple of courtroom scenes are absurd in the Kafkaesque kind of way, which I did learn while writing this piece, were some of the more embellished scenes of the movie. Really, In the Name of the Father should be considered a \"legal system drama\" or \"prison system drama\" because that is the shit that made this film horrifying — that and DDL's (unsurprisingly) stellar performance. Gerry Conlon (Daniel Day-Lewis) is a young Irishman from Belfast in search of the late-60's \"free love\" in 1974 London. A bomb explodes inside of a pub in the southern English town of Guildford. I.R.A. violence is peaking in the mid-70s, and Conlon and friend, Paul Hill (John Lynch), the new Irish arrivals, are rounded up under the \"Prevention of Terrorism Act\" and forced to confess to the bombing under sickening conditions of physical and mental abuse. While Conlon and Hill don't do themselves any favors in the courtroom — their snickering and laughing reminded me of the \"West Memphis Three,\" who thought it unimaginable that they could possibly be convicted of their crimes, given their trust in the legal system and to God — the courtroom scenes are ridiculous. Basically, everyone who has known Conlon, including his father, Patrick \"Giuseppe\" Conlon (Pete Postlethwaite), are rounded up, tried, convicted, and serve time in prison for conspiracy and other charges under the \"Act\". The 15-year epic of Conlon and his father in prison makes up the bulk of the film, with their eventual acquittal due to a diligent lawyer, Gareth (Emma Thompson), creating a satisfying conclusion — always warms my heart when a lawyer is a \"good guy\". Maybe not knowing the true story made this a more enjoyable film, but it also made it all the more terrifying. In the Name of the Father is a superb film concerning a timeless topic: injustice.",
            "review_date": "2020-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Day Lewis is remarkable in it, as usual, as is Emma Thompson, but I'm sorry, this just didn't engage me. It's a fascinating true story, but it's one whose formula I've seen done on film hundreds of times now... Don't get me wrong, it's well done and all, it just didn't grab me for some reason.",
            "review_date": "2020-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An unbelievable look at events that took place in my lifetime. Even knowing the outcome it still manages to build tension ",
            "review_date": "2020-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Slow but Postlethwaite is fantastic.",
            "review_date": "2020-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "From the hollow, perfunctory, ill-paced and overlong first act, that its only remarkable merit is giving us a glimpse of Gerry Conlon's frivolity and rebelliousness (well, plus one of the best opening sequences ever), to the not-so-convincing sense of time in prison, this otherwise heart-wrenching biopic is definitely not without its flaws. However, I can't recall that I have seen a troubled father-son relationship (brought to life by astonishing performances from Daniel Day-Lewis and Pete Postlethwaite) has been better depicted than in this. Just look at how the experience of imprisonment somehow matured Gerry up, whether by getting to know his father more and better (the dialogue between Gerry and Giuseppe is just phenomenal), or merely due to the incidents and mishaps that he had in prison. Not to mention the painful and provocative meticulous dramatization of a miscarriage of injustice, vividly portrayed by some of the most sensible, artistic, emotionally-charged scenery that Jim Sheridan's nuanced direction are responsible of.\n\nHappy Birthday to the greatest actor ever, Daniel Day-Lewis. I do miss him!\n\n(8/10)",
            "review_date": "2020-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A gripping, powerful political thriller with an incredible performance by Daniel Day-Lewis (as usual).",
            "review_date": "2020-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It’s movies like these that got me to realize how the Palestinians feel about the injustice in Israel. I only wish my aunt would understand I don’t take sides in this holy war knowing what’s happening to Palestine.",
            "review_date": "2020-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A strange thing happened to me when watching In the Name of the Father. I knew nothing about the true story of the Guildford Four before I sat down to watch this movie, in fact I didn’t even know it was based on a true story. For some reason I anticipated an unexpected twist that would be revealed later in the film. Because the entire flashback sequence was told from the perspective of Gerry Conlon, I thought they were going to reveal it was an unreliable narrator situation and he was actually lying, and was guilty of the bombing. Thankfully, the film plays no tricks and is upfront and forthright about the fact that the police and the legal system are the villains. It became glaringly obvious after a while that this movie is all about someone being falsely accused and we are supposed to see the injustice in his treatment. Because I’m such a big fan of legal dramas, I was hoping that In the Name of the Father would center more on Emma Thompson and her struggle to prove innocence once the backstory was completed. Instead the film was more interested in Daniel Day-Lewis and his struggle to grow up and fight back against all the people that wronged him. That was somewhat disappointing to me, particularly when the big break in the case comes basically by accident in a matter of seconds rather than through any hard work from Thompson’s character. It’s another one of those faulty expectation problems that left me wanting something that the film was never intended to provide. I probably would have known better what to expect if I realized the entire movie is based on an autobiographical book written by Gerry Conlon, so it’s meant to tell his story. The film was also about Gerry Conlon’s relationship with his father (played by Pete Postlethwaite.) It was interesting to see the dichotomy between father and son, and I think it was Potlethwaite’s character who is the more endearing. It took me a great deal of time to like Daniel Day-Lewis in this film. Of course I was on his side, as he was the underdog against a corrupt system, but his personality was so abrasive. This works to show his growth, but it felt like so long before he started to grow at all. All that said, I found the story engaging and fascinating, particularly when I started to realize it was based on something that happened in real life. It’s not exactly a heartwarming conclusion, and leaves you with a general sense of frustration, but that’s kind of the point. In the Name of the Father is meant to outrage us on Gerry’s behalf, and it succeeds at that.",
            "review_date": "2020-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Having not been terribly impressed by Jim Sheridan's Best Picture nominated biopic My Left Foot (1989) I was not eagerly anticipating this film as it had the same star and seemed to take the same tone. Unfortunately I can not say that the film shocked me by being daring and not conforming to the same tropes that we have seen used in courtroom dramas for decades and the milquetoast feel of the film did not help to differentiate it from it's superior predecessors. It is easy to see why the Academy, prone to making safe, unimaginative choices, were attracted to this film and lavished it with so many nominations without actually awarding it anything.\n\nIn 1974 in Belfast Young thief Gerry Conlon, Daniel Day-Lewis, lives with his loving father Giuseppe, Peter Postlethwaite, whose over attentiveness annoys him but he misses him as he leaves for London. He is meant to live with his sensible aunt Annie Maguire, Britta Smith, but spends time with free love hippies and ends up robbing a prostitute and taking drugs in a park the night that the Guildford Pub Bombings occur. He is blamed for the event and coerced by interrogators into confessing to the crime after having the life of his father threatened. He and several of his family members and friends are imprisoned and Conlon is placed in a jail cell with his father who disagrees with his lifestyle and takes action to help them appeal for another court hearing. After the death of his family Conlon takes more interest in receiving help from lawyer Gareth Peirce, Emma Thompson, who discovers evidence that the police attempted to hide through complete coincidence. She mounts a solid defense for the wrongly imprisoned men and women and they are allowed to go free.\n\nBoth of Sheridan's weepie dramas about real life figures feature angelic parental figures and while in his 1989 film you had the self sacrificing mother he opts for a caring but occasionally disappointed father. From the moment we meet him we know that he will be the titular father and can anticipate something tragic happening to him that is meant to make the audience cry and serve as motivation for the main character. Postlethwaite was a famed character actor but the role he works with here is so saccharine and sweet that it is hard for him to do anything other than appearing loving and stare at his son with pride. The real Giuseppe, or Guiseppe as it is misspelt in the film's epilogue, may well have been this way but on screen he makes for a dull character and it would have helped if he had more flaws. When he feels too good to be true it is hard to believe in his relationship with his son, the emotional center of the film, and so there is a disconnect and we are forced to engage with the film as a facts based narrative which is considerably less compelling.\n\nThe film's structure is also odd as we see a lot of Conlon in London as a crunchy hippie before he is wrongly accused of committing a crime and get very little of Peirce fighting for justice towards the end. The final scenes are some of the most rousing and while I didn't mind seeing our protagonist take drugs with a young Saffron Burrows that section of the film could have been considerably short. For a film that was over two hours long it felt insubstantial at it's end and most of the substance of the film came from a section of the film that didn't quite work for me. When Conlon and his father are trapped in prison together it should provide room for reflection and an opportunity to show the dehumanizing effect that being inside a prison can have. Another pacing issue appears at this point because we have no idea until the last few minutes of the film how many years the men have spent in prison. In addition both appear to be having a fine time in prison as Conlon is able to take LSD and his father has a friendly rapport with the prison guards. We needed to feel their pain so that their victory could be sweet and well earned but instead we are left underwhelmed.",
            "review_date": "2020-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An enraging film that will inspire indignation!\n\nIn the Name of the Father (1993) is Jim Sheridan's Irish historical about The Troubles in Ireland and the enduring pain suffered by her people.\n\nJim Sheridan's direction is stellar steady work that lets actors breathe and perform moving masterclasses in emotionally nuanced acting. Sheridan brings historical accuracy and information to his picture with the story stemming from Gerry Conlon's life experiences during The Troubles and his imprisonment. Sheridan tackles the chaotic violence of The Troubles as well as the emotionally distressing aspects. In the Name of the Father is a brilliant and scathing critique of the justice system and how deeply flawed police work can be. Torture is endured and life sentences carried out for an innocent man. These cannot be continued for there to be any justice in this world. In the Name of the Father feels so important and relevant as more cases of innocent people being exonerated happen all the time.\n\nDaniel Day-Lewis is a revelation as Gerry Conlon. His Irish accent is thick and impressive. He sounds naturally Irish within In the Name of the Father. His deeply passionate testimonial to a man horrendously wronged by the English courts and law is moving. Day-Lewis captures a man at his wit's end with no hope for tomorrow. His silly start in the movie changes into a more and more nuanced approach to a man marred by misfortune. In the Name of the Father is one of Daniel Day-Lewis' finest performances and perseveres as one of his most important.\n\nPete Postlethwaite is incredible as Gerry Conlon's sickly and meek father Giuseppe Conlon. His principles are stalwart and his touching rapport with Day-Lewis really make the film special. His tender hand to his son is affecting as is his devotion to his faith. He stands as the moral figure of the film, who just wanted to relate his feelings to his son. It's a beautiful sentiment that Postlethwaite invokes perfectly.\n\nEmma Thompson is endearing and serious as the Conlons' lawyer. Her dedication to the case and justice are self-evident. Thompson brings a passion to the courtroom scenes and an empathy to the anguish these men have faced. She is particularly great at speaking their pain into words.\n\nThen, Corin Redgrave is aptly cast as Dixon, the head of the investigation into Conlon's case. His corrupt nature and lack of remorse is displayed on Redgrave's serious face. You just hate his character, but he plays it so subtly.\n\nTrevor Jones came up with a riveting score of intense symphonic passages for the drama and frightening atmospheric rock elements to the violent imagery.\n\nIn all, In the Name of the Father is a significant historical drama depicting a notable miscarriage of justice. I am glad for Gerry Conlon in the end, though his life was surely changed forever.",
            "review_date": "2019-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Rewatched this movie recently and was moved to tears by the end of it. Set in the 70s this massive miscarriage of justice made me sick to stomach and brought back stories I remember reading about as a your teenager.\n\nThe role of Gerry Conlon is superbly played by Daniel Day Lewis who is absolutely emotive in the movie. Pete Postelwhaite and a young Emma Thompson are also worthy of a mention in this movie about the Guildford 4.\n\nAlthough they were vindicated in the end along with the Birmingham 6. They still lost 15 years of their lives and Guiseppe Conlon would never see justice. Also, Gerry had major difficulties readjusting to live outside jail and significant mental health which caused addiction issues caused by his incarceration.\n\nA great movie that tells this awful story and allows us to see that it was not that long ago that high ranking people in the British justice system were willing to use desperate tactics and ruin lives to score PR wins. In the end, there was justice as no one was brought to answer for this treatment of innocent civilians.",
            "review_date": "2019-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A big Thank You to everyone associated with this film.\n\nIt reminds the world how cruelly the british treated everyone in their colonies of british empire all around the world. Their legal system was just a facade to legally carry out atrocities in the name of justice.",
            "review_date": "2018-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "While has the 90s Oscar Cliches, In The Name of The Father manages to be captivating by performance especially Daniel Day-Lewis ",
            "review_date": "2018-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb retelling of the story of the Guilford 4, Day Lewis is outstanding. Told at a good pace. Really enjoyed the film. Sad and shameful events.",
            "review_date": "2018-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "NIce different performance from Day-Lewis. Very solid all the way around.",
            "review_date": "2018-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "hold my hand..\n \nIn The Name Of The Father\n\nIt's strength is of course a great cast especially Daniel Day Lewis who puts his heart into it and it was worth it since the movie offers some chilling moment and definitely has a gripping plot but it falls into bits and pieces once in a while.",
            "review_date": "2018-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yeah, I cried. But I cry at a lot",
            "review_date": "2017-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic film - inspiring story and performance from Daniel Day Lewis who is at his best in this true drama.",
            "review_date": "2017-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based on a true story and told in a gripping fashion, 'In the Name of The Father' is a frightening portrayal of how easily the justice system is perverted, innocent people's lives ruined at the drop of a hat. The directing is skilfully and subtly done, never overpowering the narrative which is, as it should be, front and centre. The acting is excellent, with Postlethwaite delivering a perfect performance and Daniel Day-Lewis' portrayal being passionate, electrifying and completely believable. In the end, you're left shaking your head and find yourself affected by the injustice of it all.",
            "review_date": "2017-08-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic storyline. Infuriating outcome.",
            "review_date": "2017-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very human story of what happens when Jack Bauer gets it wrong.",
            "review_date": "2016-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In The Name Of The Father has great sides to both coin: It moves with anger and resentment towards the British Army. Daniel Day-Lewis is brilliant.",
            "review_date": "2016-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "+ Too highly rated, it seems, for a dominantly courtroom / prison movie. The motivations behind & interest in the case by the Emma Thompson character was very poorly established, if at all. And who paid her tab? As a lesson about police past-&-present & the establishment legal profession, there aren't many surprises. That it took so long to get things righted & corrected was tragic.",
            "review_date": "2016-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Over-the-top dramatics move this bit of populist fantasy about some Irish falsely imprisoned for bombing innocents in London. Once you accept that some liberties were taken to sell the tale the thing is palatable.",
            "review_date": "2016-05-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Certainly,one of the very best film of the beginning of the  90's. The story is gripping and moving with a great Daniel Day Lewis in the lead role.The realization of this film ,although very formulaic, is extremely well handled for the benefit of the story told even more so when you discover it to be an actual true story.In The Name Of The Father is not a perfect movie by any means but its story is told with passion ,care and most importantly the talent to keep us invested and interested in. This movie could never be recommended enough to everyone out there;and its great political stance ,balanced and strengthen perfectly by a father and son relationship, makes it one of the most engaging political Drama that came out to date.Jim Sheridan made a great film.\nEveryone should see it.",
            "review_date": "2016-05-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A landmark film portraying the plight of political prisoners.",
            "review_date": "2016-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie not without its flaws with a biased unidimensional perspective based on the biography by Gerry Conlon one of the accused from Guildford Four. While the overall story is commercialized and worked around for dramatic effect, Pete Postlethwaite's performance as the protagonist's father was too good in some scenes. Though it is competently performed, well written and executed, the battle is already half won with just the knowledge on the premise and the ordeal the Guildford four and Maguire seven have been through in real life. \n\nBased on real life events following Gerald Conlon ( \nDaniel Day-Lewis) a carefree wild youth who is accused of the Guildford bombing and imprisoned after coerced confession. This leads to arrests of his aunt's family infamously known as the Maguire Seven along with his father Guiseppe Conlon (Pete Postlethwaite), a just man trying to protect his son. After his father's death due to harsh prison environment and depression, he vows to fight back on the system with the help of a convinced lawyer Gareth Peirce (Emma Thompson). \n\nThe initial riot sequence was exhilarating pepped by a solid background score and hysterical atmosphere. The arrests, torture, trial and sentences leaves an emotional impact on the unjust treatment and fate of all the accused and some performances here are to be commended. But Pete Postlethwaite's portrayal of Conlon's father breaks the shackles, elevates the emotional depth in the movies and justifies the title. The initial scene where Guiseppe pleads the IRA men to forgive his son, the expression on his face when Gerald returns from England, the conversations inside the prison cell and the scene just before he dies are a few examples of his masterful performance. I can understand at a biographical point of view for a very biased approach, but as a movie which deals with other characters as well should have shown some elements of thoughts leading up to the characters in the system do what they do. Daniel Day-Lewis is reliable as ever playing a real-life character that goes through a transformation from an energetic wild youth to an introspective determined son. \n\nTerrifying but biased premise with a superb performance by Pete Postlethwaite",
            "review_date": "2016-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"GRUELING | HEART-WRENCHING | INSPIRATIONAL | LIBERATING | POWERFUL\" (93-out-of-100)",
            "review_date": "2016-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best drama movies I've ever seen.",
            "review_date": "2016-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Day-Lewis, in one of his many terrific performances, brings this fascinating, harrowing true story of false imprisonment to life as only he can. His grit, tenacity, and irreverence as a man wrongfully accused are palpable. Pete Postlethwaite, playing Lewis' father, is also excellent and masterfully embodies the more passive side of this family duo. Both learn from each other through their often differing approaches to fighting their conviction at the hands of the British government. Truly a powerful acting pair to witness.",
            "review_date": "2015-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "LUCKY TO SEE THIS TYPE OF ACTING.....A MASTERPIECE",
            "review_date": "2015-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I grew up in the London of bomb threats. UK news did not represent the Irish side of the conflict as at all legitimate. The result in me was that I did not want to watch this film and I was confused when the Guilford 4 found justice. It was almost as though they were actually guilty still and the miscarriage of justice was that they had been released. Maybe it was my imagination but that is what I felt was the undercurrent of the news coverage at the time. \n\nI shudder to allow the knowledge of how many people have been crushed by the British justice system into Britannia-inculcated consciousness. It is coming in though. \n\nViva the Guilford four, Stephen Lawrenny, Trayvon Martin and everyone else.",
            "review_date": "2015-05-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shocking and unbelievable but true scandal about the police and government of England. This is the story of 4 young scapegoats and father of one of them (Gerry Conlon played by the impeccable Daniel Day Lewis) the height of the IRA bombings. Despite knowing their innocence, evidence suppressed resulting them being incarcerated for 15 years. Poor Gerry,s father died in prison. Kudos to attorney Pierce (Emma Thompson) for her tenacity and resourcefulness in uncovering the suppressed evidence thus bringing the great travesty of justice to  light. The pain in Gerry´s facial expression when he was exonerated and when he exploded out of the courthouse to breath free once again after 15 years was nothing short of electric.",
            "review_date": "2015-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shocking miscarriage of justice because of crooked police, judges and jury going right up to the Queen. The immense wrong done to 4 young people at the height of their youth (impeccable Daniel Day Lewis as Gerry Conlon was one of them) was the incarceration plus Conlon´s father who must die in prison. If it was not the tenacity and resourcefulness of attorney Pierce(Emma Thompson), the utter shame and inhumanity of the crooked police would never have come to the light of day. Made in 1993, 22 years ago, one could sense that young Daniel Day Lewis would become a giant in the acting world as we witness today.",
            "review_date": "2015-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "D-DL's best film in my view. Superbly acted.",
            "review_date": "2015-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great story that show us how the police and the law can be the worst nightmare for innocent people when they are driven by political issues and stereotypes about nationalities, races, religion, etc. Daniel Day Lewis' performance is remarkable.",
            "review_date": "2015-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Top not performers doing top notch work in a good period peace type movie.",
            "review_date": "2015-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel D-L gives a really good performance in this true story that wasn't all that compelling.  Do yourself a favor and turn the subtitles on from the start.",
            "review_date": "2015-04-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With the subject matter at hand this should have been a good movie but it failed to grab my attention. The only thing I liked about this movie was the performance of Daniel Day-Lewis. Daniel Day-Lewis is in my opinion one of the greatest actors of all time. In every film he stars in he completely steals the show.",
            "review_date": "2015-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The story of the guildford four with Daniel Day Lewis once again proving that he really is a top class actor. Very good prison drama.",
            "review_date": "2015-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a really engrossing film, telling the story of the wrongful imprisonment of Gerry Conlon, one of the so-called 'Guildford Four'.  Day-Lewis and Postlethwaite are fantastic and bring a real credibility to the father-son relationship.  Thompson as well, shines in a cameo as their defence lawyer.  Made me want to search out the source novel, the whole story of police and government corruption literally beggars belief.",
            "review_date": "2015-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the first 17 minutes I was extremely bored but then this film really picks up and gets you right into its amazing story. Day Lewis was once again freaking amazing in it and so was the other cast. Kind of like my left foot he had another really well shown relationship with his dad. The ending was super good and I had no idea this was a true story. The thing I loved about this film was when they were first said to be guilty the viewers get a sense of anger because we know he is not and we just can't do anything about it and then to top it of this is a true story which makes it extra good. Overall from the story to day Lewis this is a great film and would recommend it to all.",
            "review_date": "2015-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "89%\nWatched this on 30/12/14\nIn the Name of the Father is one of the most exceptionally directed real life crime movies. It's performances are good and unlike other real life stories, it is well paced and doesn't lag at all.",
            "review_date": "2014-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Personally I have a very tough time believing convicted criminal stories of innocence and police brutality. I have been around long enough to not only have a loved one who I would never imagine commit crimes and go to jail, but I've also been victim to different crimes myself. I watch a lot of jail shows and movies and almost all the time criminals are either bad people or ppl who make bad choices. I remember watching Making A Murderer and being one of the few ppl thinking it was bullshit and sure enough researched it to find out much of the incriminating evidence was left out of the documentary. This movie though for once does give me a belief that in some rare cases criminals are treated unjustly and are innocent. Even after researching their case, I still believe that this was an injustice going against my own normally held beliefs that police normally do the right thing. The fact that this movie could convince me of their innocence and wrongdoing is reason alone to see this movie. Daniel Day Lewis is one of the best actors of our time and plays the lead character with precision. The story is gripping and edited well to showcase the main points. I was able to empathize for once about how horrible it is to be innocent And locked up, not just empathize with a victim. It made me believe that either case is equally as harrowing. This is a great film and hard look at Englands past justice system and any justice system with what they will do at times of war.",
            "review_date": "2014-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the Name of the Father has quite a few narrative flaws, such as an extremely poor sense of time progression as it makes bounds between years within the blink of an eye, character motives changing on a whim, and a few bizarre logical leaps, but very much like with all of his other movies, Daniel Day-Lewis delivers a performance strong enough to turn this rather average, merely competent movie into something compelling. It's an interesting true story of injustice, though it's a story that seriously demanded a more disciplined and more thought provoking film.",
            "review_date": "2014-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With the utterly brilliant Daniel Day-Lewis in the lead, In the Name of the Father is a great film about an extraordinary struggle.",
            "review_date": "2014-10-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most remarkable thing about this powerful courtroom drama is Daniel Day-Lewis acclaimed performance.",
            "review_date": "2014-10-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "89%\nWith a well-written script and identifiable characters, held aloft by Day-Lewis as Gerald Conlon, \"In the Name of the Father\" is a must-see for biopic aficionados.",
            "review_date": "2014-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was expecting this to be more of a courtroom drama than what it was.",
            "review_date": "2014-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Director Jim Sheridan and Daniel Day Lewis teams up again after the sucess of my left foot, Daniel Day lewis gives another remarkable performance as Gerry Conlon. Based on a true story, a guy who serves 15 years in jail for a crime he never committed with his father, who were forced by British police. This is one of my favorite movie based on a true story.",
            "review_date": "2014-07-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "another sad bittersweet story of Irish history",
            "review_date": "2014-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Again one of those films that happen inside a small space but yet are intense enough to keep you at the edge all the way through. And as always, reality is full of impressive people and stories.",
            "review_date": "2014-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Better and more focused a film than My Left Foot, In the Name of the Father benefits from Jim Sheridan's tight direction and a typically fantastic performance from Daniel Day-Lewis",
            "review_date": "2014-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Day Lewis and Jim Sheridan again in another biography which with Pete Postlethwaite was even better than their previous \"My left foot\"",
            "review_date": "2014-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "90%\nAnother hit with remarkable acting by Day-Lewis.",
            "review_date": "2014-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In The Name of the Father is a harrowing tale that shows how corrupt government officials can pin any crime on pretty much any person, but eventually will pay the price. Daniel Day-Lewis and Pete Postlethwaite's survival are the central story with many sub-plots that eventually come together to create a cohesive whole of a film.",
            "review_date": "2014-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intense! Doesn't really make you like the English.",
            "review_date": "2014-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the three stars go for the acting \nthe half is for everything else",
            "review_date": "2014-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Forget the movie, one of the greatest fucking credit-sequence songs ever!",
            "review_date": "2014-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With staggeringly powerful performances and a solid and inspiring script and direction, In The Name of The Father is a strong and interesting biographical film.",
            "review_date": "2014-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An outstanding film telling the story of Gerry and Guiseppe Conlon, who were falsely imprisoned by a government that knowingly used them as scapegoats to stifle public outcry over IRA bombings. Well acted by a stellar cast.",
            "review_date": "2013-12-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"I don't understand your language. \"Justice.\" \"Mercy.\" \"Clemency.\" I literally don't understand what those words mean.\"\n\nIf I had to describe this film using only one adjective I would say it is an enraging movie. Jim Sheridan followed his successful directorial debut, My Left Foot, by teaming up once again with Daniel Day Lewis who delivers yet another superb performance. I'm ashamed to admit that I just got around to watching this film for the first time on its 20th anniversary, but it was completely worth it because I was blown away by this powerful and engaging film. I wouldn't call this a groundbreaking film because we've had plenty of movies dealing with similar themes. Films like The Hurricane or The Shawshank Redemption deal with the kind of social injustice that is presented here where an innocent man is incarcerated due to a corrupt justice system. In the Name of the Father differs a bit in that it doesn't focus so much on the hope of finding freedom, but rather on the enraging aspect of the injustice that the lead character and his family and friends go through. This is a genre that I'll always be drawn too, especially when it is based on a true story because I think these people deserve to have their voice heard after all they've gone through. I know that several artistic liberties were taken to make the film, but even so it draws attention to Gerry Conlon's autobiographical book. Sheridan's direction was solid, and I liked how he focused a lot of the attention on the father and son relationship. I don't know if this film would've worked as well as it did if it weren't for Daniel Day Lewis's brilliant performance. He is without a doubt one of the best actors of our time.\n\nGerry Conlon (Daniel Day Lewis) grew up in Belfast in the 70's when the IRA terrorist attacks were at its peak. He was never involved with the terrorist group, but he was no saint either. As a young lad he felt forced to become a small time thief due to the lack of employment. While robbing some lead sheets from a roof of a house he accidentally leads British soldiers to a home that was hiding IRA weapons. Fortunately they never discovered anything, and the IRA members send Gerry off with a warning. His father, Giuseppe (Pete Postlethwaite), with whom he's had an estranged relationship, sends him to London hoping he can find a better future there and escape from all the political turmoil. On his way to London, Gerry runs into his school friend Paul Hill (John Lynch) and together they decide to go visit their friend Patrick Armstrong (Mark Sheppard) who has been living in London along with a group of free spirited hippies. Unfortunately for Gerry and his friends, they end up being in the wrong place at the wrong time and are accused of bombing a soldier's pub. Bullied by the police officers they are forced into signing a confession and are sentenced to prison along with some of Gerry's family members. In prison, Gerry and his father continue to fight to prove their innocence with the help of an attorney named Gareth Pierce (Emma Thompson) and the more she digs into the story the more corruption she finds in the police procedures.\n\nThe film manages to draw you in and make your blood boil due to all the injustices suffered by these characters. It is one of those movies where the tension builds up with the passing of time, but at the same time you also feel a connection growing between Gerry and his father. The film becomes more than a simple social injustice tale and turns into a character driven story focusing on the relationship between father and son. It is a shame the film has kind of been forgotten because I thought it was really well made. It never won an Academy Award, but it did receive 7 nominations including Best Picture, losing out to Schindler's List that year. Daniel Day Lewis outshines everyone in this film, although the supporting cast was very strong, especially Pete Postlethwaite who shared great chemistry with Lewis. This was an intense film that had me at the edge of my seat thanks to the way in which Sheridan tells the story and slowly draws the viewer in. The final 20 minutes of this film are perfect and Daniel Day Lewis knocks his performance out of the ball park.",
            "review_date": "2013-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With a very good score, fine acting from Emma Thompson, Pete Postlethwaite and especially Daniel Day-Lewis and a strong script, \"In The Name Of The Father\" is a very moving, thought-provoking film.",
            "review_date": "2013-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Day-Lewis is  excels in this expose' of the inhumanity of the British government in their inept dealings with what they though was the IRA.",
            "review_date": "2013-11-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Moving true story of an Irish man who, along with a number of others, was wrongfully and deliberately convicted by the British government for murder and then eventually freed.",
            "review_date": "2013-11-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A gripping story of wrongly convicted innocent people during a hysterical time between the Irish and British. A strong narrative fronted by brilliant performances by both Daniel Day-Lewis as well as Pete Postlethwaite.",
            "review_date": "2013-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Day Lewis is maybe the greatest Actor ever!",
            "review_date": "2013-10-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In The Name Of The Father pairs the director and actor team of Jim Sheridan and Daniel Day-Lewis together again after creating the biopic My Left Foot, and again they create another fine biographical film which is undoubtably one of the finest films in Irish cinema.\n\nIn The Name Of The Father is a very powerful story which tells itself with a gripping tenacity, one which starts of with a convincing setting for the time period it begins in and gradually unravels more and more as the drama processes. It's production design is impeccably convincing and assists the functioning of the atmosphere which ensures that the viewer truly feels that they are experiencing the courtroom scene and prison for real. The atmosphere is very intense throughout In The Name Of The Father, and every moment is a powerful one. \nThe intense atmosphere is consistently maintained by the musical score as well as by the powerful dramatisation of the story, and that makes it prove to be a powerful and effective tale which tugs at the fears and angers of the viewer, making it emotionally powerful and memorable for the viewer, which Jim Sheridan deserves immense praise for achieving.\nIt's an honest story, one which documents the corruption of the 1970's but was filmed in the 1990's, reminding us all of the counter-culture time period in an Irish context strongly due to great story direction and a powerful screenplay. In The Name Of The Father even has a clever title.\nIn The Name Of The Father just manages to consistently remain as a powerful courtroom film and prison film, and above all it's an inspiring tale of fighting back against injustice.\nAnd what keeps In The Name Of The Father consistently powerful is the fine work of the dedicated and talented cast.\nDaniel Day-Lewis, considered the greatest actor of his generation, is at some of his best in In The Name Of The Father. Although that could be argued for nearly every film he has been in, In The Name Of The Father is a special case because he doesn't portray a painter with cerebral palsy or a serial killer or the president of the United States. He portrays an Irish everyman caught up in a scandal, a scandal which his character handles with a mix of dignity and anger. His skills at portraying Gerard \"Gerry\" Conlon are, as usual, flawless, and deserving of nothing short of an Academy Award nomination.\nEmma Thompson also provides a charismatic supporting role, driving her determination and unwillingness to give up forward consistently to the benefit of the story and the characters, and her natural charm and grace as an actress ensures that she can sufficiently handle the material put forward for her. \nPete Postlethwaite also proves to give one of his finest performances as his physicality conveyed a sense of frailty which was appropriately fitting to the role that he plays in the story as the father of Gerry Conlon, and his wise line delivery and characterisation skills are never short of excellent.\nJohn Lynch also proves his talents on screen during In The Name Of The Father.\n\nIn The Name Of The Father is simply a strongly compelling piece of Irish cinema which tells a powerful story with powerful direction.",
            "review_date": "2013-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Day-Lewis strikes acting supremacy again with his enthralling take on a wrongfully imprisoned Irishman",
            "review_date": "2013-10-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I felt the Gerry's anger against the unfair and coward government",
            "review_date": "2013-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible story of injustice with a moving father-son narrative. 'Hurricane' on historical steroids.",
            "review_date": "2013-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm a free man, and I'm going out the front door.",
            "review_date": "2013-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful movie that highlights the trials and tribulations that innocent people face when opposing the judicial system. Crafted with the right mix of tension and controversy which is intensified by the amazing performances of Mr. Daniel Day-Lewis and Mr. Pete Postlethwaite, In the Name of the Father is definitely worth seeing! ~Steph.",
            "review_date": "2013-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A chilling drama that overflows with brilliant performances that wont leave your mind in peace for a while.",
            "review_date": "2013-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the Name of the Father is thoroughly entertaining story and an example of the corruptness, not only of the IRA, but of federal government in general.",
            "review_date": "2013-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In terms of courtroom and prison drama regarding injustice, there are no lacks of masterpieces, like Norman Jewison's The Hurricane and Frank Darabont's The Green Mile and The Shawshank Redemption. But few are like In the Name of the Father which is telling a blatant truth without much false editing and dramatization. What's more, it's about the IRA, a dark history which is fewer and fewer mentioned in the media. Framed as terrorists for setting up the explosions, but who is the real culprit after all? Sadly, the truth is often covered by emotions, patriotism and unfounded public opinion. As long as sentiments are aroused to turn against you, you are doomed. Just come to think of it: in a situation like that, what can you do if you were in the English's shoes? If revenge and violence are not stopped, will the Conlons be ever allowed a chance to file an appeal in England? The abuse we witnessed here is still repeating after 40 years, and will persist as long as there is inequality in the world, regrettably. Regarding the acting crews, Daniel Day-Lewis gives a brilliant performance as the once rebellious adolescent turning into a mature and determined heroic figure, but Pete Postlethwaite is even better, for all the aspirations he offers as a simple, honest and kindhearted father.",
            "review_date": "2013-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible acting from Daniel Day-Lewis, who brilliantly portrays Gerry Colon's \"free-spirited\" but righteous nature and the roller-coaster of emotions he experiences, from rebelliousness and intense frustration, to compassion and love for his father. The movie also effectively shows how the public pressure on officials with questionable ethics can lead to escapegoting.",
            "review_date": "2013-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "3.5: I had actually never seen In the Name of the Father before although it has been on my list for over a decade.  It only served to confirm my long held belief that Daniel Day-Lewis is the greatest actor working today and perhaps the greatest ever to grace the screen.  He is an absolute chameleon.  This story seems worlds away from my experience as virtually the only lens through which I view the IRA and the fight for Ireland is via Hollywood (or non-Hollywood pictures like Bloody Sunday).  The British Colonel I worked with in Africa obviously would have a very different perspective, but I'm too far separated and too young to be able to relate in any meaningful way.  Great picture and outstanding performances.",
            "review_date": "2013-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic! Great story with amazing performances.",
            "review_date": "2013-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A beautiful film showing a major flaw of British justice system which kept four innocent people imprisoned for 15 years! And, more to that, they never tried the real offenders!\n\nDay Lewis is as brilliant as in his any performance. The father Pete Postlethwaite has also been outstanding.",
            "review_date": "2013-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Day-Lewis and Postlethwaite are exceptional in this surprisingly energetic film. One can almost imagine 2008's Hunger being a response to the loudness and bustle of this film, which maintains it's pace despite the environs. Emma Thompson also quickly gains audience respect as lawyer Gareth Pierce. If the plot is predictable, and the music occasionally dated, I didn't notice. Loved it.",
            "review_date": "2013-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the Name of the Father is one of the most heartbreaking movies that I have ever watched. The movie is inspired in a true story, The Guildfor Four, and all the members of the cast do an outstanding job showing the emotions of each character. Daniel Day-Lewis like always gives an outstanding performance, showing the transformation of a young Irish man through his years in jail. This movie denounces how law is used against the oppressed. Only good people can correct the actions of the law.",
            "review_date": "2013-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "85%\nA sheer, terrifying movie to be honest. And the fact that it's based on factual events makes it even more terrifying. The acting is incredible, featuring a more than Oscar-worthy performance by none other than the master-of-the-craft himself: Daniel Day-Lewis.",
            "review_date": "2013-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Day-Lewis's characters always get to the bottom of my soul..",
            "review_date": "2013-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Very emotional. Lots of great acting. And the fact that it is a true story just makes you hate government even more.",
            "review_date": "2013-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"In The Name Of The Father\" is burned to the ground with it's disturbingly grating police bullying filled storyline, and not even it's oscar-nominated performances from Daniel Day-Lewis, Pete Postlethwaite and Emma Thompson can save it.",
            "review_date": "2013-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Day Lewis. When he does a film he sure puts in the effort. His intensity is radiated from screens, he is undoubtedly an incredible actor. He holds the entire film.",
            "review_date": "2013-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After this experience you'll think that \"justice\" cannot be an English word.",
            "review_date": "2013-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sheridan teams up with actor Day-Lewis to give us a portrait of the difficult situation of the troubles and the IRA. This film is based on the true story of Gerry Conlon, wrongly accused of a bombing in London and imprisoned along with his father after the investigators force a confession out of him. A gripping drama with another compelling performance by Day Lewis who mixes rage, pride and anger in one of Sheridan's best films.",
            "review_date": "2013-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very, very well directed and acted, most noteworthy to Daniel Day-Lewis.",
            "review_date": "2013-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel-Day Lewis should just be given an automatic Oscar with every performance.",
            "review_date": "2013-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was pleasantly surprised by this because I thought it looked dull as dirt.  It was a very compelling story of a group of people wrongly convicted and sent to prison many years.   Daniel Day Lewis and Pete Postlethwaite deserved their Oscar nomination.  But Emma Thompson' who I love, not so much.  She could do this role in her sleep.",
            "review_date": "2013-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An incredibly emotional and powerful picture which, through the wrongful and unjust struggles of individuals, portrays the spirit of an entire nation. Wonderfully written, directed, and acted including masterclass performances by Day Lewis, Postlethwaite and Thompson. It's as much as a personal journey about a man and his relationship with his father as it is a story of judicial corruption. Simply incredible.",
            "review_date": "2013-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "IN THE NAME OF THE FATHER\n\nAndy Dufresne of Shawshank Redemption escaped with perseverance. Prison Break. John Abraham of New York came out. In silence. Then went on to become a terrorist. While Gerard Conlon; well he got his case dismissed and got the Majesty by her womanly balls.\n\nIn the Name of the Father is the real life story of Gerard Conlon who along with many others was taken in under the dastardly Prevention of Terrorism Act enforced by the House of Commons in 1975 British during the war against I.R.A. for the Guildford bombings. It brings to the silverscreen a shocking and terrific portrayal of the infamous case spread over a span of 15 years affecting the lives of both the supposed guilty and their near and dear ones.\n\nDaniel Day Lewis is exceptional in this film as Gerard Conlon as also Pete Postlethwaite as his father Guiseppe. Jim Sheridan has wonderfully directed the movie with the perfect music to bring his vision of the truth to life. Watch out for the scene where Like A Rolling Stone starts in the film. This legendary song marked off the beginning of the film. As if Bob Dylan's wife set this film (read stone) rolling which only became faster and more gripping by the minute. The editing is crisp. The pace is breathtaking. While the cinematography works wonders with the company of music. \n\nThe scene where The Godfather's music is in the background is a masterstroke to this clever film. That music brought an immense sense of power to that scene. As if making it reek with a ready to pounce horror.\n\nSo what's wrong with the movie? Emma Thompson as Gareth. Her portrayal of the lawyer was slowing the pace whenever she came on screen. Except for the final courtroom scene where she was just unreal. Masterly in her performance only then. Another major flaw was the total disappearance of Gerard's sisters in the climax. \n\nAll in all, this is one of the best courtroom-cum-prison-cum-terror-cum-biographical movies out there. The same year Schindler's List had released as also Philadelphia. Tom Hanks had edged Daniel for the best actor. It must have been so difficult for the Academy to hand out the Best Actor. Besides, it didn't get a single Oscar inspite of 7 nominations.\n\nThis film is one among the unknown many. Terrific. Must-watch.\n\nRating: 9/10, ****1/2 /5, 90/100",
            "review_date": "2013-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "IN THE NAME OF THE FATHER\n\nAndy Dufresne of Shawshank Redemption escaped with perseverance. Prison Break. John Abraham of New York came out. In silence. Then went on to become a terrorist. While Gerard Conlon; well he got his case dismissed and got the Majesty by her womanly balls.\n\nIn the Name of the Father is the real life story of Gerard Conlon who along with many others was taken in under the dastardly Prevention of Terrorism Act enforced by the House of Commons in 1975 British during the war against I.R.A. for the Guildford bombings. It brings to the silverscreen a shocking and terrific portrayal of the infamous case spread over a span of 15 years affecting the lives of both the supposed guilty and their near and dear ones.\n\nDaniel Day Lewis is exceptional in this film as Gerard Conlon as also Pete Postlethwaite as his father Guiseppe. Jim Sheridan has wonderfully directed the movie with the perfect music to bring his vision of the truth to life. Watch out for the scene where Like A Rolling Stone starts in the film. This legendary song marked off the beginning of the film. As if Bob Dylan's wife set this film (read stone) rolling which only became faster and more gripping by the minute. The editing is crisp. The pace is breathtaking. While the cinematography works wonders with the company of music. \n\nThe scene where The Godfather's music is in the background is a masterstroke to this clever film. That music brought an immense sense of power to that scene. As if making it reek with a ready to pounce horror.\n\nSo what's wrong with the movie? Emma Thompson as Gareth. Her portrayal of the lawyer was slowing the pace whenever she came on screen. Except for the final courtroom scene where she was just unreal. Masterly in her performance only then. Another major flaw was the total disappearance of Gerard's sisters in the climax. \n\nAll in all, this is one of the best courtroom-cum-prison-cum-terror-cum-biographical movies out there. The same year Schindler's List had released as also Philadelphia. Tom Hanks had edged Daniel for the best actor. It must have been so difficult for the Academy to hand out the Best Actor. Besides, it didn't get a single Oscar inspite of 7 nominations.\n\nThis film is one among the unknown many. Terrific. Must-watch.\n\nRating: 9/10, ****1/2 /5, 90/100",
            "review_date": "2013-03-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very hard hitting Biopic about a person or his family suffering by dictating mentality of a reputed old civilized country under the pressure of capturing and relocating the peace of their Mainland,against those radical movements of the Irish freedom fighters,if there is only way to justify all those actions by Great Britain impartially.\nBut honestly this film is not about the freedom fighters movement, it's a film on journey of a father and son,their disturbed relationship,about the finding of son's soul himself under the backdrop of all those political unrest.And this job is successfully pulled out by Day-Lewis and Postlethwaite,in a honorable mention.\nVery passionate in making,linearly described by the storyline and directed intelligently specially at the final courtroom sequence.",
            "review_date": "2013-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's not  perfectly plot, but I love it from the bottom of the heart.",
            "review_date": "2013-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mini Review 20: In the Name of the Father\n\nPlot:\n\nGerry Conlon (Daniel Day-Lewis) revels in his free spirited imprudence in the midst of near-war ravaged Belfast. Concerned about his future, father Giuseppe Conlon (Pete Postlethwaite) ferries Gerry over to London and his foolhardy nature continues to flourish given his new set of brashy friends.\n\nEverything goes topsy turvy when four of them friends are arrested in connection with Guildford pub bombings. The police not only manage to extract a forceful confession from the accused four but also extend their vendetta on to Gerry's family imprisoning his father. Rest of the story is about Giuseppe and Gerry's fight from behind the bars, their very own ideological clashes coupled with Gerry's restlessness in the wake of proving their innocence and authority's brutality.\n\nPositives:\n\n--> Real story and extremely natural settings\n\n--> Great performances by Pete Postelthwaite and Daniel Day-Lewis. \n\n--> Great musical score by Trevor Jones\n\nNegatives:\n\n--> Ignorable draggy moments at the beginning of the film",
            "review_date": "2013-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Justice can go wrong: terribly terribly wrong.",
            "review_date": "2013-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Superb Piece of Hollywood,",
            "review_date": "2013-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Strong and realistic, this docudrama is definitely worth seeing.",
            "review_date": "2013-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best Irish films",
            "review_date": "2013-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Superb performances and one of the finest movies by Jim Sheridan.",
            "review_date": "2013-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really solid drama that drag in the middle. Also: Lewis is a damned acting machine.",
            "review_date": "2013-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After the phenomenal picture, My Left Foot that garnered Daniel Day-Lewis a much deserved Academy Award, director Jim Sheridan and Lewis would collaborate again on In the Name of the Father. This is yet again a powerful engaging true story of Gerry Conlon, a man falsely accused of the 1974 Guildford pub bombings orchestrated by the IRA. Sheridan assembles a phenomenal cast here, and each brings something unique to the screen. Daniel Day-Lewis is phenomenal in his performance and he is always captivating to watch in his roles because he is a perfectionist and a true artist of his craft, and he becomes the character he portrays. This is a well constructed drama that is highly entertaining from start to finish. Daniel Day-Lewis delivers yet again with this film, and like I said, he is a dedicated actor who always gives his all in a performance. The story is terrific and is based on true events, which makes for some of the best stories to tell on film. I really enjoyed the film, and when real life stories are adapted to the screen, they make for much more compelling movies. With a great cast of talented actors, effective directing and an engrossing plot, In the Name of the Father is a stellar film that should appeal to any viewer looking for a truly memorable film to watch. This is filmmaking at its very best and is a brilliant film that really can spark an interest in the subject it displays. The Strength of the film lies in its cast and plot, both are wonderful, and will surely interest the most demanding filmgoer. In terms of a great story, In the Name of the Father is terrific and as a whole, I felt it was a flawless film.",
            "review_date": "2013-01-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Worth a watch. Interesting story.",
            "review_date": "2013-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the Name of the Father is one of the most powerful and engaging films that i have ever seen. Daniel-Day Lewis gives one of the best performances of his career, it is clearly visible that he completely immersed himself into his character. The story is somewhat simple, but it is executed brilliantly. The film fully grasped my attention the whole way through and had me on the edge of my seat, literally. It may feel a bit tiring for some people, but i simply loved it. In the Name of the Father is a masterpiece and a must see film.",
            "review_date": "2013-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Given that this film is based on a real story, it is understandable that the story was not as streamlined as a fictional film. However, I still felt that the plot was awkwardly patched at times, and the story seemed to have dragged on and on and on. That said, this film has educational and civic value, specifically in British and Irish politics.",
            "review_date": "2013-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A compelling film with a striking lesson for us today.",
            "review_date": "2013-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The film is good. It's well acted, well paced and well directed. The father & son thing in jail is really well done. kudos to DDL & Mr. Pete.",
            "review_date": "2012-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"They kill Giussepe\", the most beautiful scene of the whole movie.",
            "review_date": "2012-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible film, tells the story of a great injustice done by the British police and legal slye while being terrorized by the IRA in the 70's. The plot follows closely the real life story of the Guildford 5 eventual fiasco, with only minor alterations for better dramatizations. Acting by Daniel Day-Lewis is phenomal (as usual) and also Pete Postlethwaite and Emma Thompson shine as supporting stars. The movie isn't just a documentary though, it works on other levels such as the relationship between father and son and the brutality of the IRA/British conflict. \nHighlights\n- The opening scene depicting a riot in Belfast between (terrified) English army with machine guns and APC's and a brick-throwing mob assembled in minutes\n- Daniel Day-Lewis' performance\n- Pete Postlethwaite and Emma Thompson performance \n- The father-son relationship, who grow apart and then come back together, howevery they always love eachother\n- The final triumphal courtroom scene which works exactly like a katharsis should\n\nLetdowns\n- nothing really important. Perhaps if some dialogue were left out it in editing, it would even better.",
            "review_date": "2012-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie not without its flaws with a biased unidimensional perspective based on the biography by Gerry Conlon one of the accused from Guildford Four. While the overall story is commercialized and worked around for dramatic effect, Pete Postlethwaite's performance as the protagonist's father was too good in some scenes. Though it is competently performed, well written and executed, the battle is already half won with just the knowledge on the premise and the ordeal the Guildford four and Maguire seven have been through in real life. \r\n\r\nBased on real life events following Gerald Conlon ( \r\nDaniel Day-Lewis) a carefree wild youth who is accused of the Guildford bombing and imprisoned after coerced confession. This leads to arrests of his aunt's family infamously known as the Maguire Seven along with his father Guiseppe Conlon (Pete Postlethwaite), a just man trying to protect his son. After his father's death due to harsh prison environment and depression, he vows to fight back on the system with the help of a convinced lawyer Gareth Peirce (Emma Thompson).\r\n\r\nThe initial riot sequence was exhilarating pepped by a solid background score and hysterical atmosphere. The arrests, torture, trial and sentences leaves an emotional impact on the unjust treatment and fate of all the accused and some performances here are to be commended. But Pete Postlethwaite's portrayal of Conlon's father breaks the shackles, elevates the emotional depth in the movies and justifies the title. The initial scene where Guiseppe pleads the IRA men to forgive his son, the expression on his face when Gerald returns from England, the conversations inside the prison cell and the scene just before he dies are a few examples of his masterful performance. I can understand at a biographical point of view for a very biased approach, but as a movie which deals with other characters as well should have shown some elements of thoughts leading up to the characters in the system do what they do. Daniel Day-Lewis is reliable as ever playing a real-life character that goes through a transformation from an energetic wild youth to an introspective determined son.\r\n\r\nTerrifying but biased premise with a superb performance by Pete Postlethwaite",
            "review_date": "2012-12-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sheridan and Day-Lewis is like one of the perfect combination director-actor for cinema.\n\nA great character, controversial, emotional when needed, a great vehicle for the message.",
            "review_date": "2012-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Having finally seen this brilliant, yet angry film, it is incredible and incredulous.  Daniel Day Lewis is brilliant, and is brilliantly supported by the late Peter Postelthwaite and Emma Thompson.  It is a film to make the blood boil, yet somehow be amazed at the resilience displayed by Conlon.  It is impossible to imagine what emotions he and any other of the wrongly convicted must have felt during the years of imprisonment,  All the cast are perfectly presented, including the police who forced the false confessions and it is a film that stays long in the memory.",
            "review_date": "2012-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I had somehow overlooked this Day-Lewis film.  Shame on me.",
            "review_date": "2012-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the Name of the Father tells a true story of Gerry Conlon, an Irish man who was sentenced to prison in 1970s for IRA bombing he did not commit. The film is a bleak and depressing reminder how even modern day Western Democracy can commit conscious human right atrocities when facing crisis. \n\nI rarely depend on quoting film lines, but to summarize In the Name of the Father it feels appropriate; as Gerry states after his farce trial: \"Our case was so insane that if you made it up, nobody would believe it\". Yet Gerry Conlyn (Daniel Day-Lewis) was sentenced for life in prison by British court along with most of his family(!) and other unfortunate side standers. Even more amazingly Gerry and the rest were sentenced to prison largely based on shoddy evidence and confessions extracted with torture techniques(!). Sounds unbelievable and yet  Gerry's story is true. \n\nAs mind boggling from human's right perspective as Gerry's imprisonment part is, the film does contain a more warm and positive side to it in form of father-son reunion. Gerry and his father Giuseppe Conlon (Pete Postlethwaite) forge a strong bond and put aside their difficult past in order to survive their unfair imprisonment. These scenes contain some of the best acting ever from Daniel Day-Lewis where he fully throws himself into the role and portrays the emotional chaos Gerry goes through during his imprisonment.  \n\nStill the film was not quite as involving as I'd hoped it to be. The acting and story definitely deserve praise, but like with director Jim Sheridan's other famous tittle, The Boxer, I could not fully immerse myself totally in the film. Perhaps it is Sheridan's brutally bleak directing and story telling which keeps me somewhat detached from the film and characters. Even so In the Name of the Father is technically excellent biography film, no question about that, and proves yet again Daniel Day-Lewis' unquestionable talent for acting.",
            "review_date": "2012-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film one of the best performances of Daniel Day-Lewis, with my left foot about the true story of the Guidford four. The intensity is amazing. I remember see in it for the first time, I was really mesmerized when, reading the last story lines, I understood it was a true story. It's definitely a must see. No doubt about it.",
            "review_date": "2012-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A moving historical drama anchored by solid performances from Daniel Day Lewis and Pete Postlethewaite.",
            "review_date": "2012-11-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A good film which gets better as it goes on. Parts in the middle do drag a little bit but it soon picks up. The ending is masterful and gives the film that edge it needs. Emma Thompson has a good fleeting role and Daniel Day Lewis is not too bad. Best performance goes to Pete Postlethwaite.",
            "review_date": "2012-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"In the Name of the Father\" is very disturbing but the emotional payoff is worth it. The relationship between the father and son is played out nicely; the scenes with them together are the best parts of the film. Everything else from the acting to pacing is superb. Daniel Day-Lewis is one of the greatest actors of all time; this film supports that statement. It's an unbelievable true story that shouldn't be missed.",
            "review_date": "2012-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the Name of the Father is a powerful film, and much of the credit for this must go to Daniel Day-Lewis and Peter Postlethwaite. Though centering on a horrendous miscarriage of justice, the glue holding In the Name of the Father together is the torrid relationship the exists between their two characters.",
            "review_date": "2012-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based on the true events surrounding the IRA bombing in England, In the Name of the Father tells the story of falsely convicted Gerry Conlon, brought to life magnificently well by Daniel Day-Lewis & shows Jim Sheridan in total control of his craftwork. Featuring truly great movie moments like the intense interrogation scenes, where Daniel Day-Lewis was at his best, & almost all scenes between Gerry Conlon & his father, which were a treat to watch. Also, the supporting performances by Pete Postlethwaite playing Gerry's father & Emma Thompson playing his lawyer deserve a mention. Overall, there is no doubt in saying that this film is a must-see. Must-see for Jim Sheridan's controlled direction & Must-see for Daniel Day-Lewis' remarkable performance. So go see it.",
            "review_date": "2012-10-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based on true events. Amazing!  Big fan of Daniel Day-Lewis",
            "review_date": "2012-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent prison movie, brutal, emotional and amazingly acted. Perhaps one of the best that have been made in recent years.",
            "review_date": "2012-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's absolutely infuriating that people can do this to one another - that aside, this is a brilliantly composed and superbly powerful picture, proving once again the team of Sheridan and Day-Lewis is a golden one.",
            "review_date": "2012-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Day-Lewis is brilliant! Pete Postlethwaite is an absolute genius! This movie is heartbreaking and beautiful. This should be on everyone's, must watch list.",
            "review_date": "2012-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Day Lewis (our greatest living male actor) should have won his second Oscar for his work here. Instead, the Academy gave it to Tom Hanks!!!  Ugh!!",
            "review_date": "2012-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Day-Lewis provides an incredibly moving, and from what my Irish friend tells me, very realistic depiction of a true story.",
            "review_date": "2012-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good and crazy story....The British were assholes back then! Ugh.",
            "review_date": "2012-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful. Daniel Day is brilliant and this is a drama you can feel involved with.",
            "review_date": "2012-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliantly Picturised story of the Guildford Four and Maguire Seven. Strong performances by Daniel-Day Lewis and Pete Postlethwaite.",
            "review_date": "2012-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Picture , Daniel Day Lewis can do anything in acting .",
            "review_date": "2012-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's rare that a film makes compelling, timeless political statements, and rarer still to do so in the context of telling a great story. The story of Gerry Conlon, and the rest of the Guildford Four, needs to be told and retold. Especially in times when people are willing to sacrifice human freedoms and fundamental rights in the hopes of attaining a false sense of \"security.\"",
            "review_date": "2012-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Day-Lewis gives one of his best performances in this emotionally charged real-life drama, especially with the interplay with his father, played by the late Pete Postelthwaite.",
            "review_date": "2012-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outstanding performances by the whole cast. Makes you winder about what happened at Guantanamo Bay detention camp and what other atrocities occurred in the name of \"prevention of terrorism\" . Kafkaesque but true.  Just because people share a common language doesn't make them nice guys as this story proves. I love the line that Gerry Conlon  says: \" You see, I don't understand your language.  \"Justice.\" \"Mercy.\" \"Clemency.\"   I literally don't understand what those words mean.  I'd like to put in an application to get all my teeth extracted..               That way I could put my fist in my mouth and never speak.another word of fuckin' English so long as I live.\"",
            "review_date": "2012-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"In the Name of the Father\" is a solidly-acted, technically sound docudrama, even though a number of facts have been manipulated for its storytelling purposes. Daniel Day-Lewis delivers a powerful lead performance, which shouldn't come as a surprise to anyone, and Pete Postlethwaite shines in his supporting role. Politically-charged films usually tend to bore me, so it's only a testament to the greatness of \"In the Name of the Father\" that I was so wide awake and utterly involved.",
            "review_date": "2012-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "such a great film 1 off my all time favs",
            "review_date": "2012-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "iscarried justice often provides the vehicle for emotionally wrenching drama and histrionic fireworks, and such is the case in spades with In the Name of the Father.Memorable performance by Daniel Day Lewis. such a strong and powerful movie on the wrongly convicted felonies ... nice work .\n\nDaniel Day Lewis is, in fact one of the most charismatic actors alive .",
            "review_date": "2012-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A magnificently acted film about the 'true' story of the Guildford 4, as told by one of the alleged bombers. In the Name of the Father is a movie about one of the most disgraceful miscarriages of justice in British history, sending 4 innocent people to jail for 15 years, not including the others who served lesser terms and Conlon's father who died in prison. This story shows everything that is wrong/ was wrong with the legal system, and it tackles an extremely sensitive subject (England vs the IRA and Ireland) with tact and sensitivity, never trying to place blame on either country but instead placing the blame on the individuals themselves.",
            "review_date": "2012-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well done Irish/Brit drama.  DDL rarely disappoints.  Good flick.  Strong performances by Pete and Lewis.",
            "review_date": "2012-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful film about the unjustified incarceration of a group of Irish and the bond between father and son.",
            "review_date": "2012-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Day Lewis at his best! Truly Oscar worthy!",
            "review_date": "2012-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie was great full of tense and as well drama. Moral lesson for me, even the whole world despise you and despite of all the wrong doings and decisions in life nothing can compare the love of your family especially at this story is the role of the father which made him convince that life doesn't stops as long there is hope there will be bright day ahead. Then the truth will always come out.",
            "review_date": "2012-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good movie, wathced on Netflix streaming, havent seen a lot of Daniel Day lewis, only There Will Be Blood before this, and he is a very good actor.  Also has deceased star Pete Postelthwaite. Not Sure of spelling.  Kind of hard to understand through the accents but enjoyable movie",
            "review_date": "2012-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i remember the praise this film got back in 93.....after watching it recently i thought it was quite good but wasnt quite as emotionally compelling as i was hoping....great performances tho from Day Lewis and Posthlewaite",
            "review_date": "2012-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "daniel day-lewis is not an 'actor,' he is a vessel.  there is nothing this man can't portray.",
            "review_date": "2012-05-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best \"historical\" movie I've seen to date.",
            "review_date": "2012-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very powerful movie with two great actors that do a great job of gelling together. Day-Lewis does of great job of showing us the progression of growth in his character and Postlethwaite does well in a supporting role.",
            "review_date": "2012-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorites. Daniel Day-Lewis leads this list of amazing actors in an amazing true story of Gerry Conlon and the rest of the Guildford Four who were wrongly accused of planting a bomb in a pub in Ireland. Absolutely fantastic.",
            "review_date": "2012-05-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful intro and a stylish ending! The story is so well told and so realistic that you're bound to get involved in the conflict and the case. The direction is superb and the acting is superior. Daniel Day-Lewis is a true chameleon, he's flawless in adopting to Irish culture & accent in the same way he's unflinching as native American in Gangs of New York. His acting earned half a star extra from me for the movie!\n\nWith some heart-wrenching, tear-jerking and hatred intimidating one-liners, I just couldn't help but fall in love with the movie. I rate it higher than 'The Shawshank Redemption'. Highest recommendations!\n\nA wee list of awesome one-liners:\n\"I'm a free man and I'm going out of the front door\"\n\"They ought to take the word 'compassion' out of the english dictionary\"\n\"You're not looking me in the eye when you're speaking to me\"\n\"I don't understand your language. 'Justice.' 'Mercy.' 'Clemency.' I literally don't understand what those words mean.\"\n\"From all the places the English tried to rule, they've been beaten in a war to be moved out.\"\n\"I will fight on. In the name of the father and the truth\"",
            "review_date": "2012-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"In the Name of the Father\" is an enormously draining true-life drama made even more powerful by its two lead, Oscar nominated performances. Even though they were only separated by eleven years in real life, Daniel Day Lewis and Pete Postlethwaite make a convincing father and son, and Postlethwaite seemingly comes from nowhere with this heartfelt, compassionate performance.\r\n\r\nWe've come to expect greatness from Day Lewis, and he does not disappoint here either. Watching his transformation from aimless street punk to civil rights crusader is mesmerizing. My only complaint is that it comes too late in the film. I would also have liked to see more of Emma Thompson in a supporting role as the lawyer who eventually frees him. The film spends too much time in the prison and not enough focusing on her efforts to prove his innocence. \r\n\r\nThe scene in the courthouse that closes the picture is powerful when Gerry Condon is ultimately vindicated, but it feels rushed. Many of the characters are composites of real people and some, like Don Baker's character who confesses to being the real bomber behind bars, are completely fictitious. More time should have been spent on Thompson's story than his, especially considering he was never even a part of the actual story. \r\n\r\nStill, the film is very potent and the story needed to be told, and under Jim Sheridan's masterful direction, it moves briskly and draws you in. But the performances and story are the real draws here, and in that respect, \"In the Name of the Father\" is worthy of all the praise. The dramatic licenses add little, as the real events are compelling enough without all of the embellishments.",
            "review_date": "2012-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Effective but too many inacurracies and directorial liberties (added for dramatic effect) for my liking.",
            "review_date": "2012-04-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lewis shows the same versatility, intensity and credibility that he displayed in his Oscar winning role in \"My Left Foot\"",
            "review_date": "2012-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie just proves that one cannot feel secure in this society, with all the rules, and the power of the police/juridical system that was invested in protecting the citizens. Humans are prone to break the rules, for other purposes. Innocent people are taking the blame, and unless they and others fight for their cause, they can pay for something they have not done, for as long as they live.",
            "review_date": "2012-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Day Lewis delivered another unbelievable performances as a wrongly convicted man, with Sheridan's sharp direction, this is one of the most emotional film in the history.",
            "review_date": "2012-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just finished this movie, I thought it was awesome. I would have liked to see some closure in the end but it was a good ending. Daniel Day-Lewis was outstanding as always. And the late great Pete Postlethwaite put on a great show as the caring father.",
            "review_date": "2012-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really good film! Day-Lewis is incredible as usual and Emma Thompson gives a wonderful performance despite minimal screen time....nominated for 7 Academy Awards including Best Picture and Best Director!...",
            "review_date": "2012-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the patriot act..what it can do to you..",
            "review_date": "2012-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Day Lewis deserves to be in the conversation of greatest actors of our generation and In the Name of the Father is a perfect example of why. Though at times it can drag In the Name of the Father is a fantastic view of the Northern Ireland uprising and false imprisonment. Lewis steals the screen every moment he is on it but the rest of the cast does admirable jobs as well. If you haven't seen this film it is a must see.",
            "review_date": "2012-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing acting along with a compelling story",
            "review_date": "2012-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Spectacular. Daniel Day-Lewis was great but for me Pete Postlethwaite deserves all the applauses.",
            "review_date": "2012-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A Very Powerful Film",
            "review_date": "2012-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a great true story. an instant passionate classic!",
            "review_date": "2012-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some times you watch a movie and tell yourself \"Why I haven't seen this movie before?\". This is exactly that kind of a movie. The movie is said to be a bit blurred in historical accuracies. Probably, that is the reason the movie is a bit underrated. The things that make this movie a winner is its simple yet strong story and immeasurably powerful performances. The movie is about Gerry Conlon and his three friends, the team of whom was later christened as the \"Guildford Four\". They were falsely accused of bombing and killing. This was followed by multiple arrests, including those of Gerry's Aunt and Father, Giuseppe. \n\nFull credit to Jim Sheridan for handling the plot in an appropriate way by following a linear narrative. It is the credit of the director for showing the unique bond between Gerry and Giuseppe, which I am quite sure can be related by any father-son pair. About performances; when there is Daniel Day Lewis, as Gerry, there will be impeccable and majestic acting. I always fall short of adjectives when I talk about Day-Lewis' acting. Be that when he got the news of his father's death or in the climax or any other single scene featuring him, he excelled. Pete Poslethwaithe was also brilliant as Giuseppe and got matched Day-Lewis' acting. Emma Thompson, always a fantastic actress, didn't disappoint and was excellent especially in the last climax courtroom scene. Special mention to Don Baker as Joe McAndrew.\n\nAs a final note this is a movie which, as its fantastic soundtrack 'In the Name of the Father\" by U2 indicates, tells a story about love,humanity and fighting for truth and those make this movie no less great than The Shawshank Redemption.",
            "review_date": "2012-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very emotionally gripping. I found it easy to share in the horror of their conviction, the sorrow of Guiseppe's passing, and finally the joy of their acquittal. One could argue that if he wasn't such a bum that wouldn't have happened in the first place, but you could also argue that his father had a lot to do with that...",
            "review_date": "2012-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "daniel dl is quickly becoming one of my favorite actors",
            "review_date": "2012-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "daniel day deserves the oscar. good acting for the main characters.",
            "review_date": "2012-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great film. Historical inaccuracies aside (the only reason why it does not get five stars), an inspiring story of overcoming injustice. Daniel Day-Lewis and Pete Postlethwaite are remarkable in their performances. This film goes to show that all justice systems suck and why the policemen who wrongly arrested the Guildford Four were never punished for their crimes is beyond me. At least the Conlon family got some compensation for their ordeal. Great film.",
            "review_date": "2012-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "an inspiring epic true movie with great performances",
            "review_date": "2012-02-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tragic and moving story. Pete Postlethwaite is fabulous.",
            "review_date": "2012-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As far as miscarriages of justice go, this case had to be among the worst.  This isn't just ONE innocent man that went to prison and lost 10+ years of his life.  This is 11 people that had to pay for a crime they clearly did not commit due to a crappy trial and crappy investigation work.  Yet at the same time, the people in charge of this investigation have NEVER seen a day in jail for what they did.  Even though there's proof that they DID fuck up this investigation.  Life just isn't fair sometimes.  Anyway this movie is excellent, even if it isn't exactly the most historically accurate film.  The rebuilding of the relationship between Gerard and his father, while completely false, made for a good story and ultimately when the so called accomplices to this bombing were vindicated, it was an incredibly satisfying feeling.  Daniel Day Lewis, as should be no surprise, was tremendous in his role but since the story is a strong one he doesn't need to carry the movie entirely on his shoulders.  Just an excellent movie about how a justice system can completely fuck someone's life just because they want to quickly solve a case.",
            "review_date": "2012-02-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can't believe it took me so long to see this film.  A classic.",
            "review_date": "2012-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Day Lewis- Best actor EVER.  Period.",
            "review_date": "2012-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"I don't understand your language. \"Justice.\" \"Mercy.\" \"Clemency.\" I literally don't understand what those words mean.\"\n\nIf I had to describe this film using only one adjective I would say it is an enraging movie. Jim Sheridan followed his successful directorial debut, My Left Foot, by teaming up once again with Daniel Day Lewis who delivers yet another superb performance. I'm ashamed to admit that I just got around to watching this film for the first time on its 20th anniversary, but it was completely worth it because I was blown away by this powerful and engaging film. I wouldn't call this a groundbreaking film because we've had plenty of movies dealing with similar themes. Films like The Hurricane or The Shawshank Redemption deal with the kind of social injustice that is presented here where an innocent man is incarcerated due to a corrupt justice system. In the Name of the Father differs a bit in that it doesn't focus so much on the hope of finding freedom, but rather on the enraging aspect of the injustice that the lead character and his family and friends go through. This is a genre that I'll always be drawn too, especially when it is based on a true story because I think these people deserve to have their voice heard after all they've gone through. I know that several artistic liberties were taken to make the film, but even so it draws attention to Gerry Conlon's autobiographical book. Sheridan's direction was solid, and I liked how he focused a lot of the attention on the father and son relationship. I don't know if this film would've worked as well as it did if it weren't for Daniel Day Lewis's brilliant performance. He is without a doubt one of the best actors of our time.\n\nGerry Conlon (Daniel Day Lewis) grew up in Belfast in the 70's when the IRA terrorist attacks were at its peak. He was never involved with the terrorist group, but he was no saint either. As a young lad he felt forced to become a small time thief due to the lack of employment. While robbing some lead sheets from a roof of a house he accidentally leads British soldiers to a home that was hiding IRA weapons. Fortunately they never discovered anything, and the IRA members send Gerry off with a warning. His father, Giuseppe (Pete Postlethwaite), with whom he's had an estranged relationship, sends him to London hoping he can find a better future there and escape from all the political turmoil. On his way to London, Gerry runs into his school friend Paul Hill (John Lynch) and together they decide to go visit their friend Patrick Armstrong (Mark Sheppard) who has been living in London along with a group of free spirited hippies. Unfortunately for Gerry and his friends, they end up being in the wrong place at the wrong time and are accused of bombing a soldier's pub. Bullied by the police officers they are forced into signing a confession and are sentenced to prison along with some of Gerry's family members. In prison, Gerry and his father continue to fight to prove their innocence with the help of an attorney named Gareth Pierce (Emma Thompson) and the more she digs into the story the more corruption she finds in the police procedures.\n\nThe film manages to draw you in and make your blood boil due to all the injustices suffered by these characters. It is one of those movies where the tension builds up with the passing of time, but at the same time you also feel a connection growing between Gerry and his father. The film becomes more than a simple social injustice tale and turns into a character driven story focusing on the relationship between father and son. It is a shame the film has kind of been forgotten because I thought it was really well made. It never won an Academy Award, but it did receive 7 nominations including Best Picture, losing out to Schindler's List that year. Daniel Day Lewis outshines everyone in this film, although the supporting cast was very strong, especially Pete Postlethwaite who shared great chemistry with Lewis. This was an intense film that had me at the edge of my seat thanks to the way in which Sheridan tells the story and slowly draws the viewer in. The final 20 minutes of this film are perfect and Daniel Day Lewis knocks his performance out of the ball park.",
            "review_date": "2011-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I dont need to say much, i'm a sucker for anything regarding the struggles of Northern Ireland and The Troubles. What makes this film particularly unsettling are the parallels between the Guildford Four and the West Memphis Three. Also, if you love a good over-the-top but still powerful performance, Daniel Day delivers the goods here.",
            "review_date": "2011-12-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watching the transformation of Daniel Day's character from the beginning to end is brilliant. And everyone else in the cast does a good job, especially Pete Postlethwaite who is fantastic. This is just a great movie that is taken to another level with brilliant acting once again by Daniel Day.",
            "review_date": "2011-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A little slow in parts, but a fascinating movie.",
            "review_date": "2011-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "it was rather a good film, it was actually better than what I thought it would be, Paul O Grady starred in it, it also starred Pete Postlethwaite, Emma Thompson, Daniel Day-Lewis and Corin Redgrave",
            "review_date": "2011-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really fantastic movie!",
            "review_date": "2011-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best film on the Irish \"troubles\" Loved it.",
            "review_date": "2011-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An Irish biographical drama about the Guilford Four; a group of four Irish civilians wrongly convicted by the British government of an IRA bombing that killed five people in a British pub in 1974. Based on a true story told in the book \"Proved Innocent,\" Gerry Conlon (Daniel Day-Lewis) is arrested after the bombing and is forced to sign a false confession after being tortured during interrogation. His father Giuseppe (Pete Postelthwaite) is also charged as an accomplice and jailed. This is a powerful drama that resonates with great moral complexities at the ways in which an injustice can occur as the result of political pressure under the guise of security. Imprisoned together, the estranged relationship between the father and son is the center of the story. At first, Gerry is a petty thief who resents his father's overbearing nature but he gradually evolves into a crusader. There are inaccuracies that are problematic. Although the imprisonment of father and son together made the material more dramatic, in real-life they were separated. Its also a bit redundant to have another portrayal involving the British suppression of the Irish. Still, this is emotionally stirring material and the ending is effectively cathartic. Daniel Day-Lewis - speaking with a thick Irish brogue - gives a powerful performance with the dynamism of a young De Niro. Postlethwaite is quietly brilliant as he matches Day-Lewis. Written by Jim Sheridan and Terry George and directed by Sheridan. With Emma Thompson as the defense attorney who retries the case; John Lynch, Corin Redgrave, Beatie Edney, Tom Wilkinson.",
            "review_date": "2011-11-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, What a Powerful Story & a Powerful Movie.  Two Thumbs Up.  Excellent Entertainment",
            "review_date": "2011-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "finally watched this film on the recommendation of my mum. so incredibly powerful and compelling. deeply moving.",
            "review_date": "2011-11-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderfully acted and great writing. The story of the Guildford Four and Gerry Conlon was one I was vaguely familiar with before. Stories about wrongful imprisonment or the justice system aren't anything new, but this one was especially affecting given the family dynamic that is brought to the story. It is almost always engaging, only occasionally feeling a bit overlong, and the performance by Daniel Day-Lewis is brilliant as usual.",
            "review_date": "2011-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the acting is transcendent, it feels like you were actually there.",
            "review_date": "2011-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow,..enjoyed this movie,made me testy eyed,Daniel Day Lewis my my what a fine damn good actor;)!",
            "review_date": "2011-11-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So that's what U2 was going on about all those years? Huh. Guess I'll have to revisit their catalog. j/k, they're terrible.",
            "review_date": "2011-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies of all time. Absolutely phenomenal.",
            "review_date": "2011-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'm no stranger to legal dramas - both on screen and in books. But few have given me chills like \"In the Name of the Father\".\r\n\r\nThat is partially due to the \"Based on a true story\" tag it's been given. But more to the point, captivating performances from Daniel Day-Lewis and Pete Postlethwaite and stellar directing and screenplay mean your eyes are glued to the screen the whole time.\r\n\r\nBrilliant movie that more people should have seen and heard of.",
            "review_date": "2011-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'In the Name of the Father' is Jim Sheridan's masterpiece as far as I'm concerned. It kind of follows the same lessons that 'The Remains of the Day' but takes the ploy of innocence as well and blends it all together into one story. Following the true stories of IRA bombings in Ireland during the '70s, Gerry Conlon and his father Giuseppe are wrongly accused of murder and convicted in prison. While in there, they learn more about each other and grow closer together than before as an actual family. While telling their story, it focuses also on Gerry's case after his father's death in the prison and what will be the final verdict on the bombing incident. Dramatic and redeeming, 'In the Name of the Father' gives everyone hope on what can be done in life and what can be eventually fixed. With amazing performances by Daniel Day-Lewis and Pete Postelthwaite and the staying message that the truth can set you free, 'In the Name of the Father' definitely proves itself to be one of the best of '93.",
            "review_date": "2011-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Entertaining biography, liked it. DDL was great as always.",
            "review_date": "2011-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good movie about a Irishman who was sent to prison for 20+ years for a terrible bombing that he didn't commit.",
            "review_date": "2011-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Captivating experience. More due to Daniel Day - Lewis' dashing performance and an able supporting act by Pete Postlethwaite, than the very subject of the movie.",
            "review_date": "2011-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent telling of the Conlon saga, with stellar performances by almost the whole cast.  The terrorism connection makes this movie especially poignant in today's environment.",
            "review_date": "2011-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolute must see for anyone who hasn't seen it already and who is interested in the long list of British injustices. Obviously, there is some poetic license bee used but the the general drift of the story is factual, even right down to some of the seemingly minor, at first glance, details.\n\nIt has everything a good yarn should have. In fact, it's hard to believe the British Government were committing these human rights abuses and downright racist policies directed at the Irish and their descendants long before the Bush family and the oil conglomerates got together to commit even worse atrocities against Muslims. With the full backing of Blair and the Labour party, including logistical support as well as joining in with making up the fibs to go to war and helping out with torturing British Muslims. But it's true. They did and Anti-Irish Racism is still institutionalised  in North Britland. It's prevalent in the media and throughout society. One has only to google \"Asda celtic boys club Motherwell\" to see an example of it in action.\n\nThat aside, as I said it is in and of itself a great yarn with everything - Thriller/Suspense/Tearjerker/Courtroom drama - that you would expect from a well made Hollywood blockbuster. If your Irish or have Irish connections and it doesn't raise passionate emotions in you, then there is something wrong with you. If you have no Irish connections whatsoever, it should raise the same emotions in you. Just remember that this happened and was only a small snapshot of what the British Government got up to in their dirty war with Ireland and the Irish.\n\nAlso, spare a thought for those in the world that suffer inhuman treatment at the hands of US and Brit backed right wing dictatorships that puts what we had to put up with in into the shade. I speak of rogue states like Israel, Syria, Egypt before the Arab Spring, countless countries in Africa and US backed right wing traitorous Governments in South America. We at least have the rule of law, such as it is, where we can achieve some kind of Justice, whether it be in the European Courts of Human rights. We can also march to highlight past injustices to achieve some kind of closure for the families of the victims of  British brutality. It takes the British government 40 plus years to listen, a cynical ploy so that those responsible can avoid prosecution. The problem is that the orders came from Downing Street and if Army and Police commanders are prosecuted, it would come out that Ted Heath ordered the massacres in Ballymurphy and Derry. Both Massacres were carried out by the same Parachute Regiment.",
            "review_date": "2011-08-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wow, here's a true story that will get anyone pissed off with the judicial system. It's quite amazing really to think that all of these people were completely and totally innocent yet were imprisoned for years. I know all justice isn't this corrupt, but man...I may have some serious trust issues now. I highly recommend this film.",
            "review_date": "2011-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Especially after visiting \"Kilmainham Gaol\" prisons",
            "review_date": "2011-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful, gripping indictment of the British legal system under intense public pressure. Moving performances by Day-Lewis and Postlethwaite in particular.",
            "review_date": "2011-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Makes you want to find out more about police wrongdoings and miscarriages of justice. The true story of a man's 15 year struggle with wrongful imprisonment is turned in to a big screen picture with Daniel Day Lewis' perfect portrayal receiving an Academy Award nomination.",
            "review_date": "2011-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Damn good.  This is intense as it is, but the fact that it is based on a true story makes it absolutely baffling and horrifying.  Daniel-Day Lewis is at the top of his game here, so you know he's brilliant.  Pete Postlethwaite and Emma Thompson are great as well.",
            "review_date": "2011-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What i good move to cast Pete Postlethwaite and Daniel Day-Lewis as father and son in this movie.",
            "review_date": "2011-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fabulous acting performance from Daniel Day Lewis.  Interesting film about the true story of Gerry and Gisipie Conlon who where wrongly accused of a bombing in England during the 1970's.  The film is also about the relationship between father and son and how they come to have a deeper appreciation for each other while spending time in jail.\r\n\r\nThe story itself is horrific - to think that something like this is actually possible is troubling.  This is a good movie that is definetely worth rewatching.\r\n\r\nAnyways I just want to point out that this is my 300th review.  It's fun writing these little snipits about movies.  Thanks facebook.",
            "review_date": "2011-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "what was the motivation? was it simply prejudice? In the name of the Father has many good elements to it, but it does not do a very good job of getting its message across, Daniel Day Lewis gives a very over dramatic performance but he's been doing that his whole life. Postlethwaite is great as always and so is John Lynch and Emma Thompson. It seems that when movies are made about Ireland and it's people, capturing the essence of the topic is something that is very hard to master. It's certainly not overrated but it should have been much better.",
            "review_date": "2011-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "And one of your colleagues, My Lord, who sat where you're sitting now, said and I quote, 'It was a pity that you were not charged with treason to the crown. A charge that carries a penalty of death by hanging. A sentence I would have had no trouble in passing in this case.'",
            "review_date": "2011-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I just recently saw this film for the first time, and absolutely loved it. The cast was phenomenal, especially Daniel Day-Lewis and Pete Postlethwaite, whose performances were both very powerful and true. The chemistry between the two is what made the film so successful. The story is hearbreaking and true, yet at the end I was left with somewhat of a feeling of satisfaction. Everyone should see it.",
            "review_date": "2011-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Day-Lewis lead with a powerful performance, as well as much of the movies cast. This film is compelling, striking, and show that truth about the injustice in a justice system.",
            "review_date": "2011-06-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A gripping piece of history put to celluloid masterfully by director Jim Sheridan and actors Daniel Day Lewis and Pete Postlethwaite. Though the final act seems a little rushed, the journey that takes us there is emotionally rich and unquestionably fascinating. Sheridan's handling of the father-son relationship is a highlight, while his ability to avoid cliche, and deliver tension to the courtroom scenes should also be commended. However the real winners here are the performances, most notably from Pete Postlethwaite who gives what is arguably a career-best turn, and of course Daniel Day Lewis who immerses himself so fully into the character in that way in which only he can; he is truly one of the all time great actors.",
            "review_date": "2011-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good movie...very horrible what happened. Loved the soundtrack",
            "review_date": "2011-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Must see for those who believe - justice is possible.",
            "review_date": "2011-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What is there to say about Daniel Day-Lewis? He is a fantastic actor. Watching him play this falsely convicted man is enthralling. This is a story worth telling on film, and it is told extremely well.",
            "review_date": "2011-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This Movie is one of the Reasons I think of Daniel Day-Lewis as one of the Finest Actors of all time.This Movie is about the IRA in Ireland & the Politics & injustice of the 70's in England & Ireland,They Don't just cart off this Innocent Man to Prison, but his Innocent Father too for his Sons Crime he didn't even commit.I saw this Movie years ago, but often talk about it, it's that good.",
            "review_date": "2011-05-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Impressive biography film made in Ireland. Daniel Day Lewis has an impressive performance in this riveting drama that mirrors a real-life Irish thief Gerry Conlon's 15 years struggle and ultimate triumph over a terrible injustice. And also goes for Pete Postlethwaite as Gerry's father. Emma Thompson's portrayal of attorney Gareth Pierce receives much acclaim, and properly so.\nThe story is heart-breaking and shocking at the same time, all the more so when one realizes that these things actually DID happen. \nJim Sheridan's direction is also very good, giving the plot a fair and balanced perspective; although the film might initially appear as pro-Irish / anti-English, in fact I consider it as quite objective.",
            "review_date": "2011-05-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great and very dense movie.With accurate epoque/historical  reconstruction and epical performances.Daniel Day-Lewis is a fenomenal actor and Emma Thompson is brilliant.The final scene in the court-room is exciting and touching.I give this movie five stars and catalogue in my collection as a modern classic.The plot is  based on the true life story of the Guildford Four, four people falsely convicted of the IRA's Guildford pub bombings which killed four off-duty British soldiers and a civilian. The screenplay was adapted by Terry George and Jim Sheridan from the autobiography Proved Innocent: The Story of Gerry Conlon of the Guildford Four by Gerry Conlon.",
            "review_date": "2011-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great film sad to think it happened",
            "review_date": "2011-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That's it, Daniel Day-Lewis is just the best actor ever. I haven't seen him in a movie where he isn't fantastic, and this is one of his premier performances. The movie also has an absolutely great soundtrack.",
            "review_date": "2011-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"Falsely accused. Wrongly imprisoned. He fought for justice to clear his father's name\". One of the best movies of all time!!!",
            "review_date": "2011-05-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unusually well-made for a Jim Sheridan movie. For once I didn't feel like I had to put up with his clunky direction and script while I was enjoying the amazing acting. Hugely compelling, energetic, fascinating and sympathetic. Though it has its problems (the bad guys are never real, just sneering villains, the final court scene is very Hollywood, and some sequences are very clumsily chopped down for time) they didn't really bother me too much in the end.",
            "review_date": "2011-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Working my way through my Daniel Day-Lewis filmography. This was brilliant. Pretty amazing for 1993",
            "review_date": "2011-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "'I'm an innocent man. I spent 15 years in prison for something I didn't do. I watched my father die in a British prison for something he didn't do. And this government still says he's guilty. I want to tell them that until my father is proved innocent, until all the people involved in this case are proved innocent, until the guilty ones are brought to justice, I will fight on. In the name of my father and of the truth!'\n\njust couldn't stop my tears! :(",
            "review_date": "2011-04-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outstanding movie!!! Loved  it...Daniel Day Lewis was extra ordinary...The time when he thanked the prist for bringing the news of his father's death was simply spactacular...Its a must see movie...",
            "review_date": "2011-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thrilling, especially those first 10 minutes. Daniel Day Lewis gives a Daniel Day Lewis performance aka a spectacular performance. The direction was nice too",
            "review_date": "2011-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A captivating and harrowing picture, Daniel Day-Lewis and Pete Postlethwaite give powerhouse performances.  DDL has the showier role, and he's terrific, but Postlethwaite is much more subdued; he conveys a warm dignity that is the heart of the film.",
            "review_date": "2011-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent film that is still very relevant to this day with all of the craziness going on in the world.",
            "review_date": "2011-04-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Day-Lewis is on fire; Bono's soundtrack is energising.  Manages to shake off the moralising and reach to the heart. Oh, and up the RA.",
            "review_date": "2011-03-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a marvelous film based on true-event, which changed the course of four people and other many more, being falsely accused of crimes they never committed. Wonderful performance from Daniel Day Lewis and Peter Postlethwaite, great art-direction and cinematography.",
            "review_date": "2011-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A simply brilliant adaptation of Gerry Conlon's book.  Stunning.  DDL and Pete Postlethwaite are superb.  If this movie doesn't touch you, you're dead.",
            "review_date": "2011-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Powerful and emotional true story, brilliantly acted by Day-Lewis, Postlethwaite and Thompson.",
            "review_date": "2011-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quite predictable in many parts but an amazing film nonetheless!",
            "review_date": "2011-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films ever. MUST SEE!",
            "review_date": "2011-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Whoever doubted the fact that Daniel Day Lewis is the best actor of this generation, must watch this movie..Absolutely Incredible performance by the Master Method Actor!!",
            "review_date": "2011-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Monday, February 7, 2011\r\n\r\n(1993) In The Name of the Father\r\nDRAMA\r\n\r\n  Based on a true incident whereas in 1974, an unfortunate London bombing happened at a pub permited by Thatcher to arrest and detain people at random for 7 days (which is all the police needed to break someone down to get them to sign an untrue confession), suspected in connection in terrorists act!   A movie that is longer than 2 hours, watching this film is more like seeing two seperate films- where the main characters are interating with each other while in the city, up until the second story is how the Danial Day Lewis character react through his experiences during his times in prison!  Although, the cast is top notch which includes 2 time Oscar winner Danial Day-Lewis, Oscar winner Emma Thompson and the remarkable actor of the late Pete Postlethwaite, the film could've used some editing!  Also, because viewers should be able to figure out about the satisfying conclusion of this true story, it'd be nice to see that those people who were wrongly convicted be compensated financially like they do in America!\r\n\r\n3 out of 4",
            "review_date": "2011-02-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "2 towering performances in this one from Pothlethwaite and Day-Lewis carry the picture. Reading about it afterwards, some pretty serious artistic license taken with this one, which made it lose a bit of it's punch. Still, extremely well made and acted.",
            "review_date": "2011-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly affecting experience. Jim Sheridan (Ireland's greatest living director) takes a true story about heart-breaking injustice and weaves it into a massively powerful film that credibly embodies the pulsating passions of those who were involved. Centred around the troubles in Northern Ireland and the subsequent bombings by the IRA in London in the late 70s, the film in part portrays the terrible destructiveness that existed in the North and at the British Police HQ at the time but it also, and more importantly, explores the deeply sated impact it all had on one innocent family (in particular, a father and son) caught at the core. Pete Posthelwaithe RIP.",
            "review_date": "2011-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One hell of a great movie, Daniel Day-Lewis is his amazing self with a smashing performance... \n\nthe movie could be an acquired taste of sorts, but it's definitely a must see",
            "review_date": "2011-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a good film, though perhaps a bit rushed in the latter stages of the story.  Daniel Day-Lewis may indeed be the greatest living actor.",
            "review_date": "2011-01-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shocking true story about 70's corruption in our police force!",
            "review_date": "2011-01-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With all the artistic licenses used to make this film aside, this is a compelling story of a man named Gerry Conlon (Daniel Day-Lewis) forcefully beaten to sign a confession to an IRA bombing he had nothing to do with. His father, Giuseppe (Pete Postlethwaite), along with many others, is also thrown into prison because of these fallacies. His father is thrown into the same prison cell as him until he passes away. Meanwhile for years Gerry's lawyer (Emma Thompson) helps him out trying to build enough evidence to appeal and with a breakthrough in files that were suppressed from the defense during the trials, Gerry and the others imprisoned are finally let free.\n\nThere has been much talk about how many different things were made-up to create the film but even so, the film is one powerful experience. Jim Sheridan's direction in this film is some of the best work he's done and the performances are terrific throughout. As much as the story behind the IRA vs the Brits goes, all that is really set aside for what is the real focus of the film: the relationship between Gerry Conlon and his father Giuseppe. Sure they may not have actually shared a cell together, but the chemistry between Daniel Day-Lewis and Pete Postlethwaite are what make the film great. Pete Postlethwaite gives the performance of his career that earned him a much-deserved Oscar nomination as Gerry's loving father in a performance that reeks of great subtlety. Daniel Day-Lewis counterbalances Postlethwaite with a incredibly dynamic performance, one of his best performances in what has been a career of great performances. It's a real shame that Day-Lewis lost out to Tom Hanks performance in Philadelphia as his was just so much better than Hanks'. But it hardly matters because the film speaks for itself. Emma Thompson performance as their lawyer is also noteworthy.\n\nThis one of the best, and in a way most underrated movies of the '90s with exceptional acting and a compelling story. Highly recommended viewing. 9/10",
            "review_date": "2011-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "excellent film great actors at their best, and further proof of the corruption of the legal system (anybody's legal system)! Loved it",
            "review_date": "2011-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is in my opinion one of the best films of all time, and the best daniel daylewis performance by far, great story!!",
            "review_date": "2011-01-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "despite prolonged duration, this movie capture powerful emotion within its' characters. Sense of helplessness being cornered by the system involving character growth and changes.  it's deserve 5 5 out of 5 stars.",
            "review_date": "2011-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the best movies of the 90s",
            "review_date": "2011-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simpky anawsome movie... A must see",
            "review_date": "2011-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "True story about the troubles, brilliantly acted.",
            "review_date": "2011-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In 1974 a bomb left by the IRA in a pub in Guildford killed 5 people, eleven people were sent to prison for their part in these murders.  They weren't, however, connected with the crime in any way, and this film tells the story of their fight for freedom, from before the bombing to their eventual release.  The film seemed very fair in its portrayal of the events; I expected a strong anti-British bias but didn't see it here. I liked the way that most of the people who formed a part of the story were shown as neither completely good nor completely bad, and the depiction of the effect of the fear of terrorism on ordinary people, governments and those who should be protecting the public.",
            "review_date": "2011-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Day-Lewis's more naturalistic performances, this is a reminder that he doesn't have to play a butcher or an oil man to be captivating. A strong performance from Emma Thompson also compliments the film, and to those who are close to the subject matter, it may very well be moving and passionate. To me, however, it's a dated film, directed with manufactured and synthetic emotion by Jim Sheridan.",
            "review_date": "2010-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A meaningful movie in which Daniel Day Lewis delivers an amazing performance. Although this movie is widely unknown, it is fantastic!",
            "review_date": "2010-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another exceptional performance by Daniel Day-lewis",
            "review_date": "2010-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I realize that I'm seventeen years late in seeing this movie, but at least I finally saw it, and it is extraordinary, compelling, and extremely moving.  Additionally, Daniel Day-Lewis, brilliant thespian that he is, is completely possessed by the spirit of Gerry Conlon; he is Gerry Conlon when he is on screen.  It's an amazing performance.\n\nAnd this movie will definitely arouse your passions:  at one point, I was screaming obscenities and flipping the bird at the British detectives who intentionally fabricated their case to frame eleven innocent Irish men and women for the bombing of a London pub.",
            "review_date": "2010-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Day-Lewis is the man.",
            "review_date": "2010-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Shocking drama based on real events and a wonderful interpretation of Daniel Day-Lewis.",
            "review_date": "2010-12-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the Name of the Father\r\n\r\nDirector: Jim Sheridan\r\nWriters: Gerry Conlon and Terry George\r\nMains: Daniel Day-Lewis, Pete Postlethwaite and Alison Crosbie\r\n\r\n\"I'm an innocent man. I spent 15 years in prison for something I didn't do\".\r\n\r\nPlot: Gerry Conlon (Daniel Day-Lewis) is a young man that lives a life with no rules. Him and his family are living through a time of war between the Irish and the British government. G. Conlon is mistaken for a the leader of a terrorist group that bombed a local shop killing 5 people. The government has forced him to confess, leading up to the arrest of his entire family. Now behind bars he can face his father Giuseppe Conlon (Pete Postlethwaite) that isnt proud of what he has become as a person, in addition they are trying to prove their innocents knowing that they have been wrongfully and illegally accused. Emotions run deep character driven movie!\r\n\r\nMy Take: Wow, this makes Shawshank Redemption look like crap (i still like it though). This movie is perfect in every way. It starts off by showing you the life of Gerry Conlon and the lives of his family, so the character development is beyond top notch. The acting....... OMG is all im going to say. I loved every minute of this movie from beginning to end. What i especially liked was the discussions Gerry and Giuseppe had in their cells. Every emotion that has build up as a child has come out during this time of depression and stress and it gets extremely intense. Pete Postlethwaite has proven time after time that he is a very solid supporting actor and he doest fall short AT ALL in this film. On the other hand Daniel Day-Lewis's performance was freaking OUTSTANDING. Every time he spoke it felt authentic and every emotional scene i felt 100% where he was coming from, it was as if i was living his life through his own eyes. This guy is talented for sure and delivers and unforgettable performance. I also loved the deep themes of regret and forgiveness. I dont wanna give the movie away because its truly a gem.\r\n\r\nConclusion: This movie has instantly made it to my top 25 (i just gotta figure out which movie to boot ). It packs a very talented cast (overly talented) and well written story. Fans of the Shawshank Redemption will easily enjoy this little gem and see what a Great movie truly is. Everything from the opening scene, to the jailhouse scenes to the ending are full of emotions and well performed. I will never forget the effect this movie had on me and i will always hold it in a very special place (somewhere in my top 25 lol). Great movie in every way.\r\n\r\nHIGHLY RECOMMENDED\r\n\r\n5/5",
            "review_date": "2010-11-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Day-Lewis' performance makes this film worth-while.",
            "review_date": "2010-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie's pretty damn good! I highly recommend it. I didn't think I'd enjoy this film (not a Daniel Day Lewis fan at all) but it was great! Injustices galore! Only wish there was more Emma Thompson...I'm pleased w/ it.",
            "review_date": "2010-11-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In The Name Of The Father is an incredible film based on true events of the Guildford pub bombings, Not gonna go into great detail as anybody who has seen this knows what happened and how the innocent prisoners were treated. Going to check out Gerry Conlons book on the events which is seemnly more moving and disturbing than the film which is based on the book but misses alot of information I have heard.\n\nDaniel Day Lewis is outstanding once again, In my eyes the greatest actor on the planet right now - See There Will Be Blood.",
            "review_date": "2010-11-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "what a great film,start to finish,sad when dad dies,brilliant,police scum",
            "review_date": "2010-10-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie. The protagosnist incorporated his character amazingly.",
            "review_date": "2010-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "awesome movie. one of daniel's more calm rolls. pete postlethwaite did a great performance himself. he was the father guiseppe.",
            "review_date": "2010-09-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based on a true story, it is inspiring and educational to experience this film. It gifts hope and energy to those who have lost it.",
            "review_date": "2010-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "best movie of all time",
            "review_date": "2010-09-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting story of a man railroaded by a corrupt justice system, but what struck me was the realistic violence caught in this Jim Sheridan film. Daniel Day-Lewis gives a great performance, of course, but is a bit outshined by Pete Postlethwaite's supporting performance.",
            "review_date": "2010-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Day Lewis Classic brilliantly made and very moving",
            "review_date": "2010-09-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite films of all time. It contains some of the most superb pieces of acting I've ever seen, especially of course the magnificent Daniel Day-Lewis. It's a deep, touching and really moving story, with an awesome soundtrack, perfect direction and it's a masterpiece in every possible department of filmmaking.",
            "review_date": "2010-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Quality film.  An entire Irish family are arrested and wrongly convicted of a IRA pub bombing.",
            "review_date": "2010-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "i love irish movies in general, may be because of the accent, and this movie tops the list....tone is set by the very first song and does not slack till the end......goes to my fav list",
            "review_date": "2010-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There aren't a lot of films dealing with \"The Troubles\" in Ireland, but along with 2008's \"Hunger\", \"In the Name of the Father\" is one of the best.  Director Jim Sheridan tells the true story of Gerry Conlon (Daniel Day-Lewis), a scrap metal thief who ventures to London in the mid-Seventies to escape the constant danger and despair in his native Belfast.  Not long after, when  an IRA bomb rips through a pub in Guildford killing five people, Conlon and three of his associates are snatched up by the British secret service.  Granted sweeping powers of arrest and detainment under the hastily cobbled-together \"Prevention of Terrorism Acts\", the authorities beat and coerce Conlon and his mates for seven straight days to get confessions out of them.  As if that wasn't bad enough, when Gerry's father \"Giuseppe\" Conlon (Pete Postlethwaite) visits his sister-in-law Anne Maguire in London to assist his son, the entire family is swept up by police as accomplices.  All told, eleven innocent people were eventually sent to prison for crimes they didn't commit, including Anne's son Patrick, aged 14 at the time!  The balance of the film details the trials and tribulation of Gerry and his father as they attempt to survive incarceration in a British prison and the subsequent campaign led by an English solicitor named Gareth Peirce (Emma Thomson) to see them released.  As she begins to peel back the layers of corruption we see a perfect example of why it's critical that the due process of the law cannot be compromised, even during times of terrorist threat, whether real or fear-mongered.  In the rush to see results and quell needless panic, witnesses for the defense were deep-sixed, evidence was concealed and latent confessions were ignored.  The film is a masterstroke.  Sheridan takes the time to ease the audience into the story and generate considerable pathos for his subjects.  As a corollary, they aren't depicted as saints either, but this lends more weight to their humanity.  In Sheridan's capable hands we're given all the pertinent introductions, complications, impossibilities and revelations in an economic and moving fashion.  As strife in Ireland was beginning to calm down in the early Nineties, it afforded the film-makers an opportunity to explore the Emerald Isle as a unique shooting location.  Belfast was still a bit too politically charged to host such a project but Dublin stands in nicely, with its Docklands, Sheriff Street and Kilmainham Jail offering a look of authenticity.  The actors do a stellar job.  Human chameleon Daniel-Day Lewis is stellar and once again he pays as much attention to the physical aspect of the role as he does the emoting.  Celebrated character actor Pete Postlewaite is absolutely superb as Jerry \"Giuseppe\" Conlon.  His physical deterioration in prison mirrors that of his son's mental state and it's heart-rending to consider just how wasteful it all was.  A pre-\"Nanny McPhee\" Emma Thomson proves how much of a treasure she is.  As Gareth Peirce she is single-minded, earnest and strident.  The scene in which she gains access to secret documents in Jerry's protected files due to a clerk oversight threatens to intoxicate the audience with righteous vindication.  Back when this film was released it was merely one fascinating story emerging from a dark period in the United Kingdom.  Now it's a warning cry to safeguard human rights when authorities use the intangible but ever-renewing specter of terrorism to chip away at human rights.  It's a call for us to be vigilant since, in some way, our liberties have been curtailed more dramatically in recent years and with less justification.  This is a very relevant, compelling and heartbreaking story.  Tilt: up.",
            "review_date": "2010-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good flick.  Far superior to \"The Boxer.\"",
            "review_date": "2010-08-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film about how when emotions get involved things become tricky even in cases of justice. About how Irishman were wrongfully accused as all were suspected to be IRA. \nHighly recommendable.",
            "review_date": "2010-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a young petty criminal is wrongly accused of the bombing of a pub and spends 15 years in jail where he learns about right and wrong and justice. day-lewis gives his usual great performance and the rest of the cast is good too.\n\ninteresting that this was made in 1993 about ira bombings in the 1970s in england and the abuse of government/police power that followed the bombings... seems similar to what's been happening more recently in places like guantanamo bay and iraq...",
            "review_date": "2010-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful and emotional true story, brilliantly acted by Day-Lewis, Postlethwaite and Thompson.",
            "review_date": "2010-08-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It is a powerful and compelling story that has to be told.  The performances of all the actors involved were stellar and Day-Lewis was spectacular and heart-rending.",
            "review_date": "2010-08-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A powerful, searing true life drama which is brilliatly directed by Jim Sheridan, concerning  Gerry Canlon, played intensely by Daniel Day-Lewis in a  powerhouse Oscar nominated performance who is a petty theif in the strife-torn Belfast of the '70s, Gerry who is innocent is wrongly convicted of taking part in IRA bombing that killed five people in Guildford England in 1974, after a brutal interrogation by the British police, he is forced to confess and sign a false statement to the the deadly terrorist bombing, he is sentenced to life and the later his father Giuseppe, played superbly by the late great character actor Pete Postlethwaite in a compelling Oscar nominated performance is charge with being an accomplice and also sent to prison. Gerry and Guiseppe bond in prison as he sees his father's health declining, he learns of his father's inner strength and wisdom. Emma Thompson delivers a riveting Oscar nominated turn as the fiercely dedicated lawyer who is determine to prove his innocence and clear his good father's name. A totally enthralling motion picture.    Highly Recommended,",
            "review_date": "2010-08-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another epic performance By Daniel Day-Lewis that makes a normally good movie amazing",
            "review_date": "2010-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An explosive and powerful film, it makes you take notice, rooted to the edge of your chair as you watch the senseless prejudice and heartless feeling of the British judiciary system while they imprison four innocent people. Based on the true story of Gerry Conlon and the Guildford Four, director Jim Sheridan winds through the real life events that landed a bunch of hippies in jail for murdering fifteen people at the height of the IRA's power in Ireland. This is a very strong and powerful film, because the cover-up was so huge and the misuse of power is so obvious. Not just the people prosecuted, but their family and friends, were put into prison, and that's what makes this such a nauseous film to watch. Much of what makes this heartbreaking are the great performances from the cast assembled. Daniel Day-Lewis is himself an enigma among actors, and he proves his method acting is tried and true in this role, coming off as a disenchanted young man with sincerity, but also a dogged and tired middle aged man at the offset of his sentence. Pete Postlethwaite as his father, wanting his freedom and yet remaining revered in the face of his sentencing, makes you tear up every time he holds out hope for the future. The supporting cast is also quite sincere with their performances, and the four imprisoned showed the deepest pain and regret as they are carted off to prison. The only performance that seemed off was Emma Thompson, who plays Conlon's lawyer. Though she remains restrained throughout most of the film, she ends up seeming earnestly aghast as an outsider, when she should be more composed and triumphant at the end of the film. Though some minor facts were changed, most of what remains true and gut wrenching is in this film, and it makes you sad to think it's not false.",
            "review_date": "2010-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched this movie in English class for film study, I absolutely loved it! Most likely going to buy the movie.",
            "review_date": "2010-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good acting between father and son, particularly in jail.  Sad real life story, and the family were very luck to have Emma Thompson on their side or could easily have been swept under carpet.  Felt very long/slow in parts.",
            "review_date": "2010-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie, very well-acted, and an important story.  Along the way it depicts brilliantly how a person's nationalism/patriotism deepens the more mistreated a person feels by the country they are living in, and the more likely this is to lead a person to committing acts of terrorism.",
            "review_date": "2010-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Jim Sheridan's films are a hit or miss. This one is a definite hit.",
            "review_date": "2010-07-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing movie!!!  Loved it!! DDL was SPECTACULAR!!!",
            "review_date": "2010-07-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic Movie. I recommend to everyone.",
            "review_date": "2010-07-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent drama about a father & son wrongfully incriminated of being IRA bombers. Fascinating, tense and politically relevant. Great performances from Daniel Day-Lewis and Pete Postlethwaite.",
            "review_date": "2010-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent drama about a father & son wrongfully incriminated of being IRA bombers.  Fascinating, tense and politically relevant. Great performances from Daniel Day-Lewis and Pete Postlethwaite.",
            "review_date": "2010-06-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First time i've actually sat down and watched all of it and it blew me away!  a realistic picture is painted without over-dramatising everything and it is so moving.  It shows the judicial system as an old boy's club that is twisted as a means to an end.  Has it changed?!\r\n\r\nWhen you look at the powers that the government introduced under the threat of 'terrorism' then, it shows that they're not new to introducing laws that infringe human rights!",
            "review_date": "2010-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very good film with strong performances. Recommended when learning about the Irish Conflict.",
            "review_date": "2010-06-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "That's such a stunning movie. Awesome!!!!! It is so engaging with climax after climax. With not a lot of twist, but you can feel exactly the same as Gerry did. What a case which entail the importance of behaving, faith and family love.",
            "review_date": "2010-06-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"In The Name of the Father\" is a powerful movie about prejudice, terrorism and corruption. Pete Postlethwait's performance as the pragmatic father was one of the best performances of the year. A fantastic movie all the way  around. Highly recommended.",
            "review_date": "2010-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(1993 Direcor: Jim Sheridan) Takes courage to make a film about the fallout from violence, especially when it is based on a true story of false blame being intentionally inflicted on innocents. intense film with amazing performances by Pete Postlethwaite as Guiseppe Conlon & Daniel Day-Lewis (Gerald Conlon) portraying father & son.  Denys Hawthorne aptly plays the Judge who finally hears the matter brought against the State by the indomitable defense attorney Gareth Peirce (Emma Thompson). MUST SEE  Name the movie where a group of 3 men and a woman were wrongly imprisoned for the 1974 IRA bombing of a pub in Guildford.",
            "review_date": "2010-06-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Interesting storytelling in this film. At first I'm wondering why we're watching a drug using, petty thief and his adventures in London and then it's revealed that due to another jealous acquaintance Gerry Conlon is suspected of bombing a pub. It seems so ridiculous yet this film is very powerful in a post 9/11 world. The English government and it's people were so hellbent on convicting someone of these terrorist attacks, reason and logic went out the window. The film is at it's best when we see what happens to Gerry Conlon and his father in prison. Two men, both with different views of the world, now have to face the fact that they may be stuck in prison for life for a crime they didn't commit. Infuriating at times, this is a very good film that you should check out.",
            "review_date": "2010-06-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An emotional triumph. A searing, gripping fact-based story concerning a man wrongly accused of an IRA bombing, and how the police brutally exploit a new law in their favor, getting this innocent individual to confess to a crime he didn't commit, as well as associating his family in the whole mess. One of the best stories about corruption and human emotion I've ever seen. It never hurts when you have two of the best actors out there, that being the great Daniel Day-Lewis and the criminally underrated Pete Postlethewaite, playing the lead roles. It's a lengthy movie, but it's worth it, especially with it's tear-jerking, incredibly captured finale which is irrefutably stirring.",
            "review_date": "2010-05-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sentimentally sublime!\nThe whole story really was utterly tolerable and touching..\nWatching this movie reminds me to the recent 9/11 tragedy where the US government held hostage dozens of \"terrorist\" who I believe had got nothing to do with any of the plots.. People really can be swayed from the truth thru media propaganda, but what really make me sick is their response after they know they had mistakenly accused the innocents.. The road to outspread the truth is very hard and painful; sometimes it takes others lives to proof it.. Elite people will do everything in their power to stop the truth being known world wide; but I assure that even the innocents didn't have the opportunity to receive proper judgment in this life, they will have it at the afterlife.. Cuz this life is only a mere journey=",
            "review_date": "2010-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I watched it on TV the other night, only managed to catch 2/3 of the film. Still, I think it's a great film, great performance. Powerful, and sad because no one ever get to take responsibility for the wrongly accused and the victims of the bombing.",
            "review_date": "2010-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Super film. Just brilliant. Direction, performances - everything is amazing.",
            "review_date": "2010-05-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing !! So much emotions you fell through the movie.. Daniel Day Lewis and Pete Postlethwaite are briliant...",
            "review_date": "2010-05-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Day-Lewis is terrific. However, I'm disappointed this movie is not entirely true. Agree with Roger Ebert. Too much dialogue, too many scenes in the prison.",
            "review_date": "2010-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Day Lewis has never missed the bus...the injustice of the screwed up court...a ruined life....a complete devastation of a family..a dead father..! the way the movie showcased gerry grow up..mature..and the relationship with his 'Da', how ironic was it that their relationship needed the confinements of a barred cell to foster and open up !..overall a great movie...which makes you look back at an example of the atrocities put down by various judicial systems around !",
            "review_date": "2010-05-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "daniel day lewis was way better than tom hanks in philadelphia, should have won the oscar, but was absolutely snubbed",
            "review_date": "2010-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Simply powerful. With an incredible cast and direction, this true story hits solidly. The film follows Gerry Conlon who is wrongly imprisoned, along with friends and family, for politically-driven bombings in 1970s London. As the title implies, there is also a deep father-son relationship that unfolds and drives emotions. I am still disgusted by the injustice depicted in this film.",
            "review_date": "2010-04-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazing movie... Quite choked up during it!",
            "review_date": "2010-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "As close to perfect as a movie gets! This is one of the most moving and thought provoking movies I have seen. The quality of the acting is sublime and it is directed perfectly by Jim Sheridan. This movie puts you through the gamut of emotions, and I found myself at times chocked with tears, and then furiously yelling at the screen for the injustices these people faced. This movie is worthy, (I mean that in the best sense of the word) and fitting tribute to those 12 people and their families.",
            "review_date": "2010-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Realistically the best Brittish movie ive ever seen, its brings a scent of emotion yet willingless of a man out to prove the justice system to a disgraced error which is surrounded by controversial to this day still after so many years, People around world might not have a clear example of how a lawfull justice system can commit a fault in the case of the guilford four wrong doing, but watching this its clear its actually historically true. its packed with brilliance throughout and The great Daniel Day Lewis plays his role perfect. this drama based movie deserves its acclaim. A serious must watch for all viewers.",
            "review_date": "2010-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A true story about the Conlon's,a father and son wrongly accused and convicted for an IRA terrorist bombing, in England during the 70's. It really shows how far the british police and court system was willing to go in their war on terror.stooping to torture to get their false confessions.\r\n\r\nThe father Guiseppe(Pete Postletwhaite)and the son Gerry(Daniel Day-Lewis), whose previous relationship has been quite rocky,is now put to the ultimate test,as they have to live together in a small room,with Gerry's anger threatening to tear it all apart. With all hope gone, Gerry quicly turn to drugs and rioting,while the father continues to write letters to their new attorney (Emma Thompson),trying to get a new trial for them to prove their innocence. As Guiseppes health worsens,and Gerry must take responsibility for his care,they slowly but steadily reconcile their differences.Gerry now  takes up his fathers battle and fights for justice for them both.\r\n\r\nThe interplay between Day-Lewis and Postlethwaite is some of the best acting I've ever seen. I think they both deserved an Oscar for their performance. This movie is a must-see!!",
            "review_date": "2010-04-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "very good IRA film true story bout a person getting framed for a bombing he did not do very sad as the police new he was innocent daniel day lewis was the bollocks in this",
            "review_date": "2010-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In a word: powerful. Daniel Day and Pete Postlethwaite are bloody amazing together in this film.",
            "review_date": "2010-04-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"In the name of my father and of the truth!\"",
            "review_date": "2010-03-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great (sad) story that can't be retold enough times. Excellent acting and fabulous art direction recapture the 70s impressively well...then again this was made in 1993.",
            "review_date": "2010-03-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After watching this movie, I fell in love with Daniel Day-Lewis and especially with his unbelievable talent. He's my icon, my role model, and after watching this movie, when I was only 13 years old, I knew that I wanted to become an actress as well (and now I'm in theatre school). \r\n\r\nThe performances of the cast are fascinating, and made this sad story even more heartbreaking.",
            "review_date": "2010-03-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "amazing! i love Daniel Day Lewis and i've actually been to the jail they filmed in.",
            "review_date": "2010-03-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great story - Great movie - Great acting!!  A must-see!",
            "review_date": "2010-03-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best films ever. Superb.",
            "review_date": "2010-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In The Name Of The Father is an incredible film based on true events of the Guildford pub bombings, Not gonna go into great detail as anybody who has seen this knows what happened and how the innocent prisoners were treated. Going to check out Gerry Conlons book on the events which is seemnly more moving and disturbing than the film which is based on the book but misses alot of information I have heard.\n\nDaniel Day Lewis is outstanding once again, In my eyes the greatest actor on the planet right now (See There Will Be Blood).",
            "review_date": "2010-03-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not only is this a remarkable, incredible, horrifying story of a man who becomes victim of the British' witch-hunt. It is so well told, so realistic, that the viewer gets involved in the Northern Ireland conflict. The acting is superior, the directing is great - a truly astonishing movie. Also this  film is great to watch for its period detail and for the predictably excellent performance of Daniel Day-Lewis",
            "review_date": "2010-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very interesting film , with a terrific performance by DDL .",
            "review_date": "2010-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I think this movie should've won the Oscar.",
            "review_date": "2010-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Masterfully directed and equally played; this is the kind of movie that takes hold of the viewer from the very first frame, and doesn't let go even when the end credits is rolling. DDL makes an astounding performance in this gripping tale of injustice.",
            "review_date": "2010-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of the most catching movies ever!",
            "review_date": "2010-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I enjoyed it at the time but I have a feeling that I will not be as much in love with it on second viewing. Daniel Day Lewis has evolved so much as a performer that this will likely seem a still evolving work.",
            "review_date": "2010-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible story and incredible acting.",
            "review_date": "2010-02-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very masterful title by Jim Sheridan, Daniel Day-Lewis's performance is improved by his character father's performance.  I think it is a great duet, both actors make a complement for each other and do an awesome job together.  Might be Sheridan's masterpiece.",
            "review_date": "2010-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not sure there ever was a more powerful movie than this one. Of course, given the underlying REAL story, how could it be a bad movie ? It probably was destined to be great, but author Jim Sheridan made it much more than that.\n\nThanks for the good work. Also special mention to Jerry Day Lewis, who shall be remembered forever, be it only for his perf in this movie.",
            "review_date": "2010-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Behind all the political irish stuff, is a very moving father-son relationship, played well by both Daniel Day-lewis and Pete Postlewaite. Jim Sheridan's best work along side 'The Field', unless you're a 50 cent fan.",
            "review_date": "2010-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In \"In the Name of the Father\", Daniel Day-Lewis proves that he is one of the best actors of his generation. The movie itself may have some minor historical inaccuracies, but nevertheless delivers the message in a staggering way. A must-see modern classic.",
            "review_date": "2010-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film leaves you with the question most important: these men were in the end acquitted, but couldn't there be more like them? Perhaps many more, withering away in the hands of the government? Is the prison system itself not a crime against humanity?\n\nLong live free Ireland -- smash imperialism!",
            "review_date": "2010-01-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Synopsis: Man's coerced confession to an IRA bombing he didn't do imprisons his father as well; a British lawyer helps fight for their freedom.\r\nStarring: Daniel Day-Lewis, Pete Postlethwaite, Emma Thompson \r\nDirected by: Jim Sheridan \r\n\r\nnot sure about this movie, will rate as flixster has though!!!",
            "review_date": "2010-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A solid drama - well acted, directed. A beautifully told tale of father and son.",
            "review_date": "2009-12-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I couldn't stomach the thought of this happening to my family.",
            "review_date": "2009-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great courtroom drama with solid acting and a great soundtrack. This has one of the best endings I can remember.",
            "review_date": "2009-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Bad acting, great movie.",
            "review_date": "2009-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Day-Lewis stars in this real life story of the 'Guilford Four', who were imprisoned for an IRA bombing they didn't commit. As Gerry Conlon, Day-Lewis gives a typically gutsy performance as we observe his transformation from idle youth to embittered justice-seeker. The other actors are also impressive, in particular Pete Postlethwaite as Gerry's father. This is a hard-hitting and sometimes brutal film, yet one which also carries an uplifting message of hope.",
            "review_date": "2009-12-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Day-Lewis is amazing in this movie. Possibly his greatest preformance ever. great movie.",
            "review_date": "2009-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie really impact!!",
            "review_date": "2009-12-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A searing portrait of injustice and a fight for redemption. The darker side of the Irish fight for independence.  Soundtrack by U2 and Bono is riveting.",
            "review_date": "2009-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Brilliant, one of the best Irish films of all time. (\"I wrote your name on the ground, and I pissed on it.\")",
            "review_date": "2009-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Heart wrenching true story about the Guildford four...powerful performances with some superb direction...watch it",
            "review_date": "2009-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Falsely accused. Wrongly imprisoned. He fought for justice to clear his father's name. more",
            "review_date": "2009-11-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Yet another stellar performance by Daniel Day Lewis...  I enjoyed this movie immensely...",
            "review_date": "2009-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film hits very close to home with me.\r\nMy Father was Born and raised in Northern Ireland and moved to England when he was 20 Just Like Gerry Conlon, the Character played by Daniel Day Lewis. \r\nAnd during the Pub Bombings of the 1970s, my Dad was wrongly accused and arrested for being part of the IRA, luckily the police after a few hours of interrogation let him go due to the fact that he was INNOCENT!!!!!!!!!\r\n\r\nIn the Name of the Father tells the harrowing story of Gerry Conlon, a young Irishmen who tries to leave the troubles of Belfast behind him and moves to London to start a new life.\r\nOn the evening of 5 October 1974, the IRA detonated 2 Bombs at a Pub In Guildford England, they targeted that pub because it was used regularly by a lot of British Soldiers.\r\n5 people were killed and 65 were wounded.\r\n\r\nIn the aftermath of the Bombings, the Police arrest Gerry Conlon and 4 of his friends, and after Torture and abuse and his family Threatened by the Police, Conlon signed a confession and is sentenced to life in Prison, and that's pretty much where this Brilliant Movie begins.\r\n\r\nPete Postlethwaite plays Giuseppe, Gerry Conlon's father, who also gets arrested and is thrown into Prison for allegedly being in the IRA. \r\nEmma Thompson plays Gareth Pierce, an assistant Lawyer who goes through the case and starts to put all the pieces together to help Gerry Conlon and his father get free of the crimes they did not commit.\r\n\r\nThis film is a tremendous and powerful Drama that showcases 2 excellent performances by Lewis and Postlethwaite,\r\nIt is also a triumph of the human spirit and the will to not give up and keep fighting for your life even if it feels like there is no hope left.\r\nYou feel for these characters, especially Giuseppe, who tries his best to keep his family together.\r\n\r\nIts a very Gritty movie that does not hold back with a lot the realism, but that just makes it even more engrossing.\r\nJim Sheridan who directed Daniel Day Lewis in My Left Foot and The Boxer directs him here also and does a bloody good job of it.\r\n\r\nThis is one of those films that should not be missed!!!!!!",
            "review_date": "2009-11-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the true story of the guilford four, daniel day-lewis plays gerry conlon a troublesome young man who moves to london with his friend paul hill to get away from 1970's belfast, they join a hippie group but thats when the IRA start to bomb england,exellent supporting cast and music from u2,",
            "review_date": "2009-10-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "absolutely mindblowing from start to finish, lewis plays his part extremely well as always, its a must see for anyone who really enjoys good movies, also has an incredible soundtrack.",
            "review_date": "2009-10-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "definitely worth watching.. I could imagine using this as a visual example of the Troubles in Belfast and the tension it brings about between the different parties",
            "review_date": "2009-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Of all the films made by Jim Sheridan this one is my favourite. The story pulls you in and the performances by all the cast leave you speechless. I first saw this film when I was 8 years old and it had a profound effect on me, the fact that this film is based on a true story makes it all the more shocking.",
            "review_date": "2009-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A golden masterpiece with a stunning performance By Daniel Day-Lewis. Films don't get much better than this.",
            "review_date": "2009-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "**** (out of four)\r\n\r\nBased on a true story in 1974, a young Irish man (Daniel Day-Lewis) is wrongfully imprisoned for the bombing of a London Pub.  The film, directed by Jim Sheridan, follows the long legal battle lead by the young man's father and an outgoing lawyer (Emma Thompson).\r\n\r\nSome films like this try to make their lead character lily white, but part of the greatness is that Sheridan, with the help of the amazing Day-Lewis, is that we still hope for the best with them even though they are flawed.",
            "review_date": "2009-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a tense drama with a masterclass acting qualities.. this is one of the rare drama movie which kept me to my seat, made me wanting for more, and i don't want the movie to end, even i knew what's coming.. the score and sound editing are excellent also, it really brought the movie to life, and made me chill.. film editing are near perfection, no useless scene and speech, this movie is simply a Masterpiece!!\n\nno bad or even mediocre actors are seen within this movie, everyone played their part too good.. two thumbs up for Emma Thompson, mostly for the final scene in the court.. and the big big applause goes to mr.Day Lewis.. his character are so provoking and i got carried away by it.. i think no one can play it better than himself.. he's definitely the best actor alive, unquestionable.. can't wait for his next movie, Nine, coming in 2009..",
            "review_date": "2009-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This a true story based on an Irish family who were wrongly imprisonedfor 15 years by the British Jurisdiction.Daniel Day Lewis is simply super the way he mastered the Irish accent hats off.",
            "review_date": "2009-10-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing performance db Day-Lewis",
            "review_date": "2009-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel day lewis is amazing actor.",
            "review_date": "2009-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I thought this movie was going to be boring, but I was wrong. This film is interesting with the plots and characters and the fact that it is a true story. Daniel Day-Lewis is always great.",
            "review_date": "2009-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly the best movie of this type I've seen. The police interogation was quite disturbing and made the false confession that much more believable. The pacing was just right. Not surprising that this has the same lead actor and director as My Left Foot but I feel this story flowed much better.",
            "review_date": "2009-09-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Daniel Day-Lewis is one of the greatest actors of this generation.  Excellent performance.",
            "review_date": "2009-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I love this film, a sad tale of a man who was sent to jail for a crime which he did not commit. Even 16 years since it's release this is one film I watch often and still enjoy.",
            "review_date": "2009-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In The Name Of The Father is an incredible film based on true events of the Guildford pub bombings, Not gonna go into great detail as anybody who has seen this knows what happened and how the innocent prisoners were treated. Going to check out Gerry Conlons book on the events which is seemnly more moving and disturbing than the film which is based on the book but misses alot of information I have heard.\r\n\r\nDaniel Day Lewis is outstanding once again, In my eyes the greatest actor on the planet right now (See There Will Be Blood.",
            "review_date": "2009-09-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In the Name of the Father is basically three different movies in three acts: an Irish movie, a prison movie, and a courtroom drama, and with each of these appropriate subgenres comes a legion of cliches associated with each.  Yet each of these cliches are both embraced and transcended, partially because of the absolutely larger-than-life performances at play, the astounding true story behind the script, and the brilliant direction of Jim Sheridan, who manipulates and amplifies each emotional up-and-down of the series of events for a historical, intellectual, and, above all, emotional experience.  It's not perfect, but it's not to be missed.",
            "review_date": "2009-08-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's all about knots- between Ireland (IRA) & England, between father & son. Quite a typical underdogs fighting back formula yet well executed. Daniel Day-Lewis was good but Pete Postlethwaite was even better.",
            "review_date": "2009-08-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gut wrenching but great.",
            "review_date": "2009-08-25",
            "source": "rt",
            "lang": "en"
        }
    ]
}