{
    "rating": 8.9,
    "release_date": "1993-08-06",
    "num_reviews": 370,
    "genres": [
        "Action",
        "Mystery&thriller"
    ],
    "summary": "Wrongfully accused of murdering his wife, Richard Kimble (Harrison Ford) escapes from the law in an attempt to find her killer and clear his name. Pursuing him is a team of U.S. marshals led by Deputy Samuel Gerard (Tommy Lee Jones), a determined detective who will not rest until Richard is captured. As Richard leads the team through a series of intricate chases, he discovers the secrets behind his wife's death and struggles to expose the killer before it is too late.",
    "reviews": [
        {
            "content": "Cat and mouse thriller for an archetypal thriller!\n\nDirector Andrew Davis' action thriller The Fugitive (1993) holds up with tense encounters and suspense chases around Chicago. Davis keeps you engaged with intense direction that has sweeping wide shots of Chicago's cityscape from cinematographer Michael Chapman. I love the close-ups like in the iconic sewer scene, where Tommy Lee Jones shouts, \"I don't care!\" Andrew Davis delivers a truly timeless thriller with chases, distractions, and twists galore.\n\nWriters Jeb Stuart and David Twohy adapted Roy Huggins' novel for an intricate crime narrative about a murdered wife, a one armed assailant, an obsessed marshal, and a desperate innocent man on the run. The Fugitive lets us sympathize with Kimble because he's innocent and he's a doctor who is always trying to help others. It's a great story told in an elegant and effective way. The Fugitive is exciting, emotional, and intense fun.\n\nHarrison Ford is likable as the fugitive in question Dr. Richard Kimble. His clear love for his wife, care for patients, and patience in tracking down the real killer while evading police is gripping. Ford finds an emotional heart to Kimble. Tommy Lee Jones is outstanding and hilarious as the gruff and persistent Deputy U.S. Marshal Sam Gerard. His fastidious nature makes him a pitbull of a man and pursuer. Jones is so entertaining and my favorite as of The Fugitive. It's easy to see why he won Best Supporting Actor despite being up against legendary performances from Ralph Fiennes in Schindler's List or Pete Postlethwaite within In the Name of the Father.\n\nSela Ward is sympathetic and pretty as Helen Kimble. Joe Pantoliano is a riot as the smart-mouthed Deputy U.S. Marshal Cosmo Renfro. Andreas Katsulas is creepy as the one armed man Fredrick Sykes. Jeroen Krabbé is sleazy and friendly alike as Dr. Charles Nichols. Daniel Roebuck as Deputy U.S. Marshal Bobby Biggs, Tom Wood as Deputy U.S. Marshal Noah Newman, L. Scott Caldwell as Deputy U.S. Marshal Erin Poole, and Johnny Lee Davenport as Deputy U.S. Marshal Henry are all a scream opposite Tommy Lee Jones' fiery orders and steadfast command.\n\nJulianne Moore is gorgeous and playful as the smart and observant Dr. Anne Eastman in an early career role for her. Jane Lynch is considerate as the helpful Dr. Kathy Wahlund. Dick Cusack makes a nice appearance as Kimble's Attorney Walter Gutherie. Nick Searcy is great as the underhanded Sheriff Rawlins. Neil Flynn has a memorable cameo as the unfortunate Transit Cop.\n\nEditors Dennis Virkler, Dov Hoenig, David Finfer, Richard Nord, Don Brochu, and Dean Goodhill worked together to splice together all the Chicago footage to ensure intense chases felt exhilarating. They really cover all their bases with flashbacks and bits of information getting a quick cut to jog the viewer's memory, so that we can always follow along. Production designer J. Dennis Washington creates hospitals, law offices, and homes stuffed with realistic props from set decorator Rick Gentz.\n\nComposer James Newton Howard wrote a thrilling and powerful film score for The Fugitive. The main theme is so exciting with intense string arrangements. Costume designers Aggie Guerard Rodgers and Linda Henrikson create tons of marshal's outfits and runaway disguises. Makeup artists Peter Robb-King, Rodger Jacobs, and Pat Gerhardt create several visual changes and facial makeup choices to disguise Harrison Ford and give him injuries. Hairstyling from Kathe Swanson, Dominic Mango, and Mary Buono give Ford dye jobs and different cuts for unique hair disguises throughout The Fugitive.\n\nIn all, The Fugitive is worth seeing and rewatching time and time again.",
            "review_date": "2023-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "a great time, a fleshed out story, and great writing and performances from every actor on the screen.",
            "review_date": "2023-03-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This 30 year old film still holds up pretty well. The plot is good and intense, Harrison Ford and Tommy Lee Jones are great in their roles. The only \"bad\" thing about this film is the \"Peter Pan over the dam\" scene, an iconic moment with a hilariously bad and obvious dummy. Definitely worth a watch if you haven't seen this before.",
            "review_date": "2023-02-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's hard to believe that this action-packed thriller was considered Oscar-worthy, and even harder to believe that Tommy Lee Jones landed a Best Supporting Actor win for his role in it. The Fugitive is well-crafted owing to its gripping plot, fantastic cast, and superb production value but it's not Oscar material by today's standards. Harrison Ford gave one the most intense performances of his career, succeeding in keeping viewers on the edge of their seat. Although the ending is predictable, The Fugitive is stimulating as well as entertaining which makes it superior in its genre.",
            "review_date": "2023-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Undeniable great storyline and cast with an epic movie worthy of high praises. No matter how many times we watch it, its always enjoyable and captivating. Bring on the popcorn, chips and pop and sit down to be entertained.",
            "review_date": "2023-01-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This an excellent movie, The Fugitive, 1993 film based on a TV series with same name in 1963 by Roy Huggins is directed by Andrew Davis...with story and co-writer by David Twohy...and having a strong casting, such as Harrison Ford, Tommy Lee Jones, and actresses, Sela Ward as well as Julianne Moore ...",
            "review_date": "2023-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic to be sure. Everyone needs to see it at least once. A fun thriller that is definitely worth the watch.",
            "review_date": "2022-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harrison Fords best independent work away from the franchises. Awesome watch and great story. Great acting. ",
            "review_date": "2022-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": " An action thriller that is hard not to love. With Harrison Ford giving a sympathetic performance. As man wrongfully accused of murdering his wife. On the run from a gun ho U.S. Marshall (Tommy Lee Jones). Who is determined to catch him.",
            "review_date": "2022-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a fantastic movie! I can't believe that it has taken so long for me to watch The Fugitive. The plot is simple and direct, the script is equally slick and the performances are excellent. I was particularly surprised by Harrison Ford. He has always been an average performer in my opinion, but his acting chops are on full display in this film, especially in the opening sequence. Tommy Lee Jones is also great in this movie, with his performance more genuine than later movies (when he is a curmudgeon).\n\nFrom start to finish, I was glued to the action and fully invested in what happened to Dr. Kimble. Though the plot is fairly predictable, the story is highly captivating.\n\nBest Character: Dr. Richard Kimble\nBest Scene: The final cop car scene.\nBest Quote: \"I thought you didn't care.\" - Richard \"I don't.\" - Gerard",
            "review_date": "2022-10-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'd say 2/3 of this film really stands tall above nearly all the thrillers and crime dramas of the 90's. For a film that has fairly strong plotting, the showdown/climax and \"reveal\" is a bit generic and lacks the energy the film was brimming with in the first and second act.",
            "review_date": "2022-10-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best of Movies/TV Series Collection",
            "review_date": "2022-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A thriller from when the genre specification really kept its promise, and the film actually was thrilling. This one is guaranteed to keep you awake and make you feel the edge of your seat. It's still exciting after nearly 30 years, and modern film makers have a brilliant study object.",
            "review_date": "2022-09-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Unfortunately I consider the movie quite boring",
            "review_date": "2022-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The Fugitive\" is a first-rate thriller from the 90s. I think the first act of this movie is awesome and really had me on my toes. I feel like it mixes goofier elements with stuff that's super serious pretty well. I think Harrison Ford and Tommy Lee Jones are consistently fun to watch and I was always interested to see where it would go next. I think my main issue with the movie was the big revelations that happen near the end. To me, the mystery element unfolded in a kind of underwhelming way that took me out of it a bit. Nonetheless, the thrills are there throughout and the intrigue is still pretty solid when it's building up. Overall, it is a solid movie that is worth checking out and an impressive movie of its era.",
            "review_date": "2022-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie never stops moving, Harrison Ford plays it smart as Richard Kimble and Tommy Lee Jones plays it tough and witty as Sam Gerard. This movie will stand as an amazing crime thriller. Apart from the final showdown, I thought this movie was perfect.",
            "review_date": "2022-05-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very suspenseful action flick. Harrison Ford did a fantastic job as the titular fugituve and Tommy Lee jones was great as usual.  The mystery is also well written.",
            "review_date": "2022-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just a good story and with well done action. Great pacing. Good storytelling. 100 percent worth a watch.",
            "review_date": "2022-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hitchcock may have invented the \"wrong man\" genre, but Andy Davis lucked out with this cast, script and year of production (5 years later and they would have used crappy CG instead of the incredible, real life train crash). The straight down aerial shots in this film really started a trend that is popular to this day. Tommy Lee Jones' most memorable and iconic role and dialogue by far, and the scenario fits Ford's personality perfectly. Supporting cast are perfect, and Chicago is almost a character itself in the film. You're rooting for both the chaser and the chasee, so you don't get tired of rewatching a movie like this.",
            "review_date": "2022-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Just Great, although from 29 years ago, still fresh. Harrison Ford and Tommy Lee Jones are great!!",
            "review_date": "2022-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An exciting thriller that scores by expertly combining a kinetic chase with a thorny mystery, and is well served by two charismatic leads giving the sort of performances they do best. It's also one of those rare films that use flashbacks both sparingly and effectively, without sacrificing the breathless momentum of the plot - even the way the groundwork is established in the first few minutes is frantic.",
            "review_date": "2022-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Have to watch it every time it's on TV!",
            "review_date": "2022-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Ford. A thrilling story with the right amount of close calls and twists.",
            "review_date": "2021-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It does not deliver as much as I thought it would, but it is a movie worth watching. I just feel like every part of it, the thrills, action, etc. have all been done better elsewhere.",
            "review_date": "2021-09-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I'll admit, I've been waiting to put this on my list of recommendations (I know I've mentioned it in passing). The Fugitive is the benchmark all thrillers should aspire to, and although I've stated The Bourne Supremacy is the pinnacle of the modern thriller, Paul Greengrass' masterpiece owes a debt to Andrew Davis unbeatable beauty. Harrison Ford is astonishing, (although he was ignored by the academy who failed to rectify their previous mistake when they failed to award him Best Actor for Witness [1985]) and Tommy Lee Jones (who did bag an Oscar) plays off him superbly, in one of the great thrillers.",
            "review_date": "2021-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive biggest asset is it's pacing, it manages to hold the viewers attention for the entire 2 hours of run time.",
            "review_date": "2021-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film with great performances from Harrison Ford and Tommy Lee Jones. This film has a really good soundtrack as well and keeps the viewer on edge as a conspiracy is unraveled.",
            "review_date": "2021-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I know it has that Dances With Wolves vibe but so does Avatar. I say Jolly Good",
            "review_date": "2021-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I was first in the door opening day in Fresno CA  Love the film  Tommy deserved his Oscar",
            "review_date": "2021-06-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harrison Ford and Tommy Lee Jones race around in circles for this memorable early '90s cat-and-mouse blockbuster, skillfully adapting and modernizing a four-season television series from thirty years prior. The Fugitive doesn't fool around, racing through dozens of heavy plot points in the first hour without feeling overwhelming or hyperactive. It's a succinct, condensed version of a once-sprawling serial, one which trims away the obligatory TV padding without skipping any good bits.\n\nWhile it's trucking through those establishing shots, the story is a whiplash stunner; in the blink of an eye, we see our protagonist as a respected physician, grieving husband, bewildered murder suspect, sentenced convict, opportunistic escapee and outdoor survivalist, with one particularly well-executed train derailment thrown in to really kick off all the turmoil. Almost by necessity, the second act slows down to focus on the chase, balancing Ford's attempts to lay low with Jones's top-of-the-food-chain detective work. That performs well, too, a firm gear-shift from the opening salvo's manic mayhem (one that's certainly assisted by its two phenomenal cornerstone stars), though it does lose its way as all the different points converge and the moment of resolution draws near. By contrast, the ending falls more on the bland, derivative side; careful suspense cast aside in favor of a big chair-tossing, pipe-swinging, rock'em'sock'em finale. These scenes are inoffensive, but a decided step down from what we'd seen and felt just prior. Put it this way: I still vividly recalled the bus crash and dam jump, decades after I last saw them. I'd forgotten all about the climactic rooftop fist fight.\n\nWhile the gettin's good, it's real good. A fairly simple premise with plenty of intrigue and gray morality, a tight script, more than one all-decade action set, a super-sized portion of Tommy Lee Jones intensity and lots and lots of chances for grim Harrison Ford to glance worriedly over his shoulder. Maybe not perfect, but it still holds up.",
            "review_date": "2021-05-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best action thriller film with really outstanding performance and great directing.",
            "review_date": "2021-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Two fantastic lead performances by Harrison Ford and Tommy Lee Jones (and even Joe Pantoliano), strong direction and a fast-paced narrative with a compelling mystery to offer thanks to wonderful writing, The Fugitive is a phenomenal watch from start to end and one of the most thrilling and most exciting films i've ever watched. Absolute must-see for anyone into movies and who likes action and thriller films.",
            "review_date": "2021-02-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fucking loved it.  Harrison Ford and Tommy Lee Jones play off of each other so well! \n Definitely try to see it.",
            "review_date": "2021-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In an era where action films are defined by gratuitous gunfire and flat characters, The Fugitive feels like a breath of fresh air. The chase sequences are gripping, and the film as a whole leaves one feeling more than satisfied by the end.",
            "review_date": "2021-02-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun action/crime movie with Harrison Ford and Tommy Lee Jones pulling off nice performances, had a really basic and great story, and went in a fast pace.",
            "review_date": "2020-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A movie that will keep you awake till the end",
            "review_date": "2020-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love Harrison Ford here.  Great editing and I think the action sequences were supreme :)",
            "review_date": "2020-09-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fugitive is great. Harrison Ford gives a really good performance. The main storyline is very engaging and the film stands to have a very strong first and 2nd act. Even though the third act was a bit weak it was still a great time. \n\nSCORE: A-",
            "review_date": "2020-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fantastic 90s action-thriller featuring a brilliantly set-up game of cat and mouse between Harrison Ford and Tommy Lee Jones, The Fugitive is the kind of movie that I will always want to rewatch whenever it appears on TV (and it does fairly frequently).",
            "review_date": "2020-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "There's no other way to put it, this is a terrific film! I dare to say that this is one of the best action movies ever made. It's exciting, very captivating from beginning to end, it's nail-biting and suspenseful. Those chase scenes are full of adrenaline. It features a memorable score, which sometimes helps to set the mood. And the acting is unforgettable. While Tommy Lee Jones won an Oscar for Best Supporting Actor in this film, I think it was Harrison Ford who gave a great performance. He plays a character that we feel for. Overall, The Fugitive is one of the greatest movies that I've seen in a while, it's a great classic. Recommended!!",
            "review_date": "2020-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Another masterclass film that has Harrison Ford.",
            "review_date": "2020-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Incredible action sequences. Thrilling! Smartly woven with intriguing characters.",
            "review_date": "2020-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A perfect movie in every sense",
            "review_date": "2020-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An honesty really entertaining movie that I should I seen much earlier.",
            "review_date": "2020-08-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gripping and intense. \"The Fugitive\" is a movie that never failed to fascinate me with its captivating thriller and impressive directing. This chase thriller of a film will keep you interested from start to end. Unfortunately, It doesn't possess anything more to the story than just a heart-stabbing thriller.",
            "review_date": "2020-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the most beutifull movies I have ever seen",
            "review_date": "2020-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive is pure entertainment. Harrison Ford seems to be widely known as Han Solo and Indiana Jones but I feel like this character he portrays really shows how great of an actor he is. Tommy Lee Jones is also great, although his best supporting actor win is rubbish. But at some point Ford running away from the authorities starts to feel rehashed. In that sense its slightly overlong. Its not just entertaining but it happens to be a very well crafted thriller.",
            "review_date": "2020-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty good in 2020. Nice developing story.",
            "review_date": "2020-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Well made remake that captures the thrill of the show.",
            "review_date": "2020-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's very remarkable that the world where the story is set, is made more real by little details planted everywhere.",
            "review_date": "2020-07-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very simple story but very effective as a thriller...harrison ford and tommy lee jones play very good parts...enjoyed",
            "review_date": "2020-07-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pure action and writing gold.",
            "review_date": "2020-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive is a tight, thrilling, action film about an innocent man on the run from the law. Harrison Ford shines in possibly his best film of the 90's",
            "review_date": "2020-06-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This taut action-thriller is a rare example of a film exceeding the level of it's television roots. Fast-paced and frantic, The Fugitive offers a compelling plot brought to life by Harrison Ford and an incomparable performance by Tommy Lee Jones. We may have an idea how it's going to end early on, but the thrill is in the ride getting there.",
            "review_date": "2020-06-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A non stop and smart action thriller with great performances and action set pieces. Harrison Ford is at his frantic best, in one of his best and most memorable roles, as Dr Richard Kimble who is on the run and trying to clear his name. Tommy Lee Jones shines, and quite frankly steals the show, as the determined and duty bound US Marshall. Honestly, this film has always been known as a Harrison Ford vehicle, but it can be argued its a Tommy Lee Jones film. Ford is out to find the truth and stay one step ahead of the US Marshall. He has a simple arc, and little to no character development. Hes still that same guy as he started the film. But it is Tommy Lee Jones who has the best arc. He is trying to catch Ford with no regard for the truth, just the duty of bringing him in. But over the course of the film, gradually works out that this isn't a straight forward job and comes to realise there is something more to this task. I believe, he let Kimble slip through his fingers as much, because he knew he would lead him to the solution of this mystery. He has the best character arc and the best development.\nThe only thing that goes against this film, is that I waited too long to watch it. It has been parodied and mimicked within an inch of it life. I felt like I had already seen it, from various parodies in The Simpsons and even the Leslie Nielsen film, Wrongfully Accused. For me, this film wasn't as exciting and refreshing to watch, as those who watched it when it came out.  And, to me, thats a shame, that so many film are no longer as enjoyable as they should be, because so many of the best bits have been lifted and shown elsewhere.",
            "review_date": "2020-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of the greatest movies of all time!!! I believe it is my favorite flick.",
            "review_date": "2020-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really good, kept me wondering throughout",
            "review_date": "2020-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is awesome.",
            "review_date": "2020-04-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great cat and mouse film with some amazing plot twists.",
            "review_date": "2020-04-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is one of my favorite movies and a great example of amazing filmmaking, it blends a smart and engaging script with swift and precise direction, add on a pair of fantastic performances from Harrison Ford and Tommy Lee Jones and you have one of the top thriller films of all time, and an amazing movie in general. I can't tell you how good Jones and Ford are in this movie, it must be experienced for yourself, they actually don't have too many scenes together, but they carry the entire movie very well when you keep switching back and forth between them. The script tries to keep up with the great performances, not to say that it was bad, it was actually complex and thought-provoking, and there is nothing super unrealistic happening either, this film is very grounded in reality and everyone feels very human and vulnerable. There is also a lot of great intensity and suspense in this film when Ford is on the run, you always get worried, scared even, if he will get caught or escape in spectacular fashion, he's never really safe, he always has to be aware of his surroundings and try and blend in as much as possible, and there is a sense of urgency as well, all of that together makes this a great display of emotions and senses without using any dialogue, this uses the show don't tell method to perfection. The bus crash scene has got to be my favorite, you fear for his life so much, and you actually care about what happens to him, every character developing moment at the very beginning of the film pays off greatly. I also enjoy the mystery aspect of this film, Ford is not only on the run, but he is investigating his wife's murder as well and it adds depth to what he is doing, the script is very well fleshed out from a character development and plot perspective, I was genuinely surprised by how good is and realized it even when I was younger. I can't really think of a more entertaining and engaging thriller than this film, it is a classic in my eyes and I love how rewatchable it is, even when you know what happens, that is thanks to the genuine intensity and pure fear that this film evokes within you. This is a very well written and even better-acted film and is very deserving of high praise.",
            "review_date": "2020-02-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This dramatic thriller was very good. Harrison Ford, Tommy Lee Jones, and the rest of the cast did a fantastic job in this movie. The plot to the movie was very good, suspenseful, and it had a shocking twist at the end. It's a movie about finding the truth at all costs. This is a movie for everyone. I would definitely recommend it.",
            "review_date": "2020-02-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my opinion, it somehow is the best movie Harrison Ford has been in.",
            "review_date": "2020-02-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why is the janitor a cop?",
            "review_date": "2020-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive is about a Chicago surgeon and a prison escapee, Dr Richard Kimble, who is falsely convicted of murdering his wife and wants to solve his wife's murder by pursuing the real murderer, who is a one armed man whilst being chased by the U.S Marshals and the police. This is my favourite film of all time for so many reasons. Firstly, Harrison Ford is my favourite actor and he gives his best performance in this film as Dr Richard Kimble; Secondly, all of the supporting actors and actresses are truly phenomenal as they give powerful performances but Tommy Lee Jones steals the show as U.S Marshal Sam Gerard which he won an Oscar for Best Actor in a Supporting Role and an Academy Award for Best Actor in a Supporting Role and he absolutely deserved those awards; Thirdly, all of the chase scenes and action sequences in this film never lose suspense and intensity which can be a difficult job but it was perfectly executed and lastly, the score in this film is so beautiful and spine-chilling making the atmosphere and every scene so unique and amazing. Andrew Davis is the brains behind this masterpiece which is based of the 1960s TV series 'The Fugitive', he is also the brains behind 'Under Siege' which is one of my favourite films of all time and 9 cast members from 'Under Siege' are in this film including Tommy Lee Jones. I've watched this film so many times now and it never gets boring and I actually enjoy it more every time I watch it which says a lot. Overall, this is an exhilarating film that I highly recommend to people who like Harrison Ford and Tommy Lee Jones, crime films and perfectly made films. What are you waiting for???????? Watch this film if you haven't already!!!!!!!!!!!",
            "review_date": "2020-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harrison Ford. Tommy Lee Jones.\nGreat story ✅\nGreat acting ✅\nGreat technical work ✅\nGreat screenplay ✅\nGreat supporting cast ✅\nGreat music ✅",
            "review_date": "2019-12-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very well done script, a nice twist and with an amazing couple with magnificent performances.",
            "review_date": "2019-12-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic! Ford and Jones at their best!",
            "review_date": "2019-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fact that this film was nominated for Best Picture displays just how male oriented the membership of the Academy must be as they selected a thriller featuring middle aged men over better popular, mainstream films such as Sleepless in Seattle (1993) and The Age of Innocence (1993). Obviously the film wasn't made for me as I am not an aging father with fears about my own mortality but for the genre it works in this is a decent film by my estimation. While I have never understood the appeal of Harrison Ford as a leading man he is perfectly serviceable here and Tommy Lee Jones gives an Academy Award winning performance as the man on his tail. This isn't one of the best films of 1993, an unusually deep year of cinema, but there are definitely worse choices that could have been made.\n\nRespected vascular surgeon Richard Kimble, Harrison Ford, finds his wife brutally murdered by a mysterious one armed man one night after returning from a convention. He is found guilty of murdering his wife when it is discovered that he is the sole beneficiary of her life insurance policy and is sentenced to death. He escapes from the bus transporting him to death row after other passengers are able to shoot most of the guards on board and an accident occurs. U.S. Marshal Samuel Gerard, Tommy Lee Jones, is assigned to track down Kimble and as Kimble attempts to adopt new identities and hide out in the houses of random people he investigates his wife's murder. Kimble makes several miraculous escapes from his captor and armed with information about men with prosthetic arms he comes closer to absolving himself of his crimes.\n\nThere are several thrilling action set pieces in the film that fans of the genre will surely be familiar with as the fast moving train that Ford is barely able to escape, the elevator precariously suspended between floors and the dive into a dramatic dam of our protagonist do make for some tense, exciting moments. These are spaced out between scenes of Ford desperately hiding under a quilt of leaves while hiding out from Jones and correctly diagnosing a young patient in a Chicago hospital. Director Andrew Davis has a knack for keeping the action coming even as the plot is quite obviously ludicrous and the characters aren't as complex and fascinating as they could be. This all adds up to creating an enjoyable yarn which will keep audiences of all types engaged but I still felt that there was something lacking.\n\nI needed to feel Kimble's desperation more than I did as while Ford's shaken expressions and the cheesy flashbacks featuring Sela Ward setting up a romantic homecoming for Ford give us the gist of who Kimble is I wanted more depth. I am not asking for a thirty minute section of the film that is just about Ford loving his wife but perhaps just one scene in which we more firmly establish how important she is to him before she is beaten to death. The court case is then relatively unbelievable as he appears to have no defense and is sentenced almost immediately to death row. Because this is a thriller this is a plot point that you just go along with but considering the amount of prestige attached to the film I expected more. The film also does not lean into the camp that makes a thriller so delightfully an compelling and instead chooses to portray everything with a straight face leaving no room for some of the more offbeat plot points to be interpreted as humorous or deliberately wacky. \n\nFord is solid but rather dull as a lead with his Kimble coming across as the same boring, grumpy man he plays in most films and another leading man from this era could have spiced up the film a little bit. Jones is quite impressive as a man with total dedication to his job who begins to stray from his own strict beliefs as he too questions whether his target is innocent or guilty. No, he's not better than Leonardo DiCaprio in What's Eating Gilbert Grape? (1993) or Ralph Fiennes in Schindler's List (1993) but he's good enough to receive special recognition for his work. \n\nOverall a decent but underwhelming thriller that was overrated during it's time and appears heavily flawed when viewed through a modern perspective.",
            "review_date": "2019-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's the best movie i ever seen the story is so good",
            "review_date": "2019-10-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The most thrilling exiting action crime thriller ever with two incredible actors,great screenplay and best director.",
            "review_date": "2019-10-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The greatest chase film of all-time. There's never a dull moment and it's an incredible thrill ride that stands the test of time.",
            "review_date": "2019-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive is a modern classic - it takes the moral obligations of the law as well as a falsely accused ‘fugitive' and melds them together into an action packed, beautifully scripted, intense thriller, which exceeds the watchability and originality of any other. I definitely recommend. ",
            "review_date": "2019-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's got some flaws but it's easy to forgive it thanks to the spectacular performances from the cast (specially Tommy Lee Jones).",
            "review_date": "2019-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ford is the freight train that's in front of this flick. Tommy Lee Jones is the engineer. Just grab the popcorn and get out of the way.",
            "review_date": "2019-09-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The movie plot is interesting and Tommy Lee Jones and Harrison Ford are amazing, but it feels very repetitive and at the end you get a little boring.",
            "review_date": "2019-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive is one of the most \"90's\" movies I have seen in awhile. It also happens to be one of the more entertaining films I have seen in a long time. I had a ton of fun watching this movie and will gladly see it again some day in the future. Everything in this movie from the direction, cinematography, script and the excellent score by James Newton Howard screams 90's and reminds me of an era where things were just more simple.\n\nAndrew Davis did a really good job directing this movie, as every scene is filled with tension, but also functions as a build-up for the next sequence. Harrison Ford and Tommy Lee Jones are both fantastic in this movie, definitely one of their best performances for both of them, simply outstanding job. John Pantoliano is also excellent here, I think he's one of the most underrated actors out there, not a lot of people talk about him. He was amazing in The Sopranos, The Matrix and also here.\n\nLike I said, this movie just screams 90's, which is not necessarily a bad thing but I think it works both as a positive and a negative for the movie. This is a film that, while watching it, you are instantly reminded of a certain age in cinema and how movies were produced during that time, which is very interesting. However, that also tells me that the film hasn't aged as well as I would have liked. A few lines here and there seem a bit too cheesy and I found the ending to be very predictable, because I think most of the movies produced during this time and considering the tone of the film early on, I knew Harrison Ford was gonna be innocent. It's also kind of obvious that his other doctor friend was somehow involved in the whole crime. And the ending with the reporters asking stuff about the conclusion of the movie, letting us know that the world now knows that Harrison Ford is considered innocent in the public eye.\n\nThere were some things that I don't think made a lot of sense. First off, if they wanted to kill Harrison Ford, why did they send a one-armed man? Couldn't they find someone better for the job? I mean the guy was clearly a psycho, since he ended up killing his wife instead of Harrison Ford. And then, how did Harrison Ford get so much money to survive for so long? I believe they mention at some point that it had been a year since he escaped and unless I missed something, the only money he gets is the money he borrows from his evil friend, which I take it it wasn't a lot, since it was only what he had on him at the time. Also, the final fight between the two is just shlock. \n\nBut, even with all its apparent flaws, The Fugitive is a very entertaining movie and I really liked it.\n",
            "review_date": "2019-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive is one of the best action films ever made and the 2nd best film of 1993 behind Groundhog Day. ",
            "review_date": "2019-08-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such a great example of a Chase Thriller done right ",
            "review_date": "2019-08-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Mystery suspense film that is so much fun to watch. Tommy Lee Jones and Harrison Ford are phenomenal.",
            "review_date": "2019-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can safely say I've seen this numerous times and I love it. I would even pick it as one of if not the best action movies in a long time. Part mystery, part medical drama, all kinds of action, with a break neck speed and it makes the running time seem not that long even though it's over two hours and twenty minutes. I highly recommend this one.",
            "review_date": "2019-06-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harrison Ford is Up against the law as “ The Fugitive “ , with a chilling and thrilling mysterious tone.",
            "review_date": "2019-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I've watched this movie 5 times, and I still find it as good as the first time I saw it.",
            "review_date": "2019-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I stand corrected, this is the best movie we watched in school. This is my dad's favorite movie and I can see why. The acting is stupendous from every character and it combines that with a good story and some action. The story is simple but it's what happens in the middle that is great. The best part is that the character's uses common sense, that really impressed me because most of the time they take the hard way to solve a problem. The movie was a bit too long, not because I was bored but because they stretched the story a bit too far. In the end, I was only little confused because I didn't know how they solved the problem. Aside from that, I really enjoyed this movie, it kept me interested each day while we watched it in forensics.",
            "review_date": "2019-04-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thrilling, exhilarating and powerfully suspenseful, this action-drama is fueled with what is possibly one of Harrison Fordï¿ 1/2(TM)s greatest performances, attached wonderfully with Tommy Lee Jones in a show-stealer presence, Andrew Davis delivered a highly effective chase flick, with a formula and pace and strongly iconic moments thatï¿ 1/2(TM)ll remain in posterity, The Fugitive is intense, properly directed and positively addictive, making it one of the 90s memorable action flicks.",
            "review_date": "2019-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Andrew Davis is a one trick pony, but man was his best film absolutely astonishing. There is so much tension and excitement going on, you can't turn away for a second. A 90s thriller with astounding atmosphere, great acting, a suspense filled story, and a healthy amount of action to the superb directing. What else is there left to say? Its one of my favorites and I guarantee you'll enjoy watching it again and again.",
            "review_date": "2019-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Breathtaking, amazing performances and storyline that always leaves the audience at the edge of their seats. This is a must watch action film!",
            "review_date": "2019-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie - as well as retaining a somewhat unusual storyline - manages to keep up the already high levels of tension throughout. In spite of one relatively unrealistic scene (the waterfall jump, for those who have seen it), it is brilliant, and well acted by Tommy Lee Jones. An absolute classic for me, something I will remember for years to come, and great for anybody who loves action, murder, or even just doesnï¿ 1/2 1/2 1/2(TM)t know what to watch. Thoroughly enjoyable.",
            "review_date": "2019-02-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The best thrilling mystery movie ever made! With the best movie character ever portrayed: Harrison Ford as Dr. Richard Kimble! And the best movie score ever composed!",
            "review_date": "2019-02-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "great film. thought Harrison and Tommy Lee Jones did a great job. would have been even better with some more R rated violence, but it is what it is",
            "review_date": "2019-01-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good movie with a good story and good suspense. not too many old movie qualities. enjoyable overall (about 3 viewings)",
            "review_date": "2018-12-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Cops, Train Wrecks, Innocent Man (doctor nonetheless) fights to bring wife killer to Justice... wow. How do you best Tommy Lee Jones + Harrison Ford... you don't. This movie is a classic... one of the best thrillers I have seen in my many years. Highly Recommended",
            "review_date": "2018-12-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "thirilling to the end",
            "review_date": "2018-11-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "In my opinion, it's the best Harrison Ford movie that isnt Star Wars or Indiana Jones.",
            "review_date": "2018-10-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly gripping classic",
            "review_date": "2018-10-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "excellent movie!  ford and jones were great as were the other actors.  .i kept rooting for ford's character.",
            "review_date": "2018-10-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive: Pros: - Fantastic Acting - Amazing Directing - Terrific Script - Beautiful Cinematography - Magnificent Editing - Very Funny At Times - Great Action Scenes - Engaging Plot - Brilliant Pacing Cons: - Could’ve used a bit more time with Kimble and his wife to make his journey a bit more justifiable Overall Grade: A- (9/10)",
            "review_date": "2018-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harrison Ford and Tommy Lee Jones teamed up for an epic movie, with excellent homage to the original series.",
            "review_date": "2018-09-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best movies ever made- a classic for all time!!!",
            "review_date": "2018-08-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "All around excellent thriller. Great acting",
            "review_date": "2018-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "With some impressive action sequences and a gripping script, this action thriller cruises close to many familiar thriller conventions (though it's difficult for me to tell how original they all were in its time), but it's all thankfully grounded in reality here.",
            "review_date": "2018-08-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was a very satisfying Ford and Jones performance that definitely kept me on the edge of my couch at all times. Well worth watching it.",
            "review_date": "2018-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The action is truly outstanding and the actors are doing a great job telling the story, which is suspenseful and engaging.",
            "review_date": "2018-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive is definitely one of those movies I saw EXACTLY once, enjoyed it a lot, and then promptly never see it again. I think I saw this when it came out on video, maybe 1994 or so. I didn't see it again until yesterday. Still great, though maybe a tiny bit dated. Harrison Ford is the man.",
            "review_date": "2018-06-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "come on doc..\n\nThe Fugitive\n\nIt is one of those features that completely relies upon the screenplay and not the concept for no matter how simple it gets its twists and tricks will bedazzle the viewers in each and every frame as it ages on screen. Andrew Davis has done a plausible job as a director but the real game changer in here is the co-writer; Jeb Stuart, who also wrote the infamous Die Hard. Harrison Ford pulls it off like a charm along with a brilliant performance by Tommy Lee Jones which got him a well deserved Oscar for it. The Fugitive has everything in its right place i.e. from gripping screenplay to exhilarating chase sequences (one of the best part of it is that it keeps the audience engaged through these close encounters in the cat and mouse chase), from twisted plot to brilliant performances and from amazing background score (James Newton Howard has as always done a marvelous work in here) to beautiful cinematography.",
            "review_date": "2018-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An entertaining, cat and mouse, mystery film.",
            "review_date": "2018-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic action thriller. Harrison Ford is so good good in this tense cat and mouse chase film. ",
            "review_date": "2018-03-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive is a must-see 90's film everyone should have on their watch list. Harrison Ford and Tommy Lee Jones are at their best in a thrilling, heart-pounding action and drama movie. It's like everything clicks in this movie. The plot, characters, and events are all amazing and make sense. I say to everyone to bust out the popcorn and sit down on your favorite sofa for this action-packed thriller.",
            "review_date": "2018-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great movie about a man who tries to prove his innocence. It's a thrilling adventure that for me counts as one of Harrison Fords best films.",
            "review_date": "2018-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film. Solid actioner with tons of drama.",
            "review_date": "2017-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing high tech thriller with Harrison Ford playing the accused of murderering his wife, doctor Richard Kimble is on the loose trying to clear his name.",
            "review_date": "2017-12-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive is a great thriller movie with a ton of chase scenes that are fun to watch on top of being well shot and having a lot of wonderful camera angles, so massive props to the camera operation crew right there. Also, it has a really good twist that I dare not spoil if you haven't seen it. Overall, another fantastic movie with Harrison Ford as the lead character.",
            "review_date": "2017-11-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5/5.  A fantastic thriller that I never get tired of watching  Harrison Ford is great, but Tommy Lee Jones is incredible.  If you haven't seen The Fugitive, do yourself a favor and check it out.",
            "review_date": "2017-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fantastic thriller/mystery film that had me on the edge of my seat the whole time. Harrison Ford is great as the surgeon turned fugitive desperately trying to clear his name and figure out who killed his wife. Tommy Lee Jones also gives a great performance as the no nonsense US marshal who is out to get his man no matter what. The whole movie is brought up a notch with a terrific score from James Newton Howard",
            "review_date": "2017-10-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive is an amazing action and adventure film with amazing thrills throughout! The performances by the whole cast are great and it got Tommy Lee Jones an Oscar for best supporting actor! It's exhilarating and intense with good direction and is thoroughly entertaining!",
            "review_date": "2017-10-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very good film! 10/10",
            "review_date": "2017-09-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "(5.5 out of 6)* suspense + twists & turns + duality\nWhen we don't see how we can get out of some incidents when we are in too deep. When the law doesn't see it our way, when the law goes based on little it sees to get us in prison. When what gets us out is others finding away to draw those in when we need to fight our way through. When we see being out we never belonged in the first place we still believe in ourselves doing the right thing. When we see what gets us in is knowing the ins and outs of places we know all to well. When what gets us in and out are the disguises we wear to impersonate what others can't see. When what others  see gets us further in the chase when we are spotted. When we see that there are no way outs left to go to only find the last place out that could kill us. When we dont see how we get out of tough situations but we do when out will and determination gets us out. When we see what gets others in is by helping us that they rather stay out when we are alone to get out of some messes. When what we don't see what gets us deeper in being caught are the traces that lurks us out. When we see the clues that others need to find that gets us out or in we need to go deeper into places where they are. When we see what gets in and out is the access we know how to get in and pull out the right information. When we see why we got in this profession in the first place is to help people not kill them. When what we dont see we need to get in to see. When others see what we see we see we need to get out when the chase is on us. When we see that we need to blend in more when we are out in broad daylight for all to see. When we see time is of the essence when we need to bring in those who are a danger to justice. When we see following the clues leads us to those who got us in some places in the first place. When we don't see why others would want to see us out when our profession is competitive and being out of date is not needed when new advances are what's in. When we see those who are close to us, and part of our community know what gets in and what gets out when they provide the funding and acceptance to all advances. When we see what gets in sometimes needs to get out when liability and things that go wrong need to be stopped. When we see somethings that many dedicate their time and money too they don't want to be kept out when reputations are at stake. When we see only a few know how to get in on some advances that have control to see it out to only get rid of other things out in order to save themselves. When others can't see how advanced some people are in getting in and framing those out they see they have been chasing the wrong person. When we the justice system is blind and keeps those in their grips guilty or not guilty to get themselves out from  it.",
            "review_date": "2017-08-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie plays the two main leads very well, but not with other characters. The editing, contrasting music and pacing are controlled well enough to deliver what audiences expect. While the two men are carefully looked at and shown to be great at odds with each other, all other characters are shown to be for and against them.",
            "review_date": "2017-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harrison Ford gives a fantastic performance. Thrilling to the end.",
            "review_date": "2017-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When Dr. Richard Kimble is falsely accused of murdering his wife, he has to jump out of a pipe down a waterfall.",
            "review_date": "2017-08-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wonderful thriller about a guy on the run from the cops after he is wrongly accused of murdering his wife. Harrison Ford is his usual awesome acting self. Tommy Lee Jones deserved his awards. Great movie.",
            "review_date": "2017-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great film! I think the scenes like the bus train crash, the water fall scene, and more of those best scenes are a suspended twist in the story. 10/10 (Best film since Inside Out)",
            "review_date": "2017-06-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an expertly crafted suspense-thriller. I believe it is nearly flawless for the first hour and a half. When the film reaches the climax, that is where it loses much of the suspense and mystery that made the first half so great. The explanation makes sense for the plot and is believable, but left me feeling unsatisfied. Because the story is so engaging and exciting for the first half, I am willing to overlook the fact that the entire story began because a bus crashed and landed on train tracks, which was very unbelievable and coincidental.",
            "review_date": "2017-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is an expertly crafted suspense-thriller. I believe it is nearly flawless for the first hour and a half. When the film reaches the climax, that is where it loses much of the suspense and mystery that made the first half so great. The explanation makes sense for the plot and is believable, but left me feeling unsatisfied. Because the story is so engaging and exciting for the first half, I am willing to overlook the fact that the entire story began because a bus crashed and landed on train tracks, which was very unbelievable and coincidental.",
            "review_date": "2017-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "How much more could the skate mysterious well the only way to find out is to see it, along with that I would say this movie is a bit serious but it has Harrison Ford in this movie which he is a good actor I found Harrison Ford to be a bit funny!",
            "review_date": "2017-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "If we're talking about my favorite movie just to watch, hands down it would The Fugitive. This is, in my opinion, the most entertaining movie ever made. It is an action-packed, suspenseful game of cat-and-mouse that has us on the edge of our seats all the way up until the closing credits. It is not only fun and entertaining, but intriguing and interesting as well. I don't often site performances as part of the reason for a movie being great, but here it most certainly is. It stars my two favorite actors - Harrison Ford, playing the innocent man on the run after being accused of murdering his wife, and Tommy Lee Jones, the clever, cunning U.S. Marshall on his tail. All the while, Dr. Richard Kimble (Ford) pursues his own investigation into who really killed his wife, the infamous one-armed man. There are so many great, thrilling sequences in this movie, and it is one of the few thrillers to fully deliver on its exciting presence. It creates an atmosphere of fun and tension, and with some of the best and most entertaining performances I've ever seen, this is no doubt one of my all time favorite movies of all time.",
            "review_date": "2017-04-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "-Interesting\n-Action packed\n-Great storyline",
            "review_date": "2017-04-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The set up for this movie is fantastic. Never misses a beat. It must be such gut wrenching and horrible feeling to be wrongly accused of something horrific that you yourself never did. Especially something like killing the love of your life.\n\nThat train and bus crash has to be one the best crash scenes I've ever seen. So much going on. I love how calm and cool Tommy Lee Jones is. He can be funny without even trying. \n\nI think it's amazing how this guy had the opportunity to move to another country, basically start a new life, and yet he didn't. He stayed in the city and solved his own wife's death. And succeeded! Pretty powerful stuff. It's pretty incredible to see just how determined he was to prove that he didn't commit his own wife's murder. Also incredible to see just how smart, sneaky, and clever he was and how he kept slipping away from the marshals. \n\nGreat Thriller/Suspense movie.",
            "review_date": "2017-03-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Could have really been any better? The ending is easily predictable, but it doesn't matter, as the film and characters are just too captivating.",
            "review_date": "2017-03-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "92%. 2nd watch- September 2022. A bit lower than it should be just because of the time and someone inherently corny nature but otherwise a flawless film. Old school action film. Ford is convicted for killing his wife after pleading innocent. In his way to prison other convicts attempt to escape and he gets out and is on the loose.  Great how it takes place in Chicago",
            "review_date": "2017-01-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a ride from beginning to end.",
            "review_date": "2017-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harrison ford was amazing love the movie",
            "review_date": "2017-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's high octane and non-stop; showing that Harrison Ford was far from done in the action genre.",
            "review_date": "2017-01-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "need to rewatch this to really give it a rating",
            "review_date": "2017-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's good movie to watch",
            "review_date": "2017-01-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive shows that a film can somehow avoid intense violence and keep you intensely thrilled as you watch.",
            "review_date": "2016-12-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Hard to fault this fantastic 90's action-thriller. Though it could be argued that the ending is a bit convoluted and the film is CERTAINLY full of some 90's genre cliches, overall it's a fun, fast-paced and well-edited romp. Tommy Lee Jones is sensational.",
            "review_date": "2016-12-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Best eacaping prisoner movie  ever. Started the trend",
            "review_date": "2016-12-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A timeless classic that sees Harrison Ford investigate his own wrongful conviction, never get tired of this film.",
            "review_date": "2016-12-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fast-paced, suspenseful, and totally unpredictable, watching it for the first time in ages made me realize that I had totally forgotten how exciting and great this film was. Well-directed, well-acted, and well-executed, \"The Fugitive\" is a great thriller that stands the test of time.",
            "review_date": "2016-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Ford may have a constant worry face on him, but he excels in this what's he going to do next thriller.",
            "review_date": "2016-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I greatly enjoy this film every time I watch it it! It is a fun thrill ride of a film that keeps you on the edge of your seat. Proud to say that I live right near where it was filmed & I was born the year it came out on St. Patrick's day, when the parade scene takes place!",
            "review_date": "2016-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Wanna see a chase movie done right?\nFeast your eyes here.\nStill Brilliant. 23 years later.\n\nNo matter what you think of Harrison Ford or Tommy Lee Jones, the story is dynamite, and no one can deny the perfectly intense duo of Jones vs. Ford. A true Batman vs Superman epic - without tights or utility belts..\nhaha\n\nAbove it all, the direction is brimming with suspense and compelling details from the ingenious script. Then of course the top notch acting, and the visuals have held up 22 years later. Ok, so the 2-second train wreck jump didnt, but the rest truly IS great, and completely impressive.\n\nIt. Is. Awesome.\n\n5 overhead train wrecks out of 5",
            "review_date": "2016-09-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Watched it for the 1st time last summer and loved it so much and it's one of my favorite action movies of all time and It's one of the best movies of the 90's.",
            "review_date": "2016-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "About as good as a formulaic suspense thriller can be, for me it sets the standard for the genre.",
            "review_date": "2016-08-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic Harrison Ford. This movie featured superb acting, a great plot with great pacing, and action that kept my eyes locked to the screen. It has one of the best improvised moments in cinematic history and that's fitting considering how good of a film it is.",
            "review_date": "2016-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A really awful film.  The plot simply doesn't work - the mass of unfortunate coincidences is just too much to swallow.  Harrison Ford is OK when shot through with bullets but is totally unconvincing when trying to be a 'normal' doctor.  BTW the hair-do for the first 20 minutes of the film merots a golden turkey award.  Diving from the top of a 300 or so foot dam and arriving at the bottom unscathed... sorry that doesn't work.  At some moments at the start the actors too seem to have trouble taking the whole thing seriously.",
            "review_date": "2016-08-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Terrific adaptation of TV show. Ford is perfect so is Lee. LOVE THIS DANG MOVIE!",
            "review_date": "2016-08-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Enthralling from start to finish and and anchored by Ford and Jones at their best.",
            "review_date": "2016-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "So. Damn. Good.  \"I thought you didn't care.\"  \n\n\"I don't.\"",
            "review_date": "2016-08-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very well told gripping film from start to finish, Brilliantly acted by Ford and Jones, Very well told story but it's too predictable and we all know how it was going to end, But it's one of Fords best films outside of Star Wars and Indiana Jones.",
            "review_date": "2016-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fast-paced, well-acted and thrilling.",
            "review_date": "2016-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive is one of the best and most intense thrillers that I have ever seen that contains the perfect story about a doctor who is falsely committed of murder and escapes jail from an accident involving a prison bus and is on the run as a fugitive trying to clear his innocence. This film contains the best cast, scripts, and situations ever to be brought into a thriller and thats why I watch it continuously and recommend it to anyone who hasn't seen it.",
            "review_date": "2016-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Action Packed entertainment is what makes this movie one of the best.  Engaging story line and strong performances from Tommy Lee Jones and Harrison Ford also help. 5 stars.",
            "review_date": "2016-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Often exciting, often funny, often clever and mostly entertaining, The Fugitive doesn't break much new ground, but doesn't overreach. The whole 'simple crime turning into a larger conspiracy' concept has been done countless times, and here it actually bogs the movie down, detracting from the cat and mouse game that lies at its core. Jones is a great supporting actor, inhabiting a character both ruthless and charismatic, and Ford keeps us on his side as the man caught on the wrong side of the law. The bursts of action and chase scenes are fun to watch, but it's nothing overly special, and our grieving hero doesn't seem to care much for the loss of his wife, almost dismissing it completely, which seems pretty callous and unrealistic. He never manages to stay far ahead of Jones, which keeps things taut and our hero constantly on his toes. It's not something I'd rush to see again, but it's a fun, straightforward chase movie that's worth seeing for the 2 lead performances and it's brief bursts of energy.",
            "review_date": "2016-04-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Early 90s movie outing (starring Harrison Ford and Tommy Lee Jones) for an old 60s TV series, that sees Dr Richard Kimble (Ford) framed for the murder of his wife, and on the run to track down the real killer:\n\n\"It wasn't me!  It was the one-armed man!\"\n\nwhile being relentlessly pursued by US Marshal Sam Gerard (Jones).\n\nThis is pretty solid and, while (like the actors) it may have aged a bit, is still an enjoyable way to spend just over 2 hours.",
            "review_date": "2016-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A must see in Ford's filmography.",
            "review_date": "2016-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A huge thrill ride! The Fugitive is a successful example of how to do a chase thriller right with memorable performances by Harrison Ford and Tommy Lee Jones, smart script and a good use of location. Watch this movie now, if you don't like this film.... I don't care!",
            "review_date": "2016-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The one screen face off between Harrison Ford and Tommy Lee Jones powers \"The Fugitive\", a tightly constructed, high stakes standard for modern chase thrillers.",
            "review_date": "2016-02-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Pretty...pretty...pretty...pretty...pretty...pretty good.\nI should've reviewed this movie years ago - \" I don't care\"",
            "review_date": "2016-01-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The fugitive may be one long chase scene, but it's one that's damn good with one of the best action movie stars on screen.  When you see Harrision Ford you just feel like you're watching something special.",
            "review_date": "2016-01-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is what everyone wants from a thriller.",
            "review_date": "2016-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive is a timeless action flick with superb performances from Ford and Jones.",
            "review_date": "2016-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Full with suspense and action then add marvelous performances by both Harrison Ford and Tommy Lee Jones. You will not be disappointed",
            "review_date": "2015-12-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I greatly enjoy this film every time I watch it it! It is a fun thrill ride of a film that keeps you on the edge of your seat. Proud to say that I live right near where it was filmed & I was born the year it came out on St. Patrick's day, when the parade scene takes place!",
            "review_date": "2015-12-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"I don't care\" Tommy Lee Jones response to Harrison Fords character in The Fugitive after Richard Kimble states \"I didn't kill my wife.\"  One of the best quotes in movie history in my eyes.  Which really gives you the overall scope of the picture.  Richard Kimble (Harrison Ford) innocent, but accused of murdering his wife is on the run and Sam Gerard,Tommy Lee Jones is hot on his trail to catch him.  But Gerard does not care about the case, does not care why Kimble is running he just knows he has a job to do and he is going to do everything in his power to do it.  There have been a lot of movies about fugitives on the loose running from the cops, but The Fugitive tops them all.  Both actors in the prime of their careers give outstanding performances.  Jones is flawless as the arrogant U.S. Marshal tracking Kimble's every move.  This movie is beyond thrilling and exciting and will keep you tense and on the edge of your seat the entire time.",
            "review_date": "2015-12-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Love this movie on the edge of my seat the whole time! One of Harrison's Fords best!",
            "review_date": "2015-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Sure, some of the subplots are contrived, but The Fugitive is (in my opinion) the most simultaneously fun and thrilling film of the 90s. It's airtight and sharp as a tack.",
            "review_date": "2015-11-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazing and gripping, keeps you on the edge of your seat!",
            "review_date": "2015-11-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Makes you feel like part of the chase",
            "review_date": "2015-11-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You are as out of breath as Richard Kimble at the end of the movie.",
            "review_date": "2015-11-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive bring to us a lot of thrills and amazing suspense scenes, however the plot its a little confusing because of its coincidences that should have been facts.",
            "review_date": "2015-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive bring to us a lot of thrills and amazing suspense scenes, however the plot its a little confusing because of its coincidences that should have been facts.",
            "review_date": "2015-10-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the very few films derived from a TV show that you're not embarrassed to say that you like.",
            "review_date": "2015-10-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Probably the best Harrison Ford non Star Wars or Indiana Jones movie.",
            "review_date": "2015-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This was one of the best action films I have ever seen! The characters are brilliantly acted and written, the action is breathtaking, and the story and drama are superb. The story stars Harrison Ford playing Dr. Richard Kimble who comes home to find his Wife murdered by a one-armed man, and is blamed for her death and is sentenced to death. A twist of fate occurs however on the way to the death house, as the prison bus gets in an accident, giving Kimble the chance to escape. What really blew me away is how real the characters felt to me. I was at the edge of my seat the whole movie hoping for the main character to succeed. This is a brilliant and enjoyable film and I give it a perfect score of 5/5 stars.",
            "review_date": "2015-09-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Movie night with Iris. \n\nSo glad we stumbled upon this. Hollywood used to churn these out. 2 big stars lock horns, wise-cracking sidekick and loads of action. Proper popcorn film.",
            "review_date": "2015-09-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive is by definition a classic action thriller and is one of the best action movies I have seen. It has great suspense, its exhilarating, and Tommy Lee Jones and Harrison Ford are absolutely magnificent. Ford really makes this movie. I think he makes his character better than it already is.  With great chase scenes and stunt work, The Fugitive is hard to dislike. The way the movie flows is why its so great. It has a well written story line and truly exciting plot.  Its old fashion action atmosphere and feel is what I like a lot about the Fugitive. A great finale seals the cinematic masterpiece and rides off to history.",
            "review_date": "2015-08-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Without a doubt one of the best thrillers ever made! Harrison Ford will always go down as one of the best A-list actors of all time as nobody, but him could have played Richard Kimble, and make all those fight scenes look so real. But the real attraction in this movie is Tommy Lee Jones, who plays the U.S. Marshall out to track Ford's character. Tommy Lee Jones won best supporting actor for his performance in \"The Fugitive,\" and many argue whether or not Leonardo DiCaprio should have won for his performance in \"What's Eating Gilbert Grape,\" and there was a time I would have been on that ban wagon, but after watching \"The Fugitive\" again after not seeing it in years, Tommy lee Jones deserved it hands down. He eats up every scene he is in, and his performance in this movie is the reason why Tommy Lee Jones is my favorite actor right now at the moment.",
            "review_date": "2015-08-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Overrated peace of sh*t",
            "review_date": "2015-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie started all those action cliches.",
            "review_date": "2015-07-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The truth is worth to die for. This hard-striking thriller set in a total realistic landscape, giving us Harrison Ford in one of his best roles of his career. His fight for justice is tough and hard, providing us with a damn entertaining thriller.",
            "review_date": "2015-06-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Without many explosions or choreographed fight scenes, The Fugitive is one of the most sophisticated thrillers I've seen in a long while.",
            "review_date": "2015-06-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The 90s was a really good decade for action films, and this is one of the finest of that era.  The two leads are very different types of characters, who play very well off each other.  The extremely well-paced  plot starts them out as adversaries and gradually brings their interests in alignment in a manner that maximizes suspense.  The supporting cast is superb, featuring veteran character actors like Jeroen Krabbé and Joe Pantoliano, and some rising stars, particularly Julianne Moore is an early prominent role.  Andrew Davis, a reliable action director who helmed career peak films for both Chuck Norris and Steven Seagal, does the best work of his career here, especially on a series of action set pieces that are some of the best of the decade.",
            "review_date": "2015-06-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Before the Bourne and Taken series. There is this one film that really stuck in my mind for years. This is that film. The fugitive is about Dr. Kimble, a man who was framed up for killing his wife. After he was convicted for murder charged as guilty, and everything got intense after that. Harrison Ford is still brilliant as always. I love the chasing scenes, especially Dr. Kimble is a very smart guy, he knows how to hide, from different locations to another. He is in a world of trouble where he can play with it. Special mention to Jeroen Krabbé as the villain and Tommy Lee Jones as the cop for an amazing job portraying their roles. Awesome 90's action that will definitely be remembered. 4/5",
            "review_date": "2015-06-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive isn't only a thriller that makes your heart beat out of your chest. It is also the kind that makes you think. Still, Tommy Lee Jones didn't deserve the Oscar for this film. DiCaprio was robbed.",
            "review_date": "2015-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Starring a Harrison Ford at his absolute best, \"The Fugitive\" is an incredible thrill movie with an equal amount of suspense and fun that is still an enjoyable classic many years later.",
            "review_date": "2015-05-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Haven't seen this movie in years. I should go watch it again. Harrison Ford is one of the best actors in this area of movie making.",
            "review_date": "2015-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorites of Harrison Ford",
            "review_date": "2015-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I always look for more humanistic qualities in a movie than i do SFX. the Fugitive is the perfect example. tommy lee jones is equally perfect as the us marshal bringing him in. The sequel was hurt only b/c it was the same movie.",
            "review_date": "2015-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Fast and furious and never a dull moment.Just a fun filled thrill ride with top notch performances from Jones and Ford.",
            "review_date": "2015-04-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "76%\nSaw this on 4/4/15\nThe reason why this film has such a high rating is as strange as how Tommy Lee Jones ended up with an Oscar for the role from this film. Fugitive is an engaging, energetic thriller that so  happens to be a bit overlong and predictable. Andrew Davis' direction is ordinary or above average to the maximum, just like his work in The Guardian.",
            "review_date": "2015-04-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Of course the film is bolstered by its two magnetic leads but the direction and intensity puts this movie in the category of all time greats.",
            "review_date": "2015-04-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Expertly crafted, consistently thrilling, and often hilarious, \"The Fugitive\" is a prime example of how exactly to construct a thriller film. Jones' performance as a wise-cracking marshall is pitch-perfect and Davis' direction is extraordinary; it's easy to see why it was awarded so heavily.",
            "review_date": "2015-03-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First half is great, but too much movie magic. Very convoluted plot.",
            "review_date": "2015-03-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really goos. 8.3/10. B+.\n\n\nEven if there are logical errors, it's a fast-paced and tense thriller with an intriguing story and fantastic characters realized greatly by the actors.",
            "review_date": "2015-03-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best Hollywood thrillers of all time, with Ford in great form in the title role.",
            "review_date": "2015-03-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Mechanically a perfect chase thriller.",
            "review_date": "2015-03-08",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"The Fugitive\" is a film adapted from a 1960s television series. It tells of Doctor Richard Kimble (Ford) who is accused of murdering his wife and is ruled to be killed by lethal injection. While on a train to the penitentiary, a group of convicts begin to fight around, and eventually Kimble gets free, and starts on a mission to clear his name and figure out who killed his wife.\n\nI really enjoyed \"The Fugitive.\" I thought it was filled with a lot of great action/chase sequences and has some surprising, stellar acting performances by both Harrison Ford and Tommy Lee Jones, who won the 1993 Academy Award for Best Supporting Actor for his role as Sam Gerard. This is a well-crafted movie and one of the best films of 1993. I recommend \"The Fugitive\" to anyone looking for a great 90s film. 8.2/10",
            "review_date": "2015-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intriguing, clever and featuring great performances from Harrison Ford and Tommy Lee Jones.",
            "review_date": "2015-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Before the Bourne and Taken series. There is this one film that really stuck in my mind for years. This is that film. The fugitive is about Dr. Kimble, a man who was framed up for killing his wife. After he was convicted for murder charged as guilty, and everything got intense after that. Harrison Ford is still brilliant as always. I love the chasing scenes, especially Dr. Kimble is a very smart guy, he knows how to hide, from different locations to another. He is in a world of trouble where he can play with it.   Special mention to Jeroen Krabbé as the villain  and Tommy Lee Jones as the cop for an amazing job portraying their roles. Awesome 90's action that will definitely be remembered. 4/5",
            "review_date": "2015-02-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Harrison Ford action film. So good that Taken 3 ripped off its plot.",
            "review_date": "2015-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive is the perfect chase thriller movie. It's very intense and well made. The performances by Harrison Ford and Tommy Lee Jones are great. he movie is perfectly tense in atmosphere, and you really start to care about the wrongly convicted Kimble as he helps other while being hunted. What appears to be a rather simple chase movie gets even better once the plot thickens and Kimble grows closer to the secret behind his wife's murder. It has some great action, intense scenes, and great direction. Perhaps a bit clichéd and a tad overlong, this is an expertly crafted and engaging thriller. The Fugitive gets 4/5 stars (A-).",
            "review_date": "2015-02-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harrison Ford and Tommy Lee Jones are Great in this film.  The movie keeps you interested the whole time and there's not even one minute where you feel bored.  The ending fits nicely with the story and though it's a long movie, it never felt long!  If you haven't seen it, you have to watch this gem from the 90s.",
            "review_date": "2015-01-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tense and smart, The Fugitive works well, thanks in a big way to the two central performances. Full review later.",
            "review_date": "2015-01-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Andrew Davis directs this movie with a strong sense of atmosphere and character. The chase takes the forefront of the plot without the expense of character depth and development. Its a perfectly made thriller with more depth and care than the material requires. Also, come on, that performance from Tommy Lee Jones is nothing short of astounding.\n\nI LOVE this movie!",
            "review_date": "2015-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exciting, thrilling and just an excellent crime drama. Harrison Ford is great, Tommy Lee Jones is excellent.",
            "review_date": "2015-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazingly constructed action movie. The suspense is over the top and the story and it's characters are well developed.",
            "review_date": "2015-01-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing but great things to say. I love this movie and it's mystery threw out the whole film. A true thriller masterpiece, Harrison ford was born to play this role.",
            "review_date": "2015-01-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's been a few years since Harrison Ford's last big action flick.  In that time, Ford seems to have aged so much.  But that sure as heck doesn't mean that Ford's action days are over!  Perhaps one of his best actions films to date, \"The Fugitive\" is an excellent action-thriller.  It is exciting and suspenseful.  It is unpredictable and groundbreaking.  And it is an extremely well-written film.\n\nAlso great are the main characters in \"The Fugitive\".  Harrison Ford, of course, gives an outstanding performance as the fugitive Dr. Richard Kimble.  His character is such a likable guy, and Ford's performance really sells it.  And as great as Ford is, I equally enjoyed the performance of Tommy Lee Jones as Deputy Samuel Gerard.  I especially love Jones's charisma and charm.  It provides nice comedic relief to counterbalance Ford's tragic character.\n\nIt's movies like this that remind me why I love Harrison Ford.  Ford proves that he is still relevant as an action star.  \"The Fugitive\" is one of the best action films I've seen in a while and another success in Ford's career.  It's a definite must-see!",
            "review_date": "2014-12-29",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Thrilling, intense, and suspenseful, Harrison Ford and Tommy Lee Jones powered the movie from beginning to end.",
            "review_date": "2014-11-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An edge-of-your-seat movie with great set pieces and compelling performances. 80/100",
            "review_date": "2014-11-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just great on every level.",
            "review_date": "2014-10-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive had me on the edge of my seat for the entire high-octane, thrilling, smart, and intense ride featuring an unstoppable 2 man ensemble.",
            "review_date": "2014-10-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intense, interesting, exciting and a action thriller gem that should be watched again and again. It's like a sweet that doesn't make you fat or give you cavities you can keep eating it and it tastes just as good as the first time better even :D",
            "review_date": "2014-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I really like the pacing of this one, even though on-the-run cop movies aren't really my thing. Besides, Harrison Ford is great to watch.",
            "review_date": "2014-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "You can literally tell who is the bad guy by the half of it. It was the 90s though, so it was great.",
            "review_date": "2014-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Absolutely love the Fugitive. A perfect blend of action and drama. Harrison Ford!!",
            "review_date": "2014-10-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dr Richard Kimble (Harrison Ford), is wrongly convicted of murdering his wife and is sentenced to death. On his way to jail, a fortuitous accident allows him to escape from the police, and begin an investigation into his wife's murder. While also trying to keep one step ahead of a committed team of US Marshals led by Samuel Gerard, played to Oscar-winning perfection by Tommy Lee Jones.\n\nThe Fugitive arrived in theaters as part of a new trend in Hollywood to create movies based on popular television shows. And why not? A great story premise no matter where it comes from, is probably going to work on the big screen if given to the right people.\n\nSet during a brisk Chicago winter, the 'Windy City' makes for a great backdrop to this tightly written thriller. Each and every second of this production is either developing great characters, or moving the plot forward. Andrew Davis's direction is unfussy and mostly, just the facts ma'am, but he also allows for the occasional theatrics which stops The Fugitive from ever feeling slow or boring. Making great use of James Newton Howard's excellent score to build character, or to add an extra punch to the action.\n\nThe best thing about The Fugitive however, is Harrison Ford. Absolutely convincing as the intelligent and resourceful Dr. Kimble, yet also brings a great vulnerability to the part, as his character mourns the loss of his wife, and runs from the police. Dr Kimble is a man you want to root for. Ford's earnest performance of a wrongly convicted man trying to clear his name, should have even the most cynical moviegoers sweating his troubles, and celebrating his victories!\n\nMovie Prep:\n\nThere's not much else I can add that would prepare you for this film. It's a very solidly made well written thriller, and has two memorable performances from Tommy Lee Jones and Harrison Ford.\n\nBest Format:\n\nThis is film looks great, and would be well serviced on a theater screen or large TV at home.\n\nBest Moment:\n\nIf you ever foolishly doubt the acting talents of Harrison Ford, and think he's only good for bit of swashbuckling fun as Indiana Jones or Han Solo, then watch the scene in this movie where he's being questioned by the police. Watch him slowly get more and more upset as their questions start to insinuate his guilt in the murder of his character's wife, and then tell me he can't act.\n\n\nhttp://talkiegazette.com/the-fugitive-1993/\n\nhttp://facebook.com/talkiegazette\n\nhttp://twitter.com/talkiegazette",
            "review_date": "2014-10-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Dr. Kenzo Tenma & inspector Lunge are at it again!!! Oh wait...",
            "review_date": "2014-09-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This film is one of my all-time favorites. Tommy Lee Jones was gold in this film as well as Harrison Ford. Perfect combination of suspense-thriller and comedy. This film has it all in an all-star cast of talent, a great soundtrack, and perfect writing of the lines and sequences. A must-watch and is worth a buy if you see it at the store.",
            "review_date": "2014-09-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "My all time favorite movie, especially being from Chicago. I have to watch it every time they show it on tv. The director really showed the true Chicago, just takes me back remembering those old cold days in the 90's",
            "review_date": "2014-08-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "First-rate thriller thanks to a perfect cast and superb work by the director & writers.  The cast is excellent, with Ford giving one of his best lead performances as Dr. Richard Kimbell, giving the right mix of compassion & intelligence that you root for him & believe he can stay one step ahead of the authorities.  Jones is brilliant in his Oscar winning turn as Marshal Sam Jarrad, playing him not as a bad guy but just a dedicated law officer trying to catch his man, whether he's guilty or innocent.  Behind the camera, Twohy & Stuart's script is smart & focused on the main story, with nice nods to the TV show (from Kimbell helping others despite the risk of getting caught to Jarrad's growing doubts about his guilt) while Davis keeps the action move with some brilliant set-pieces (the train crash is even more impressive today giving it was done with practical effects).  Not just a great example of how to adapt a TV show to film but one of the best thrillers ever made.",
            "review_date": "2014-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Still an entertaining and memorable film even though it is kind of cheesy.",
            "review_date": "2014-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Top-notch work from Harrison Ford.",
            "review_date": "2014-08-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A rather underrated Harrison Ford flick.",
            "review_date": "2014-08-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie. No doubt about that.",
            "review_date": "2014-08-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of Harrison Fords newest, but obviously one of his tops.",
            "review_date": "2014-08-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic movie, and very well done. If I rated purely by nostalgia and enjoyment, my rating would be a bit higher, but I mostly rate on the technical aspects such as story, acting, visuals and sound, and on those aspects, the movie seems more average. Although my Blu-ray was the older non-remastered version, so perhaps I didn't get the proper experience due to the poorer quality transfer. Regardless it's still a movie I'd recommend to anyone.",
            "review_date": "2014-07-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I can't believe how much goes on in this movie, and how long it is, and yet how it doesn't break under the weight of all things considered. Tommy Lee is superlative.",
            "review_date": "2014-07-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a stunning action movie with a great cast. It had good pacing as well as action sequences and dialog. \n\nP.s. The train crash was an actual train crash!! As in they  set up a coordinated crash that went out of control and could have actually killed someone!",
            "review_date": "2014-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the greatest movies of all time.",
            "review_date": "2014-07-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive is a very impressive piece of filmmaking. Not only is it essentially one big chase, its also one huge condensed TV series that had 120 episodes into a 2 hour film, not only that but it flowed perfectly and was expertly made, it's quite amazing. \n\nWhilst watching it, I was really sucked into the story that was going on, its interesting to see how someone could evade the law enforcement for so long and none of it felt silly or unbelievable. However, there were a few select cases where I did think that if this were real that it would play out a little differently, but this is a film... I just sat back and enjoyed what was going on. \n\nThe effects were quite impressive, it looks like very little of it was created on a computer and helps add to the intensity of what was going on. The music was good also, had a very unique essence to it and fits with the film well. A film using its budget wisely, I like it. \n\nTommy Lee Jones was so strange here, at first it seemed like he was in the wrong film. He was so strangely eccentric, it really stood out, he brought his own kind of humor to it. You can hardly accuse TLJ of ever giving a bad performance, much like Harrison Ford, but he certainly was strange, he is one of the things that this is remembered for and it is what got him his Oscar too, dare I say it? He might overshadow Ford at some points. Also Julianne Moore was here too and took me by surprise at first, I know this is one of her early roles but I was thinking whilst watching this, hey wouldn't it be cool if a really big named actor just showed up randomly for a moment in a film and then it happened. \n\nI can't think of any big negative, I had one very minor complaint before but that wasn't even important and is just me being weird. The film offers a very tense action packed ride that is interesting and exciting, showcases very two strong performances with some very odd humor, most of it courtesy of Mr. Tommy Lee and is just overall a very fun thrill ride that has a good story behind it all. A classic.",
            "review_date": "2014-07-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Numerous elements from the soundtrack to the cinematography reek of 90s action movie cliches, but that isn't to say that The Fugitive doesn't assemble its over-familiar pieces involving corporate conspiracies to frame a single man who is then forced into desperate measures quite well. There are a few very tense moments, though it just isn't exhilarating enough to be worth its reputation.",
            "review_date": "2014-07-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Amazingly good. Harrison Ford and Tommy Lee Jones embodied and perfom their characters in an pleasurable way.",
            "review_date": "2014-06-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all time favorites. A nearly perfect suspense thriller that never fails to keep me entertained.",
            "review_date": "2014-06-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive is a taut thriller with excellent performances by Harrison Ford and Tommy Lee Jones. This is a classic and one of my favorite films.",
            "review_date": "2014-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Extremely entertaining but not at all brainless, this is a unique action movie and will be hard to duplicate",
            "review_date": "2014-05-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An exciting premise is hamstrung by its excessive run time.",
            "review_date": "2014-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Not only the best action-thriller of the 1990's but also one of the most suspenseful action movies ever made. The plot is superb and will keep you entertained and guessing throughout the entire 130 minutes of the movie. Every actor delivers a solid performance from the two main characters played by  Harrison Ford and Tommy Lee Jones to some of the secondary characters characters played by Richard Riehle, Tom Wood, Mike Bacarella, etc.",
            "review_date": "2014-05-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I liked this film well-enough, I guess.  I'm probably still just sore that Tommy Lee Jones beat out Ralph Fiennes for best supporting actor, which might be my pick for biggest snub.  In any event, I still think this film is overrated, even if I do find it enjoyable with a slick sense of humor.",
            "review_date": "2014-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though it's slightly hamstrung by it's convoluted final revelation, the thrilling ride, emotional core and stellar acting more than make up for that.",
            "review_date": "2014-05-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best action thrillers ever. The story isn't that creative, but it's told with the right pace and accompanied by great performances from Harrison Ford and Tommy Lee Jones. Some of its scenes, like the one at the water power station, are really iconic and were revisited in such TV shows like \"Scrubs\" and \"The Simpsons\".",
            "review_date": "2014-05-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic action flick. Harrison ford and tommy lee jones. Need I say more?",
            "review_date": "2014-04-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Based upon the TV series created by Roy Huggins, which ran from 1963 to 1967, this big screen version was directed by Andrew Davies (Under Siege (1992), Chain Reaction (1996) and Holes (2003)) and written by David Twohy (Pitch Black (2000)). This film version manages to capture the spirit of the original series, and it manages to be a great thriller getting the balance just right. Dr. Richard Kimble (Harrison Ford) comes home to find his wife Helen (Sela Ward) being beaten by a one-armed man, and due to a misunderstood phone call, Kimble is sentenced to death. On the way to death row, other prisoners on the bus stage attempt to escape. In the confusion, a train crashes into the bus, but not before Kimble is able to escape. But it's not long before Deputy U.S. Marshal Samuel Gerard (Tommy Lee Jones) is hot on his tail. But, Kimble uses his escape to try and find who framed him for the murder, with help from his old friend Dr. Charles Nichols (Jeroen Krabbé), Kimble goes undercover to find who the one-armed man was. It is a very suspenseful film, and it was one of the few examples of a film version of a classic TV show making a successful transition, it has a very good cast, Jones won an Oscar for his role as the sharp and unstoppable U.S. Marshal, who would return in a sequel called U.S. Marshals 5 years later.",
            "review_date": "2014-04-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Though it rests on an overdone concept, Harrison Ford and Tommy Lee Jones add an interesting layer of depth and intrigue to this thriller.",
            "review_date": "2014-04-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Stuff of legend. If you don't like this movie, I punch you right in the kisser.",
            "review_date": "2014-04-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great Harrison Ford movie with a good cat-and-mouse chase premise. The story was fun but more of a medical mystery than a vicious man hunt for the wrong person. I thoroughly enjoyed it.",
            "review_date": "2014-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Gotta love this movie. Great story, great acting. This movie just kicks ass!",
            "review_date": "2014-03-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best Harrison Ford movies hands down!",
            "review_date": "2014-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What can you say about this movie other than its excellent.  What makes it good is Jones and Ford and their contrasting personalities.  It's a strict cat and mouse game with Ford being framed for his Wife's murder. Jones determination to catching him is fun to watch and you wonder what he will do next to get away. The cat and mouse game keeps you intrigued til the end with memorable scenes like the dam jumping scene and the hospital scene. The direction is smooth and slick, and Jones absolute determination is fun to watch.  He doesn't care that he could be innocent;  All he cares about is catching him.",
            "review_date": "2014-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "5/5 * \nOne of the most effective thrillers that's exhilarating, gripping,and violent at times. Harrison Ford gives one of his best performances. The Fugitive is an extremely effective thriller.",
            "review_date": "2014-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive is one of the best Harrison Ford movies, as well as definitely being on my Top 20 list. This movie is smart, and suspense and good performances make this movie. The way it moves from shot to shot and Dr. Kimble's quick thinking create a very intriguing movie. Watch it, and you'll see what I mean.",
            "review_date": "2014-03-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "the greatest action movie ever! I can watch the fugitive over and over again and I will still love it",
            "review_date": "2014-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. It kept me engaged and on the edge of my sit the entire time.",
            "review_date": "2014-02-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tommy Lee Jones was made for the role of U.S. marshal Sam Gerard.",
            "review_date": "2014-02-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best murder-mystery thriller movies you'll ever see.",
            "review_date": "2014-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Something great for people who haven't seen it. Something great for people who've already seen it. The Fugitive is a true classic, one that doesn't really stick with you, but never let's you forget how great it was either.",
            "review_date": "2014-02-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fast intense thrill ride that includes edge of your seat suspense, amazing dialogue, and plenty of action and chases.",
            "review_date": "2014-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An amazingly talented director, screenwriter and cast, (especially Ford) transform what should have been a mediocre remake of a TV show into a taut, Oscar caliber thriller with a plethora of subtext. Brilliant filmmaking.",
            "review_date": "2014-01-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Classic and ideal thriller based off of the TV series of the same name.",
            "review_date": "2014-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good to watch every 20 years",
            "review_date": "2014-01-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Exciting and smart. Although for most you have to watch it twice to get everything that happened.",
            "review_date": "2014-01-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harrison Ford does excellent job in this movie",
            "review_date": "2014-01-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Richard Kimble (Harrison Ford) is a former doctor who is accused of killing his wife and is now a fugitive on the run. In pursuit is the police led by US Marshall played by Tommy Lee Jones. Of course not only is he in pursuit of Kimble, he is also trying to learn more about the case of the killer of Kimble's wife. This film is sort of a chase thriller as well as a an investigation thriller. For the most part, the pace is pretty fast. It may slow down a little bit here and there, but the intensity and suspense isa still there. Overall, this film is very exciting and includes two phenomenal actor in Ford and Jones at perhaps their best. This movie is very easy for me to recommend. Just saying that it's a chaser thriller with Harrison Ford and Tommy Lee Jones should be enough to draw people in. Then when you watch it, it certainly lives up to its potential. This film is great fun and excitement.",
            "review_date": "2014-01-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Arguably one of the best movies ever made. Harrison fords best movie. A classic that I never get tired of watching. The best fugitive movie ever.",
            "review_date": "2013-12-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A truly exciting action thriller. With straight-up accuracy to the series, Harrison Ford keeps the film's kind-of slow pace very interesting to watch with his performance, and Tommy Lee Jones provides such a compelling performance as a US marshal that he did not completely execute in U.S. Marshalls. The Fugitive is a high-impact and superbly brilliant action\\chase thriller.",
            "review_date": "2013-12-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie. Jones and Ford make a great combination. This is one of those movies I can watch over and over again.",
            "review_date": "2013-12-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "how did this not win best picture.  wow.  I loves this action packed thriller.  absolutely amazing",
            "review_date": "2013-12-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good chase actionn pic well done",
            "review_date": "2013-11-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best thrillers out there.",
            "review_date": "2013-11-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "High-octane, thrilling, and smart, this perhaps one of the most well-acted and well-paced action/crime thrillers to ever hit a screen! And don't even think about refilling your popcorn... Cause you'll never stop clenching your chair!",
            "review_date": "2013-11-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "St Patrick's Day always makes me want to watch The Fugitive.  Also, the drug company element is unexpected and compelling.",
            "review_date": "2013-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Intense and exciting A great story and great performances. I loved it.",
            "review_date": "2013-11-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A lot of movies try to replicate this plot but very few of them are able to capture the level of action, suspense,  and acting as The Fugitive. They even sprinkle in a touch of humor here and there for a timeless action flick.",
            "review_date": "2013-11-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Really liked this film.\nLots of action scenes.\nGood storyline, wasn't expecting it.",
            "review_date": "2013-11-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "For a film over 20 years old this has aged surprisingly well, mostly thanks to the amazing efforts by the star studded cast. Timeless action thriller.",
            "review_date": "2013-10-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "When Director Andrew Davis (Under Siege, The Package and Holes) directed The Fugitive, Harrison Ford and Tommy Lee Jones were at the top of their game. You did have Joe Pantoliano, Sela Ward, Jeroen Krabbé (Who?) and even Julianne Moore (surprise, surprise that too in a 3 minute role) add to the flavor - so you can imagine how old this movie was. At that time, the movie was a smashing success. However, when you look at it today, you may not get the same feeling.\nThough the storyline is pretty good and the direction of the movie is quite thrilling, certain scenes of the movie come to question:\n1. Harrison Fords incredible jump of nearly 300 meter high into the waters - and still surviving it\n2. The Entire Police Force not being able to corner one simple doctor?\n3. The manner in which Harrison Ford uncovers the mystery of the murder\n4. The Improbable nature of how the movie ended.\n\nWhile you may think these are very small bits to the movie - they actually make you laugh with disbelief and hence make you disconnect from the character, the plot and the movie.\n\nSo Moment of Truth\nAn Entertaining Movie that is good enough for a single watch. It still does have its charm. Especially the Train Crash Scene - which to be honest, I still cannot for the life of me understand what was the point of having it in the movie???\n\nOverall Ratings\n6 out of 10\n\nLoy Machedo\nloymachedo dot com | whoisloymachedo dot com",
            "review_date": "2013-09-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Lazy police work starts this film with a point of reality that grows into a well paced chase.  Harrison and Tommy complement each other well and give thorough account for their parts.  The thrill and suspense continue to the end. Nibbles: Three Cheese Alfredo Mayhem.",
            "review_date": "2013-09-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "NEVER A DULL MOMENT . . . what with SIX EDITORS how could there be.  Editing is about 90 percent of ANY film's success.",
            "review_date": "2013-09-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harrison Ford and Tommy Lee Jones are like a perfect match here. The plot flowed quite nicely, keeping you on your toes like Mr. Kimble. This is a film I could watch over and over.",
            "review_date": "2013-09-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive is a smart, fast-paced, and intensely exciting action thriller that benefits from Harrison Ford's authentic central performance, and continues to be an exemplary for edge-of-your-seat filmmaking.",
            "review_date": "2013-09-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Kind of hard to image this came out 20 years ago. Anyways, Harrison Ford is a doctor falsely accused of murdering his wife, while being transported to prison, a riot breaks out and the bus goes off the road. Another inmate steals the keys and they are able to remove their shackles. Tommy Lee Jones comes in and begins a manhunt for him. The first half of the film is good, with lots of action and edge of the seat thrills. Then the second half comes in and tries to explain how he was convicted. It just isn't believable all these years later and really takes away from an otherwise solid film. Still good, but has lost a bit of shine through the years.",
            "review_date": "2013-09-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Riveting, stirring, and intense, The Fugitive is an exhilarating chase thriller packed with dynamic action sequences and effective suspense!",
            "review_date": "2013-08-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This a thrilling piece that is suspenseful until the end.",
            "review_date": "2013-08-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite action films not counting Jason Bourne or Terminator",
            "review_date": "2013-08-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Frenetic and Intense from beginning to end, \"The Fugitive\" is strongly played by two excellent stars: Harrison Ford and Tommy Lee Jones.",
            "review_date": "2013-08-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A great action film that never makes bargains.",
            "review_date": "2013-07-31",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This one is truly amazing, watching the best thriller movie with the chase of the serial killer around in Chicago",
            "review_date": "2013-07-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Completely by-the-book, but it gets everything right and is remarkably watchable.",
            "review_date": "2013-07-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harrison Ford's best movie, in my opinion.",
            "review_date": "2013-07-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all time favorites. A tense, claustrophobic thriller with an impressive sense of humor and a terrific performance from Tommy Lee Jones. Perfect use of Chicago locations (although \"Balbo Station\" does not really exist).",
            "review_date": "2013-07-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great movie, hasnt aged except Harrison Ford. Was on 4 times over the weekend, never got bored of it hence the 4 stars :)",
            "review_date": "2013-07-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Just when I was feeling burnt out on action movies I found this gem. Great performances all around.",
            "review_date": "2013-07-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An instant classic! What every you do don't drink too much during the movie you'll never want it to stop!",
            "review_date": "2013-07-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "DR. Jones is on the run",
            "review_date": "2013-07-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Great film with mystery and suspense",
            "review_date": "2013-06-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies of all time.",
            "review_date": "2013-06-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Grade - A+\nOne of my personal all-time favourites, 'The Fugitive' has everything, with stunning performances (especially by Tommy Lee Jones) and a great story-line.",
            "review_date": "2013-06-15",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "After Star Wars and Blade Runner; Harrison Ford leads an amazing performance in this exceptional thriller.",
            "review_date": "2013-06-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the best Harrison ford films he has done. Also u have to love tommy lee jones his character is perfect.",
            "review_date": "2013-06-09",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is the movie that was based on the classic TV series, about a doctor who is falsely accused and convicted of killing his wife.  He escapes and searches for a one-armed man who was the real killer.  The Doctor, Richard Kimble, is played perfectly by the great Harrison Ford, who should have received an Oscar for this role, but of course never received one, although the movies he has starred in have grossed more dollars than any other actor or actress.  Tommy Lee Jones played Lieutenant Gerard, who chased Kimble, and this was a breakthrough role for Jones, who played starring roles after this movie, after a career of playing villains.  This is a riveting, compelling, entertaining thriller.",
            "review_date": "2013-05-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Outstanding performances by both lead roles and one of the most well executed \"chase\" movies ever to be made.",
            "review_date": "2013-05-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive has its plot pulled out of an 80s TV show with credible success. I don't know if the fans of the original series liked it, but I did.\n\nThe good. Captivating story. Well built scenario and characters resulting in a nice intrigue. Gripping pace that won't let you down and give you only a few pauses. Solid action and acting.\n\nThe actors. Commendable work by Harrison Ford and Tommy Lee Jones.\n\nThe bad. Lee Jones' character and actions as well as his whole work structure are a bit over the top.\n\nThe ugly. Nothing.\n\nThe result. If you like intrigue, Ford, Lee Jones, or a story about a guy trying to clear his name, it's definitely for you. If you like action, you'll also find your entertainment. There's even a bit of romance and a cap on the violence so the ladies might find their own too.",
            "review_date": "2013-05-20",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome movie, one of Harrison Ford's best performances.",
            "review_date": "2013-05-14",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "What a pace, what a movie.",
            "review_date": "2013-05-10",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome! Saw this at the Kabuki today at the Harrison Ford event. Stood the test of time.",
            "review_date": "2013-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "one of my favourites",
            "review_date": "2013-05-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Can't exactly say action films can ever become like what you'll get from \"The Fugitive\".",
            "review_date": "2013-05-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the few 90's trillers that really hit the spot. It succeeds in engaging the audience in this race between Harrison Ford and Tommy Lee Jones.",
            "review_date": "2013-05-01",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Possibly one the best movies of all time.",
            "review_date": "2013-04-27",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive does so many different emotions and tones near perfectly.  The story is incredible and truly mysterious.  Ford and Jones are great, as well the whole cast is.  The Fugitive is a rare film in where many tones and genres are juggled at once and still plays out well without turning into an absolute mess.",
            "review_date": "2013-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome film. I loved the film, the story was awesome, the style was awesome, Harrison was awesome so was the entertainment it provided. I nothing short of loved the film. Really recommended.",
            "review_date": "2013-04-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Need to see it again.",
            "review_date": "2013-04-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "really well done movie, lived up to the need to re-invent the old series....",
            "review_date": "2013-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Decent enough remake - considering they squeezed a 4 year heroic TV series into a 2 hour \"save my ass\" adventure.",
            "review_date": "2013-04-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harrison Ford goes on the run from the law he tries to proves his innocence in this well made thriller.",
            "review_date": "2013-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun, chase movie with a lot of twists and turns. Tommy Lee Jones stole the spotlight.",
            "review_date": "2013-04-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very taught thriller with good acting.",
            "review_date": "2013-04-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Impossible to understate the universal appeal in this gripping crime drama that has wit, charm and heroics all playing along with Tommy Lee Jones' relentless pursuit of Harrison Ford. A cinematic achievement that is hard to resist.",
            "review_date": "2013-04-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies of all time :)",
            "review_date": "2013-04-11",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a total A+ adventure type film. Harrison Ford who plays a well known surgeon is framed for the murder of his wife and is sent to prison. He then escapes and tries to find the one who did kill her. Mean-while Tommy Lee Jones plays an officer out to hunt him. The chase goes on and on. It's totally an enjoyable film. Predictable though because deep down you know he didn't kill his wife. A total must see. My grade=95%(A)",
            "review_date": "2013-03-26",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive could be the best movie made from a TV show as well as one of the best cat and mouse chase thrillers. Chicago was utilized awesomely as well.",
            "review_date": "2013-03-19",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive stands for solid filmmaking at its best, using the chase thriller formula that has been seen in numerous films, but always letting it unravel at a careful steady and frantic pace. It's a thrilling film with intense performances by Harrison Ford and Tommy Lee Jones.",
            "review_date": "2013-03-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Good performance by Tommy Lee Jones and Harrison Ford, fast-paced, well-written, well-cast, all-around good movie. Got it on VHS. What.",
            "review_date": "2013-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A very interesting, intense and entertaining movie that will keep you on the edge of your seat many times!",
            "review_date": "2013-03-13",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive is awesome. It has plenty of action and thrills that are iconic of a Harrison Ford film from the early 90's era.\nThe Fugitive is packed with great action and an excellent level of thrills, and a great constant feel of intensity throughout the many plot dynamics which are really epic.\nAnd Harrison Ford plays a great lead role, giving his character realistic emotional sense to motives and intensity to his actions and providing a strong character for the film to follow, rather than just another action hero.\nTommy Lee Jones gives one of his greatest performances in the supporting role of a relentless US Marshal and makes him a strong hero with villainous tendencies, which really contributes complexity to his character. Tommy Lee Jones provides a great feel of futility to the atmosphere of The Fugitive and so it makes the story all the more compelling.\n\nI can't say I've ever seen the original TV Show The Fugitive, but I'm sure that a film this good is an honour to it on so many levels. A large portion of the praise can be attributed to the directional skills of Andrew Davis who is primarily known for action films and therefore knows how to handle proper explosions and gunfire in an action sequence, and this time around even manages to add some depth and realism to such a strong story of a wrongful convict. The Fugitive is a classic action thriller that isn't overshadowed by the actions, but rather the plot dynamics.\nThe Fugitive also features great cinematography, skilled film editing and an intense musical score. So All in all, The Fugitive is an above-average action thriller film to add to Harrison Ford and Tommy Lee Jones' lists of awesome features.",
            "review_date": "2013-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A classic police chase that makes full use of the formula to become the new industry standard. Great performances and a perfect pace make The Fugitive a sight to behold.",
            "review_date": "2013-03-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "I have seen numerous remakes of classic television series for the Big Screen over the years. Most of them make fun of the original TV series, and many just flop. \"The Fugitive\" is easily one of the best Big Screen remakes of a classic TV series to date, if not the best in general. \r\n\r\nVascular surgeon, \"Dr. Richard Kimball\" (Harrison Ford) is arrested, tried and wrongly convicted for the murder of his wife (Sela Ward, seen in flashbacks) and sentenced to death. \r\n\r\nSome time after being sent to prison, \"Dr. Kimball\" and other prisoners are being transported to another prison by bus. Minutes pass, and one of the prisoners appears to be having a seizure, making the bus driver stop. As the guards check on the prisoner, a train's horn can be heard coming closer. Suddenly, the bus is hit by the train, killing many, while surviving prisoners escape. One of the survivors is \"Dr. Kimball,\" who pulls a seriously injured guard from the wreck before running. \r\n\r\nThe next day, \"US Deputy Marshal Samuel 'Big Dog' Gerard\" (Tommy Lee Jones) and his team come to the scene of the wreck and discovers that \"Dr. Kimball\" had survived, and begins to go after him. \r\n\r\n\"Deputy Gerard\" expects that he is after a convicted murder, but soon learns the truth of \"Dr. Kimball's\" case by piecing together clues he finds while on the fugitive's trail about the same time \"Dr. Kimball\" himself is finding clues leading to the same conclusion -- and his innocence. \r\n\r\nThe first thing you will notice is that is lots of action and great acting from the main cast. When it comes to the action, the scenes are edited well together, and are spread apart enough so that you will get some time to breathe. \r\n\r\nThe next thing you will notice is that the movie, as a whole, is written nicely. There are a few times where the script lags, but there isn't that much lagging. The story is compelling, and you cheer \"Dr. Kimball\" and \"Deputy Gerard\" pretty much equally. \r\n\r\nThe movie is nicely edited, and shot. Scenes that stand out are action and fight scenes. You will also like the scenes where \"Deputy Gerard\" and his team are close to capturing their fugitive. The scenes are filled with suspense just as much as action. \r\n\r\nThere is a little problem with character development with the supporting cast. Most notably \"Deputy Gerard's\" team and a few villains. But these flaws are forgettable thanks to the story itself. \r\n\r\nIn my opinion, \"The Fugitive\" is not only a great movie to watch on HBO or Encore, it is also a great selection for a first-choice the next time you go to your local video rental store as well as a good addition to your collection.",
            "review_date": "2013-03-07",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Solid thriller that never let's up",
            "review_date": "2013-03-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Tommy Lee Jones was great in this film",
            "review_date": "2013-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The Fugitive is most likely the most recognizable film that Schindler's List tossed aside while cruising to its Best Picture win, as well as being the recipient of the Oscar that probably should have gone to Ralph Fiennes's mesmerizing Amon Goeth of the same movie (even though Tommy Lee Jones was fantastic in this). Going with that, this movie must be very good. And good it is, perhaps even great, but it is not the king of thrillers of the last 20 years that people may say.\r\n\r\nThe biggest problem I have with the Fugitive is simply that I feel it is slightly long. Its premise and plot is intriguing, but not in depth enough to handle a run time of this caliber. Take off twenty minutes or so, and you've got a fast, breathless thriller that runs smoothly. Instead, the 130 minutes it stands up to makes you feel a little worn out by the end, and not in the good way that it should. \r\n\r\nOther than that, this is an entertaining chase flick. Harrison Ford does his usual action hero thing and Jones is, as I said, fantastic. Besides those two leading the acting charge, there's really nobody else to stand out. Julianne Moore does less than her character does in the movie, and Jorean Krabbe, once a mediocre Bond villain, makes for a mediocre role here as well. However, Ford's and Jones's presence are more than enough to make up for any shortcomings from their screen companions. In addition, the action scenes are well shot and succeed in giving the film some momentum when things get dull during the length. \r\n\r\nWhile not one of the most incredible thrillers out there, and perhaps not worthy of a Best Picture nomination, The Fugitive does its job to entertain you, even if the length may not keep things movie quite as fast as it should. \r\n\r\n\"I didn't kill my wife!\"\r\n\"I don't care!\"",
            "review_date": "2013-03-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "A fun and intense ride, but what makes this film successful is the determination between both main characters, making The Fugitive an instant favorite among most Harrison Ford fans.",
            "review_date": "2013-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Nothing is more thrilling to see than two characters with superior intelligence, pitting their wits against each other. A thriller does not require a great deal of plot or techno-babble to be involving or complex, although many distributors of blockbusters today seem to think so. For these reasons, \"The Fugitive\" is a huge blessing for a movie critic such as I. I was just thrilled by the excitement, the performances by Harrison Ford and Tommy Lee Jones, and the whole Hitchcockian aura that this sensational film delivered.",
            "review_date": "2013-02-25",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my favorite movies of all time! Action-packed and fun, this thing is also one of the most well-structured films I've ever seen. Also, gotta love the chemistry between Ford and Jones!",
            "review_date": "2013-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of my all time favorites.",
            "review_date": "2013-02-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harrison Ford -so calm no need of any dialogues for him ....one of the finest chase movies",
            "review_date": "2013-02-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Okay film but the only Great acting was tommy lee jones that is why he won a Oscar for it",
            "review_date": "2013-02-21",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "One of the few, decent tv show adaptations and the best of all time.",
            "review_date": "2013-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Such an awesome action thriller! A",
            "review_date": "2013-02-18",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Some humorous moments from Tommy lightens the mood occasionally on a very enjoyable thriller",
            "review_date": "2013-02-16",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Why don't I ever get tired of watching this movie... I act like I've never seen it before.",
            "review_date": "2013-02-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Every time Mom sees Harrison Ford she says ,is that the doctor?",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harrison Ford in his prime; one of the greatest action flicks of the early 90s.  Still holds its own today.",
            "review_date": "2013-02-06",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This movie is a very exciting chase and thriller movie. Harrison Ford and Tommy Lee Jones do an amazing job in this movie. I recommend checking it out. It isn't the greatest thriller movie ever, but it is a very exciting movie that is fun to watch.",
            "review_date": "2013-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"I didn't kill my wife...I don't care!\"  Tommy-Lee what has happened to you?",
            "review_date": "2013-02-05",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "They defined the genre with this film. All-star performances from all and a killer, original plot to boot. I never get sick of seeing it. (Plus, the woman Richard rents a room from speaks Polish!)",
            "review_date": "2013-02-02",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Harrison Ford. That is all.",
            "review_date": "2013-01-28",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "This is a great movie.  An Action packed, cat and mouse game.  This movie also introduces the character Sam Gerard.  Who has made other US Marshal movies that are equally good. Tommy Lee Jones, and Harrison Ford. Are great.  Check it out!",
            "review_date": "2013-01-24",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "It's difficult to not like this movie. Unusually intelligent.  Excellent performanes from Ford and Jones. Story moves along like a locomotive.",
            "review_date": "2013-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Very thrilling. Slightly disappointing end, but the overall body makes up for that.",
            "review_date": "2013-01-23",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "\"I DIDN'T HATE THIS MOVIE! .... OR KILL MY WIFE!\"",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "id be pissed and do what he did if i was falsly accused of killing my spouse!",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "The second best Chicago movie ever made. Fantastic. Flawless.",
            "review_date": "2013-01-22",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Excellent movie Ford and Jones at their best",
            "review_date": "2013-01-17",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "An exciting thriller about a framed man running from the authorities and trying to bring down the true perpetrator.",
            "review_date": "2013-01-12",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "good movie, classic crash scene",
            "review_date": "2013-01-04",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Certain people in the Hollywood industry are undeniably cool. Harrison Ford and Tommy Lee Jones are both firmly entrenched in that group of performers, and they both put on a brilliant show here.\n\nThe highlight, is of course, Tommy Lee Jones' Oscar-winning portrayal of the Deputy Marshall, playing it with such an attitude that he becomes both dour and funny simultaneously (a trait he would later use to great effect as Agent K in \"Men in Black\")\n\nBut Harrison Ford evokes the sympathy of the viewer, as the framed Dr. Kimble, and it's his story that quite fairly drags us into the story.\n\nThe action is inspired (particularly a crash between a train and a bus) and when I saw the director, I couldn't believe this fantastic action film came from a man known for Steven Seagal drivel. \n\nAmazing what a good cast can do, eh?",
            "review_date": "2013-01-03",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome story always action packed and come on its Harrison Ford.",
            "review_date": "2012-12-30",
            "source": "rt",
            "lang": "en"
        },
        {
            "content": "Awesome story always action packed and come on its Harrison Ford.",
            "review_date": "2012-12-30",
            "source": "rt",
            "lang": "en"
        }
    ]
}