{
    "rating": 9.3,
    "release_date": "1993-12-03",
    "num_reviews": 190,
    "genres": [
        "Drama"
    ],
    "summary": "Julie (Juliette Binoche) is haunted by her grief after living through a tragic auto wreck that claimed the life of her composer husband and young daughter. Her initial reaction is to withdraw from her relationships, lock herself in her apartment and suppress her pain. But avoiding human interactions on the bustling streets of Paris proves impossible, and she eventually meets up with Olivier (Benoît Régent), an old friend who harbors a secret love for her, and who could draw her back to reality.",
    "reviews": [
        {
            "content": "Kieslowski's masterpiece. It tears you apart. It's unbelievable how he can portray emotions and feelings on screen. No need for words, just images, acting, and music.",
            "review_date": "2022-12-18",
            "source": "rt"
        },
        {
            "content": "I love this movie, it's my favourite of all time.\n\nBeing on the search for good movies I often find myself watching terrible movies I end up disliking, but at the end of it a bad movie or two, this one is so refreshing to come back to and \"cleanse my palette\".",
            "review_date": "2022-10-08",
            "source": "rt"
        },
        {
            "content": "This is a film about death - well, to be more precise, life, death and love. Its a sad film and also poignant. It has a somewhat haunting feel to it in a sense. Juliette Binchoce gives a brilliant performance too, as the main character, Julie Vignon - a vulnerable and fragile person who I felt it was easy to feel sorry for. I quite liked that the colour blue is featured, not just in the title of the film (obviously) but also in numerous scenes, there are either blue coloured items present or the lighting has a blue tinge, which isn't entirely obvious right away but once you do notice it, it did seem rather clever I felt. I suppose its a somewhat arty film in a respect but I certainly didn't feel like it was being, or attempting to be, pretentious.\n\nIn the film, there's mention of 'The unification of Europe' which seems more than a little ironic these days given the dreaded B word in British politics (Brexit) but hey-ho. Overall this is a good piece of world cinema, its surprisingly moving and I would recommend it to others.",
            "review_date": "2022-09-01",
            "source": "rt"
        },
        {
            "content": "I'd love to say this film captivated me but despite a reasonable premise and some good plot points, it never caught fire and ended a stupidly as French films often do.",
            "review_date": "2022-07-10",
            "source": "rt"
        },
        {
            "content": "Instead of saying which is the best and worst (though have often heard 'Red' cited best and 'White' the weakest, though all three films are generally very highly thought of) of Krzysztof Kieslowski's \"Three Colours\" trilogy, it will just be said that all three films in the trilogy are must-watches in their own way.\n\nThe first film in the trilogy 'Three Colours: Blue' serves as a very poignant exploration of grief and liberty (in the emotional sense), and to me it is one of the most moving and interesting depictions of grief and liberty in film. It is heavily symbolic, with its intricate use of music, the dominant use of the colour blue in the colour palette, its interesting use of fade outs (though actually different to their usual use, representative of time standing still rather than it passing or a scene conclusion), links to the main character's past (here the use of falling) and the bottle recycling, but not in an incoherent sense.\n\nVisually, 'Three Colours: Blue' looks stunning. The whole film is shot with aesthetic grace and elegance and while the use of blue is dominant for symbolic reasons it is never gimmicky or cheap. Kieslowski's direction is thoughtful and never intrusive, and the intricate music score and the symbolic way it's utilised (representing Julie's struggles with isolation) is inspired, \"Song for the Unification of Europe\" is one of the most emotional tracks of music in any film seen by me recently.\n\nStory-wise, 'Three Colours: Blue' challenges in a way but also always engages, mainly because of how movingly and intensely it deals with the tragic story of Julie and its themes of grief and liberty. The pacing is deliberate but never hits a dull spot.\n\nOne of 'Three Colours: Blue' is the astonishing performance from Juliette Binoche, an intensely affecting portrayal that ranks high up with her best performances. All the cast are fine, particularly Benoît Régent and Emmanuelle Riva, but in the acting stakes this is Binoche's film.\n\nAll in all, a beautiful, thought-provoking and moving film, and a wonderful start for a very interesting trilogy of films. 10/10 Bethany Cox",
            "review_date": "2022-06-04",
            "source": "rt"
        },
        {
            "content": "(French with subtitles.) This was okay.",
            "review_date": "2022-04-01",
            "source": "rt"
        },
        {
            "content": "No hay mejor dupla que la de Kieslowski con Zbigniew Preisner, bueno si hay muchas pero esta te toca y te trastoca, el azul es una constante bellamente sútil, además vemos a Binoche potentísima. Yo siempre he visto esta peli como un viaje hacia la maternidad desde la óptica no romántica de la misma, solo Kieslowski tiene este poder de retratar un drama terrible con una sutiliza mágica sin ser poética y metáforica, inteligente sin ser pretenciosa, pienso en Kieslowski y pienso es una estola de seda que se mueve a través del tiempo.  Nota: Esta fue una de mis primeras películas de Muestra Internacional, la xxvii, la vi en El Chopo y agradezco a mis profes de la prepa nos hayan impulsado a este viaje maravilloso de la cinematografía que aun no termina...",
            "review_date": "2022-03-15",
            "source": "rt"
        },
        {
            "content": "OMG it's so beautiful it's so beautiful while I'm watching I keep thinking woooooooooow this is sooooooooo beautiful. Now I'm looking forward to watch white and red omg I love it so much but I don't wanna watch them quickly so I have to wait a few days before watching the next one but I can't wait omg omg omg omg",
            "review_date": "2022-02-12",
            "source": "rt"
        },
        {
            "content": "\"Now I have only one thing left to do: nothing. I don't want any belongings, any memories. No friends, no love. Those are all traps\"\n+\n\"…but have not love, I am nothing.\"\n\nIt is funny rewatching this film during a time where I am experiencing current loss in my life. It almost seems as if I'm grieving with our character Julie. Three Colors: Blue is easily a perfect film, filled with so much beauty in so much pain. Obviously, such as the title states, Kieslowski utilizes and plays with color as his main format. We humans have all felt \"blue.\" Being one those people who look at the intricate details, I noticed and loved where the color blue appears in the tiniest of places. A blue trash bag in between two white ones when Julie throws her husband's sheet music in the garbage truck. Olivier's blue folder that makes an appearance in his hands in more the beginning of the film. Even in the dimmest of lighting, the color's presence is made known. Blue is everywhere because sadness follows us everywhere. Sadness is sadly a part of life.\n\nThose two quotes written in the beginning of this review has significant impact, at least in my perspective. When we go into the stages of grief after tragedy, life stops and we cannot fathom recovery. We start to view life differently and distance ourselves from everyone and everything. We no longer want to experience the good things in life because we see the glass half empty; time is borrowed and nothing is forever, making it better to not get attached and care at all. Yet, we may not see it now, but we will overcome these extremely hard times, especially when we least expect it. We soon come back to ourselves, our want to live, our want to experience all of life's gifts, and our want to love.",
            "review_date": "2021-08-30",
            "source": "rt"
        },
        {
            "content": "Two tempting routes instantly manifest themselves for us after losing a loved one: wallowing in sadness forever and detaching oneself from life while being very much alive. Neither of them makes a logical sense. Logic aside, however, neither can spare us such an inexorable phase or get us out of it miraculously. Julie seems to have veered into the latter route in order to evade slipping down the abyss of the former. But grief must take its natural course, and suppressing it would result in truly dire circumstances at their worst scenario would be being imprisoned by depression, shrouding us metaphorically until a shroud takes its place quite literally.\n\n\"Now I have only one thing left to do: nothing. I don't want any belongings, any memories. No friends, no love. Those are all traps.\"\n\nKieślowski incessantly tries to save her from such fate and draw her back to life once again. His camera lingers in extreme close-ups on Juliette Binoche's features to draw out of them a smidgen of the sadness Julie does her utmost to bury inside herself. Later on as Julie keeps pushing grief away in her quest of severing herself from the past, she finds herself drawn back to it as memories surround her everywhere and no matter how hard she tries to escape them. When she returns back to her home for the first time after the accident that cost the lives of her husband (a renowned music composer) and her daughter, she asks the gardener if he has emptied the \"blue\" bedroom, which implies her trying of getting rid of the past. She goes upstairs only to find a \"blue\"-beaded chandelier, that's likely belonged to her daughter, hanging over her, just like her memories of her daughter. Julie's journey of liberating herself, in one sense, from her past life becomes impeded with reminders of her two dears she lost. Furthermore, Julie's incomplete grief begets anger and irritability that put her mental state at stake. And as memories relentlessly haunt her, she ends up surrendering to them, literally having her head under (blue)water. However, blue gradually begins to mutate its symbolic significance as liberation takes on a totally different definition in Julie's mind. It's here where Zbigniew Preisner's score blossoms into a salvaging tool. There's one scene, in particular, that I found fascinating where Julie and her husband's colleague trying to complete her husband's unfinished manuscript. The shot is pulled out of focus until it becomes almost utterly blurred, forcing the viewer to hear the music playing inside of their heads as they orchestrate parts of it. It's still a liberation of the past, but one of letting go of it while maintaining, nay cherishing its memories instead of eliminating them. A liberation that thrives on a catharsis for all of Julie's repressed painful feelings, bringing forth her deepest sobs and setting her free.",
            "review_date": "2021-05-24",
            "source": "rt"
        },
        {
            "content": "\"Three Colors: Blue\" is a technically and emotionally beautiful movie about a realistic tragedy. This movie is a quieter and more honest look at a character facing grief. People cope with events like this in different ways, and this movie never really feels like a movie. It is a very artsy movie that uses the actual color of blue to set the right tone and also for some visually impressive moments. Sometimes the movie isn't the most eventful, but it works since it is a slice-of-life movie. Overall, it is an artistic and honest look at grief and loss, and I think people who appreciate the film on a technical level will find plenty to appreciate in it.",
            "review_date": "2021-04-14",
            "source": "rt"
        },
        {
            "content": "Feels like a narrative designed for a short film was stretched out to make this well-acted feature film that serves as the first pillar of a trilogy although there is some lovely cinematography to behold.",
            "review_date": "2021-03-01",
            "source": "rt"
        },
        {
            "content": "Although it was gloomy at times, this is a beautiful film set around loss. Great work all around and I can't wait to see the other two films in the trilogy!",
            "review_date": "2021-01-07",
            "source": "rt"
        },
        {
            "content": "Contrary to popular belief, Three Colors: Blue did not come out before Eiffel 65 released 'Blue', otherwise I'm sure Kieślowski would have agreed that it was the most suitable track to include in this film. While part of a trilogy designed to explore the French identity, Blue can't help but lean overwhelmingly into its individual narrative, so overwhelming is the sense of controlling grief and loss that Binoche's Julie feels throughout essentially the entire runtime; it may not be until after the credits roll that you remember to search for political subtext. Cleverly shot with an overtly defined focus on visual elements to support (many would say supplant) its narrative, Kieślowski clearly had a vision in designing the shot along with cinematographer Idziak, and creates a protagonist in Julie that goes far beyond a pandering, simplistic 'sadness' to instead feel complex, real, often devastating. Her journey is at first despondent, then tentatively hopeful, and finally somewhat redemptive, but never is there a Hollywood moment of complete healing that would have ruined the sincerity of her labor. If you're feeling a bit down, I wouldn't reccomend watching it, because Blue is not going to help with a short-term solution. (4.5/5)",
            "review_date": "2020-12-13",
            "source": "rt"
        },
        {
            "content": "Trios Couleurs: Bleu is a movie that I really enjoyed, it's such a beautiful movie filled with some beautiful scenes and shots that will take you into the mind of the character Julie. \n\nJulie (Juliette Binoche) is a young Frenchwoman who is struggling to find a way to live her life after the death of her famous composer husband and her child.\n\nBlue is a movie that needs patient, it's a movie that's filled with emotional power and a close-observed character. In Blue I felt like I was Julie, I felt like I was seeing what Julie was seeing, I felt like I was listing to what Julie was listing, and that's the beauty of the film. \n\nI loved how the movie's name is Blue and you will notice that in nearly every single scene / shot the color blue or at least a certain shade of the color Blue is there even if it's a small thing like a sign in a street or a shirt that a character is wearing, blue is just always there and you will know why the color Blue has a big effect on Julie and it takes on deferent meanings to match Julie's emotions. The Cinematography & colors were just so beautiful and pure.\n\nThe Production design was so amazing, the beautiful streets of France, the swimming pool, and Julie's apartment, it just gives you that weird grief feeling that Julie is feeling inside of her. \n\nThe incredible score (the symphony) that was so weird, full of emotions and starts to play suddenly, I loved how in some scenes pieces of the symphony suddenly play over the soundtrack at emotional moments and how Julie seems to hear it as if it's surging up from inside her own mind, also the scene when she throws the sheet music into the garbage truck if you listen closely, the song distorts as the trash compactor's teeth tear the paper. we are hearing everything exactly the way that Julie is hearing. \n\nJuliette Binoche's performance was so crazy, she didn't have many lines in the film and she rarely speaks but, she was able to give us such a deep performance as her character navigates grief, in one of the scenes that I can't mention or I'll spoil the movie,  Juliette Binoche was able to play Julie's hurt and anger, but also her curiosity and maybe even envy all at once. She was just incredible and was able to act with her facial expressions more than with her speaking or saying some words. \n\nAn amazing movie that I really enjoyed and highly recommend it.\n\nMy rating is: 9/10\n\n(credits go to \"CrashCourse\" from youtube for their video: \"Three Colors - Blue: Crash Course Film Criticism #11\")",
            "review_date": "2020-08-21",
            "source": "rt"
        },
        {
            "content": "Few times I have feel like a movie is made with such a detail and knowledge of cinema. Every movement of the camara, every use of color, composition, sounds, feels like it has a narrative reason, it doesn't feel that is just made for aesthetic.\nI would be lying if I said I got the reason and meaning of all of them. A movie to dissect.\n\nFun Easter egg: There is a location that is also a location in Inception",
            "review_date": "2020-08-06",
            "source": "rt"
        },
        {
            "content": "Visually stunning, well acted, and not really interesting",
            "review_date": "2020-07-09",
            "source": "rt"
        },
        {
            "content": "What more do you need from a film? Juliette Binoche and Kieslowski? Unforgettable.",
            "review_date": "2020-04-27",
            "source": "rt"
        },
        {
            "content": "A perfect start for this enticing trilogy! Juliette Binoche is adorable, sad, and puzzling in the best way. Watch the first minutes again once you finish, and you will be utterly satisfied by the great attention to detail the director brings to the movie. It's a solid, but fluid movie, both blue and romantic. As romantic as life gets.",
            "review_date": "2020-04-16",
            "source": "rt"
        },
        {
            "content": "My favorite entry in the trilogy",
            "review_date": "2020-02-12",
            "source": "rt"
        },
        {
            "content": "One of the most beautiful and heartbreaking movies I've seen.",
            "review_date": "2019-10-17",
            "source": "rt"
        },
        {
            "content": "The best way to have a good rating for a hollowed space:This movie !",
            "review_date": "2019-08-09",
            "source": "rt"
        },
        {
            "content": "Facilmente podria ser la pelivula de mi vida",
            "review_date": "2019-07-03",
            "source": "rt"
        },
        {
            "content": "When I set out to watch Krzysztof Kieslowski's Three Colors trilogy I expected to be most impressed by this film because it starred the incredible Juliette Binoche and sounded the most â~serious' and weighty. After watching all three films I would actually say this was the weakest of the three because it is largely devoid of the humor so present in the other films and the grief just feels monotonous after a while. I suppose that was part of the point, grief is monotonous and inescapable, however I expected a filmmaker like Kieslowski to bring something more to the film, to make it more engaging. This is definitely a film that you should watch I just didn't find as much to love about it as I did with Three Colors: White (1994) or Three Colors: Red (1994).\n\nJulie, Juliette Binoche, loses her philandering composer husband and beloved daughter in a tragic car accident. She grieves and suffers in the aftermath as she is pursued by a young man who witnessed the crash and impulsively has sex with Olivier, Benoit Regent, who was one of her husband's friends. As her life continues to crumble around her she attempts self harm as a way to release emotion. One of her husband's, or possibly her own, uncompleted compositions haunts her and when she is finally able to complete it, we see her dragging her finger over the written scroll as a recurring motif, she can finally emotionally mourn her loved ones.\n\nThis is a film that I didn't really get, the only person that I have really mourned in my life is my grandfather and I was not particularly close to him. The whole thing felt like an exercise in misery punctuated by odd moments of sections of classical music playing while the camera cuts to black and then fades back in on the exact same shot. I wasn't exasperated or angered by my inability to understand the film or really connect it I want to watch the film again someday when I have more life experience.\n\nI understand that my lack of comprehension of the film sort of invalidate me in my attempt to evaluate it but I still found elements of the film to appreciate and would urge those who have experienced grief to watch it.\n\nThe performance of Binoche was, as I expected, very good as her dark eyes convey an emptiness and a wounded sensibility that stands out amongst the relatively nonplussed figures around her. When she scratches her knuckles against a rock wall Binoche is provided with a moment to engage in Capital A Actress-ing and she takes it but it's not as frustrating as Nicole Kidman in The Hours (2002) or Felicity Jones in The Theory of Everything (2014). Her commiseration with her husband's pregnant mistress is a moment where Binoche shines as she quietly suffers at the thought of her husband's affair and seemingly genuine love for another woman. Obviously this film was probably a bit too arty for it to be acknowledged in the acting categories at the Academy Awards but when considering that Jessica Lange, ugh, won for Blue Sky (1994) I think that Binoche was absolutely robbed.\n\nThe visuals of the film were the other aspect that I was able to appreciate with blue being the dominant color, of course, but the starkness of Bincohe's slim, dark figure against the Parisian dusk is a memorable image. The blue beads that she holds tightly in her hands probably represent something deeper but for me they were the best use of the color blue in the film as although this is an â~obvious' analysis, I see the blue as a metaphor for her grief and it's presence everywhere constantly reminds her of her loss. The film looks gorgeous and sophisticated in that wonderful European way and although it's a shallow reason to enjoy the film I drew some pleasure out of Kieslowski's attention towards this.\n\nAs I said before I think that this will be a far more rewarding experience as a film when I am older because it is a study of a woman who has experienced many things in her life and struggles to let them go. I have not felt these things so I had only a surface level understanding of her pain but I could see that the film was working on an altogether different level that dilettantes like myself would fail to understand.",
            "review_date": "2019-05-06",
            "source": "rt"
        },
        {
            "content": "The story-telling in Three Colors: Blue is not exactly the kind of thing that gets your adrenaline pumping. It starts with a high drama moment, but the rest of the film doesn’t have that same energy. In fact, because of the actions of the main character (played brilliantly by Juliette Binoche) it is the exact opposite. The whole thrust of her journey in the film seems to be releasing life of attachments, so that there is no more risk of loss. It’s heart-wrenching at times, because we know what has prompted this, and we want to see her overcome the tragedy. But eventually the slow pacing of the movie and the emotionless tone started to wear me down, and I was getting bored. I was still invested in the character, and wanted to see how she would move on after the trials she’d been through, but I got impatient with the film, because it took so long to get there. I did enjoy the way that the music was utilized as a symbol that she couldn’t escape her past life, but I was hoping to hear the entire piece at the end as some type of payoff for her journey. Three Colors: Blue is a beautiful film, and it has something to say, but I’m not sure I’d want to watch it again isolated from the other films in the trilogy.",
            "review_date": "2018-12-12",
            "source": "rt"
        },
        {
            "content": "This film was solid.",
            "review_date": "2018-11-19",
            "source": "rt"
        },
        {
            "content": "the emotions a person goes through..\n\nTrois Couleurs: Bleu\n\nKieslowski's heartbreaking reminiscing venture is pious and naked on terms of the route it follows. The aftermath of such a major upheaval, the repercussions that it costs and the emotions a person goes through, is what's this tale about. But don't jump on the conclusions yet, Kieslowski is a real trickster when it comes to storytelling. His range is so vast and detailed, that you find yourself floating in its bubble staring at the abyss beauty of it. Armed with jaw dropping score and eye popping cinematography, this is certainly a cinema at its peak. The narration follows the protagonist from the first frame till the curtain drops.\n\nThis is something that isn't often seen. And addition to that, to keep the audience still tangled in its pathos bubble and rooting for the characters is what sweetens this layered cake. The screenplay is tightly packed with gripping plot and adaptive metaphorical tone that is beautifully poetic. Even though the entire concept is dipped in brimful of poignancy, the language of the picture is utterly soothing and hopeful to the core. Kieslowski keeps giving you back at each definite interval, he genuinely cares about the quality of his story. Binoche is literally the soul survivor of the movie.\n\nShe has the potential to melt you down within the first few minutes of her screentime. And when she is offered such a three dimensional character, she soars against all the hokum of your expectations and stunningly fabricates her portrayal onto the screen, this is arguably the best work of her career. Chugging down all the viscous material and loping it up on the screenplay, Kieslowski pushes the boundaries of cinema to newer territories and builds a safe home for the script. Trois Couleurs: Bleu is fairly one color foliated into many, and it is that transition that the makers succeed at.",
            "review_date": "2018-11-06",
            "source": "rt"
        },
        {
            "content": "Juliette Binoche is the beating hart of this film and gives a BRILLIANT performance. An interesting and engaging  tale BEAUTIFULLY told.",
            "review_date": "2018-09-16",
            "source": "rt"
        },
        {
            "content": "Impecável, trilha sonora divina com uma personagem complexa e direção imprevisível.",
            "review_date": "2018-05-26",
            "source": "rt"
        },
        {
            "content": "Three Colors: Blue is a very boring and depressing movie that is solid but far from great. The film is technically accomplished with excellent cinematography, editing and direction and the performance from Juliette Binoche is terrific. It also has its emotional scenes. But it is way too slow and tedious and it doesn't delve deep enough into its themes.",
            "review_date": "2017-10-20",
            "source": "rt"
        },
        {
            "content": "Tedious!  Picks up interest toward the end.",
            "review_date": "2017-08-26",
            "source": "rt"
        },
        {
            "content": "Three Colors: Blue is a boldly understated touchstone on loss and depression that almost any other director would butcher.",
            "review_date": "2017-07-02",
            "source": "rt"
        },
        {
            "content": "A pretty neat use of symbolism and colors to convey a visually interesting film that affects the senses.",
            "review_date": "2017-02-23",
            "source": "rt"
        },
        {
            "content": "This was really boring. I had to constantly act like everything was so interesting in front of my friends because I basically picked this movie to watch. Definitely not watching the other two.",
            "review_date": "2017-02-15",
            "source": "rt"
        },
        {
            "content": "Juliette Binoche is mesmerising as a grieving widow who is at a loss with deciding the direction for her life. Visually invested and emotionally moving first chapter in the Three Colours Trilogy.",
            "review_date": "2017-02-09",
            "source": "rt"
        },
        {
            "content": "Blue is for Liberty. After losing her husband, a composer, and daughter in a car crash in which she survives, Julie is left to deal with their loss and reevaluate her own life. For me this first film of the Three Colours trilogy is a masterpiece. The best of the three. This trilogy should be seen by everyone at least once.",
            "review_date": "2017-02-07",
            "source": "rt"
        },
        {
            "content": "Brilliant, tragic, and rife with coincidence and fate.",
            "review_date": "2017-01-12",
            "source": "rt"
        },
        {
            "content": "Krzysztof Kieslowski's deft direction and Juliette Binoche's typically outstanding performance makes Three Colors: Blue an absorbing first installment of the colors trilogy",
            "review_date": "2017-01-03",
            "source": "rt"
        },
        {
            "content": "I wish I had words... to explain the inexplicable. Tremendous exploration on loss, suffering, running from itself, cutting off all the bonds, redemption and love. This is a unique experience: visual, spiritual and emotional. It works on every level there is in a human soul and body. I'm apprehensive to go on watching movies for it may be all others are inferior to this..",
            "review_date": "2016-12-15",
            "source": "rt"
        },
        {
            "content": "The best in the trilogy, and deeply memorable. Beautifully acted, shot and directed.",
            "review_date": "2016-11-09",
            "source": "rt"
        },
        {
            "content": "Blue is an immersing film with great visuals and deep characters.",
            "review_date": "2016-10-19",
            "source": "rt"
        },
        {
            "content": "I wish i could understand more",
            "review_date": "2016-09-06",
            "source": "rt"
        },
        {
            "content": "Magnificent film, greatly written, acted and produced, this independent film is absolutely unique in style, tone and context. definitely a great watch and a beautiful visual experience.",
            "review_date": "2016-04-28",
            "source": "rt"
        },
        {
            "content": "3.7/5\n\nPowerful and emotional even with its slight missteps in rythm , Blue as the start of a trilogy offers plenty of emotion and artistic and provocative visuals through its directing and well thought out story.",
            "review_date": "2016-04-19",
            "source": "rt"
        },
        {
            "content": "A beautiful Juliette Binoche setting the loss of her husband and daughter aside, and tries to make a clean pathway through her forced new-life. Emotions are colored in the chill of blueness. The visual and creative and playful shots of  a young and destined woman trying to gain control over her life..",
            "review_date": "2016-03-21",
            "source": "rt"
        },
        {
            "content": "http://filmreviewsnsuch.blogspot.com/2016/02/three-colors-trilogy-blue-white-red.html",
            "review_date": "2016-02-27",
            "source": "rt"
        },
        {
            "content": "Juliette Binoche and classical music and intriguing (blue) cinematography are what stand out the most for me. Grief and emotional liberty? Not so much.",
            "review_date": "2016-02-24",
            "source": "rt"
        },
        {
            "content": "31%\nSaw this on 1/2/16\nA fucking piece of shit. This is a pointless and overrated film without even a trace of a plot or character development. It doesn't say anything clearly about what happened in the past of the main character, whether she is the one who actually did the composing or not. A complete waste of my hour and half.",
            "review_date": "2016-02-01",
            "source": "rt"
        },
        {
            "content": "If the concept of freedom is what drives Blue, the first of Krzysztof Kie?lowski's Three Colors trilogy, then the verdict on whether or not it exists does not seem to be a positive one. Julie's life is upended by a sudden death, and this sets off a series of reactions that force her to question her own individuality and her relation to those in her life. Kie?lowski's direction is gorgeous, imbuing various hues of blue throughout and exhibiting stylish, though never bombastic, flair behind the camera. This is not a happy film, and its message is both true to life and beautifully communicated, suggesting that the act of living is never up to any individual's choice, that free will is a myth predicated upon the desire to assuage the fears of those who desperately want to stake a claim on their own existence; eventually they, like Julia, will be forced to acknowledge this harsh reality.",
            "review_date": "2015-11-22",
            "source": "rt"
        },
        {
            "content": "beautiful, sad, honest, inspiring.",
            "review_date": "2015-11-08",
            "source": "rt"
        },
        {
            "content": "Another podcast-related viewing, breaking into the Colors Trilogy off the To-Watch Pile. I actually thought I'd seen this during the VHS days, but nothing about it seemed familiar, so perhaps I was thinking of 'White' instead?\n\nAt any rate, this comes recommended.",
            "review_date": "2015-08-05",
            "source": "rt"
        },
        {
            "content": "I first saw this masterpiece when it was released on video and hadn't seen it since.  i liked it when i first watched it, but seeing it again almost 20 yrs later and on Blu-ray, it simply blew me away.  It's is amazing on all levels, from Binoche's performance, to the music, to story and cinematography.  It's a great start to the \"Three Colors\" trilogy and should be require viewing for cinema lovers!",
            "review_date": "2015-07-27",
            "source": "rt"
        },
        {
            "content": "Kieslowski's sharp eye and unerring feel for the fleeting emotions and minute details that comprise human nature gives this tragic mood piece it's emotional power. Juliette Binoche gives a towering performance as a broken spirit trying to mend herself, her exceptional acting hinges on the subtle physical nuances.",
            "review_date": "2015-06-12",
            "source": "rt"
        },
        {
            "content": "Take a nap before you watch it...",
            "review_date": "2015-03-01",
            "source": "rt"
        },
        {
            "content": "Krzysztof Kieslowski's first feature in the renowned 'Three Colours Trilogy' focuses on the theme of 'liberty'. Juliet Binoche underplays enigmatic widow, Julie, to perfection and the film is visually arresting throughout.\nHowever, mirrored by it's own music and subject matter, Kieslowski's film is a sort of symphonic climb towards yet-to-be-established greatness; always cold, but never chilling, and fundamentally anti-climatic. There's clunky exposition, cliche galore and controversial editing choices, and, the whole time, it's hard to shake the feeling that Kieslowski's picture isn't quite as profound as it thinks it is. Unique and intriguing, but ultimately just pretentious.",
            "review_date": "2015-02-17",
            "source": "rt"
        },
        {
            "content": "7.8/10\nJuliette Binoche was terrific as Julie, in what was another beautifully shot film by Krzysztof Kieslowski, which really showcase a very different type of cinema about women that truly is outstanding and very inspirational. He knows how to write for very human and strong women and this showcases that with Juliette's performance in very humane and ordinary situations that end up looking beautiful with an excellent cinematography. Moreover, the story was also very good that as it progressed kept getting better. And now I'm looking forward of continuing the series of Three Colors. \n~February 28, 2015~",
            "review_date": "2015-02-17",
            "source": "rt"
        },
        {
            "content": "gr8 performance here from French binoche",
            "review_date": "2015-01-19",
            "source": "rt"
        },
        {
            "content": "#248a - A somber film that i just really struggled with from start to finish. Oh and there's lots of blue in it!",
            "review_date": "2015-01-03",
            "source": "rt"
        },
        {
            "content": "A very engaging drama.\n\nThree Colours: Blue is the first in director Krzysztof Kieslowski's Three Colours trilogy.  The story of a woman who suffers an immense tragedy and how she deals with it.  Very real, human and relatable. \n\nYou can see how she meticulously, and sometimes even callously, discards her old life, starts again and tries to close herself off from reminders of her past. A great study in human reaction to tragedy.\n\nDoesn't have a very satisfactory ending, however.  After all the careful build-up, the ending feels rushed and too open-ended.  I kept waiting for a moment of clarity that never came.\n\nSolid performance by Juliette Binoche in the lead role.",
            "review_date": "2014-12-30",
            "source": "rt"
        },
        {
            "content": "Brilliant cinematography and a breathtakingly tragic plot are enough to mark this one under the masterpiece category.",
            "review_date": "2014-12-18",
            "source": "rt"
        },
        {
            "content": "Beautiful. What else is there to say?",
            "review_date": "2014-12-09",
            "source": "rt"
        },
        {
            "content": "Krzystof Kieslowski is unquestionably, the master of visual narrative. When it comes to deep emotions nobody can explore it better than Kieslowski. Blue (his first movie of three colors trilogy) is a masterpiece. Music in this movie is both astounding and mysterious. The way Julientte Binoche plays as julie is completely unforgettable, some grief memories can never be forgotten, it doesn't matter how hard you try.",
            "review_date": "2014-11-12",
            "source": "rt"
        },
        {
            "content": "A wonderful, evanescent in its execution of grieving and escaping. A woman who wants the quiet life to exist but is faced with questions that arise from her dead husband. The need to exist and except can have its problems. Brilliantly directed and Juliette Binoche is just wonderful. A great film.",
            "review_date": "2014-11-03",
            "source": "rt"
        },
        {
            "content": "I really appreciated the cinematography with the frequent splashes of the colour blue. Juliette Binoche is a favourite actress of mine. She looked very young in this film. The actual storyline itself was okay. It was the visual aspects that kept me watching.",
            "review_date": "2014-10-26",
            "source": "rt"
        },
        {
            "content": "A symphony of inner liberty.",
            "review_date": "2014-10-11",
            "source": "rt"
        },
        {
            "content": "One of the best foreign films I have ever seen, although tragic in a number of ways.  Binoche's acting was unforgettable.  The close-ups allowed her to convey everything in some scenes without saying one word.  Conservative viewers will not like the presence of one minor character who lives a promiscuous lifestyle.  I would also like to offer compliments along with the condolences to Benoit Regent, who did well as Olivier.  He died not long after this performance, far too young, and is definitely missed.",
            "review_date": "2014-10-01",
            "source": "rt"
        },
        {
            "content": "'Blue' is appropriately titled, being the most depressing member of the famous 'Three Colors' trilogy. It is my least favourite of the three, although it does have a bleak and haunting appeal.",
            "review_date": "2014-09-14",
            "source": "rt"
        },
        {
            "content": "The cinematography is stunning while the story is somehow morbidly beautiful. Great stuff, although my least favourite of the trilogy.",
            "review_date": "2014-08-29",
            "source": "rt"
        },
        {
            "content": "Probably my least favorite of the trilogy, but still good in its own right. The musical cues are interesting, and the leading performance by Juliet Binoche is great. However, this movie is mostly slow and uninteresting to me.",
            "review_date": "2014-08-26",
            "source": "rt"
        },
        {
            "content": "Una magnífica pieza audiovisual que nos habla sobre el duelo interno, la pérdida, los viajes (el rumbo de la vida) y la libertad misma; con unos sagaces y brillantes movimientos en el ámbito directivo.",
            "review_date": "2014-08-20",
            "source": "rt"
        },
        {
            "content": "This film isn't exactly what I was expecting, because I was thinking that this was supposed to be about 80 minutes of a blue screen and narrations about Derek Jarman's life... in English. No, wait, this is just the other avant-garde film from 1993 that was coincidentally titled \"Blue\", or, in the case of the French... \"Bleu\". We ignorant Americans just rearranged the letters, kind of like we rearranged the pattern of colors on the French flag for our flag, as this trilogy will remind you, for whatever reason. Yeah, maybe I shouldn't have gotten this film confused with Jarman's \"Blue\", because, sadly, Jarman didn't live to be able to make another two of these blasted movies. Blue on the flag represents liberty, so maybe they should have called this film \"Liberty\", because it's hard enough to find an avant-garde film when just one of them shares a title and year with another one. Anyways, the fact of the matter is that there are two more of these films, and I keep addressing that because there's not too much more going on in this drama than there is in Jarman's \"Blue\", 80 minutes of a blue screen and narration. Man, this movie is dull, although it does have its commendable aspects, at least in concept.\r\n\r\nAn intimate portrait on a woman coping with an impossible tragedy, not through human interaction, but through isolation which doubles as a subtle social commentary, this film's story is minimalist, and its telling is so thin that it's difficult to get invested even in its potential, but the potential is there, promising intriguing dramatic and thematic value for Krzysztof Kieślowski to betray and do justice as director. Kieślowski meditative directorial style tends to be tedious, when it's not simply bland, as it's not justified by accessible material, although, when there is material for Kieślowski to draw upon, while it's never particularly effective, there ought to be some arousal to one's emotions, intelligence and, of course, aesthetic side. Kieślowski at least keeps consistent in working well with the film's style, and even then, there's only so much flare to the visual style, and only so much music at all, but when Zbigniew Preisner's genuine classical score is played up, it's powerful its own right and complimentary to the emotive aspects of this drama, and when Sławomir Idziak's cinematography is really allowed to flesh out its - you guessed it - blue palette in the context of hauntingly spare lighting, a sense of near-dreamy intimacy is biting. The style is primarily effective on its own, and that's impressive enough, considering just how outstanding the film's score and cinematography get to be, but it does do a fine job of complimenting what resonance there is to this cold affair. The lovely Juliette Binoche helps, though not as much as they, as she is earning praise for a performance which has hardly any material to work with, but is still asked to project a sense of distance and gloom as a woman faced with tragedy. The leading Julie de Courcy character does nothing but mope, never even having a major emotional breakthrough, but Binoche's subtlety and grace humanizes such a thin role enough to reflect worthy inspiration in a film which generally aspires to be nothing more than tedious in its subtlety. There is enough effective dramatic and aesthetic value to save the final product, but just barely, as the film is so aggravating in its misguidance, something that a minimalist story concept cannot afford to be faced with.\r\n\r\nI've given my praise to the dramatic and thematic value of this story concept as an intimate character study and social allegory, but this narrative might be too intimate for its own good, being minimalist in scope and potential, as surely as it is lacking in originality. This story isn't especially new, or, if it is, then the uniqueness is obscured a good bit by an execution which is very formulaic, as confusing as that sounds, given the storytelling has an artistically offbeat approach to subject matter which is minimalist enough in concept. This is yet another abstractly structured French drama which is too wrapped up in its realism to pick up momentum, and although that's not where the excess ends in this focally uneven and repetitious plot, the ostensibly thematic meditations on meanderings are too monotonous to sell the allegorical which are themselves too subtle, and the dramatic elements which are themselves too thin, not unlike the characterization which is supposed to drive the dramatics. The supporting characters feel like inconsequential supplements to the story of a lead who, despite being faced with particularly rough times, is nothing extraordinary, and is hardly nuanced, being well-portrayed by Juliette Binoche, but thinly drawn by the inexplicably sizable writing team of Krzysztof Kieślowski and Piesiewicz, Agnieszka Holland, and Edward Żebrowski. As effective as Binoche is, that is, with pathetically thin material, I never could get invested in a lead too uninteresting and problematic on paper to be sold without extensive characterization, thus, this intimate character study loses a lot of dramatic intrigue that it cannot afford to part with, no when Kieślowski, as director, takes such a subdued approach. The limply meditative storytelling structure goes accompanied by a limply meditative directorial atmosphere which has its moments, but, as you can imagine, primarily has hardly any material to draw upon with thoughtfulness, resulting in dull spells which are not occasional, or even recurrent, but all but consistent throughout this occasionally effective drama, drying out the atmosphere and trying your patience with enough tedium to frustrate. At the same time, there is plenty of simple dryness to meet the tedious moments, thus, the final product is too bland to be contemptible, but, make no mistake, it isn't exactly enjoyable, having its moments, but losing a lot of resonance through abstractionism, obviously never to be redeemed through entertainment value, whose absence secures the final product as totally inconsequential.\r\n\r\nOverall, there is some potential intrigue to this story concept which is done some justice when Krzysztof Kieślowski, as director, finds realization in his utilizing thoughtfulness, haunting musical and visual style, and a solid performance by Juliette Binoche to establish highlights in effectiveness which save the film from contempt, yet are seriously rare, or at least feel as though they are, for there are enough natural shortcomings to the intimate narrative, conventions to an already problematically monotonous meditative storytelling structure, thinness to the characterization, - even of an uninteresting lead - and tedium to a punishingly subdued atmosphere to make \"Three Colors: Blue\" something of a weak squandering of time, and only the beginning (Gulp... down some coffee, because there's two more to go).\r\n\r\n2/5 - Weak",
            "review_date": "2014-08-15",
            "source": "rt"
        },
        {
            "content": "A visually stunning and emotionally compelling work.  Bleu and Rouge are, perhaps, the strongest films of the trilogy - certainly my personal favourites.  I've loved these films for many years. To those who criticise the film for its slow pace: wouldn't it be tedious if all music were played at roughly the same tempo? ;-)",
            "review_date": "2014-07-03",
            "source": "rt"
        },
        {
            "content": "Three Colors: Blue bestows an exquisite, artistic element to the recovery of the spirit after a loss.",
            "review_date": "2014-06-21",
            "source": "rt"
        },
        {
            "content": "The entire \"Three Colors\" trilogy might just as well be some of the finest films of their very own kind.\n\nFull review at filmbroadcaster.weebly.com",
            "review_date": "2014-06-15",
            "source": "rt"
        },
        {
            "content": "Review In A Nutshell:\n\nBlue tells the tale of a woman who is trying to cope with a recent car accident that involved the death of her husband and child.\n\nBlue is one of those films where one couldn't predict the ending, as there wasn't a measurable goal established during the first or second act of the film and the director was aiming for a sense of realism when shaping the lead protagonist, therefore the character would not be following the traditional path of absolution and instead making one that is tailored for the character. I truly admired Krzysztof Kieslowski's approach with the film as filmmakers these days seem to try their best to cater towards the audience's expectations and resolve the character's story the way that is acceptable for them, which at times hurt the film's emotional and thematic impact. The film doesn't let us get too close to our protagonist, Julie, we never at any moment get inside her head, we only have her actions and her words to shape our perspective of her and I think this approach kind of left me a tad bit detached at some moments and finding it hard to empathise, but I think the director wanted us to not let the film speak itself too frankly, he wants us to keep coming back and observing her, hoping that each visit would let us become closer to the character and develop a unique understanding of who she is, what she is feeling, and how she would get through it.\n\nThe film also explores Julie's coping mechanism of her depression and grief. Julie's way of coping is definitely not something a psychiatrist or counsellor would recommend as her remedy is to isolate herself from the objects that could bring about memories of her loved ones. Julie also engages herself in activities like swimming, which at first I thought was her way of distracting herself from the recurring thoughts of her family, as the film went on I started to see what Kieslowski was trying to create with those scenes, she is swimming in her sadness and at times drowning herself in it. This held me back in thinking she is close to moving on with her life, but since the director is going for something more realistic in dealing with depression, I was more willing to let myself accept the decisions that the characters make. Throughout the late second-third act of the film, we are treated to a side of Julie that wasn't primarily seen at the start of the film. We get to see her immerse herself in the art of music, which I found to be highly entertaining as this gives us a glimpse of what she used to be and how talented she was before the tragic event.\n\nI cannot go into high subjective detail on the film's cinematography as I feel that I need to go through this once more before I could properly criticize the choices that both the director and cinematographer have taken. All I could say for now is that the photography of the film captures that distance between us and the protagonist perfectly, no matter how close the camera is we could never fully penetrate her. There were a couple of times where I did feel the use of the color blue was a bit too emphasised in a couple of shots, but then over time I was able to get through it and appreciate it's usage, particularly the scenes that involves Julie swimming in the large pool. The film at times switches between mounted and stable shots to hand held tracking shots. The director is manipulating how much of the character we see, there are times where the film lets us in and at times we only see partially or are too far away from the character.\n\nThe film's score was a definitely one of the film's highlights as the score creates this sense of impact during particular moments in the film, accurately representing how she feels at that given moment. The film was clever enough to have the film's protagonist be aware of the music, as the music seems to play as a reminder of the event and at the same time a sense of inspiration in how his husband's magnum opus composition should turn out. Since both the protagonist and the audience can hear the music, we are able to feel a sense of empathy, which is something of a rarity throughout the film.\n\nThe film's acting was mainly anchored by Juliette Binoche and she does a wonderful job here. I have only seen the actress on Abbas Kiarostami's Certified Copy which I thought she did a great job with, but her performance in this film took my perspective of her even further. Binoche is an outstanding actress who definitely deserves more credit than she currently has as when he embodies a role, she does it with such precision that one's previous understanding of the actress would be wiped clean when starting a new film. Just on scenes where the camera captures a close up of her face, she doesn't reveal much but it definitely does not seem hollow, there is something there but one has to look harder in order to obtain it.\n\nBlue is a great film that contains a wonderful and powerful performance from Juliette Binoche and a story that avoids from being predictable. If one places an effort to understand and connect with the character, then one would be left highly rewarded by the end of the film.",
            "review_date": "2014-06-11",
            "source": "rt"
        },
        {
            "content": "Review In A Nutshell:\n\nBlue tells the tale of a woman who is trying to cope with a recent car accident that involved the death of her husband and child.\n\nBlue is one of those films where one couldn't predict the ending, as there wasn't a measurable goal established during the first or second act of the film and the director was aiming for a sense of realism when shaping the lead protagonist, therefore the character would not be following the traditional path of absolution and instead making one that is tailored for the character. I truly admired Krzysztof Kieslowski's approach with the film as filmmakers these days seem to try their best to cater towards the audience's expectations and resolve the character's story the way that is acceptable for them, which at times hurt the film's emotional and thematic impact. The film doesn't let us get too close to our protagonist, Julie, we never at any moment get inside her head, we only have her actions and her words to shape our perspective of her and I think this approach kind of left me a tad bit detached at some moments and finding it hard to empathise, but I think the director wanted us to not let the film speak itself too frankly, he wants us to keep coming back and observing her, hoping that each visit would let us become closer to the character and develop a unique understanding of who she is, what she is feeling, and how she would get through it.\n\nThe film also explores Julie's coping mechanism of her depression and grief. Julie's way of coping is definitely not something a psychiatrist or counsellor would recommend as her remedy is to isolate herself from the objects that could bring about memories of her loved ones. Julie also engages herself in activities like swimming, which at first I thought was her way of distracting herself from the recurring thoughts of her family, as the film went on I started to see what Kieslowski was trying to create with those scenes, she is swimming in her sadness and at times drowning herself in it. This held me back in thinking she is close to moving on with her life, but since the director is going for something more realistic in dealing with depression, I was more willing to let myself accept the decisions that the characters make. Throughout the late second-third act of the film, we are treated to a side of Julie that wasn't primarily seen at the start of the film. We get to see her immerse herself in the art of music, which I found to be highly entertaining as this gives us a glimpse of what she used to be and how talented she was before the tragic event.\n\nI cannot go into high subjective detail on the film's cinematography as I feel that I need to go through this once more before I could properly criticize the choices that both the director and cinematographer have taken. All I could say for now is that the photography of the film captures that distance between us and the protagonist perfectly, no matter how close the camera is we could never fully penetrate her. There were a couple of times where I did feel the use of the color blue was a bit too emphasised in a couple of shots, but then over time I was able to get through it and appreciate it's usage, particularly the scenes that involves Julie swimming in the large pool. The film at times switches between mounted and stable shots to hand held tracking shots. The director is manipulating how much of the character we see, there are times where the film lets us in and at times we only see partially or are too far away from the character.\n\nThe film's score was a definitely one of the film's highlights as the score creates this sense of impact during particular moments in the film, accurately representing how she feels at that given moment. The film was clever enough to have the film's protagonist be aware of the music, as the music seems to play as a reminder of the event and at the same time a sense of inspiration in how his husband's magnum opus composition should turn out. Since both the protagonist and the audience can hear the music, we are able to feel a sense of empathy, which is something of a rarity throughout the film.\n\nThe film's acting was mainly anchored by Juliette Binoche and she does a wonderful job here. I have only seen the actress on Abbas Kiarostami's Certified Copy which I thought she did a great job with, but her performance in this film took my perspective of her even further. Binoche is an outstanding actress who definitely deserves more credit than she currently has as when he embodies a role, she does it with such precision that one's previous understanding of the actress would be wiped clean when starting a new film. Just on scenes where the camera captures a close up of her face, she doesn't reveal much but it definitely does not seem hollow, there is something there but one has to look harder in order to obtain it.\n\nBlue is a great film that contains a wonderful and powerful performance from Juliette Binoche and a story that avoids from being predictable. If one places an effort to understand and connect with the character, then one would be left highly rewarded by the end of the film.",
            "review_date": "2014-06-11",
            "source": "rt"
        },
        {
            "content": "This would be impossible to review without using far too many superlatives...suffice to say, if you still have a pulse you're obligated to see this film. It's as close to \"moving art\" as I've ever seen. I have to say the ending was a bit bombastic, but the message was very clear and will no doubt have many going to back to re-watch the film: there's so many tiny things here, small gestures of all varieties, to be up on.",
            "review_date": "2014-05-29",
            "source": "rt"
        },
        {
            "content": "Pretty great, artsy movie. But, it was too artsy. I didn't understand the symbols. But, it was a good movie about a woman getting over her husband and daughters death.",
            "review_date": "2014-05-21",
            "source": "rt"
        },
        {
            "content": "Es la mejor de las tres",
            "review_date": "2014-04-10",
            "source": "rt"
        },
        {
            "content": "Acting: 10\nScript: 10\nDirecting: 10\nEditing: 10\nArt: 10\nMusic: 10\nPhotography: 10\nanything else you want to know?",
            "review_date": "2014-03-26",
            "source": "rt"
        },
        {
            "content": "Kieslowski's first segment is a story that explores the human behavior post a traumatic loss suffered.The movie boats of a fantastic cinematography with breathtaking photography accompanied by brilliant performance by\"Juliette Binoche\"as well as the mindblowing musical compositions...",
            "review_date": "2014-03-26",
            "source": "rt"
        },
        {
            "content": "Juliette Binoche, the cinematography, the music (for god's sake, the music!), everything in the opening title to Kieslowski's trilogy is painful and beautiful at the same time. Such a powerful film.",
            "review_date": "2014-03-21",
            "source": "rt"
        },
        {
            "content": "Juliette Binoche is fabulous as Julie, a grieving woman who is trying to reinvent herself.",
            "review_date": "2014-02-21",
            "source": "rt"
        },
        {
            "content": "An entirely, genuinely unique study of loss that employs vivid sensory techniques. Director Krzysztof Kieslowski makes it evident in every scene that this is a personal and original film, luring his audience in with the power of subtlety rather than knocking them over the heads. Juliette Binoche delivers a painful, brilliant lead performance that is always enticing and empathetic. This is a masterful piece of work and I could consider it as one of my favorite movies ..",
            "review_date": "2014-02-13",
            "source": "rt"
        },
        {
            "content": "I really don't get it. I'm missing something big, but it just comes across as inaccessible to me.",
            "review_date": "2014-02-08",
            "source": "rt"
        },
        {
            "content": "Why did I like it? I seriously don't know why... It has lots of stuff I hate in movies. Uneventful slow and kinda pretentious but I have no idea why I didnt hate it. Maybe its because its an hour and a half unlike other arthouse flicks that last twice as long. It made me appreciate the visuals and music without them overstaying its welcome.",
            "review_date": "2014-01-22",
            "source": "rt"
        },
        {
            "content": "BLUE is a miraculous film in, like RED and WHITE, it is able to sumptously and sensibly dramatize basic story elements almost effortlessly. That is something so few directors can actually do- and BLUE is an example of that. Stunningly realized film is yet another great from Kieslowski- I wonder what other films he would have made had he not died in 1996... Surely great ones, I believe.",
            "review_date": "2013-12-10",
            "source": "rt"
        },
        {
            "content": "The antithesis to \"What Dreams May Come\", confronting tragedy without allowing escapism. From its slow, eerie introduction as Julie insists on attempting to harm herself and burn away the bridges of her past, to the more enlightened final act. \n\n(Note: Still have to watch the next two installments to fully appreciate this viewing)",
            "review_date": "2013-12-01",
            "source": "rt"
        },
        {
            "content": "This is like if Haneke allowed some warmth in his movies. A heart-dropping tragedy that overcomes its soap opera-esque storyline to artfully talk about the price of liberty. The somewhat obvious motif of blue is both subtle and ubiquitous, while the simultaneously analytical and emotional use of music is beyond wonderful (swelling and going to black during her grieving). And Binoche...my Lord....we get nearly the entire emotional arc of the film simply through images of her beautifully pained face.",
            "review_date": "2013-11-25",
            "source": "rt"
        },
        {
            "content": "I've heard many fantastic things about the Three Colors Trilogy. But it's always been shrouded by mystery. All I knew before viewing was that these series of films represented the flag of France; Blue-Red and White. For the first installment of this trilogy, it starts off starkly grim. It's the death of family which results in the loss of compassion in Julie, the main character. I found that this film borrowed many techniques from Truffaut's New Wave style. It reminded me of the 400 blows where characters just float through life as if they were a leaf in the wind. Julie and her actions really felt still and cold. It's like she doesn't live anymore. It's a fantastic display of grief and sadness but somehow it stays alive. \"Now I have only one thing left to do: nothing. I don't want any belongings, any memories. No friends, no love. Those are all traps.\" \nThere is an enormous amount of symbolism in this film. One particular recurring symbol was the pool where she always soaked in. It was a metaphor for her neutrality, her life constantly on the edge of death. Kieslowski does a fantastic job with this first installment. This film is like a breath of fresh air waiting to come out. You are waiting on the edge of your seat for that one time where Julie finally loves again. All of the elements, the symbolism come into play beautifully. It's a quiet yet extremely loud film; a foundation for Kieslowski's love for life. \n\nI loved this film and I was deeply moved. It was nice to see something so different yet so similar. It's a life that everyone can relate with as it's themes are so universal. I don't know how it relates to the french flag but in my eyes, it's a magnificent film anyway. This is true cinema.",
            "review_date": "2013-11-21",
            "source": "rt"
        },
        {
            "content": "It does not get much better than this.",
            "review_date": "2013-11-19",
            "source": "rt"
        },
        {
            "content": "It felt like the perfect balance between motion picture, sound, music, colour and image. \nA movie so well treated by Kieslowski that every single thing meant something and nothing in the film was pointless or had no reason to be there.",
            "review_date": "2013-10-15",
            "source": "rt"
        },
        {
            "content": "Three Colors: Blue is the first of Krzysztof Kieslowski's Three Colors trilogy of films, with White and Red following soon after. They were quite a big deal and made a big splash on the independent scene back in the mid-90's and are regarded as masterpieces today. It's hard to argue with that rationale. I hadn't seen the films previously, but starting with the first, I thought it was, indeed, a masterpiece. Not only is it one of the most beautiful films I've ever seen, but it's also one of the more affecting ones I've seen. The film is really about loss and the transition between losing a loved one and later having to let go. It's a tough process for anyone, and I think that Kieslowski captures that brief moment of insanity brilliantly. Juliette Binoche is also unforgettable and her performance is magnificent. It's a fantastic work of art.",
            "review_date": "2013-10-01",
            "source": "rt"
        },
        {
            "content": "Can't Say Nothing about it .... Just WOW !!",
            "review_date": "2013-09-21",
            "source": "rt"
        },
        {
            "content": "The \"artiest\" of Krzysztof Kieslowski's Three Colors Trilogy. Tremendous cinema.",
            "review_date": "2013-09-05",
            "source": "rt"
        },
        {
            "content": "Really really really really really really sad.",
            "review_date": "2013-08-29",
            "source": "rt"
        },
        {
            "content": "Juliette Binoche gives an outstanding performance in the first of the Three Colors trilogy and what a powerful one it is, given to perfection one most certainly can feel the pain and angst of this grieving mother and Kieslowski makes sure with every scene that you're feeling what she feels ten fold.",
            "review_date": "2013-08-12",
            "source": "rt"
        },
        {
            "content": "Perhaps a little bit overrated but still an interesting story with the played down drama that the French do so well. You've gotta say that it's a beautiful film, as Juliette Binoche is in almost every scene.",
            "review_date": "2013-08-08",
            "source": "rt"
        },
        {
            "content": "no podemos dejar de ser lo que somos...",
            "review_date": "2013-07-28",
            "source": "rt"
        },
        {
            "content": "Azul, o primeiro dos três da Triloia das cores do realizador Polaco Kieslowski aborda questões descaradamente espirituais e existenciais através da presença bela atriz francesa Juliette Binoche.",
            "review_date": "2013-06-11",
            "source": "rt"
        },
        {
            "content": "In my opinion the lesser of the trilogy, not reaching the emotional punch of red and not making up for it with the joy of white. Binoche, however, is magnificent",
            "review_date": "2013-05-31",
            "source": "rt"
        },
        {
            "content": "\"Three Colors: Blue\" is the first chapter of the Polish filmmaker Krzysztof Kieslowski's incredible \"Three Colors\" trilogy: Blue, White and Red, the colors of the French Flag which stands for Liberty, Equality and Fertility. The trilogy deals with modern day issues concerns the French society.\nJulie (Juliette Binoche) a wife of a French composer, recently survived a car accident but lost her husband and only daughter. Later she tries to take her own life but she doesn't seem able to do it so as an alternative she tries to cut all her ties to her past life and starts all over.\nThe movie starts with a tragic car accident although it may seem a tragic movie but it's not, it doesn't make you sad, it doesn't make you cry, it doesn't even try to.  Julie is a grieving widow but she doesn't act according to that, she calls a man, a friend of her and her deceased husband, she suspects that he have feelings for her and finds out that she's right, she make love to him not to insult the memory of her husband but just to see if she can still enjoy it but it doesn't seem to work for her anymore.  There are a few more plot developments and surprises but that's not what makes this film as fascinating as it is. I can't think of better actress for the role of Julie than Juliette Binoche, she has one of those faces you enjoy to read, because the biggest mystery in this movie is Julie's feelings and the only clue to solve that mystery is her face.",
            "review_date": "2013-05-24",
            "source": "rt"
        },
        {
            "content": "It all comes together!",
            "review_date": "2013-05-18",
            "source": "rt"
        },
        {
            "content": "Trois Couleurs: Bleu is the first part of the French classic trilogy directed by  Krzysztof Kieslowski. If you stumbled upon this film without googling it first, you might missed the layers of symbolism present in this film. The idea of the three colors in the trilogy, which symbolize the three colors of French's flag, also represents the meaning of each. With blue, the movie defines liberty. And although, it's anti-politic and in a way ironic, the liberty message Kieslowski try to convey is clearly seen and heard in this heart-wrenching movie that tells the story of a widow who struggles through the guilt, sadness and sorrow of losing her husband and little daughter. And who plays it better than Juliette Binoche? Magnifique!\n\n8.5/10.",
            "review_date": "2013-05-11",
            "source": "rt"
        },
        {
            "content": "Superbe performance from Juliette Binoche!",
            "review_date": "2013-05-08",
            "source": "rt"
        },
        {
            "content": "Powerful, and one of the finest endings ever done. Wow.",
            "review_date": "2013-05-08",
            "source": "rt"
        },
        {
            "content": "I barely recall the film but I think it was an interesting one.",
            "review_date": "2013-05-02",
            "source": "rt"
        },
        {
            "content": "Blue is a phenomenal beginning to the three colors trilogy. The film surrounds a widow who lost her child and husband in a car accident, it shows her life after the event. The peculiar thing about the film, is we only hear about what she was like before the accident, and never see it. I'm not sure if this was the proper decision by director Kieslowski, because it resulted in lack of character development and a withdrawal of emotion from that scene. At the same time it kept the films focus on its purpose. The brilliance of Blue is that the director wasn't only concerned on the main characters, Julie's, suffering but also that of people that surround her. This includes an elderly woman and a hooker, the film is equally invested in the troubles of others. One thing I found questionable as something the character would do is Julie's decision on the house. It didn't seem fitting to make her seem so selfless. The film has an amazing score, and is visually stunning. One small scene that shows the visual excellence is the sugar cube sucking up the coffee. Emotionally difficult to watch, but in my mind an essential.",
            "review_date": "2013-04-29",
            "source": "rt"
        },
        {
            "content": "A film kicking off a trilogy which would prove that European cinema is adult, mature and empathetic in its approach to emotions... and that Hollywood has not grown up yet.",
            "review_date": "2013-04-20",
            "source": "rt"
        },
        {
            "content": "Kieslowski means to stun you with sound in the first chapter of his \"Three Colors\" trilogy, each entry dedicated to a feature on the French flag. And with \"Blue\", he succeeds on all fronts -- plagued with tragic blackouts, grief, and finally love. I use the word \"dreamy\" a lot in describing difficult pieces of art, but the emphasis put on the empty and beautiful stares of the incredible Juliette Binoche encompasses that term more completely than few other movies I've probably ever seen.",
            "review_date": "2013-04-16",
            "source": "rt"
        },
        {
            "content": "Julie tiene que volver a comenzar su vida después de un trágico accidente donde fallece su esposo e hija. Ella necesita dejar atrás todo lo que le recuerde a su vida previa aunque sea mas difícil de lo que parece ya que su esposo era un famoso compositor cuya ultima obra se convierte en objeto de interés para periodistas. \n\"Blue\" no es sensacionalista y la maravillosa actuación de Juliette Binoche reprime todo tipo de extrovertismo, creando un complejo retrato de dolor. Este es un fascinante drama (la primera en la trilogia de colores de Krzysztof Kieslowski). Muy recomendable.",
            "review_date": "2013-04-14",
            "source": "rt"
        },
        {
            "content": "My personal favorite of the trilogy.",
            "review_date": "2013-03-22",
            "source": "rt"
        },
        {
            "content": "This movie has such a powerful and involving story that it's easy to overlook things like this, although this is certainly not the feel good movie of the year. By far the film's best feature is the story, which is brilliantly written and takes us on a fascinating journey, followed by the stupendous performances. Kieslowski is not one of our most accessible directors, but certainly one of the most enduring.",
            "review_date": "2013-03-14",
            "source": "rt"
        },
        {
            "content": "Now here's a movie that's superficially similar to Michael Haneke's recent Best Picture nominee Amour, but really is light-years more interesting than that film. Both are French films about normal people dealing with death, both are anchored by strong performances, and both happen to have Emmanuelle Riva (though she's the star of Amour and only has a tiny part here). But whereas Amour was cinematically dull and literal, Blue is an engaging, interpretatively rich experience.\n\n Juliette Binoche plays Julie, a woman in grief. At the very beginning of the film, her husband and daughter die in a car accident. She spends the rest of this movie attempting to deal with this trauma, mainly by moving to a new place and dropping all connections to her previous life. The movie might sound like a tear-jerker from that plot description, but it's actually quite restrained and deliberate.\n\nThe film was written and directed by the Polish auteur Krzysztof Kieslowski (I can never remember how to spell his name), and it's the first part of a loose thematic trilogy. Just in terms of its surface aesthetics, it's hard to imagine a more visually expressive movie. Slawomir Idziak's cinematography is beautiful and striking. Watching the movie is at times like watching a living Van Gogh painting. The fact that this movie was made without digital color-correction is astonishing.\n\nThe narrative is not obviously tightly constructed, but certain story threads do come up repeatedly. The point, I suppose, is less to tell a particular story than to have us try to understand this woman's strange grief. That the movie does this so effectively without ever being melodramatic or overbearing is admirable. This movie isn't going to hit you over the head with anything, except the color blue itself, which is everywhere - clothes, sets, objects, lighting, everything. This movie is much richer and more interesting than I have even been able to do justice to in this review. I can't think of anything else quite like what I've seen of Kieslowski's work",
            "review_date": "2013-03-13",
            "source": "rt"
        },
        {
            "content": "A deep reflexion of what does mean color blue of French flag;remarkable Juliette Binoche",
            "review_date": "2013-03-13",
            "source": "rt"
        },
        {
            "content": "Sublime. About dealing with loss by escaping your past. A moving painting in blue(s). Very human.",
            "review_date": "2013-03-09",
            "source": "rt"
        },
        {
            "content": "Blue is a good film, but it won't stay with me for long.",
            "review_date": "2013-03-06",
            "source": "rt"
        },
        {
            "content": "Trois Colueurs: Bleu is told in the way of a piece of classical music: it is ambiguous, beautiful, interesting, capturing and terrifying to the last note.",
            "review_date": "2013-03-06",
            "source": "rt"
        },
        {
            "content": "You'd be hard pressed to find much criticism about the first film in Kieslowski's mediation on the central tenets of the French Revolution, but here goes. You know how the vast majority of people roll their eyes at any mention of foreign or art house cinema? Movies like Blue are the reason why. Pretentious, showy, artificial and nowhere near as profound as it thinks it is, this film centers around one woman's grief following the horrific accident that claimed the lives of her husband and only daughter. I'm all for ambiguous mood pieces, but what happens when one takes minimalism to its limit with a largely vacant protagonist? What is really being communicated? What is this film saying about grief, coping and the pursuit of repairing a broken life that hasn't been said far better in countless other films? Kieslowski's gimmicky directing, painfully obvious symbolism and nonsensical camera tricks are stilted at best, and absurd at worst. \n\nAnd that score. You know, the laughably invasive one that bulldozes you right before he cuts to black... only to reopen on the same scene? It's self serving enough to make John Williams blush. It doesn't take a genius to recognize that this trite score seems to swell during Julie's (Juliette Binoche) moments of specific introspection (get it? Because her husband's music/legacy/memory haunts her. How clever!), but I couldn't help but roll my eyes upon seeing Kieslowski go back to this well time and time again.\n\nAnd that ending. It seems to start with Julie having sex in a glass box full of water (?), and ends with an overwrought roll call of all the film's characters looking deep in thought. What is this, a film school thesis project? \n\nI've read countless articles that defend this film's abstract (i.e. meandering) nature by calling it \"poetic cinema.\" Put Blue up against anything from Bunuel, Fellini or Jodorowsky's canon and it'll pale in comparison. The aforementioned directors deal in poetics as a means to tell a story, to explore a character. They don't need to trout out every single trick in a filmmaker's arsenal to cover up for shallow, half-baked ideas. If you're like me, and constantly feel compelled to defend art house foreign cinema from the mediocrity that dominates mainstream cinema, do not present Blue as evidence. It only reinforces every single stereotype.",
            "review_date": "2013-03-05",
            "source": "rt"
        },
        {
            "content": "Juliette Binoche was very ......",
            "review_date": "2013-03-05",
            "source": "rt"
        },
        {
            "content": "Visually stunning, but also human.  I have heard complaints about the quote of the poster: \"Mysterious... Sexy!\"  I don't know how sexy I found the film, but Kieslowski's direction does have a sense of mystery to it; What do things mean?  How are they connected?  It's just that the solution to the mystery is nothing physical or literal, but emotional and metaphysical.",
            "review_date": "2013-02-25",
            "source": "rt"
        },
        {
            "content": "A beautiful film with an incredible score. And while the color motif was by no means subtle, it was not overbearing. Also, the depth in the exploration of emotions that could be linked to \"blue\" (i.e. depression, loss, sorrow) were very well explored and developed throughout the film. Of the two parts of this trilogy I've seen, this is by far my favorite.",
            "review_date": "2013-02-17",
            "source": "rt"
        },
        {
            "content": "The color blue = music.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "After waking up in a hospital following a car crash, Julie (Juliette Binoche) learns the terrible news: Her husband and young daughter have both been killed. He, a composer, had been working on a piece that would have been throughout Europe, something that will never be finished now. Upon finding herself once again able to walk, Julie heads to the medicine cabinet and attempts to swallow as many awkward-looking pills as possible, hoping that they'll end her life. You don't go through with it with those kinds of monstrosities, and Julie is forced back to her room. She won't attempt suicide again. This is how Three Colors: Blue begins.\n\nEventually, she manages to recover enough to be released from the hospital that was holding her hostage. Or at least, it seemed that way to her. She had to watch the funeral on television. She could barely move. But now she's free, and is going to move on with her life. The old Julie died, and the new Julie is going to work on self-improvement, get a new career, begin anew. At least, that's what you hope she'll do. Instead, she begins burning (both literally and figuratively) everything that reminds her of her past. Friendships ended, all of her and her husband's work is gone, her mother is put into a day home, she moves to a new apartment without telling a soul, and effectively destroys everything she once loved.\n\nAnd for what? She's hurt, we get that, but what does she hope to accomplish by doing this? She becomes a reclusive person, not making any friends -- nor hoping to -- living alone, ignoring everyone she meets, and living a pretty sad life. She doesn't cry, though; her emotions have been repressed. This is what she's decided. She makes, perhaps, a friend, named Lucille (Charlotte Véry), an exotic dancer. But there's little joy in this relationship, with the two characters coming to each other for comfort, nothing else.\n\nAlso there for consolation is one of Julie's husband's friends, another composer named Olivier (Benoît Régent). They spend one night together soon after Julie returns home, as she knows that Olivier loved her. But after that night, she tells him that he'll forget her and that she's just like any other woman. She even gets cavities, we're told. And it's after this point where he begins a search for her as, like I said, she's effectively disappeared.\n\nWhat follows isn't all that complex, and yet it's beautiful. You don't go into this film expecting a complicated plot. There really isn't much of a plot at all, really. \"Woman tries to find her new place in the world while removing memories of her past\" just about sums it up. It unfolds elegantly, and I can't remember a moment when I was bored. The main character is so complex that it's hard not to want to just watch her go about her daily life. And if that's not enough for you, the imagery, symbolism, odd shot choices and other techniques used by director Krzysztof Kieslowski surely will be.\n\nThere's a lot to look at with this film, and there's a lot to follow even if you're not paying attention to the plot. It would take multiple viewings to pick out most of the imagery used in Blue, and even then, you're unlikely to get everything. I can see how that would frustrate more impatient viewers as they won't get much out of the movie, but for those willing to give it the time and commitment, it'll be very rewarding.\n\nWhile watching the narrative, you'll notice some key things. The main character, Julie, will frequently stare off into space, just like the camera will sometimes give us a close-up of something as mundane as a sugar cube. We'll also experience blackouts before Julie makes a major -- or sometimes minor -- decision. The musical score appears to be not just played for the audience, but is also inside Julie's head, playing randomly whenever the dialogue dies down or Julie spends time alone. She notices it and reacts to it, sometimes, and it usually follows and is followed by one of those blackouts.\n\nThe only real problem I had with the film was its ending, which went against the main theme that it seemed to be going for. Obviously, I won't give away the ending, but everything about it screams \"hypocrite.\" Or maybe just \"make up your mind.\" But, effectively, it doesn't match up with the rest of the film. It needed to be left more wide open, I thought, in order to bring proper closure to what we just sat through. The way it ended simply didn't quite gel with everything else.\n\nThe actors in Blue are good, but unremarkable. Juliette Binoche carries the brunt of the weight, and while she's good, the role didn't appear to be much of a stretch. The supporting actors aren't given much to really work with, and calling their characters developed would be a bit of an overstatement. This is a one-person show -- as it really should be -- and the supporting actors, while fine, don't get to shine as a result.\n\nThree Colors: Blue is a great film about a woman who needs to overcome her grief and realize what life is all about. While it doesn't contain an engaging plot, its lead character is one that is so interesting that a complex plot might take away from her story. We care about her, and the film focuses on that as a result. The only problem comes from the ending, which didn't quite fit in tone with the rest of the film.",
            "review_date": "2013-01-12",
            "source": "rt"
        },
        {
            "content": "At 20 years of age I was too young to see it and have basicly remembered the anxiety watching it. In this early midlife one has some clue what the main character is experiencing. Sad and beautiful, but not hopeless. Like life is sometimes.",
            "review_date": "2013-01-05",
            "source": "rt"
        },
        {
            "content": "Blue is the melancholic and yet hopeful first part of what is a wonderful trilogy of Kieslowski's. It employs a wonderful sound design and fantastic cinematography. I think the sound design is the most important in this first film than the other two films. For instance it uses music to raise emotions of not just the main character but the audience. Binoche also does a fantastic job of the lead, having to deal with her grief in the ways she finds will work for her. It comes off very powerfully, but I feel like it takes multiply viewings to fully appreciate it, as I found that the hype surrounding it may have plagued my first viewing of it making me expecting more. However it still was a powerful film technically and emotionally.",
            "review_date": "2012-12-10",
            "source": "rt"
        },
        {
            "content": "This is a \"B+\" movie. We all want to be free but we all end up somewhere in life. Freedom is possibly just an illusion we need to put up with life in the post capitalistic society. I will watch the second and third movies of the trilogy tonight and hopefully they will get better after the first one.",
            "review_date": "2012-12-07",
            "source": "rt"
        },
        {
            "content": "The music score is just phenomenal!",
            "review_date": "2012-12-05",
            "source": "rt"
        },
        {
            "content": "A masterpiece in a lot of technical ways. Great lightning, great framing, great editing, great soundtrack... But not very used to the deepness and intensity of french movies. Still enjoyed the movie, and looking forward to watch the other two to understand better the simbology of the colors represented on each one.",
            "review_date": "2012-11-16",
            "source": "rt"
        },
        {
            "content": "If I speak in the tongues of men and of angels, but have not love, I am only a resounding gong or a clanging cymbal. If I have the gift of prophecy and can fathom all mysteries and all knowledge, and if I have a faith that can move mountains, but have not love, I am nothing. If I give all I possess to the poor and surrender my body to the flames, but have not love, I gain nothing. Love is patient, love is kind. It does not envy, it does not boast, it is not proud. It is not rude, it is not self-seeking, it is not easily angered, it keeps no record of wrongs. Love does not delight in evil but rejoices with the truth. It always protects, always trusts, always hopes, always perseveres. Love never fails. But where there are prophecies, they will cease; where there are tongues, they will be stilled; where there is knowledge, it will pass away. For we know in part and we prophesy in part, but when perfection comes, the imperfect disappears. When I was a child, I talked like a child, I thought like a child, I reasoned like a child. When I became a man, I put childish ways behind me. Now we see through a glass, darkly; then we shall see face to face. Now I know in part; then I shall know fully, even as I am fully known. And now these three remain: faith, hope and love.\n\n But the greatest of these is love.",
            "review_date": "2012-11-15",
            "source": "rt"
        },
        {
            "content": "Krysztof Kieslowski's first movie of his trio colours trilogy.  Juliette Binoche is unforgettable in this movie.",
            "review_date": "2012-11-11",
            "source": "rt"
        },
        {
            "content": "Una pelÃ­cula poderosa, con un lenguaje simple y sencillamente sublime que maneja el director polaco Kieslowski para contarnos una historia hermosa y poderosa pero a la vez sutil y delicada como la mÃºsica que hace la protagonista a la cual literalmente se le acaba de terminar el mundo y la vida pues acaba de perder a su hija y esposo. \nFotografia y direcciÃ³n de 10 donde el azul juega un papel importante en cada una de las tomas y el lenguaje que maneja Kieslowski para al final entregar una cinta simple y sencillamente magistral que si no es para todo el publico pero si para todo aquel que se diga amante del cine.",
            "review_date": "2012-11-02",
            "source": "rt"
        },
        {
            "content": "Great film. Just didn't like it.",
            "review_date": "2012-10-13",
            "source": "rt"
        },
        {
            "content": "The most subtle, metaphorical and beautiful piece among the trilogy. The beauty isn't just from the overwhelming Juliette Binoche, but also the omnipresent and repeating blue colour. The whole picture is just too graceful.",
            "review_date": "2012-10-10",
            "source": "rt"
        },
        {
            "content": "Well made mysterious film!",
            "review_date": "2012-10-10",
            "source": "rt"
        },
        {
            "content": "The Three Colors Trilogy are my only foreign movies in my set of blu-rays, and may i say: What a film. The director, Krzysztof Kieslowski, is a true genius. Juliette Binoche is wonderful and the cinematography enigmatic. Something that's reaffirmed in this movie is: Handheld camera is beautiful and artistic. The film is full of clues, full of beautifulness and full of haunting music. Personally i think this is one of the best films of all time, i cannot this piece of art actually exists. It carries a beautiful message which i hope everybody can understand. It made me cry.",
            "review_date": "2012-10-03",
            "source": "rt"
        },
        {
            "content": "Possibly the most bleak and definitely my favorite of the trilogy, Blue explores how free one can truly be from one's past. It's really sad, but also quite hopeful in it's own way. The direction is flawless and Juliette Binoche is fantastic in the lead role. This is a gem of a film",
            "review_date": "2012-09-27",
            "source": "rt"
        },
        {
            "content": "Binoche gives an amazing performance in this great film.",
            "review_date": "2012-09-15",
            "source": "rt"
        },
        {
            "content": "A labour of love for Polish writer/director Polish director Krzysztof KieÅ>lowski, who had planned this trilogy based upon the French Revolutionary ideals of liberty, equality, and fraternity. As KieÅ>lowski said in interviews at the time of the film's release, \"the subject of the film is liberty, specifically emotional liberty, rather than its social or political meaning.\" That sets the tone for Blue, a moving and compelling drama. When famous composer Patrice de Courcy (Hugues Quester) and his daughter in a car crash, his widow Julie (Juliette Binoche), also in the accident, survive. Distraught at the loss, she tries to kill herself, but fails. Struggling to come to terms with what's happened, Julie cuts herself off from her past and all of her friends and relations. Even though Julie has the final, unfinished work that Patrice was commissioned to do destroyed, it transpires that Patrice's musical assistant Olivier (BenoÃ (R)t RÃ (C)gent), has a copy of the work, and wishes to complete it to honour Patrice's memory. Julie refuses, she has enough on her plate, especially when she finds out Patrice's mistress Sandrine (Florence Pernel), is carrying his child. It's a very good film, well made with some good performances, Binoche carries the film brilliantly, and the visual narrative is near flawless. It's a film about coming to terms with loss, moving on, readjusting our lives in face of tragedy. It got KieÅ>lowski's Three Colours trilogy off to a good start, with 2 more films to come.",
            "review_date": "2012-09-06",
            "source": "rt"
        },
        {
            "content": "The acting is good, the visuals are interesting, and the score is compelling, but that's about all I liked about this film. It's only 98 minutes long, but it's a long 98 minutes. I struggled to keep myself awake. This film may take on greater meaning after I see White and Red, but as a standalone film I just didn't enjoy it that much.",
            "review_date": "2012-08-31",
            "source": "rt"
        },
        {
            "content": "The most sensual and visually lush entry in the trilogy. Julliete Binoche's remarkably restrained performance is aided by Kieslowski's acute tonal and audiovisual sensibilities, suggesting and underlying Binoche's state of mind through precise and quite beautiful orchestrations of image and sound. It is a modest canvas that Kieslowski paints with immense feeling and range.",
            "review_date": "2012-08-28",
            "source": "rt"
        },
        {
            "content": "Absolutely brilliant, if the stereotypical French arthouse film. Juliette Binoche's husband and child die, so she tries to live a life without any connections at all, until the world just keeps infringing.",
            "review_date": "2012-08-26",
            "source": "rt"
        },
        {
            "content": "My favorite of the trilogy.",
            "review_date": "2012-08-22",
            "source": "rt"
        },
        {
            "content": "A film that accomplishes emotionality with less dialogue than the average, \"Bleu\" is an observation of a lonely woman's introspection after losing her husband and daughter in a car crash. Juliette Binoche's character is grief-stricken, but we might not suspect as much. She stares into space, often looking through people rather than at them, distraught and unwilling to maintain the connections she has with people. Her attempts to isolate herself and escape the nagging memory of her late husband and child fail, and she's drawn back in through chance meetings with strangers, her husbands renowned music, and one of her husbands secrets.\n\nI loved the camerawork in this film, as well as the use of the color blue, but Juliette Binoche's performance is all the film really needs. Her eyes could out-act half of the Hollywood-wannabes in the industry today. Her stare is warm and beautiful, yet houses so much sadness. She is one of the best actresses I have seen, and I say that only having seeing a handful of her films.\n\nI look forward to watching the next two films: \"Blanc\" and \"Rouge.\" If they are as good as this one, I imagine this will be one of my favorite trilogies.",
            "review_date": "2012-08-19",
            "source": "rt"
        },
        {
            "content": "Kieslowski does a superb job with every facet of this film: the narrative, the content, the music, the style, etc. From the unique opening shot all the way to the end, it's a grief-ridden journey that leaves a mark. And Binoche has a commanding performance.",
            "review_date": "2012-08-09",
            "source": "rt"
        },
        {
            "content": "As cool as its colour, well scripted and performed, although it left me feeling a little... well, remote from it.",
            "review_date": "2012-07-29",
            "source": "rt"
        },
        {
            "content": "Fotografia boa. De resto: fraco. Típica tentativa de soar artístico. Roteiro foge da realidade, afinal de contas, que mulher traída simplesmente agiria da forma que a personagem da Binoche? \"Ah, queridinha, você foi a amante do meu marido durante anos, mas mesmo assim, que isso, quero te ajudar, vamos ser amigas\".",
            "review_date": "2012-07-25",
            "source": "rt"
        },
        {
            "content": "The blue palette infuses the films obviously downbeat tone - it demands repeat viewing.",
            "review_date": "2012-07-03",
            "source": "rt"
        },
        {
            "content": "banyak musik2 mengganggu...",
            "review_date": "2012-06-28",
            "source": "rt"
        },
        {
            "content": "Big Kieslowski!. A formidavel movie...",
            "review_date": "2012-06-17",
            "source": "rt"
        },
        {
            "content": "Une histoire bien construite, une réalisation excellente, une ambiance réussie pour exprimer le thème de la Liberté psychologique de Bleu, le premier de la trilogie des Trois Couleurs. Malheureusement, le film long. En faite, il dure qu'une heure et 38min, mais j'ai toujours l'impression qu'il en dure deux et demi! Avec un meilleur rythme, Bleu s'aurait mérité une note bien plus élevée!",
            "review_date": "2012-06-16",
            "source": "rt"
        },
        {
            "content": "A tragedy erupts in the countryside: Julie (Juliette Binoche) is involved a horrific car accident that kills her daughter and her famed, composer husband. As she recovers, secrets begin to unravel out of control. First off, there is huge speculation that she became a significant contributor the music of her late husband. This, as a result, causes her leave her mansion and live in an apartment within Paris. Second, Julie discovers a woman that claims to have had an affair with her late husband...and is also pregnant. Finally, Julie starts to have a relationship with a family friend (Benoit Regent), who also helped to compose the music of the deceased. The first of Krysztof Kieslowski's Three Colors Trilogy is not the best, but it is still pretty compelling. Very nice use of colour, particularly red, throughout the film, but the pauses between certain scenes into darkness is a bit awkward. The acting is fine overall!",
            "review_date": "2012-06-07",
            "source": "rt"
        },
        {
            "content": "D'emblée, le sujet m'intéressait peu. La perspective d'un long-métrage portant sur la composition inachevée d'une symphonie de piano me laissait amer, et seule la réalisation de Kieslowski me laissait espérer en une oeuvre majeure qui se laisserait aborder par un épisode solide, une base intangible sur laquelle reposerait la trilogie entière des couleurs de la France.\n\nMalheureusement, quelle ne fut pas ma déception d'aperçevoir que le film avait été réalisé en français, moi qui m'était accomodé à la beauté de la langue polonaise et à l'ambiance qui y était établie. Pas que Juliette Binoche était mauvaise, non, loin de là, mais ce n'est pas ce à quoi je m'attendais dans une oeuvre majeure de Kieslowski.\n\nSeulement, le développement fut aussi très long et très lent, et ce malgré un film de 100 minutes, et cela prit bien du temps avant que mon attention s'y attache complètement. Il me fallut notamment une heure avant que je ne cesse de bailler, de sorte à ce que les 40 minutes restantes furent très inspirantes quant à ma motivation de terminer mon visionnement de Blanc et de Rouge.\n\nUne chose qui est certaine, c'est qu'encore une fois, et encore plus cette fois-ci, Kieslowski a doté son film d'un atout majeur: celle d'une des plus belles, sinon la plus belle, réalisations photographiques de son époque.\n\nBleu, tout est bleu. Bleu le remords, bleu la haine, bleu la mort.\n\n- Pourquoi pleurez-vous donc?\n- Parce que vous ne pleurez pas.",
            "review_date": "2012-06-06",
            "source": "rt"
        },
        {
            "content": "Magnifique, encore une fois!",
            "review_date": "2012-05-16",
            "source": "rt"
        },
        {
            "content": "Interesting. Awesome music.",
            "review_date": "2012-05-13",
            "source": "rt"
        },
        {
            "content": "Hypnotizing movie and an honest truthful tale of how a human mind behaves after losing someone it loves.",
            "review_date": "2012-05-13",
            "source": "rt"
        },
        {
            "content": "With a tour-de-force performance by Binoche, this visually-arresting film offers a powerful cinematic experience. Highly recommended!",
            "review_date": "2012-05-12",
            "source": "rt"
        },
        {
            "content": "Meant to be a classic, but hardly anything happens!",
            "review_date": "2012-05-08",
            "source": "rt"
        },
        {
            "content": "The opening scene is immediately one of my favorite sequences ever made, the shot behind the tire under the car, the lens-flared abstract view from the rear window, and the clear shot of the brake-fluid leaking. Kieslowski's \"Blue\" is about the loss, centered around a survivor of a car crash which took the lives of her composer husband and young daughter. But how is one to find solace or even escape after such cruelty? But also another mystery towards the main character, as to how much she was possibly involved in her late husband's work, and yet more mysteries about the late husband's life...",
            "review_date": "2012-05-03",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies ever.  I loved all the movies of this trilogy, and they were my entree into the world of good films",
            "review_date": "2012-04-28",
            "source": "rt"
        },
        {
            "content": "Krzysztof Kieslowski at his best.",
            "review_date": "2012-04-24",
            "source": "rt"
        },
        {
            "content": "Amazing. Kieslowski rules.",
            "review_date": "2012-04-15",
            "source": "rt"
        },
        {
            "content": "sinestesia... cor e som em harmonia fudida!",
            "review_date": "2012-03-27",
            "source": "rt"
        },
        {
            "content": "Probably the most tragic of Kieslowski's Three Colors trilogy.  Juliette Binoche is wonderful as a woman dealing with her husband and child's death.",
            "review_date": "2012-03-21",
            "source": "rt"
        },
        {
            "content": "Brilliant and heartbreaking. A true masterpiece.",
            "review_date": "2012-03-11",
            "source": "rt"
        },
        {
            "content": "Filled with a lot of allegorical references, the movie is an absolute delight to watch.....Though it is sluggish in pace, it makes up with its cleverly made scenes....At every stage, we cant help but try to think abt the meaning of each and every scene/visual.....",
            "review_date": "2012-03-06",
            "source": "rt"
        },
        {
            "content": "Next to this box appears the latest user reviews for this movie, and I completely agree with one that says \"A visual masturbation\"; The photography of the film is breathtaking, a true work of art. An innovative creation; how the music transforms every scene, every picture in an spectacular event, full of mystery, emotions, thoughts and color.  \r\n\r\nThe blue elements that appear throughout the movie, makes you think twice about everything. The director is very precise in what to display and how to display it. As well as the black scenes in the middle of something, with the orchestral music which feel like a metaphor to Julie's heart and head, a moment of blindness in a black whole.\r\n\r\nThe script is very appropriate. Not too much talk, just the necessary to transmit what the director wants to show from every character, specially from Julie. Juliette Binoche interpretes her character perfectly, so subtle and strong; creates a feeling like no other women. Perfect actress for a perfect movie.",
            "review_date": "2012-03-03",
            "source": "rt"
        },
        {
            "content": "A visual masturbation.",
            "review_date": "2012-02-22",
            "source": "rt"
        },
        {
            "content": "Very beautiful, and dare I say it, blue.",
            "review_date": "2012-02-14",
            "source": "rt"
        },
        {
            "content": "Music was too good especially the Flute piece..",
            "review_date": "2012-02-10",
            "source": "rt"
        },
        {
            "content": "Odlicna rezija, sa divnom muzikom koja dosta daje u ovom filmu.",
            "review_date": "2012-02-10",
            "source": "rt"
        },
        {
            "content": "I've never quite seen anything like this. I hope the other two of the trilogy are as good or even better!!!",
            "review_date": "2012-02-10",
            "source": "rt"
        },
        {
            "content": "Trois Couleurs: Bleu: Blue standing for Liberte (devoid of politic bias) and Flooded in blue cinematography Juliette Binoche leads as a woman refusing to deal with grief and quietly portraying her relapse following shutting off all connections of life. It is psychological independence and isolation taken to its extremity and one's rebirth. Surreal at times and musically overwhelming. A very emotionally and sensually charged that will be more rewarding with each viewing. Final score: 9/10",
            "review_date": "2012-02-07",
            "source": "rt"
        },
        {
            "content": "Part of the 'shapes' trilogy, hehe. Artistically shot and of content. Heavey in symbolism and sweepingly beautiful music. Just let the film open up to you, by the end you will be in awe. I will be watching RED and WHITE very soon.",
            "review_date": "2012-01-31",
            "source": "rt"
        },
        {
            "content": "I hate to say it, but this was really dull.  Granted, there was some nice cinematography and Binoche was pretty good.  But still... I get that it's all about character, but the entire plot was revealed within the first ten minutes.  Was anyone really surprised by rest of the film? Really?",
            "review_date": "2012-01-26",
            "source": "rt"
        },
        {
            "content": "A sumptuous, intelligent masterpiece.",
            "review_date": "2012-01-20",
            "source": "rt"
        },
        {
            "content": "First of a trilogy of films dealing with contemporary French society concerns how the wife of a composer deals with the death of her husband and child.\nThe basic theme of the film is liberty, which, according to the french flag, relates to the blue color. It is expressed by Krzysztof Kieslowski in the portrayal of a woman who loses her husband and child and decides to leave everything behind in order to start a new life. There's surely not much of a story here, but an expression of this woman's feelings and the way she's dealing with her tragedy. Unfortunately, I couldn't connect with her complex character despite the splendid direction of Kieslowski, because she simply isn't likable enough. However, what really stunned me apart from the direction was the editing and the sound, simply amazing. \nI don't think this is for everyone to see, but it's definitely a feast for any moviegoer out there.",
            "review_date": "2012-01-19",
            "source": "rt"
        },
        {
            "content": "Really beautiful movie that kicks off this trilogy. Nothing much to say about this right now because there's a Laker game going on. Also, blue is my favorite color!",
            "review_date": "2012-01-11",
            "source": "rt"
        },
        {
            "content": "Even though I am clueless regarding Krzysztof Kieslowski's other works before I even laid my eyes on \"Three Colors: Blue\", and even though how frustratingly misleading the little summary on the back of the DVD really is, I still immensely liked the film. But not in a way how I may like a straightforwardly well-written film. \n\nDeviating from filmic conventions, although it is in fact a very linear film, \"Three Colors: Blue\" manages to convey the deepest of emotions not much through storytelling but more through calculated camera movements and stunning cinematography (by Slawomir Idziak). And with that, the film has managed to make me appreciate its wholeness in much the same way how a beautifully experimental musical piece may capture a music lover's heart.\n\nWith a title that suggests immediate melancholy and visuals that further this emotional atmosphere even more, \"Three Colors: Blue\" is more of a mood piece than it is an immediate narrative. It is, as it flexes its finely-toned existential muscles, an emotional spectrum subjectively seen through the eyes of a middle-aged woman named Julie, played by Oscar winner Juliette Binoche, who, after being involved in a car accident which claimed the lives of both her husband and child, decided to completely remove herself from the life that she has always cherished and loved. \n\nStarting her aimless goal by selling their house, all the other things in it, and burning the difficult concert piece that her composer husband has written to commemorate the unification of Europe but sadly hasn't finished, Julie rented an apartment in a not-so-affluent part of Paris and started to live her life in utter isolation, save for some slight interactions with other people here and there (with a young prostitute being the most notable). \n\nBut even though she wants solitude, there's Olivier (Benoit Regent), a colleague of Julie's husband, who constantly shows his love for Julie but is seemingly contented by the quite sad fact that he can only show it in futile admiration. But despite of that, he is always ready to support her in the midst of her emotional plight and is also eager to finish her late husband's concert piece. For a film (again, back on the DVD's summary fiasco) that has promised utmost 'mystery' and 'seduction', \"Blue\" is surprisingly warm and affectionate in its romantic notions and never, even for once, stooped down to an extremely sensationalist, 'sex for the sake of it' level. \n\nThe film is also quite rich in its visual interpretation of emotional alienation and frustration. With Kieslowski uniquely using sudden fades into black in scenes whenever Julie is met with the difficulty of answering questions that may unveil what she's really feeling at moments, and ingeniously injecting blue-colored objects to enforce the film's recurring color motif, \"Three Colors: Blue\", as it progresses, patiently develops into a purer form of art house cinema that criss-crosses between realistic human emotions and esoteric overtones.\n\nForm and content, message and execution, these are the most basic requirements for a film to be considered as an artistic whole. For this film, Kieslowski balances both on a very thin wire as if a cerebral circus performer, seemingly experimenting as he paces along, even with one outweighing the other, but nonetheless, a walk that is not without a clear finish. \n\n\"Three Colors: Blue\", as a whole, surely is a fine piece of foreign cinema that seeks to inform its audience that there's no such thing as a generalized emotional milieu for a certain societal stream. 'Existence is isolation', Kieslowski, in part, may have had in mind as he works with this film, but it can never be denied that he has created the film with a concrete glimmer of hope and a beautiful melody somewhere in his mind. \n\n\"Blue\", the first chapter of Kieslowski's \"Three Colors\" trilogy, is a very effective drama film about tragedy and artistry. But more evidently, it is an ideal example of how brilliant the art of cinematographic composition, partnered with some achingly beautiful music, can really be when skillfully pushed to absolute perfection.",
            "review_date": "2012-01-03",
            "source": "rt"
        },
        {
            "content": "Now that I've seen Blue, White and Red. I can finally review all of them. It is indeed a masterpiece. There are so much going on and yet every iconic symbol is fitted in throughout the film quietly. If each colour represent a feeling, then blue must be pain. I only watch this film once, but I think I can watch it over and over again, I will still discover something new.",
            "review_date": "2011-12-21",
            "source": "rt"
        },
        {
            "content": "My favorite of the trilogy and by a wide margin. Binoche is a silent force! Rather than feel and swallow emotional bombs she runs the other way to live a life she wants to her on her own terms. The movie is shot, chopped and scored magnificently and when it breaks convention its shocking, fresh and ultimately works in brilliant ways.",
            "review_date": "2011-12-17",
            "source": "rt"
        },
        {
            "content": "Krysztof Kieslowvski was a genius and quite a few moments in his film Blue does quite a good job of making that argument. What an incredible picture this is. Juliette Binoche is transcendent as Julie, a woman who has just lost her husband and daughter to a terrible car accident from which her own life was miraculously spared. Would she call it a miracle that she was left alive while her entire family she had worked to create was taken? I cannot think that this would be the case. However, as we see in the movie, the tragedy of death is very real. Yet the need for that which is alive to go on living is equally real and important. That which is alive must live; and that which is gone must be remembered. I could go on and on about the themes which this movie explores, and the various depths of emotions which it unveils, but I'd rather you just go and watch it for yourself. It is a fantastic experience and a wonderful affirmation of pain.",
            "review_date": "2011-12-11",
            "source": "rt"
        },
        {
            "content": "My favorite of the \"Three Colours\" trilogy, \"Blue\" is a wonderful work of art, full of beauty and sadness. Its symbolism, its melancholy and its mistery are so overwhelming, that we are never truly able to reach them. Hard to describe, but marvellous to look at. Just beautiful.",
            "review_date": "2011-12-11",
            "source": "rt"
        },
        {
            "content": "my favorite of the trilogy, followed by red, then white",
            "review_date": "2011-12-10",
            "source": "rt"
        },
        {
            "content": "Damn, talk about art house! My first Kieslowski, Blue is the 1st part of a trilogy of love and loss. With a captivating score, an outstanding performance by juliette Binoche, and some fantastic cinematography, yes, I thoroughly enjoyed this. There's a metric butt-ton of symbolism in this movie. Each of the films has a theme that it subtly and ambiguously explores, and Blue's is liberty; but not the kind of political \"Braveheart 'FREEEEEDOM' \" that you would normally think of. No, this is more like liberating one's own emotions and overall outlook on life. Apparently, Krzysztof has very delicately intertwined these 3 unrelated stories, and I can't wait to see how he does it. Most people I know would say this film is \"boring, slow, uneventful, and plotless,\" and for all of those people, I sigh and feel sorry for you. And for all those other people that don't care for foreign cinema...wake up!",
            "review_date": "2011-12-09",
            "source": "rt"
        },
        {
            "content": "This film is absolutely amazing. The film making, the construction, the music, it is truly a work of art. Kieslowski makes a complicated film about depression, and moving on with your life after a horrific tragedy.",
            "review_date": "2011-12-05",
            "source": "rt"
        },
        {
            "content": "Absolutely beautiful from beginning to end.",
            "review_date": "2011-11-30",
            "source": "rt"
        },
        {
            "content": "Interestingly made and deeply personal.  Kinda slow-moving, but this is a film that's all about the little details.",
            "review_date": "2011-11-27",
            "source": "rt"
        },
        {
            "content": "Great Soundtrack Great Color Great Binoche",
            "review_date": "2011-11-14",
            "source": "rt"
        },
        {
            "content": "A brilliant film filled with incredibly beautiful images!",
            "review_date": "2011-11-14",
            "source": "rt"
        }
    ]
}