{
    "rating": 8.7,
    "release_date": "2003-05-16",
    "num_reviews": 30,
    "genres": [
        "Swedish"
    ],
    "summary": "Erik Ponti's home life is a nightmare. His abusive stepfather subjects him to systematic beatings while his terrified mother turns a blind eye. When Erik (Andreas Wilson) is expelled from school for pummeling an innocent boy, he is sent to an elite boarding school that seems the picture of tranquility. But the school is run by a brutal group of upperclassmen who routinely beat and humiliate weaker students.",
    "reviews": [
        {
            "content": "A boy's boarding school in Sweden where violent discipline is meted out by\nwicked-hearted upperclassmen is forced to change when a new student \nrises to the occasion and faces the head bully and his two underlings with conquering ferocity.\nA David unseats a Goliath and the accepted cruelty at the school.",
            "review_date": "2021-09-15",
            "source": "rt"
        },
        {
            "content": "The brilliant plot is from Swedish establishment private school environment in the 1950's, where strict hierarchic and fascist traditions rule, but where the main character, Erik Ponti, stands up to the rotten culture, but in his own way. Evil is based on a novel by Jan Guillou, which allegedly is partial self biographical. Cinematographically this is solid Swedish quality, and with generally fine performances, both from some of the best among national actors in the adult roles, but most of all from some of the youngsters in the leading roles. However, other minor performances suffer from slight overacting, perhaps not unexpected from so many young amateurs, but still, this and occasional sloppy dialogue is what keeps this from being outstanding.",
            "review_date": "2021-05-12",
            "source": "rt"
        },
        {
            "content": "It's a fascinating film what is Evil with a great start to underrated director Mikael Håfström‘s career and was right for a Oscar for best foreign film with great writing and acting",
            "review_date": "2021-03-20",
            "source": "rt"
        },
        {
            "content": "A story can be done to death, but a story can also be done very well, and here it is! Dramatic and if not occasionally delivered by wit!",
            "review_date": "2015-06-05",
            "source": "rt"
        },
        {
            "content": "Un sobresaliente estudio sobre la violencia humana, sus orígenes y sus alcances.",
            "review_date": "2015-02-06",
            "source": "rt"
        },
        {
            "content": "Definitely brutal at times. It shows an interesting look into the violent way of boarding schools in Sweden back in the day. Since it's in Swedish and my level isn't fully adapted to see how \"bad\" the language is, but it was enough. I definitely wouldn't watch this with children. But I may watch it again.",
            "review_date": "2014-07-15",
            "source": "rt"
        },
        {
            "content": "A high school melodrama film that can't takes you eyes off it. Powerful (even it should get more) and full of surprise.",
            "review_date": "2014-07-13",
            "source": "rt"
        },
        {
            "content": "Opportunity squandered, but remains engaging throughout.",
            "review_date": "2014-05-02",
            "source": "rt"
        },
        {
            "content": "great foreign film about a growing man trying to survive a school full of stuck up bastards.",
            "review_date": "2014-02-22",
            "source": "rt"
        },
        {
            "content": "A solid coming-of-age bully film.",
            "review_date": "2014-01-18",
            "source": "rt"
        },
        {
            "content": "\"The thing that separates humans from animals is not only intelligence, it's also morality. The ability to know the difference between good and evil. You have all behaved like animals. Like vultures. It's undignified!... This has to stop.\"",
            "review_date": "2014-01-14",
            "source": "rt"
        },
        {
            "content": "A powerful film, with at times predictable plot. Has an exceptional performance at its heart from Andreas Wilson as Erik.",
            "review_date": "2013-08-06",
            "source": "rt"
        },
        {
            "content": "Pretty remarkable actually.",
            "review_date": "2013-07-04",
            "source": "rt"
        },
        {
            "content": "he endure... and then he didnt...",
            "review_date": "2013-05-13",
            "source": "rt"
        },
        {
            "content": "Nice to see revenge played-out on film with such intensity and feeling, but never seems to go deeper.",
            "review_date": "2013-05-03",
            "source": "rt"
        },
        {
            "content": "An important movie with a good storyline and acting but I have to say that the slave-mentality that the characters display, including the protagonist until the end of the movie, irritated me a great deal. As it is build upon reel event it is hard to demand it to be different, but none the less, it is my main reason for it not getting more stars.",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "bir cesit super kahraman filmi... kadir inanir style  :)",
            "review_date": "2012-12-04",
            "source": "rt"
        },
        {
            "content": "Reminded me of a Hindi movie 'Udaan', loved the movie, it is available on Netflix instant watch",
            "review_date": "2012-10-02",
            "source": "rt"
        },
        {
            "content": "Very well done, much better than I was expecting  I particularly like the way the director tried to involve the audience in a desire for the lust of violent revenge while the main character mostly chose restraint and non violence to triumph against 'evil'.",
            "review_date": "2012-08-19",
            "source": "rt"
        },
        {
            "content": "Who is really evil...alittle gem.",
            "review_date": "2012-08-17",
            "source": "rt"
        },
        {
            "content": "Filme sobre a hipocrisia de rezar à Deus e depois foder com a vida de todo mundo, esbanjando o seu poder. Uma metáfora pro nosso mundo, basicamente.",
            "review_date": "2012-07-25",
            "source": "rt"
        },
        {
            "content": "A well-made movie, featuring good acting and polished production (perhaps even too polished). The story seems a bit predictable and familiar, and something is lacking in character development - some of the protagonist's actions weren't logical and his transformation didn't convince me.",
            "review_date": "2012-07-21",
            "source": "rt"
        },
        {
            "content": "This movie has no depth. How could this be nominated for Oscar, really...",
            "review_date": "2012-06-10",
            "source": "rt"
        },
        {
            "content": "There is only one word for people like you, and that is \"evil\"",
            "review_date": "2012-05-04",
            "source": "rt"
        },
        {
            "content": "If ever there was a misleading title... The only movie you root for a bully. This is why I love Netflix. Sure it could have every movie blockbuster on Instant Viewing, but what I love is that it has unknown movies like this that we can discover and truly enjoy each minute. Andreas is great as the bully who wants to change his ways, but at the cost of dealing with bullies without violence. Great acting, great direction, and a great movie overall.",
            "review_date": "2012-04-24",
            "source": "rt"
        },
        {
            "content": "It's somewhat like Harry Potter without the magic and weird creatures.",
            "review_date": "2012-04-18",
            "source": "rt"
        },
        {
            "content": "this movie was awesome and it was great to see the bullies got what they had coming to them a great movie from sweden",
            "review_date": "2012-02-18",
            "source": "rt"
        },
        {
            "content": "Hmm.  This one is tricky.  It pulls you in from the get-go, then sort of loses you before pulling you right back in.  I will say one thing, though: the bullying here is rather horrifying and the protagonist's motivations are never doubted.  But the way the school is run here makes no sense, which sort of invalidates much of the effects of the bullying when I reflect on it.  In any case, I feel for Erik and his friend, and things remain interesting enough until the third act, which feels rushed and has a completely different tone than the rest of the film. It's disappointing, but the rest of the film is pretty great.  Pretty torn on the actual quality of the film, but I like it anyway.",
            "review_date": "2012-02-02",
            "source": "rt"
        },
        {
            "content": "I thought this was a really good movie.  If youdon't likesubtitles you won't like it, but I suggest watching if you can find it.",
            "review_date": "2012-02-01",
            "source": "rt"
        },
        {
            "content": "Evil is a poor title for this Swedish tale of physical/mental/societal abuse.  None of the characters in this boarding school tale are truly evil, they're just assholes.  Beyond the improper title, Assholes is a serviceable foreign film that makes the public school system seem like a paradise.",
            "review_date": "2012-01-07",
            "source": "rt"
        }
    ]
}