{
    "rating": 1.0,
    "release_date": "2003-10-10",
    "num_reviews": 410,
    "genres": [
        "Horror",
        "Action"
    ],
    "summary": "Simon (Tyron Leitso) and Greg (Will Sanderson) meet a group of friends and set out to attend a rave on a remote island. When they miss the ferry, they decide to ride with Kirk (Jürgen Prochnow), a smuggler. They find the island deserted and discover that the partygoers have been killed by zombies. Now, the group must evade the deadly creatures and try to find safety. However, the only means of escape -- Kirk's boat -- has been overrun, forcing the survivors to ward off the undead.",
    "reviews": [
        {
            "content": "La película que llevo a la fama a Uwe Boll cuando era tan solo un desconocido, esta es su más grande obra maestra. Una película bastante simple que se siente como una cinta de serie B. Personajes clichés de turno, errores que a veces pasan desapercibidos, unos efectos prácticos bastante buenos y escenas de acción que hacen la cinta al menos entretenida. La diferencia entre esta película y el juego es bastante notoria, aunque trato de ser una precuela del videojuego. Aun así, Uwe se las ingenio para crear algo totalmente repudiable para los fans del juego, pero que al final es una entretenida película que merece ser considerada de culto, ya que el objetivo de Uwe era crear una película así. Tuvo éxito en ello por más que sea una mala adaptación. House Of The Dead resalta bastante entre muchas adaptaciones fallidas y eso la convierte en una película interesante y disfrutable. Mi calificación para esta película es un 7/10.",
            "review_date": "2023-03-11",
            "source": "rt"
        },
        {
            "content": "Still better than The Witcher: Blood Origin",
            "review_date": "2023-01-11",
            "source": "rt"
        },
        {
            "content": "masterpiece. must see",
            "review_date": "2023-01-04",
            "source": "rt"
        },
        {
            "content": "Atrociously Bad Horror/Acton Movie. The acting is clueless (Sadly it looks like they are trying), horrific dialogue, no chemistry, no charm, generic and no likeable characters. At its best the acting is ok (10% of the time) and the rest just beyond bad. The cinematography is.....bad is putting it lightly. Everything looks cheaply made, terrible lit and cheap makeup designs. The camera angles are terrible with no focus and the only consistently is every angle is uninspired and terrible. The music is a weird hardcore hip hop with generic orchestra music that is awful and doesn't work at all. The editing is truly atrocious. Scenes go on way too long like the 10 minute fight to the cabin which is the worst part of the film along with cuts to the video game which don't fit at all and should've been cut. This feels like it wants to be a Action/Horror hybrid but fails at scaring and fails at making you wowed by action. This all leads to a truly awful pacing where you don't care at all about anyone, your not scare, or invested or waiting to see what happens next. you just want this to end because you are bored beyond belief. The story is very basic and the one thing to credit this is there is at least a bare bone flow of story albeit filled with terrible storytelling elements the whole way but at least there is a plot and the camera is tuned on. That's it I don't have anything else positive to say. This was beyond a bad one. No one should watch this. I regret I did.",
            "review_date": "2022-11-17",
            "source": "rt"
        },
        {
            "content": "Después del review de Mariano Rodriguez y de recordar cuando la ví hace 18 años, la considero una estúpidamente PERFECTA mala película!...¡quiero tener la resiliencia del zombie de red negra!",
            "review_date": "2022-10-27",
            "source": "rt"
        },
        {
            "content": "Perfectamente mala, pero sigue siendo perfecta.",
            "review_date": "2022-10-26",
            "source": "rt"
        },
        {
            "content": "Es tan mala... que es buena!!!",
            "review_date": "2022-10-23",
            "source": "rt"
        },
        {
            "content": "Perfectamente mala sigue siendo perfecta.",
            "review_date": "2022-10-17",
            "source": "rt"
        },
        {
            "content": "This is one of the worse movies that I have seen. This is a terrible zombie movie. The middle of the movie with the big fight scene is really bad, One of the human woman comes wearing red white and strips bikini with no weapons just using her fists to fight the zombies. While some of her other campaigns are also have silly weapons as well. The movie gets even more stupid and worse while during the big fight a lot of footage from the actual video game is used. I do not know what the director, editor, the people who made this movie were thinking about this when they are making the movie. Even more this House of the Dead movie, but it takes place on an island and not a house.",
            "review_date": "2022-07-17",
            "source": "rt"
        },
        {
            "content": "Why you would take the name of a super successful arcade game and then not even follow the plot nor even characters is beyond me, this could have been interesting but it just came out as a super cheesy zombie flick, overdone and horrid.",
            "review_date": "2021-09-29",
            "source": "rt"
        },
        {
            "content": "I wish I could give this a 0",
            "review_date": "2021-02-22",
            "source": "rt"
        },
        {
            "content": "Absolutely terrible. BUT. It does have ONE redeeming feature! It's one of those \"so bad it's good\" movies, this film is comedy gold. The best moments are when the film cuts to those random video game scene transitions. They happen so suddenly and randomly. While I am familiar with this films source material, a group of my friends were not. Which made watching this film a 100x funnier and 100x more confusing for them. Highly recommend",
            "review_date": "2020-12-06",
            "source": "rt"
        },
        {
            "content": "this movie is rotten with a tedious script and shit ridiculous characters",
            "review_date": "2020-10-14",
            "source": "rt"
        },
        {
            "content": "Horrible in every single fashion! Not even the hot ladies could save it!",
            "review_date": "2020-10-12",
            "source": "rt"
        },
        {
            "content": "Laughable but not fun. It drags and shocks you with its ineptitude.",
            "review_date": "2020-06-30",
            "source": "rt"
        },
        {
            "content": "Bad direction, lack of suspense, shoddy production values, dull and uninteresting characters, bad editing and acting make this film so bad it's hilarious. The part that got me laughing the most is when Rudolph Curien has a flashback to a terrible action sequence that occurred in the prior scene, Plus, the filmmakers decided to place footage of the video game in scene transitions which is just weird.",
            "review_date": "2020-06-10",
            "source": "rt"
        },
        {
            "content": "The most scary thing about this video game movie is how bad it is. Even if you've never played or even heard of Sega's series of arcade games, you're still likely to piss yourself laughing at the terrible direction, \"stylish\" action sequences that aren't really stylish and awful production values.",
            "review_date": "2019-09-12",
            "source": "rt"
        },
        {
            "content": "This movie makes the worst video game movie you think you seen into a masterpiece. How this movie got a theatrical release is beyond me?",
            "review_date": "2019-08-07",
            "source": "rt"
        },
        {
            "content": "My God this movie was such a pile of shit!!! Characters are fuckin stupid. The script is even more stupid. The action sequences not only have no suspense but they and the direction are way beyond atrocious. They even put shots of the actual game in the movie one of the most stupidest things anyone would ever do. They didn't even try to make this movie good. Fucking idiots think we would enjoy a movie like this. only trashy people will enjoy this movie.",
            "review_date": "2019-08-06",
            "source": "rt"
        },
        {
            "content": "So much hate... really was not that bad. ok a little bad",
            "review_date": "2019-05-17",
            "source": "rt"
        },
        {
            "content": "Worst Zombie movie ever!",
            "review_date": "2019-05-14",
            "source": "rt"
        },
        {
            "content": "I've seen worse, but that's not saying much. This is one movie where you just mumble, \"no... Stop... Don't go in there...\" Because there's no actual point.",
            "review_date": "2018-07-09",
            "source": "rt"
        },
        {
            "content": "I feel Uwe Boll has an undeserved reputation as one of the worst directors working today. That being said, movies like this piece of crap based on a video game are much of the reason why. There is no meat on the story here, just a backdrop set up so cardboard characters can shoot up zombies, and zombies can gang chew characters. Poor acting and the presence of Clint Howard in the cast tell you this is a waste of film and your time.",
            "review_date": "2018-05-20",
            "source": "rt"
        },
        {
            "content": "Why did I watch this movie. It was one of the worst movies I've ever seen.",
            "review_date": "2017-10-29",
            "source": "rt"
        },
        {
            "content": "The first time I saw this movie was on the Syfy Channel and I thought to myself damn that was pretty shitty got a SyFy oginal and then to find out it was a  multimillion dollar film that made SyFy oginals look good",
            "review_date": "2017-05-31",
            "source": "rt"
        },
        {
            "content": "Why does this movie even exist?",
            "review_date": "2017-04-05",
            "source": "rt"
        },
        {
            "content": "Most movies based off videogames are not good. In fact they're pretty much downright garbage. Which brings us to \"House of the Dead\" a 2003 Uwe Boll film adaptation of the popular arcade rail shooter. Some might have 2 questions.\n1. who's Uwe Boll? 2. What's a rail shooter?\n\n\nUwe Boll is a director synonymous with straight to DVD B movie horror/action ; with the \"Rampage\" trilogy, \"In the Name of the King 3\", and \"Bloodrayne\" 2 and 3. I don't know if \"House of the Dead\" got a theater release ,but if so I'm sure it was short lived. \n\nAs for rail shooters. They're your typical arcade shooting games house of the dead, area 51, metal slug. They're games were you're rout is predetermined, most of them move the character for you,you just aim and shoot. There's little dialogue and the plot is simplistic and usually explained in 2 or 3 brief cutscenes. They're still awesome games, but how do you expand on that to make a 90 minute movie? Well after watching \"House of the Dead\" I can tell you this movie is clearly not the answer.\n\nOur main characters consist of two douchey college guys, three hot girls( tough black girl,dumb blonde, and smart brunette), a kermudgenly German boat captain smuggling weapons, a coast guard badass chick, and Clint Howard as the first mate. That's a bad sign when you have a main party of seven actors nobody knows and Clint Howard is the most famous person in this film.\n\nOur group is on their way to the rave of the year which is being held on Isle de Muerte. Despite missing the ferry to the island and the German captains warning, they pay him to take them anyway. They show up to the island of death and find the rave completely deserted and wrecked( they even find a shirt covered in blood); but think nothing of it and pour themselves some beers and try to hookup.\n\nZombies inevitably show up and our troop of morons start running through the woods. The blonde girl gets zombified, and her stupid boyfriend then gets eaten. They run into another group of survivors who were at the rave earlier; including my favorite character ,Liberty(an Asian raver girl in a united States flag jumpsuit who kills zombies with knives and roundhouse kicks).\n\nKirk the German captain shows up to reveal he was smuggling weapons and all hell breaks loose as we get a bad zombie shoot em up; with shitty editing, and horrible techno music throughout. It's so generic that they keep splicing in footage from the \"House of the Dead\" videogame;like they have to keep reminding you that the movie is based on the game.\n\nThere's a Ludacris shoot out scene with a really bad P.O.D sounding song that goes on way too long. Characters and zombies start dieing left and right. There's still not much revealed about the plot. In fact we're not introduced to the villian until an hour and fifteen minutes into a hot and a half movie.\n\nThe villian is an evil scientist who's been doing experiments for centuries and has made an immortality serum( Original :/ ). He's doing some weird stuff to make a perfect being,not really sure; even the short exposition is vague. He bites the dust in a death so ridiculous I won't ruin it if you decide to watch this movie. The movie ends in a cliffhanger thinking there will be a sequel, and guess what? They made \"House of the Dead 2\".\n\nSo as far as bad videogame movies go House of the Dead is upper echelon trash. Is it worth a watch? With enough of your friends to rip on it, it's definitely worth a view. It's by no means good, but it's so stupid and poorly done it's funny.\n\n2/5",
            "review_date": "2017-02-03",
            "source": "rt"
        },
        {
            "content": "A laughably horrible movie.",
            "review_date": "2016-12-24",
            "source": "rt"
        },
        {
            "content": "This flick is so bad its actually *beep* entertaining. Lots of unintentional humor.",
            "review_date": "2016-11-12",
            "source": "rt"
        },
        {
            "content": "One question: was this movie intentionally suppose to be funny? I gave it a star for some of the chuckles I had. Other than that it's a rather juvenile, ill conceived POS that's nothing but a complete waste of time. Drek. Some might argue \"why a full star?\" Well you might say the breast fu had something to do with it :)",
            "review_date": "2016-05-21",
            "source": "rt"
        },
        {
            "content": "It's not fair to write a review for this in my case. Who knows, maybe it got interesting after I fell asleep out of boredom!",
            "review_date": "2016-05-15",
            "source": "rt"
        },
        {
            "content": "save your time and avoid this like the plague",
            "review_date": "2016-02-29",
            "source": "rt"
        },
        {
            "content": "So bad it's funny. You would think that movie makers would get the message--video games do not convert well to movies.",
            "review_date": "2016-01-14",
            "source": "rt"
        },
        {
            "content": "this is down right Appling as an adaptation to a video game i played in arcades it's terrible and insulting, and as a movie its nothing but pain and stupidity.",
            "review_date": "2015-11-13",
            "source": "rt"
        },
        {
            "content": "Not so much a house, more like an island.  Metaphor or not it matters little as this is a dire zombie movie.",
            "review_date": "2015-11-13",
            "source": "rt"
        },
        {
            "content": "Makes the video/arcade game look like high art. Will only be of interest to fanboys for featuring a small role for Erica Durance, billed as Erica Parker, of Smallville fame.",
            "review_date": "2015-09-23",
            "source": "rt"
        },
        {
            "content": "this movie is really bad, like not even so bad it's good, its just plain bad and dumb. The set pieces were terrible, the acting was horrendous, the story and plot were horrible. the fight scenes were laughable.",
            "review_date": "2015-08-25",
            "source": "rt"
        },
        {
            "content": "Ok movie take it or leave it needed a better or and bad acting",
            "review_date": "2015-07-27",
            "source": "rt"
        },
        {
            "content": "This is so unintentionally funny that it circles the drain many times before going down.One of the worst films of the year.",
            "review_date": "2015-06-30",
            "source": "rt"
        },
        {
            "content": "Neither so bad it's good or even dumb fun, House of the Dead may be the worst zombie film ever made",
            "review_date": "2015-06-27",
            "source": "rt"
        },
        {
            "content": "Stupid, silly as all hell, but a tad bit fun because of those factors",
            "review_date": "2015-02-09",
            "source": "rt"
        },
        {
            "content": "Another Uwe Boll video game adaptation means yet another inept effort at making a watchable film. This time we take what I'm sure is a heavily plotted, intelligent and character driven game that demanded a film adaptation (not really) and make it into a boring, generic zombie movie. It's \"House of the Dead\" people, and it sucks. The plot begins with a character informing us that he will be the only survivor. I love it when bad movies spoil their own endings; it's the equivalent a kid with no legs challenging a pro soccer player to a game. At least this movie has the courtesy of letting me know it's garbage right away, instead of jerking me around.\n\nSimon (Tyron Leitso) introduces his soon-to-be-dead friends: Greg (Will Sanderson), Alicia (Ona Grauer), Karma (Enuka Okuma) and Xynthia (Sonya Salomaa, possibly playing some kind of alien that happens to look like a human). They want to go to an awesome rave party taking place on an island but little do they know, the place is overrun by zombies. Hitching a ride there by paying two smugglers (Jurgen Prochnow as Captain Victor Kirk and his first Mate Salish, played by Clint Howard) they are chased by a harbor police officer named Jordan Casper (Ellie Cornell). It's a struggle for survival and a struggle for the audience to resist falling asleep.\n\nThe only good thing about this film is the makeup effects, which are actually pretty convincing. There's a huge army of zombies attacking our heroes and they come in all kinds of shapes and sizes. We've got aquatic zombies that can swim, moss-covered zombies that hide in the dirt, ancient skeletal zombies and even fresh zombies that basically look like regular people but with some blood all over them. If there's one good thing that could come out of this film, it's a recommendation to any aspiring horror filmmakers to hire the costume and makeup artists that were involved in this movie. Everything else is downright terrible.\n\nNot only does the movie drop the ball from the very beginning by telling us exactly who is going to make it out alive and who isn't but it commits the biggest sin in cinema \"show, don't tell\". We don't learn in any way that's organic who the main characters are, we are simply told exactly enough information to distinguish the actors from each other with exposition at the beginning of the movie. Considering the fact that the acting is pretty weak here, maybe it was a last minute decision by director Uwe Boll to avoid as many scenes of the actors talking as possible. Some would give props to the man, but I say next time, just hire real actors\n\nThe plot is utterly predictable, not only because we are told ahead of time what is going to happen (no, I will not let that go), but because it doesn't do anything new when it comes to the zombie horror genre. Basically every scene of people talking is just an excuse to tie together an accompanying scene where the humans are running away from or shooting at zombies. To remind us that this is a video game movie, and also presumably to obliterate any tension that might arise, the film constantly flashes to video game-y scenes. We've got clips of the game the film is based on, as well as \"game over\" type screens for some of the characters that end up biting the dust. I wish I could make up something as stupid as this. Can you imagine if someone re-edited \"Saving Private Ryan\" and called it \"Call of Duty\" by adding \"game over\" screens whenever someone was shot down? Even that movie, which is widely accepted as a masterpiece would be laughed out of theatres, so what chance does \"House of the Dead\" have with its undead-like acting abilities and paper-thin story? The movie can't even stay consistent because only some of the actors are dignified with a death screen. Meanwhile, we get 32 nearly-identical shots of polygon-based undead creatures getting shot in the face.\n\nIt's never particularly scary and even if what the hacks in charge were aiming for was a horror-action movie, leaning more towards action it would still suck the big one. There's a big scene where all of the characters have found an ammo crate (get it? Like in a video game!) and suit up for battle. They make their way to the mysterious \"house of the dead\" and encounter a huge army of zombies. For a while, it's pretty cool to see. Our remaining heroes take down legions of undead using various weapons and fancy fighting moves but the scene drags on and on. It begins by being kind of cool (maybe because before then you were falling asleep) then becomes ridiculous and funny and finally ends by being totally boring.\n\nEven the ending of the movie ends in a big WTF moment that doesn't really make any sense. Even if you had the lowest standards imaginable, and I have been known to exhibit this illness, and basic zombie action with frequent moments of \"girls gone wild\" type nudity would interest you, the plot is so badly written, so poorly acted that there is no way you can enjoy yourself. I laughed at a moment where a party goer refused to go skinny dipping with a hot woman just so he could get killed by a zombie but like so many of Uwe Boll's films, you can't even enjoy this film ironically. It was a chore to get through and while I can, once again, praise the special effects, the surrounding story is terrible and you shouldn't waste your time with \"House of the Dead\". (Director's Cut On Dvd, June 6, 2014)",
            "review_date": "2015-02-07",
            "source": "rt"
        },
        {
            "content": "Jeez, this was really bad. Pretty much everything that was wrong, was very wrong.",
            "review_date": "2015-01-08",
            "source": "rt"
        },
        {
            "content": "La peor mierda que ha cagado Uwe Boll y una de las de la historia.\nP.S: La infame escena del tiroteo es para partirse el \"hoyo\" de risa.",
            "review_date": "2014-11-12",
            "source": "rt"
        },
        {
            "content": "An overlooked masterpiece of modern cinema.",
            "review_date": "2014-07-07",
            "source": "rt"
        },
        {
            "content": "A part of me wonders if this was actually a film? There's a solid case to be made that this was in fact not a film, but just Uwe Bol and his crew quickly running through one of those cheap haunted house shows that open up every Halloween, and counting every customer who paid to have some Party City costumed high school dropout jump out and scream at them as a cast member. I can sleep better at night knowing that was the case and that this wasn't an actual attempt at making a movie that somehow managed to get distribution while other much more talented amateur filmmakers, still waiting for their big break, shake their fist angrily at the sky and yell, \"WHY, GOD?!!! WHY?!!!!!!!\"\n\nFull review at http://silverscreenfanatic.com/2014/06/30/what-the-hell-were-they-thinking-26/",
            "review_date": "2014-07-05",
            "source": "rt"
        },
        {
            "content": "A piece of crap and named one of the worst films ever made and for good reason. This movie is a good example of how to NOT make a good movie. Everything here sucks. The horrible acting, the crappy directing, the crappy dialogue, the uninspired editing, and the stupid, terrible, dull characters. Uwe Boll clearly is in the business to only make money because his directing here is horrendous as hell and you can tell he just doesn't care. This is also one of the most poor examples I have ever seen of a video game movie. Not even the action scenes were enjoyable because they were shot terribly and the filmmakers think that using 360 degree spins with the camera inhance them but they only make them worse. Another bad thing they do is put in images from The House of the Dead video game when they transition to the next scene or when a character is killing a zombie and that made the film even worse. In the end, this becomes a movie that leaves you wandering why they made it.",
            "review_date": "2014-05-10",
            "source": "rt"
        },
        {
            "content": "despite it being overly cheesey, having bad acting and a poor storyline I have to admit there was something about it I kinda liked.  :/",
            "review_date": "2014-05-03",
            "source": "rt"
        },
        {
            "content": "Two words: Uwe Boll.",
            "review_date": "2014-04-27",
            "source": "rt"
        },
        {
            "content": "may as well be one of the worst films of all time",
            "review_date": "2014-04-23",
            "source": "rt"
        },
        {
            "content": "I admit that I enjoyed some of the action scenes, but the plot, dialogue, characters and insistence of including footage from the game are all laughably bad.",
            "review_date": "2014-04-12",
            "source": "rt"
        },
        {
            "content": "It is idiotic, grisly & low budget. But I can not ignore the fact that I sat through the 90 minutes without boring myself, it is campy, goofy and cheesy which make it attractive. \"House of the Dead\" gives a nostalgic feeling of the pleasure you have while sitting through a 70's 80's slasher horror film.",
            "review_date": "2014-04-01",
            "source": "rt"
        },
        {
            "content": "Fun video game, bad movie.",
            "review_date": "2014-03-04",
            "source": "rt"
        },
        {
            "content": "el horror de los horrores...",
            "review_date": "2014-02-08",
            "source": "rt"
        },
        {
            "content": "uwe boll is more infuriating than funny, because even though youre laughing, youre still being overloaded with barely-suppressed racism and sexism. note how no one tries to save a person of color who dies. note how ugh god the sexism is just so obvious come onnnn. note how worthless this is, dont bother. watch The Room.",
            "review_date": "2014-01-03",
            "source": "rt"
        },
        {
            "content": "A painful pile of nothing that spliced in game footage to give a connection to the series. Awful.",
            "review_date": "2013-12-09",
            "source": "rt"
        },
        {
            "content": "I've never openly scorned a film, loudly, in a cinema before this one. But I felt I had to join in the chorus all around me. The only reason I didn't demand a refund is that I didn't pay for this. I feel sorry for anyone that did. This film should be the course material for a class called \"How to Fail at Movie-Making 101\". Implausible story (even for a story including the living dead), completely unlikable cast, boring action and on top of it all everyone is so dumb that you wonder how they made it this far in life without loosing a limb or some other vital thing. Once one of the characters laments his life being over after getting a scratch on his cheek (oh, no, my beauty! Why didn't they kill me??), that was it for me. Much booing and throwing of popcorn happened after that.",
            "review_date": "2013-12-04",
            "source": "rt"
        },
        {
            "content": "I saw this in theatres. Uwe Boll is so bad that it becomes entertaining.",
            "review_date": "2013-10-19",
            "source": "rt"
        },
        {
            "content": "From one of the most untalented directors of our time, comes one of the worst horror films I have ever seen. \"House of the Dead\" takes everything you know about zombie flicks and completely ruins it. Having absolutely terrible actors and a script as bad as they come, this film fails to impress even in it's action scenes. The most commendable thing in this film are the many 360* shots throughout the final scene, but when they start to go on endlessly it get's to be tedious, even though the movie is already tedious enough. It is some of the worst filmmaking I have ever seen in a film. For a 12 million dollar budget, this crew should be ashamed of themselves. It is not scary and it is unintentionally funny the whole way through. \"House of the Dead\" is utter garbage.",
            "review_date": "2013-10-18",
            "source": "rt"
        },
        {
            "content": "The one thing I can give House of the Dead credit for are the scenes that actually simulate the original video game, but other than that it's a bizzarely twisted mess of a film adaption that's only point of existing is to make fun of it!",
            "review_date": "2013-10-03",
            "source": "rt"
        },
        {
            "content": "Hoooo Merci Uwe Boll, encore un de tes films qui puent du bec!",
            "review_date": "2013-10-01",
            "source": "rt"
        },
        {
            "content": "This movie is so BAD. That I wrote review for it, and I don't write reviews",
            "review_date": "2013-09-09",
            "source": "rt"
        },
        {
            "content": "Awful movie. Very stupid, very cheesy, bad action sequences, awful performances. The only thing in its favor is cutting in some clips from the game.",
            "review_date": "2013-09-03",
            "source": "rt"
        },
        {
            "content": "Outlandish as hell, mostly uninteresting characters and massive quantities of information that never needed to exist. One character i did like but he didn't make up for everything else Wasn't a bad ride but it was still a pretty bad movie - something expected of Uwe Boll I hear",
            "review_date": "2013-08-08",
            "source": "rt"
        },
        {
            "content": "only movie ive ever walked out of... and that was a dollar theater",
            "review_date": "2013-07-20",
            "source": "rt"
        },
        {
            "content": "The story is about a group of teens arrive on an island and find it crawling with zombies. This movie has horrible visual effect's and shit directing by the razzie favorite Uwe boll.",
            "review_date": "2013-07-09",
            "source": "rt"
        },
        {
            "content": "Hmm..........Better Than Twilight",
            "review_date": "2013-06-26",
            "source": "rt"
        },
        {
            "content": "It's a general known fact that video game movies are horrible, and this is the prime example why. No amount violence and boobs can save \"House of the Dead\" from being just pure garbage. The story is worthless trash and resemble nothing to the games, the actors are terrible, and the special effects were aged in mid 90's. The constant camera spinning, mixed in footage of the arcade game, and Sega's logo being in the background made me want to vomit. Uwe Boll does not do movies or video games any justice. Easily one of the worst films I've ever watched.",
            "review_date": "2013-06-23",
            "source": "rt"
        },
        {
            "content": "Attack of the Killer Zombies!! Its hard to find a good zombie movie and this was not it. Sega needs to stay with video games.",
            "review_date": "2013-05-31",
            "source": "rt"
        },
        {
            "content": "Hilariously Bad But Extremely Entertaining.",
            "review_date": "2013-05-24",
            "source": "rt"
        },
        {
            "content": "Christ this was bad! story was shit and characters went from scared  pansies to bad ass zombie slayers",
            "review_date": "2013-05-13",
            "source": "rt"
        },
        {
            "content": "I don't remember hardly any of this movie but I do remember hating the crap out of it.",
            "review_date": "2013-04-10",
            "source": "rt"
        },
        {
            "content": "Wow this movie is bad!!!",
            "review_date": "2013-04-04",
            "source": "rt"
        },
        {
            "content": "Uwe Boll movies make for great guilty pleasures.",
            "review_date": "2013-03-18",
            "source": "rt"
        },
        {
            "content": "Close enough to the worse idea and low budget film.",
            "review_date": "2013-03-04",
            "source": "rt"
        },
        {
            "content": "sucked hate when they cut to the game",
            "review_date": "2013-03-03",
            "source": "rt"
        },
        {
            "content": "Only good part of this movie was the hot naked chick on the beach in the white G-String. Other than that this movie is a heaping pile of dog shit.",
            "review_date": "2013-02-24",
            "source": "rt"
        },
        {
            "content": "Uwe Boll. The name alone should serve as the only warning the average viewer needs for this or any of the other \"films\" which litter Boll's excremental catalog. This one is painfully bad as Uwe attempts weak camera tricks, tries to coax unimaginative lines out of his mostly talentless cast and drives yet another nail into the coffin of respectability for poor, hapless Jürgen Prochnow. \n\nIt would be one thing if Boll could provide us with at least a semblance of kitsch. I could respect that - really, I could! As awful as most of Roger Corman's films were, at the very least, he never took himself so seriously that he couldn't bring himself to give us a wink when having the clothes torn off of appallingly objectified women or subjecting us to gruesome, poorly effected close-ups. But Boll? His arrogance prevents him from accepting his mediocrity and we are forced to suffer for his cinematic sins. \n\nThe film industry has provided us with some truly and legendarily hideous directors. It is a rare \"talent\" indeed who can make Tom Six look like Dario Argento by comparison. Bravo, Mr. Boll?",
            "review_date": "2013-02-04",
            "source": "rt"
        },
        {
            "content": "See my review for this at tombofanubis.com",
            "review_date": "2013-02-02",
            "source": "rt"
        },
        {
            "content": "Really, really bad. Depending on how drunk you are will determine how much fun you'll have. On the plus side Smallville's Lois Lane is in it.",
            "review_date": "2013-01-22",
            "source": "rt"
        },
        {
            "content": "I've seen better SyFy-produced films.",
            "review_date": "2013-01-20",
            "source": "rt"
        },
        {
            "content": "A disgrace to the game which happens one of my favorite games of all time",
            "review_date": "2013-01-10",
            "source": "rt"
        },
        {
            "content": "Incredible. Dr. Boll makes EVERY single mistake you could make in a film of this kind, then invents new ones.",
            "review_date": "2013-01-05",
            "source": "rt"
        },
        {
            "content": "Two words: Uwe Boll.",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "Cuando la vi, no sabia quien era Uwe Boll ni nada acerca de su persona... indiscutiblemente hay que saberlo para explicarse el por que de semejantes abortos, y hasta poder disfrutarlos.",
            "review_date": "2012-12-30",
            "source": "rt"
        },
        {
            "content": "one of the worst movies I have ever seen...period.",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "worst horror movie till the date",
            "review_date": "2012-12-25",
            "source": "rt"
        },
        {
            "content": "I only gave this movie a good score because of my weird addiction to terrible horror films.",
            "review_date": "2012-12-23",
            "source": "rt"
        },
        {
            "content": "Sweet Jesus this is horrendously fun.",
            "review_date": "2012-12-11",
            "source": "rt"
        },
        {
            "content": "A few flaws but otherwise enjoyable movie, may be boring moments but only fleeting ones.",
            "review_date": "2012-12-07",
            "source": "rt"
        },
        {
            "content": "Well worth its weight in laughs. Enjoyable enough to finish.",
            "review_date": "2012-11-11",
            "source": "rt"
        },
        {
            "content": "Possibly one of the worst movies that I have ever seen. The plot, the acting and the cinmatrography are all terrible. \n\nUwe Boll is quite possibly the worst director of modern day movie making!",
            "review_date": "2012-11-06",
            "source": "rt"
        },
        {
            "content": "I love horror movies. I love video games. I DON'T like both at the same time! In other words, this movie is the worst I've ever seen in my life, and the video game/live action transitions did not make this movie any better. Your best bet is to just stick to the video game and leave this movie on the shelves.",
            "review_date": "2012-11-02",
            "source": "rt"
        },
        {
            "content": "Absolutely one of the worst movies ever made by the worst director of all time.",
            "review_date": "2012-10-31",
            "source": "rt"
        },
        {
            "content": "Day 14: House of the Dead.  Uwe Boll insists that he isn't a bad director.  Has he seen any of his movies?",
            "review_date": "2012-10-31",
            "source": "rt"
        },
        {
            "content": "The funniest zombie spoof ever made.  Unfortunately I think it's supposed to be an actual horror film.",
            "review_date": "2012-10-24",
            "source": "rt"
        },
        {
            "content": "However accidentally funny, House of the Dead is an ugly, incoherent, mindless muddle of a movie.",
            "review_date": "2012-10-13",
            "source": "rt"
        },
        {
            "content": "uwe boll may be the worst director ive ever seen... he is consistent though... on making pathetic, horribly, hilarious movies.",
            "review_date": "2012-10-02",
            "source": "rt"
        },
        {
            "content": "Probably the worst remake ever! This is so bad, the acting is way beneath avarage, and the plot is dry and not relevant to the zombie genre. This brings shame to all zombie-movies ever made, and that's why it's also the worst.",
            "review_date": "2012-09-29",
            "source": "rt"
        },
        {
            "content": "When the villain of the movie is asked by the main character why he pursued his evil plans to be immortal and the villain replies ''To live forever,'' you know that this movie will be as bad as it sounds.",
            "review_date": "2012-09-24",
            "source": "rt"
        },
        {
            "content": "I like the game better",
            "review_date": "2012-08-23",
            "source": "rt"
        },
        {
            "content": "Pretty action packed zombie film",
            "review_date": "2012-08-15",
            "source": "rt"
        },
        {
            "content": "I'll give this film an extremly generous two stars simply because I laughed so much throughout the film. So bad, it's hilarious. Seriously as soon as the undead attack, these would-be ravers become killing machines. Instantly they become not only accurate with weapons, but deadly knowledgeable of kung fu. Holy crap and the dialogue is so amateurish, it's almost priceless.",
            "review_date": "2012-08-04",
            "source": "rt"
        },
        {
            "content": "Uwe Boll destroys one of my favorite light gun games....its so bad",
            "review_date": "2012-08-03",
            "source": "rt"
        },
        {
            "content": "With twice the budget of Shaun of the Dead, and 1/1000th of the brains, House can't hide behind the excuse of being \"low budget.\"  The closest thing it has to a saving grace is that it's actually more dull and depressing than it is enraging.  While it is filmed far more incompetently than \"Bloodrayne\" was, it also lacks the sense of failed potential that \"Bloodranye\" had.  In the end, it's just Bollsh*t.",
            "review_date": "2012-07-31",
            "source": "rt"
        },
        {
            "content": "saw it, i thought it would be like the game, but they made it into a back story which didn't make any sense",
            "review_date": "2012-07-30",
            "source": "rt"
        },
        {
            "content": "this was just a horrible movie!",
            "review_date": "2012-07-11",
            "source": "rt"
        },
        {
            "content": "Absolutely atrocious.\nBoll defends this with the claim that \"it's just a silly zombie film\" and we shouldn't expect any more than that. Even taking that into account this is still one of the worst and least fun zombie flicks ever made.\nThe film feels like a sub-standard Sci-Fi Channel Original Movie was given a Hollywood budget (and yes, this is even worse than most Sci-Fi Channel Original Movies, which is really saying something). The inept writing and direction is evident in almost every frame, with the cherry on top being Boll's random insertion of blurry gameplay footage from the videogames on which this movie is based, almost as if to remind us that \"yes, this is supposed to be an adaption of the House of the Dead games\".\nFor fans of said videogame, no, this movie has nothing to do with the beloved arcade franchise, aside from maybe the inclusion of zombies.\nThe film is only memorable for its laughably awful moments.\n\n\"You wanted to become immortal. Why?\"\n\"To live forever!\"\n\nIt practically makes fun of itself.\nStill one of the worst movies I've ever sat through and that is a hard honor to achieve considering my passion for bad movies.",
            "review_date": "2012-07-07",
            "source": "rt"
        },
        {
            "content": "What has been seen can not be unseen. I wish that I had teared my eyes out.",
            "review_date": "2012-06-13",
            "source": "rt"
        },
        {
            "content": "One of the worst video game adaptions, next only to BloodRayne.",
            "review_date": "2012-06-02",
            "source": "rt"
        },
        {
            "content": "See this only because it has to be the worst movie ol Uwe has ever directed. I only gave it such a high rating because it is so bad it is funny. You have to watch it to see all the mistakes and inconsistencies. And yes, I would box Uwe in the ring for criticizing him before anyone else makes that stupid comment to me again.",
            "review_date": "2012-05-23",
            "source": "rt"
        },
        {
            "content": "fukkknn swwwweeeetttttt!!!!!!!!!!!!!!!!!!",
            "review_date": "2012-05-19",
            "source": "rt"
        },
        {
            "content": "I feel bad giving this movie half a star, because it really deserves two whole stars less than that. Not even gratuitous nudity could help this pile of crap. Don't watch this, it'll steal a piece of your soul!",
            "review_date": "2012-05-19",
            "source": "rt"
        },
        {
            "content": "Literally watched five seconds of this and realised it was gonna blow. Awful acting, a truly bad script that couldn't even make it into a decent B-movie, direction that proves what people say about Uwe Boll right, laughable action and stunts, somewhat poor zombie make-up, and aside from the zombies, it has nothing to do with the video game it is supposedly based on. If you haven't seen this...erm...don't, you'll regret it if you do.",
            "review_date": "2012-05-17",
            "source": "rt"
        },
        {
            "content": "Hahaha !This is awful! The videogame scenes were kind of entertaining though.",
            "review_date": "2012-05-08",
            "source": "rt"
        },
        {
            "content": "I'm only rating this movie to let you know that even as a zombie lover, this is probably the third worst movie ever made, with Alone in the Dark and Bloodrayne being one and two in no particular order.\n\nHey, that's odd: All three movies were directed by the same person...",
            "review_date": "2012-04-27",
            "source": "rt"
        },
        {
            "content": "Mr. Uwe Boll: stop making movies! All of your movies are horrible crap that should be burned! Like House Of The Dead, which is torture to sit  through due to poor camerawork, awful acting from everyone in the cast, dialouge that is so baffilingly bad that you wonder if this was some kind of joke, a pathetic excuse for a story, and overall just bad filmmaking. Way to ruin a popular video game franchise Uwe.",
            "review_date": "2012-04-26",
            "source": "rt"
        },
        {
            "content": "I wrote this review back when I was in high-school when the film was released in 2003 and it still stands. \"Do not go see house of the dead. Instead pay me the $9.95 to kick me in the balls for an hour and a half. Not only will you have more fun then going to see house of the dead but I would of have had more fun then going to see house of the dead.\"",
            "review_date": "2012-04-25",
            "source": "rt"
        },
        {
            "content": "Bruttissima versione \"anticinematografica\" di un giochino da sala di qualche anno fa. Fare un film su \"House of the Dead\", ovvero un vecchio arcade a gettoni, è già un'idea al limite della stupidità (è come se si progettasse un film ispirato al videogioco \"Point Blank\"), se poi questo è il risultato... era meglio che se ne stavano tutti a casa... Bullet in time e rallenty buttati un pò qui, un pò lì, senza un perchè, e addirittura spezzoni del gioco che compaiono di tanto in tanto, solo per mettere in evidenza il fatto che \"ci si attiene al videogame originale\". Ci vuole coraggio a proporre una cosa del genere....",
            "review_date": "2012-04-23",
            "source": "rt"
        },
        {
            "content": "Terrible terrible movie. The use the Matrix effect to death, bad acting, bad directing. The reason I gave it two stars is because Ona Grauer is great to look at. That's it. Other than that the movie is complete rubbish with hardly any redeeming factors.",
            "review_date": "2012-04-19",
            "source": "rt"
        },
        {
            "content": "Uwe Boll has turned a classic arcade shooter into a terrible zombie flick. Not only does it stray far from the game; it has blarring techno music which doesn't suit any of the action scenes, the fight scenes are long and boring, the use of the video game footage is phoned in, and boring acting. Thare's a movie Erica Durance (who later play Lois Lane in Smallville) won't put on her resume.",
            "review_date": "2012-04-16",
            "source": "rt"
        },
        {
            "content": "I hate uwe Boll, he sucks at every movie he makes, someone needs to lay the smack down on him badly!",
            "review_date": "2012-04-11",
            "source": "rt"
        },
        {
            "content": "I found this movie a waste of my time, horribly lame, and very annoying because several clips from the first three games in the are inserted in the opening credits and throughout the entire movie. ARGGH!",
            "review_date": "2012-04-07",
            "source": "rt"
        },
        {
            "content": "You know the trick with loyalty?  It is where you put your dog and your friend in the trunk of a car for an hour and once you open it up, see who is happy to see you.  Well, if you show this movie to your dog and your friend, you will lose a friend and your dog will attack you.",
            "review_date": "2012-04-06",
            "source": "rt"
        },
        {
            "content": "Boll seems to be not so much honing his movie-craft as discovering it as he films movies. The inept and shoddiness of his work pervades every aspect to the point there is no fun in viewing the material as a guilty or ironic pleasure.\n\nCutting in game footage was baffling, gracefully swimming zombies, poor costumes & makeup and most scenes lacked pace and tension. Oddly he seems to have taken his title too literally and made it about a rave with constant electronica for a soundtrack.\n\nI do give credit for some reasonable stunt work, some decent sets, large scale final battle and being one of the few zombie movies to actually acknowledge the existence of zombie movies... even if his zombies swim rather gracefully.",
            "review_date": "2012-04-05",
            "source": "rt"
        },
        {
            "content": "Full of wonderful cliches.",
            "review_date": "2012-04-01",
            "source": "rt"
        },
        {
            "content": "Since its release, I've always written House of the Dead off as a terrible piece of celluloid that should never have been made. I have since gone back on that statement for a couple of reasons. Don't get me wrong though. I don't consider it to be any sort of a masterpiece, or even craptastic. It still falls into the category of being an awful movie, but there are a couple of things about it that brought me around to it a little bit more. First of all, there are, in my opinion, very overt humorous moments built into the movie. You don't catch them the first time through because you're too busy focusing on how terrible the whole thing is. Second, it has Clint Howard and William Sanderson in it, so that's got to count for something. Third, it has Ona Grauer's amazing cleavage bouncing around at every turn. Fourth, it's a very good adaptation of the game. Some might call me crazy for saying that, but if you've ever played the game, you know how terrible the story, the story logic and the dialogue is in those games. This movie matches that successfully. It's not that Uwe Boll knew what he was doing or anything (Alone in the Dark proves that), but his lack of talent makes it all work somehow. I can't say that I'd want to stick this on very often, but I did find it slightly more enjoyable this go round and I guess that's the most positive thing I can say about a movie everybody is so negative about - including myself.",
            "review_date": "2012-03-31",
            "source": "rt"
        },
        {
            "content": "I could say great things about this movie, but i'd be lying if I did.",
            "review_date": "2012-03-31",
            "source": "rt"
        },
        {
            "content": "this is uwe's 'citizen kane.'",
            "review_date": "2012-03-31",
            "source": "rt"
        },
        {
            "content": "Oh gosh what happened to this, I loved the game adaptation, but the film was nothing like it. \nHouse of the Dead is a very unnecessary game adaptation, with horrible plot, horrible performance, and why in the hell would they have scenes from the game. Are they trying to make this flick more cheesy then it already is. \nAlthough I did not mind the gore, but how ridiculous the film is made, makes it that  much worse. Waste of space and time. Avoid!",
            "review_date": "2012-03-28",
            "source": "rt"
        },
        {
            "content": "How does this director keep getting job offers?",
            "review_date": "2012-03-18",
            "source": "rt"
        },
        {
            "content": "Was surprised to see actual not made up names for the writers on this film. Lots of action, no great plot or acting. What's scary about this piece is a sequel exists.",
            "review_date": "2012-02-12",
            "source": "rt"
        },
        {
            "content": "So bad its.....fucking terrible!",
            "review_date": "2012-02-08",
            "source": "rt"
        },
        {
            "content": "That guy on the cover is my sexy Zombie hubby",
            "review_date": "2012-01-25",
            "source": "rt"
        },
        {
            "content": "Somebody please kill me if I see this movie again especially if I'm playing The House of the Dead in an arcade. This movie is bad!!!!!!!!!!!!!!!!!!!!!!!!!!!",
            "review_date": "2012-01-25",
            "source": "rt"
        },
        {
            "content": "Now Uwe Boll become the worst Director like movie \"Ed Wood\".",
            "review_date": "2012-01-19",
            "source": "rt"
        },
        {
            "content": "a boring and dumb zombie movie ever seen!!!!\ni suggest u guyz eva neva try2 watch it..",
            "review_date": "2012-01-15",
            "source": "rt"
        },
        {
            "content": "Pretty good \"bad movie\"",
            "review_date": "2012-01-05",
            "source": "rt"
        },
        {
            "content": "One of those movies that truly challenge the rating system; how can I give this the lowest score that it deserves when it made me laugh more than most of today's comedies?",
            "review_date": "2011-12-14",
            "source": "rt"
        },
        {
            "content": "Truly awful, however entertaining and enjoyable if you watch it more for its comedic value. When the best part of your movie is a Captain Kirk reference, you might want to scrap the film. The incorporation of the crappy game graphics along with the actual film make it that much more horrible/awesome.",
            "review_date": "2011-12-13",
            "source": "rt"
        },
        {
            "content": "Uwe Boll's zombie movie is one of the worst films in the history of cinema. Uwe Boll has gotten himself the reputation of being one of the worst Hollywood directors in history. Based on a popular video game, House of the Dead is a poorly made film that is beyond awful. House of the Dead will disappoint harden zombie fans because this is poorly conceived trash. This film has one thing going for it, it's unintentionally humorous. This film is so bad, that it's hilarious. Uwe Boll actually placed video games scenes in his movie to give it a \"video game\" type feel. Instead, it's hilarious. The use of cinematography is criminal in this film. Now, I'm an epileptic, and whenever the camera started spinning, I had to cover my eyes because it felt like I was going to have a seizure. If you're looking for a good, entertaining zombie film, you won't find it here because Uwe Boll can't write an effective plot to his films (under the very rare occasion, he's managed to direct two or three watchable films). However, House of the Dead is not watchable, this is a film with no plot, and bad acting, bad special effects, and it feel like a sci fi channel made for TV movie. House of the Dead is yet another prime example as to why video game to screen adaptations do not work. Occasionally they do, but not in the case of Uwe Boll's House of the Dead. If you're looking for a good zombie action film, watch Resident Evil instead, and skip this film. You'll be glad you did.",
            "review_date": "2011-12-10",
            "source": "rt"
        },
        {
            "content": "A few friends take a fishing boat captained by a smuggler to a remote island where a rave is going on. When they arrive, they find the island deserted, save for a few hundred zombies led by an unknown force. I never played the video game this was based on and even if I had, it still wouldn't have affected my rating of this film. It has a poor storyline, questionable characters possessing fighting abilities out of thin air and a final baddie with a stupid agenda for all the mayhem. I wouldn't even call this a zombie film because the undead seem to die from any kind of strike being given. The camera shots, when the characters are in battle, have seizure-like qualities and the random screen shots of the game are just idiotic. There really isn't much to say about this film, except Ona Grauer's breasts seem to be a jewel when shown in slow-motion sequence.",
            "review_date": "2011-11-11",
            "source": "rt"
        },
        {
            "content": "Fail... Fail... Fail... Fail... just fails in every way possible... awful, filled with cheap scares, poor acting, very cheesy... another video game adaption that insults the success of the video game itself... my advice skip this waste of film",
            "review_date": "2011-11-06",
            "source": "rt"
        },
        {
            "content": "This movie is so bad that it is kind of good.",
            "review_date": "2011-10-29",
            "source": "rt"
        },
        {
            "content": "The movie itself is not that bad, I mean the action does look awesome, and the zombies do look great, the effects are pretty good. The acting is pretty decent, the plot is pretty interesting too, and also it does look kind like the game, and it's true I did play the game, and it was a fun game, and I know everybody hate Uwe Boll, and I've read everything about him, and stuff, but I don't hate him, because he one of my top 10 directors, and look he didn't do this on purpose at all, he just trying to see what can do he do to make a decent movie, although I dislike one scene from this movie, and that is when they show us the video game scenes, but I think I know why they showed us those, maybe because they were trying to show us how to beat the game more often, and I got to admit that is kind of clever to put that on there.\n\n3.5/5 stars",
            "review_date": "2011-10-18",
            "source": "rt"
        },
        {
            "content": "the worst zombie movie ever made, and in a genre like that thats really saying something, dont get me wrong it can be fun, its very unitentionly funny, atrociously made, i dont reccomend",
            "review_date": "2011-10-18",
            "source": "rt"
        },
        {
            "content": "Folks, why is movies based on  seems to suck monkey tits? I mean think about it- Doom, Max Payne, Prince of Persia: The Sands of Time, Final Fantasy-The Spirits Within, Mortal Kombat: Annihilation, Double Dragon, Super Mario Bros, the two Street Fighter movies, the Resident Evil franchise and all those fricking Uwe Boll films sorry. But one Uwe Boll film and it's a zombie action horror film that's worse than Resident Evil is House Of The Dead. House Of The Dead is another film that was based on a zombie action horror video game and it sucks but worse than Resident Evil. What a disaster I mean it what a disaster! Pirate zombies, random red cuts and random  footage...this film was just so laughably horrible that I just didn't give a shit about the plot. The pirate zombies plot kinda made sense but it was too ridiculous the red cuts were stupid and the video game footage inserted directly into the film was just so mind-boggling. The film in general was so laughably horrible I mean shooting games aren't that hard to convert into film but this is just pushing it. Uwe Boll, one of the worst directors out there made it possible to make a movie worse than this let's see: Far Cry-no. Dungeon Siege-no, Alone In The Dark-OH GOD HAS THE MIGHTY FALLEN!!!!!! So yeah House Of the Dead blows and I give it a 2/10.",
            "review_date": "2011-10-17",
            "source": "rt"
        },
        {
            "content": "this was a great horror movie.",
            "review_date": "2011-10-13",
            "source": "rt"
        },
        {
            "content": "An Uwe Boll movie, does anything else even need to be said? The story is bullshit, the acting is bullshit, the directing is bullshit, the cutting is bullshit, the zombie effects are bullshit and the characters die just because the movie needs them to die. They literally just walk into the zombie horde to die, the movie doesn't even try to explain why they do that... This is crap. Pure, ranking, horse-shitted crap, there's just no other way to describe it. I would gladly gouge my eyes out rather than see this movie again. It's that bad.",
            "review_date": "2011-10-11",
            "source": "rt"
        },
        {
            "content": "Stop spinning the fucking camera Uwe!",
            "review_date": "2011-10-09",
            "source": "rt"
        },
        {
            "content": "Truly awful, however entertaining and enjoyable if you watch it more for its comedic value. When the best part of your movie is a Captain Kirk reference, you might want to scrap the film. The incorporation of the crappy game graphics along with the actual film make it that much more horrible/awesome.",
            "review_date": "2011-09-26",
            "source": "rt"
        },
        {
            "content": "It's a huge blow to every branch of entertainment media! But back then, we were still not familiar with Uwe Boll, whom critics now know as a German Ed Wood.",
            "review_date": "2011-09-19",
            "source": "rt"
        },
        {
            "content": "Had I taken to heart the adage \"if you have nothing nice to say, say nothing at all\" I would not be writing this. I am not a film critic. I know nothing of the craft of making making movies. I, however, realize that there is something fundamentally amiss in us as humans when things such as 'House of the Dead' are allowed to exist.\n\nAccording to IMDB this 'film' was produced to the tune of $7,000,000 USD.\n\nYou watch TV, right? Who doesn't? Don't you hate when you turn on the old boob tube and see some poor starving kid clogging up screen space? I hate seeing that shit! Makes me feel guilty as hell. \"For only $.35 a day you too could support little Whatshisface or Whosehername or a child like him or her.\" Ok, Starving Kids Foundation let's do some math. $7,000,000 is 20 million kids for one day. Or let's just say a kid is only a kid until they can help out the family by working at the local Nike factory. We'll say 12 years old. That means that if this film never existed and some nice investor gave the money instead to the Starving Kids Foundation, said foundation could feed 4,563 kids until the age of 12. Instead we have 'House of the Dead'.\n\nWhat is there to say that has not already been said? The only reason to write another review of this movie is to demonstrate your creative ability in thinking up further insults for it. Flaming pile of dog shit. Already been used? Damn. Like watching a late term abortion performed with a piece of jagged glass by a drunk man. Mildly creative. So terrible it will literally give you AIDS. Kinda funny.\n\nMore succinctly: if I were a billionaire my first priority would be to buy a giant robot suit (starving kids be damned). Think Gundam. My second priority would be to send out a message to every person who is in possession of this movie on DVD or film. I would offer a bounty. This would include all people who bought it on DVD ironically as well. I would buy all instances of this film and have them destroyed. Further, I would purchase Boll KG and have it disbanded and all workprints of this movie destroyed so as to make it impossible for anybody to ever reproduce it. Further, I would purchase Uwe Boll's assurance to never make another movie again under penalty of nutsack punching. Everyone has a price.\n\nThis movie is so bad that, ideally, I would figure out a way to retrieve the electromagnetic wave broadcasts of this movie from space so as to not accidentally subject space aliens to watching it. Have them stick to 'I Love Lucy'.\n\nAnd so why did I watch it? Well, because I love zombies. Why did I finish watching it? Because I had a deer in the headlights reaction. My fight or flight response did not kick in and consequently I was run over by this film. No. I was run over, then backed over, then backed over again, then doused in gasoline and lit on fire by this film.\n\nTotally and completely abysmal.",
            "review_date": "2011-09-13",
            "source": "rt"
        },
        {
            "content": "The 52nd worst film ever made according to current IMDB rankings, haha.\n\nIt's awful, but it's not utterly, unredeemably awful (1/2 a star) I feel, since the non-stop action makes it kind of fun. It's one of those \"it's so bad it's good\" films.\n\nI watched it for two reasons: Erica Durance and because I like the House of the Dead games that I've played.\n\nIt was stupid the way they kept splicing game footage in here, as if they're going \"look - we ARE sticking to the games\". But they really needed to put a hell of a lot more effort into this - craft a better story and not have the dialogue and general feel be so silly.\n\nThe action was a mix of intricate and over the top camera swirls and slow motion, and the zombie costumes were mostly shoddy.",
            "review_date": "2011-09-06",
            "source": "rt"
        },
        {
            "content": "Play the game instead.",
            "review_date": "2011-09-05",
            "source": "rt"
        },
        {
            "content": "House of the Dead is something you wouldnt see alot in the day now. A Guilty Pleasure. In fact this movie is so bad its very fun to watch. So mostly its about a bunch of people on a island going to a rave but.... THE PEOPLE ARE INFECTED WITH THE T-VIRUS! We Got Bad Acting, Bad Everything. But its watchible. The Best part of the film is the 10 minute shootout. But the main thing about it is this one scene where a zombie throws a axe. A girl jumps in the air and shoots him. We see the bullets in slowmo hitting the zombie. KA BOOM! Its all fun. I suggest checking it out on TV",
            "review_date": "2011-09-04",
            "source": "rt"
        },
        {
            "content": "Omg what a CHEESY movie! That was an hour and a half of my life I'll never get back!",
            "review_date": "2011-08-28",
            "source": "rt"
        },
        {
            "content": "Walked out of the theatre...Absolute garbage of a film.",
            "review_date": "2011-08-25",
            "source": "rt"
        },
        {
            "content": "Poorly written, poorly directed and poorly acted. The only thing that was in my mind the entire time was why in the world was Clint Howard in the movie?",
            "review_date": "2011-08-19",
            "source": "rt"
        },
        {
            "content": "Un engendro despreciable a todos los niveles. No es que se pueda esperar mucho de la adaptaciÃ³n al cine de un shooter de zombies, pero es que el invento no funciona ni como pelÃ­cula de acciÃ³n, ni de terror ni de comedia involuntaria. Cualquier mÃ­nima posibilidad que hubiera tenido la historia en alguno de estos campos (que no la tenÃ­a...) queda totalmente exterminada por la birria de realizaciÃ³n, montaje, guiÃ³n e interpretaciones, agravados por una banda sonora electrÃ³nica machacona y lamentable y por unos reiterativos y patÃ (C)ticos insertos del videojuego original. No hay por donde cogerla.",
            "review_date": "2011-08-19",
            "source": "rt"
        },
        {
            "content": "Anything with Zombies is a hit with me. More Zombies!!!",
            "review_date": "2011-07-31",
            "source": "rt"
        },
        {
            "content": "Much like with Battlefield Earth, I find myself enjoying House of the Dead more as time goes by. It's badly written, horribly acted, filled with gratuitous violence and sexual content, terrible special effects, random splices of The House of the Dead video game thrown in recklessly, and the music is campy as Hell (Black Tiger's \"Fury\" is gloriously cheesy). It's pure, B-movie nonsense that will repel and disgust most viewers (Rightfully, so), but House of the Dead offered me pure fun from beginning to end. I came for splattery gore, ridiculous action scenes, shameless sexual content, and whatnot like the lover of trash I am, and by God, I got what I fucking wanted. Behold it in all of its hilarious, ineptly made glory.",
            "review_date": "2011-07-23",
            "source": "rt"
        },
        {
            "content": "This movie is just as bad as its so called director. This movie makes a Scifi channel original movie look like Citizen Kane, by comparison. It is insultingly bad, it seems that Uwe Boll's only mission in life is to make crap, he doesnt care as long as he makes money.I hope he doesnt challenge me to a boxing match for writing this negative review.",
            "review_date": "2011-07-21",
            "source": "rt"
        },
        {
            "content": "There are a lot of films out there, that are so bad they're good...unfortunately House of the Dead is NOT one those films. House of the Dead is actually of a rarer breed, it's so bad it's painful. While watching it, you can actually feel each of your individual brain cells explode, for they can not comprehend that something so horrible exist. Between the atrocious acting(that would make even the very worst of porn stars blush)and the nonsensical script and plot, lies something much...much worse...the directing of Uwe Boll. Uwe Boll has become quite the icon, because he stands for what most filmakers strive not to be. Having not known who Uwe Boll was, or his history prior to seeing this \"film,\" I went in expecting to watch something so horrible, that it would be entertaining...well by now you know how that went. I've had more fun hanging out at abortion clinics than I did watching this atrocity. The worst \"film\" I've ever seen.",
            "review_date": "2011-07-20",
            "source": "rt"
        },
        {
            "content": "THE WORST MOVIE EVER! BURN THIS SHIT NOWWWWWWWWWWWWWWWWWWWWW",
            "review_date": "2011-06-30",
            "source": "rt"
        },
        {
            "content": "This is a very bad film, however its quite enjoyable to watch so I don't hate it as much as I probably should. Uwe Boll is a rather hated director, and this film received many negative reviews for a good reason. The editing is very poor, storyline is messy, characters are stereotypical and the random flashes of the video game make no sense. However, put all that aside and there's actually a pretty funny film that I enjoyed watching so it's not all bad, but certainly not all good either.",
            "review_date": "2011-06-15",
            "source": "rt"
        },
        {
            "content": "Brains... brains... this movie has no brains...\r\n\r\nTHE GOOD\r\nTwo things are good about this movie. The theories about the zombie deterioration actually makes some sense and the action scenes are just OK.\r\n\r\nTHE BAD\r\nActors were terrible. If fact, who are they? I don't recognize anyone. The camerawork is a total eyesore and the script is just awful. Uwe Boll, you should be ashamed of yourself.\r\n\r\nTHE BOTTOM LINE\r\nThis film is just another video game adaptation failure. Wait till I become a director, I'll show 'em how to do it!",
            "review_date": "2011-06-06",
            "source": "rt"
        },
        {
            "content": "House of the Dead is perhaps one of the worst video game movies of all time. Why? It's directed by Uwe Boll. That says a lot. For those of you who do not know who Uwe Boll is, he is a German director who has a reputation for making some of the worst movies of all time, but considers them to be good and has no intentions of retiring. He's widely considered to be the new Ed Wood. For those of you who don't know who Ed Wood is, well, google him along with Uwe Boll if you like. Anyway, this movie is almost nothing like the game it was based off of. It feels like somebody made an original zombie film and slapped the House of the Dead title on it. It's not even set in a house. The whole thing takes place on an island. None of the characters from the game appear either. They're all movie-exclusive characters. Most of the actors are pretty much all unknowns, with the exception of Eliie Cornell, Jonathan Cherry, Jürgen Prochnow, and Clint Howard. They had done some mentionable work before this. The acting wasn't exactly spectacular either. One thing I don't understand is why Uwe Boll decided to splice in footage of the actual gameplay during the action scenes. Maybe that was the only way to connect the movie to the game? Since nothing else really seemed to follow. Whatever the case, I found it to be annoying and completely distracting. Honestly, this movie probably would have been pretty good if it wasn't called House of the Dead and didn't have the video game scenes. The only things in common the movie had with the games were the enemies, a first person shooter scene toward the end, and the main Character Rudy's last name being Curien. Other than that, it's really got nothing to do with the classic arcade game. As a zombie movie, it's not too bad. As a House of the Dead movie, it's awful. If you have never played a House of the Dead game and know absolutely nothing about it, than you may like this movie. But fans of the games, you might want to stay away.",
            "review_date": "2011-05-26",
            "source": "rt"
        },
        {
            "content": "This one's dead on arrival. Avoid",
            "review_date": "2011-05-18",
            "source": "rt"
        },
        {
            "content": "I've only seen about 20-30 minutes of it. And I wanted to punch someone in the face for how awful it was.",
            "review_date": "2011-05-16",
            "source": "rt"
        },
        {
            "content": "My GOD, was this stupid! F-",
            "review_date": "2011-05-15",
            "source": "rt"
        },
        {
            "content": "DO NOT SEE THIS MOVIE IF YOUR LIFE DEPENDED ON IT!!!!!! Grade: F      If I could go lower than an F, i would give it that.",
            "review_date": "2011-04-18",
            "source": "rt"
        },
        {
            "content": "this film wuz nothing but laughs",
            "review_date": "2011-04-13",
            "source": "rt"
        },
        {
            "content": "I know that this is one of the most universally loathed horror films . . . well, ever.  But I just can't bring myself to hate it.  This film is like my (non-existent) teenage brother.  He keeps screaming over and over again \"Look what I can do!\" and \"Dude, do you know what would be cool?!\"\n\nI can't stand the idea of hurting his feelings by mocking his choice.  So I remove my Glasses of Cynicism (otherwise known as my cynicles) and I take a look at House of the Dead the way that he wants me to see it.\n\nYeah, it has its moments.  It really, truly does.\n\nIt has topless girls - several.  It has zombies.  It has a creepy house.  It has the longest and most drawn-out action sequence I've ever seen (if you don't count The Matrix franchise).  There are 360s.  There are underwater zombies.  There is a sword fight.   I AM GETTING ENTHUSIASTIC JUST WRITING ABOUT IT!  YEAH!\n\nHouse of the Dead?  Yeah, see it.  But take off your cynicles first.\n\nI reviewed House of the Dead in depth on Stream of Screams here: http://specterphage.wordpress.com/2011/04/26/hulu-horrors-house-of-the-dead/",
            "review_date": "2011-04-11",
            "source": "rt"
        },
        {
            "content": "almost the worst thing I have ever seen....",
            "review_date": "2011-04-04",
            "source": "rt"
        },
        {
            "content": "this fucking movie shouldnt have ever been made",
            "review_date": "2011-04-01",
            "source": "rt"
        },
        {
            "content": "I heard it was bad.....but I was expecting to be in a minority that could like it. Sadly not.\n\nI did, however, like that they had put in quick shots of actual game footage in there during a couple of action scenes. That's the only good thing I have to say, sadly.",
            "review_date": "2011-03-23",
            "source": "rt"
        },
        {
            "content": "basically the worst movie ever but it's so bad that it's kind of awesome",
            "review_date": "2011-03-11",
            "source": "rt"
        },
        {
            "content": "Oh, Uwe Boll. Should be called \"Scantily Clad Women Who Don't Get Blood on Their Clothes While Slaughtering Zombies.\"",
            "review_date": "2011-03-08",
            "source": "rt"
        },
        {
            "content": "what a piece of god forsaken ridiculously boring flaming shit from the 9th dimension of hell!!! i cant believe this made it to theatres this shouldnt even exist",
            "review_date": "2011-02-28",
            "source": "rt"
        },
        {
            "content": "Why does Uwe Boll find it necessary to make films out of halfway-decent video games from the 1990s? A cast of nobodys giving wooden performances, it might make up for it in the directing.\r\n\r\nNope.\r\n\r\nBoll proves once again that he will only direct a movie if he can making it worse. Seriously, if this idiot can become a director, anybody can! This is a cruel world, and it's made even crueler by Boll's presence, and that he continues to put his ideas on celluloid.",
            "review_date": "2011-02-27",
            "source": "rt"
        },
        {
            "content": "Gatta stop takin advise from inter-net people ...it is BAD",
            "review_date": "2011-02-20",
            "source": "rt"
        },
        {
            "content": "God this has to be the biggest joke for a horror movie out there. An idiot plot, filled idiot characters and idiot zombies(Apologies to zombies everywhere).  The effects are crap and the action scenes just drag on and on and on and fricken on. The director trys to remind the audience(what little of an audience he has) that this is a movie adaption of the popular House of the Dead arcade series by showing us clips of the game which look even better than what you'll find in this turd. Overall-AVOID!!!!!",
            "review_date": "2011-02-20",
            "source": "rt"
        },
        {
            "content": "*(May be redeemed by unintentional amusement)",
            "review_date": "2011-02-06",
            "source": "rt"
        },
        {
            "content": "Video game turned into generic zombie film with the always original \"attractive teenagers in remote location\"-setup. With unlikable characters, unconvincing zombies and a stupid plot, House of the Dead flies low even by Uwe Boll's standards. And honestly, who thought the game clips and the seizure-inducing editing were good ideas?",
            "review_date": "2011-01-19",
            "source": "rt"
        },
        {
            "content": "If you're looking for a good laugh then this is the film for you.",
            "review_date": "2011-01-13",
            "source": "rt"
        },
        {
            "content": "UWE BOLL IS THE MOST RETARDED FILMMAKER EVER!",
            "review_date": "2010-12-28",
            "source": "rt"
        },
        {
            "content": "This shit movie deserves less than 0.5/5.. i'm just being generous.. it's like.. someone made a piece of shit.. and filled it more wit shit inside... it's pure shit",
            "review_date": "2010-12-09",
            "source": "rt"
        },
        {
            "content": "I like this movie, this movie is really scary, this movie is just as good as the game, and I like Uwe Boll, he makes good movies. I played the game, and I've seen the movie, and I like them both.",
            "review_date": "2010-11-30",
            "source": "rt"
        },
        {
            "content": "To say the movies on autopilot is to say it has an actual sense of direction. Mindless doesn't begin to explain why this movie is horrible. There's such ineptitude in this movie its both hilarious and sad. It gets a full star because, really, this is the type of movie you watch with friends and make fun of.",
            "review_date": "2010-11-15",
            "source": "rt"
        },
        {
            "content": "This movie melts your brain with stupidity from the horrible actors, a cliched plot and cliched scenes. Another mess from Uwe Boll!",
            "review_date": "2010-11-09",
            "source": "rt"
        },
        {
            "content": "\"SO BAD IT ALMOST MAKES ED WOOD COMPETENT!\"",
            "review_date": "2010-11-05",
            "source": "rt"
        },
        {
            "content": "another video game movie failed very cheesy action scenes, they got everything wrong don,t bother make another video game movie",
            "review_date": "2010-10-23",
            "source": "rt"
        },
        {
            "content": "Watching House of the Dead, i felt like i got shat on by a german buffalo, dragged through a pile of puke, pissed on by a whale with gonorrhea and getting a part of my IQ eaten, digested and gulped out by Uwe Boll himself.\r\n\r\nI feel too generous by giving it one and a half stars. It doesn't even deserve one. I can't do it justice in some way... but why should i anyways?",
            "review_date": "2010-10-14",
            "source": "rt"
        },
        {
            "content": "En tant que film c'est inepte, mais c'est fascinant, la preuve il a une caméra qui tourne à une centaine de km/h et qui accélère... Des rails dans le champ, des coupes intempestives,et surtout une absence de... maison.",
            "review_date": "2010-09-21",
            "source": "rt"
        },
        {
            "content": "Un gran pedazo de porqueria de pelicula, historia pésima por no decir una porquería, mucho abuso de camara lenta (que ni le llega a los talones a la manera magnífica de usar camara lenta de Zack Snyder), malas actuaciones de los zombies (ademas de ser estúpidos), personajes muy tÃ­picos, historia que no tiene nada que ver con el juego. Espero que se mantengan alejados de esta pelicula.",
            "review_date": "2010-09-18",
            "source": "rt"
        },
        {
            "content": "Abysmal in every way.",
            "review_date": "2010-09-13",
            "source": "rt"
        },
        {
            "content": "A lot of people hate Uwe Boll and his movies, but fuck it, I love them. You turn off your brain and they're a lot of fun to watch. Really entertaining.",
            "review_date": "2010-08-29",
            "source": "rt"
        },
        {
            "content": "great cheezy b flick, for those of us who like that sort of thing...",
            "review_date": "2010-08-21",
            "source": "rt"
        },
        {
            "content": "Anyone who has a good thing to say about this clearly suffers from the same brain damage as the director.",
            "review_date": "2010-08-16",
            "source": "rt"
        },
        {
            "content": "[0/10] My eyes and ears bleed... Make no mistake, this is one of the very worst films ever made. Uwe \"Toilet\" Boll should be ashamed. Facebook should enable zero ratings.",
            "review_date": "2010-08-15",
            "source": "rt"
        },
        {
            "content": "If it were a regular zombie movie with no relation to the video games, it'd be acceptable...The 360-degree pans, Filipino roundhouse kicker Liberty, Ellie Cornell getting revenge on the horror genre for the death of Rachel Carruthers by upping her firepower. As is, there are dead people everywhere and it's a shame Uwe Boll isn't among them.",
            "review_date": "2010-08-13",
            "source": "rt"
        },
        {
            "content": "By far one of the worst films i have ever seen. It had potential to be brill and i'm a huge fan of the games but nothing in this film worked. The plot was none existant, the stupid slow motion effects when the characters died was so bad and where was the blood? This is one of the reasons why i think Uwe Boll should have been sent to this island or one where he couldn't torture us with his shit films. Has anyone seen his other film 'Seed'?\r\nIt doesn't even deserve half a star but i like the games.",
            "review_date": "2010-08-13",
            "source": "rt"
        },
        {
            "content": "It's not too bad they could have made it better",
            "review_date": "2010-08-12",
            "source": "rt"
        },
        {
            "content": "house of the dead more like house of the stupid this movie sucked",
            "review_date": "2010-08-12",
            "source": "rt"
        },
        {
            "content": "My opinion, the worst video game adaptation. Let me say this first, there is ONLY one action sequence, ONE. I was so pissed because this is a zombie film and the zombies in this film are like smart and fast and I hate it! The zombies don't look like any zombies, f*cked-up freaks. The acting is terriible haha just terrible. In the video game series, the setting isn't set on an island. There are some nudity scenes which were unnecessary. One with a girl shirtless washing dishes and the other swimming. The plot is awful, no relations to the video games. \nMy most annoying thing about this film was that it was showing actual gameplay from the video games. One stupid idea for a movie that should've been good.\nI don't have a favorite part in this film because the whole movie sucked.\nThe plot is very stupid. The acting is terrible. Action sucks. House of the Dead sucks.",
            "review_date": "2010-08-09",
            "source": "rt"
        },
        {
            "content": "You ever seen a movie that is a total piece of shit? This is one.",
            "review_date": "2010-07-27",
            "source": "rt"
        },
        {
            "content": "Possibly the worst film of the decade!",
            "review_date": "2010-07-27",
            "source": "rt"
        },
        {
            "content": "They say Uwe Boll is the worst director it the world. And they say this is his worst film. 'They' would be about right. Who would have thought arcade shoot 'em ups don't transfer well to the big screen.",
            "review_date": "2010-07-25",
            "source": "rt"
        },
        {
            "content": "This movie is ridiculously corny and stupid. So much so, that I found myself laughing at the awfulness this movie possesses. Nonetheless, I was entertained, but for the wrong reasons. Seriously though, \"Zombie Island\"? It's an \"R\" rated version of the Scooby Doo movie, and that's no exaggeration.",
            "review_date": "2010-07-23",
            "source": "rt"
        },
        {
            "content": "Really? Whoever vomited such putrid offspring into this wide world certainly has talent. And for that, I can't suggest staying completely away from Bol's bungfest of a movie. You'll laugh like I did and possibly even give-up out of sheer boredom. Not that I'd blame you.\r\n\r\nAnyway, The House of The Dead is just that; a house filled with rotting corpses who are actually poorly-acted faux-zombie suit wearing \"actors.\" The most awful of Necrostink.",
            "review_date": "2010-07-17",
            "source": "rt"
        },
        {
            "content": "Really, really, bad.  The only thing that could make this any worse is a sequel titles \"The Typing of The Dead\"\r\n\r\nYes, that is a real game based on the original.",
            "review_date": "2010-07-04",
            "source": "rt"
        },
        {
            "content": "Rudy: You did all this to become immortal. Why? \r\nCastillo: To live forever! \r\n\r\nWoeful Zombie movie. Like the basic concept (zombies attack a rave on a mysterious island) but a rubbish script, nonsensical plot and terrible acting all in the hands of an atrocious director just doesn't combine to produce a masterpiece. Still some entertaining pieces like the asian girl raver in an american flag jumpsuit using martial arts on the zombies. Overall terrible though.",
            "review_date": "2010-06-26",
            "source": "rt"
        },
        {
            "content": "Paskin elokuva ikinÃ¤! PitÃ¤iskÃ¶ tolle itkee vai nauraa?",
            "review_date": "2010-06-23",
            "source": "rt"
        },
        {
            "content": "The most brainless film ever.",
            "review_date": "2010-06-21",
            "source": "rt"
        },
        {
            "content": "House of the Dead is a terribly made film based on the arcade game of the same name. Made by the infamous Uwe Boll, it bears no resemblance to the game at all, has awful acting, terrible effects, dizzying camera work some hilarious interspersed scenes of the actual game itself. That said it manages to never be boring because there is always something on screen for you to cringe at.\n\nThe so called plot revolves around a group of college students who go to an island for a rave party. They hire a fishing boat to bring them there despite the fishermen?s warnings that the island is cursed. Once they get there they quickly realise that something is wrong when none of the party goers are anywhere to be seen. Soon enough they are being slaughtered by a group of terrible looking zombies. There is nothing wrong with the plot it's just incredibly poorly made. How Uwe Boll ever got a job directing a film I will never know. The camera work is all over the place, it looks like a terribly made music video. 360 degree shots of characters are supposed to look cool but instead make you feel nauseous. At one point there is a 4 minute montage of 2 second scenes as a hard rock song plays. That part is literally a music video! How he ever thought including actual scenes from the game into the film was a good idea I?ll never know.\n\nStill, it moves along at a fast pace and has plenty of terrible action. Some scenes are vaguely entertaining but the ineptness of Boll drags the whole thing.\n\nA truly awful director and a very poor film.",
            "review_date": "2010-06-21",
            "source": "rt"
        },
        {
            "content": "This has got to be one of the worst movies ever made",
            "review_date": "2010-06-11",
            "source": "rt"
        },
        {
            "content": "So bad it goes past good back to bad only to end up on pure genious :)",
            "review_date": "2010-06-09",
            "source": "rt"
        },
        {
            "content": "U havent seen House of the Dead?",
            "review_date": "2010-06-08",
            "source": "rt"
        },
        {
            "content": "The film shows scenes from the video game, but they are useless as there is no relation to the film. They could have removed the misunderstanding of the fight against the zombies. I love videogames, but this adaptation has nothing to do. The director has no talent and fun video games to dishonor religion by finding ideas uninteresting and inconsistent.",
            "review_date": "2010-06-05",
            "source": "rt"
        },
        {
            "content": "With all the laughable scares and none of the flair from the games, HOTD will have little replay value",
            "review_date": "2010-05-31",
            "source": "rt"
        },
        {
            "content": "The film is just another attempt of making a horror film but ended up being a comedy",
            "review_date": "2010-05-24",
            "source": "rt"
        },
        {
            "content": "Just a dumb movie based on the video game....kind of. Sorry very lame",
            "review_date": "2010-05-20",
            "source": "rt"
        },
        {
            "content": "So bad it's good.\r\n\r\nA so fantastically bad film I enjoyed it. How can you not say that the \"Bullet Time\" isn't cool? Yes there are so many continuity errors its not funny and yes, it's got the longest fight scene in the history of horror films. But hey I had fun watching this with my friends and I would bye it if saw it in a shop. It's just a fun film.\r\n\r\n100% Masterpiece \r\n90% Classic\r\n80% Great\r\n--- 70% Very Good ---\r\n60% Good\r\n50% Average\r\n40% Bad\r\n30% Very Bad\r\n20% Terrible\r\n10% Unbearable",
            "review_date": "2010-05-17",
            "source": "rt"
        },
        {
            "content": "Ridicolous, horrible dialouge and acting. The horrible action will definitely make you laugh.",
            "review_date": "2010-05-16",
            "source": "rt"
        },
        {
            "content": "Of all the video game adaptions, this one probably makes the least sense since the actual game doesn't have a strong plot to begin with....let's just say that transfers to the film as well.",
            "review_date": "2010-05-10",
            "source": "rt"
        },
        {
            "content": "The main heroine had a huge rack, so I gave it a 10%.",
            "review_date": "2010-05-10",
            "source": "rt"
        },
        {
            "content": "I think I now know why this film was in the free movie category on cable.",
            "review_date": "2010-05-07",
            "source": "rt"
        },
        {
            "content": "There's nothing I could say to express how great of a movie this is.  You just can't.  It's the greatest movie of all time.",
            "review_date": "2010-05-07",
            "source": "rt"
        },
        {
            "content": "definatly down there with some of the worst i have ever seen. this film is nothing but a big terrible cheesy mess.",
            "review_date": "2010-05-05",
            "source": "rt"
        },
        {
            "content": "Washing your eyes with bleach after watching this piece of crap is not a bad idea. Allowing Uwe Boll to make movies is a crime against humanity and a valid reason to declare war against Germany.",
            "review_date": "2010-05-05",
            "source": "rt"
        },
        {
            "content": "I dont even want to talk about it.",
            "review_date": "2010-04-27",
            "source": "rt"
        },
        {
            "content": "Just as stupid & lame as the 1st time I saw it.How did this movie ever make it into theaters?!?!",
            "review_date": "2010-04-24",
            "source": "rt"
        },
        {
            "content": "An Uwe Boll movie, does anything else even need to be said? The story is bullshit, the acting is bullshit, the directing is bullshit, the cutting is bullshit, the zombie effects are bullshit and the characters die just because the movie needs them to die. They literally just walk into the zombie horde to die, the movie doesn't even try to explain why they do that... This is crap. Pure, ranking, horse-shitted crap, there's just no other way to describe it. I would gladly gouge my eyes out rather than see this movie again. It's that bad.",
            "review_date": "2010-04-22",
            "source": "rt"
        },
        {
            "content": "Even a zombie flick fanboy like me couldn't hold through this movie with a serious face,it's so bad I'd rather watch my own meal cooks in a microwave.\r\nHouse of the dead has so many factual errors and plot holes I don't think I even noticed them all.\r\nIt's uwe boll at his best(as in blows so hard you'll be shocked).\r\nWatchable only with a bunch of friends so you can rant about it to one another.",
            "review_date": "2010-04-22",
            "source": "rt"
        },
        {
            "content": "no house and no plot, not just one of the worst zombie movies but worst movie in general",
            "review_date": "2010-04-21",
            "source": "rt"
        },
        {
            "content": "what a waste of time!i watched 15 min of it and was done!!!!flop!!!!......yawn!!!!!!!",
            "review_date": "2010-04-12",
            "source": "rt"
        },
        {
            "content": "Amazing for all the wrong reasons.",
            "review_date": "2010-04-11",
            "source": "rt"
        },
        {
            "content": "Dr. Uwe strikes again.  I knew this was based on a video game, but I couldn't recall the actual game.  I thought it might have been that first-person shooter in the arcade where you just shoot zombies in a haunted house, but that couldn't be it, right?  That's barely a premise for a video game, never mind a movie, RIGHT?  Well, that's what it is, and in case you forgot what it is, they continually splice (and I am not making this up) actual action from the video game into the movie... Yeah.  What the hell were they thinking?  So the rave of the year (thrown by Sega, of all companies) is being thrown on this island that attracts this annoying band of twenty-somethings.  The island is soon overrun by zombies, but not any zombies.  We are talking jumping, acrobatic zombies that could easily compete in a triathlon.  The survivors try to escape the island.  It's a movie that does everything wrong.  As a zombie movie, it just makes up rules as it pleases, with zombie bites sometimes changing the victims into the undead, and sometimes just leaving the victim with a bite mark.  There are a number of noticeable continuity errors, and it blatantly rips off a number of different movies, like The Matrix and The Lord of the Rings.  The acting is amazingly bad and the dialogue is filled with \"are you fucking kidding me?\"  You can find more likable characters in a Friday the 13th movie, and pretty much the only thing this movie has going for it is that it has some pretty cool music that sounds like a Prodigy knockoff band.  There's this hilarious part in the movie where they take literal breaks in the action to give every single character a freeze frame 360 shot.  It's impressively bad, but there's a reason why Uwe Boll is so infamous.",
            "review_date": "2010-04-07",
            "source": "rt"
        },
        {
            "content": "ugh. this is pretty much one of the worst movies ever made...",
            "review_date": "2010-03-20",
            "source": "rt"
        },
        {
            "content": "House of the Dead is a terribly made film based on the arcade game of the same name. Made by the infamous Uwe Boll, it bears no resemblance to the game at all, has awful acting, terrible effects, dizzying camera work some hilarious interspersed scenes of the actual game itself. That said it manages to never be boring because there is always something on screen for you to cringe at.\n\nThe so called plot revolves around a group of college students who go to an island for a rave party. They hire a fishing boat to bring them there despite the fishermenâs warnings that the island is cursed. Once they get there they quickly realise that something is wrong when none of the party goers are anywhere to be seen. Soon enough they are being slaughtered by a group of terrible looking zombies. There is nothing wrong with the plot it's just incredibly poorly made. How Uwe Boll ever got a job directing a film I will never know. The camera work is all over the place, it looks like a terribly made music video. 360 degree shots of characters are supposed to look cool but instead make you feel nauseous. At one point there is a 4 minute montage of 2 second scenes as a hard rock song plays. That part is literally a music video! How he ever thought including actual scenes from the game into the film was a good idea Iâll never know.\n\nStill it moves along at a fast pace and has plenty of terrible action. Some scenes are vaguely entertaining but the ineptness of Boll drags the whole thing.\n\nA truly awful director and a very poor film.",
            "review_date": "2010-03-19",
            "source": "rt"
        },
        {
            "content": "The movie itself is not that bad, I mean the action does look awesome, and the zombies do look great, the effects are pretty good. The acting is pretty decent, the plot is pretty interesting too, and also it does look kind like the game, and it's true I did play the game, and it was a fun game, and I know everybody hates Uwe Boll, and I've read everything about him, and stuff, but I don't hate him, because he one of my top 10 directors, and look he didn't do this on purpose at all, he just trying to see what can do he do to make a decent movie, although I dislike one scene from this movie, and that is when they show us the video game scenes, but I think I know why they showed us those, maybe because they were trying to show us how to beat the game more often, and I got to admit that is kind of clever to put that on there.\n\n3.5/5 stars",
            "review_date": "2010-03-19",
            "source": "rt"
        },
        {
            "content": "Pretty good. The acting in the beginning could be a bit better. But thank god she is killed off as one of the first. \n\nI'm not very into zombie movies but this one was good.",
            "review_date": "2010-03-14",
            "source": "rt"
        },
        {
            "content": "http://vidgamemoviereview.blogspot.com/2009/02/house-of-dead-review.html",
            "review_date": "2010-03-04",
            "source": "rt"
        },
        {
            "content": "Horrible.  Just plan horrible.  May be worth a few laughs.",
            "review_date": "2010-02-25",
            "source": "rt"
        },
        {
            "content": "oh boy, a terrible movie compared to an okay game. this is a disgrace to the zombie/living dead genre. its full of blood that doesnt look good at all and filled with unintentional laughs throughout. the film tried way to hard in making a horror masterpeice and the storyline is very dumb and illogical.",
            "review_date": "2010-02-23",
            "source": "rt"
        },
        {
            "content": "It dosent even deserve this much of a rating, its so bad its in a way good, but dosent excuse the badness.  bad continuity, horrible acting and of course with a director like Uwe Boll at the helm you know what to expect. thing is that i have made better than this, and had more brains in a 3 minute short than the entire length of this film. still, if you really want to see a comedy of errors, or just to see how not to remake video game movies, this is for you. otherwise, avoid at all costs",
            "review_date": "2010-02-19",
            "source": "rt"
        },
        {
            "content": "If video game movies are really a requirement for Hollywood, can we please give it to a director who is not incompetent?",
            "review_date": "2010-02-16",
            "source": "rt"
        },
        {
            "content": "Probably the worst remake ever! This is so bad, the acting is way beneath avarage, and the plot is dry and not relevant to the zombie genre. This brings shame to all zombie-movies ever made, and that's why it's also the worst.",
            "review_date": "2010-02-14",
            "source": "rt"
        },
        {
            "content": "One of the worst zombie movies ever made.",
            "review_date": "2010-02-14",
            "source": "rt"
        },
        {
            "content": "Some video games should remain video games.",
            "review_date": "2010-02-06",
            "source": "rt"
        },
        {
            "content": "Ed Wood was bad, everybody knows that, but at least he was a truly cinema lover and for that I think he deserves some respect. Plan 9 is a cult-classic in my opinion. But Uwe Boll... Wow... This guy have no shame, no original ideas, nothing. He just don't care! It looks like he knows that all of his movies suck but he just don't care. House of The Dead is a zombie movie with no imagination. Everything is just so bad. But I have to admit that it gets kind of funny... And that is something right?",
            "review_date": "2010-01-22",
            "source": "rt"
        },
        {
            "content": "Before I get started on that list of films this is going to be my last review until I get most of that list done. I am going to review house of the dead and I got to say this is one of the most underrated film ever. But really a 4% and a spot in IMDB bottom 100 to me it's not that bad.\r\n\r\nA while ago me and my brother Zac were renting films and we decide to rent this. At he back it says When Night of the Living Dead meets XXX and I thought it looks like a cool film so we picked it up and rented it along with a few others so the first film we watched was this and I have to say it was a good film. In Meany ways it was a bit dumb. But still I have seen it 32 times to date.\r\nI have got to say I find this Uwe Bolls best film at least he tried in this. So far but my brother says it's Farcry that I will likely never see.\r\nBy the way this was Uwe Boll's only finically successful film that did well at the box office.\r\n\r\nThe story to the film is a rave on a small island inhabited by zombies who will kill anyone who comes onto there island. A bit stupid but I a good idea that was poorly done. In a way I can not really see any other story line for a house of the dead film likely because I have seen this so Meany times. There are a big number of plot holes and if these people were smart they could just swim off the island to the main land it is only about 2, 3 km if they really wanted to get off the island. I have to say I thought the action scenes were good that's another reason why I liked this film. \r\nThe acting I have to say is mixed to average it's not terrible or bad or that good it's just really average.\r\nSome of the action scenes were really good but a bit ridicules but still enjoyable. The visual effects and for a film like this were good usually in an Uwe Boll film they would be retarded and messed up looking.  The zombies and the make up used was really good for the hundreds of zombies they used.\r\n\r\nBut overall I think it's just to underrated many of you will really disagree with me. But I am also having a hard time weather to recommend it just watch if you really won't to. Or if you're a die hard fan of zombie films.",
            "review_date": "2010-01-22",
            "source": "rt"
        },
        {
            "content": "Uwe Boll makes Ed Wood look like an Oscar winning director. The reason Ed Wood's films are so interesting to see is because of the way they are made so terribly it makes you laugh. But with Boll, or Dr. Boll as he calls himself, does not have that talent. He has no talent. This film is able to show that. The acting is terrible, the script is stupid and the special effects and cinematography are brainless (excuse the pun). Even Uwe Boll's direction feels like a zombie. This film is based on a videogame, everyone should know that since Boll makes terrible videogame films. This film actually appears like something that shouldn't have been released, but kept on a dark shelf. If it is Uwe Boll, than you know that it is not good. Enough said.",
            "review_date": "2010-01-20",
            "source": "rt"
        },
        {
            "content": "Horrible just fucking Horrible. Uwe Boll is one of the  biggest hacks on the planet, This movie is a disgrace to a great shooter franchise extrmeely boring and feels like a bad music video. everything is wrong with it from special effects,to script to directing,to acting, to the retarted power rangers esque fight scenes to the fact that it has little to do with the game franchise . ths is jsut the first in many horrible uwe boll video game films and trust me they get worse",
            "review_date": "2010-01-13",
            "source": "rt"
        },
        {
            "content": "It really is as bad as everyone says it is",
            "review_date": "2010-01-13",
            "source": "rt"
        },
        {
            "content": "Just horrible! There is no words, no description... to describe how painful watching this film is to me!\r\n\r\nI really dont know what is worse,The cheesy acting and dialogue or the painful soundtrack playing along the dramatic parts.  The director really fail badly.....there should be a limit on the use of the \"bullettime\" effect.  \r\nEvery good director should also know not to encorporate actual  \"House of the dead\" video gameplay inside the movie. It just spoils the moment, and allowing me to believe that I am no longer watching a movie but a cutscene of a video game.",
            "review_date": "2010-01-11",
            "source": "rt"
        },
        {
            "content": "I only watched this, because I had yet to watch a movie directed by the infamous Uwe Boll. Now I know why I hadn't.",
            "review_date": "2010-01-08",
            "source": "rt"
        },
        {
            "content": "Worst movie ever. You don't wanna see this. It's just for your own good. So bad it wasn't even funny, seriously..",
            "review_date": "2010-01-04",
            "source": "rt"
        },
        {
            "content": "Le plus rate dans la filmographie de Uwe Boll mais lorsque l'on apprend les soucis qu'il a rencontre en pre-prod, on comprend le resultat...",
            "review_date": "2010-01-03",
            "source": "rt"
        },
        {
            "content": "Uwe Boll didn't just ruin the game, but he also created the worst zombie movie I ever seen in my life",
            "review_date": "2010-01-03",
            "source": "rt"
        },
        {
            "content": "a boring and dumb zombie movie ever seen!!!!\ni suggest u guyz eva neva try2 watch it..",
            "review_date": "2010-01-02",
            "source": "rt"
        },
        {
            "content": "So awful it's good, well, at least good enough to be worth 1 1/2 stars",
            "review_date": "2009-12-22",
            "source": "rt"
        },
        {
            "content": "I thought it was going to be like a horror movie, instead it's a live action video game. Although, it was a fun movie to watch, so it deserves 3 stars.",
            "review_date": "2009-12-20",
            "source": "rt"
        },
        {
            "content": "A bunch of attractive college students go to an island for a rave and find its been overrun by zombies created by an undead pirate, or something.  Sloppily made, with no characterization and terrible continuity, but it's never boring, and the Matrix-style music video zombie slaughter is so overdone it plays like a parody of the first-person shooter mentality.",
            "review_date": "2009-11-23",
            "source": "rt"
        },
        {
            "content": "boring predictable terrible acting",
            "review_date": "2009-11-21",
            "source": "rt"
        },
        {
            "content": "This is so bad it's funny!",
            "review_date": "2009-11-16",
            "source": "rt"
        },
        {
            "content": "Worst zombie movie ever!",
            "review_date": "2009-11-15",
            "source": "rt"
        },
        {
            "content": "Wow. This is the WORST video game adaptation ever made!",
            "review_date": "2009-11-13",
            "source": "rt"
        },
        {
            "content": "DIZ BE BEST MOVIE EVEAR!!!! UWE BOLL GREAT NIGGE-R DIRECTOR:",
            "review_date": "2009-11-11",
            "source": "rt"
        },
        {
            "content": "I was a huge fan of the game on Dreamcast.  I probably played it in my sleep.\r\nBut this movie was just a hot mess.",
            "review_date": "2009-11-07",
            "source": "rt"
        },
        {
            "content": "Loved the game. hated the film.",
            "review_date": "2009-11-05",
            "source": "rt"
        },
        {
            "content": "Fucking Uwe Boll ruining video game movies. I swear he goes after them with such lust to destroy them I'm pretty damn well certain a video game movie raped his mother and made him watch and then killed his dog. It's the only logical explanation for the rubbish that man \"creates\".",
            "review_date": "2009-10-31",
            "source": "rt"
        },
        {
            "content": "i love it it is a good film and i do recomend it",
            "review_date": "2009-10-30",
            "source": "rt"
        },
        {
            "content": "Uwe Boll is the new Ed Wood, he has to be. No one has any idea how this guy keeps making movies, but he troops on. Pumping out crap fests like Alone in the Dark, Dungeon Seige, and of course House of the Dead. The latter is what we just watched and i am going to have to say, I loved it. This really is a terrible movie, but its great to invite a few friends over and really have fun drinking and making fun of it, ala mst3k.\r\n\r\nThe film is a Zombie horror movie starring a bunch of nobodies and Erica Durance, who would later go on to play Lois Lane in Smallville. What we have here is a bunch of 20 somethings that are on their way to a rave on a remote island, they hire a seedy sea captain named Kirk, to transport them. When they get to the island however, well, i cant ruin it for you but let me tell you... its hilarious.\r\n\r\nSo there are a ton of things in this movie to keep you watching, like terribly delivered lines, horrible acting, barely any continuity, and of course blatantly stolen scenes from other movies. I'm not kidding about the last part, most of the scenes that they steal are from the Lord of the Rings trilogy. I cant actually believe that this movie made 1 million over their budget at the theaters. I am going to have to give this craptastic film 1/10 for being mildly funny but not scary whatsoever.\r\n\r\nSee it with friends\r\n\r\nSid",
            "review_date": "2009-10-30",
            "source": "rt"
        },
        {
            "content": "It wasn't too bad.  One of only two films that are not below average from Uwe Boll (the other being Postal).",
            "review_date": "2009-10-23",
            "source": "rt"
        },
        {
            "content": "Let me put it like this the person that made it to the end of this movie because thirty minutes was fuckin brutal! I judge the person that likes this movie so much I think the person that likes this deserves to be in a real life Saw experience",
            "review_date": "2009-10-20",
            "source": "rt"
        },
        {
            "content": "This movie sucks on so many levels.",
            "review_date": "2009-10-19",
            "source": "rt"
        },
        {
            "content": "So bad its funny just like every other Uwe Boll movie.",
            "review_date": "2009-10-15",
            "source": "rt"
        },
        {
            "content": "Actually managed to have less substance in it then the game and given it is a gun game where you simply shoot at zombies as they pop up in front of you, it is quite an achievement to have less substance then that. If I could rate this film was a negative number of stars I would as it's rare you find a film that is so bad and un-entertaining that it is an achievement to have made it. I'm not saying it's so bad it's good though folks, I'm saying it's so bad that there should be some kind of public execution ordered for Uwe Boll.",
            "review_date": "2009-10-09",
            "source": "rt"
        },
        {
            "content": "I really dont know where to begin...This is by far the worst movie I've ever seen...So let's get straight to the point: no director in the world could possibly have not seen the imense amount of bloopers in the movie! The acting is horrible, a new all-time low....there are no special effects...only stupid gore...and every single frame of this movie is absolutely pathetic....only useful for a huge laugh!!!\r\n\r\nConcept --> 2/10\r\nCast Performance --> 0/10\r\nSound Effects --> 3/10\r\nSpecial Effects --> 0/10\r\nPlot --> 0/10\r\n\r\nFINAL RATING --> 10%",
            "review_date": "2009-10-04",
            "source": "rt"
        },
        {
            "content": "A terror movie with a lot of bullets and fight",
            "review_date": "2009-10-02",
            "source": "rt"
        },
        {
            "content": "This one is terrible. Its like eating a 3 month old burger with cockroaches and maggots. You'll be dead if you like this film. I'm so sorry for those who are involved in this film, they must be in deep shame when they saw this. Bad film, terribly bad.",
            "review_date": "2009-09-30",
            "source": "rt"
        },
        {
            "content": "So bad it's still not considered good, but fucking hilarious.",
            "review_date": "2009-09-28",
            "source": "rt"
        },
        {
            "content": "Esta pelicula demuestra que Uwe Boll es uno de los peores directores en la historia del cine (y no le estoy haciendo un cumplido tipo Ed Wood... Boll es REALMENTE MALO).  Esta adaptacion de un video-juego es quizas la pelicula mas mala de los ultimos 25 anos.  Todo un esperpento que hiede a estiercol por donde se le mire.  \"House Of The Dead\" parece la excrecion de un zombie con diarrea.  Despues de verla, la depresion es tan profunda, que uno llega a pensar si el cine ha muerto y ya no vale la pena.",
            "review_date": "2009-09-25",
            "source": "rt"
        },
        {
            "content": "At least there was one good thing to come out of this film, and that was the perfection of Bullet Time camerawork.",
            "review_date": "2009-09-19",
            "source": "rt"
        },
        {
            "content": "Uwe Balls, i hope you burn in hell with Michael Bay",
            "review_date": "2009-09-16",
            "source": "rt"
        },
        {
            "content": "This doesn't get bottom marks only because there's so much to laugh at (not with, at). This is way crap. Astoundingly so. It actually has some production value too, so there's no blaming the lack of resources.\n\nAlso, I must point out the Flixster recommendation on this page for me \"More like this: Reservoir Dogs\" errr...",
            "review_date": "2009-09-04",
            "source": "rt"
        },
        {
            "content": "Truly awful, however entertaining and enjoyable if you watch it more for its comedic value. The incorporation of the crappy game graphics along with the actual film make it that much more horrible/awesome.",
            "review_date": "2009-09-03",
            "source": "rt"
        },
        {
            "content": "Boll's career should have ended with this movie",
            "review_date": "2009-09-02",
            "source": "rt"
        },
        {
            "content": "what was the point of this ???",
            "review_date": "2009-08-29",
            "source": "rt"
        },
        {
            "content": "i was really i saw this movie\n\nbut from what i remember it was cool",
            "review_date": "2009-08-27",
            "source": "rt"
        },
        {
            "content": "\"Lets spend half the budget on a 15 minute long fake bullet time sequence where every character shoots off a gun. This will surely make for great cinema!\"\n\n-Uwe Boll",
            "review_date": "2009-08-24",
            "source": "rt"
        },
        {
            "content": "not much going for it and it has the most weak ass zombies ever i mean they die from anywhere not just the brain stab in in chest dead",
            "review_date": "2009-08-19",
            "source": "rt"
        },
        {
            "content": "I could just start with saying it's an absolutely horrible movie or I could say it's a Uwe Boll flick. You could put an equation mark between the two...\r\n\r\nHow is it possible that this guy is still allowed to make movies? I really wish they would stop funding him in Germany or wherever. Yet again he wrecked a pretty decent video game. Feels like beating a dead horse.\r\n\r\nIt's beyond my patience to point out most of the movies flaws, the biggest being probably the incredibly stupid plot. Why 10%? Well it's better than \"BloodRayne\" or \"Alone in the Dark\" for whatever that means.",
            "review_date": "2009-08-13",
            "source": "rt"
        },
        {
            "content": "L'adaptation d'un jeu video sans scenar ou il faut buter plein plein plein de zombies.\r\n\r\nLe film, c'est pareil, mais en moins fun, avec un scenario qui a du etre mange par un zombie et des acteurs horribles et horripilants...\r\n\r\nAutant rebrancher la console...",
            "review_date": "2009-08-09",
            "source": "rt"
        },
        {
            "content": "Lame with a capitol L-A-M-E.",
            "review_date": "2009-07-31",
            "source": "rt"
        },
        {
            "content": "House of the Dead is the absolute  worst film I have ever seen. Half way through the film I was marvelled at the fact that  mistakes that took place in the film could still happen at the current time of cinema (2003 ). By the second half ( when they started integrating cut scenes from the video game into the films action sequences ) I was literally yelling at my T.V. \r\n\r\nI don't understand how people can complain about films like Watchmen or Knowing, claiming they lost time from thier lives when shit like this sits on the shelf. They're just the kind of people that would rent it, bring it back and tell me how much they loved it. In other words... If you enjoyed House of the Dead... you're a fuckin' idiot! Director Uwe Boll continues to release piece of shit after piece of shit! Someone stop this fuckin' douche bag!",
            "review_date": "2009-07-30",
            "source": "rt"
        },
        {
            "content": "So bad in every way. It was good for laughs even though it's not supposed to be.uwe boll has to be stopped",
            "review_date": "2009-07-25",
            "source": "rt"
        },
        {
            "content": "Im being a saint right now.",
            "review_date": "2009-07-21",
            "source": "rt"
        },
        {
            "content": "The world's introduction to Uwe Boll. I wish it never happened, to be honest. \n\nAlso I don't want to get in a boxing match with you, you don't need more press Mr. Tool... I mean Boll.",
            "review_date": "2009-07-17",
            "source": "rt"
        },
        {
            "content": "a lot of people hate Uwe Boll\r\nit's easy\r\n\r\nbut as far as I'm concerned, his job is to entertain me\r\nand that's what he does",
            "review_date": "2009-07-14",
            "source": "rt"
        },
        {
            "content": "Uwe Boll's first video game crapfest that deserves every bad thing that's ever been said about it. It is so bad, it actually edits in footage of the game \"House of the Dead\" and tries to pass it off as actual movie footage. It's so bad, it has Clint Howard. It's so bad, I shouldn't have even used this many words to review it. Avoid.",
            "review_date": "2009-07-08",
            "source": "rt"
        },
        {
            "content": "Terrible the worst movie I've seen...EVER!!! The fact that I made it all the way through is a small miracle",
            "review_date": "2009-07-08",
            "source": "rt"
        },
        {
            "content": "Very cheap and poorly made pile of crap that happens to be hilarious!!!",
            "review_date": "2009-07-05",
            "source": "rt"
        },
        {
            "content": "HORRIBLE! JUST PLAIN HORRIBLE",
            "review_date": "2009-07-05",
            "source": "rt"
        },
        {
            "content": "\"Does anyone have... a cellphone?\"",
            "review_date": "2009-06-23",
            "source": "rt"
        },
        {
            "content": "I have seen more than my fair share of bad movies. Wicker Man, McBain, Postal, you name it. But I don't think I've ever laughed harder at a bad movie than House of the Dead. It's so unbelievably awful in every way that I was just fucking fascinated at how a movie could be that bad. Uwe Boll is our generation's Ed Wood. I can't possibly give this a bad review because its so damn enjoyable to make fun of every single aspect of this shitty, shitty film.",
            "review_date": "2009-06-15",
            "source": "rt"
        },
        {
            "content": "I really hope this was supposed to be a joke... Otherwise... Good grief.",
            "review_date": "2009-06-03",
            "source": "rt"
        },
        {
            "content": "I thought this would be cool but honestly the acting is shitty, and the script was trash.",
            "review_date": "2009-06-03",
            "source": "rt"
        },
        {
            "content": "revry good i loved it a bit low buget thow and lots of girls take there tops of",
            "review_date": "2009-06-03",
            "source": "rt"
        },
        {
            "content": "why did zombies have to begin running..not the best, but it IS supposed to be up in the san juans",
            "review_date": "2009-05-18",
            "source": "rt"
        },
        {
            "content": "this an absolutely amazing film loved it",
            "review_date": "2009-05-14",
            "source": "rt"
        },
        {
            "content": "Not much going for this movie... some great effects but the whole movie seems to try and be all cool and hip.. matrix style action scenes!\r\n\r\nas with most video game movie conversions many have little to go on, this being proberly one of the worst",
            "review_date": "2009-04-26",
            "source": "rt"
        },
        {
            "content": "super cliche.... no surprises here.",
            "review_date": "2009-04-24",
            "source": "rt"
        },
        {
            "content": "2nd worst movie ever.",
            "review_date": "2009-04-19",
            "source": "rt"
        },
        {
            "content": "I have always loved zombie flicks and seen just about everyone. When this one came out it was a little dissapointing considering the potential but I liked how this was the first zombie movie that made them run...I mean how scary is that compared to the draggin' their legs ones of earlier zombie flicks! And the scene with the game-action shots were kewl",
            "review_date": "2009-04-10",
            "source": "rt"
        },
        {
            "content": "its gay dumb and not even based on anyt",
            "review_date": "2009-04-08",
            "source": "rt"
        },
        {
            "content": "Fuckin Uwe Boll\nThis is the epitome of a video game turned into a movie that sucks!!\nIt shouldn't take place on an island where hell breaks loose at a rave party, it takes place at a giant mansion where 2 agents try to stop a mad scientist from causing destruction and one of the heroes trying to save his fiancee from further harm\nagain, fucking Uwe Boll",
            "review_date": "2009-04-07",
            "source": "rt"
        },
        {
            "content": "Not as wretched as some would have you beleive and in all honesty it's very watchable for a Boll film even if it's only based on the eye candy. It's not without his typcial bad movie traits such as the terribly uneven stylization and pacing but it does work as an adaptation of the source material. The wooden performances, clunky dialogue and tacky, techno-scored action scenes are well tuned with the video game on which the film is based; the problem is that doesn't make for a good film. While guiltily entertaining it's still undoubtedly bad.",
            "review_date": "2009-03-31",
            "source": "rt"
        },
        {
            "content": "Worst zombie movie I've EVER seen. Horrible acting and camera angles. The blood looked like tempra paint. I don't think those were even zombies...they were more like decayed vampires. Flipping through the air while throwing an axe? Come on...",
            "review_date": "2009-03-27",
            "source": "rt"
        },
        {
            "content": "Wow, I commend anyone who gets through the whole thing. Horrific in every conceivable way.",
            "review_date": "2009-03-24",
            "source": "rt"
        },
        {
            "content": "xD Hahahahaha  \nScooby-Doo on Zombie Island is scarier, funnier, and has better-built characters and plot!\nStill, it was entertaining -  if you're into zombie flicks, watch it, don't let the dumbness scare you away!",
            "review_date": "2009-03-21",
            "source": "rt"
        },
        {
            "content": "worse adaptation from a video game... although it is slightly enjoyable!",
            "review_date": "2009-03-11",
            "source": "rt"
        },
        {
            "content": "Trods et budget stÃ¸rre end de fleste zombieklassikere, med hellikopterture og det hele, er dette nok en af de ringeste zombiefilm der er produceret. Computerspils-sekvenser, kliche pÃ¥ kliche og elendigt spil.",
            "review_date": "2009-03-08",
            "source": "rt"
        },
        {
            "content": "The cinematic equivalent of being strapped to a chair and having to stare at Joleon Lescott's forehead for 90 mins. Utterly horrific.\nUwe Boll is like a love child of Ed Wood and Michael Bay and is a talentless oxygen thief. There are arguments for the reintroduction of the death penalty you know. Uwe Boll topping the list.",
            "review_date": "2009-03-06",
            "source": "rt"
        },
        {
            "content": "I found this movie a waste of my time, horribly lame, and very annoying because several clips from the first three games in the are inserted in the opening credits and throughout the entire movie. ARGGH!",
            "review_date": "2009-03-01",
            "source": "rt"
        },
        {
            "content": "Wow, this was a dumb movie. Very dumb.  Lots of pointless nudity and terrible acting (as you'd expect), with no redeeming qualities.  God, I love bad horror movies.",
            "review_date": "2009-03-01",
            "source": "rt"
        },
        {
            "content": "Now here is a Zombie movie that isn't scary... not once. There are some hilarious scenes which involve the entire cast \"gearing up\" with weapons. Overall stooopid! Watch at you own peril. Note: We watched this as part of our Friday the 13th \"Bad Movie\" night",
            "review_date": "2009-02-24",
            "source": "rt"
        },
        {
            "content": "Even 1/2 a star is WAAAAYY too generous. What a load of crap...",
            "review_date": "2009-02-21",
            "source": "rt"
        },
        {
            "content": "Probably one of the worst movies EVER. If you're going to be working with a small budget, you better have every little freakin detail figured out before decided to start production. The \"game over\" feature they used for just the 1st 2 characters dying felt like it was just something they thought to try but didn't like so dropped it for the rest of it. if you weren't going to be able to fix it, then why bother trying it in the first place? But this movie's 1st and biggest mistake was having Uwe Boll attached to it.",
            "review_date": "2009-02-20",
            "source": "rt"
        },
        {
            "content": "Watched it on SciFi so I'm guessing that without all the commercials and blurred nudity it's probably not close to the worst movie ever. And hell, it was infinitely funnier than Meet the Spartans or Date Movie. Still, I wish I had never watched it.",
            "review_date": "2009-02-14",
            "source": "rt"
        },
        {
            "content": "I really don't know how he does it, but somehow Uwe Boll keeps getting money to make these terrible movies.",
            "review_date": "2009-02-11",
            "source": "rt"
        },
        {
            "content": "the video game was better!!",
            "review_date": "2009-02-07",
            "source": "rt"
        },
        {
            "content": "one of the best Uwe Boll films I have ever seen...",
            "review_date": "2009-02-07",
            "source": "rt"
        },
        {
            "content": "you only get that cause it was zombie-ish... other than that... crap",
            "review_date": "2009-02-04",
            "source": "rt"
        },
        {
            "content": "Uwe Boll should be castrated for what he has done to movies",
            "review_date": "2009-02-03",
            "source": "rt"
        },
        {
            "content": "Another video game gone so horribly wrong",
            "review_date": "2009-01-30",
            "source": "rt"
        },
        {
            "content": "Cheesy movies are like blood to my vains!",
            "review_date": "2009-01-30",
            "source": "rt"
        },
        {
            "content": "quite decent.  It started off fairly boring and I was afraid it would be totally lame, but then came some gratuitous nude scenes, zombies coming out of water and it was alright by me! It was mundane and at times but had some rad special effects and I enjoyed the video game quality to some of the shots/flashes into the video game.  not great, not awful!",
            "review_date": "2009-01-24",
            "source": "rt"
        },
        {
            "content": "How the hell did this get made? One of the worst things I have ever seen, and I've seen a lot of bad movies.  No story, shitty acting. And how the hell does Clint Howard, brother of Ron, the well respected director, keep showing up in such horrible movies.",
            "review_date": "2009-01-24",
            "source": "rt"
        },
        {
            "content": "This movie gets four stars for being one of the most hilariously bad films I have ever seen.",
            "review_date": "2009-01-23",
            "source": "rt"
        },
        {
            "content": "How is this movie awful? I mean sure the dialogue sucks but the action is good, special effects are decent. Why does everyone hate it so much",
            "review_date": "2009-01-21",
            "source": "rt"
        },
        {
            "content": "A zombie movie that had too big of a budget and it still didn't do them any good.\r\nBesides the lame acting from, well just about everyone (even though some people have some good moments like Cherry, Cornell, and Prochnow) and whoever was incharge of continuity of this movie really droppped the ball during that fight in front of the house that seemed to NEVER END!\r\nAlso if your going to have a STAR TREK refrence in your movie, try to be a little more subtle then these guys were.\r\nBut it does have a cool soundtrack and the cool 360 camera spin shots are in there every 6 seconds.\r\nSo it manages to still be fun to watch, but deserves it's place on the SciFi Channel with their crappy movies.\r\n\r\n\"You did all this to become immortal. Why?\" \r\n\"To live forever!'",
            "review_date": "2009-01-21",
            "source": "rt"
        },
        {
            "content": "This is basically like watching someone play a video game.",
            "review_date": "2009-01-20",
            "source": "rt"
        },
        {
            "content": "Leave your brains at the door and give into the guilty pleasure that is HOUSE OF THE DEAD. Based on an arcade game, this film has no allegory, no metaphor, no higher level of thinking. It's just bad filmmaking at its entertainingly best. A group of college kids gather on an \"Island of the Dead\" for a rave, only to be confronted with...ZOMBIES!!!",
            "review_date": "2009-01-20",
            "source": "rt"
        },
        {
            "content": "uwe boll...nuff said. stay far away",
            "review_date": "2009-01-19",
            "source": "rt"
        },
        {
            "content": "-this is the second worst movie i've ever seen (under Boll's Postal).  Listen to how bad this plot is: teenagers go to an island to go to a rave- miss the boat so pay a sea captin 1,000$ to drive them to the island and when they get there everyone is dead because of the zombie attack.  they stay on the island since there is beer and to look around to see what happened....and then get attacked by zombies.  and yes, that is actually the plot...i wish i was exaggerating how bad it was.  It would almost be funny if it wasn't so painful.  The worst acting i have EVER seen and the worst script i've ever heard.  Also, only 15 minutes (tops) of the movie take place in the actual house...most takes place on an island and some in the catacombs (a mine) since Boll gets cheap access to islands and mines.  In addition they keep flashing clips of the video game in the middle of the scenes.  I am not sure if this was supposed to remind you what movie you were watching or what...but it was just stupid.  among the worst costumes and make up i have ever seen, some of the zombies are hilarious (not intentionally).  I can not say enough bad stuff about this movie...there is absolutely nothing redeeming in this movie at all.  just don't watch it unless you want to put your self through a horrible painful movie viewing experience or want to see exactly how bad a movie can be.",
            "review_date": "2009-01-19",
            "source": "rt"
        },
        {
            "content": "A dire game adaption. Bad acting, cheesy dialogue and unnecessary clips of the game thrown in. The directors cut gives this rare moments of laughter at the beginning, but even that fails to make House of the Dead enjoyable.",
            "review_date": "2009-01-16",
            "source": "rt"
        },
        {
            "content": "Uwe Boll is a horrible director but you knew that already.",
            "review_date": "2009-01-10",
            "source": "rt"
        },
        {
            "content": "One half star for Jurgen Procnow and a half star for a rave during the day.",
            "review_date": "2009-01-08",
            "source": "rt"
        },
        {
            "content": "Famously rubbish film director Uwe Boll directs (there's an overstatement) this nonsensical, dire zombie movie based on the popular arcade game and creates a film so bad you'll be trying for weeks to forget the game and its film adaptation even existed in the first place.\n\nBasically a bunch of students pay a THOUSAND dollars to go to a rave on a creepy island (who does that???) only to find that it's full of crappy-looking zombies who, although they can swim, have never even tried to leave the island and take over the world. They are just not that ambitious.\n\nA bunch of intensely annoying twenty somethings get butchered one by one as poor old Jurgen Prochnow (Das Boot) tries to look for his career somewhere inside his boat for about an hour. Uwe Boll throws actual shots from the game at us every chance he gets (BAAAAAD IDEA), rips off The Matrix's bullet-time effects about 200 million times, throws away all notions of continuity and references Scooby Doo.\n\nTerrible terrible film. But if you like bad movies, as I do, you can't go wrong with this one.",
            "review_date": "2009-01-02",
            "source": "rt"
        },
        {
            "content": "One of if not the worst films ever to be made. 30 pence budget, some of the worst acting/directing u could ever see!! Its so bad there isnt any this could be so-bad its good levels, its just plainn BAD.\n   Every so often games scenes from the original game get shown when ever any badly looking zombie gets killed! Totally pointless as even though the film has the same name this really has nothing to do with the game in anyway. The matrix style shoot outs look just plain embarasing!!\n  This deserves no stars what so ever the only reason this gets even a half is because erica durance from smallville is in it for 5 mins and you get to see her preop-knockers!!",
            "review_date": "2009-01-01",
            "source": "rt"
        },
        {
            "content": "Ok.  It's ludicrously awful, but come on, Ed Wood anyone?  Someone has to be out there, making the world's worst movies, if only to serve as whipping boy for the rest of the film industry.\nThe film is atrocious.  It's truly awful.  But it's also fun, if you're drunk that is.\nI don't know.  I mean, movies like this have to exist and while this movie is fucking awful, I don't see it as any worse than the other end of the spectrum, the bloated, big budget, hollywood whatever-the-fucks, I mean, I'd rather George Clooney stop directing movies than Uwe Boll.\nThat being said, I couldn't finish this relatively short movie because I wasn't drunk enough and it was like watching the cool kids from high school (YOUR high school) trying to act really, really genuinely, so genuinely that it's the phoniest shit you've ever seen, but no one will tell them because they are so attractive, watching them fight off rejects from Michael Jackson's \"Thriller\".\nI mean, it's like Boll obviously put some effort into it, just why put in the effort in all the wrong places unless you're some kind of artistic genius whose trying to destroy the video game community's artistic credibility one film at a time.\nI look forward to trying to watch more Boll films, if only to try to make some sense of the insanity. His work is a straight up cultural anomaly, because unlike the evil, worthless duo behind Epic Movie and Date Movie, there actually might be something to Boll, just what, I have no idea.",
            "review_date": "2009-01-01",
            "source": "rt"
        },
        {
            "content": "This movie is so bad I have yet to watch it through while sober.  I get about 10 min into it and start reaching for the first intoxicating substance I can get my hands on.  If you think you've seen a bad movie, or possibly the worst movie imaginable already... give House of the Dead a try.. it'll lower ALL your expectations.",
            "review_date": "2008-12-31",
            "source": "rt"
        },
        {
            "content": "I rented this and Alone in the Dark (both by the genius that is Uwe Boll) knowing that they would both probably be the worst movies I have ever seen, so my expectations for how bad it would be were high. The movie actually passed them. It was soo unbelievably bad that I thik Boll has down syndrome. Condensed list of things that were bad:\n1. My asshole can act better then everyone in the film. \n2. Was there a plot?\n3. People would randomly switch the weapons they were holding as the camera cut.\n4. The violence wasn't sweet enough.\n5. Nothing scary or suspenseful about it at all.\n6. The zombies look liked the puddies from Power Rangers.\n7. It took 5 years to get to a house 3 feet away.\n8. Cutting to the actual video game could have been sweet if it wasn't completely random and not done 2987 times. \n9. The characters say they have never touched a weapon before, then instantly become expert marksman.\n10. The head zombie sounded like if Dracula and  Puss in Boots had a love child.\n11. The best part was when I left the film to refill my bowl of Special K.\n\nRemember, that was a condensed list. There is much more.\n\nThere was one cool part when the black chick jumped 90 feet in the air, in bullet time, dodge a flying axe and shot some zombie. it was dumb as fuck but awesome. \n\nThis really felt like a parody of straight to DVD horror films, but naturally that wasn't the intention. It actually would have been amazing if that was Uwe was going for, but of course it wasn't. Worst movie I have ever seen until I see Alone in the Dark.",
            "review_date": "2008-12-21",
            "source": "rt"
        },
        {
            "content": "What a piece of shit. I'd give this 0 stars, but it won't let me",
            "review_date": "2008-12-20",
            "source": "rt"
        },
        {
            "content": "how many terrible video game movies can they make..JESUS!!!",
            "review_date": "2008-12-15",
            "source": "rt"
        },
        {
            "content": "it's worth watching with the commentary on for a laugh. highlights are when boll says how he put some girl in the movie just because she was hot and when he completely forgets that he put a certain scene in the movie and admits as such when he can't give any commentary on it.",
            "review_date": "2008-12-08",
            "source": "rt"
        },
        {
            "content": "WTF a Zombie movie with Matrix style??????\nand parts of the video game",
            "review_date": "2008-11-28",
            "source": "rt"
        },
        {
            "content": "This has to be the #1 worst movie I've ever seen in my life BECAUSE:\n\n1. I've seen better acting in a preschool play.\n2. They probably filmed it in a couple of hours.\n3. It made absolutely no sense whatsoever.\n4. The random flashes of the video game was kinda cool at first, but after the 17383643034547th time they did it, it got really old.\n5. Once again the acting was beyond terrible.\n6. It had nothing to do with the game.\n7. I will never play the game again because this movie has ruined it.\n8. They would have been better off releasing this movie as a comedy.\n9. The camera angles were horrible.\n10. The screen turned red when someone died. What.The.Fuck.\n11. It took them over 20 minutes to run to a house that was about 10 ft away from them.",
            "review_date": "2008-11-27",
            "source": "rt"
        },
        {
            "content": "The game is good, even the movie is very scary.",
            "review_date": "2008-11-22",
            "source": "rt"
        },
        {
            "content": "O MY GOD! WHY GOD WHY!",
            "review_date": "2008-11-16",
            "source": "rt"
        },
        {
            "content": "This movie sucked, the zombie were not very good, the actors had no talent for a zombie flick, get some new scream queens.",
            "review_date": "2008-11-16",
            "source": "rt"
        },
        {
            "content": "If you ever make a bet with a friend and the loser has to watch this movie, I advise that person to NOT pay up, and screw the winner over by killing themselves. THAT'S how bad this movie is.",
            "review_date": "2008-11-14",
            "source": "rt"
        },
        {
            "content": "Love the shots of the video game spliced in...",
            "review_date": "2008-11-10",
            "source": "rt"
        },
        {
            "content": "Wow this movie was terrible. I feel like a part of me has died for watching this film",
            "review_date": "2008-11-05",
            "source": "rt"
        },
        {
            "content": "Played the game on dreamcast years ago now i get 2 watch the film a ok zombie flick with gore comedy etc went over the top with guns and music where the director chuck 2 much of the game into it.",
            "review_date": "2008-11-04",
            "source": "rt"
        },
        {
            "content": "this movie was worst than Silent Hill ( yes I said it) i am not sure what it was about really but I HATED IT!!!!!  I want to give it 0 stars .....",
            "review_date": "2008-11-04",
            "source": "rt"
        },
        {
            "content": "A lot of people say Uwe Boll is one of the worst directors making movies.  A lot of people are right for once.  This film is atrocious.  It's not a \"so bad it's good\" sort of movie, it's far worse than that.  Not only does it manage to make ninety minutes far more tedious than you would ever think possible, but it manages to make zombies and gore very boring.  This movie is just plain stupid.",
            "review_date": "2008-11-04",
            "source": "rt"
        },
        {
            "content": "Ha! It has very little to do with the game, but this movie is so effing hilarious. Can anyone say \"guilty pleasure\"?",
            "review_date": "2008-11-03",
            "source": "rt"
        },
        {
            "content": "Ha! It has very little to do with the game, but this movie is so effing hilarious. Can anyone say \"guilty pleasure\"?",
            "review_date": "2008-11-03",
            "source": "rt"
        },
        {
            "content": "I thought I had seen it all.... but oh my god..\nThis is a parody... right....?.. right..? Please.. tell me I am right?",
            "review_date": "2008-11-03",
            "source": "rt"
        },
        {
            "content": "Kind of thought that the random scenes from the game were dumb and there was WAY TOO much of the flying around the characters during the shooting scene near the end...  But other than that it wasn't too shabby...  Sadly it wasn't great either. Definitely didn't need the nudity though, :S...",
            "review_date": "2008-10-28",
            "source": "rt"
        },
        {
            "content": "[center][center][center][center][size=4][b][img]http://images.rottentomatoes.com/images/user/smilies/rotten.gif[/img][/b][/size][size=4][b][img]http://images.rottentomatoes.com/images/user/smilies/rotten.gif[/img] [/b][/size][size=4][b]First Review [/b][/size][size=4][b][img]http://images.rottentomatoes.com/images/user/smilies/rotten.gif[/img][/b][/size][size=4][b][img]http://images.rottentomatoes.com/images/user/smilies/rotten.gif[/img][/b][/size]\n     [size=4][b][img]http://images.rottentomatoes.com/images/user/smilies/rotten.gif[/img][/b][/size][size=4][b][img]http://images.rottentomatoes.com/images/user/smilies/rotten.gif[/img] [/b][/size][size=4][b]Public's (IMDB) Rating: 2.0 [/b][/size][size=4][b][img]http://images.rottentomatoes.com/images/user/smilies/rotten.gif[/img][/b][/size][size=4][b][img]http://images.rottentomatoes.com/images/user/smilies/rotten.gif[/img][/b][/size]\n      [size=4][b][img]http://images.rottentomatoes.com/images/user/smilies/rotten.gif[/img][/b][/size][size=4][b][img]http://images.rottentomatoes.com/images/user/smilies/rotten.gif[/img] [/b][/size][size=4][b]Critic's (Tomatometer) Rating: 4% [/b][/size][size=4][b][img]http://images.rottentomatoes.com/images/user/smilies/rotten.gif[/img][/b][/size][size=4][b][img]http://images.rottentomatoes.com/images/user/smilies/rotten.gif[/img]\n[/b][/size][size=4][b][img]http://images.rottentomatoes.com/images/user/smilies/rotten.gif[/img][/b][/size][size=4][b][img]http://images.rottentomatoes.com/images/user/smilies/rotten.gif[/img] [/b][/size][size=4][b]IMDB Bottom 100! [/b][/size][size=4][b][img]http://images.rottentomatoes.com/images/user/smilies/rotten.gif[/img][/b][/size][size=4][b][img]http://images.rottentomatoes.com/images/user/smilies/rotten.gif[/img][/b][/size]\n[/center]\n   [/center]\n [/center]\n[/center]",
            "review_date": "2008-10-28",
            "source": "rt"
        },
        {
            "content": "OMFG.....if I could give this no stars I would, this movie sucked so much, I have no words for it.....I totally forgot about this damn movie until I was reading up on the \"10 Least Scary Horror Movies\" list, and this was on there.....whack ass movie",
            "review_date": "2008-10-27",
            "source": "rt"
        },
        {
            "content": "Wanted to see this film for so long to see just how bad it really is - and boy is it bad! Fun sometimes, though.",
            "review_date": "2008-10-27",
            "source": "rt"
        },
        {
            "content": "Hehe, House of the Dead jeste prilicno los film, ali Uve Bol je uvijek znao da \"ispravi\" stvar svojim reziserskim \"bravurama\". Sta reci npr. za scenu ulaska u kucu (mrtvih) koja predstavlja ekstremno produzen (i pri tome grozan) tehno video spot? Ima i nekih grudi koje nisu za baciti.",
            "review_date": "2008-10-21",
            "source": "rt"
        },
        {
            "content": "kriss de bon film de zombie",
            "review_date": "2008-10-21",
            "source": "rt"
        },
        {
            "content": "Atrociously-constructed, gratuitous, horny garbage but joyously stupid - I really enjoyed it, in a stupid way.",
            "review_date": "2008-10-19",
            "source": "rt"
        },
        {
            "content": "Yet another horrible video game movie.",
            "review_date": "2008-10-18",
            "source": "rt"
        },
        {
            "content": "Recently, I decided to bite the bullet and watch a Uwe Boll movie. If it was actually worth it is definitely questionable, but, I did manage to get some good laughs and a new Top Worst Film of All Time.\n\nSo, let's get this out of the way. Uwe Boll's House of the Dead lives up to the hype. It really is the worst (zombie) movie ever made. I cannot stress that enough really...it IS pure crap. Honestly, the only thing this movie is good for is unintentional laughs or a good nap. I found myself dozing off in a few of the action scenes as they were just plain boring. (And for some reason I decided to rewind some of them to see if I missed out on story?whoops! Bad mistake there)! The acting is atrocious, the score is beyond annoying (seriously, techno beats throughout the whole movie??), the story is almost non-existent, the characters are unbelievable and unlikeable (we get nil development and all stupidity) and the special effects are appalling.\n\nFor those who have no idea what House of the Dead is about, it is only fair to fill you in. Based off the popular rail-shooting arcade games, this follows a group of teens who are trying to get to a rave on an island. They miss their scheduled boat by 15 minutes, so they pay a smuggler to take them there. Upon arrival, they discover everyone is gone and the place is trashed. Do they leave? Nope, they stay for the free beer and to wander around in groups. They soon discover the island is infested with zombies, so they take refuge in a house and try survive the night.\n\nI do not know what could have been going through Boll's brain (if it exists) when he was making this. Shouldn't a smart, normal human realise they are making a bad movie when your teenage ravers can shoot shotguns, desert eagles and sub-machine guns with 100% precision and accuracy? Oh, and they can also perform high level martial arts! Shouldn't an intelligent man know its a bad movie when your action scenes directly rip-off \"The Matrix\" with poor CGI and dodgy slo-mo? Finally, how the holy $#*& can someone think inserting game footage into the movie makes it better? I am not joking when I say this, Boll actually includes numerous clips from the game during the action scenes and even includes a Game Over screenshot when one of the ravers dies! House of the Dead is consistently good at being absolute trite. With zombies that look identical (and are able to swim, sword-fight and get angered by breaking tanks full of red water), with bullets igniting barrels of gunpowder and with the power to get stabbed and die, but get up and crush a zombie's head only to die again, Uwe Boll has successfully created the most idiotic film in history. The movie is funny, though, and many could find joy at laughing at the many plot holes and clichés abundant throughout. Moreover, the random nudity may please some? Congratulations, Mr. Boll, you have managed to rape what could have been at least a mediocre movie!",
            "review_date": "2008-10-17",
            "source": "rt"
        },
        {
            "content": "terrible acting, terrible effects, goofs everywhere, an utter crapfest... I love it!",
            "review_date": "2008-10-17",
            "source": "rt"
        },
        {
            "content": "I only watched this because I thought the movie poster looked cool. I wish I hadn't. Let me sum this up: Boobs. Zombies. Slow motion. Shooting. Random scenes from a video game with \"Press start to play\" in the corner. Uhg..\n\nUwe Boll - please stop. Please!",
            "review_date": "2008-10-15",
            "source": "rt"
        },
        {
            "content": "Probably the worst movie ever made. Random cuts to game play sequences? Check. 20 Minute shoot-em-up scene running to a house less than 10 feet away? Check. People dying and having the screen turn red like \"game over\"? Check. Worse director in the history of film? Check.\n\nWith that said, there are only 3 things about this movie that actually keep me from want to hunt down and kill Uwe Boll:\nBoobs, Cuban Cigar smoking captain, and an very hot chick. She, however, doesn't show her boobs which is extremely upsetting.\nBut, for the love of God, don't ever watch this.",
            "review_date": "2008-10-12",
            "source": "rt"
        },
        {
            "content": "Do you know how hard you have to try to make a movie this bad?\r\n... like... really hard.",
            "review_date": "2008-10-09",
            "source": "rt"
        },
        {
            "content": "No tiene originalidad, normalmente me gustan este tipo de peliculas, pero esta no dio el kilo.",
            "review_date": "2008-10-06",
            "source": "rt"
        },
        {
            "content": "it was just bad! im still gonna watch the sequel but im not gonna keeps my hopes up",
            "review_date": "2008-10-06",
            "source": "rt"
        },
        {
            "content": "ok i like this movie i dont care what any one says no its not uwe boll's best movie but it is so much fun at drunk partys and the turn table shots are cool and i thought jothan cherry kicked some good ass sure the story sucked but to be honest thats not uwe's fault i dont see his name any where near the writing credits hell he didnt even have final cut! so the true person to blame is mark altman who has made so many BAD movies its not even funny....so i give this a high rating becuase i have seen it more then 10 times and i still enjoy it for the cheese",
            "review_date": "2008-10-03",
            "source": "rt"
        },
        {
            "content": "it was so bad that it was funny. i also watched the funny version of it and it just made me laugh twice as hard :)",
            "review_date": "2008-10-03",
            "source": "rt"
        },
        {
            "content": "I don't think this is the Directors cut version or the 'funny version' as i was hoping to review. As a fan of stupid zombie flicks this is the biggest piece of shit I have seen, I didnt even watch it all the way to the end. PATHETIC movie! Designed for drunken frat boys or somethen!? Boobs... Boobs... boobs.... I'm so freaking appauled!",
            "review_date": "2008-10-01",
            "source": "rt"
        },
        {
            "content": "average movie, prolly shoulda rated it lower but it had some fun scenes.  the video game scenes while the movie was playing were just absurd",
            "review_date": "2008-09-28",
            "source": "rt"
        },
        {
            "content": "Bad, Bad, Bad... What Resident Evil did so well, this film failed to do...  Can't even say the FX are worth looking at...",
            "review_date": "2008-09-26",
            "source": "rt"
        },
        {
            "content": "Definitely the worst movie i have ever seen.\nUwe Boll is without a doubt the worst director who ever lived. He's even worse than Eli Roth and Rob Zombie...",
            "review_date": "2008-09-26",
            "source": "rt"
        },
        {
            "content": "This was so bad I feel stupider for having watched it.",
            "review_date": "2008-09-21",
            "source": "rt"
        },
        {
            "content": "Uwe... come on. Stop making movies.",
            "review_date": "2008-09-20",
            "source": "rt"
        },
        {
            "content": "Uh, Uwe Boll is probably the worst director of all time.  And yes I am saying that he is worse than Ed Wood.  At least I can shit through Ed Wood's films.  This movie, I really wanted to shoot myself.  An awesome zombie shooter ruined by this piece of garbage.",
            "review_date": "2008-09-19",
            "source": "rt"
        },
        {
            "content": "Some of the actors are handsome but still they can't make me like this movie. It's just a B-class movie",
            "review_date": "2008-09-19",
            "source": "rt"
        },
        {
            "content": "Worst movie I ever rented.  i will always regret this choice.  Uwe Boll is positively the worst director on the face of the earth",
            "review_date": "2008-09-17",
            "source": "rt"
        },
        {
            "content": "Simply Uwe Boll at his best !",
            "review_date": "2008-09-14",
            "source": "rt"
        },
        {
            "content": "bad acting!, the two and a half stars go to the zombies they did a better job :)",
            "review_date": "2008-09-12",
            "source": "rt"
        },
        {
            "content": "WHY WAS THIS NOTHING TO DO WITH THE GAME!?!??! WRRRRRRRYYYY?!?!??!!",
            "review_date": "2008-09-09",
            "source": "rt"
        },
        {
            "content": "Kind of like Scooby-Doo with tits and gore! One star for Jurgen Ponchnov, who is always cool. One star for the cinematography and creepy music. Half a star for everything else - and that is being over-generous!",
            "review_date": "2008-08-31",
            "source": "rt"
        },
        {
            "content": "Under Romero's works\nNot the best VG adaptation at all.\nIn the genre, the RE r way better.",
            "review_date": "2008-08-29",
            "source": "rt"
        },
        {
            "content": "There are many words to describe this film... most are not very nice so I will just say, this movie is bad.  I love zombie films, but this... this pushes the limits, this makes \"Day of the Dead: Contagium\" look like a work of pure genius.  I played the video game a lot and I thought it would make a good film, this is not it.  Uwe Boll should be tried for crimes against humanity, his 'films' are just all so bad, how can one person make so many bad films???  The zombies look like bad halloween costumes, the acting is appalling, even from people like Prochnow... Boll must have had some pretty incriminating photos to be able to blackmail him into doing this.  And whats with the 10 minute Matrix sequence in the middle that just keep going and going, only to be played in reverse in about 30 secs, just incase you forgot something, but what really adds the last gem of steaming crap on this is that there are shots from the game inter-cut into the live action footage!?!?! Are you kidding me??  I see some people here are saying this is a trashy classic and its not as bad as people say... DON'T LISTEN TO THEM!!!!  THEY LIE!!!!!  The only good thing I can say is that at least I'd rather watch this than \"Battlefield Earth\".  Even if you are bored stupid and ALL the other titles are rented at your local video store, leave this one on the shelf, its not worth the pain.",
            "review_date": "2008-08-27",
            "source": "rt"
        },
        {
            "content": "Un jeu video depourvu de reel scenario devient un survival pas stressant du tout, avec les zombies les plus nazebroques qu'on ait vu depuis bien longtemps.  Ca s'appelle \"House of the Dead\" et ca n'est meme pas digne de caler un pied de meuble...",
            "review_date": "2008-08-23",
            "source": "rt"
        },
        {
            "content": "Um... well... I don't know what to say about this mish mash of dumb.  Horrible dialogue, horrible acting, horrible to non-existent plot.  \r\n\r\nIt did have a lot of boobs, and it did have a zombie sword fight, so it ain't all bad.  I didn't understand why they put the crazy as hell fight scene that lasts 10 minutes before the third act, though.  They should have waited to blow their proverbial load.\r\n\r\nWatch this movie with a lot of friends.  Or with drugs.\r\nOr both.",
            "review_date": "2008-08-19",
            "source": "rt"
        },
        {
            "content": "This is a review about the videogame series. It's a good arcade game even though eye never could beat it with only three dollars worth of quarters, shame. Deduct four and a half stars for film review. Two little words are needed to let you know that this movie sucks...Uwe Boll. Yes ladies and gentleman this film was indeed directed by the infamous movie killer. Eye have the missfortune somehow just having to watch movies in cinema hell! Go to Far Far AwayLand before thinking of giving this a look!",
            "review_date": "2008-08-19",
            "source": "rt"
        },
        {
            "content": "The greatest movie I've ever seen, zombie pretentious.",
            "review_date": "2008-08-18",
            "source": "rt"
        },
        {
            "content": "Quite possibly one of the worst movies EVER. Why did I waste my time with this? This was such crap, the story, the \"acting\", the \"effects\", the \"zoombays\". Everything was bad, it did such an injustice to the games it sickens me. Not scary or good, and, to make it worse, they insert random clips from the video game. I don't like movies where the zoombays are gay, and run, sometimes I do, but not this time. The directing of some of the shots was just crap. DON'T EVER SEE THIS MOVIE!",
            "review_date": "2008-08-14",
            "source": "rt"
        }
    ]
}