{
    "rating": 9.1,
    "release_date": "2003-11-26",
    "num_reviews": 190,
    "genres": [
        "Drama"
    ],
    "summary": "The Sullivan family emigrates from Ireland to New York City as father Johnny (Paddy Considine) chases his dream of being an actor. Living in a small Hell's Kitchen apartment, the family settles into American life despite their deplorable living conditions. Wife Sarah (Samantha Morton) works at an ice parlor while Johnny looks for work as an actor, both haunted by memories of their dead son, Frankie. Daughter Christie (Sarah Bolger) documents the family's American journey with a video camera.",
    "reviews": [
        {
            "content": "Paddy is excellent as always. It's a few \nyears since I watched this but it remains the movie that made me into the biggest emotional mess. I wept. Hard.",
            "review_date": "2023-01-03",
            "source": "rt"
        },
        {
            "content": "It starts out too slow were as my wife made me turn it off by the E.T. movie scene.  I watched it by myself later and really enjoyed it.  A lot of symbolism as Mateo dies, Sarah Mateo is brought to life.  A dying man teaches a living man about life, etc.",
            "review_date": "2022-03-04",
            "source": "rt"
        },
        {
            "content": "This movie was superb. It had such an amazing story line, fantastic acting, and the two major stars of the movie, the younger girls, did such a mature and incredible job handling their parts.\n\nI loved the feel good story, the family background, and the way it portrays a life in struggle and in good times.\n\nI would highly recommend this to anyone. A wonderful family movie.",
            "review_date": "2022-01-21",
            "source": "rt"
        },
        {
            "content": "Absolutely loved this movie. Why?, you ask. Because the character's, especially the two young girls were absolutely amazing.  I wanted to take them home with me.  The movie seemed like a slice of real life - nothing happened that couldn't have happened, but much ofit felt as though it must have happened. Still, until it was over, I had no idea that it was a true story.\nFor those who felt it  didn't depict the Irish Immigrant experience well enough, I say that you must have missed that they drove into the states from Canada.  Clearly, they immigrated there first, not the U.S. - and since we were not given a glimpse of their time in Canada, nor how long they stayed there, we must assume that they spent some time there, because they drove to the U.S. in a car that they bought and carried possessions with them, things that they bought while in Canada.",
            "review_date": "2022-01-02",
            "source": "rt"
        },
        {
            "content": "While it's true that movies detailing the immigrant experience in America are nothing new and Jim Sheridan's In America doesn't really add anything new to the theme, it is still a fine film.  Loosely based on Sheridan's own experiences, what makes In America a cut above other similar films are the subtle and nuanced writing and some fine performances, most notably those of Sarah and Emma Bolger as the young daughters of Johnny and Sarah (Paddy Considine and Samantha Morton).  While the movie may be a bit episodic and melodramatic at times, it is effective in capturing the angst experienced by immigrants arriving in a new land.",
            "review_date": "2021-01-21",
            "source": "rt"
        },
        {
            "content": "A film about how you can leave but you can't leave the past, and not moving past tragedy will change you in dark ways, In America gives us a family that knows that all too well. A move to the States from abroad, a new home with the dangers and possibilities that come with it, and three carefully chosen wishes frame this glorious film. \nPaddy Considine, the wonderful Samantha Morton, and Djimon Hounsou are all stellar as Irish couple Johnny and Sarah, struggling with two kids in a new country, and their neighbor in their slum building; himself an immigrant who struggles with his own rage and frustrations. But the two daughters, Christy and Ariel, are given life by the outstanding performances of Sarah and Emma Bolger. Christy cries when no one can see her, is so seemingly happy and composed with her camcorder seemingly always at the ready, but she's also the one who has, \"been carrying (this) family on (her) back...since Frankie died.\" Yes, the her mom and dad are still weakened and sad since Frankie was their baby boy. But he was her little brother, too.\nTop notch work here by director Jim Sheridan and his two accomplices on the screenplay, his own daughters Naomi and Kristen. The film feels a piece with the tone, pacing, and editing the work of a director at the top of his game. 4 stars, love.",
            "review_date": "2020-12-28",
            "source": "rt"
        },
        {
            "content": "Drama for the sake of drama.",
            "review_date": "2020-12-20",
            "source": "rt"
        },
        {
            "content": "Not an easy watch but with Morton and Hounsou giving their best performances in a lifetime full of them, it is a must see.",
            "review_date": "2020-06-30",
            "source": "rt"
        },
        {
            "content": "I’ve seen a fair number of movies about people struggling to make ends meet as they come to America, and they often are quite depressing and hard to watch. In America has the added bummer of focusing on a family that is mourning the loss of a child. Yet there’s something delightfully joyful about this film. The performances, particularly from the young girls, have a sense of hope and make even these difficult situations seem bearable. I loved seeing this family live their lives, and bring happiness to a home that could be so dreary. Unlike many other stories where we are forced to wallow in the poverty of the characters, and see the pathetic struggle to make ends meet, I never felt that here. We could see that they were having financial troubles, but the movie didn’t become focused on that aspect. Now, that’s not to say there are no moments of sadness in the movie. In fact, I was crying like a baby multiple times while watching, but that’s because I connected with these people first and therefore cared about their heartache. I also have to commend the story-telling techniques used throughout the film. This is one of the rare times that I felt voiceover was not only warranted, but actually improved the story. We get tiny bits of insight when we hear what the older sister is thinking. There is also a scene that was so powerful I told multiple people about it immediately after watching the film. I cannot remember the last time I was so tense in a movie that was not a thriller or horror film of any kind. There was a moment where I literally covered my eyes, because I could not bear to watch. Any time a movie is capable of controlling how I feel to that degree, I have to applaud the film-makers. There were certain aspects of In America that were predictable, like the fact that the neighbor played by Djimon Hounsou is going to have a bigger role in the story, but I didn’t find it bothersome that I could see some things coming. In America is a delightful movie, that had me laughing, crying, and anxiously anticipating when I might see it again.",
            "review_date": "2020-03-12",
            "source": "rt"
        },
        {
            "content": "This movie brings me to tears like no other. The fact that no one knows about it makes me so sad. I've taken 2 film classes in 2 separate schools with different teachers and this movie was part of both curriculums. From a pure filmmaking perspective, this is a masterpiece, nevermind the emotional aspect.",
            "review_date": "2020-01-19",
            "source": "rt"
        },
        {
            "content": "One of the best movies that I have ever seen! Everything about this movie was absolutely beautiful.",
            "review_date": "2018-11-19",
            "source": "rt"
        },
        {
            "content": "Could they make Sam Morton look any worse? But, in all, it all works, stirring the melting pot. See Sarah Bolger as a pretty girl before she became a truly fresh face. A good show with great kid performances, the warmth of family life in less than ideal conditions. Hounsou's especially good. Enjoy!  | - Norm de Guerre",
            "review_date": "2017-10-25",
            "source": "rt"
        },
        {
            "content": "This is absolutely one of the best movies I have ever seen! So engrossing, and beautifully acted by all of the cast.  It is a movie you will never forget!",
            "review_date": "2017-09-17",
            "source": "rt"
        },
        {
            "content": "In America means well, but weak acting and a foolish script overcome its message.",
            "review_date": "2017-02-07",
            "source": "rt"
        },
        {
            "content": "Jim Sheridan's magnificent and dream-like memoir of confronting grief and loss in 80s New York fully deserved its Academy Award nominations, and should be more widely known. The measure of his greatness as director and co-writer is the subtlety of the performances he elicits from the entire cast and his resistance to anything manipulative or corny.",
            "review_date": "2016-04-23",
            "source": "rt"
        },
        {
            "content": "Don't do depressing well... Slow moving, dry. Some tender moments, but did not enjoy.",
            "review_date": "2016-02-26",
            "source": "rt"
        },
        {
            "content": "An absolutely diabolical film with a lack of authenticity and a real time-period crisis; seemingly set in 1982 at some points, but nothing, from the soundtrack to the wardrobe, would indicate this. Other than ET being referenced multiple times, everything else points to this being set in the 1990s; a rather advanced LCD equipped camcorder, and the radio host announcing \"Music from the 60s, 70s, 80s and 90s\" as the family travel by car to NY. Lacking in any kind of social realism, \"poverty\" never seems to be any real threat or hardship, next month's rent money can be gambled away trying to win a stuffed ET without any real consequence or subsequent peril. The message seems to be that black people aren't as scary as you'd think, but they do of course practice voodoo magic, and society's underclass are just a host of colourful characters; sometimes they are, and I think it's supposed to be surprising, actually good people at heart (I know right, the poor can't possibly be kind or trustworthy..). Sometimes of course, the poor are just out to get you as you'd expect. Terribly clichéd characters, laughable dialogue that ruins any potential \"moments\" the film may have had and a universe that seems to bend its own rules whenever it sees fit to suit its agenda. Characters behave inconsistently, with pretty much every one of them having a surprisingly bat-shit crazy breakdown and/or reconciliation that comes out of absolutely nowhere at some point in the film. Goes for whimsy over realism in its portrayal of poverty, and tear-jerker tropes in lieu of making you actually feel for any of the characters. No matter how mundane it might have been at points, I'm sure the real story it's based on is very moving, and would have been much more engaging without the added mysticism and magic. \"You know, poverty's like, so bad, one time our Hallowe'en costumes.. were.. like... talked about in hushed tones...\" is pretty much as threatening as poverty ever gets in this completely misguided film. The film critic who mentioned Capra in the same sentence as this steaming turd of a film really needs to resign immediately.",
            "review_date": "2016-01-20",
            "source": "rt"
        },
        {
            "content": "Intimate, sweet, and hopeful, this semi-autobiographical story takes artistic approaches to the difficulties of sustaining family life and adjusting to a new home.",
            "review_date": "2015-07-25",
            "source": "rt"
        },
        {
            "content": "my hubby and I were looking for a movies we hadn't seen and we ran across this one.. i so enjoyed it",
            "review_date": "2015-05-17",
            "source": "rt"
        },
        {
            "content": "An immigrant story you haven't seen and wouldn't expect to see in this day (there white!). Its got a little 90's feel to it, lots of drama and an obligatory sex scene. Feel good while being dirty, edgy and yet still critic proof. Not the kind of movie that you want to see again or will change your life but its a good for your soul hopeful kind of film.",
            "review_date": "2015-03-20",
            "source": "rt"
        },
        {
            "content": "Very interesting story with an amazing performance from Samantha Morton. She deserved to win the Oscar in 2003 and the screenplay deserved to win as well. All the performances including the kids and the dad were superb",
            "review_date": "2015-02-23",
            "source": "rt"
        },
        {
            "content": "7.6/10\nVery touching movie with excellent performances by its adult cast, and most impressively by its younger cast. Th story was also very good and it's characters extremely human, which made it very emotional in some critical moments. Overall, very good movie about letting go and the American Dream. \n~February 13, 2015~",
            "review_date": "2015-02-13",
            "source": "rt"
        },
        {
            "content": "Poignant, charming, beautifully filmed story of an Irish immigrant family struggling with poverty and the loss of a child to cancer in a new country, seen through the eyes of the eldest little girl in the family and her camcorder. Wonderful, worth-while flick, and the two little sister who play the sisters are wonderful, natural actresses.",
            "review_date": "2015-01-27",
            "source": "rt"
        },
        {
            "content": "This is showing on Time Warner Cable under \"On Demand/Free Movies/Sundance\"; worth seeing for sure.  But I don't think I'll ever quite say good-bye to my Jennifer.  Sometimes, I actually find myself saying hello.",
            "review_date": "2014-08-15",
            "source": "rt"
        },
        {
            "content": "A moving tale of immigration that I know I'll never forget.\n\nFull review at filmbroadcaster.weebly.com",
            "review_date": "2014-07-07",
            "source": "rt"
        },
        {
            "content": "In the first scene of Jim Sheridan's ''In America'' we meet an Irish family of four as they attempt to cross the Canadian border into America. Before being questioned by border control the man of the family, Johnny, reminds his two young girls to sustain the pretence that they are 'on holiday,' knowing that to divulge any more information would greatly harm their chances of entrance. As Johnny is questioned at his car window by the youngest girl naively blurts out from the back seat that her 'dad's not working,' thus arousing the suspicions of the immigration officer. He knows that is not uncommon for desperate families to seek refuge in the land of opportunity. However, the officer is not a stranger to compassion. He is conspicuously charmed by the gobby little girl, and when he learns by accident that this family have recently lost a young son his official demeanour softens and he admits the family into the U.S.A. In this utterly delightful opening scene you might say that director Jim Sheridan is setting out his stall to move his audience. He wants to charm us in the same way the little girl charms the immigration officer. He wants to earn our pity and for us to sympathise with this family's plight. For the most part he succeeds in his mission. It's a very emotional movie but I hesitate to call it emotionally manipulative. The references to ET; The nostalgic view of America; The unjust death of a child etc. All these efforts to move us and make us weep are so genuine and so transparent that you do not feel manipulated. This is one of those irresistibly charming movies that you just surrender yourself to. \r\n\r\nOf course it also helps when you have two of the greatest living performers in the lead roles. Paddy Considine is excellent as the head of the household, Johnny. Johnny is a likeable and sympathetic character who is struggling in his career as an actor, but would do anything for his family. Since the death of his son he sees himself as a hollow shell of his former self but in key moments he proves his worth. In one great scene he somehow acquires the Herculean strength to haul an air conditioner through the streets of New York and up the stairs to his top-storey flat, only to realize that the plug does not fit into the outlet. Likewise the ever-reliable Samantha Morton is great as Sarah, who is dealing with the loss of her son in a very different way. She wears a smile and is exasperated by Johnny's lack of emotion, but deep down is still suffering from guilt and sadness over the recent tragedy. The child actresses(real life sisters Sarah and Emma Bolger) are also very natural screen presences. One of the main story threads involves these two girls, Christy and Ariel, befriending an enigmatic neighbour named Mateo(Djimon Hounsou),who despite having an angry 'keep out' notice on his door, is soon revealed to be a kind-hearted artist and mystic. \r\n\r\nThe story is almost Dickension in its mix of toughness and unabashed sentimentality. Yet although it has a very soft heart and a fantastical air, it is also very observant in its portrayal of a family's struggle to adapt to a foreign country. As well as the obvious financial throes, this Irish immigrant family faces challenges ranging from social class distinctions to the unfamiliar heat waves of New York. The way the death of a small child hangs over events adds an extra layer of melancholy to their struggles. But while the movie does not shy away from grim realities it maintains a sense of childlike, spiritual wonder throughout. Among other things it's a hymn to childhood imagination, which has the ability to transform a run-down apartment building into a haunted house. Sheridan masterfully links the elements of folklore with kitchen sink realism. It is as much about the powers of the human spirit as it is about the down-to-earth throes of a penniless family. To nitpick a little I did feel like the final act was perhaps a teeny-tiny bit overwrought. All in all, though, this very heart-warming and well-acted movie certainly won me over.",
            "review_date": "2014-05-05",
            "source": "rt"
        },
        {
            "content": "Great acting and a interesting story that plays less with prejudice and more with hopes and assimilation for a family in America. It does show a less than great side of America, breaking the idiom of 'Land of Opportunity' in its idealistic sense.",
            "review_date": "2014-05-01",
            "source": "rt"
        },
        {
            "content": "Disappointing  melodrama",
            "review_date": "2014-03-29",
            "source": "rt"
        },
        {
            "content": "love this family. love this movie!",
            "review_date": "2014-02-14",
            "source": "rt"
        },
        {
            "content": "A genuinely beautiful and moving drama about a family of Irish immigrants struggling to settle in America.  I've always rated Samantha Morton as an actress, she rarely disappoints with her performances and she's as good as ever in this, as the mother of the struggling family, married to emotionless Paddy Considine.  The two Irish girls who play the children were real-life sisters and their performances are fantastic for young actresses.  Djimon Hounsou is also excellent as the family's mysterious neighbour who harbours a sad secret.  Special mention for Gavin Friday & Maurice Seezer's music.",
            "review_date": "2014-01-14",
            "source": "rt"
        },
        {
            "content": "Beautiful film, stays with you",
            "review_date": "2013-12-13",
            "source": "rt"
        },
        {
            "content": "Very sweet film with great child performances!",
            "review_date": "2013-11-18",
            "source": "rt"
        },
        {
            "content": "This depiction of Irish immigrant life is good but not great. If I was to venture a guess on the missing element then I would have to say that culture shock should not have been as great for this family as perhaps one immigrating from the developing world. Pick a family from a more foreign place and you will likely get a better film.",
            "review_date": "2013-10-24",
            "source": "rt"
        },
        {
            "content": "In America is one of the best movies I have seen in my life, period. The film is the story of an Irish family immigrating to NY and trying to cope with the loss of a child. The acting is brilliant and the story is really good. Highly recommended.",
            "review_date": "2013-10-22",
            "source": "rt"
        },
        {
            "content": "Christy: [voiceover] It was as hard for Frankie to smile when the tumor was malignant as it was for my dad to cry after. But they both managed it. I'm going to switch this off now. It's not the way I want to see Frankie any more. Do you still have a picture of me in your head? Well, that's like the picture I want to have of Frankie. One that you can keep in your head forever. So when you go back to reality, I'll ask Frankie to please, please let me go.\n\nIn America es una película que lidea con la inmigración ilegal de una familia de Irlanda a Nueva York y la integración que esto conlleva, y tratar de vivir luego de la pérdida de un ser querido cercano. Esta película es reconfortante, y muestra como cada miembro de la familia lidea con las dificultades en este nuevo país. El padre (Johnny) se sumerge en su trabajo, ya que tiene una presión tremenda de apoyar económicamente a su familia. Su esposa (Sarah) trata de pretender que todo está bien por sus hijas, pero lleva una culpa enorme por dentro. La hija mayor (Ariel) que es la narradora de la película -una decisión acertada ya que le da inocencia a el tema - esta convencida que tiene 3 deseos para ayudar a su familia y tiene que gastarlos sabiamente. Aunque ella se muestra fuerte, lidia con esto en su propia manera, que es capturar lo más posible con una videograbadora, y pareciera que no se quiere perder u olvidar nada y por último Christy que es la pequeña, confía en todo el mundo y siempre trata de ver el lado positivo a todo. A su vida llega un hombre misterioso llamado Mateo (Djimon Hounsou), que les da varias lecciones de vida y los ayuda a sobrellevar el dolor. \n\nEsta película lidia con muchas emociones, pero es el humor que previene que se torne trágico o melodramático. Algunas escenas igual son difíciles se ver, sobretodo la del carnaval donde Johnny trata de ganar el peluche de ET para Christy, y muestra la presión de los padres para no decepcionar a sus hijos. En lo que esta película se destaca, es en mostrar las dinámicas familiares ante un evento trágico, y las actuaciones ayudan a que esto sea realista. Igualmente la edición y algunas escenas fueron extrañas y no entendí porque tomaron ese enfoque. Por ejemplo, cuando introducen al personaje de Mateo lo hacen ver como alguien que realiza rituales y sacrificios satánicos, y luego nos damos cuanta que no tiene nada que ver con su carácter. Escenas como esta fueron las que me sacaron un poco del contexto y sobretodo de la gran carga emocional de In America.",
            "review_date": "2013-09-06",
            "source": "rt"
        },
        {
            "content": "http://ohjoohyun.tistory.com/13",
            "review_date": "2013-08-12",
            "source": "rt"
        },
        {
            "content": "It's a movie that accurately depicts life itself. With every crushing low there will always be a spiraling high.",
            "review_date": "2013-07-16",
            "source": "rt"
        },
        {
            "content": "A pretty nice story about an immigrant family moving to New York city. It's just showing how this family gets use to living in a crap neighbor hood of NYC and making the best of it. I felt some of the characters were a bit annoying expectably the kids. The film moves very fast but at times I felt it dragged with somethings and just got a little boring. The dad was great, his character was really the only one I really liked. Always trying to support everyone and such. The performances were great, even from the kids. It's a nice story but I feel like it was missing something yet the ending was very nice.",
            "review_date": "2013-06-07",
            "source": "rt"
        },
        {
            "content": "Simply captivating from start to finish, despite how the formerly established plot line segued into a more melodramatic one. And great performances from the cast, I might add. This one will definitely stick around with me for a long time.",
            "review_date": "2013-05-28",
            "source": "rt"
        },
        {
            "content": "Simple yet touching story, I am on love with the whole characters on this movie.",
            "review_date": "2013-05-26",
            "source": "rt"
        },
        {
            "content": "Every time the film seems about to drown in its gushy script, a meaningful camera shot or one of the film's fantastic performers (especially Morton) salvages the moment. Overall, the movie leaves you with a good, only slightly contrived, feeling.",
            "review_date": "2013-05-08",
            "source": "rt"
        },
        {
            "content": "A heartfelt, great indie, with an unreal performance from the fantastic Djimon Honsou",
            "review_date": "2013-05-03",
            "source": "rt"
        },
        {
            "content": "This film shows the best of these characters in this movie.  They have dreams and they have hope and they can overcome what life throws at them.  The young girls in the storyline have hope and innocence and they accept this new world that they have moved into and a new way of life.  I recommend this film.",
            "review_date": "2013-04-21",
            "source": "rt"
        },
        {
            "content": "Really fantastic film-very moving. They could have done a better job on explaining when in hell it was supposed to be taking place...but that's my only quibble-definitely worth the watch.",
            "review_date": "2013-03-07",
            "source": "rt"
        },
        {
            "content": "It's a nice idea, but the movie really isn't good. At first they get you thinking one thing, then another, then another... I found the acting really funny.",
            "review_date": "2013-02-28",
            "source": "rt"
        },
        {
            "content": "Sweet and simple, if a bit manipulative.",
            "review_date": "2013-02-27",
            "source": "rt"
        },
        {
            "content": "Sometimes I search too hard for extra meaning in films. In \"In America\", I think the film stands simply as a fluid story about one family trying to survive a tragic situation. And they ARE survivors, like so many others who try to get through the day, even though the thought of giving up is just as enticing. The Bolger girls are the glue for this film, and Samantha Morton and Paddy Considine are excellent as well. While sometimes the storytelling is uneven, I love the way we are forced to see situations from the perspectives of adults and children.",
            "review_date": "2013-01-30",
            "source": "rt"
        },
        {
            "content": "A huge snoozefest fronting like it is some immigration breakthrough on how to live in America if you're from another country. Knock knock..It's the neighbor with AIDS who has a life lesson I think you should learn something from him.",
            "review_date": "2013-01-05",
            "source": "rt"
        },
        {
            "content": "Hard hitting at times, but extremely touching at others. Stunningly acted by Considine, Morton, and Hounsou. The young girls are also very impressive.",
            "review_date": "2013-01-03",
            "source": "rt"
        },
        {
            "content": "kayak keluarga beneran.",
            "review_date": "2013-01-02",
            "source": "rt"
        },
        {
            "content": "Deep touching drama. Makes people believe in a good future.",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "Such a moving film. Wonderful acting, especially by the young girls.",
            "review_date": "2012-12-02",
            "source": "rt"
        },
        {
            "content": "watched this in class.\n\nliked a few scenes in the movie, but that's really it.",
            "review_date": "2012-11-04",
            "source": "rt"
        },
        {
            "content": "Wow, what a great film. Emotion, scenery, symbolism, and even humor is packed into this film.\nDespite very very minor flaws, this is a phenomenal film.\n9.5/10",
            "review_date": "2012-10-24",
            "source": "rt"
        },
        {
            "content": "In America's simplicity is great at first, but worn out by the third act, when the melodrama and boredom kick into gear.",
            "review_date": "2012-10-05",
            "source": "rt"
        },
        {
            "content": "A beautiful, sad and moving picture. Paddy Constantine is marvelous.",
            "review_date": "2012-09-30",
            "source": "rt"
        },
        {
            "content": "This was a great film that I'm surprised I had never seen. This was a great drama with a lot of heart. I can definitely see why the cast got nominated. Djimon Hounsou stole the film with his portrayal of Moteo, a frustrated artist dying of AIDS. But that shouldn't surprise me because he is an amazing actor. So if you're down to see an amazing drama with a diverse cast I would highly recommend this film.",
            "review_date": "2012-09-28",
            "source": "rt"
        },
        {
            "content": "Brilliant acting. Mr. Sheridan superbly guided the movie into a tear-jerking, bright and positive drama.",
            "review_date": "2012-09-01",
            "source": "rt"
        },
        {
            "content": "It's a little too magical and at times melodramatic for my tastes but it's also a heartwarming, humurous, hopeful story with laudable performances all around.",
            "review_date": "2012-09-01",
            "source": "rt"
        },
        {
            "content": "Loved every minute of it ...",
            "review_date": "2012-08-25",
            "source": "rt"
        },
        {
            "content": "Such an underrated but touching and moving movie. I cannot recommend this enough. Immigration can be tough but with some love and good people on the way  it can be a great adventure too;full of hope meaning and love.I wish Sheridan was still making such good stuff. Watch it. It deserves it.",
            "review_date": "2012-08-24",
            "source": "rt"
        },
        {
            "content": "Very touching movie. I like that it's told from the little girl's point of view.",
            "review_date": "2012-08-21",
            "source": "rt"
        },
        {
            "content": "A great movie that shows what the \"American Dream\" can do to people immigrating here. A great story with a lot of heart-filled moments.",
            "review_date": "2012-08-13",
            "source": "rt"
        },
        {
            "content": "In America is a beautiful and heart-breaking tale about an Irish family adjusting to life in Manhattan.",
            "review_date": "2012-08-12",
            "source": "rt"
        },
        {
            "content": "What a moving story. It is so wrenching to watch.",
            "review_date": "2012-07-28",
            "source": "rt"
        },
        {
            "content": "Want your girlfriend to see you cry so you can get her into bed? In America",
            "review_date": "2012-07-21",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies of all times. Filmed waaaay b4 it's time. The issues of race, sexuality, family, poverty and immigration are still relevant today. I would argue that only a true old school New Yorker could really appreciate certain aspects of the movie (like the bath tub in the livingroom) but this is just another reason that makes me love this film even more. The little girls performance is astounding!",
            "review_date": "2012-06-22",
            "source": "rt"
        },
        {
            "content": "liked this movie, its pretty sad",
            "review_date": "2012-06-14",
            "source": "rt"
        },
        {
            "content": "a pretty good realistic movie",
            "review_date": "2012-05-28",
            "source": "rt"
        },
        {
            "content": "nice but sad..well realistic",
            "review_date": "2012-05-07",
            "source": "rt"
        },
        {
            "content": "Probably one of my favourite movies",
            "review_date": "2012-05-03",
            "source": "rt"
        },
        {
            "content": "Almost unbearably sad.  But really good.",
            "review_date": "2012-04-26",
            "source": "rt"
        },
        {
            "content": "great film. touching, sad, but really good.",
            "review_date": "2012-04-17",
            "source": "rt"
        },
        {
            "content": "it touched my heart. I relly love this film.",
            "review_date": "2012-03-27",
            "source": "rt"
        },
        {
            "content": "A movie that allows you to see an immigrant's perspective through a child's eye-view.  SIMPLY GREAT!",
            "review_date": "2012-03-07",
            "source": "rt"
        },
        {
            "content": "This was a great movie about a family of poor Irish immigrants moving into Hell's Kitchen in New York.  The acting is memorable, especially by the two daughters are also sisters in real life.  Emma Bolger put out the best performance by a child actor I've ever seen.",
            "review_date": "2012-02-13",
            "source": "rt"
        },
        {
            "content": "One of the best movies you've never heard of, and one of the best I've seen in a long time.",
            "review_date": "2012-02-11",
            "source": "rt"
        },
        {
            "content": "A solid look at the struggles of the immigrant experience to the US...",
            "review_date": "2012-02-08",
            "source": "rt"
        },
        {
            "content": "A really good film, entertaining throughout and a great film for the whole family to enjoy.",
            "review_date": "2012-01-28",
            "source": "rt"
        },
        {
            "content": "A moving, touching piece. Although \"In America\" seems to struggle to find what its' story is in the very beginning, it recovers nicely and ends strong.",
            "review_date": "2012-01-08",
            "source": "rt"
        },
        {
            "content": "A touching look at immigrant life.  The best part of the movie is the subtle reference to the Langley Schools Music Project.",
            "review_date": "2012-01-07",
            "source": "rt"
        },
        {
            "content": "Heartbreaking, devestating, and so well-written.  The father character, in particular, keeps me coming back.  Such a strong portrayal of love and sacrifice!  For me, this examplifies the best of what modern storytelling can do.",
            "review_date": "2012-01-06",
            "source": "rt"
        },
        {
            "content": "This is a touching and beautiful film, and one that I feel is very important and should be seen. Makes you think about how lucky you really are, and appreciate the struggles of these people who give up everything for a chance at a better life.",
            "review_date": "2012-01-04",
            "source": "rt"
        },
        {
            "content": "Touching, if somewhat over melodramatic story about an Irish family struggling to make a new life in America and deal with the tragic losses of the past. Sarah Bolger steels the show in a wonderful performance as the 10yo daughter. Found the use of some dark imagery confusing and inconsistent with the overall theme.",
            "review_date": "2012-01-01",
            "source": "rt"
        },
        {
            "content": "Amazing, beautiful. Captures what is beautiful (& what's wrong) in America.",
            "review_date": "2011-12-23",
            "source": "rt"
        },
        {
            "content": "Magi?an film, bez obzira na naslov i buldoerom natrpane emocije, ba me poharao.",
            "review_date": "2011-12-12",
            "source": "rt"
        },
        {
            "content": "A beautifully-made film from the always reliable Jim Sheridan, In America deals with the very real issue of immigrants settling into a new environment and the difficulties they face in doing so. It's particularly relevant to Irish people as the millions of Irish-Americans will testify, but it applies to people of so many other nationalities too. Of particular note in this film are the great performances from the child actors. They're moving, spirited and thoroughly funny at times too; it's impossible not to like them! The relationship between husband and wife, though harrowing at times, is also superb to watch and portrays quite accurately what an immigrant family in such financial difficulty would experience.\n\nDjimon Hounsou adds an unexpected twist to the film but his character proves to be one of my favourites and his relationship with the girls is beautiful too.\nBravo, Jim Sheridan. Another great film from you.",
            "review_date": "2011-12-11",
            "source": "rt"
        },
        {
            "content": "A film that feels like it's been lost in the editing suite. Too much is hinted at but not explored fully and even when it tries to slip into mawkish sentimentality it doesn't even dive in completely. Perhaps it's trying too hard to be all things, but its a shame because it feels like less than the sum of its parts.",
            "review_date": "2011-12-02",
            "source": "rt"
        },
        {
            "content": "A definite winner and a lot more relevant now than when it was made, for better or worse. The two adult actors struggle with their effected Oirish accents, but their acting skills make up for it. The two child-actors are absolutely terrific. Also, Djimon's great in it.",
            "review_date": "2011-11-20",
            "source": "rt"
        },
        {
            "content": "Hands down, the best film I've ever seen. The story is incredible.",
            "review_date": "2011-11-11",
            "source": "rt"
        },
        {
            "content": "This movie was good. I liked it. I really liked the part with the E.T. doll. I think you should see it too.",
            "review_date": "2011-11-11",
            "source": "rt"
        },
        {
            "content": "One of the best movies about life, faith, death and new beginnings. \n\nBeautifully crafted",
            "review_date": "2011-09-17",
            "source": "rt"
        },
        {
            "content": "Thursday, September 15, 2011\r\n\r\n(2003) In America\r\nDRAMA\r\n\r\nNarration of a particular Irish family's difficult adaption on their first stay in New York City during the early 1980s, with an odd African American living below them! \r\nOne of movie critic's Richard Roepers best movie of 2003, but a little too melodramatic for my tastes with some great performances but very sappy, and intentioned for the simple minded!\r\n\r\n2 out of 4",
            "review_date": "2011-09-15",
            "source": "rt"
        },
        {
            "content": "A solid look at the struggles of the immigrant experience to the US...",
            "review_date": "2011-09-09",
            "source": "rt"
        },
        {
            "content": "Two of Britains best new breed in a pretty good film. The story is not great but the performances are worth watching it for.",
            "review_date": "2011-09-09",
            "source": "rt"
        },
        {
            "content": "Heart breaking and heart warming",
            "review_date": "2011-08-19",
            "source": "rt"
        },
        {
            "content": "In America!\nMovies like In America, are treasure to be entertained with at least in these days. Moving and gripping plot of the film keeps the joy, cheers, and agony in ups and downs. It purely portrays the struggling man in America, who wants the betterment for his family. Djimoun Hounsou's performance is electrifying, and rejoicing to watch, he deserved Oscar-nomination.",
            "review_date": "2011-08-18",
            "source": "rt"
        },
        {
            "content": "This was a great movie of hope and love. I enjoyed this one. It touched me. At first I thought it was going to be lame, but it was actually good. I'd give it two thumbs up.",
            "review_date": "2011-08-12",
            "source": "rt"
        },
        {
            "content": "It's a great and emotional film. I'm glad I chose to see it now instead of when it first came out, because I wouldn't of liked or understood it then.",
            "review_date": "2011-08-08",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies of all times. Filmed waaaay b4 it's time. The issues of race, sexuality, family, poverty and immigration are still relevant today. I would argue that only a true old school New Yorker could really appreciate certain aspects of the movie (like the bath tub in the livingroom) but this is just another reason that makes me love this film even more. The little girls performance is astounding!",
            "review_date": "2011-08-08",
            "source": "rt"
        },
        {
            "content": "Charming, funny, engaging, life affirming film filled with hope and a mysteriously ethereal feel. Left me emotionally satisfied if a little soggy round the eyes :) A wonderful film.",
            "review_date": "2011-07-22",
            "source": "rt"
        },
        {
            "content": "Awesome and also lacking in some areas",
            "review_date": "2011-07-16",
            "source": "rt"
        },
        {
            "content": "Difficult.  But rather brilliant.",
            "review_date": "2011-07-02",
            "source": "rt"
        },
        {
            "content": "I find myself loving anything that has to do with Ireland. My favorite performance in the whole film is Djimon Hounsou as Matteo, the guy is truly a magnificent actor, and is seemingly one of the most fascinating people in the business. The kid actors in the film also really shine, Paddy Considine and Samantha Morton might have been the weakest components. I really did not like all of it, but some of it was great.",
            "review_date": "2011-06-20",
            "source": "rt"
        },
        {
            "content": "A moving, touching piece. Although \"In America\" seems to struggle to find what its' story is in the very beginning, it recovers nicely and ends strong.",
            "review_date": "2011-06-11",
            "source": "rt"
        },
        {
            "content": "very good movie watched it several times and i still get emotional watching this family struggle through hard times and loosing a child",
            "review_date": "2011-06-10",
            "source": "rt"
        },
        {
            "content": "Ho pianto a dirotto nel vedere questo film, magari anche a causa di eventi tristii accaduti in quel periodo intorno a me. Ma credo che qualche merito possa essere assegnato anche alla regia semplice e alla recitazione che ricrea il clima familiare, nella gioia e purtroppo in modo estremamente reale anche nel dramma.",
            "review_date": "2011-06-09",
            "source": "rt"
        },
        {
            "content": "Possibly not as convincing as the general consensus would have us believe. Despite the 'semi-autobiographical' tag and the collaboration of Jim Sheridan's daughters on the script, this was a wee bit soapy. It's another exploration of family dynamics, this time it's the effect / affect of the death of a child / sibling. Touching, but I felt almost as unmoved as  Paddy Considine - Johnny - a father anaesthetised by the tragedy.",
            "review_date": "2011-06-04",
            "source": "rt"
        },
        {
            "content": "a great movie about an irish family trying to make ends meet in america",
            "review_date": "2011-06-01",
            "source": "rt"
        },
        {
            "content": "Cerita : 5/10  \nAkting : 6/10\nEnding : 6/10\nKepuasan : 6/10\n\nCeritanya standar, agak lambat, lumayanlah. Cerita perjuangan hidup memang tidak pernah ada habisnya dan akan selalu dibuat. Emma Bolger berakting dengan natural sekali (atau memang ia berperan seperti dirinya sendiri?)",
            "review_date": "2011-05-28",
            "source": "rt"
        },
        {
            "content": "Jim Sheridan is an absolute prince at directing little kids.  When it comes to adults, though, he falls a little short. What the heck, Djimon Hounsou?",
            "review_date": "2011-05-01",
            "source": "rt"
        },
        {
            "content": "I already suspect I'm gonna be saying this a lot for Jim Sheridan movies, but this gets by almost exclusively on its acting. A lot of the unsubtle writing, including stereotypes, clichés, and sentimentality, is smoothed over by the lovely performances, especially the Bolger sisters, who are literally perfect. I feel a little guilty about giving it such a high rating when it has so many problems (there's even an Uncle Tom played shockingly straight) but those little girls were just too adorable for me to resist.",
            "review_date": "2011-04-23",
            "source": "rt"
        },
        {
            "content": "Great Movie.   Didn't realize it was so old (2003)",
            "review_date": "2011-04-22",
            "source": "rt"
        },
        {
            "content": "What a beautiful movie, full of humanity, warmth, humor, grief, hope, and love.",
            "review_date": "2011-04-17",
            "source": "rt"
        },
        {
            "content": "An emotionally engaging film, both happy and sad. Recommended by a friend and I recommend it to others.",
            "review_date": "2011-04-12",
            "source": "rt"
        },
        {
            "content": "Jim Sheridan brings to life this tale of an Irish families move to New York to find the \"American Dream.\" We soon learn that there has been a tragedy befall this sweet family and their son Jack is no longer with them. Johnny, the father is an aspiring actor who hops around from audition to audition trying to score a part. Sarah the mom (played wonderfully by Samantha Morton) takes a job in a nearby ice cream shop. Their two daughters bring joy and hope to the family. On Halloween they confront the loud, angry artist Mateo (an even better performance from Hounsou). He is soon changed and becomes a part of the family. The film is mystical while still being firmly trenched in reality. You fall in love with the family and feel their pain as they struggle to make a life. Sheridan pulls a new trick out of his hat and creates amazing music montages to rival Scoresese or Tarantino. He masterfully makes minutia in monumental film making as my heart was beating into my throat during the carnival scene, begging for Johnny to make the shot. \"In America\" is human, funny, honest and magic with the innocence of a child.",
            "review_date": "2011-03-19",
            "source": "rt"
        },
        {
            "content": "The always worthwhile Samantha Morton delivers another flawless performance in 'In America,' a touching film I will remember forever.",
            "review_date": "2011-03-18",
            "source": "rt"
        },
        {
            "content": "One of my favorite movies. Love keep this dented family together. The two daugthers (sisters even irl) are just amazingly brilliant. A true movie gem.",
            "review_date": "2011-03-17",
            "source": "rt"
        },
        {
            "content": "An inspirational and moving drama that shapes your mind and makes you think about the true value of life in itself.\r\n\r\nOne of the best films I have ever seen",
            "review_date": "2011-03-13",
            "source": "rt"
        },
        {
            "content": "Very well done movie of a family trying to build a new life in New York City.",
            "review_date": "2011-03-12",
            "source": "rt"
        },
        {
            "content": "This is one cute movie.  Everyone did a great job with this movie.  Its also powerful because it proves that anyone can accomplish anything.  Djmon Hounsou is the moan star in this as he is the only one who treats this Irish couple with respect.",
            "review_date": "2011-03-10",
            "source": "rt"
        },
        {
            "content": "An Irish family of four leave the homeland for Manhattan to heal wounds and live the American dream. Sounds terrible? Well, it's not. Instead, what In America is funny, engaging and impassioned, thanks largely to writer-director Jim Sheridan (My Left Foot, In The Name of The Father), whose own life experiences the film is based on. Sheridan even co-wrote the script with his two daughters, Naomi and Kirsten.\n\nPaddy Considine is patriarch Johnny, a struggling actor hitting up one audition after another. Wife Sarah (Samantha Morton, a superb force of nature) cares for their two girls, Christy and Ariel, played by actual sisters Sarah Bolger and Emma Bolger, who steal the movie. The two befriend a troubled artist (Djimon Hounsou, excellent) and help their parents' cope with poverty, their father's gambling addiction and the death of the couple's infant son. Sure, there's some contrivance, but In America has genuine heart and soul and it gets to you. It's an emotional tour de force.",
            "review_date": "2011-03-10",
            "source": "rt"
        },
        {
            "content": "This movie is magical. It walks a fine line between whimsy and seriousness. Think 'Amelie', only grittier and set in Manhattan--but still infused with a sense of magic and wonder. \n\nIn America is about an Irish family that moves to New York in the early 80's to start a new life. They find that it is not so easy. They find an apartment in a neighborhood known for junkies. Johnny, the dad, is an out of work actor who, since the death of his young son, is unable to feel anything. At one point he says \"I asked God to take me instead of him. He took us both...now I'm a ghost.\" \n\nSarah, the mom, works in an ice cream parlor and finds herself pregnant again--a dangerous pregnancy where either she or the baby could die.\n\nBut the movie centers around Ariel and Christie--the two young daughters--who are young enough to be curious about everything and afraid of nothing. During Halloween, the girls are allowed to trick-or-treat in their own apartment building. Afraid several unsuccessful attempts, a mysterious and possibly crazy man, Mateo, opens his door and lets the girls in. He gives them a jar of pennies for their trouble, and quickly becomes part of their family. We realize very quickly that this man is dying of AIDS and the reason he acts so crazy is because he is \"in love with anything living\".\n\n10 year old Christie narrates the film in a lilting Irish accent that contributes enormously to In America's appeal. It makes the immigration story feel timeless. You could close your eyes and imagine it's a story about an Irish family immigrating to America in the 1880's, rather than the 1980's. The girl's voice tells the story of America itself (and New York City in particular): a place people escape to rather than escape from. A place of teaming diversity. A place where everything is possible and the options are limitless. \n\nThis is the way I want to see America. You have to choose to see it this way--not a place of oppression and partisanship, but a place as magical and wondrous as we were taught to believe as children. In America manages to convey this feeling without descending into hokey propaganda. At least that's how I saw it. It made me believe.",
            "review_date": "2011-03-04",
            "source": "rt"
        },
        {
            "content": "Really beautiful movie, great acting and performances. And the story is simple and well told",
            "review_date": "2011-03-01",
            "source": "rt"
        },
        {
            "content": "A moving account of an immigrant experience with a peek into life, death, feelings and destiny.",
            "review_date": "2011-02-20",
            "source": "rt"
        },
        {
            "content": "Really really good movie...I recommend it. It seems like a soap opera at first with not much direction, but later really comes together.",
            "review_date": "2011-01-29",
            "source": "rt"
        },
        {
            "content": "Excellent - emotional - personal. Loved it.",
            "review_date": "2011-01-23",
            "source": "rt"
        },
        {
            "content": "I am really inspired by well-crafted stories that capture a sense of innocence and childhood. It's been a while since a story has emotionally grabbed me-and gripped me-as much as this film has. The inclusion of a camcorder adds to the child's point of view as well as a real authenticity. Director Jim Sheridan (who co-wrote the film with daughters Naomi and Kirsten) based this story - an Irish family who moves to New York in AMerica after their young son's tragic death - on his own experience as an Irish immigrant. The climax is the kind that puts you on pins and needles; more powerful an experience than I was expecting. Nice performances from Samantha Morton, Djimon Hounsou, and young Sarah and Emma Bolger, and great soundtrack as well. Despite one steamy scene to be weary of, this is a very poignant slice of innocence and life, as well as its joys, pains, and perseverance (with a nice incorporation from E.T.).",
            "review_date": "2011-01-08",
            "source": "rt"
        },
        {
            "content": "One of the most underrated movies I've ever seen !\r\nI've watched it for the first time by chance and liked it so much. It's simply about people you mostly see, but you choose to ignore them, even they are much like you, fight to survive and live a decent life..\r\nAbout the magic of love and what it really can do..",
            "review_date": "2011-01-02",
            "source": "rt"
        },
        {
            "content": "Despite the director's best attempt to make this movie heartwrenching, I just found it boring.",
            "review_date": "2010-12-28",
            "source": "rt"
        },
        {
            "content": "I really love this film.",
            "review_date": "2010-12-16",
            "source": "rt"
        },
        {
            "content": "I find myself loving anything that has to do with Ireland. My favorite performance in the whole film is Djimon Hounsou as Matteo, the guy is truly a magnificent actor, and is seemingly one of the most fascinating people in the business. The kid actors in the film also really shine, Paddy Considine and Samantha Morton might have been the weakest components. I really did not like all of it, but some of it was great.",
            "review_date": "2010-12-09",
            "source": "rt"
        },
        {
            "content": "Very solid, clearly heartfelt work from Jim Sheridan. I haven't seen either of his two films since this, but I'm going to assume that they're not much chop based on what I've heard (and who's in them.) Although I was worried that the story would steer itself into purely trite cliches time and time again, Sheridan manages to dodge most of those pitfalls. It's a delightful and emotional experience, no doubt.",
            "review_date": "2010-12-06",
            "source": "rt"
        },
        {
            "content": "one of the most well-made, and poignant films of the 2000's that not enough ppl saw",
            "review_date": "2010-11-29",
            "source": "rt"
        },
        {
            "content": "really heartfelt & moving family drama.",
            "review_date": "2010-11-29",
            "source": "rt"
        },
        {
            "content": "A wonderful film. Yes, it's melodramatic, and yes, some of the dialogue is a bit too pat. But the other elements just outweigh all that for me, beginning with the eyes and liveliness of those two beautiful children. Hounsou brings a much needed center of gravity to the film, and the story works as an emotionally-centered, \"Leave your baggage behind and come to America, the land of opportunity\" kind of story. But really, those two kids simply make the movie.",
            "review_date": "2010-11-28",
            "source": "rt"
        },
        {
            "content": "An indie family oriented movie about an irish family that moves to New York.  \"Heartwarming\"",
            "review_date": "2010-11-21",
            "source": "rt"
        },
        {
            "content": "It's always a pleasure to see inspiring and touching films like this one. I agree that acting and directing are excellent, I really enjoyed watching the girls... both deserved Oscar nods. In America is one more independent film that surpasses the story quality of brainless blockbusters.",
            "review_date": "2010-11-13",
            "source": "rt"
        },
        {
            "content": "Lost gem. Paddy Considine and Samantha Morton show their talent in this very moving story.",
            "review_date": "2010-10-07",
            "source": "rt"
        },
        {
            "content": "Not really my type of film, but I cannot deny all the great stuff that is going on here.  It's a slow moving family drama about a poor Irish immigrant family moving to Manhattan, as based on the real life story of the director.  If there is one thing to be said about this movie, it is the great acting.  It all feels real and authentic; Djimon Hounsou (you may not recognize the name but you'll probably recognize the face) is great and deserves the best supporting actor nomination that he got, and Paddy Considine is one of my favorite working actors that I am always happy to see on the cast list.  There's really nothing about it that I don't like, it is just not the type of movie that I enjoy watching; it's a bit slow and all the drama is family oriented.  Still, it's fantastically acted and if feels like you are getting a glimpse into somebody's real life.",
            "review_date": "2010-10-06",
            "source": "rt"
        },
        {
            "content": "A movie that is supposed to be touching, but it certainly didn`t touch me.",
            "review_date": "2010-10-04",
            "source": "rt"
        },
        {
            "content": "Yawn. Visually, storywise, and all other ways, this is a \"sleeper\" and I mean as in naptime.",
            "review_date": "2010-09-21",
            "source": "rt"
        },
        {
            "content": "I've seen some child actors in different kind of storytellings, thus different kind of genres. Lina Leandersson (Let the Right One In), Nadine Nortier (Mouchette), Kodi Smit-McPhee (The Road), Christian Bale (Empire of the Sun), Harvey Stephens (The Omen), Enzo Staiola (Bicycle Thieves) the whole child actor line-up in The White Ribbon, The Bolger Sisters have a place in this row.",
            "review_date": "2010-09-19",
            "source": "rt"
        },
        {
            "content": "Incredible film about immigrants and really emotional...",
            "review_date": "2010-08-18",
            "source": "rt"
        },
        {
            "content": "I thought this was a good one, recorded it on IFC and I am definately keeping it. It is very sad at times, and cute at times, sometimes a little predictable, but I liked it. Paddy considine and Djimon Hounsou are largely overlooked actors",
            "review_date": "2010-07-26",
            "source": "rt"
        },
        {
            "content": "Quando preparado com tino e bom-senso, evitando-se o ensimesmamento autobiográfico, o acerto de contas do autor com o passado potencializa a milagorsa capacidade da arte cinematográfica de conectar pessoas distantes, por meio da identificação com situações universais. Sheridan furta-se a repetir a impetuosidade dramática imprimida à sua maior realização - Em Nome do Pai -, mesclando tópicos variados (dinâmica familiar, perdas, amadurecimento, adaptação, imigração) sem prescindir de leveza, espirituosidade e um lastro de sinceridade emocional que complementam as pinceladas fabulares sugeridas pelo roteiro escrito a seis mãos por pai e filhas, que concorreu ao Oscar.",
            "review_date": "2010-07-20",
            "source": "rt"
        },
        {
            "content": "First attempt to see this film, some time ago... we drop it at one foolish scene. This time we tried harder and after that, enjoyed a very very good film.",
            "review_date": "2010-07-20",
            "source": "rt"
        },
        {
            "content": "How had I not seen this earlier?  Simply put, a truly beautiful film.",
            "review_date": "2010-07-14",
            "source": "rt"
        },
        {
            "content": "A huge snoozefest fronting like it is some immigration breakthrough on how to live in America if you're from another country. Knock knock..It's the neighbor with AIDS who has a life lesson I think you should learn something from him.",
            "review_date": "2010-07-13",
            "source": "rt"
        },
        {
            "content": "heartwarming, sad, charming & moving.",
            "review_date": "2010-07-04",
            "source": "rt"
        },
        {
            "content": "I pulled this movie out to watch again from my collection since it's as good a fourth of July movie as any else.  This movie is simply amazing.  Watching it again I really appreciate the great writing and acting.  The themes about death, life, healing, letting go, faith, heaven, God and trying to make a new life resonate with me at this point in my life.  The dang movie even made me cry.  I highly recommend this film.  It's a hidden gem to many.",
            "review_date": "2010-07-03",
            "source": "rt"
        },
        {
            "content": "One of the most amazing movies I have ever seen.",
            "review_date": "2010-07-03",
            "source": "rt"
        },
        {
            "content": "A touching tale of an Irish family going through all sort of shit....",
            "review_date": "2010-06-30",
            "source": "rt"
        },
        {
            "content": "A very touching film, full of life. Made me realize that when you have nothing you always have some kind of hope to hang on to.",
            "review_date": "2010-06-25",
            "source": "rt"
        },
        {
            "content": "In America was a wonderful movie with a touching story and outstanding acting performances. Paddy Considine was great, Samantha Morton was excellent and very believable as a strong Irish mother. Djimon Hounsou was truly amazing in his role as Mateo, although his role wasn't that big, he has made quite an impression in the movie.  Very moving, if sometimes a bit too sentimental. Even the little ladies put in magnificent performances. A film with real heart and might make you cry like a girl.",
            "review_date": "2010-06-19",
            "source": "rt"
        },
        {
            "content": "\"You have to say goodbye to Frankie Dad.\" My heart just breaks during this scene...this film has a lot of heart to it.  It's about a Irish family moving to America after the death of their young son, and how they adjust to a new place and cope with such an incredible tragedy. They move into a run down apartment building in Manhatton, and they befriend this man in the apartment below them...It's just an incredible story, very well directed/acted, some incredble moments that will touch your heart, as well as some humorous moments sprinkled in. The 2 little girls are what make the film! It's a movie you walk away from with a good feeling inside...I highly recommed this drama...I've seen it 3 times already!",
            "review_date": "2010-06-12",
            "source": "rt"
        },
        {
            "content": "finally! watched this last night and it really touched me.  Overall, this movie is as fun as you allow it to be. If you don't just accept the reality of the movie, you will be a cynic throughout. family, problems, struggle in their new environment ( in America) and kids thoughts of happiness.\r\n\r\n\"Why bring a kid into the world just to make him suffer.\"",
            "review_date": "2010-06-02",
            "source": "rt"
        },
        {
            "content": "pithy review: will make you appreciate life. \r\ndate viewed: may 22, 2010 \r\nhighlight(s): well developed interesting characters. strong overall cast, especially sarah bolger's performance as christy. ET game of chance scene. trick or treat scene in the apt. building. \r\nlowlight(s): nothing offhand. \r\nfavorite line: ....i love anything alive. \r\nverdict: recommended.",
            "review_date": "2010-05-24",
            "source": "rt"
        },
        {
            "content": "I waited seven years to see this film, and I am glad I got to see it in this day and age. Everything about this film is beautiful; it reminds the viewer about the preciousness of life, the obstacles that must be skipped and that life is filled with hope. I'd love to see more films like \"In America.\"",
            "review_date": "2010-05-09",
            "source": "rt"
        },
        {
            "content": "This movie is amazing!",
            "review_date": "2010-04-24",
            "source": "rt"
        },
        {
            "content": "so moving... briliant for sheridan",
            "review_date": "2010-04-10",
            "source": "rt"
        },
        {
            "content": "touching...even though the second half is a little bit goes too sentimental. but still, touching...and Emma Bolger is sooo cute !",
            "review_date": "2010-04-10",
            "source": "rt"
        },
        {
            "content": "My father brought me this for my 16th birthday and have loved it ever since. It's amazing movie: how a young Irish family cope with the grief of losing a young toddler and go off to America to start again after his passing.",
            "review_date": "2010-03-23",
            "source": "rt"
        },
        {
            "content": "A beautiful picture.",
            "review_date": "2010-03-22",
            "source": "rt"
        },
        {
            "content": "Such a touching movie!!",
            "review_date": "2010-03-13",
            "source": "rt"
        },
        {
            "content": "Ariel is a tite little kid.",
            "review_date": "2010-03-06",
            "source": "rt"
        },
        {
            "content": "Interesting story on perseverance, trust & hope. Didn't grab my attention at first, but I found myself wanting to see how it would end. Good film.",
            "review_date": "2010-03-06",
            "source": "rt"
        },
        {
            "content": "A family movie, not giving out sanctimonious moral lessons, but sharing a simple message of solidarity and redemption....",
            "review_date": "2010-03-02",
            "source": "rt"
        },
        {
            "content": "What a perfect title for this film. Jim Sheridan does a great job of showing what happens in America. The amazing skyscrapers and bright lights, the scary junkies and run down buildings, the odd holiday rituals and of course the chance that you just might make it. Superb acting by all in this film with possibly the best child actors I've seen in a long time.",
            "review_date": "2010-02-26",
            "source": "rt"
        },
        {
            "content": "The movie is very simple except the unimaginable ending. I suppose American immigrants may like this film, because the life of the family is more understandable to them.",
            "review_date": "2010-02-17",
            "source": "rt"
        },
        {
            "content": "This movie was incredible. The acting was flawless, the script was beautiful. What more could I want from a film?",
            "review_date": "2010-02-10",
            "source": "rt"
        },
        {
            "content": "Pieni tuntematon helmi :)!",
            "review_date": "2010-02-09",
            "source": "rt"
        },
        {
            "content": "An Irish guy with dreams of making it big on Broadway moves with his family into a very seedy building in NYC -- as narrated by his daughter carrying around a camcorder.  At one point or another, almost everyone in the movie goes stark raving nuts, and most of those episodes make no sense at all.  But the movie works.  Bring a hankie.",
            "review_date": "2010-02-02",
            "source": "rt"
        },
        {
            "content": "Wait... are those tears in my eyes? No, it's just dusty in here. I promise.",
            "review_date": "2010-01-27",
            "source": "rt"
        },
        {
            "content": "Irish writer-director Jim Sheridan's semi-autobiographical drama of an Irish immigrant family's new life in 1980s New York is a bittersweet fable. It follows the struggles of Johnny (Paddy Considine - standing in for Sheridan) and his wife Sarah (Samantha Morton) with their two daughters, Christy and Ariel (Sarah and Emma Bolger), living in a Hell's kitchen tenement full of drug addicts and transvestites. Johnny is pursuing an acting career and the family has little money. One of the neighbors is a reclusive Nigerian artist (Djimon Hounsou) who has a secret but forms a bond with the girls. The scenes with Hounsou threaten to bog down in hokey mysticism but Sheridan has created a feeling of magic realism that is poignant and there is a lot of humor too. We discover that the family lost a son to a tragic accident and Johnny's inability to remove himself from feelings of guilt causes pain for the whole family. Some lyrical passages: the feelings of relief from humidity for the family with the purchase of an air conditioner; Ariel expressing regret stating simply: \"I miss things;\" Christy confronting Johnny for not being emotionally present for the family; Johnny's attempt to win an E.T. doll for Ariel at a carnival which is simultaneously painful and joyful. This is a highly personal movie that Sheridan has co-written with his real life daughters, Naomi and Kirsten. All of the actors are first-rate. Real-life sisters Sarah and Emma Bolger give remarkable performances. Nothing they do is affected. Their scenes together play out so naturally its touching. We see events through their eyes so we feel protective of them. Altogether this is a lovely movie.",
            "review_date": "2010-01-24",
            "source": "rt"
        },
        {
            "content": "I saw this movie in our local cinemateque.  It was preceded by a talk, which focused on an unrelated topic, in my opinion, the Wisconsin Plan (from welfare to employment) which is partly implemented in Israel.\nThe speaker said that the movie is depressing and she was right.  There is a lot of death that is present in this film.  No, the number of deaths is small, and all of natural causes.  Yet, it brings the feeling of sadness.\n\nI failed to understand the logic in the actions of this family.  Coming to the USA from Ireland to stay there illegally, and live in a dumpster.  Perhaps it was due to the tragedy they went through.  Nonetheless, it makes you wonder.\n\nNonetheless, the family struggles. Their struggle needs to be acknowledged and respected.\n\nThe performance is good.  I especially liked the two adorable children.\nI would have given it a higher rating had it not been depressing.",
            "review_date": "2010-01-20",
            "source": "rt"
        },
        {
            "content": "Sheridan seems inspired by Spielberg here, including footage from \"E.T.\"  How much of the script is from the director's own life is hard to know, but ultimately sentimentality - both visual and thematic - eat away at things just a little too much.",
            "review_date": "2010-01-18",
            "source": "rt"
        },
        {
            "content": "why would they move from Canada?",
            "review_date": "2010-01-17",
            "source": "rt"
        },
        {
            "content": "Jim Sheridan is a master....this is one of those hidden jems.....a real pleasant surprise Emma Bolger and Djimon Hounsou are defs the standouts!!! They r such a ray of light in a dark wrld!!! it shows the power of good writing this film was so well written!!! A directed perfectly!!! a good solid drama!!!",
            "review_date": "2010-01-13",
            "source": "rt"
        },
        {
            "content": "The American dream for Irish emmigrants isn't cracked up to what it ought to be.",
            "review_date": "2010-01-02",
            "source": "rt"
        },
        {
            "content": "if you don't like this movie, you don't have a soul.",
            "review_date": "2009-12-31",
            "source": "rt"
        },
        {
            "content": "The characters in this movie are so perfectly human, so lovable, so compelling that you might watch over a few times just to get to spend time with them some more.  As they struggle each day to survive and make friends, they make themselves vulnerable and fragile, and you can't help but root for them and want to take them into your home and give them a break.  It's a quiet film, not much action and no special effects, just good, decent people struggling.  I would recommend this if you like The Station Agent, The Visitor, and Angela's Ashes.",
            "review_date": "2009-12-27",
            "source": "rt"
        },
        {
            "content": "watched this in class.\n\nliked a few scenes in the movie, but that's really it.",
            "review_date": "2009-12-21",
            "source": "rt"
        },
        {
            "content": "Vi esta pelicula cuando ya tenia un buen par de minutos de haber empezado, sin saber como se llamaba ni de que trataba. La vi por cable y la vi con la intencion de quedarme dormido (no podia dormir por mi cuenta). La pelicula trata de una familia irlandesa que viaja a EU en busca de oportunidades. Nada nuevo. Usualmente trato de mantenerme alejado de este tipo de peliculas, pero esta tiene algo especial. Excelentes actuaciones, especialmente de las niÃ±as. Admito que la escena final, \"say goodbye to Frankie\", me dejo con lagrimas en los ojos. He llorado en un par de peliculas pero nada parecido a esta. Nudo en la garganta y todo, al punto de que tuve que respirar hondo porque sino me ahogaba. 5 am, yo llorando como pleaito (por no decir mujer :p) y preguntandome \"que diablos te pasa!?\" Y todavia no me explico porque esa escena tuvo ese efecto en mi. Pero muy buena pelicula. Despues de verla entrÃ© a imdb y supe al fin como se llamaba la pelicula, que era del 2003 y tenia su par de nominaciones al Oscar. Y yo que la vi con la intencion de quedarme dormido.",
            "review_date": "2009-12-14",
            "source": "rt"
        },
        {
            "content": "Solid movie. Simple and moving. Some of the best child acting on film. \n\nWatch if you wish.",
            "review_date": "2009-12-08",
            "source": "rt"
        },
        {
            "content": "Add a review (optional)..tragis sekali",
            "review_date": "2009-11-29",
            "source": "rt"
        },
        {
            "content": "wow. the  two most beautiful young girls in cinema history. and really touching story. plus: everyone is irish. great movie.",
            "review_date": "2009-11-26",
            "source": "rt"
        },
        {
            "content": "Cheesy/melodramatic but not bad.",
            "review_date": "2009-11-25",
            "source": "rt"
        },
        {
            "content": "great movie - poignant, funny, worth remembering and seeing again.",
            "review_date": "2009-11-21",
            "source": "rt"
        },
        {
            "content": "The Bolger sister are awesome ... \nA heartwarming story about moving on with one's life after a close one's death...",
            "review_date": "2009-11-13",
            "source": "rt"
        }
    ]
}