{
    "rating": 9.3,
    "release_date": "2003-05-02",
    "num_reviews": 290,
    "genres": [
        "Korean"
    ],
    "summary": "In 1986, Park (Song Kang-ho) and Cho (Kim Roi-ha) are two simple-minded detectives assigned to a double murder investigation in a South Korean province. But when the murderer strikes several more times with the same pattern, the detectives realize that they are chasing the country's first documented serial killer. Relying on only their basic skills and tools, Park and Jo attempt to piece together the clues and solve the case in this thriller based on true events.",
    "reviews": [
        {
            "content": "Heart wrenching, on the the edge yet relaxed with great direction and screenplay accompanied with top notch acting of the leads. One will be immersed in the experience and is a must watch.",
            "review_date": "2023-04-26",
            "source": "rt"
        },
        {
            "content": "Memories of Murder is gripping and tense, while also unexpectedly hilarious. I enjoyed watching it throughout, but the ending left me frustrated. To be fair, it is based upon real-life events so not too much can be done to fix that.",
            "review_date": "2023-04-06",
            "source": "rt"
        },
        {
            "content": "Tense and droll at the same time, with some dark outright humor popping up unexpectedly at times. Don't expect any kind of regular whodunit, the cops here are barely able to understand their jobs.",
            "review_date": "2023-03-12",
            "source": "rt"
        },
        {
            "content": "A thrilling mystery story that leaves you guessing just as much as the detectives are. Memories of Murder is often unpredictable, following the chase and lead of three very distinct detective personalities while including the not often scene slapstick and satire. The multiple leads combined with the swift shift from funny to sobering is like a rollercoaster. Bong delivers a captivating and suspenseful chase, while keeping the pathos real. The ending is also absolutely haunting and makes the film timeless and complete - but is it?",
            "review_date": "2023-03-03",
            "source": "rt"
        },
        {
            "content": "A thrilling mystery story that leaves you guessing just as much as the detectives are. Memories of Murder is often unpredictable, following the chase and lead of three very distinct detective personalities while including the not often scene slapstick and satire. The multiple leads combined with the swift shift from funny to sobering is like a rollercoaster. Bong delivers a captivating and suspenseful chase, while keeping the pathos real. The ending is also absolutely haunting and makes the film timeless and complete - but is it?",
            "review_date": "2023-02-07",
            "source": "rt"
        },
        {
            "content": "Skillfully blending multiple genres, this is a typically engaging and hard-to-forget film from Bong Joon Ho. As much about the fissures in society as it is about crime, not to mention the perceptions we have of ourselves and each other, the depiction of a chaotic and desperate hunt for a serial killer is gripping, laced with comedy and deeply insightful. The artfulness of the film is subtle and almost hypnotic; the brilliant score works with the saturated colour of the bulk of the film to create a strange, unsettling and beautiful effect. Undoubtedly up there with the director's best work, this will worm under your skin and nag at your consciousness long after watching.",
            "review_date": "2023-01-22",
            "source": "rt"
        },
        {
            "content": "Annoying characters, and despite being based on truth goes absolutely nowhere",
            "review_date": "2023-01-20",
            "source": "rt"
        },
        {
            "content": "Memories of Murder is a fantastic detective movie, made by Bong Joon Ho and his team. The movie follows a series of murders, which all look like the action of one man, however it is not a 100% clear who did it and why he did it. The movie has some gorgeous cinematography, that reminded me a lot of David Fincher his work, especially Zodiac of course.  While I like a movie as Zodiac a bit more then Memories of Murder, there is no doubting that this movie is fantastic. The performances of everybody are really great, however the atmosphere of the film, is what worked the best for me personally. The movie starts a bit slow for me personally, but when you get in the 2nd and especially 3rd act, the movie shines. The ending of Memories of Murder was fantasticly done, which as well reminded me a lot of Fincher his work, with this case being Se7en. Overall a movie really worth your time, especially if you are a fan of the detective genre!",
            "review_date": "2023-01-14",
            "source": "rt"
        },
        {
            "content": "it's just a rollercoaster of emotions it's crazy how good this movie is.",
            "review_date": "2022-12-17",
            "source": "rt"
        },
        {
            "content": "it's bong joon-ho, ofc its a must see",
            "review_date": "2022-11-12",
            "source": "rt"
        },
        {
            "content": "A truly great movie, look at guillaremo del Toros review... it can hardly be said any better. A little knowledge of korean history will help, the movie is set in the time of the faschist dictatorship und er US control...",
            "review_date": "2022-10-11",
            "source": "rt"
        },
        {
            "content": "This moody, stylish, and inconclusive serial killer investigation film traces the investigation into a series of ongoing and gruesome murders. At times the investigation is played for laughs, and the torturous tactics of the detectives are almost as scary as the killings. The detectives are changed by their job, one seemingly driven crazy by it, going from a belief in evidence and reports over hunches and theories to the exact opposite - dismissing DNA evidence in favour of a gut feeling. By focusing on the investigators to the exclusion of the killer, this presents a new twist on the genre.",
            "review_date": "2022-09-10",
            "source": "rt"
        },
        {
            "content": "This movie has a kind of overcast and pressing tone which fits very well. The characters we follow are quite unorthodox when it comes to this type of detective story, and it adds a layer of uniqueness as well as uncertainty. The movie is well directed, and some scenes are very successfully creepy and ominous. It also has an interesting conclusion that leaves a lot up to interpretation. While I usually don't like when movies are too vague, the questions the movie poses were framed in an interesting way here that made up for it.",
            "review_date": "2022-09-06",
            "source": "rt"
        },
        {
            "content": "Whatever the fact may be about those people on which the story is based, the characters here are so unbearably moronic that there's hardly room for anything else to cause the drama. They act plain stupid, consistently, there's close to nothing to be learned about the murderers psychology simply because the detectives are caught up in their slapstick stupidity. A little less effort to make them look silly would have helped the topics complexity quite a lot, but the exact amount here I guess is what Bongs trademark is, and it takes away from everything. Overrated. Cinematic garbage with very little substance but a whole lot of potential to be annoying. If people were that stupid, well that actually could make a murderer—and that would be the answer to Park Doo-man's question to the suspect in the end: how he can live like that...",
            "review_date": "2022-09-06",
            "source": "rt"
        },
        {
            "content": "A brilliantly directed, slow paced investigation piece that is frequently funny and quietly haunting.",
            "review_date": "2022-08-27",
            "source": "rt"
        },
        {
            "content": "Wait wait wait, am I the kid who saw the king naked? The movie is a literal disaster in every imaginable way! I don't care who's the director, I don't care about your big philosophical words! I'm telling you the movie is a disaster! \n\n*spoiler alert*\nThe movie is about a serial killer who wasn't caught. That's it! All twists are silly and unbelievable. And the ending, urggg the stupid ending: I read some silly comments about how he looked straight through the camera to your soul,  as if the message is: anyone can be a killer! Dadadadaaaaa! Huh? My personal theory is that the budget has run out in the movie so this director had to rap it up in anyway possible! Please do yourself a favor and don't waste your time",
            "review_date": "2022-08-21",
            "source": "rt"
        },
        {
            "content": "Another Bong Joon-ho banger! Unlike the slick serial killer detective thrillers of the time, this one is grimey, sad, and shows the monotony that goes into investigating such a hard to capture target. It also doesn't shy away from the desperate measures police will go to, to just make pieces fit. It does all this while somehow still managing to be humorous as well.",
            "review_date": "2022-08-14",
            "source": "rt"
        },
        {
            "content": "Set in Korea in 1986, detectives are frantically trying to solve the growing pile of rape/murders perpetrated by seemingly one assailant.  Bong Joon Ho directs this fascinating and sometimes hilarious efforts of the detectives who set their sights on one young man who seems to have knowledge of the murders.  Really well made and riveting crime/mystery.",
            "review_date": "2022-08-10",
            "source": "rt"
        },
        {
            "content": "A brilliantly directed, slow paced investigation piece that is frequently funny and quietly haunting.",
            "review_date": "2022-08-09",
            "source": "rt"
        },
        {
            "content": "\"Paper doesn't lie.\"\n\nA tense and engaging investigational thriller that employs plenty of the film design that Bong Joon-Ho has become renowned for - subtext regarding political and social satire interwoven with creative narratives that have enough strength to stand on their own legs. The plot, ostensibly about coming to understand the psyche of an unprecedented killer, really revolves around two key facets, the changing social landscape of South Korea (particularly the political instability that factors into bureacratic ineptitude embodied by Song Kang-ho's Park Doo-man, and the self-defeating strongman tactics employed by his junior, Cho Yong-koo) and a more universal human frailty. While the former investigators rely on their familiarity with local customs and even traditional superstition where their wits fail them, Kim Sang-kyung's Seo Tae-yoon is the more urban, procedural investigator embodying a new way of thinking. Together there is an overlapping goal (catching the killer), but plenty of friction caused by the disparity in their approaches and a surprising amount of humor in the contrast between them in spite of the seriousness of their roles.\n\nUltimately an exercise showcasing the inability of completely rectifying contrasting lifestyles (Park and Seo gradually form a collaborative effort, but are unsuccesful in catching the killer; a 'coming together to save the day' ending would have seemed cheap), Memories of Murder paints an uncertain portrait for the future of a socially divided South Korea filled with people who are imperfect by nature, but also is one particularly taut crime thriller. There's little in the way of audience omnipotence, except a few scattered moments to keep the tension high. The framing, cinematography, and color design all seem way ahead of their time for 2003; this film could easily be released today. The performances are solid, the direction is taut, and the characters/character development are excellent. And what an ending shot, with Song Kang-ho directing his 'eye contact' method to the audience. \n\nDefinitely an influence on Zodiac, but miles better in my opinion. Where Fincher skews towards the true-to-life elements to give the audience a chill and a sense of mystery, Bong Joon-ho clearly has loftier ambitions. (4.5/5)",
            "review_date": "2022-08-06",
            "source": "rt"
        },
        {
            "content": "Memories of Murder is a top-tier murder mystery thriller. This film has painfully flawed characters (who you're rooting for), depressing subject matter, edge-of-your-seat action, and is beautifully shot. The first interrogation scene grabbed my attention; the \"murder reenactment\" scene made me realize that I was watching something special. The character development of Park (Song Kang-ho) and Seo (Kim Sang-kyung) culminates in a penultimate scene that catches your breath in your throat. We catch a glimpse of the killer — in a blurry, frightening moment — but not enough to identify him. The suspect carousel, the puzzle-piece clues, the fear and distrust fomenting in the provincial town create the tension on which the plot thrives. The story is based on a series of real murders in Korea that have been compared to the \"Zodiac Killer\" in America. In 2003, the murders had not yet been solved, so the ending is powerful and makes sense. However, in only the past few years, that has changed. Memories of Murder is a fantastic movie and has at least three jump-kicks. Hellz yeah.",
            "review_date": "2022-06-22",
            "source": "rt"
        },
        {
            "content": "This is a very good film, one that works on many different levels that can be dissected and analyzed, I wish I was smart enough to see them all. What stood out to me this time was the compositions and beautiful shots, the foggy wheat fields, rain drizzling down muddy streets, lights glowing and bouncing off the wet grass it’s beautifully dark and gritty with an ominous atmosphere. Bong has a lot to say about the very masculine, totalitarian threat looming over us. Democracy isn’t always permanent and a past with this many systemic issues as can be a very real future. I read that he watched Cure repeatedly while writing this and you can see the influence. In that film there’s much more emphasis on the psyche and digging deep into each of our darkest desires, how easily those can be twisted into gruesome acts of violence given a little pressure. In Memories of Murder, there’s a different but similar kind of digging. Less of our darkest, suppressed societal desires but the fact those desires exist and are manifested in a setting where murders like this were never expected to happen. How dismantling and confusing the thought of an evil you never imagined existed affects your mind. How the simplest looking of people can do the most grotesque things. The arrogance that this idea was never considered, or taken seriously and had the impact it did, is, in my opinion, what the film is built on. The police don't expect the killer to be a simple man, yet he is (on the outside), and that’s the scariest thing he could’ve been. One of my all time favorites, thank you Bongster for this banger. Cannot wait for whatever he does next. ",
            "review_date": "2022-05-27",
            "source": "rt"
        },
        {
            "content": "A very interesting case worthy of being told through film, and one told quite well at that. The plot was well planned and impactful, but the amount of beating and idiotic policing did become wearing as time went on. Furthermore, the detective from Seoul wasn't as professional nor as intelligent as I expected, although his actions towards the end made sense and allowed for a brilliant scene. It would have been nice to have more background on him considering there was some backstory to the original investigator and then a slight focus on his pal. Aside from that and the perhaps overly comedic tone in places, it seemed to correspond to the actual events well, and the actor for the perpetrator even looked like the real person, despite the case still being unsolved when the film was made. They nailed the perpetrator's behaviour, the ending was excellent, and it will certainly be a film I remember. The pacing was reasonable besides the dragging police corruption, the acting was solid, plenty happened, the action was a mixture of enjoyable, comedic, and tragic, the cinematography and visual effects held up and made Korea look beautiful despite the events, the production design was believable, and the soundtrack was catchy and emotional.",
            "review_date": "2022-05-25",
            "source": "rt"
        },
        {
            "content": "A brilliantly dark yet hilarious look into the minds of a few blundering Korean detectives going head to head with a more measured logical thinking outside partner. Cinematography is stunning as Bong Joon-ho movies usually are. Song Kang-Ho was tremendous and absolutely hilarious, Kim Sang-Kyung was equally as masterful in his portrayal, as were the remainder of the leading actors and actresses. I absolutely loved this movie, I had high expectations going in but my expectations were surpassed by the hilarity and storytelling that unfolded. 100/100",
            "review_date": "2022-04-14",
            "source": "rt"
        },
        {
            "content": "\"Memories of Murder\" is Bong Joon-Ho's second feature film. He took a while to have the notion of pace, the first act is too long and a little boring, but from the second act onwards, the script starts to show its layers and the development is fantastic. It's more than a movie about a crime, it's a battle of egos inside the police [the veteran local policeman (Detective Park, Song Kang-Ho) versus the young policeman with more knowledge from the big city (Detective Seo, Kim Sang-Kyung)] and how a very difficult case can wear out these guys physically and psychologically (something well-shown by Kim Roi-Ha's character). The suspects are amazing and give material to make the audience think if they're guilty or innocent, especially Park No-Shik (Kwang-Ho) and Park Hae-Il (Hyeon-Gyu). I won't develop anything more because this type of film doesn't allow a deep approach without spoilers.",
            "review_date": "2022-04-01",
            "source": "rt"
        },
        {
            "content": "90/100 -------------",
            "review_date": "2022-02-22",
            "source": "rt"
        },
        {
            "content": "Very interesting and thrilling, with a definite commitment to realism in all aspects that you can definitely appreciate. I have a slight problem with Bon Joon-ho's endings, in that they're all very sad and give the film an overall feeling of pointless. But I thought this particular ending was maybe a little bit clever, knowing the real story.",
            "review_date": "2022-02-18",
            "source": "rt"
        },
        {
            "content": "Korean crime film where girls are being murdered and the investigators are stumped. The character development of the suspects and the investigators is well done...and the realistic (and frustrating) ending is on point.",
            "review_date": "2022-01-30",
            "source": "rt"
        },
        {
            "content": "Well produced but seen it all before. Shades of the zodiac and multiple other detective cases. Fine to watch but fairly forgettable.",
            "review_date": "2021-12-25",
            "source": "rt"
        },
        {
            "content": "A crime mystery film that is totally different from what you'd expect from an American or a European one and that's a good thing.",
            "review_date": "2021-12-12",
            "source": "rt"
        },
        {
            "content": "The best Korean movie.",
            "review_date": "2021-12-02",
            "source": "rt"
        },
        {
            "content": "Bong Joon Ho's sophomore effort, Memories of Murder, is a brooding and haunting film that, despite its slow pace, is mesmerizing from start to finish.  Filmed in muted tones, the movie follows detectives as they investigate a series of murders attributed to a serial killer who, despite a defined modus operandi, manages to elude police.  Even at this early stage in his career, Bong proves himself to be a cinematic master, each shot perfectly framed and blocked.  Despite the oppressive atmosphere throughout, there are flashes of humor as the investigators bumble their way through unmanaged and contaminated crime scenes in their effort to uncover the identity of the killer.  It's a slow burning police procedure and a great primer for the Bong films that followed.",
            "review_date": "2021-10-30",
            "source": "rt"
        },
        {
            "content": "\"Memories of murder\" è un capolavoro assoluto che ha, giustamente, consacrato Bong Joon Ho al grande pubblico.\nGiallo capace di mischiare sapientemente gli aspetti più tecnici legati alle indagini con estratti di vita quotidiana e con una serie di esposizioni sui problemi sociali del territorio coreano, dall'alcolismo all'inadeguatezza delle forze dell'ordine, pone fortemente l'accento sull'incapacità della polizia di fermare un feroce serial killer.\nLe personalità dei personaggi sono spiccate e ad ognuno viene dato ampio spazio; l'ansia e la tensione salgono con l'avvicinarsi della fine delle indagini, culminando una sequenza sotto la pioggia che sprigiona tutto il pathos.\nL'epilogo poi, è una delle scene più potenti mai viste; tutto racchiuso in un semplice dialogo tra un poliziotto ed una bambina; squarcia l'anima con una semplicità che lascia totalmente senza fiato.",
            "review_date": "2021-10-26",
            "source": "rt"
        },
        {
            "content": "Exceptional- this is Bong Joon-Ho's remarkable film about the hunt for a serial killer in 1980's rural South Korea. Read David Ehrlich's wonderfully insightful, perceptive writing on the movie that says far more than I have in me right now. 4 stars",
            "review_date": "2021-09-17",
            "source": "rt"
        },
        {
            "content": "Appropriately watched with the recent release of Parasite (2020) to Blu-ray and DVD, Memories of a Murder is one of Bong Joon-ho's earlier features, but there's no mistaking his handprints all over the story as he tackles class and culture amongst a serial killer thriller. As a big-city cop helps two inept local law enforcement officers to track down the killer, director Bong's magician like approach to interweaving story and political agenda amidst some truly funny sequences makes this a very important stepp",
            "review_date": "2021-08-20",
            "source": "rt"
        },
        {
            "content": "At the end of the film, I was left confused, but that isn't necessarily a bad thing. While I did end up confused, I couldn't help but find myself engaged and entagled in this mysterious series of events. Not once in it's 131 minute runtime did it feel like it was dragging on for the purpose of taking up reel space. Bong Joon-ho managed to extract some of the most genuine acting I've seen to where I wouldn't blame you if you thought this was real. Everyone in the film, despite being just a set of characters, felt like a very real person, and in a sense, they might as well be, as the film was based on a real set of investigations. The scenes of abuse are just as shocking as was necessary, and help to drive home Bong Joon-Ho's point about the Republic of Korea's justice system (at least during 1986-1991). The music really suits each of the scenes well, and I could just go on and on. Ultimately, though, I was blown away by this movie, and I can not help but give it a perfect 5 stars out of 5. Among people who are williing to get over the barrier of foreign language films, this will easily be an instantaneous classic for years to come.",
            "review_date": "2021-08-17",
            "source": "rt"
        },
        {
            "content": "really great, although we dont get all the anwers",
            "review_date": "2021-08-11",
            "source": "rt"
        },
        {
            "content": "Heartfelt, Sad, Gross, Beautiful, Tragic. This movie is a roller coaster. It a dark depressing premise, but with a great cast, fantastic direction it becomes relatable. You are swept up into this story and you are rooting for the good guys to finally get a win.",
            "review_date": "2021-08-10",
            "source": "rt"
        },
        {
            "content": "Bong Joon Ho's best, for sure!",
            "review_date": "2021-07-28",
            "source": "rt"
        },
        {
            "content": "The movie is too long, but I enjoyed it nonetheless.  This is not your usual crime whodunit, there are some very unique aspects to this story and I appreciate originality in a genre that often runs short of new ideas.",
            "review_date": "2021-07-18",
            "source": "rt"
        },
        {
            "content": "In every anime trio there's a serious one with two clowns. Same as this one.\n\nA crime thriller where three desperate detectives investigated a serial crime. The first one-third was, in Bong Joon-Ho style, very funny where Kang-Ho Song's character acted like a clown with silly detective moves and deductions. \n\nAfter that, the movie became serious with characters going downhill and became more desperate for answers. It's not the most mind-blowing story, until the ending. If I was born in South Korea and knew about the case or lived through the period, this movie would have had a much bigger impact on me. Doing some research afterward and I realized how profound and powerful that last shot was.\n\nOverall, another great work from Bong Joon-Ho. 8/10",
            "review_date": "2021-07-06",
            "source": "rt"
        },
        {
            "content": "A classic korean movie directed by Bong Joon-ho, director of the well acclaimed movie 'Parasite'. The movie is set in a small town where two inept detectives try to catch a serial killer.\nThe acting is amazing! Each scene is captivating and intense. You might need to adjust to the subtitles at first but the movie is worth the trouble (you can always pause and read the difficult lines)\nThis movie is good for all those who like korean movies and those who are thinking to start watching to know what all the hype is about 😉",
            "review_date": "2021-07-04",
            "source": "rt"
        },
        {
            "content": "An entertaining and intriguing murder mystery story, combined with Ho's direction, the script he co-wrote with Shim, the performances of the cast, Iwashiro's score, Kim's cinematography, Kim's editing, Ryu's production design, Yang's set decoration, Kim's costume design, action sequences, sound design and production values, Memories Of Murder is a brilliant representation of the deep quality that Asian cinema profoundly possesses!!!",
            "review_date": "2021-07-01",
            "source": "rt"
        },
        {
            "content": "An elegantly directed, well executed, strangely humorous and thought provoking movie which traces the thin line separating the murderer from the murdered.",
            "review_date": "2021-06-14",
            "source": "rt"
        },
        {
            "content": "It's safer to go into a stranger's basement in the Bay Area than to go out on a rainy night in rural Korea.",
            "review_date": "2021-06-13",
            "source": "rt"
        },
        {
            "content": "This was one of the few remaining Bong films I had yet to see and it certainly did not disappoint.\n\nI love his touch and appreciate his use of symbolism which resides in much of his work. This is probably what drives an urge in me to rewatch his films shortly after, knowing that I will gain even more insight as more layers are hopefully penetrated with each watch.\n\nI definitely had goosebumps at a few moments in this film and it never hurts to nail the ending as well.",
            "review_date": "2021-06-11",
            "source": "rt"
        },
        {
            "content": "Memories of Murder is an incredible, masterful cinematic interpretation of a murder mystery that will shake you to your core.",
            "review_date": "2021-06-08",
            "source": "rt"
        },
        {
            "content": "You can really see the influence this must have had on David Finchers Zodiac. The direction, score and cinematography are all sublime. The film took me a while to get into but once it got a hold of me it wouldn't let go. A fantastic early effort from future Parasite director Bong Joon-ho.",
            "review_date": "2021-06-06",
            "source": "rt"
        },
        {
            "content": "\"Memories of Murder\" is a film that had a huge resurgence after 2019's hit, \"Parasite.\" I am a big fan of these sort of these dark crime mysteries and enjoyed this movie. It is more of a slow burn but because it is inspired by a real-life story, it is consistently fascinating. The open-ended nature of the movie is a circumstance of when it was made and it honestly makes the movie chilling by the time it wraps up. I think the most similar Hollywood counterpart to this movie is David Fincher's \"Zodiac\" but I think this movie is more engaging than that one despite similarities. Overall, this is an unsettling and effectively made serial killer story that is worth watching for genre fans.",
            "review_date": "2021-05-10",
            "source": "rt"
        },
        {
            "content": "Beautiful opening and tracking shots at the beginning in the wheat fields. Very interesting mood and tone. The themes are serious but it doesn't seem to take itself too serious, lending itself to a more lighthearted feel. I love how Bong nailed the whole 80's fashion and look throughout the movie. Man, Bong really knows how to setup a beautiful shot. This movie's a dark comedy. \n\nWow, so they're trying to convict an innocent retarded kid as the murderer just so they can say that they solved the case, so they can move on? That's so corrupt and crooked. So funny when they bought the kid NICE sneakers instead of NIKE. Jesus, wtf is going on during that time in 1986? There's like military presence on the streets? Is that why these cops are able to do what they do? Drop kicking suspects and acting ruthlessly reckless. How darkly ironic that the detective that tortures suspects with his military boots, now has to have his right leg amputated. The same one who would cover up his right boot with a sleeve to not leave and scratches when he was curb stomping people on the floor. That's karmic justice right there lol. \n\nI like the detective from Seoul's character. He seems like he's out for justice and wants to see things through the right way. I think it was Park who committed the crimes. He was the only one who retaliated out of all the suspects. I mean he had a gun pointed at his face and he took a rock and slashed the inspector's hand! If that were any other innocent suspect, they would have cowered in fear, plead for their life. And just the way he looked like he enjoyed saying that he did the murders is a telling sign. The document at the end saying that there's no DNA proof that it was Park is just Bong's way of saying how incompetent, unhelpful and unreliable America can be when helping other countries. \n\nBong uses subtlety and creepiness in a very effective way by either blurring something in the background or by building tension. Works as a very offbeat and quirky comedy at times, definitely has its own style going on. I will say Bong Joon-Ho definitely has a great sense of humor. I didn't find the color of the movie that pleasing. It has like a greenish grayish tone that makes everything seem more somber, almost artificial in a way. There's some clever social commentary and satire going on here with military and police power. I feel like I need to rewatch this movie again at some point.",
            "review_date": "2021-04-22",
            "source": "rt"
        },
        {
            "content": "A masterful crime thriller that mix's all the great elements of Silence of the Lambs, with comedy, and social themes. Pure Bong Joon Ho.",
            "review_date": "2021-04-18",
            "source": "rt"
        },
        {
            "content": "Haunting portrayal of the atrocities committed by South Korea's Zodiac Killer.\n\nBong Joon-ho's South Korean crime drama and murder mystery Memories of Murder (2003) is a fascinating, informative, and disturbing depiction of the 1986-1991 serial killings commited in Hwaseong, Gyeonggi Province. It's startling as it documents the intense and insane homicide detective investigation that was undertaken over years to identify Korea's first documented serial killer. You see enough to disturb your mind and infer what has happened. The film leaves you changed with a sense of the apathetic cruelty that humanity is capable of, yet the decency of good people trying to do their jobs balancing out the evil violence.\n\nI should mention that it's a disgusting case, finally concluded all these years later as the real killer finally confessed in 2019, which Bong obviously didn't know about as the film released in 2003, but it adds a layer of satisfaction knowing that he has been caught. I think Memories of Murder is one of the greatest pictures I've ever seen, one of South Korea's best films, and a peerless crime drama. Only The Silence of the Lambs, Se7en, Cure, or Zodiac can truly compare in craftsmanship and chills. Memories of Murder is in a class all its own for its raw realism and sleek direction.\n\nBong Joon-ho's direction is riveting as he details the entire police investigation in shocking true crime with heavy rainfall, long takes, and creepy atmosphere everywhere. Director Bong uses the cover of nightfall, shadows, dark paths, and eerie forestry to unnerve the viewer as the grisly details are unveiled. It's shocking to see any crime of this grotesque and cruel nature, let along hearing someone speak the facts right to you. Bong builds the detective's case with facts, suspects, time, evidence, motive, and connects the dots between the killings so that we can easily draw the same conclusions as Korea's law enforcement at the time.\n\nFurthermore, Bong contributes his own added absurdist sense of humor as there's plenty to laugh at to lighten the mood of this seriously horrifying case. I was surprised at how funny Memories of Murder starts out as these detectives tried anything and everything from torture to shamans to figure out who the killer was, but it evolves into an astonishing display of enthralling deduction and reasoning alongside brutal killings. \n\nSong Kang-ho is hilarious as the immoral and insane cop with a ruthless attitude Detective Park Doo-man. You see the Korean government's brutal and outdated tactics with his character, especially with his countryside cop methods. Song Kang-ho is perfect here as he also displays his dramatic prowess towards the end as he gets more seriously involved in the case. Likewise, Kim Sang-kyung is excellent as Seoul Detective Seo Tae-yoon with his big city methodology and cool seriousness. You understand that Detectives Park and Seo needed to work together with their combined unorthodox and by the book, respectively, techniques. They are incredible leading actors in Memories of Murder, especially once the camera is right up on their eyes.\n\nKim Roe-ha's erratic and violence police officer is both fun and shocking as he tortures suspects in interrogation for false confessions and worthless testimony as Detective Cho Yong-koo. Song Jae-ho is funny and bears a strong presence as Sergeant Shin Dong-chul with his gravitas and experience. I liked Park No-shik's funny performance as the mentally challenged witness Baek Kwang-ho. I must mention the cold and captivating performance from Park Hae-il as serial killer suspect Park Hyeon-gyu. I should say that Go Seo-hee is beautiful and compelling as Officer Kwon Kwi-ok. Jeon Mi-seon is lovely and captivating as the endearing Kwok Seol-yung, similarly.\n\nWriters Bong Joon-ho, Kim Kwang-rim, and Shim Sung-bo find the humanity of these detectives getting pushed into the dark oblivion of hopelessness from optimistic beginnings. It's terrifying to watch them unravel. Bong Joon-ho amazed me with his delightful satire Parasite, but Memories of Murder remains his finest masterclass of refined direction and his greatest picture.\n\nKim Sun-min's editing keeps you absorbed by the mystery with quickly developing clues and sharp cuts from detectives to the murder's perspective for an all encompassing 131 minutes of mayhem. Kim Hyung-koo's cinematography is breathtaking with ultra wide shots of the paddy fields hiding a killer to the serial killer lurking up in the shadows of a treetop. Everything is on screen for you to see and enjoy. Ryu Seong-hie's production design impressively recreates 1986 Korea, while Yang Hong-sam's set decoration looks all gritty and grungy for the furnishings.\n\nTaro Iwashiro's score is beautiful with an ever increasing sense of dread to his composition. Kim Yoo-seon's costumes have a natural look with a cute fashion sense that comes across as fun for such a dreary picture. Jong Ik Kang comes up with all manner of striking visual effects for gunshots and needle injections.\n\nIn conclusion, there's depraved humanity and then there's humanity's aptitude for creating beautiful art like Bong Joon-ho's Memories of Murder.",
            "review_date": "2021-04-18",
            "source": "rt"
        },
        {
            "content": "classic ! best Korea movie ever",
            "review_date": "2021-02-13",
            "source": "rt"
        },
        {
            "content": "While it may seem a slow burn at first, Memories of Murder is a film that slowly enthralls you and engages you until you are fully immersed in what is happening and you realize that you are watching a masterpiece in the thriller genre.",
            "review_date": "2021-02-01",
            "source": "rt"
        },
        {
            "content": "Memories of Murder is about a detective team who tries to solve a series of rape-murder crimes(Its based on a true events). Cinematography was through the roof , every scene was perfectly made. For a crime drama had really funny scenes to it and it was kind unexpected. Through the film you understand how bad is the Korean detectives and you imagine how they even got the job in the first place. The first half of the film(if you cut the rape and murder) you can be really interpret it for a comedy but the second half is when it get serious. I didn't mind the comedy and made it seems more natural I was kinda bored with the American type production crime movies who they are 100% drama. I recommend this film 100% if u have not seen it already you are missing big time. P.S I had to google what the ending was  trying to say(maybe I am stupid(i am not)).",
            "review_date": "2021-01-05",
            "source": "rt"
        },
        {
            "content": "This movie is massively overrated. The comedy element is just basic squabbling, with one of 4 detectives who are on screen for the majority of the movie continually flying kick suspects. Not clever, witty and pretty tiresome. The mystery side of things is again, very basic and massively unfulfilling for well over 2 hour investment. The whole thing is very unrealistic with pretty limited performances from the leading actors. It's ok to pass the time but falls a long way short of a supposed master piece. The Emperors New Clothes is a story that springs to mind when reading reviews about this movie.",
            "review_date": "2020-12-26",
            "source": "rt"
        },
        {
            "content": "One of Bong Joon-Ho's first big hits is now available for rent on Amazon Prime! The film, based on a true crime story that was not solved at the time of the film's original release, is about the efforts of some local detectives to find a serial killer. Two detectives from a local police department, one of who has anger control issues, and the other who seems to have gotten his training from crime detective television shows, are joined by an educated detective from Seoul. The first half of the film is very funny watching Detective Park conjure all of his worst and amateur sleuthing skills, even visiting a psychic, to make headway in the crime. As typical with Joon-Ho's films, his stories linger along the cultural boundaries, and in this case, he finds humor in the contrast in investigating styles between the three detectives. There are shifts in mood that are also characteristic of his films. You find yourself laughing and then suddenly realize something horribly serious is happening. And, like Parasite, the noticeable divisions between the characters blur as the story continues and the murder investigation leads nowhere. This is a well-crafted crime story that is beautifully shot and wonderfully acted. While I don't know a lot about Korean history, it was interesting to watch these events unfold in a culture that seemed to not have any experience with serial killers and where the police didn't have time to dedicate resources to fighting the crime because they were out covering demonstrations and focusing on \"other priorities\". I loved this film, which gets a huge thumbs up from me. It is excellent entertainment and is one of my favorite films of his.",
            "review_date": "2020-12-12",
            "source": "rt"
        },
        {
            "content": "Having watched Parasite before Memories of Murder, it's interesting to see Bong Joon-ho's influence. That same tight, crisp storytelling is present here, with a slightly dark, humorous undertone lurking throughout. There are plenty more parallels with strong cinematography and outstanding editing. While there are the occasional convenient plot devices, they are far outweighed by the smart directing and storytelling. This is the kinda of movie making we need more of, imo. By only complaint is the drab yet understandable color palette.",
            "review_date": "2020-12-11",
            "source": "rt"
        },
        {
            "content": "Western audiences might not like the end, but Memories of Murder is a deeply human meditation on justice and victimization in modern  society.",
            "review_date": "2020-11-10",
            "source": "rt"
        },
        {
            "content": "This had its moments of comical absurdity that I really enjoyed. I'm not sure if it was meant to not be suspenseful, but it was hard to buy into the police officers' convictions of the two main suspects. It was clear to me early on that this case wasn't going to be solved in this film. Also, the (non-diegetic) music choices seemed wrong, too solidly dramatic, which wasn't really in keeping with the various tones of the film.",
            "review_date": "2020-11-09",
            "source": "rt"
        },
        {
            "content": "Bong Joon-ho and the fantastic cast have created something very engaging here. It's nicely filmed and well-written, telling a whodunit story that manages to work in social and political angles too, but what's most impressive is how ‘Memories of Murder' masterfully blends a number of surprising tones by going from comedic and satirical in nature and transitioning into a drama/thriller that becomes dark, sombre and heavy with atmosphere, ending with a truly superb and chilling finale that is sure to stick with you.",
            "review_date": "2020-10-26",
            "source": "rt"
        },
        {
            "content": "Movies was awesome. If you are a fan of this director it is a must see.",
            "review_date": "2020-10-25",
            "source": "rt"
        },
        {
            "content": "SERIAL BONG\nAfter \"Parasite\" mania, it was inevitable that Bong Joon-ho's past film catalogue would trickle across the ocean. With \"Memories of Murder\", we receive his classic 2003 serial murder mystery, which in spite of being only his second feature, is a strong rival for his best work. Though compared favourably to David Fincher's excellent \"Zodiac\", this cracker Korean film came four years prior.\n\nBased on real life events that gripped South Korea back in the late eighties, this riveting thriller delivers Bong's clever filmmaking touches, mixing pull no punches drama with deft comedic bits to create a rich viewing experience. Whether the small village cops slapsticking and bungling a gruesome crime scene, or brutally extorting confessions from the innocent, they do so in a flowing, organic rhythm of tone shifts that is key to the movie going experience.\n\nParasite star Song Kang-ho is excellent as the rowdy, cocksure detective who claims to reveal criminals by looking deep into their eyes. He is the perfect blend of boisterous, naive, silly, gung ho and empathetic. As with most Bong projects, such sublime character development is crucial to the plot.\n\nThe less said about the storyline the better (and the real story has some interesting recent revelations). Best left to discover that on your own. \"Memories of Murder\" defies the \"early effort\" tagline. It is a fully developed, beautifully shot, perfectly paced, and gripping film, from start to finish. A shadowy thinker, it ranks right up there with \"Parasite\", tackling political, personal and societal themes in the guise of a simple story, in what is now a considerable Bong cannon, and is a much welcome discovery.\n\n- hipCRANK",
            "review_date": "2020-10-21",
            "source": "rt"
        },
        {
            "content": "I can see the directors mark on this film but the lack of resolution kind of doesn't make the build up worth it.",
            "review_date": "2020-10-21",
            "source": "rt"
        },
        {
            "content": "Best movie Ive seen in a long time!",
            "review_date": "2020-10-21",
            "source": "rt"
        },
        {
            "content": "A fantastic film that is hard to watch as much as it is captivating. It is based on Korea's first ever serial killer, but the less you know the better. And for God's sake, STOP comparing this film from 2003 to another that Bong released in 2019? Are you that closed-minded or do you have absolutely zero understanding of art whatsoever? Just because a film has more mass appeal and won awards doesn't negate an entire body of hard work. An absolute moronic point of view.",
            "review_date": "2020-10-17",
            "source": "rt"
        },
        {
            "content": "Do you know what I did that rainy night?",
            "review_date": "2020-10-14",
            "source": "rt"
        },
        {
            "content": "Considering that the two murder sprees were often compared at the time, it’s really fitting that this film reminds me of no film better than Zodiac. That’s a compliment. I consider Zodiac the finest serial killer film ever made, one of the best police procedurals, and generally just an awesome film at capturing the feeling of an era. Or rather several eras. I have the order reversed of course: this film came out first. I just saw it second. But it will definitely stick with me.",
            "review_date": "2020-10-14",
            "source": "rt"
        },
        {
            "content": "Following his international success with Parasite, director Bong Joon-Ho's second feature is re-released in post-lockdown cinemas that's starving for content. Had I seen this back in 2003 when it was first released, I would've concluded that this film, based on the true story of a serial rapist-murderer in a rural Korean town in 1986, ticks so many boxes we associate with Nordic noirs, we could've called it Kimchi noir. Rice paddy fields replace snow-covered landscapes as the menacing backdrop where a mismatched cop duo, one temperamental and prone to bend rules to get results and the other more subdued and contemplative, investigate a series of gruesomely portrayed murders which always take place on sad rainy days. It is a beautifully shot crime drama that's ultimately less about the crime and more about the obsessive detectives and how the case affects them. While I'm not sure if one can track any early signs of greatness here that point to Bong's eventual breakthrough as a future Oscar winner, there is no doubt a strong sense of composition and visual flair at work here, especially in his framing and use of close-ups; while a dark sense of humour permeates his writing, including a wicked sense of justice which in this film manifests in one of the detective's recurring use of a flying kick against (normally innocent) suspects and the fate of his leg in the final act. Though I was initially irritated by the film's more slapstick comedic tone towards Song Kang-ho's Detective Park's incompetence and dubious judgements, that surprisingly ends up making his character almost understandable, if not redemptive even by the final act. Hindsight is a wonderful thing but there's no denying that this is a solid and promising effort from a young director whose elegant storytelling abilities will take him far.",
            "review_date": "2020-09-27",
            "source": "rt"
        },
        {
            "content": "First of all, I'd like to give an honorable mention to Dir. Bong for it's fantastic work of art. The movies gives a depressing feeling afterwards especially as I watch the ending scene. Through the beginning until the end, we could see the shots of shifting it's focus and forms of ensemble staging.. Shots like this today is pretty rare and is rarely perfect. However, the actors in the movie nailed it flawlessly. The soundtracks are mesmerizing as it pictures the cold sadness of people who are murdered and it's impact on other people. 9.9/10 I'm not sure where I put the last one point, but overall.. Bravo",
            "review_date": "2020-09-26",
            "source": "rt"
        },
        {
            "content": "Truly a near perfect film. The first time I saw this I went in cold not knowing anything about the plot or historical context and my mind was blown trying to piece together the meaning and was only continually awe struck as I learned more about it.",
            "review_date": "2020-09-18",
            "source": "rt"
        },
        {
            "content": "Humanity has many unsolved problems.\nWhat's in the universe?\nWill there be UFOs and aliens?\nBut what is more mystery than that is the unsolved case of this film.",
            "review_date": "2020-08-25",
            "source": "rt"
        },
        {
            "content": "film that leaves you in suspense from beginning to end, impressive photomontage.",
            "review_date": "2020-08-17",
            "source": "rt"
        },
        {
            "content": "Masterful crafted and acted. Every scene bursts with chaos and purpose, and expertly crowded with an ensemble cast all doing their own thing simultaneously, and doing it well. It’s a shame more directors don’t take notes.",
            "review_date": "2020-07-23",
            "source": "rt"
        },
        {
            "content": "A nice murder mystery with no conclusion. Based on a true case that has recently been solved.",
            "review_date": "2020-07-19",
            "source": "rt"
        },
        {
            "content": "It's incredible to successfully insert irony, humor alongside a series of rape and murder. A glorious achievement in itself. The fact its based on and painstakingly recreated real events, Incredible indeed.",
            "review_date": "2020-07-14",
            "source": "rt"
        },
        {
            "content": "*SPOILERS* I honestly don't know how to rate this, so disregard the given rating as it's based purely on that fact.  I love Bong Joon-Ho's directorial style.  He tends to blend dramatic heft with comedy and suspense and it almost always works either very well or greatly.  A lot of his films have satire too, which I'm always a sucker for.  It's no different with this film.  At it's core it's a detective thriller about an anonymous serial killer and rapist who prays on young women.  Pretty basic stuff.  However, the trick of this movie is that the majority of it is spent trying to identify who the killer is, and by the end, our main characters never find out.  Much like David Fincher's 'Zodiac', by the end of the film, the protagonist is staring at someone.  However, here he's staring not at one individual, but at us, the audience.  Prior to this final shot, the protagonist is told by a little girl that, presumably the killer, is someone rather plain and ordinary looking.  Does this imply that monsters like this walk among us and we don't even know it?  Is that what the movie is trying to convey in this final shot?  I believe so.",
            "review_date": "2020-06-18",
            "source": "rt"
        },
        {
            "content": "An excellent police procedural from South Korea whose 2 hour runtime doesn't feel like 2 hours. I'd be hard pressed to find any fat to trim. The movie is engrossing, at times funny and always interesting. Director Bong Joon-ho and star Song Kang-ho were successfully knocking them out of the park as early as this 2003 release. An unbeatable team!",
            "review_date": "2020-06-17",
            "source": "rt"
        },
        {
            "content": "Um dos melhores filmes que eu já assisti!",
            "review_date": "2020-06-14",
            "source": "rt"
        },
        {
            "content": "Probably the most underrated movie I've seen",
            "review_date": "2020-06-09",
            "source": "rt"
        },
        {
            "content": "A masterpiece, with natural and real detectors who couldn't be seen in Hollywood movies.",
            "review_date": "2020-05-26",
            "source": "rt"
        },
        {
            "content": "Subtle yet so very moving. Every frame, each color tone, the liveliness of the characters. Such soothing a narrative flow!\nThis is a film that leaves traces on you long after you watch it.",
            "review_date": "2020-05-23",
            "source": "rt"
        },
        {
            "content": "\"It is a murder mystery belonging to the familiar crime genre but with an unfamiliar ending.\"\n It tells us the story behind the first ever serial murders in the history of Korea. It does so in a very engaging way with induced portions of social satire and comedy. \nEven though it is Bong Joon-ho's second film only as a director, the brilliance of his screenplay and direction can be seen very clearly in the utmost realistic approach that the movie takes. \nThe best thing to talk about would be the performances. The realism in the movie and the desperation of the main characters was portrayed successfully by the brilliant cast, especially Song kang-ho and his incredible performance. \nCinematography is actually quite decent. The musical score elevated few already suspenseful scenes up another notch and reminded me of the scores in Alfred Hitchcock movies. \n\nPOSITIVES : Bong Joon-ho, Song Kang-ho, Music, Cinematography. \nNEGATIVES : The ending may not feel satisfactory for certain audience and will leave you longing for more.",
            "review_date": "2020-05-18",
            "source": "rt"
        },
        {
            "content": "Best film by this incredible director",
            "review_date": "2020-05-06",
            "source": "rt"
        },
        {
            "content": "There is a lot of great movies talking about mystery murders and murderers, but in my opinion there is two movies are the top, one of them is Zodiac (2007) from the genius David Fincher. and the other one is Definitely this movie memories of murders from the genius South Korean Bong Jon-Ho.\nthe movie takes place in South Korea in 1987, about a mysterious murders happen in a small city by a serial killer, and we see two Detectives from the police while they collecting evidences trying to arrest him, so we go along with them in their journey to find out the truth.\nin my view this movie is very unique and has a very special theme,\nwhat I like about this movie is that the main character and his friend are not genius or heroes like the other movies, they are not very smart at all and they have no values and morals, they are trying to do anything for their best interest, they don't care about arresting the killer or solving the case in the right way, this was great in the movie.\nthe directing by Bong Joon Ho was a great, he had the right style for telling the story, specially with using the Long take shots in the right moments and the right places, this type of shots lit the actors show their abilities. the acting was Excellent specially from detective Park playing by the great Kang-ho Song , the cinematography also was amazing, the line story almost to be perfect but the second half had a little problem, but otherwise the movie is blowing your mind, Definitely Memories of Murder Deserve your time my friend.",
            "review_date": "2020-05-03",
            "source": "rt"
        },
        {
            "content": "His best till Parasite. An entertaining yet realistic police procedural where Bong focuses equally on the characters too. The ending shot and fact that I watched this a few days before the murderer in real-life was caught made it more chilling.",
            "review_date": "2020-04-28",
            "source": "rt"
        },
        {
            "content": "\"JOYA OCULTA DEL CINE DE DETECTIVES\"\nEl gran director sur coreano demuestra una vez mas el excepcional director que es con este filme de suspenso de detective, que combina la comedia, el suspenso y misterio como solo Bong Joon Ho sabe hacerlo, con un reparto que excede las expectativas que no es de extrañar ya que el actor Song Kang Ho es un recurrente en el cine del director y el final aunque no ter deja una conclusión que tu quisieras ya que se basa en un caso de la vida real, si te llena de reflexiones a la vida que tuvieron que afrontar en ese momento los protagonistas y lo quebrados que estaban al verlos no solo lidiar con el caso, sino con sus propios problemas personales.",
            "review_date": "2020-04-23",
            "source": "rt"
        },
        {
            "content": "Impecable thriller coreano de Bong Joon-ho",
            "review_date": "2020-04-04",
            "source": "rt"
        },
        {
            "content": "Incredibly gripping, hilarious and at the same time chilling rendition of a true crime. The actors are fabulous. If you, like me, had your cinematic understanding change post Parasite and are out looking for more from the genius filmmaker, do watch this film to understand the variety he offers. :)",
            "review_date": "2020-03-29",
            "source": "rt"
        },
        {
            "content": "Superb acting, majestic direction and perfect cinematography makes \"Memories of Murder\" a truly masterpiece.",
            "review_date": "2020-03-22",
            "source": "rt"
        },
        {
            "content": "Despite some narrative misgivings, Memories of Murder is a suspense-ridden drama helmed by a more than capable director.",
            "review_date": "2020-03-04",
            "source": "rt"
        },
        {
            "content": "Awesome movie! Had me guessing right until the end. ",
            "review_date": "2020-02-23",
            "source": "rt"
        },
        {
            "content": "A long and strange murder investigation film, but worth the time.",
            "review_date": "2020-02-20",
            "source": "rt"
        },
        {
            "content": "Really kept me engaged the entire time. I know this happened a long time ago & police were using old crime-fighting technology, but I was still thrown off by some details. I don't know how they tried to match fingerprints to DNA???? Then they used song requests as probably cause??? But it still held my attention.",
            "review_date": "2020-02-17",
            "source": "rt"
        },
        {
            "content": "fantastic! Best Bong movie ever!",
            "review_date": "2020-02-14",
            "source": "rt"
        },
        {
            "content": "Inspired by true events, comes another great take of a murder story from director Bong Joon Ho. A dark humor, a light arch that nevertheless carries punches.",
            "review_date": "2020-02-12",
            "source": "rt"
        },
        {
            "content": "Great movie. The humor, the direction, the fact that's based on a true story, the acting...Everything falls in place just as it should. Any movie lovers gotta watch this one.",
            "review_date": "2020-01-12",
            "source": "rt"
        },
        {
            "content": "Exquisitely shot and emotionally balanced, this story unfolds the truth of a sickly tragic part of modern Korean history.",
            "review_date": "2020-01-07",
            "source": "rt"
        },
        {
            "content": "One of the best corean movies i ever see, Bong Joon-ho is an amazing director!",
            "review_date": "2020-01-06",
            "source": "rt"
        },
        {
            "content": "Possibly one of my favorite movies of all time. I had to watch it again the day after I first watched it, so much I loved it. No spoiler but the very last image on the screen left me with the word genius in my mind.",
            "review_date": "2019-12-30",
            "source": "rt"
        },
        {
            "content": "Very funny and quite adorable at moments for a crime film. All the characters have heart and even some of the \"bad\" characters are written in such a way that they come off as quirky and fun as opposed to hate. The dramatic moments are just as strong as the comedic moments.",
            "review_date": "2019-12-21",
            "source": "rt"
        },
        {
            "content": "One of the best thriller i have ever seen. Incredible hidden gem. Probably a masterpiece",
            "review_date": "2019-11-21",
            "source": "rt"
        },
        {
            "content": "Beautiful ensemble framing. Genuinely tense moments. Refreshing moments of comedy. Meaningful historical commentary.",
            "review_date": "2019-10-30",
            "source": "rt"
        },
        {
            "content": "Very entertaining murder mystery elevated by characters who are real and human",
            "review_date": "2019-10-15",
            "source": "rt"
        },
        {
            "content": "7 8 8 8 7 8 8 7 7 7 = 75\n8/5, 2019\nThe interior mise en scene is interesting but the director uses an over-emphasized method to depict a good story, also the structure may influence Zodiac afterwards.",
            "review_date": "2019-08-06",
            "source": "rt"
        },
        {
            "content": "Not only one of my best Korean movies of all time, especially after reading about the facts behind the case, but also one of my favorite movies of all time. ",
            "review_date": "2019-06-26",
            "source": "rt"
        },
        {
            "content": "This movie certainly covers various social issues and marks distinct characterization.",
            "review_date": "2019-06-19",
            "source": "rt"
        },
        {
            "content": "One of the best thrillers I have luckily seen.",
            "review_date": "2019-06-07",
            "source": "rt"
        },
        {
            "content": "This is undoubtedly Bong Joon-ho's magnum opus, the direction and use of ensemble staging is an absolute treat to watch and the fact that it's based on true events makes it all the more spine-chilling. Memories Of Murder is perhaps the best serial killer film ever made, it's dark, gritty and emotional yet at the same time Bong pulls off the dichotomy of dark humour somehow making you laugh amidst the heinous crimes and visceral violence shown scene after scene. With breathtaking wides of farmland and the use of 'The Spielberg Oner', every shot is masterfully crafted and just as intricate as the one that came before it. Song Kang-ho is incredible as always and by the end of the film you'll be left haunted and wondering what your neighbour get's up to on a bleak and rainy night...",
            "review_date": "2019-06-03",
            "source": "rt"
        },
        {
            "content": "Liked it. Would've liked it more if the murderer had been found!",
            "review_date": "2019-04-27",
            "source": "rt"
        },
        {
            "content": "Manages to outdo \"Zodiac\" in its reach, working as police procedural, satire, and sociopolitical expose seemingly all at once. Faultless performances and great tonal and moral control from Bong. A high point in recent Korean cinema.",
            "review_date": "2019-03-17",
            "source": "rt"
        },
        {
            "content": "This was simply marvelous. Thrilling. The way it was shot, the amazing performances. First few minutes had me sucked into this little town and it's gruesome murders. \n\nThe ending... left me jaw-dropped, outraged, a feeling similar to when I read the end of Graham Greene's \"The End of the Affair\". Just ... blown away. SHOOKETH.",
            "review_date": "2019-01-18",
            "source": "rt"
        },
        {
            "content": "Memories of a Murder is a strange film because I struggled at times to identify the intended tone of the movie. The subject matter is serious and dark, so I thought this could be a gritty detective drama. I always enjoy a murder mystery and a police procedural, so that aspect of the film had me excited. However, at the same time that there was all this heavy stuff happening, there were a few characters bumbling around almost as incompetent as the Keystone Cops. The way these small-town cops treat a serial killer case is so ridiculous it bordered on farce, and I couldn’t tell if I was supposed to be laughing. It’s a tough balancing act to pull off a movie that is both dramatic and comical, and I’m not sure they did the best job finding the balance. However, there were times when it worked and the contrast did a great job of making the comedy even more humorous. The case that is the focus of this story is one that creates some great scenes loaded with tension. I love how they slowly piece together the M.O. of the killer and that creates a framework for us to recognize imminent danger. This makes later scenes even more frightening because we know what is coming. I enjoyed seeing the unique aspects of an investigation in Korea, and some of the struggles that they experience. It’s easy to get accustomed to the style of American police work (or at least the kind we see portrayed on TV and in the movies,) but these characters have challenges that we don’t anticipate when they have to look into a case like this one. The other thing that made this film more powerful was the visual style. Bong Joon-ho captures some amazing visuals that will stick in my mind for a long time, and uses them in order to add to dark aesthetic of the story. What makes Memories of Murder more than just a simple procedural is the relationship dynamics between the lead characters. Song Kang-ho plays the small town detective who has his way of doing things that is misguided, but apparently has worked for him in the past. Kim Sang-kyung plays the newcomer from the big city who wants a more structured investigation by the book. You can see from the start that these two are going to butt heads over how to solve the case, and it becomes one of the main points of conflict in the film. I only wish we were allowed to see more merit in the method from Song Kang-ho’s character, because he is so obviously in the wrong the whole time he becomes more of an annoyance instead of a quirky positive presence. I still got deeply involved in the mystery and was riveted most of the way through Memories of Murder. While it wasn’t a perfectly executed thriller or a perfectly executed comedy, it had enough good qualities from both genres to keep me engaged.",
            "review_date": "2018-09-13",
            "source": "rt"
        },
        {
            "content": "A hilarious but also very sad tale of a string of rapes/murders going unsolved.  Hilarious because the cops that work the case are funny, as are some of the suspects.  This was an excellent plot that keeps you entertained and interested from beginning to end, even though its over 2hr long.  The acting and dialogue are both great... very well done.  I highly recommend this movie to fans of asian cinema (or movie fans who don't mind subtitles).",
            "review_date": "2018-09-03",
            "source": "rt"
        },
        {
            "content": "\"Let me tell you about America. They've got the FBI. If you watch how they investigate, you know how? Their heads are spinning like a top. Analyzing things. You know why? It's 'cause they got so much fucking land. If you don't use your brain, it's too much ground to cover. So they have no choice, those FBI bastards. But our Republic of Korea, using just your two legs you can run all over it. So it's said, Korean detectives investigate with their feet. That's folk wisdom, you bastard. So brainy geeks like you can go the hell to America.\"\n\nSo says the small-town Detective Park to the big-city Detective Seo, who has arrived to help investigate two violent murders. That's a fantastic monologue, but Park may be way off with his earthy wisdom. It soon becomes clear that what they are facing is a completely new kind of crime, one that a small town (or for that matter, a big city) just isn't prepared to deal with...\n\n'Memories of Murder' is mesmerizing, a five-star telling of South Korea's first identified serial killings. Watch it on a rainy evening for best results.",
            "review_date": "2018-08-17",
            "source": "rt"
        },
        {
            "content": "One of the best foreign movies I've seen. Not expected a lot from Korean film industry but I'm wrong. Top notch acting from the actors and superb directing and most importantly the climax scene  is out of the world.",
            "review_date": "2018-07-22",
            "source": "rt"
        },
        {
            "content": "*****\nFinally! In the UK, 'Memories of Murder' is kind of hard to get a hold of, but I found it, watched it, and absolutely loved it. This is by far the best foreign film I have ever seen, and honestly one of the best serial killer movies too; up there with 'Zodiac' and 'Se7en'. I'm not even sure where to begin: so I'll start by saying that I'm having trouble finding anything I didn't like. Director Bong Joon-ho has proved himself a master filmmaker with this movie - from the way he stages a scene, to the way he moves the camera, to the sheer attention to detail displayed in every moment. He also manages to get some terrific performances out of his cast, and it was genius to see how the two main detectives, played perfectly by Song Kang-Ho and Kim Sang-kyung, were so different throughout the whole movie - yet with a crime like this, appeared exactly the same at the end. There's not much else I can say, but I implore you to seek this Korean masterpiece out. I was hooked from the very beginning, and the end was masterful in the way it was one of the most disturbing parts of the film, that at the same time didn't involve anything grotesque. In my opinion, a flawless masterpiece.",
            "review_date": "2018-04-08",
            "source": "rt"
        },
        {
            "content": "as many people know, this movie is based on real story. and the criminal, even today,  is not captured yet. at the last scene of movie, song kang-ho stares the camera like staring the audience who is wathcing this movie, like staring a real criminal who will (almost certainly) watch this movie.",
            "review_date": "2018-03-14",
            "source": "rt"
        },
        {
            "content": "Real. Moving and tochin in a frustrating way.",
            "review_date": "2018-01-07",
            "source": "rt"
        },
        {
            "content": "Two small town detectives are out of their depth whenever a serial killer starts murdering girls in the local area. Another detective arrives from the city to help out but the cops don't get along and while they argue and bicker amoungst themselves, the killer remains two steps ahead.\n\nAnother great film from Bong Joon Ho, much better than most Hollywood takes on the genre. Highly recommended. 4/5",
            "review_date": "2017-11-25",
            "source": "rt"
        },
        {
            "content": "Memories of Murder is one of Joon-ho Bong's (Snowpiercer, The Host, Okja) earlier works. The film is based on a real-life unsolved case, the Hwaseong serial murders that took place from the mid-80s to early-90s in South Korea.\nMemories of Murder shows the darkness of that time through the various depicted scenes. It's an odd mix of comedy and suspense but it works. \nIt's not just its quirkiness that makes it stand out. it's well-written, performed and filmed. The story captivates you from the start, and it maintains momentum throughout. And as always, Bong Joon-Ho is a master when it comes to pitch-perfect cinematography. Cinematography needs to do more than just look good, but also assist in storytelling, of which mood plays a significant role. The cinematography in Memories of Murder does just that.",
            "review_date": "2017-10-13",
            "source": "rt"
        },
        {
            "content": "An Exceptional Movie.  Great performance from the cast.  The main thing about the movie is it's screenplay and the direction technique.",
            "review_date": "2017-10-02",
            "source": "rt"
        },
        {
            "content": "Bong's powerhouse directing and unique tone really come alive in this film, juxtaposing the absolute emptiness in the doomed search for a killer (and their own identity) with the humor of the quiet moments. In the process, there's a sense we're watching a truly epic journey, both all-consuming and timeless. Truly, a great film.",
            "review_date": "2017-09-23",
            "source": "rt"
        },
        {
            "content": "A story of obsession and transformation based on the true story of Hwaseong serial murders in 1980s. A great character study within a mediocre, but compelling crime movie.",
            "review_date": "2017-08-27",
            "source": "rt"
        },
        {
            "content": "Serial murder. Police trying to solve it. Sounds simple, right?\n\nNothing in this movie is simple. The plot, the characters, the depiction of Korean police environment of the time, the cinematography are all great.",
            "review_date": "2017-07-27",
            "source": "rt"
        },
        {
            "content": "4/5\n\nIt took Memories of Murder a while to establish its style, which blends comedy, drama, and mystery in a very strange but ultimately very satisfying way, particularly with its poetic and impactful ending.",
            "review_date": "2017-06-27",
            "source": "rt"
        },
        {
            "content": "Movie about police investigating a serial killer. Its okay. Nothing special. Takes a lot of its idea's from old movies from the past. Doesn't add much.",
            "review_date": "2017-05-05",
            "source": "rt"
        },
        {
            "content": "A well made motion picture far away from the Hollywood stereotypical serial killers movies with a great and tough direction and storyline making it the greatest movie in Joon-ho Bong's career.",
            "review_date": "2017-03-15",
            "source": "rt"
        },
        {
            "content": "8.5/10, my review: http://wp.me/p1eXom-2PY",
            "review_date": "2017-02-23",
            "source": "rt"
        },
        {
            "content": "1986.  In a rural district of South Korea, two women have been recently raped and murdered.  Working on the case are detectives Park Doo-man and Cho Yong-koo.  Their efforts are impeded by some sloppy crime scene procedure by the police.  Their methods of solving cases are also quite basic, essentially amounting to beating confessions out of suspects.  All this leads to nothing and the police chief brings in a more sophisticated and intelligent detective from Seoul, Seo Tae-yoon.  With his arrival the methods improve but they still don't have the killer.  Then another woman is found murdered and a pattern emerges...\n\nGripping drama from writer-director Joon-ho Bong.  Intriguing from the start, and the intrigue ramps the more you get into it.  Gritty, realistic and certainly doesn't glamorize detective work - so many red herrings and dead ends!\n\nQuite funny at times too.  The methods of the local detectives are sometimes very farcical and the director makes the most of these moments of comedy.\n\nVery powerful and thought-provoking ending.  As with the remainder of the plot, not at all predictable or formulaic.\n\nSolid performances, especially from the two leads, Kang-ho Song and Sang-kyung Kim.",
            "review_date": "2017-01-14",
            "source": "rt"
        },
        {
            "content": "Korean filmmakers seem to have an uncanny knack for infusing their serious films with humour and this is no different. Funny yet harrowing.",
            "review_date": "2017-01-04",
            "source": "rt"
        },
        {
            "content": "Masterpiece! Brilliant! Every time I go back to this, I wonder just how perfect it is. If I ever had to recommend a murder mystery/thriller of this century, this would be it.",
            "review_date": "2016-12-16",
            "source": "rt"
        },
        {
            "content": "great journey unveiling the mystery. Humours gives you a break from suspense.",
            "review_date": "2016-11-02",
            "source": "rt"
        },
        {
            "content": "4/5 Ratings for Memories of Murder\nF : 89 %\nR : 11%\nCrime 60%  Drama 10% Mystery 30%",
            "review_date": "2016-10-21",
            "source": "rt"
        },
        {
            "content": "Beautifully shot and staged film that deconstructs the conventions of the genre.",
            "review_date": "2016-10-19",
            "source": "rt"
        },
        {
            "content": "Hard to rate as it telling the story of a real life incident....Didn't like the way it ended...",
            "review_date": "2016-07-21",
            "source": "rt"
        },
        {
            "content": "Memories of Murder is an excellent crime/mystery film. As a big fan of the genre, this movie entertained me from start to finish. It was intriguing and terrifying at the same time. As soon as the second murder occurred, I started to feel the greatness of this film. I was on the edge of my seat, and I never got lost from start to finish.\nAfter seeing Memories of Murder, I think I have to reconsider my No.1 Bong Joon-Ho film. My no.1 favourite Bong Joon-Ho film has always been The Host. But seems like there is a new contender for the No.1 spot.",
            "review_date": "2016-07-06",
            "source": "rt"
        },
        {
            "content": "Basé sur l'histoire des premiers meurtres en série de l'histoire de la Corée du Sud. Une superbe réalisation (le même réalisateur que l'excellent Snowpiecer) et le travail des acteurs est très efficace. Encore un preuve que le cinéma sud-coréen est probablement le meilleur cinéma au monde",
            "review_date": "2016-06-06",
            "source": "rt"
        },
        {
            "content": "movie that transcends genres ...one of the very few movies where you come bak to watch it again and again ..Terrific !!!",
            "review_date": "2016-06-04",
            "source": "rt"
        },
        {
            "content": "Best movie I've ever watched.",
            "review_date": "2016-05-29",
            "source": "rt"
        },
        {
            "content": "Shifting the focus away from the crimes and onto the desperate measures to detect them, this is a compelling mix of docu-dramatic realism and stylised character study.8/10",
            "review_date": "2016-03-19",
            "source": "rt"
        },
        {
            "content": "One of the best conclusions to a film, ever.",
            "review_date": "2016-03-13",
            "source": "rt"
        },
        {
            "content": "?????? ???? ?????????? ???? ?????, ????? ????????? ??????? ?????? ?????? ?????.",
            "review_date": "2016-02-23",
            "source": "rt"
        },
        {
            "content": "A true serial killer story with a lot of good comedy injected for effect. Korea is under military rule and the practices of the detectives reflect that. It is only when a detective from Seoul is bought in to help do they start to make some headway but his frustrations with how things are done slowly bring him down to the level of his new colleagues. Only after watching this do you realise that the serial killer story is really just a background to the main messages that this film is trying to get across. Very good film.",
            "review_date": "2016-01-31",
            "source": "rt"
        },
        {
            "content": "A total knockout film. A piece of art which has everything one goes to cinema for. From funny to hilarious and then dramatic, emotional, sad and finally shocked. It's a movie without any ending and the one that attaches a hook to you brain and won't let it go. From the publicity posters to the editing, writing and acting this movie is a thoughtful work.\nAt times it would seem like reading an old novel and at times it would seem like watching a nemesis film. There are many flavors which work because of the terrific acting jobs everyone has done. Every character is a perfect fit. Both of the lead cops are opposite to each other and then the shift in their personality to take each other's place. The suspense is very strongly kept through out the movie and there is a ground breaking background score to lift it to new heights. The chase seen from the woods into the village and then the factory site is very thrilling. Another scene involving the train accident is also placed right.\nThere would not be any department or field this movie could be less then great at.\nKang-ho Song, is the best thing in the movie. His portrayal of an aggressive cop is top notch. He brings all the humor and then the intensity in the movie. Sang-kyung Kim, also gave wonderful performance. A cop with less known background which is civilized and honest to his job and then loses his control over the event. \nA movie which will be on your favorite lift forever.",
            "review_date": "2015-12-20",
            "source": "rt"
        },
        {
            "content": "Superbe film à découvrir.",
            "review_date": "2015-12-17",
            "source": "rt"
        },
        {
            "content": "I thought it was acted and directed well, but wasn't super gripping. It had a strong lead up to the ending which worked well though.",
            "review_date": "2015-12-03",
            "source": "rt"
        },
        {
            "content": "Sometimes, no matter what we do, we just don't win. I think the one thing I got out of this that other people don't really point out is the political perspective. Throughout the film, there is an undertone of city vs. rural, development vs. backwardness. This undertone then underscores the hopelessness and frustration of the situation. Even with all that technology, questions are still left hanging. The impotence of man.",
            "review_date": "2015-12-01",
            "source": "rt"
        },
        {
            "content": "Superb plot and character developments, really involving, hilarious, must watch!\nSong Kang-Ho also deserves special mention for his great work!",
            "review_date": "2015-11-09",
            "source": "rt"
        },
        {
            "content": "Okay, I'll preface this by saying that South Korea is a master of cinema; the whole Korean cinematic industry has made a fantastic job in showing the world what filmmaking is all about.\n\nThis movie is a prime example of that.\n\nSarinui chueok, or Memories of Murder for the rest of the world, is not just a police-procedural movie, okay? It's not your typical murder-mystery thriller. This movie is all about characters, human characters, all-too human. This movie will show you, in a superb manner, the complexity of the human being.\n\nThat's what makes this movie so complex: it deals with the nature of human beings against something they do not understand, it takes characters to places where they'll lose their minds; it will strip its characters from their pragmatic ego's, from their self-centered personas. It will show humans at the turn of their most obscure side. It will show you what happens when humans step into the Dark Side of the Moon.\n\nHow? Well, the answer is simple. Take a South Korean lazy-corrupt officer (detective Park) along his even more lazy-corrupt-and-aggressive partner (detective Cho) to investigate the most hideous serial killer of that time (1980s) in a very small town. Let them show you their sleazy ways. Let them show you their incompetence when it comes to work, serious work that is: you're investigating a series of murders! \n\nThese men will torture suspects just for the simple reason that \"they heard he committed the murders\", that's how bad they can be. \n\nLet's take it even further, just to show how far their corruptness can go: they will plant evidence just so they can convict a suspect of a crime, even if that suspect is mentally disabled.\n\nThese two guys are just a complete mess when it comes to working. However they think their crooked ways are the right ones. Detective Park usually says: \"I can simply look at a man's eyes and find out if he's guilty or no\", that's he's way of thinking, you get the idea now?\n\nSo we have two incompetent-corrupt officers of the law. Now bring an outsider (detective Seo), an officer straight from the capital and a serious man about his work - because they investigate murders, it has to be very serious work. This man will show them his pragmatic ways of working: \"documents never lie\" he would normally say when referring to the evidence. This man does not torture suspects; he will only follow the evidence. This man knows his stuff.\n\nWhat happens when these opposing forces meet? A complete mess is what happens, to say the least. Detective Seo will slowly show these two lazy-asses how to run an investigation, and despite his efforts to show how scientific procedures can help you bring down a serial killer, these two dirt-bags will try to show this pragmatic detective how their ways are the right ones, how esoteric methods can beat science, how rumors are more valid then congruent pieces of evidence, how, just for the fact that South Korea is a small country, the methods used by other countries, such as the U.S., won't work in that country: \"Korea is of the size of my penis, that's why we investigate with our feet, because you can walk the whole country in day\" detective Park said to detective Seo. \n\nSo we have two characters that take major roles: detective Park and detective Seo, and they make a great contrast for the plot.\n\nNow we have to talk about the one person who will bring this to a nice triangle: the murderer; who is he? It doesn't matter, he is just a McGuffin used to let characters develop their worst sides or their better sides - again this movie is just about characters, about the way humans behave under extreme circumstances. Still we get to spend a lot of time with all the suspects and their different personalities.\n\nSo all you have to concentrate on is what the main characters do or say throughout the movie since everything will be vital for the plot.\n\nYou get to enjoy the moments where you see detective Park spend time with his wife: we get moments intimacy, moments where they talk and he shows some jealousy because his wife - a nurse - gets requested the most by patients at the hospital, and we get to see where most of detective Park's not-so-clever-ideas come from, ideas such as \"going with a psychic\" to find out who the murderer is.\n\nThe characters in the story are just as real and perfect as they can get, and the serial killer story hits the jackpot of story-telling. So what about the directing of the movie? Admirable is the adjective I'll use to answer. You can't really expect much from director Bong's sophomore attempt at filmmaking with a near-broke studio, right? Wrong. Director Bong made wonderful use of camera work; take one of the first scenes of the movie: we get a nice long shot that shows us what mess of a crime scene the detectives had due to their incompetence and terrible communication. \n\nWe get some beautiful takes of the landscapes with great natural lighting, and thanks to the opportunistic weather at the time of filming, we get some wonderful takes that really captured the depressed feeling that director Bong wanted to project to the audience.\n\nThe movie itself has a great sense of humor at the beginning, since the movie itself satirizes the South Korean system, all the way from the press, police force, political views, and the way we sometimes tend to think. But near the end of the movie we start to feel a brilliant change of humor, from a witty sense of humor, to a very serious thriller, we start to see the characters get more serious in the plot; we start to feel the tension of the plot as it reaches its brilliant ending.\n\nThis way of making the seriousness of the plot change makes the movie all the more better: you get moments of laughs and you get moments of tension.\n\nThis change, however, does not only happen in the plot, it also happens to the characters - the two main characters - take detective Park for instance: corrupt, incompetent, lazy, and stupid at times, turns out by the end, in a beautifully executed scene (train track scene), we get to see him coming clean and admitting that he does not know who can be guilty of a crime by just simply looking at their eyes. \n\nDetective Seo, the pragmatic, flat-footed detective, on the other hand, starts to succumb to the nasty ways of detective Park: he starts to lose his nerve and even slaps the poor mentally disabled suspect, who happens to know the identity of the killer, in an attempt to get the kids testimony for evidence. It doesn't end well for the mentally disabled kid... We also see detective Seo beat the living hell out of the main suspect just because he is so sure he's the killer, but then the evidence (the documents) shows him that he is not the killer; all this will just push detective Seo to the edge of madness. Now all this is shown in that one masterful/powerful scene along with detective Park's moment of clarity: one sees the light, the other sees the darkness; talk about good writing and good directing.\n\nThe movie's ending is just sublime, it will leave you make you think more about the whole movie... gives me the chills just by thinking of that last close shot at detective Park's look, you can really feel him all the way to the end of that scene.\n\nThe audacity for directing, writing, and cinematography in this movie is just fabulous, one couldn't ask for more. \n\nThis movie was hailed by Tarantino in one of his interviews as one of the most interesting and complex movie he had ever seen, and damn right it is!\nThis movie was made for all type of audiences, it's fun, interesting, intriguing, and cathartic. You will be missing out on one of the best movies of modern times.\n\nFun fact: one of the studios that produced the movie: Sidus, was near bankruptcy when the movie was filmed, and due to the movie's unexpected success the studio went back on track and is now a major studio in South Korea.",
            "review_date": "2015-09-03",
            "source": "rt"
        },
        {
            "content": "A Modern Day Masterpiece.... the best Serial Killer movie that you get to see",
            "review_date": "2015-08-25",
            "source": "rt"
        },
        {
            "content": "korean \"eka\" sarjamurhaaja",
            "review_date": "2015-08-21",
            "source": "rt"
        },
        {
            "content": "This is a fantastic film!  A crime-thriller set in South Korea in 1986, it follows a couple of detectives who are trying to catch a serial killer.  The acting is excellent, and the cinematography is gorgeous.  Though it is generally quite serious, there are moments of black humour throughout to break the tension, it's really well-balanced. This is yet another great film out of South Korea that I have seen, there have been some truly amazing films coming out of there for the last decade and a half.  Highly recommended!",
            "review_date": "2015-08-08",
            "source": "rt"
        },
        {
            "content": "Crazy, effective mood swings across dread, suspense, and outright slapstick. Not your average serial killer buddy movie.",
            "review_date": "2015-07-19",
            "source": "rt"
        },
        {
            "content": "94%\nWatched this on 11/7/15\nBong Joon-ho directs Memories of Murder with style and delivers the psychological tension of it's characters extremely well. This is easily a staunch masterpiece. The actors do real justice to the film, especially it's two protagonist cops. The film's use of comedy as comic relief is also noteworthy.",
            "review_date": "2015-07-11",
            "source": "rt"
        },
        {
            "content": "The first Korean movie that I liked and started liking Korean movies since then.",
            "review_date": "2015-07-01",
            "source": "rt"
        },
        {
            "content": "Over a month and about 25 movies later and this is still stuck in my head. I think it just might be one of the greatest police procedural dramas I have ever seen. Just maybe..",
            "review_date": "2015-04-20",
            "source": "rt"
        },
        {
            "content": "good for sure but not the all time best korean movie as it has been proclaimed to be..",
            "review_date": "2015-03-28",
            "source": "rt"
        },
        {
            "content": "Bong Joon-ho uses a real Korean serial killer story as the basis for this always absorbing, terribly ironic and tragically hilarious crime drama that is both an intelligent social satire and a sharp political commentary, and he never ceases to surprise us until the very last shot.",
            "review_date": "2015-03-07",
            "source": "rt"
        },
        {
            "content": "Review In A Nutshell:\n\nEven though I was left underwhelmed by Chan-wook Park's Oldboy, I still had hope for Korean cinema, knowing that maybe if I keep exploring and tasting new films by different directors; I would eventually find one that would suit to my tastes. It was fortunate that it only took two films to find that sense of satisfaction; it was by the mind and hands of Joon-ho Bong, his sophomore feature film Memories of Murder.\n\nMemories of Murder features a strong and appealing premise of a rape-murder mystery set in a local town; two detectives with their own distinctive styles have been chosen to solve the case. It is in the difference of each detective's style that the film manages to be interesting; with comedic touches set by the director in order to let the first hour or so of the film to not be too suffocating with its serious and dire subject. It was through this that the characters were unique, allowing both to stand out from one another and create a sense of clash of ethics and methods, but the film does not resort to the clichéd elevation of internal tension, letting both characters be focused and determined to identify and catch the person responsible for these sickening crimes.\n\nThe mystery of the plot itself starts off being a bit slow in exposition, it takes a while for the audience to find something to chew on; it is only when facts start to emerge and solidify their importance to the story, that the film starts to pick up its pace, and create tension; evoking a sense of urgency that is felt both on screen and in ourselves. It is during the final hour of the film that I found myself highly engaged by its mystery and suspense, with comedic elements finally carrying a sense of weight for the characters; showing a sense of desperation, meaning that the case has finally crawled within the inner depths of their souls, becoming an obsession rather than an obligation. It is during this part of the film that the dialogue driven exposition begins to slow itself down, halted by tense chase sequences and big reveals that leaves audiences in a state of exhilaration.\n\nIt all builds, brick by brick, to a conclusion that satisfies in a way that one wouldn't expect. It becomes internal rather than external; emphasising the detectives themselves rather than bigger story; it is character development that has slowly been building under our noses, paying off at the end that makes one want to go back and see their entire journey again. The film ends with a final frame that speaks volumes of its ideas and themes; I feel it would be unfair to those who have yet seen the film to divulge these thematic elements, as its exposure may hurt the impact the film would have to surprise and intellectually stimulate. Also it would be better for me to discuss it when I have seen the film multiple times, understanding all the elements that make up the film.\n\nMemories of Murder is a damn near perfect mystery thriller that keeps audiences on their toes and delivering a conclusion that beautifully exceeds one's expectations. This is a film that does not aim to satisfy the immediate desires of its audience, it targets the nerves in our body that find excitement in deep and resonating intellectual and emotional stimulation.",
            "review_date": "2015-01-03",
            "source": "rt"
        },
        {
            "content": "The inconsistent tone of the film (are flying kicks to the face standard in Korean police interrogations?) distracts from an otherwise engaging plot.",
            "review_date": "2014-12-19",
            "source": "rt"
        },
        {
            "content": "Damn, that ending made me have some type of feel that's unexplainable. So powerful. The cast was amazing especially Song Kang Ho. I'm a sucker for serial killer films and this was very enjoyable, as expected from Director Bong.",
            "review_date": "2014-10-12",
            "source": "rt"
        },
        {
            "content": "Korean film maker proves it once again.. They are the best when it comes crime thriller genre. Memories of murder is a story of a serial killer mystery in a small town of Korea. Well directed and all actors have put up an amazing performances to keep you on edge of your seats.",
            "review_date": "2014-09-28",
            "source": "rt"
        },
        {
            "content": "One of the smartest crime/detective films out there for sure. Pure quality of the genre - you can't ask for anything else.\n\nQuite haunting and a bit disturbing as well. Lovely shot, cinematic brilliance really. It's never boring, and the cast is excellent. The three detectives does their job, but the other \"filler\"-characters is also very enjoyable. It's darn funny at times too, it's an important spice for such a sad, true story.\n\nI won't give away the film's greatest feature, but I can say that it's happening in the very few seconds of the film. Maybe you get it, maybe you don't.\nIt took me a while (and some reading), but this may be one of the cleverest moves ever made in the histroy of cinema.\n\n9.5 out of 10 murderers.",
            "review_date": "2014-09-25",
            "source": "rt"
        },
        {
            "content": "\"Low-key, unassuming, and crafty in the way it slowly gets under your skin, Memories of Murder is a sly and smart thriller.\"",
            "review_date": "2014-09-22",
            "source": "rt"
        },
        {
            "content": "Good crime/detective drama from Korea.",
            "review_date": "2014-09-13",
            "source": "rt"
        },
        {
            "content": "Visually beautiful and well-acted, it still misses the element that would make it a real masterpiece.",
            "review_date": "2014-09-11",
            "source": "rt"
        },
        {
            "content": "Since a long time I haven't enjoyed a crime film so much. So far by now I watched three films by Bong Joon-ho, \"The Host\", \"Snowpiercer\" and now \"Memories of murder\". You should deal with black humor, egos dispute, issues about differences between cities and little towns.",
            "review_date": "2014-09-07",
            "source": "rt"
        },
        {
            "content": "Memories of Murder is about the first serial killer to appear in South Korea back in the 1980s, and it's a doozy. In only his second film, but first semi-widely seen, Bong Joon-ho already shows off to great effect just how masterful his storytelling skills are. The way he is able to play around with cop archetypes in interesting ways, get resonantly strong performances out of his cast, and inflect bits of weird humor and social commentary into the proceedings makes it all feel different and not like the type of cop story we've seen a thousand times before. The ending is also quite haunting, and after watching the film it makes even more sense how quickly Joon-ho would establish himself as one of the best filmmakers to ever come out of Korea.",
            "review_date": "2014-08-28",
            "source": "rt"
        },
        {
            "content": "An instant classic of the crime thriller genre. Wonder why it took me so long to go at it and finally bloody watch it. Can see now from where \"True Detective\" and  other recent similar cop shows/films borrowed some of there fine traits.",
            "review_date": "2014-08-17",
            "source": "rt"
        },
        {
            "content": "A twisted end to a twisted tale!!!",
            "review_date": "2014-08-16",
            "source": "rt"
        },
        {
            "content": "This is a very slight, Korean murder mystery.  It is based upon an actual serial rape and murder case set in rural South Korea.  It was mildly entertaining.  It reminded me of IN THE HEAT OF THE NIGHT.  We have three bumbling local cops trying to solve several rape/murders of beautiful young women.  A big-city detective is sent from Seoul to help out.  The locals are not impressed; and make life difficult for him.\n\nThe two local detectives try to beat confessions out of the most handy suspects.  They are not interested in investigating the crimes.  One is older and a little brighter.  The younger one is a blunt object; and short in the thinking department.  Many of their scenes have a comedic element because they are so bumbling and ineffective.  The outsider detective, Seo, begins to track the real killer.\n\nWe never see the killer clearly as he hunts his victims.  We never see the crimes going down.  The crime scenes are surprisingly bland.  Korean action/mystery movies tend to be very graphic and bloody; not so here.\n\nAs more and more victims are murdered, Seo begins to crack.  He eventually loses his professional composure.  The scene is very well done.\n\nThe ending is ambiguous and somewhat unsatisfying.\n\nIt was an OK trip to the flics.",
            "review_date": "2014-07-30",
            "source": "rt"
        },
        {
            "content": "Oh this movie was so intense!",
            "review_date": "2014-07-22",
            "source": "rt"
        },
        {
            "content": "Will easily get to anyone's all time favs. The thrill, the performance, the humanity and the laughs.\nAdd to that recipe.. a true story!",
            "review_date": "2014-07-17",
            "source": "rt"
        },
        {
            "content": "Suspenseful, surprising, and psychologically rich",
            "review_date": "2014-07-01",
            "source": "rt"
        },
        {
            "content": "Loosely based on a true story. There's nothing happy or funny about this movie. It's dark, cold and it fills you with despair. A serial killer is lose on a rural town where two very bad cops are doing everything but catching the killer. Then a policeman from the big city comes to help them & we slowly see his life unravel as his need to catch the killer grows. Do they catch him?? You have to watch it to find out.",
            "review_date": "2014-06-03",
            "source": "rt"
        },
        {
            "content": "Has the Right mood for it.",
            "review_date": "2014-06-01",
            "source": "rt"
        },
        {
            "content": "Like Bong's other recent film \"Mother\" this one also has been made in a great way.\nThere is a perfect opening and a meaningful, heartbreaking ending in this one.",
            "review_date": "2014-05-05",
            "source": "rt"
        },
        {
            "content": "Tuesday, April 22, 2014\r\n\r\n(2003) Memories Of Murder\r\n(In South Korean with English subtitles)\r\nADULT MYSTERY\r\n\r\n At least 75% or more is conventional, and this pass is strictly because of the unconventional last 5 minutes, which is obviously a movie that is based on fact and fiction.  I believe (until otherwise) that the way the murders happen was real, but the practice and the approach into solving those murders isn't convincing at all, since one of the homicide officers who's in charge of the case gradually assaults his suspects without any solid proof, reminiscent of how the Dirty Harry character does in his movies. There's a serial killer around the countryside who goes after young girls with only a small group of people to solve it.  They decide to incorporate someone from the local city to help solve it since his approach is radically different than the homicide detective assigned to.  Some of the inconsistencies also include eyewitnesses and the fact that they're too many coincidences as well as obstacles stacked up against them into solving them since the unit is insufficiently funded by it's gov't. \r\n\r\n2.5 out of 4 stars",
            "review_date": "2014-04-22",
            "source": "rt"
        },
        {
            "content": "Was much impressed with Joon-ho Bong's Snowpiercer, now I'm checking out his other earlier films such as this. Joon-ho Bong's cinematography has always been magnificent including this film, love the scenes and his shots. Memories of murder may have been based on Hwaseong serial killer but \tJoon-ho Bong still treats the story with some dark comedy which adds to the realism of the story. Song Kang-ho's performance is lovable as always.",
            "review_date": "2014-04-06",
            "source": "rt"
        },
        {
            "content": "Fantastic film. Some exceptional dark humor throughout.",
            "review_date": "2014-04-06",
            "source": "rt"
        },
        {
            "content": "Memories of Murder [Korea, 2003] Smart from start to finish. 10/10",
            "review_date": "2014-04-04",
            "source": "rt"
        },
        {
            "content": "A masterpiece of film making, even 11 years later it still stands up. Subtle, nuanced, human, incredibly acting through-out and beautifully filmed. A psychological thriller laced with humour and a really solid character study, and artfully done. Really good.",
            "review_date": "2014-03-21",
            "source": "rt"
        },
        {
            "content": "Some dark humour with wonderful cinematography",
            "review_date": "2014-03-11",
            "source": "rt"
        },
        {
            "content": "The way the director sucker punched you every time you let your guard down is evidence of his genius!",
            "review_date": "2014-03-06",
            "source": "rt"
        },
        {
            "content": "Possibly the best police procedural ever made. Very gripping and tense, despite having plenty of room for black humour. A modern classic.",
            "review_date": "2014-02-27",
            "source": "rt"
        },
        {
            "content": "The Best-Thiller Mystery of Korean Film amd The Ending is So Cool.",
            "review_date": "2014-02-22",
            "source": "rt"
        },
        {
            "content": "It felt like Doubt, but with murder. Absolutely fascinating. So few movies can pull off that ambiguity so well.",
            "review_date": "2014-02-11",
            "source": "rt"
        },
        {
            "content": "Interesting for sure, but far from satisfying.",
            "review_date": "2014-02-07",
            "source": "rt"
        },
        {
            "content": "The Koreans have a better grip on noir these days than the Americans do. Memories of Murder is the true story of South Korea's most prolific serial killer, whose horrific antics brought the corruption of the 1980s Korean police to light. Far from pleasant viewing, Joon-ho Bong's direction is pure brilliance, and makes this pit filth and sadism an unbearably tense mystery,",
            "review_date": "2014-01-25",
            "source": "rt"
        },
        {
            "content": "Very gripping story. The few chase scenes show a lot of promise in this director's ability to produce an action thriller, but the focus here was more of a mystery case study on the mind and actions of a killer and a corrupt detective team working towards legitimacy in order to stop the ruthless killer. Due to the effective writing and directing of this true story, it will leave you frustrated at times, relating to the frustration of the detectives.",
            "review_date": "2014-01-16",
            "source": "rt"
        },
        {
            "content": "It's just perfect! The acting, the plot, the ending, the setting & cinematography, and even the music!  For me, it's flawless.",
            "review_date": "2014-01-02",
            "source": "rt"
        },
        {
            "content": "One of Asia's finest serial killer films; brilliantly written and acted, this is first class cinema.",
            "review_date": "2013-12-28",
            "source": "rt"
        },
        {
            "content": "Fantastic film! I was amazed by how great it was. Very emotional, great acting, and a great story! One of my favorites.",
            "review_date": "2013-12-24",
            "source": "rt"
        },
        {
            "content": "An exceptional master crime thriller.Two Thumbs Way Up. Phenomenal & an Outstanding Screenplay.",
            "review_date": "2013-12-21",
            "source": "rt"
        },
        {
            "content": "a well crafted crime drama",
            "review_date": "2013-12-11",
            "source": "rt"
        },
        {
            "content": "Thrilling, smart and entertaining a lot. A good example of crime thriller combined with comedy. Every characters are developed greatly. They know when to be serious while some jokes are among them. Based on a true story things made this movie is so unique and tense. Stunning movie came from Bong Joon Ho's early carreers. This is on the top of my list as the best korean movie ever made.",
            "review_date": "2013-11-16",
            "source": "rt"
        },
        {
            "content": "For those who've seen Zodiac, viewers will instantly find similarities between the films (as well as the actual murders they're based on).  This story is skillfully executed.  You have the drama and tension/frustration of an unresolved murder case, and you sympathize with the detectives and victims.  At the same time, humor is seamlessly woven into the script, and unexpectedly the movie can be funny as well.  That's difficult to do.",
            "review_date": "2013-11-15",
            "source": "rt"
        },
        {
            "content": "An exceptional detective story denouncing the inadequacy of the South Korean's authorities during the regime but at the same time is fun thanks to many moments of comedy perfectly melted inside. The superb direction and excellent acting make compelling and enjoyable every moment of this movie. A relentless pace and an \t\nimpressive ending. One of the best ever.",
            "review_date": "2013-09-29",
            "source": "rt"
        },
        {
            "content": "A korean testament to how real serial killings should be adapted to screenplay",
            "review_date": "2013-09-26",
            "source": "rt"
        },
        {
            "content": "The definitive Korean film that not only put Director Bong on my 'to watch' map, but also rekindle my faith in Korean cinema.",
            "review_date": "2013-09-21",
            "source": "rt"
        },
        {
            "content": "Disturbing, dramatic, humorous, thrilling. One of the most interesting serial killer movies I've seen, up there with Zodiac.",
            "review_date": "2013-09-18",
            "source": "rt"
        },
        {
            "content": "Pure Awesome-ness!!!",
            "review_date": "2013-08-11",
            "source": "rt"
        },
        {
            "content": "A murder chronicle that engulfs you into its own mystique. A richly layered film with great cinematic devices, satirical and distant at first, desperate, elusive and suspenseful by the end.",
            "review_date": "2013-08-07",
            "source": "rt"
        },
        {
            "content": "My favorite Korean movie. Song Kang-ho masterfully displays the dark drama and hilarious physical comedy that I believe are the true strengths of Korean cinema. Though the based-on-the-true-story plot is gripping, strange, and haunting, the cast makes the smallest scenes (such as eating dinner or smoking a cigarette) just as compelling.",
            "review_date": "2013-08-05",
            "source": "rt"
        },
        {
            "content": "A black comedy rife with social commentary like Bong Joon-Ho's later work The Host except this one follows a pair of rural South Korean detectives as they search for a murderer attacking only in the rain when a particular song plays. The methodical nature however begins to be overturned when logic and the circumstantial evidence begins to distort. The comedy soon sheds away and we see the true characters remain. First time rating: 7.6/10",
            "review_date": "2013-08-04",
            "source": "rt"
        },
        {
            "content": "The true story about the hunt for South Korea's first serial killer who terrorizes a small town, set in the backdrop of  abrutal military dictaorship. The local cops have no finances and are just interested in picking up anyone and beating a confession out of them. This is until a young City cop arrives and the hunt for the killer intensifies. Disturbing, thrilling and actually very funny in parts.",
            "review_date": "2013-07-30",
            "source": "rt"
        },
        {
            "content": "Though it proficiently tried all effort to showcase the desperation of a never-solved crime, the evolution of characters, the obscure comedy, the clear-cut abuse on misogyny, the color and light used for the background, the discomposure of a bothersome music, are all a treat to any ordinary viewer. On progress of the brilliant narration, a viewer would develop an inventive sense that the case was really going very close to an end. This is a great asset to the Asian Cinema.",
            "review_date": "2013-07-30",
            "source": "rt"
        },
        {
            "content": "Best korean crime movie",
            "review_date": "2013-07-24",
            "source": "rt"
        },
        {
            "content": "another great Korean movie in my Watchlist!",
            "review_date": "2013-07-15",
            "source": "rt"
        },
        {
            "content": "Please misterious killer, kill me before the end of the movie!",
            "review_date": "2013-07-15",
            "source": "rt"
        },
        {
            "content": "MEMORIES OF MURDER\nMAY CONTAIN SPOILERS\n\nBong Joon-ho's \"Memories of Murder\" disappoints; I expected good things out of this one. It's a South Korean film based on the first actual recordings of serial murders in the country. There are great films that ask questions rather than giving answers and it works; \"Memories of Murder,\" to me is a film that would have worked better if it gave answers instead of asking questions, it deprived me of a satisfying experience. I don't think I am spoiling much because the film's opening subtitles already tell you it's based on \"an unresolved criminal investigation.\" It has three major flaws in its story: it takes too long for the detectives to revisit the mentally challenged boy regarding a murder, to me it was obvious. Also since it is believed that the serial killer murders women who are wearing red on rainy nights, why were the last two victims not wearing red? The first, older woman leaves her red jacket at home and for the latter of the two it did not rain. I am guessing the detectives' information was false regarding this killer, but I still consider it a flaw because these amending observations are never mentioned by the detectives or anyone else. The last issue I have is of one of the detective's wife crossing paths with a girl that is going to be murdered; why didn't the wife mention this to her husband? Throughout the film we see the husband and wife talk to each other about various things regarding his work, about suspects and what not; why don't they mention this to each other? I also found the investigations to be tiresome where the detectives beat up the suspects and it's also somewhat predictable.\n\nThe director is able to build suspense and its actors provide good performances, especially Song Kang-ho as detective Park. It also can be quite funny at times. Even with its flaws and it eventually faltering, it still is an enjoyable crime-drama, especially the chase scene. I see where the director was going with this but to me the point was not clearly informed.\n\nP.S. How stupid are these women to be alone so late at night? Couldn't they find any other means to reach their destination? I found it baffling, one or two in particular obviously were aware that there are killings taking place.",
            "review_date": "2013-07-06",
            "source": "rt"
        },
        {
            "content": "Bong Joon-Ho's style is incredibly refreshing.",
            "review_date": "2013-07-01",
            "source": "rt"
        },
        {
            "content": "One of the best murder mystery films of all time! Based on a true story and an absolute must see!",
            "review_date": "2013-06-12",
            "source": "rt"
        },
        {
            "content": "Joon-ho Bong shows subtle, difficult to pin-down angles in storytelling, which allows him to create psychologically rich characters, illuminate a tense plot, all the while flashing moments of humor/satire while remaining deeply visceral.",
            "review_date": "2013-05-17",
            "source": "rt"
        },
        {
            "content": "Memories of Murder is a brilliantly funny, yet, complex film. Its satirical tone and its willingness to make jabs at its characters creates a sense of affection towards them, elevating it above most detective films. Memories of Murder is filled with rich insights into the intricate difficulties of detective work and the subtle truths of human relationships (as well as the human propensity to search for an ever-elusive truth). Furthermore, the cinematography and the soundtrack are nothing short of fantastic. Along with Oldboy, Memories of Murder is Korean cinema at its finest",
            "review_date": "2013-05-09",
            "source": "rt"
        },
        {
            "content": "When you are watching a South Korean film, expect to get unconventional! an excellent thriller based on the first known serial killings in Korea.. Dark movie! Killer stuff!",
            "review_date": "2013-05-06",
            "source": "rt"
        },
        {
            "content": "This true story of Korea's first ever serial killer subverts every expectation you might have and is equal parts thrilling, hilarious and heartbreaking",
            "review_date": "2013-05-05",
            "source": "rt"
        },
        {
            "content": "This would've been a much better movie had it not been a taekwondo vehicle for that one guy to keep kicking everyone.",
            "review_date": "2013-04-23",
            "source": "rt"
        },
        {
            "content": "A group of detectives on the hunt for a serial killer. What makes this one stand out from similar thrillers is the strange dichotomy of the heroes. You like these guys and want them to win, even if they're not the brightest bunch, and even if their investigation methods often involve planting evidence, torturing suspects, or trying to pin the blame on the local handicapped kid. Despite the sombre tone, much of this stuff is played for laughs, at least until the detectives' very human shortcomings become more a tragedy than the actual killings.\r\n\r\n--7.0/10--",
            "review_date": "2013-04-22",
            "source": "rt"
        },
        {
            "content": "Absolutely brilliant every way.  Solid performances and good screenplay.  could be unsatisfying but that comes from the fact that this based on true events and when u know that you should not have a problem with accepting every part of it , and it makes the film stronger and more striking.",
            "review_date": "2013-04-14",
            "source": "rt"
        },
        {
            "content": "A brooding crime drama with a surprising comical side to it, Memories of Murder is a work of art that lingers in the mind much like the still unsolved case in which this is based off of.",
            "review_date": "2013-04-13",
            "source": "rt"
        },
        {
            "content": "Inspirada en la historia real del primer asesino en serie de Corea, asesinatos cometidos entre 1986 y 1991...",
            "review_date": "2013-04-13",
            "source": "rt"
        },
        {
            "content": "Vu en VF. Un peu dérouté par cette enquête menée par une équipe d'amateur utilisant la violence sans raison et usant de fausses preuves.",
            "review_date": "2013-04-10",
            "source": "rt"
        },
        {
            "content": "Amidst civil war, an under-manned, under-funded, and unprepared police department are faced with a serial killer. Mindblowing!",
            "review_date": "2013-04-10",
            "source": "rt"
        },
        {
            "content": "Nail biting story of a serial killer. Excellent direction.",
            "review_date": "2013-04-09",
            "source": "rt"
        },
        {
            "content": "Sto krene sa laganom komedijom vrlo se brzo zavuce pod kozu i postane dosta dobar serijskoubojiti triler.",
            "review_date": "2013-04-03",
            "source": "rt"
        },
        {
            "content": "A well crafted elusive thriller with a humanistic touch",
            "review_date": "2013-03-31",
            "source": "rt"
        },
        {
            "content": "I have no problem with subtitles or police procedurals and I do appreciate good cinematography, but I found this movie terminally boring.",
            "review_date": "2013-03-27",
            "source": "rt"
        },
        {
            "content": "I didn't realize until after watching this that it is based on a true event that took place in 1986. That's probably for the better, as I wasn't distracted by knowing that. \nIt's a well made movie, no doubt. Great cinematography, direction, etc. \nStill, I was bothered by one too many things to label it a great movie. Regardless of whether the events actually took place in the manor in which they are presented. \nLike the constant in-fighting by the investigators. The complete ineptness of the police to cordon off the murder sites from the public/reporters. Pretty much the complete ineptness of the police in general, including making up evidence and torturing suspects. Young women repeatedly going off alone in the KNOWN area where the murders were taking place. \nThere's just SO much wrong with this story! Is it for the sake of the movie, or did this stuff actually happen? I have no idea. But I have to approach it from the movie standpoint, and it just doesn't wash.\nIt's STILL a decent entertainment, and gave me a good insight into Korean film-making. It's amazing how different different filmmakers from different countries can present a story.",
            "review_date": "2013-03-24",
            "source": "rt"
        },
        {
            "content": "What A good Thriller korean movie, with a unpredictable ending,,,,two thumbs up....",
            "review_date": "2013-03-09",
            "source": "rt"
        },
        {
            "content": "One of my all time favourite Korean films. A cult classic.",
            "review_date": "2013-03-08",
            "source": "rt"
        },
        {
            "content": "Stunning film, got me hooked to the story from start to finish.\n\nAnother film I watched again, again, the frustration was full on fantastic here.",
            "review_date": "2013-02-10",
            "source": "rt"
        },
        {
            "content": "Truly remarkable camera work along with a great soundtrack and acting are at a base here. It is a crime drama/thriller about a based on real life killer on the loose. The movie has so much intrigue that no matter the lack of action scenes, the viewer will still be glued to the screen. I recommend this movie to be watched in high definition so the viewer can appreciate the scenery as it mesmerizes you with the audio and top notch cinematography that is at hand here. There is an investigation in town about murders that are happening at an alarming rate, but when the detectives can't find the culprit they start scavenging for clues. This guess work leads to some interesting leads that find the main actor struggling for an answer he can't 100 percent put his judgement on. At the end of the movie the viewer is left in one the most captivating ending scenes of all time in my opinion. After the movie is over you are left in a nirvana you must or want to experience again.",
            "review_date": "2013-02-02",
            "source": "rt"
        },
        {
            "content": "Bumbling cops try to foil a brutal serial killer in 1980s South Korea but far too long and winding for my taste though beautifully shot. Ultimately unsatisfying.",
            "review_date": "2013-02-01",
            "source": "rt"
        },
        {
            "content": "If you have not heard of this movie, perhaps you have heard of the director's more popular monster film The Host (perhaps not). Either way, Joon-ho Bong delivers genre films that stray from the beaten path. The Host was a monster movie with a family angle and shots of humor in a story of gruesome circumstances. Memories of Murder is a police procedural with police whose procedures are lacking, with shots of humor in a story of gruesome circumstances. The movie runs a little long, but by the end, accomplishes more than a basic cop story's worth of \"yay we caught the evil guy.\"",
            "review_date": "2013-02-01",
            "source": "rt"
        },
        {
            "content": "An amazing film that took me back to my favorite David Fincher film, \"Zodiac\". The plot is intricate and deliberately paced, stringing the audience along in a sea of suspense and intrigue.",
            "review_date": "2013-01-30",
            "source": "rt"
        },
        {
            "content": "Set in 1986 in a rural village in South Korea the film follows the story of two detectives who are on the search for a serial killer. Set over the space of several years during the political turmoil of the period the film follows the desperate search for the killer and the measures the detectives are willing to take to get their man. Although honoring a serious theme the film's portrayal of its characters and their flaws quickly draw the audience to moments of empathy and humour as we see their morals and beliefs evolve throughout the film.",
            "review_date": "2013-01-25",
            "source": "rt"
        },
        {
            "content": "Incisively reflects the cliff that resides in a policeman/detective's mind and how evidence can be lost and absolutely nothing can become all the evidence.",
            "review_date": "2013-01-06",
            "source": "rt"
        },
        {
            "content": "Don't get frustrated just watch it. (89%)",
            "review_date": "2012-12-29",
            "source": "rt"
        },
        {
            "content": "Seems strange that a thriller about such a tough and difficult topic would elicit so much laughter when watching, but its only a testament to the film's narrative and visual power. The laughter however doesn't come from a purely comedic place, but more from an absurdest and surreal which balances the pure darkness of the crimes rather beautifully one might say. The direction is rich in style and content and guides the story and characters through this journey with feeling and purpose, while the story is wonderfully written and presented, with only a couple of scenes here and there that are a tad overlong. Not much else to say really, and I definitely recommend this type of film, as opposed to the paint-by-numbers thrillers that Hollywood sometimes churns out when they are afraid that the audience might get confused, or god forbid talk about the film's meaning afterwards.",
            "review_date": "2012-12-17",
            "source": "rt"
        },
        {
            "content": "A strongly acted, darkly humorous and ultimately gloomy film.",
            "review_date": "2012-12-10",
            "source": "rt"
        },
        {
            "content": "MEMORIES OF MURDER: devilishly intriguing plot, fantastic cinematography, great acting, and an ending that leaves you dazzled.",
            "review_date": "2012-12-09",
            "source": "rt"
        },
        {
            "content": "A slow burn film that draws you in by not only the investigative tale but also the characterizations of the cops involved.  A nice balance of mystery, suspense and some comedy make this film well worth watching.",
            "review_date": "2012-12-08",
            "source": "rt"
        },
        {
            "content": "A really solid, well-crafted mystery thriller. All the acting is great, and Kang-ho Song in particular shows how versatile he is (compare it to his other films). Full of grey areas, of menace, tension, frustration and even comedy (my favourite scene - the one in the field at night with the killer making himself known - is full of all these). Having said that, I don't think it's the best film ever made, and yet a lot of people are keen to peddle that sentiment. It's very good, but, you know, most Korean films are these days.",
            "review_date": "2012-11-11",
            "source": "rt"
        },
        {
            "content": "Murder plot with underground humor, best korean movie after all",
            "review_date": "2012-11-02",
            "source": "rt"
        },
        {
            "content": "Typically efficient Korean filmmaking. Amazing cinematography, amazing score, amazing direction. A little long, if anything...",
            "review_date": "2012-10-28",
            "source": "rt"
        },
        {
            "content": "This is a truly exceptional film, with Joon-ho Bong slowly becoming one of the faces of Korean cinema for international audiences.",
            "review_date": "2012-10-14",
            "source": "rt"
        },
        {
            "content": "no , i don't feel the same way as you do guys. Sorry, but this movie is slow plot and blame other people without any clear reasons. WHO'S THE KILLER? THE MEMORIES OF MURDER too! That's freaking me out to watch this.",
            "review_date": "2012-10-12",
            "source": "rt"
        },
        {
            "content": "Top-notch stuff... Among the best Korean films!",
            "review_date": "2012-09-28",
            "source": "rt"
        },
        {
            "content": "Korean movie rocks when it comes to beating person.. I really felt the realistic part in it. huhuhu",
            "review_date": "2012-09-15",
            "source": "rt"
        },
        {
            "content": "A great thriller with some funny stuff.\n\nCaptiving story, caracters playing very well.",
            "review_date": "2012-09-01",
            "source": "rt"
        },
        {
            "content": "a bit weird and slow but a very good film that keeps you guessing",
            "review_date": "2012-08-17",
            "source": "rt"
        },
        {
            "content": "very well done. unique storytelling supported by a strong cast. No doubt Korean film makers are one of the best when it comes on mystery/crime detective films. one of the best crime/detective film I've ever seen",
            "review_date": "2012-08-14",
            "source": "rt"
        },
        {
            "content": "the daily personal and political insights that are drawn from the behaviors of all involved make this long film a series of vignettes that show how families, police, workers and the public act - with an undertow of violence and incompetence. Joon Ho-bong is a remarkable and very individual director and should be much more widely seen than he is.",
            "review_date": "2012-08-05",
            "source": "rt"
        },
        {
            "content": "http://filmreviewsnsuch.blogspot.com/2012/08/memories-of-murder.html",
            "review_date": "2012-08-05",
            "source": "rt"
        },
        {
            "content": "A beautifully crafted movie with the setting, background, ambience, characters, and the plot sinking in with every passing moment. Loved every minute of it and was impressed, as expected, by song kang ho's acting.",
            "review_date": "2012-07-16",
            "source": "rt"
        },
        {
            "content": "Absolutely Amazing Movie with a Kick Ass Ending !!!",
            "review_date": "2012-07-10",
            "source": "rt"
        },
        {
            "content": "Very impressive and intriguing film. The ending is uncertain - would have helped if the ending was tighter but therein is the realism. Not all cases are solved in real life. Must watch.",
            "review_date": "2012-07-08",
            "source": "rt"
        },
        {
            "content": "When you are watching a South Korean film, expect the unexpected. Memories of Murder is suspenseful, surprising, and psychologically rich!",
            "review_date": "2012-07-04",
            "source": "rt"
        },
        {
            "content": "Una envolvente pelÃ­cula de investigaciÃ³n. Llena de suspenso, y unas gotas de humor. No se debe dejar pasar.",
            "review_date": "2012-07-02",
            "source": "rt"
        },
        {
            "content": "Haunting & Disturbing.& Loved It..",
            "review_date": "2012-06-29",
            "source": "rt"
        },
        {
            "content": "Una de las mejores pelicula simples de la historia del cine",
            "review_date": "2012-06-20",
            "source": "rt"
        },
        {
            "content": "paced well, and gives good humour and depth with the characters. I particularly liked the ending because it leaves you with confusing and ease, and if you know its a true story maybe even fear. a strong 8/10",
            "review_date": "2012-06-08",
            "source": "rt"
        },
        {
            "content": "South-Korean Cinema is one of those areas which I have yet to completely explore. Thanks to the Brutal thrilling Korean classic Oldboy, came out in 2003, I got highly excited about exploring the Korean world continuing my journey with this incredible film: Memories of Murder. \n\nMemories of Murder, based on a true story, is a crime thriller set in the late 1980's. Two rural cops and a special detective from Seoul try hard to search for the killer who ruthlessly rapes women, especially on rainy nights a factor that probably excites him. The film shows us the usual cat-and-mouse chase. Though it's not an experience that cliched thrillers gives, just running around here and there...\n\nWhat mostly bothers me are the subtitles in any foreign movie. The way you have to look down every time while missing all the action even on a small scale might distract you. Memories of Murder is one of those foreign films where the above factor just doesn't completely apply. Some of the best scenes of this film happen in silence. There are truly great examples of camera work in this film that includes the dry but powerful cinematography, few but effective Steadicam shots and of course the direction. Like in one scene when the lead Detective comes to inspect the first crime scene (also filmed in one continuous shot), they find a shoe print nearby on a small road as an evidence. Suddenly, a tractor comes out of nowhere and ignoring the Detective's cries (\"No Stop!\") it goes over the evidence smudging the entire print. This is one particular scenario which was shot with such realism that you connect yourself with the movie and become a part of it. I don't care how simple or complex the scenes are, the most vital property of any good cinema is that it should allow you to become a part of that experience. Even sounds are important in this film. Can't explain that in detail but you will notice it once you have seen it. The acting too is superb, as always in any great film.\n\nMemories of Murder though doesn't concentrate much on the murders, it kind of gives more attention to the emotional aspects of the characters involved the case. Hence, the name. When you say Memories of Murder it refers not only to the ones solving the case but also the ones who were the victim of this brutality. The film truly goes more beyond the thriller part and at the conclusion of the film, no one will deny that they had watched something different. The downside is that it takes little patience to watch the film and the film's ending is not that easy to take in. Still, I am highly impressed by the different style of film-making of South-Koreans. \n\nIn conclusion, Memories of Murder is a realistic document of the incident, not like some Hollywood flicks that put in some spice like an exit line just after killing someone or the hero looking walking away from an explosion. If you are a good lover of cinema, this will hardly disappoint you. There is one thing I have learned so far in South-Korean thrillers: Always expect the unexpected. Just in case of this film, it comes out in a very subtle manner...\n\nVisit my facebook page: https://www.facebook.com/filmsthemostbeautifulart",
            "review_date": "2012-06-04",
            "source": "rt"
        },
        {
            "content": "This was excellent.  I can see what Tarantino saw in it.  It deals with a crime story with some black comedy, and a good sense of emotional weight, and features great acting. It depicts the police, and crime unit much more realistically than is depicted in similar American crime stories.",
            "review_date": "2012-05-31",
            "source": "rt"
        },
        {
            "content": "The obvious comparison here is with Zodiac, being similar in tone and their ambiguous endings.  Regardless, this is a much better film.  Where Fincher saw fit to taper off and let the audience stew in their own suspicions, this film instead takes it further to a powerful conclusion, accomplishing more.",
            "review_date": "2012-05-24",
            "source": "rt"
        },
        {
            "content": "\"Look in my eyes...\" - Detective Park Doo-man\n\nMemories of a murder is such an amazing policier and the fact that it's based on actual events makes it more disturbing and shocking. Bong found the perfect balance between his fascination with the Korean countryside scenery and the disturbance that the film actually needed while setting a blurry backdrop in the background of Korea's political status at the time. Great performance by Sang-Kyung Kim and Kim Rwe-ha.",
            "review_date": "2012-05-11",
            "source": "rt"
        },
        {
            "content": "Incredible movie. Highly recommended.",
            "review_date": "2012-05-09",
            "source": "rt"
        },
        {
            "content": "As good as advertised.  Ranks up among the best serial killer movies I've seen.  Has resemblances to Zodiac in tone, theme and the specifics of the case. The final 20 minutes are absolutely haunting.   Koreans are making as good of films as any part of the world right now.",
            "review_date": "2012-05-06",
            "source": "rt"
        },
        {
            "content": "Wish Bollywood could produce something so simple, engaging and brilliant in all respects!!",
            "review_date": "2012-05-02",
            "source": "rt"
        },
        {
            "content": "Easily one of the best Korean movies I've seen so far. It takes you one a Seven-like journey with many twists and turns. Love it.",
            "review_date": "2012-05-02",
            "source": "rt"
        },
        {
            "content": "~ Memories Of Murder\n\nHuaaaa....,A great opening and....., heartbreaking ending\n\nendingnya sedikit mengingatkan saya ama ending Zodiac-nya David Fincher ,penonton disuruh berasumsi sendiri apakah pembunuhnya orang itu apa gak, tapi versi Fincher masih lebih gelap dr pd versi Joon-ho Bong yang sedkit menyisipkan komedi dalam filmnya .\n\n8/10",
            "review_date": "2012-04-25",
            "source": "rt"
        },
        {
            "content": "Y U END THE WAY U END?!",
            "review_date": "2012-04-13",
            "source": "rt"
        },
        {
            "content": "Hands down, the most complex Asian crime movie of 00's I've seen. \"Salinui Chueok\" is an addictive paraphrase of Fincher's \"Se7en\".",
            "review_date": "2012-04-08",
            "source": "rt"
        },
        {
            "content": "If you love detective crime thrillers.. Then Without any doubt go for this.. Absolutely brilliant.. !!! no words to explain.. :)",
            "review_date": "2012-04-03",
            "source": "rt"
        },
        {
            "content": "Bong memories of murder is an excellent thriller.",
            "review_date": "2012-03-23",
            "source": "rt"
        },
        {
            "content": "Otro gran regalo de mi amigo Carlos Vera, una exhibiciÃ³n de policÃ­as reales, con flaquezas reales, procedimientos reales en tiempos de dictadura y resultados reales. Nada resulta fÃ¡cil y el rompecabezas no cuadra. Fenomenal",
            "review_date": "2012-03-19",
            "source": "rt"
        },
        {
            "content": "Very strong. Totally engrossing. I'd say, even though it's different, that it's on par with The Silence of the Lambs and Seven.",
            "review_date": "2012-03-18",
            "source": "rt"
        },
        {
            "content": "Peliculas sobre asesinos en serie son muy comunes pero cintas tan envolventes como \"Memories of Murder\" son raras; rara porque nos adentra a una invesigacion llena de suposiciones (algunas sumamente absurdas) y la frustracion de un caso que nunca fue resuelto (aparentemente basado en una historia real).\n\"Memories of Murder\" nos introduce a un detective incompetente y a un inspector inteligente, unidos para atrapar a un asesino de mujeres. Sin duda es una excelente propuesta coreana llena de suspenso y humor negro que nos atrapa de principio a fin (y que contiene un excelente climax). Sumamente recomendable.",
            "review_date": "2012-03-11",
            "source": "rt"
        },
        {
            "content": "Me gusto pero debo reconocer q el final me cabreo, pero solo por un gusto personal de concluir las cosas de una manera mas obvia. Posee bastantes toques de un humor negro, una recreacion de la epoca perfecta y muy buena actuacion.",
            "review_date": "2012-03-06",
            "source": "rt"
        },
        {
            "content": "An engaging, intelligent crime film with tremendous cinematography, writing and absolutely terrific acting. Memories of Murder is Joon-ho Bong at his very best.",
            "review_date": "2012-02-26",
            "source": "rt"
        },
        {
            "content": "Very, very slow but brillaint nonetheless. This excellent Korean crime drama has you gripped by the end. If you love crime mystery then you will love this.",
            "review_date": "2012-02-23",
            "source": "rt"
        },
        {
            "content": "It's a good movie but not one i would be watching over and over again. It's suppose to feel dated - it's set in 1986, so no mobile phones or DNA. Congrats on the lack of blood and for not actually showing the girls being murdered - Quite right, this is about a criminal investigation not the latest slasher/horror. The way one policeman kicked around his suspect didn't surprise or bother me in the least - we all know that sort of thing goes on. Apart from that the film wasn't really violent. I didn't mind the ending (i won't give it away) and most of it was interesting without being anything special. The photography, especially at the beginning, gave the movie something different from the usual cop stuff - but i i didn't notice the music apart from a dramatic chase scene. All in all it's above average....although i might have been a little generous giving it a good three stars.",
            "review_date": "2012-02-14",
            "source": "rt"
        },
        {
            "content": "Excellent work securing the crime scenes.",
            "review_date": "2012-02-11",
            "source": "rt"
        },
        {
            "content": "A particularly strong second-half and a great cast of characters makes \"Memories of Murder\" well worth your while.",
            "review_date": "2012-02-06",
            "source": "rt"
        },
        {
            "content": "I may very well be the only person in the entire world who is not in love with this film, please bear this in mind if you read on.\n\nThe story of inane, underfunded detectives in a rural town in South Korea and their investigation of serial sexual assaults and murders committed by someone whom has proved faultless and far too elusive for small-town detectives to catch. This is the backdrop for what the movie really is, which is a lecture on the horrors of certainty, and the cruelness of doubt.\n\nI won't go into it, in an effort to avoid filling my review with the usual myriad spoilers. Instead, I'd like to focus on the superficial layer- the story and the way in which we are narrated to. Often in an attempt to build character, the story will plough off in tangential directions- this technique normally works for me, but here left me a little drowsy. The characters weren't real for me, never once did the film seem to be too fussed whether or not you particularly care about the central cast, so why bother wasting time with these distractions? What I'm saying is that the film is far from taut, quite in fact, overly long would not be an understatement.\n\nThe acting here is great, and the characters are filled with personality by their very capable actors- speaking of which, you really do need to love Korean actors and their willingness to literally throw themselves into their parts- all of whom do a great job. Unfortunately, however, they're put in the difficult position of performing a tricky balancing act. Joon-ho Bong is asking them to juggle the severely macabre with quirky, almost slapstick humour. Not an easy feat by far, and not amusing for myself in the slightest. Perhaps the idea was to add some relief for the viewer from the lazy plot? \n\nThe biggest crime committed here is to waste such a talented cast and beautiful cinematography and direction on such a dull story. Conventional is perhaps not enough in describing how prosaic the story is. A certain adjective must be applied, but which is suitably strong I'm not certain. Rigidly conventional, perhaps? One couldn't help but compare the film to the likes of Seven, etc. And yes, in the long run, Memories of Murder does indeed have more value, but I know which I'd rather watch again. Strangely, when I found myself comparing Memories of Murder to other films of the genre, I found that my head wouldn't drift to other films, but in fact to television. And how much better certain TV shows were in almost every respect to this film. \n\nQuite in fact, this whole genre has been out-sleuthed by it's televised counterpart. The once bastard child of the visual arts, in it's renaissance, out-classes and out-characterises film to such a level as to almost make this type of tale a vainglorious waste when displayed on the cinema screen. Almost. See, what cinema still has, and will always have over television, is brevity. The ability to make an existential observation, or frame a timeless and endlessly endearing story is somewhat difficult when drafted well over 50-odd hours of footage and script. Well-crafted film is also beautiful- and that is a particular strength of this film. Joon-ho Bong clearly has a special sense when it comes to knowing just how to frame the beautiful Korean countryside; it's pretty glorious here with all it's rustic charm.\n\nThe story though, with all it's twists and it's turns, in the end follows the sign-posts of the genre. There are ups, there are downs, there's a murder, there's a clue, there's a twist, and so on. The Wire captures the intricacies of the reality behind the drug war, The Killing with it's often gruellingly slow pace manages to manifest all of the characters in the show with layers of depth, elevating itself far above the stock crime procedural. What does Memories of Murder do? This is the question I asked myself when determining how I would score it. I found very little to distinguish it from other movies of a similar ilk- up until the end, of course. But, sadly, that just wasn't enough.\n\nThe strengths of 'Memories of Murder' are very much the talented crew, beautiful shots of the Korean countryside, and the lingering sadness it evokes long after the credits roll.\n\nFrankly? I preferred The Chaser.",
            "review_date": "2012-02-03",
            "source": "rt"
        },
        {
            "content": "A beautiful film, part thriller part emotional journey and character drama. This murder mystery film is far from the cliches of Hollywood genre films. Beautiful cinematography. Finally a murder/police film that treats its audience as intelligent and keeps us guessing.",
            "review_date": "2012-02-01",
            "source": "rt"
        },
        {
            "content": "La mejor pelicula sobre asesinatos en serie desde Seven.",
            "review_date": "2012-01-25",
            "source": "rt"
        },
        {
            "content": "Realistic, Dark humor, Best Korean movie that I've ever seen",
            "review_date": "2012-01-14",
            "source": "rt"
        }
    ]
}